{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "This place had a great breakfast chorizo burrito. It was kind of expense for the size of the burrito you got but it was overall a good place. The staff was friendly and even though it was busy, they kept up pretty well.", "author": "Angel R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "Combo of a crunchy taco with ground beef and a carne asada enchilada.\n\nThe meat was cold and grisly and the salsa bar didn't look fresh. In fact it looked watery and recycled.\n\nThe rice was good, but the beans were plain and the enchilada tasted like a microwave TV dinner.\n\nThe taco was a disappointment, hard and greasy.\n\nDefinitely agree with the mid two to three star reviews here.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-18", "description": "Just had a bean, cheese & rice burrito. The best way to tell if the food will be good or not. Well, rice had a commercial flavor, lousy taste. Beans had no flavor tasted flat, not favorable. Beans were at a fast boil, instead of simmering, added to much water while cooking. Charged $6.25 and no cheese. Not authentic mexican.", "author": "Black V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-19", "description": "First time at Caramba Mexican Food today. It's located near the 2nd and Stevenson Muni stop and Flower Power dispensary. My colleagues have eaten here before and had good things to say, so I tried it. My experience was not as positive as theirs. So, when I entered the establishment, I was a bit confused about the prices because on the window there is a menu with all whited out prices. When I got it in, its like most Mexican food establishments where you place your order, they prepare it in front of you and you pay at the end. I ordered a Regular Shrimp Burrito on a spinach wrap and I must say, \"I was not impressed.\" For $11.92 I expect that my burrito to be wrapped tightly. When I unwrapped it from the foil, it basically unrolled and as most people know, it's almost impossible to re-roll \"correctly!\" The shrimp was not seasoned and I had to remind the woman at the counter to give me tortilla chips like she did everyone else. Overall the burrito was edible, but, I'm disappointed I spent roughly $12 on something that wasn't t better than chipotle. I hope you have a better experience than I did.", "author": "Rhett B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-19", "description": "Stopped here to grab a breakfast burrito on the run. It was fast and hit and spot.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Would highly recommend this place if you want quality Mexican food! I've always passed Caramba on my way to work from Market St, but one day I ordered a breakfast burrito from this place and was blown away at how good it was!\n\nUnlike the other breakfast burrito places in the area, Caramba's burritos are super flavorful and also very affordable - they come out to like $5.00 per burrito.\n\nFurther, they accept orders over the phone so you don't have to ever wait there. I know i'll be a repeat customer here when I'm craving a breakfast burrito in the morning.", "author": "James D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "My coworkers recommended this place to me, especially knowing I was a vegetarian. So I came here for a veggie burrito to-go on a Thursday afternoon after prime-time lunch hours. There were only a few people in line, so I had the time to figure out exactly what I wanted.\n\nThe staff was extremely patient and helpful while I still contemplated my choices (I didn't use my time wisely) but I ended up making a beautiful vegetarian burrito. It was hella cheap (like under $7), especially for SF prices.\n\nMy food was good, but not mind-blowing. I think my coworkers had overhyped the food. The beans were a little dry, the veggies were good, the tortilla was a bit soggy from the sour cream. Overall, good place for lunch. It's a little heavy (don't wanna fall into a food coma) but worth it if there's a small line.", "author": "Rahul R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-29", "description": "This is a nice Mexican restaurant near my office. They have a wide range of options for food and meats. My personal favorite is the Super Burrito with Carnitas. The place can get crowded during lunch, but the line moves pretty quickly, much faster than Chipotle.", "author": "Wyatt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-22", "description": "Their soft tacos are legit. size is good and they have 4-5 different kinds salsa. No free chips. This is my 2nd favourite Mexican restaurant in the financial district. First being Tropiseuno.", "author": "Madhu J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-13", "description": "Pretty decent Taqueria.  Actually the one Taqueria I know of in the Financial district.\n\nCan get pretty busy during lunch hour.  Every thing is assembled on a buffet hot line.  \n\nNot really fresh but good.", "author": "jason v."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-18", "description": "I randomly picked Caramba for lunch a couple of days ago as I was in the mood for Mexican food and wanted something close by my place of work. At the peak lunch hour the place was packed and there was a big line, both of which is expected in FiDi so I joined the end.\n\nIn most places the line moves fast, but not the case here. The place felt very loud mostly because the people behind the counter were shouting things to each other. When my turn came I saw a big white sheet of paper calling my name - It had Chicken Chimichanga ($8.99) written on top so I went with that. It was a little bit of a challenge to let the server know that would like the sour cream and guacamole but I'm used to that by now. Again after ordering it was a pretty long wait or at-least it felt like a pretty long wait to get my order to-go. I timed it - from the time I entered to the time I left it was 25 minutes of standing in line and then waiting for the order, which was a whole 10 minutes above my acceptable threshold for lunch at FiDi.\n\nLet's come to the food. I got a decent sized container with a lot of food. The Chimichanga was big enough that even a hearty eater like me would have some left-overs. Here's the catch it was a soggy, rubbery, chewy piece of crap. Obviously this was not made to order but was fried probably early morning and then had been sitting out so that it could be dished out to idiots like me. I should stop doing this to myself i.e. ordering fried food from essentially what are seam table operations. I have to report that the chicken in the Chimichanga was not dry and if I'd got it in a wet burrito I would have probably praised it. Even the rice was not the typical over steamed Mexican rice that you get at Taqueria's. So after discarding the outer soggy tortilla the rest of the contents were very eatable.\n\nPrice wise it was cheap for FiDi. Overall looking at the time it took for the order, the quality of what I got and the distance from my place of work, I'm not really inclined to return here in a hurry. The only Mexican place worth going to in FiDi in my opinion is Tropisueño but that is for another review.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "A great place for handmade breakfast burritos. I get mine with avocado and without a tortilla to make them more keto-friendly. The ladies behind the counter are always friendly and smiling. They have a salsa bar and their \"salsa hot\" is just hot enough to hurt-so-good while keeping you coming back for more.", "author": "Tim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Best breakfast burrito place in the city!!!! I would go here every Friday morning with my coworker and grab a burrito before the day started. You can call it in and then pick it up too. But the staff is extremely nice and the price is amazing. They're on the smaller side too which I like but you can always add extras into it.", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Had the regular shrimp burrito with pinto beans & mild salsa.  It was both filling and tasty.  Will go back for the other options.", "author": "Jim I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Solid, authentic burrito spot on the FiDi/SoMa border. I've had both breakfast and lunch many times. Consistency is key in my eyes, and they always deliver quality ingredients, properly marinated meats, a nice selection of flavorful tortillas you wouldn't normally suspect at this type of joint (spinach, etc.) and they are liberal with portions. Cost is unbeatable, especially for the area. Tasty, freshly made salsas available in a \"salsa bar\" off to the side of the register. Amazingly friendly staff, always the same women which is a good indication of how they run their business. It's great they are open so early on weekdays. My only complaint is that they aren't open later or on the weekends, as I live nearby and would love the convenience and to be able to take guests from out of town here.", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-08", "description": "I like the taste of their breakfast burritos but the workers don't have any sense of basic sanitation. The cashier just handled dirty money, touched screens of the iPad and went directly to roll your burritos. Really? Can you wash your hands first or put on gloves?", "author": "Bonnie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-16", "description": "What is nice about this place is that it is authentic. It is not easy to find real Sopes and they have them. This place is not the cleanest but they do move quickly. Quality and price are good, great for a decent lunch in the City.", "author": "Ken A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-03", "description": "This place is slightly pricey for a hole in the wall Mexican food stop, but the restaurant definitely has an air of authenticity. I appreciated that the cashier honored my Yelp check in even though my purchase was 8.50 after tax and tip rather than before. After debating between the shrimp (9.99) and the grilled chicken (6.99), I ordered a grilled chicken burrito with black beans, rice, and cheese. \n\nThe service was friendly, the restaurant was clean, and the salsa bar was flavorful and well stocked. The green salsa in particular was delicious. My burrito, however, was extremely dry. The chicken was well cooked but not quite juicy, and the beans weren't liquid enough to add flavor to the rice. I think the proportion of rice to everything else was too high, maybe next time I'd ask for less rice and more beans.", "author": "Mili P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-18", "description": "Not going to say much except that I went to Caramba for lunch on a Tuesday afternoon and was left bitterly disappointed. I ordered the Chicken Torta and this was the driest Torta I've ever had in my entire life. \n\nStill giving it a 2 star since I haven't tried the Burrito or the Chimichanga yet, and I'll come back and update my review if they change my opinion.", "author": "Gaurav K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-19", "description": "It's not something I enjoy, giving a bad review. I fully understand the effect that numerous bad reviews can have on a business and I only hope the owners/management can improve their establishment, over time, with constructive criticism.\n\nThe employees I encountered where all very friendly and quick to serve. \n\nMusic matters. I know it's not free but neither is electricity, it's a must. Turn on the radio. Even the detritus known as KOIT is better than dead silence.\n\nThe menu is easy to read and makes ordering very quick and painless. Thank you.\n\nThe Steak quesadilla was my choice for the day and because I was living large I upped the ante and indulged in a side (small portion cup) of, \"sour cream.\" This stuff was so cut it didn't even taste sour and had the consistency of La Victoria Green Mild Salsa. What a nightmare. If I was to guess, it tasted like it was mixed with heavy cream. I didn't even care to ask the price when she asked to add it on so had I been charged a $1 I'd have been none the wiser. Maybe I was. For two table spoons, at the most, for a buck you'd turn a darn good profit for the best sour cream San Francisco has to offer but instead I was given something even Taco Bell couldn't get away with. I must assume they sell it to you at the counter as there isn't enough to put into your quesadilla and still taste it.\n\nTalking about taste one thing that must be present is oil and fat. Let's be honest here friends, we all very well understand that a quesadilla must drip a little. There's got to be juice. No juice. No flavor. When I was given my tiny portion cup of, \"sour cream\" I was also given two small napkins. I thought to my self, \"that isn't going to cut it!\" But you know what? I didn't even touch my second napkin because this poor excuse for a meal didn't drip once. Check out my plate. Pathetic.\n\nPersonal rant: The sign posted behind the counter, facing the customers, stating, \"No cell phones for employees,\" yells out to me that management is disengaged from their staff. I get that people shouldn't be on their phones while getting paid. In fact, I fully support it but put it somewhere else so customers don't have to look at it. I wouldn't take points off for this but it makes me not want to stick around. It doesn't sound like a fun place to work. And it's super quiet, like a library on Sunday morning.\n\nNext!", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "Best Bfast Burritos you can get in Soma and Fidi!", "author": "Rj D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "I have been here once for myself and the other 3 times to order a large order of breakfast burritos for my office, and every time there is a long wait AFTER I have placed my order. \n\nAlthough my manager orders our 40 burritos well in advance, a couple hours before needing to be picked up, we still have to wait about 20-30 minutes before they finish them completely.\n\nWhen I had gone just by myself and ordered right then and there, I also waitied about 10-20 minutes because there were people ahead of me. \n\nThe food itself as always been good! I can usually eat 2.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "Super simple place with delicious food. I went with a friend for breakfast, I had the chorizo & egg burrito sandwich. It was very good, it is a bit small for those who wake up with a big appetite. You can add riz or potatoes to it. That must fill you in.", "author": "Naoufel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "Let's just say you happen to have a night where you're \"over served\"....aka, hungover. \n\nYou make it into work but the hunger from your tummy is next level. The work kitchen might have some staples but you NEED a breakfast burrito. \n\nCaramba is your jam in this situation. They make PERFECT breakfast burritos that will put you in a good place post drinking. Pair them with an Advil and coconut water and your good to go by 10am. \n\nIf you're looking to make friends at work bring Caramba a list of what your coworkers want and they will even write the people's names on the burritos! \n\nThank you Caramba, you have been bringing me back to life since 2010.", "author": "Alison C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-06", "description": "I give it 3 stars because the food was delicious. I went into this place with high hopes since my co-workers kept recommending caramba to me because of their authentic mexican food. Although the food was great, the women that \"helped\" me out were so busy chatting up amongst themselves they ended up messing up my order. I asked for no sour cream many times and it seemed like they were ignoring me. I get my burrito and, you guessed it! sour cream all over the burrito. I didn't have time to wait for another so I left with the incorrect order.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "$3 - $5 authentic breakfast burritos in the financial district! Is there much more that needs to be said??\n\nPro Tip: Get in there before 8am or the line will be out of control. However, I'm not above waiting in a line out the door for these burrito babies.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "Quick speedy service and average prices (~$10 for a burrito.) convenient location in soma but inconveniently placed menu. \n\nCall me old fashioned, but I think tortilla chips should never cost extra. \n\nIt'll do if you need a quick lunch. I had the regular chicken burrito and it wasn't too dry or soggy, and definitely was heavy on onions. Good, but it's not even close competition to being the best burrito in the city.", "author": "Trevor B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "Yum! Right around the corner from my office and the perfect place for a quick, basically homemade breakfast. Super sweet staff. No frills. Cheap and fast.", "author": "Alit E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "Hiiii!!\n\nI love this place! It's open for breakfast, lunch and dinner and is pretty much the go to for my entire office.  The food is delicious, they have a groovy salsa bar, and inexpensive.  The quality is great, portions huge and staff very friendly, they always remember your order and are super fast.  \n\nI guess a couple of things stands out about Caramba, you can get everything and the food is damn tasty.  So you can order everything from a torts to a chile relleno to a burrito (mojado) here and it is good.  Everything is cooked to order and from cold to hot and so is fresh tasting.\n\nThe staff are also friendly, fast, efficient and experienced.  Again, prices are very reasonable for the FIDi.\n\nThanks for reviewing, LET'S EAT!!", "author": "Brandon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "Amazing fast service ; friendly staff ; not your typical SOMA burrito spot. \n\nTry their Carnitas !! muy bueno", "author": "Marcus K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-23", "description": "i ate a super chicken burrito here this week.  beans, rice, salsa, cheese, guacamole and tortilla.  i'm come here often before.  it's good, a bit pricey but so is everything in the area.  salsa always taste good, and you have a selection of different kind.  i havent tried anything except for the chicken burritos and chips.", "author": "Richard M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "Caramba always hits the spot! 2 blocks away from my work and the line goes by quick. So far haven't had issues with quality; they have been consistent with their food which is great for a quick go-to lunch spot during the work week.\n\nOne bad thing I can see some folks have issues with is their line; there's no specific order. If the lady behind the counter 2 people ahead of you becomes free and youre the next available person, you jump ahead 2 people. So the whole thing can get confusing if you don't pay attention. \n\nOverall, delicious.", "author": "Robbie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-07", "description": "We just beat the crowd.  I think it was just about noon.  A bit overwhelmed at the options.  But I was with a friend who liked the place and I just followed her lead.\nShe had a special. I had the shrimp... Something's. I think the special was better. It was a steak thing. But lots of veggies with my shrimp \nIt was good. If you're in the neighborhood it's worth popping in. Good prices and friendly folks. Lots of drinks to choose. Huh. Not sure why that stands out but it does.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Amazing Food! Amazing Service! Since I started working here in San Francisco I've came here 3 times and yet never left unsatisfied. Though the prices are alil high for whole in the wall but you get exactly what you pay for. I will be a regular here.", "author": "Dominic A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "This place has a long line, but also a better than market-average burrito. Just a tip - know what you want to order before you get here because the menu is high above the line against the wall, and is not very legible from a distance. Also, get here before noon unless you want to wait for fifteen minutes. These guys are quick at turning burritos over and everyone seems at least satisfied, or satisfied enough to come back regularly. Is it the best burrito in San Francisco? No, but that's a subjective decision for you to make on your own.", "author": "Luis P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "This is one of my favorite Mexican spots in the area. Prices are cheap (I generally walk out spending approximately $10) and the food portions are very large. The best thing on the menu in my opinion is the steak chimichanga folllowed by the carnitas California burrito and carnitas super burrito. Definitely give this hole in the wall restaurant a go.", "author": "Sierra L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "One of the best places to grab a cheap breakfast burrito or a hearty lunch. They are very quick and efficient so you never have to wait long on line to order or receive your food. Everything here is great, and they accept cards!", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "Love this place! Just wish they were open during nights and weekends since I live a block away!\n\nVery friendly staff.", "author": "Barry B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-12", "description": "Decent sized super burrito containing both carne asada and al pastor, let me break down the likes and the dislikes of this spot close to the training classes I have on new montgomery.\n\nfound on 78 2nd st in SF fairly easy to find if you are walking, it is a little dim inside even though there is lighting on the inside, choices are listed on the far left when you walk in for lunch if you are ordering breakfast there is a separate line in the middle a little to the right. The sauces on the right that are offered seemed a tad slim, mild green sauce for your chips, salsa was emptied out, and the red sauce was also fairly low, it seemed the spicier dark red sauce was the only thing that had plenty to go around mind you it was 11:45am so the lines have not started yet. \n\nThe ordering process it seems they have organized and down pat, walk in, look up order move to the right to pay, get some sauces if there are any available for your chips, no need looking for spoons they only offer forks and knives\n\nI sampled there super burrito with carne asada (steak diced) and al pastor (seasoned pork), the burrito included, latin reddish hued rice, refried beans if not black beans are offered by request, shredded cheese also offered, salsa, sourcream, gauc, mild or hot sauce offered by request and wrapped in a flour tortilla from what I could taste. Portion wise it was decent size enough to get you full but not enough to put you in a coma, the carne asada was slightly salted the al pastor was better seasoned from what I could taste, the mixture of rice, refried beans, sour cream and gauc made it difficult for you to decipher what you were biting down on, but as far as I could tell it was a decent burrito, the was juicy, the sauces found its way out through small ruptures in the tortilla  where you would bite down some sections had no where of moving so ruptures do occur bleeding out all the sauce, get napkins you will need them, unless you like licking your fingers then don't bother. It was not the best burrito I have every had but it was better then average, portion wise good, taste wise on the meats seems they need a tad more flavoring but when meshed all together in the burrito, everything meshed just right.\n\nThere are other options they offer like nacho fries, or fries buried in everything you put on nachos, I passed on some of these options, I did not want to be in a coma headed back to work, it is good to know they are offered though\n\nWash everything down with a cup of their horcata (made from ground almonds, sesame seeds, rice, barley or tigernuts) honestly it I thought it was just made from ground rice, milk and sugar hahha always refreshing if you don't get the bottom of the tub, here is precupped and ready to be distributed.\n\nIf you are in the area, this place is decent, not to get you in a coma but enough to make you snore maybe just a little then 1 hour after consuming, be glad to come back and try more of their meat options\n\nburrito *** decent portion, decent flavor on their super burritos if the meat falls out and was not hit by the gauc, or sourcream it is still tender, not super juicy and lightly salted (carne asada) the al pastor was well seasoned\nprice $ burrito and horcata just over the $10 mark\nservice **** quick friendly staff\nambiance *** looks older inside, tight fit, small tables, shared by all patrons can sit up to 6 people per table", "author": "Clarence A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "After much thought, careful consideration, many hollow promises and many failed attempts, I have finally found a \"go to taqueria\" in downtown SF. I have worked in Financial District for several years and I have been consistently underwhelmed with every burrito place I have gone. \n\nFinally I have found my spot. Caramba is a no-nonsense taqueria style Mexican joint. You're not going to find tre-sheik burrito/taco concoctions, but if you want a solid burrito, give them a go. They are very efficient, even with long lines you won't be waiting for more than 5 minutes max. Also, they are open for breakfast and they have the best breakfast burritos I have ever had! There's another taco place across the street and Caramba blows them out of the water. \n\nDoesn't look like much from the outside, but don't let the innocuous black banner fool you. If you're a burrito/taqueria lover, it's the best in all of Financial District/SOMA IMO.", "author": "Brett L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "Good food, good price. Not a fancy, but you have food that you can say Mexican food, compared to other fancy Mexican restaurants in the city. Try the Chimichanga or \"carne asada\".", "author": "Paulo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Hands down favorite burrito in San Francisco. I know that's a bold claim, but Caramba is a hidden gem. In particular, Caramba has delicious super burritos, house made salsas and  breakfast burritos. Great breakfast/lunch spot in FiDi!", "author": "Al N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-28", "description": "Popped in for lunch and had the chicken super burrito with black beans. I liked it, more flavor and better quality than some of the trucks down in the FiDi. Also sampled the horchata, which was a little chalky but delicious. Total cost was about $11, not Mission prices, but not terrible for the area.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-28", "description": "I enjoy coming here, since it's close to the office and I know what to expect.  Their breakfast burritos are a bit small, but filled with flavor and inexpensive.  \n\nAt lunchtime, I typically order a burrito, but I've also enjoyed their chimichanga's and flauta's.  Take your pick of the variety of meat selections they offer.  I've tried most if not all and try to mix it up all the time.  Like with other Taqueria's, you can help yourself to the salsa bar as needed.  Service is always good and the staff are friendly.", "author": "Lon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "This is the spot from breakfast burrito . Cheap and served fresh.. I would get the huevos ranchero plate with corn tortillas, extra bacon and watermelon juice. You be working happy after eating it!!!", "author": "Reynold M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-22", "description": "Decided to go here for lunch w a few co workers- def get there by noon to beat the lunch crowd! The line can extend past the door. I had the chile relleno burrito and thought it was okay- I'm from la had have had amazing chile relleno. It could've used more flavor and spices, and cheese wasn't as melted and gooey as I'd like it. Also thought it was weird that they re-heat the chile relleno before wrapping it in the burrito. Nonetheless, they have a lot of choices on  their menu,it's fairly cheap, and have tons of seating.", "author": "Joy-Alonica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "I was floating between 3 and 4 stars but their service is really good.  The staff is really friendly and man are they fast.  I was laughing about their speed and thinking how great it would be if places like Chipotle moved this fast.  Food is about a 7/10 but service is 9/10.  Just got to get them to carry lengua and cabesa to get 5 stars.", "author": "Andrew V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-01", "description": "While eating my chicken burrito, all I could say was \"Not Good but Not bad\" but after eating a few more bites decided it was more towards bad. The entire burrito (chicken, refried beans, rice guac, salsa and onions)  had no distinct taste except for salt. I'm not even sure how that's possible. Also,the burrito was barely warm which didn't help. \nI don't think trying other things would help since it's all made with the same variations. \nIt's not the worst but also have no need to return.", "author": "Diana L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-25", "description": "Nice people, but the worst breakfast burrito I've had in years. Salty, and otherwise mostly tasteless. The eggs were eggs but tasted like nothing, other than hot salty water. Same for the potatoes and salsa in there. The beans didn't even taste much like beans, just more hot salty water.  With a lot of hot salty watery rice.\n\nI've had lunch here twice too and neither burrito was worth coming back for. They weren't awful, but this is a city of good and very good burritos, and you just don't come back to a place that has been in business for many years yet still serves mediocre food.", "author": "Eric O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-11", "description": "I was belching for hours after eating some Fajitas here. I think they use cheap oil.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "Not sure why this place has a 3 star rating but I find it really great - taste wise and price wise.\nThere food/interior/servers are authentic Mexican and Yay! they have plenty of vegetarian options for me.\nYou have to try their Veggie Quesadilla even if you are a meat lover! This place is best for to-go though the queue here can be big at lunch time. Saying that, they are quick servers. This place is right in front of my office, is super cheap and has vegetarian delicious options for me so yes, I am a frequent eater here and I haven't been disappointed once.\n\nTip: You have to try their salsa :)", "author": "Pratibha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "Authentic, flavorful, fresh food! \nHats off to the cook[s]. \nAll the staff made our late 'burrito' lunch quiet and unhurried.", "author": "Corinne d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-16", "description": "I am writing this review on behalf of my brother who has come here every Friday for over 1 year. \n\nHe always looks forward to \"burrito Friday\" with his co-workers and going to Cramba on lunch time. Each time he's gone, he's gotten the same thing. He's very simple, kind of picky, but  reasonable eater. \n\nLast Friday 11/13, he ordered the same burrito he orders each week, but this time with extra hot sauce. He made it back to work and around an hour after lunch he started feeling ill. He threw up at work twice and was on the toilet back to back. He made it home and told me he didn't feel good. I advised him to relax, drink some water and eat something small and bland. \n\nBy 8:30 pm that night, he was non-stop throwing up and was rushed to the ER. Upon arrival at the ER, he fainted. He was in the restroom throwing up in the ER and he passed out and had to be carried into the bed by nurses. He was immediately IV'd and his body took up 5 bags of fluid which he had lost throughout the day. He was shivering, body was sore, he felt nausea constantly. He was in the ER for 4 hours. They diagnosed him with Food Poisoning and sent him home with nausea and diarrhea pills. \n\nHe was certain there was something wrong with his burrito, he said it just didn't taste the same like it usually does. He was very concerned and doesn't want anyone else to get sick due to lack of attention from cross-contamination. Something had to have been mixed up and for it to hit him 1 hour after eating, it was definitely cross-contamination here which caused severe food poisoning. \n\nBe mindful, and happy trails!", "author": "Alyssa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Great tasting burrito and good location! This is one of the best burritos I've had in SF. The price is good, too. In addition the staff is friendly.", "author": "Tyler H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-29", "description": "I was severely hungover walking to work this morning, so I decided on a breakfast burrito to cure my morning. After walking about 1 block from BART, I stumbled into Caramba.\n\nThe menu is quite confusing. There's lots of regular breakfast choices, and then it just has a breakfast burrito \"extras\" section. Even in my cloudy hungover state of mind, I'm fairly sure that there's nothing stating what comes in the burrito to start with. So I proceeded to just order my ideal breakfast burrito and ignored the menu altogether.\n\nService was fairly slow. I ordered take out thinking it was going to be just some eggs, potatoes, and cheese in a tortilla. From ordering to leaving was a good 10 minutes. I would not recommend coming here if you are in any sort of rush.\n\n$5 minimum on credit cards, which is reasonable. I just added a water bottle to my order to bring it up to min.\n\nThe overall quality of the breakfast burrito was great and helped me jump start my day.", "author": "Kailey O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-24", "description": "Very greasy and the place does not emanate a good smell in my opinion. Not good for me, comfortable and big restaurant and quantities are big but you can get better burritos at the food truck. Just the name of the place seems so cool.", "author": "Carmen V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-17", "description": "If you're in the mood for middling-to-mediocre Mexican and don't mind a line at lunchtime, then Ay! Caramba!... this must be the place for you 'cause I ain't that impressed, gringo. I was wondering why nobody around any of the offices I worked at in the area ever talked about this place. Ever. After all, there aren't that many Mexican places in this part of the FiDi where you can grab and go unless you count the 360 Degrees Burritos in the Galleria. But come on, you can't count that, can you? Granted, I have to give credit to the owners of Caramba for trying to open a Mission-style taqueria on Second, but unfortunately, I just wasn't too impressed with what I had.\n\nI thought I should take advantage of the $5.99 Chicken Salad which was admittedly a good price for the portion. The bed of spinach was a nice choice, but then there was the chicken - charred, dried out and hardly edible. It must have been sitting in the warming tray for quite some time to achieve that kind of rubbery texture. The tomato salsa and chip strips did nothing to hide the petty poultry problem (see photo). But hey, of course, I sat there and ate the chips. The people at the other tables didn't seem to have a problem gorging on their burritos and chimichangas, but then again, they looked like they slept in their tattered Macworld T-shirts.\n\nFOOD - 2 stars...dried-out chicken is just not cool...the Instagram photo makes it look far more appetizing than it was\nAMBIANCE - 2.5 stars...crowded at lunch and tables don't get bussed too quickly\nSERVICE - 2.5 stars...they look tired\nTOTAL - 2 stars...need to satisfy my Mexican cravings elsewhere", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "Caramba is my top lunch location of all-time. I work nearby and it is one of the few Taquerias around me where I can get a decent burrito. I'm a fan of their Al Pastor and Carnitas recipes. The Al Pastor has a mild spiciness to it whereas the Carnitas is very savory.\n\nDuring the lunch rush, Caramba is quite capable of powering through long lines with their assembly-line process. Rarely have I had to wait longer than 10 minutes to get my burrito. I also find that their burritos are very reasonably-priced for the city.\n\nI'm looking forward to the time when I can reclaim my Dukedom at Caramba. I am very near squelching the rebellion that lost me my throne.", "author": "Grant S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-12", "description": "Very price reasonable this was more of a quantity vs quality experience. I didn't bite into the burrito and say \" omg this is a really good burrito \"..it was aiigh. El Faro on 24th & Mission is way better then this place.", "author": "Kam H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-02", "description": "Over the years, I've reviewed a lot of businesses. Some of them were spectacular. Some of them were horrid. Some of them were middle of the road and it took reviewing them to truly understand how I felt about them. Rare is the business that's so... blah that it fails to make an impression during the experience or once I've consulted my notes to jar my memory. Rare.\n\nLadies & gents, Caramba is just such a business.\n\nEven after reading my notes (taken during my time there), I was hard-pressed to remember the experience. It was only after looking at pictures and reading the corresponding notes (what? Don't look at me like that. Getting these reviews right is part of my job. I take it seriously) that it started coming back to me. But, even then, I wasn't all that inspired to write about my experience. So, that should say something right then and there.\n\nWhat Caramba has going for it is location, speed and ease of service. In a city like SF with tremendous dining experiences to be had at any price point, if you are offering 'okay' fare, you'd best be bringing something else to the table. In Caramba's case, it's location makes it very convenient to the legions of hungry, stressed and gotta-go types who work in this part of town (spoiler alert: there are lots of them). Knowing the market, the folks at Caramba make sure to get you in and out in a relatively short amount of time. Lastly, there isn't any Elaine-Benes-at-the-soup-nazi-ish hemming and hawing of the menu. It's easy. It's digestible. It's meant to help you make a fast choice, order and be on your way. That said, it's a system that can get jammed up and when my group of seasoned eaters/orderers came in that's exactly what happened. My notes read, 'amazingly, ordering turned into a hot mess.' The trouble came when the woman behind the counter got a bit flustered with our en masse group. That surprises me because I'd imagine that lunch rushes are the usual around here.\n\nAs I typically do, I went rogue. I ordered the super nachos with chicken. They were (verbatim from my notes) 'passable.' The chips started off wet and flimsy (what you expect at the end of the nacho gorging). There was little seasoning to be tasted and the ingredients were all of on their own islands. That said, the nachos were piled high and were good for the money. At Caramba, you'll get an okay experience but that's not a surprise (or, worry) for you. You're here to get some food in your belly with relatively little fuss.", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-25", "description": "3.5 Stars\n\nI was craving chorizo and eggs and my friend always recommends Caramba, but in my one hungover attempt a couple months ago to actually go, I got lost somehow (even though I've worked downtown for several years) and couldn't find the restaurant. Today when I found it, I was like \"oh, I've walked past a ton of times, how the eff did I not know THIS was the place\".\n\nAnyway, I ordered an Egg, Chorizo, Potatoe, and Cheese Breakfast Burrito with extra hot sauce and jalepenos. Good heat in the hot sauce, the chorizo was savory and oily, mixed with eggs and small bits of potatoe, it was a delight. The service could be nicer and they could clean the place up a bit, but whatever. \n\nI was so tempted to rip it out of the tin foil and go to town on it on my walk back to the office, but I delayed that, and it was great. The slasas are pretty good, but they don't like to give up their little plastic cups for take away very easily. And each add on is around $1, so my BB was $5.55. Not too bad, I will most likely be back.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "I love this place. Great crispy tacos; fabulous burritos. Clean, delicious food. Truly Mexican. Great service. I wish that they had a full bar. My ONLY complaint.", "author": "Jane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "I liked my salad. Really yummy, and a good deal. Well-salted. Spicy salsa!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "An 85/100 health score? That's kind of scary, but I ate here and survived. I think I may have found my go-to breakfast burrito spot. I crave b-fast burritos on the reg and this place is quick, convenient, and worthy. I got the works for $6 (Caramba breakfast burrito w/bacon + potatoes + cheese), but pricing generally starts between the $3.50-$3.75 range and potatoes, cheese, or rice are extras that are about $1 each.\n\nMight come back to try out the lunch/dinner options; But for now, I'm for sure a fan of their breakfast.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-13", "description": "Seekers of the Mission Street Mexican food experience are likely to encounter a sour note here, since Caramba serves as a \"settling\" lunch destination more so than a hot spot for cuisine south of the border. Most of the food I've sampled here have been mediocre, leaving me saying \"caramba\" far more often than \"sabrosa!\"\n\nService hasn't been real hot during my last few visits, sometimes the lines get a little out of hand and it becomes a mini human conveyor belt of order food-pay-load up on condiments deal. There haven't been too many smiles from behind the counter, though I imagine I'd be the same way if I were serving this food.\n\nWhile I've had pretty decent results with their breakfast burrito, all else has become leftovers / scraps on the plate otherwise. I've had soggy tacos dorados on more than one occasion, a few bland and wet burritos (which are not euphemisms for anything other than messy food), and a super sad string of salads (being healthy never tasted so meh).\n\nThe prices aren't too terrible, it can get way spendier in this part of SOMA. I wouldn't be surprised if tourists surveying the scene may be mislead to believe this place is a legit Mission burrito spot, but I implore them to head south and don't look back till the street sections become 16th and beyond. When it comes to straight Mission Mexican, Caramba is among the pobrecitos of the bunch.", "author": "Jando S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-01", "description": "So finding a California Burrito up north is a very hard thing to find. Walked into Caramba expecting an amazing California Burrito.....lets just say there is a reason only Southern Cali makes them. The Burrito just sucked period. \n\n\nBut alas weeks later hunger got me again and i wandered into Caramba and got the Taco Salad which I really really enjoyed and would recommend!", "author": "Nina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "I got a really delicious meal here today. Sopes with chile verde -- ie pork in spicy green sauce and black beans on top of fried cornflour dough shells. It was topped with guacamole, sour cream, shredded cheese and lettuce. I had a fairly run-of-the-mill burrito here a month or so ago, so I wasn't expecting much flavor. I was wrong; this was very tasty and I enjoyed every bite.\n\nNot sure what made my burrito bland before, but I'm willing to guess I wasn't feeling adventurous with the fillings that day. They have a range of meats to choose from, including chicken mole and the above-mentioned chile verde, two of my favorites. Looking forward to trying their other offerings, like tortas and other lunch plates.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-05", "description": "BEST CHILE VERDE ANYWHERE!!! Their Chile Verde is like Steph Curry!  MVP caliber!\nFull disclosure: I get food from here once a week.  Our office gets food catered from here approx. once a quarter. \n\nWe affectionately call this place \"Grandma's\" because the food has such a home cooked feel to it, it's like eating at your Grandma's house.  The staff is super nice.  Grandma, herself, is awesome!  Lety is super efficient.  Chuy cooks up the best Chile Verde north of Mexico. \n\nI've been meaning to write a review for a long time, but just never quite executed.  Tonight, however, is Cinco de Mayo and we were too far from Grandma's, so we settled for Gordo's instead. I ordered Chile Verde....it was awful.  So, Gordo's reminded me that this is another place that doesn't stand up to Grandma's. I've been to several Taquerias in the Mission too and they don't stand up to Grandma's.  \n\nSo, NOW I have to share with the world about how AWESOME Grandma's Chile Verde is.  Hands down! No competition whatsoever.  Give Grandma's (Caramba) a try...order the Chile Verde!  (in burrito form or as a plato/plate)\n\nOne more note, I often gauge a restaurant by its clientele.  Often times, you will see Hispanic construction workers having lunch at this place.  To me, that speaks volume about how authentic this place is.  If Caramba was in the Mission, everybody would be talking how great this place is.  Don't let the location fool you!  Grandma's is as authentic as they come!", "author": "Sequoia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-07", "description": "Ay caramba! Not really happy when I ate here.\n\nMy mom, sis, and I went to run some errands and were famished. We came here because we were craving tortas (which the signs said they had). I was so sad when I found out that they ran out of some of the ingredients to make them. The employees said that due to being Friday and after the lunch rush, they tend to run out of ingredients much quickly. So, I just ordered a vegetarian quesadilla.\n\nIt was meh. I've had better. Not many veggies and way too greasy!\n\nIt would have been nice if they stocked their food supplies well to accommodate for the people that want to get some food after the big meal rushes.", "author": "Terri L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-26", "description": "I just came here for a breakfast burrito because I was craving Mexican food. I got a chorizo with eggs burrito and I paid $1 to add potatoes. While it tasted fine, the burrito was TINY! A small, thin, barely anything burrito that cost almost $5. This place is a huge rip off. I could barely see the potatoes. They're shreds of potatoes, not chunks or cubes. If I am desperate enough to come here again, I would not pay an extra $1 to add potatoes. \n\nThe service was also quite slow. It was fairly crowded with little space to move and wait around. The salsa containers are also behind the counter so you have to ask for them. The napkins are too thin and we waited a long time for our burritos. \n\nBottom line, they're charging way too much for a tiny burrito, and skimping on the ingredients and napkins. If they lowered their prices, this place could be decent.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "Picked up a Carne Asada Supper Burrito for a quick lunch, and it was better than I expected. I don't know if it will become a usual lunch spot, but I'm sure I'll be back. \n\nThe place was a little dirty, but there was someone actively cleaning like a lunch rush just ended. \n\nNot a bud lunch spot for sub $10. Going to try a breakfast burrito next time.", "author": "Zach D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "Just went to this place for the first time and it's super good. I went during hectic lunch hour which was a tiny bit overwhelming but the line didn't take very long. I got a California burrito (delicious fries inside) with Barbacoa and was thrilled with it. Reasonably priced and I couldn't finish the whole thing. I recommend checking it out!", "author": "Clay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "I came here from a recommendation from a friend who also works nearby. I got breakfast burritos for myself and a coworker. You do have to add rice, beans, cheese or potatoes as extra but the original eggs and meat burrito is only $3.50.  You also have to ask for salsa cups at the register because I guess people have taken water cup size salsa in the past. I took my first bite of the burrito and my stomach seriously swooned! I couldn't have been happier! My coworker did the exact same thing on his first bite as well. The salsa was good but not very spicy. I will definitely be back for more breakfast burritos and to try their lunch!", "author": "Amanda K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "Love it. The 2 ladies at the front are just so nice and always willing. I've become a regular and order my office staff food from here anytime. \nReasonable cost and always fresh. Burrito, enchiladas, tacos and nachos are superb!", "author": "K C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "This place was delicious. I came by here because my co-workers told me it's a good spot for some real Mexican food. I dropped by here during lunch and the place was packed! There was a line almost out the door and just about every seat was taken. I was fortunately bringing it back to work, so seating wasn't a problem to me. The line moves fast though. Almost too fast that I got to the front without even having time to check the menu. Once again I had read some Yelp reviews so I ordered a super burrito with chicken and no guac. I got to the register very fast paid for my food and added a Mexican Coke. The lady was nice, but was moving the kind fast, so I wouldn't say it was very memorable. The burrito was delicious!!!!! I really loved the freshness of it all and enjoyed the Coke to top it off. It's still a bit pricey to me, but for the financial district t it's about what t expect (paid about $10 bucks). Overall, I will definitely come by here to eat some more things off the menu!", "author": "James R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "I come here at least once or twice a week, and always get the regular burrito or super burrito with spicy salsa. Their burritos, in my opinion, taste better than what the nearby Chipotle has to offer. The lines move quickly and I've never had to wait for more than a few minutes to get my food, even at lunch time on a weekday. At $6.75, regular burritos are one of the cheaper lunch options in the area. The super burrito costs $1 extra and comes with cheese, sour cream, and guac.\n\nHowever, I felt the menu was unintuitive and hard to read in general. For burritos specifically, nowhere on the menu does it say I can choose between black, pinto, or refried beans. Also, the menu doesn't list the different types of meat they offer - I've tried the chicken and steak, but there are at least two more meats that I haven't been able to identify yet.", "author": "Benson Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-28", "description": "I can only speak for the eponymous breakfast burrito. And to it I say:\n\nGet it.\nGet it spicy.\nGet it with chorizo.\nGet it with potatoes.\nGet it on the day that your company doesn't spring for breakfast burritos for the whole company, so you don't walk into your office having paid for something you were about to get for free.\n\n¡Ay caramba! (I bet I'm the first person to say that here.)", "author": "Peter D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "thank fucking god for this place, or else this stupid neighborhood full of stupid ppl would only have one proper food establishment. the nicest people work here and are ready to serve the most delicious, lettuce-less burritos in SF. I'm serious. the most delicious burritos in all of SF are right here on 2nd st. plus they give you an entire bag of chips that is literally 200% more chips than any other taqueria... and their salsa verde is the ultimate salsa verde. I lose my shit for it. I even buy it in pints and take it home sometimes. their napkins are the perfect thickness, and not surprisingly, if you ask them for more napkins or more salsa cups in a non-asshole, non imposing way, they will be happy to give you some. THANK U KANYE FOR CARAMBA.", "author": "Yves D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "I LOVE this place. It's the only good REAL Mexican food in the FiDi. I come here once a week or so. My favorite it the chili relleno burrito and the taco salad (I'm 98% sure the \"bowl\" is baked, not fried.). \n\nThough honestly, everything is good. The taquitos are killer and FILLING. I got a crispy chicken taco with beans and rice for $7.50 or so. The chili verde is some of the most tender pork I've ever had.\n\nLOVE this place. If you want something classy with white table cloths, head somewhere else. \nThis is quick and real Mexican, with meats cooked looooonng slow.", "author": "Lara E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-23", "description": "I came here because I didn't really have time to stand  in the long Chipotle line--it's not that good.\n\nThis place is a nice, unassuming spot. I just wanted a steak quesadilla. Simple lunch. And clearly the quesadilla was just that. It was pretty bland, weak portion size, but it was cheap (~6.14.) Not sure I would ever order that again if I did come back though. \n\nIt's really a two stars place but I think they honestly mean well & the food is cheap. So---three stars.", "author": "Juan T. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "For $5 you get a mediocre Subway sandwich down the street. Don't get me wrong, I have the $5 sub all the time. For $7.65 you get a plate of carne asada, beans, rice and guacamole. This is their lunch special. \n\nSee: http://media3.px.yelpcdn.com/bphoto/GWZ30eJssgAzHLniDGHr6g/l\n\nThe carne asad itself is average but the whole plate is a great deal and in combination is a pretty damn good meal if you're hungry and want an actual meal.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-02", "description": "This place is among the better in soma area. Typical sf taqueria. The line gets long so best time to show up is 11:45.", "author": "Will D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-03", "description": "I ordered the super burrito with black beans and beef. The one thing that stood out was the richness of the sour cream. The service was really fast.", "author": "James S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-07", "description": "I've only ever visited in the morning and only ever ordered the breakfast burrito. My advice to you would be to limit your adventures here to the Caramba (that's the official name for their breakfast burrito: two scrambled eggs, your choice of bacon, ham or chorizo, bell pepper and onion). \n\nI like my Caramba best with chorizo and the addition of potatoes. Be prepared to repeat your order multiple times as service is a little spacey. I've become accustomed to this and figure it's worth it for a morning meal that's super satisfying and of pretty great value.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-16", "description": "Went here to get breakfast for a vegetarian friend. Burritos came out fairly quickly and looked decent - until my friend took a bite of hers and discovered a bunch of ham. I went back and explained what happened (ham in a veggie burrito). The cashier looked in the bag, saw the ham, and said I must have ordered a ham burrito. I explained that I hadn't, and that the foil had \"veggie\" marked on the side. Then the cook came over, dumped the bag out on the counter, and started yelling that it was veggie, despite the pieces of ham clearly visable. They then agree to make a new burrito, and proceed to give me the smallest burrito I've ever seen (about the size of an Altoid tin) and told me to get out.\nRude, terrible customer service like this ensures that I will never be coming back. I'd rather walk to 1st Street and go to El Faro - they have better food anyway.", "author": "Rich Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "May be the best breakfast burrito I've ever had.\nGo with: Chorizo + Egg, plus Potato and Cheese, Spicy.", "author": "Nic N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "Defintily one of my favorite burrito places in Downtown for lunch. The California Burrito is my favorite, because they add fries *in addition* to the rice! Gotta love my carbs!", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "Found this \"little gem\" (hole in wall) two weeks ago...been here for lunch every day since.  Their Chile Relleno Burrito is my favorite.  Lines are long at lunch but moves quickly.  Ordering may seem a bit chaotic, people screaming out their orders.  By the second day I was ordering like a boss. Only downside is my ever-expanding waistline.", "author": "Francisco C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "$3.95 breakfast burritos that are about the size of your open hand. Just to be clear - that's not a complaint. A perfectly-sized breakfast for a very reasonable price. \n\nMy favorite is the caramba burrito - with chorizo and spicy. You can also add potatoes, if you're into that. But i like mine as it comes - eggs, onions, peppers, meat. Nomnomnomnom! It comes out piping hot because you can actually watch the ladies in the back crack eggs for your burrito. Definitely made with love!\n\nA few tips you should know....\n~ Make sure to ask for cups for salsa while you order.\n~ They have a $5 minimum for credit/debit cards, so order accordingly or bring some cash\n~ Breakfast ends at 10:30, and it gets busy at 10am.\n\nEnjoy!", "author": "Mar A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-02", "description": "I may go back, but I was not impressed. The carne asada platter is not great. The meat was just okay and not even cut up. So the to-go box and the plastic fork and knife were not ideal for cutting the beer. The rice was dry and too orange (seemed like coloring?) and the beans were watery and un-flavorful. They skimped on the guacamole and the lettuce was watery and shredded. In all I'd say the meal was just okay and tolerable, but nothing tasty. \n\nService: Though they line you up and take orders quickly in an assembly line, they somehow forgot to make my order when I got to the cash register. I had to wait on the side while I then gave instructions again on what I wanted. \n\nGo to Chipotle down the street.", "author": "Maryam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "OK Mexican in the FiDi.\n\nIt is difficult to find authentic taqueria food in the FiDi, so Caramba is a Mecca for burrito and taco lovers. The portions are huge, the prices reasonable.  \n\nThe super burrito was really super-sized.  Do not order it, if you are on a diet.  (Note: This is a down-scale place, so no whole wheat, spinach, or tomato tortillas; it's flour, plain and simple.). If you like spicy, order the spicy chicken with spicy salsa; it'll blow your socks off.  The nacho fries are to-die-for: nachos and fries all in one. Duh!  Someone should have thought of this sooner.  With enough cheese to shame Wisconsin, the quesadillas are awesome.  Gooey, sticky, and stringy. Yum.\n\nThis is not a frou-frou Mexican place, must copious portions of generally tasty Mexican food.  There are better tacos and burritos in The City, but considering the (lack of) selection/competition in the FiDi, Caramba rocks.", "author": "CJ G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "I have been religiously looking for a place to top this place only to find no other Mexican restaurant around this neighborhood comes close to their quality of food that Caramba offers.  My favorite is their chile relleno, extremely tasty and never dried out like the other place around the corner.  Price is very reasonable. And service if fairly quick.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-04", "description": "You know when it's not a good place when you get pissed off by their customer service. I order a caramba with extra egg but I don't think they add extra egg. I order on a plate and they make it a burrito. Their handling of food is not something you want to watch, they don't use gloves. They're arrogant also with no customer service at all.", "author": "Noel O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-13", "description": "I read the reviews prior to my visit. I was really excited to try the chorizo breakfast burrito. I asked for it to be spicy, added potatoes and added cheese.\n\nI also asked for the salsa containers to get extra hot sauce. The small burrito was yummy, just as long as each bite was drenched in hot salsa.\n\nThe pictures of dishes on the wall look good, and the prices look great. \nI think I would like to try the huevos rancheros next time, as well as the tortas. It's not too far for work, so I'm going to try it again soon. The staff was really nice.", "author": "Rosie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-26", "description": "Sadly decent at best. I work very close by and ran over here to get lunch (after the noon rush....at 3. Yay meetings!) and ordered the Super Nacho Fries. Sadly, the name does not correlate to what I have gotten. I like cheese and assumed that \"super nacho\" means a lot of cheese. There was almost none. There were some cheese....the spots on the box walls had the nuked cheese stuck on it. And that's about it. I'm happy with the servings of meet though (only 3 meats: chicken, beef, and pork). A good portion of avacado and sour cream. Fries are few but the meat made it up. I should've gotten the burrito instead. Also, they do NOT take AMEX but Visa is good. For $10+...I'd say not worth it. Maybe I'm used to South Bay's portioning and prices. Oh well, lesson learned. Also, if you have a wood desk like I do, do not let the box sit on top of it. Maybe because they microwaved it to hell but the box left a stain on my desk.", "author": "A o S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "I is an authentic Mexican food. I ate here almost every week and found the taste very consistent, texture of spices is right. I like their super burrito and casadilla.", "author": "Laxman A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "Caramba is delicious. Its a no frills Mexican food breakfast or lunch spot with amazing burritos.\n\nWhat do people expect? its a lunch spot that makes a burrito in less than 60 seconds for $6 an it tastes good. Do you want the nachos to dance for you before you eat them!? If you like mexican this place is on point for a quick bite.", "author": "Petey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "The only reason this isn't 5 is because the service... Breakfast burritos will rock your world!", "author": "Bob P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-11", "description": "There's only one reason to go to Caramba: can you say \"breakfast burrito?\"  I tried a regular burrito here once, and it wasn't particularly good.  But the breakfast burritos are something else entirely.  Get the \"Caramba\" with bacon, which nets you egg, bacon, bell peppers, onion, and hot sauce in a perfectly sized morning gut bomb.  It's somehow otherworldly. and only costs a couple of bucks.\n\nDelicious, though probably not all that nutritious.", "author": "Laurence W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-27", "description": "Nothing starts my day off better than a breakfast burrito. And when I can add potatoes into the breakfast burrito I'm a happy girl. I don't necessarily think potatoes belong in all burritos, but they do go well with my breakfast so I like them in there.\n\nThe ladies that are up front in this joint are fast and friendly. They cook your eggs on a little hot plate right behind the register. You can get your burrito made to your liking whether you want eggs or not, meats, hot or mild salsa, cheese, etc. I even saw Gabi K order a whole wheat tortilla and avocado for hers I think.\n\nLong review short - not a fancy burrito place and it's good for morning fuel.", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-08", "description": "Stars for the service. I ordered huevos rancheros and my eggs were under cooked the lady looked horrified and wanted to recook the eggs for me, but I prefer them like that so no problem. \n\nOrders were unorganized and my rice was very burned and crunchy! A big no no . I've had better Mexican food in SF.", "author": "Meghan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-15", "description": "The huevos rancheros breakfast burrito is amazing and I think it's less than $6.  The verde salsa is great here too.  The service is pretty good too.\n\nYUM!", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "I might be in love: the best breakfast burrito (carumba burrito) I've ever had for less than $5... Nuff said", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "I can't believe I haven't written a review about Caramba earlier. This is THE best Mexican restaurant in the FiDi that I have found. The name is cornball and I initially had no faith this place would be good but I've fallen in love. Skip the chain restaurants and walk another block over to some better Mexican food.\n\nThe food here is fresh, authentic and beyond satisfactory every time! They make the food right in front of you so if you are picky or have food allergies make sure to watch them and be very clear. This is an authentic spot so many of the workers have thick accents and a coworker of mine with food allergies had a bad experience due to a language barrier. \n\nMany of my Yelp peeps know how much I love their chile verde burrito (CVB). It is like no other from anywhere I have ever had. And for the record the sauce is actually green (I know that sounds like a no brainer but trust me, it's not always green at other places). My coworker loves and orders the chicken mole burrito. Personally, I have not tried it but he swears it's bomb. \n\nThey serve breakfast and lunch but I'm not sure about dinner. They now use Order Ahead to take individual on-line orders (ALWAYS a fan of that service). I just recently tried their breakfast burritos and they are to DIE for! However, they are pretty small and it will leave you craving more (sad face). They also have a healthy variety in their salsa bar: a couple hot, a couple mild and a green salsa. I believe they have chopped, pickled carrots and jalapenos too. \n\nThe cons about this place besides a potential language barrier is sometimes they don't honor their check-in deals such as Yelp app (ahem) or other programs unless you have a physical paper print out (how you print out a mobile check-in offer is beyond me). Perhaps they lack internal communication of how to accept such deals but don't count on that free agua fresca or soda with check-in.\n\nBesides the cons, the food speaks for itself. Also, you might want to add a nice cold brew with your lunch. They have a pretty good selection of Mexican beer such as Modelo, Pacifico, and Dos Equis.", "author": "Chanelle N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-13", "description": "Just left & had to throw my burrito away! The steak was disgusting and when I asked for no rice the lady scrapped it off. \n\nI would not recommend this place. Especially with so many amazing Mexican restaurants in SF.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-14", "description": "Damn,\n\nThere is just no excuse for a bland burritto with crunchy, tasteless meat. I mean if I had a burritto like this in Iowa or something, I would say \"no shock there,\" but no excuse for this in SF.  I would take Chipotle over this any day!  Very disappointing rubbish", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-17", "description": "I have this theory that virtually any hangover can be cured by a Caramba Breakfast Burrito. Their Chorizo + Egg (I like to add cheese to this) is by far my favorite. It's not just the fact that these little baby breakfast burritos (burrititos if you will) are filling, they are also pretty yum. \n\nI appreciate that I can order ahead online and haven't ever had a conflict thus far placing larger orders for my office, particularly the day after a rowdy outing ;-).", "author": "Chris W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-17", "description": "I wholeheartedly agree with another yelp reviewers experience (Jennifer). Everything that I needed to say is said there about my sad breakfast burrito. \n\nWould not come back for a poor baby breakfast burrito. Better off not having one if that's what your thinking.", "author": "Anton H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-12", "description": "Bland and microwaved depending on what you get. That AND no gloves? Pass.", "author": "Renee F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "If you get there before the lines start at 12;30, this is a quick, healthy lunch spot with some solid offerings.  I recommend the Shrimp Bandarillas with the spicy sauce.  Simple fresh veggies and shrimp skewered and grilled for around $8.00 -- YUM", "author": "Christine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-25", "description": "Walked over and was in and out in 5 minutes. I got a super shredded chicken burrito w/ spicy sauce + fresh cliantro. It was delicious. I will be back to try more things off their menu.", "author": "Jennifer Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "This place makes some pretty baller burritos. Of legit mexican places that I've been to in DT SF this ranks in the top tier. Their meats have got a good amount of flavours in em' which really adds to the burrito experience. And the meats aint dry, nice n' juicy. Burritos are also damn cheap, like 8 bucks. That's a win. If you are in the mood for a burrito thats got that could potentially make ya go 'dAAAmmnn daaaaMMNN dAAAAAMN' give this place a shot.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "5/5 for Chicken Super Burritos to go. A little more expensive than Chipotle but worth it.", "author": "Jared R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "Went here for lunch today and it was good. It hit the spot and they were fast. Hard to find a good taqueria down here in SoMa, so this will have to do; at least it beats chipotle's weak attempt at Mexican food. Gotta love the way they work as a traditional burrito line, and of course they offer a great variety of other dishes such as tacos, plates, enchiladas, wet burritos etc.. I'd go back for sure.", "author": "Bradley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "Love the veggie breakfast burrito!!!  open early. Friendly. Flat out delicious. And good spicy salsa! A must have for those early mornings at Dreamforce!!!", "author": "Elliott Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "We came here for a quick lunch while in SF for work. It reminded me of a local version of Chipotle with the layout and type of food. This is no frills Mexican food and was decent. It provided me with a hearty meal that got me through the rest of the day. I ordered the tacos with half pico and half spicy sauce. The spicy sauce is definitely spicy so approach with caution. At first we thought it was cash only, but realized they also accept cards. If you are in the area and looking for a quick Mexican food lunch, this is a good option.", "author": "Lindsey D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-30", "description": "Went in for a breakfast burrito. The Caramba Chorizo. Waited a bit for mine, but I guess that was actually a good sign for me. It means that it was made to order; not made in batch first thing in the morning. It was good, but not great. But hey, for a little more than $3, its a deal.\n\nWould go back since its close to work, but its not my go to burrito shop.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-18", "description": "This place is convenient, fast, and filling.  It's also sort of bland (referring to the super burrito with al pastor, black beans, rice, cheese, guac, sour cream, and salsa on a whole wheat tortilla, $7.34).  Then again, coming from San Diego, I have extremely high standards for Mexican food. \n\nWill probably come again for the California burrito (burrito with fries), but if the fries are crispy, then they'll probably miss me.", "author": "Ronald T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-20", "description": "Breakfast Burrito review only!  \n\nSo the breakfast burritos here at a bit on the tiny side but they are cheap and customizable which is a big plus!  You can get it however you like, and if you ask for it spicy, it's got some good kick!\n\nI'd suggest maybe ordering more than one at a time since they aren't humongo.  But they taste good and they are really nice here.", "author": "Gene X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-20", "description": "Lousy organization and marginal food. Prices are ok, but be prepared to feel ill overall.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "A bomb veggie taco. First one I had in SF, I'm from LA and we're spoiled when it comes to bomb Mexican food. I've been disappointed in the Mexican fare in the Bay Area but this was a pleasant surprise!", "author": "Vahagn M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-29", "description": "I was hoping for a 4  but it was a 3 star experience.  \n\n1.  It was busy but the line went very quickly.\n\n2.  I like the system of one person taking and preparing your order.  It gives a very personal feel.\n\n3.  Everyone was friendly.\n\n4.  If you want to eat in, a number of the tables are pretty cramped because the line-up to order.\n\n5.  The canned drinks from their cooler were Cold with a Capital C.  I like really cold beverages with Mexican food.\n\n6.  Carne Asada Plate (Meat, Choice of beans, Choice of tortilla, Lettuce, Rice, Guacamole) - This was a pretty good plate.  The meat was tender but could of used a little something.    The lettuce, refried beans,rice, etc.. were basic and what you would expect.  It was filling.  I enjoyed it but nothing really leaped out to say \"wow, that was a great carne asada plate\".\n\nhttp://tinyurl.com/4esrjp7\n\n7.  They do have a sauce bar with a number of sauces.  I mixed some together and enjoyed it with my carne asada.\n\n8.  Overall, this was a good lunch experience.  The service was fast.  The price was decent (just over $11 including 2 canned soft drinks and one entree plate).  I enjoyed it but it didn't really stand out.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-27", "description": "Their breakfast burrito is perfect.\n\nEgg, bacon, salsa, under $3.  Not huge, but delicious, and the perfect size for a quick grab-n-go breakfast.\n\nI absolutely love it.\n\nLunch looked of the boring \"steam tray\" variety, so that's why no 5 stars.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-17", "description": "Stopped by this place for lunch. The line was a bit long, but the food is pretty cheap, and portion sizes are good. With that said, it won't be a daily spot, but I'll come back for sure.", "author": "Greg M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-10", "description": "Delicious breakfast burrito.  Chirizo, egg, and potatoes with extra hot sauce.  I will definitely return!", "author": "Cody P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "Came here for a quick bite before a round of meetings (which turned out to have catered bfast burritos. Kara is a b$tch) and grabbed a Popeye special (mushrooms, eggs, spinach, pico, hot sauce). The cost, with cheese added, was under 4$. Win. The wait wasn't long at all and the size was perfect (that's what she said). If it was any bigger I would've needed a nap (she said this, too). Tried some of my buddies chorizo bfast burrito and it was solid as well. I can't speak for the whole menu, but for a quick AM snack. Stop on in!", "author": "Drew A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "Yea I'm a certified gringo but I know wassup with mexican grubbs.  This is really the only spot in FiDi to get authentic, but they don't blow it.\n\nThe chick with the funky hair asks you like 3 times what you want but - \n\nEnchiladas and a taco - DO IT.", "author": "Farrell W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "Best breakfast burritos in the area. I know there's a few places within a couple blocks that serve breakfast burritos but these are the most flavorful and \"authentic\".They make the eggs fresh with each order. Order the Caramba with bacon and potatoes, SPICY!", "author": "Alexa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "If you work around the area, you probably work at some tech company. \n\nWhich means you're probably in your early-mid 20s and you're out drinking on weekdays. \n\nHere's where you get that breakfast burrito to cure your hangover. \n\nBring it back and eat it at your desk with your sunglasses on like a champ. \n\nDon't forget the red/green salsas.", "author": "Louie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-09", "description": "Popeye con bacon!\n\nOur office lights up with joy when I bring these bad boys in on a Friday morning..   They're the perfect size and come with Bacon, egg, spinach, and mushrooms.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "My favorite place to get a burrito within walking distance of my job. The food is always fresh and tasty and lines move fairly well. Minus 1 star because I can finish the supper burrito in one sitting.", "author": "Nikhil V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "San Francisco is a city known for its great burritos. As a result of living here for quite some time, I've developed this craving for cheap, quick, extremely filling Mexican food. Unfortunately, places that fit this description are pretty far away from where I work (I have taken the Bart to Mission during lunch time a few times, but I soon realized that this solution would not be scalable) and I really do need a quick fix where I could walk to, order a veggie burrito, see the burrito being prepared right in front of my eyes and then paying half of what I usually end up paying at any place in the SoMa/FiDi area. Caramba's burritos aren't the best I've had, but they are good enough to answer my weekday lunchtime mexican food cravings. Google Translate says that the word \"Caramba\" means \"an expression of surprise or dismay\" Luckily for me, the place neither surprises me nor dismays me. The food's consistent. It's warm. It's a lot.", "author": "Srivatsan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "I came with colleagues and absolutely fell in love.  I could just about eat their burritos everyday for the rest of my life!  The food is fresh, the service efficient, I will definitely be back and often!", "author": "Angela A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-19", "description": "I used to come here all the time for a fresh breakfast burrito, but one time I ate here with my boy JR and it destroyed both of our stomachs. By destroy I mean ravaged. Let's just say the loo was my best friend for the next couple of days. It could've just been that one time, but not sure if I want to risk it. Should I? The breakfast burritos do taste pretty #trill", "author": "Amar S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-21", "description": "I got two tacos here. One Al Pastor and one Carne Asada, I left feeling aSADa. \n\nWord play aside, the meat was lacking in flavor and wasn't very tender. That doesn't make a good taco, since there aren't many other ingredients.\n\nThe salsa was good. I think I'd go for a quesadilla or something else next time, though my coworker didn't finish her quesadilla either so it doesn't seem that appealing.\n\nNo bueno.", "author": "Viet N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "There are not a lot of Mexican places in downtown, but Caramba is a solid choice. The carnitas burrito is delicious. No compromises here. Great lunch option.", "author": "Karla R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "I've only been here for breakfast burritos, but they're amazing! Seriously the best breakfast burrito I've had in a long time. I get the bacon, egg, cheese, and potato burrito with spicy sauce and it's fantastic. Crispy, flavorful, etc. etc.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-05", "description": "Here's how the San Francisco taqueria review process works: \n\n1. White kids from Arcata move here to go to art school and sell weed having grown up on a steady diet of Chevy's and Hey Juan's.\n\n2. They get some shitty dive apartment in the Mission where they can play their god-awful screamo music as loud as they want and their stoner roommate takes them to some random restaurant within walking distance.\n\n3. The monster bong rips that made them hilarious and creative observational humorists also make them think that the food they encounter is the best thing on earth (and that Chrome bags are things they need to ask their parents to purchase for them).\n\n4. They get jobs at GitHub or AirBnB and go post negative reviews of every other Mexican restaurant in town, claiming that they're not \"authentic.\"\n\nThere's nothing particularly amazing about Caramba, but it's about as good as most of the other places all these one-star-givers rant and rave about, and it's as cheap as it gets in this neighborhood. Yeah, I've gotten a couple clumps of dried-out rice, and the horchata is grainy as hell, but the same can be said of 90% of the \"authentic\" places. I like it and I'm going back.", "author": "Nicholas J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-10", "description": "Paltry compared to the mexican offerings in the Mission, but this isn't bad for downtown. I had the caramba quesadilla (spinach, mushroom, and cheese), which was good, but greasy. Quick and easy.", "author": "Marcel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "Best stinking place for breakfast! Everywhere else nearby on this side of market st charges $8-12 and microwaves your eggs! This place? $3.10 for a fantastic breakfast burrito made right then and there. They have other things, but I won't get tired of the breakfast burritos for a while.", "author": "Eric I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "The burrito is always on point at Caramba's. \n\nI frequent here since I work right down the street and the food has always been consistent. The prices are reasonable and the location is awesome. The place does get a little too crowded during lunch time with the line going out the door most times. The staff is really rushed all the time and their salsas are OK. If you are tired of eating Chipotle burritos then I'd suggest coming here to try something different. Although I haven't tired it, I keep hearing that their tortas are great. One of the perks about Caramba's is that the menu is stacked with Mexican dishes and they even have Carne Asada Fries! \n\nAll in all this is a great place to get away from the usual sandwich/gyro spots in the SOMA.", "author": "Javier G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-19", "description": "More like a 3.7.\n\nI went with a co-worker, I was ravenously craving Mexican, but not Chipolte Mexican... we got the recommendation and walked the short blocks to the restaurant. Walking up there wasn't much differentiating from other lunch spots, but there was a long line, almost out the door, which to me was a good sign.\n\nI ordered the Super Burrito - for me this seemed more like a regular burrito, although that could be because I was so hungry. I ordered it with grilled chicken, rice, black beans, mild salsa, sour cream and guac. I added spicy salsa after, it needed more of a kick, but having never gone there I wasn't sure how spicy their sauces were. Definitely was fresh, and the flavors stood out. Next time I would order the carne asada. \n\nVery reasonable, fast, convenient. It hit the spot.", "author": "Jess K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "If you are looking for a delicious, inexpensive breakfast burrito in the Financial District, this is the place to go! I'm not exaggerating when I say I I come here 3-4 times a week to pick one up to start my morning. The staff is always pleasant, the salsas are flavorful, and everything else is on point. Ask for whole wheat tortillas! SO GOOD!", "author": "Taylor H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-02", "description": "Caramba is a small Mexican restaurant with a few tables and seats inside. There's a counter to order and it goes straight to the cash register after.\n\n== Food ==\n\nNachos was quite alright. Chips felt kind of old. The steak was pretty decent and the rest of the veggie stuff was quite fresh. Overall, an alright nacho.\n\n== Service ==\n\nQuick and fast to go service.\n\n== Overall == \n\nPretty alright place for authentic Mexican food.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "Like many other reviewers, I went specifically for the chorizo breakfast burrito after a co-worker suggested it. And I was not disappointed! Note, I called ahead, but you can also order online. It was ready in 10 minutes.\n\nThe order:\nChorizo and Egg burrito\n*add cheese\n*add potatoes\n*make it spicy\n\n\nI really enjoyed it! It wasn't soggy, like other ones I've had (like the one across the street with the big red awning... you know who you are) who use really watery salsas that make it soggy and spill out the bottom. That totally ruins a burrito for me. Unlike other Chorizo burritos I've had, their meat is much more crumbly so you get some in every bite (which they don't skimp on anyway). And the size was perfect! I don't need to be eating a Chipotle sized burrito at 9am in the morning. I will definitely be back!", "author": "Anne-Marie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-04", "description": "Decent spot which I've passed by more than a hundred times but never ate at.  I had the steak super burrito and it wasn't the most amazing thing I've ever had but it served it's purpose and was a good lunch.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-03", "description": "San Francisco seems to be the city of breakfast burritos!  I come in for meetings several times a year, and every time I'm here, I see my colleagues chowing down each morning on breakfast burritos.\n\nI usually start my day out with oatmeal, fruit, coffee, or yogurt and granola... but I mixed it up today.  I had to know what the burrito obsession was all about, so I gave in today and visited Caramba on my way into the office.\n\nI was pleased to see that there were options.  Not only could I choose from eggs, cheese, potatoes, beans, rice, chorizo, etc... but Caramba offers whole wheat tortillas!  I filled one of these savory steamed wraps with eggs, hot salsa, and guacamole... it came neatly wrapped in foil and upon unwrapping it once I was settled in at the office, the scent escaped and got me oh so excited!\n\nThis was one burrito worth waiting for.  It was love at first bite - I think I'm now hooked!  While the burrito itself was not humongous, it was just the right size.  (Yes, there is such a thing as one that is too big!)  But this one filled me up and left me wanting more.  I now understand the SF obsession with breakfast burritos - I'll be back to Caramba during future visits, and I may even seek out a breakfast burrito place closer to home when the craving strikes.\n\nBy the way, this was my review #666: http://www.youtube.com/watch?v=g7-iG4IyF2w", "author": "Gabi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-14", "description": "I'll point out that my review is ONLY for the breakfast burrito. I've had lunch here a couple of times because I live in the neighborhood, an it was unacceptable. Their regular menu is a far cry from the taquerias in the MIssion.\n\nBut their breakfasts burrito is probably my favorite in SF. It's a little on the small side, but it's dense with eggs, meat, onions, and bell peppers. I also like to add potatoes to mine. All in all, it's a great value at just under $5.\n\nPROS\n- Very hearty and filling breakfast burrito\n- Excellent spice factor, especially with chipotle salsa\n\nCONS\n- Really only good for breakfast\n\nTIPS\n- Cash only, but they do have an ATM\n- Get the Caramba and add potatoes", "author": "Drew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-17", "description": "I love this place, burritos are great (dispite the rare occasional mis-wrap or the tear from the lady banging the rice spoon on the tortilla to get the rice off the spoon but can you be mad at her for giving you all the food you can get?), line is usually long until about 2pm but moves every fast!\n\nIt's only open for a couple of hours on weekdays but it's quick, convenient, reasonably priced, really good AND the very attractive, friendly woman at the register keeps me coming back daily (literally).\n\nI wish they were open later and on weekends.", "author": "Kevin V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-07", "description": "I was heading to a taco truck when I passed Caramba and realized I was too hungry to make it to my intended destination. And they were hawking their carne asada special--what's not to love? But what a mistake-I should have held out for the truck! This was by far the blandest asada I've ever had-it wasn't seasoned AT ALL. No heat, no spice, no sauciness at all, just a few flat strips of steak. The portion was big, but thanks to the taste I was in no way interested in finishing.\n\nI hear the burritos are good, but I have other favorites for those and if they can't pull off a basic like carne asada I don't trust their other items as far as I can throw them.\n\nThe lesson here? When in doubt, chose the truck.", "author": "Lesly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "Perfect size breakfast burritos made to order.", "author": "Travis S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "Not only do I totally LOVE this place, but they saved my butt today. At 11:07 my boss rings my desk and wants lunch for 9ppl at noon. In SF Financial Dist, this is the busiest time for large orders. Where to go, what to do. Then I remember 1/2 a block away, Caramba has great food, made to order and they are pretty fast. I walk in their doors at 11:25, at 11:45 I'm walking out with a boat load of food and one if their employees helping me carry it back. They are AWESOME and EFFICIENT!\nThey also have the most authentic tasting Mexican food in the area. (street food style) I also tasted some things I would not have orederd for myself and now have some new favorites:\nEnchiladas the sauce ROCKS!!\nChicken Salad, good lettuce, grilled chicken- yum\n\nI got here at least once a week, they have are starting to recognize me. THANK you Caramba crew for getting me out of a tight situation!!", "author": "Monica H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-02", "description": "\"Captain! We have a problem with the containment field and I fear we may have an imminent warp core breach!\"\n\nIf we substitute the phrase \"containment field\" with tortilla and \"Warp core\" with burrito filling, This quote, lovingly stolen from Star Trek: The Original Series (imagine James Doohan saying it), would sum up my entire burrito experience at Caramba. \n\nEvidence of a breach appeared as I unwrapped the foil, seeing sauce leaks at every corner. While the meat (Chicken Mole) was tender and rather tasty, the guacamole distribution dead on and the warmth of the burrito consistent throughout, there was little cheese in evidence and the spiciness of the burrito (I prefer my burrito's to be palate-scorchingly spicy) was...underwhelming. In fact, spice was definitely absent, as was any flavor characteristic of a Mole sauce.\n\nThe hot sauces offered were a nice touch (the chipoltle salsa helped to kick the meal's spiciness up) and I enjoyed the pickled vegetable mixture, they were not enough to save this meal from the depths of mediocrity that it was consigned to because of the poorly constructed burrito.\n\nHowever, the horchata was outstanding (top 5 in my life without a doubt) and being able to sit outside on a warm San Francisco afternoon and gnaw on a slab was a rare delight.\n\nIf they work on the construction of their burritos and their spice, I'd be more then willing to add a third (and possibly fourth) star.", "author": "Casey U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-30", "description": "Good simple breakfast burritos. I had mine with eggs & chorizo and washed it down with Jarritos tamarind flavored drink. Great price about $6.", "author": "Rajeev R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "No bull indeed.\n\nI was going to give four stars even before discovering the awesome bull logo on their website. Always. Fresh. No Bull. That's a bold promise to live up too.\n\nAnd they did. Shrimp burrito is one of the best downtown. Packed with both shrimp and grilled peppers. Lettuce at no charge instead of rice. Plenty of black beans. Wheat tortilla. Less than seven bucks.\n\nI made a mess eating while walking back the office. The plan was just one bite. Could stop until it was all gone.\n\nThat's no bull.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-19", "description": "I can't believe this place is getting 3.5 stars.  The only good thing about it is that it seems fairly clean.  The food is very bland.  I ordered a chile relleno plate, and the guy grabbed a pre-fried chile from a stack and tossed it into the microwave.  Later I overheard the people next to me saying their burrito was cold inside.  Nah--this place is not for me.", "author": "Kandi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-15", "description": "Caramba is a great authentic mexican spot in SOMA/Financial district that can satisfy any lunch customer's hunger.\n\nThe folks at Caramba churn out delicious authentic mexican food at a reasonable / affordable price. It's a great spot for pick up, but I like to take a seat and enjoy the food in house.\n\nMy go to is 2 soft tacos. I really like the carnitas - the meat is boldly spiced and cooked to be perfectly tender. The Chicken, can be overcooked/dried out at times, but the authentic hot salsa and fresh pico/cilantro are a home run in my book.", "author": "Justin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-10", "description": "Fast service, good food , and convenient location from my office.\n\nMeal comes with chips and there is a salsa bar. If you eat in, there is different hot sauces you can choose from sitting at the table already.  I have had other Mexican food around the area and I always enjoyed this place the most.", "author": "Panda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "I have come here alot! Their breakfast burritos are the BOMB! I have had a chorizo egg potatoes burrito! It was delicious! I will continue to come here for a breakfast fix!", "author": "Kyle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-08", "description": "Was wandering around for lunch near NextspaceSF; stumbled upon Caramba and walked right in.\n\nThe menu/ordering process is a bit confusing and hectic, but the line-workers are straightforward and brisk. The line might look intimidating, but it moves fast with the efficient workers.\n\nI ordered a torta with al pastor: I've had bigger (and better) tortas in the past, but this one hit the spot for my lunchtime hunger. Flaky fresh pork sliced up between a warmed roll...mmmm. Also, love that they provide lettuce greens (NOT the generic lettuce) and avocado. \n\nBe sure to pay attention when they call out your order for pick-up; don't get it mixed up with someone else's! Luckily I was the only one who had ordered a torta, so I didn't have that issue. Others ordered burritos, though, so they had to be more vigilant.\n\nCash only for $5 and under; they accept cards above that amount. Next time, I'll have to try out their horchata; today I decided to go for a Diet Coke.", "author": "Helene K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-28", "description": "Good breakfast burrito, but nothing too special.", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-13", "description": "Caramba wins over Chipotle.  Both are very near my office but Caramba has a Mexican warmth that no one can match.  The Mexican ladies who prepare the orders are all very friendly, vivacious and humor me as I try to converse in Espanol with them. This food itself is good.  Do not expect elegant plating or fancy sides.  It is what it is: comfort burritos that hit the spot at a reasonable price.", "author": "Ronita J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-13", "description": "I walk by this place every morning on my way to work, and decided to try it out today.  Definitely different than a majority of Mexican restaraunts I've been to; instead of sitting down, it was more like cafeteria style.  Not bad, just different.  \n\nI ordered two soft tacos, one carne asada, one shrimp, and a small side of black beans.  The carne asada wasn't spectacularly seasoned, the veggies in the shrimp taco were a little bland, and the beans weren't fully cooked. \n\nThe staff was super nice though, so I bumped up what was probably a 2star experience to 3.  If you're in a rush and want something fast, I'd recommend Caramba, otherwise, be on the lookout for another Mexican place downtown.", "author": "ashley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-15", "description": "I have worked across the street from this place for over 6 months & finally got around to trying their food this week. What took me so long? Maybe it's the name of the place. It makes me think of Bart Simpson's favorite line \"Ay Caramba!\" \n\nOn the advice of my fellow Yelpers I got the spicy chicken super burrito. It's not really spicy, but oh the flavor! The chicken must be slow cooked (it's nice & tender) with a bunch a green chilies. It makes kind of a soupy mess in the burrito but it tastes delicious. I love the option of getting a whole wheat tortilla too. The burrito makers are quick & efficient & I was in & out of there in a matter of minutes, right in the middle of the lunch rush. \n\nI'll be back to try their chile verde super burrito, which will most likely be a drippy mess too but I'm up for it.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-26", "description": "If this place didn't deserve 5 stars for anything else, it certainly does for this one fact: they will make you a colorado style breakfast burrito.\n\nWhere I'm from, Colorado, breakfast burritos are bacon, egg, cheese and potato.  No rice, no beans.  Many other taquerias I've been to in SF, even wonderful ones, come close but miss.  This place does it right.   *awesome*!", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "Breakfast burrito of chorizo and eggs was AMAZING. It was pretty small, but for $3 I can't complain. Definitely going to be my go-to for Mexican food in SoMa.", "author": "T M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-27", "description": "Everything is great ! My favorite is the shrimp burrito.Get the chips too, they are definitely better than Chipotle.\nI will keep coming back, even if it means a time consuming walk from my office.", "author": "P D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-17", "description": "Excellent sized authentic burritos and great portions. Decently priced and definitely beats a large Mexican food chain that I won't mention. Coming here for lunch, I had the carne asada burrito, which was delicious!!! Their menu also includes a breakfast menu which also looked mouthwatering with different sides to add at your liking. \n\nThere is only street parking as like any restaurant in the city. There is plenty of dining area here though enough for a group of buddies from the office to have lunch.\n\nYou know this place is authentic when they offer \"horchata\" as a drink -- this is one of my favorite drinks. If I'm in the area, this will be another place I'll have to stop by.\n\nHey .... they also take credit cards here too.", "author": "Robb J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "I got a grilled chicken quesadilla. It was very good, huge quesadilla and very tasty for only $5.80.\nThe place had a line but the the service was quick. Will be going there again!", "author": "Paulo C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-25", "description": "I have been eating lots of Mexican, that could explain the additional weight gain on my scale.  \n\nMy coworker brought a Torta back to the office and raved about how good it was.  I love tortas! I haven't had one since college, off the taco trucks.  I rounded up my fellow team members during lunch and got TAKE OUT! \n\nThe torta came with meat, cheese, tomatoes, lettuce, jalepeno's and avocado.  It was warm on top of dutch crutch,. SO GOOD and only $7.\n\nGuess what else they have?! \n\nCARNE ASADA FRIES,. yes,. everything in a burrito,. but on FRENCH FRIES! \n\nIt was delicious,. really heavy and greasy.. it was drenched with guacamole and sour cream.  I felt a heart attack with each bite. One thing I would recommend is to have them fry the fries longer, so they don't get soggy underneath! \n\nI will def be back for lunch,. :)", "author": "Chanel L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-03", "description": "Terrible customer service. Attitude because I asked for a breakfast burrito and it was 10:38, 8minutes after their breakfast time ended. They might have good food, but I didn't stick around to be mistreated as a customer.", "author": "Steven L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-05", "description": "They don't have the \"taqueria\" smell.  Like the salsa bar.  Burrito is ok but too \"loose\" so it falls apart very easily as you eat so best to put on a plate and eat with knife and fork, which takes away the joy of eating a burrito.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-15", "description": "I'm best friends with the super burrito. Get it with spicy chicken, spicy salsa and everything else. Yummy.\n\nAlso, free horchata on Fridays!", "author": "Ben C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-20", "description": "It sounds like most of the reviews here are for their breakfast offerings, I went for lunch.\n\nWhen I first walked in, I had my reservations due to the lack of diversity.  Then I finished my meal and can confirm that this place is perfect for Caucasian people.  Please don't take offense to that, all I'm trying to say is Caramba exemplifies the following:\n\n-Very high level of cleanliness\n-Easy to read, big boards\n-Staff that is 100% fluent in English\n-Detailed descriptions for type of meat, type of dish (enchiladas, tortas, etc.)\n\n^^^ I've noticed a trend of yelp reviewers who use these categories as the main basis for their reviews of Mexican food.  These are of minimal importance to me, when did people start to hate hole-in-the-walls so much?\n\nThe quality of food and selection is decent, but I give it 3 stars because honestly, it's just not my style of Mexican cuisine.  95% of the people here during lunch ordered the most generic thing ever : Carne Asada Super Burrito.  Even more surprising with offerings like Barbacoa on the menu....\n\nI ordered the Chicken Mole super burrito with no rice, just as I do at every other Mexican place I go to in SF.  I'm guessing the guy wasn't used to this request (but handled other requests perfectly like sub rice for lettuce, no sour cream but extra sauce, etc.) because the moment I started to eat my burrito, everything fell out right away.  They re-made it immediately, and the 2nd time around it was wrapped properly. \n\nThe ingredients were undeniably fresh, but the burrito was very bland, even though I asked for him to make it spicy.  Unfortunately, I've become accustomed to this.  So many people with weak tolerances for spice will ask that their burrito be made \"very spicy\".  After enough customers in this category visit a place (happens very quickly), this understandably causes restaurants to not fulfill that request (make it spicy) to the fullest extent (throw some salty jalapenos on it instead).  So when a person who actually wants a spicy burrito (me!) asks for something to be made spicy, they are left very unsatisfied.  It's kind of like that scene in Parks and Recreation when Ron Swanson asks the diner for all the bacon and eggs they have, and he has to say it again to them to make sure they truly got the message and meaning of his statement.\n\nMy normal workaround for this is to ask for habaneros, but of course, due to the crowd this place caters to (reiterating that there is nothing wrong with that, they are simply adapting for the best interests of their business), they did not have any.\n\nSo to sum up, if you're the kind of person who gave El Faro a horrible yelp review because it wasn't clean enough for you, the burrito didn't have enough sour cream, or you're mad that chips weren't free, Caramba is perfect for you!", "author": "Aalok P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-09", "description": "Tired of the usual places for lunch in the area I decided to give Caramba a try.\n\nThere are tons of sandwich places, and the usual lunch line at Chipotle so why not try the unknown restaurant with no line? Ok, so it could have been a recipe for disaster, but it wasn't.\n\nFries! I can't believe that most taquerias still don't have a carne asada fries option or a french fries in the burrito. I suppose my preference for this comes from my years in southern california. Caramba to the rescue!\n\nI had some carne asada fries and I was not disappointed. Service can be a bit slow in preparation, but nothing compared to the long lines at the other options for lunch.  Since I am selfish, I'm glad this place is relatively unknown, keeps the lines short (or maybe I just get lucky when I come here. Either way, I'll take it)", "author": "Glenn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "Amazing Mexican food. Seriously the best in San Francisco! I go there at least twice a week. Great service as well", "author": "Maurice A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "Food: A - Had an excellent prawn burrito, fresh, made to order; salsa bar is a thoughtful way to help enhance food to individual tastes\nPrice: B+ - not cheap, but reasonable\nAtmosphere: C - it is what it is - \"hole in the wall\" - it's not Chipotle, so take out was my preference, but they have places to sit\nService: A - Very friendly, helpful, attentive\nMenu: B+ - traditional quick Mexican food, wish they had soup\n\nOverall B+ - fast, good quality, great service", "author": "JM H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-31", "description": "What can I say...Mexican taqueria in finacial? \nI think it's as good as it gets in this neck of the woods. It's kind of sad because me and Mexican food is like flys to sh!t I just love the stuff! But it's my go to when I'm desperate enough and just can't fight the craving.", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-06", "description": "Delicious ground beef crunchy tacos. Fresh food and prompt service. \nPerfect place for cheap Mexican food that is delicious. Ill definitely be back!!", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-16", "description": "I've went to this place a while ago with work and it wasn't so good back then.  This time when I walked by there was a long line, so I figured I'd give it another try.  I dunno, it could have changed owners or something...\nunfortunately I was wrong, it was still bad.\n\nPrices are good for downtown, but the food was so bland.  I had a taco and enchilada plate and not a thing there excited me at all.  They used the microwave to make the enchilada (which is ok, because everyone does that now), but then I watched them pull my hard taco out of a safeway box.  I dunno, I was just expecting more.  Don't worry though, I'll probably be suckered into stopping by this place another time in a couple years.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-16", "description": "Living in the Mission has spoiled me when it comes to Mexican food. Finding an awesome hole-in-the-wall taqueria in the FIDI = WIN.", "author": "Amber B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-23", "description": "I met my bff at Henry's today for lunch and they were closed. We opted for the next restaurant closest by...which was Caramba. \n\nI got the Banderilla-chicken skewers, which came with rice and salad, Jen got the veggie quesadilla, and we split the menudo...that's right..tripe soup for lunch. \n\nThe menudo was actually pretty good..but the chicken skewers was not good at all. It was too charcoaled on the outside and tasteless inside :(\nI think next time I will stick with something safer..a burrito or taco.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-08", "description": "I can't believe I've worked in SOMA for all these years without me ever stepping foot into Caramba.  Well, popped my cherry today, thanks to Yelp!\n\nCaramba quesadilla (spinach, mushroom and cheese) on spinach tortilla.  Side of sour cream (I'm bad, I know...).  Side of salsa.\n\nSo tasty.  So filling.  Food coma, now.\n\nTotal damage: $5.37", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-06", "description": "Imagine traveling to an unfamiliar city. You arrive at 11pm, when all restaurants and most stores are closed. One store is open, and you grab a can of beans, a jar of salsa, and a bag of chips to take back to the hotel. You microwave the beans in a paper cup. You use the coffee utensils in your hotel room to eat. The chips are yellow and crunchy, but flavorless. The salsa has tomatoes in it, but is otherwise unremarkable. Yes, you will survive, but you will try harder tomorrow to find a real place to eat.", "author": "Brett N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-16", "description": "I ordered the 3 chicken taquitos plate (#4 on the menu). It comes with beans and rice and the taquitos were topped with sour cream, guacamole and salsa on a small bed of lettuce. The cashier asked spicy or mild? I said spicy but it was not spicy at all.. so you need to take advantage of the hot sauce bar to spice it up. The taquitos were STUFFED with a whole lot of chicken meat, but the meat did not have any flavor. It was an OK place. Good for lunch. There's plenty of room inside to sit and eat.", "author": "Kathy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-26", "description": "Real good Mexican food. Reasonable prices.", "author": "Gabriel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-19", "description": "Hard to find authentic taquera-style food in the Financial District, at least the area where I work, so I'm glad for Caramba. I'm usually a big quesadilla fan and I enjoyed the one here quite a bit. It was under six dollars but extremely filling, and anyone who works in the FiDi knows what a rarity that is.\n\nAnother time I had a super burrito which was pretty good, and tried a friend's nacho fries, which hooooly crap, why didn't anybody think of that before / how deadly an idea is that. Bravo, Caramba. Cheap and delicious.", "author": "Dara K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-28", "description": "A bunch of my co-workers used to go to this place quite frequently for breakfast but we've not really had the chance to do that lately. I, being prone to eating early, wasn't ever in a position to join them so I can't comment on the breakfast except for their freakish (kidding) love for this place (or at the very least for the breakfast plates or burritos).\n\nI had the shrimp tacos recently and I loved the way they were prepared. Sure the tortilla was a bit bland but it's a tortilla -- the true goodness was the spicy shrimp with bell peppers. Oh and their horachata is a bit on the creamy side which means it's delicious.", "author": "Shauna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "(1) fried chicken chimichanga\n(2) shrimp burritos \n\nHighly recommend both... although after either of those during your lunch hours, it will put you into major food coma for sure!!!\n\nDecently priced - around $7-8 dollars, which isn't too bad for being in SOMA financial district area.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-01", "description": "Back in the day, both Caramba here and Rico Mex on Stevenson used to be called 'Si Senor.'   While the names have changed, I think it's still the same owners...   Well, at least I recognized the cashier at Caramba.\n\nI got the 3 taquitos especial to go, which basically means that some dude heads out back and throws a couple of frozen taquitos into the deep-fryer...  Some couple of minutes later, he comes back and they ask you what kind of beans you want...  I highly recommend the refried beans, a great choice for plenty of afternoon flatulence.   Of course, it being the especial, they'll ask you if you want guacomole and sour cream.   \"Yes, plenty of both,\" should be your reply.   Might I suggest that you also ask for spicy salsa spread over the whole thing?   So they hand me this to-go box, I pay my $8  (includes a soda), and I head back to my office to eat in front of my computer.   \n\nWhat'd I think?\n\nBaaahhh...  While it was certainly not bad, it wasn't good either... I think Rico Mex is at least as good as this place, and they're closer to my work.   Don't expect to see me at Caramba much... That said, it's solid Mexican food... assuming of course you're never spent a long amount of time in Southern California or, better yet, Mexico... in which case you'll think this food sucks donkey balls.    Of course, if you're a European who's spent all his life in Stockholm and just moved to SF 2 or 3 years ago, you'll probably think this stuff is the best Mexican food you've ever tasted.... and you'd probably be right.", "author": "David O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "The burritos are very good here, better than Chipotle for sure. Each time get a burrito here, I tell myself that I won't eat the whole thing, then devour it within 15 minutes. Food coma!\n\nLove it here.. service is very fast as well.", "author": "Neal P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-22", "description": "Decent shrimp burrito and Chile relleno burrito. I've had better around there. Avoid the ghetto looking nachos though. No bueno! I'd come back for the shrimp tacos though ;)", "author": "Oskar D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-18", "description": "I ordered the bacon and egg breakfast burrito. It looked too skinny, but it was quite filling. I actually kind of liked it small because I could actually bite into the burrito without it falling all over the place.\n\nThis place was decent for being under $3. I was surprise that it was busy in the morning. I enjoyed sitting inside and looking at the nice art decor on the walls.\n\nIf you want to use a credit card, I believe they charge you an additional $.40 or else make sure you have cash on hand!", "author": "CeCe C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-28", "description": "They have a great breakfast burrito and decent nachos but I haven't really liked anything else on the menu. They have a lot of different salsas to choose from which is super cool. The staff is nice but the place can be quite a zoo at times because there is so much chaos going on and nobody knows when it's their turn to order or pay. They need to really get some kind of better system in place. I like going in the mornings when it's slow because there are a lot of tables to sit at and enjoy your morning burrito.", "author": "Dusty N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-23", "description": "Super tasty, moist burritos -- I think it's the saucy black beans -- at a really affordable price for the area. So glad to have such a great taqueria by work!", "author": "Midori S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "Most of the food in SOMA/FiDi area is over priced and not very good with the exception of Caramba. It is exactly what you want when you want authentic mexican food. The breakfast burritos I might even go as far as to say are the best I have had in the city. Simple and delicious and possibly the best hangover cure ever. I have had burritos, tacos, enchiladas, and the taco salad all delicious! Also, the women who work here are super nice. I would highly recommend this place.", "author": "Sophie J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-05", "description": "Meh... so much MEH.\n\nI ordered a super vegetarian burrito, just under $6. It was filled with cold, mushy MEH. My tummy is mumbling insults as I type this... \n\nThere are so many lunch options in SOMA. Pass on this one.", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-13", "description": "$6 for a regular burrito, which pretty much includes beans, rice, cheese, salsa, and your choice of meat. They have extra salsa in a little cart. Oh, and they have diff. wraps as well -- wheat, flour, spinach! I liked having that option, as most Mexican places do not offer that.\n\nWith that said, the burrito tasted really good once it was out of the foiled wrap. However, after several bites, I can taste all the calories, and it was just dunzo from there. \n\nI feel like I could go to Chipotle and get more, or one of those bombass places back in SoCal (: Still on the search for a delicious, cheap Mexican place...", "author": "Evelyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-28", "description": "Really good tostada salad and taquitos! I like their generous selections for meats, beans and salsas. \nThis is the best mexican food I've found in the city. The prices are VERY reasonable.", "author": "Stephenie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-18", "description": "Great Mexican food and affordable for SOMA.  There is no reason to go anywhere else (El Faro, Chipotle, Baja not-so-fresh)\n\nCarne Asada and El Pastor are great, the Mole is surprisingly good, chips are decent, maybe a little salty and yes, they have a respectable salsa bar. \n\nOh...the line moves surprisingly fast..", "author": "Mike V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-05", "description": "I wish these guys knew how to wrap a burrito properly.  I mean, their flavor is decent, but every 4th or 5th time I get a burrito here, it comes out as a big watery mess.  I'm looking at today's version right now and it is quite literally sitting in a puddle on my plate.\n\nOverall I keep coming back because it's nearby the office and reasonably tasty, but there you have it.", "author": "Geoff D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-04", "description": "¡Ay, caramba!\n\nI miss you. Friday mornings used to be our time. After nights like last night (where I may or may not have been sitting next to a girl in a Yeti hat and I may or may not have been wearing deer antlers...at Delirium) I would wake up knowing I could fight the day after taking down a Caramba Combo. Bacon, eggs, cheese, bell pepers, onions, no pico...tear.\n\nThe women there in the morning are so sweet. They would always remember me and my order. Currently I remain the Duchess, but I'm sure Ned L. will eventually dethrone me. \n\nUntil next time Caramba.\n\nxoxo", "author": "Leah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "These are the best breakfast burritos I have ever had!  There is so much flavor throughout the entire burrito.  I wish I lived in town so that I could get them all the time. The staff is so friendly as well!", "author": "Allison G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "This place sorta deserves five stars for what it is: a traditional taqueria but here, in the financial district! How awesome is that? Where else can you get tasty al pastor tacos that aren't served up like a gourmet attraction for $12 a plate? Too bad they aren't open  for dinner. Service is good, food is good, prices are good. Solid four stars. But what really makes this place is that it's close to work and isn't some foofy foody financial commitment. Mmm. My mouth's watering just thinking about those tacos.", "author": "david b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-25", "description": "Very disappointed with my lunch today at Caramba.\n\nI got a Tostadas (flat hard shell tortilla) with chicken, black pinto beans, guacamole and lettuce. The guacamole was okay, the chicken was not the leanest I've ever tried and the tortilla itself was not the kind of tortilla I was used to get when I'm ordering a Tostadada (usually they are golden and cripy, and mine was white/floury and I can say it was crispy).\nAnd last but not least I got charged almost $8 for something that was priced at a bit more than $5 on their menu. This is really disappointing :-(\n\nAccording to other review I read after getting there, this might not have been my lucky day. However since the only thing that was great was to hang out with friends there, next time I will try another restaurant in this area. I won't miss Caramba as I can definitely find much better deal for mexican food in the Mission/Noe Valley.", "author": "Cedric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "Good breakfast burritos. Service is solid. Price is right.  Lines are short early in the mornings but back up at times around 830.", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-21", "description": "The best Chili Verde burritos I've found in the city.!! The pork is succulent and ooooses with tasty goodness. \n\nI use to work around the corner and would frequent Caramba religiously. Since our office moved a year ago, I find myself daydreaming about the Chili Verde every so often. Sometimes we'll even make the trek and pickup orders for the entire company, it's that good.", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-10", "description": "The chorizo and egg burrito is very good! Definitely add papas.", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-05", "description": "¡Ay caramba! This place is great.  Line out the door, but moves very fast.  The nacho fries are an orgasm of flavor in your mouth. Everyone in my office insisted on trying them even though I did not offer.  \n\nSoft tacos were a bust.  I won't order these from here again, although the carnitas meat was pretty good.  The burritos everyone else was eating looked great though.  Will definitely be back.  Get the carne asada in whatever you order. So much flavor!\n\nHappy Cinco de Mayo!", "author": "Jordan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-20", "description": "I got the California burrito. It was good, but not anything to write home about. The line was short, though, so it is a nice alternative to have handy.", "author": "Chris V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-01", "description": "Come here often for breakfast. Its open very early so thats a +\n\nBreakfast burrito with chorizo and eggs, potato, rice, cheese and hot salsa. I feel like its a bit on the expensive side but who cares?\n\nFor lunch, carne asada super burrito, or a carne asada california burrito are good choices too.", "author": "Richard P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-18", "description": "As I started to write my review...I just realized I never got my guac!!!\n\nIn my exploration of SoMa lunch eateries, I went to Caramba with a few co-workers.  It is the closest burrito shop to the office (for all of you purists, I'm not counting Chipotle), and I was fine with it.  They have a wide selection of meats (al pastor - always tasty, typically underrated) and an interesting sequential/parallel process burrito line.  It probably doesn't make sense, but if it looks as though people are cutting in front of you it's probably because there are actually two burrito stations behind the counter - one is ahead of the other...it's not a continuation of burrito station #1.  Anyway, my point is, they have standard fillings, standard service....standard place.\n\nAnd for an additional $0.80 you can get guac...or find out you didn't actually get the guac when you return to the office (or when you write your Yelp review!).  I won't hold it against them - innocent mistake.  But be warned, check for your guac...", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-03", "description": "Decent Mexican food, conveniently located a block from my job. I've only had the sopes special, with carnitas and the works. The plate is decently priced for SOMA, 2 sopes for $5.90. The carnitas is good, hits the spot when you craving. Although last time I had it, it was a bit salty. The guacamole seems like it's blended instead of smashed and it was turning slightly brown. The good think is that they pack it on with beans, salsa, sour cream, guacamole and lettuce. However, beware, you will be full and lazy for your pm hours of work! Lol. \n\nI've heard that the taco truck on Sansome is better but i haven't been. Overall, I'll def be back.", "author": "Dora S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-17", "description": "Ok.. i had another burrito here and I'm adding a stars on again.  I went with a carnitas burrito, and it deifnatly wasn't anythign to write home about, but I don't think they deserve 1.\n\nMenu is really scary looking, with all these additions on pieces of paper.... food is mediocre, but the peopel working are really really nice....", "author": "Joseph F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-07", "description": "Love Caramba!! Great tasty tasty meat options (pastor!!! Nom non nom!) I love everything here from the nachos, burritos to even the breakfast burritos! The portions are always super generous and the staff are always super nice. They also make the breakfast burritos to order so no soggy/cold eggs! Now they even do these crazy nacho fries, super tasty but HUGE i would suggest if you and a friend are both super hungry then get these to share!", "author": "Dominique D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-22", "description": "Caveats to this review:\n- I only tried the breakfast\n- I was really hungry.\n\nNow we can continue.\n\nI hail from the land of dry heat and Filibertos (Phoenix, Arizona), so when I woke up this morning with a hankering for A Bacon, Egg and Cheese burrito, I had a certain set of expectations. Unfortunately Caramba missed on most of them. When I entered the restaurant it seemed to fit the bill. Nothing flashy, a purposeful and thus authentic looking Mexican food shack. Then I saw the price of the Bacon and egg, $2.85. \"Wow, thats cheap I thought\". I should have known. When I received my burrito it was pitifully sized. Real burritos would have looked at this one, and told it to come back when it grows up. A good rule of thumb for a place like this. Your burrito should at least be bigger than what you would get at a taco bell. If you haven't figured it out yet, this thing was ridiculously small.  My phone was bigger. Think about that. 2nd ding was the tortilla. For a place to win on this, they have to use an authentic tortilla. This burrito was wrapped in something bought at the local supermarket and chocked full of preservatives. The salsa inside was tasty, Ill give them that (though not at all spicy, as advertised). \n\nI don't know, perhaps breakfast is not their strong suit. Maybe I should give them a try at lunch. But not unless they get some better tortillas.", "author": "Sean N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "Caramba: I am as we speak fantasizing about your carne asada fries that I'm having for lunch tomorrow. I'll walk many blocks in the wind and traffic for those french fries swimming in cheese, steak, sour cream and guacamole that are so hard to find outside San Diego.\n\nIf you love Mexican, hot and fresh, with an extensive menu and right in the heart of the financial district, you'll love Caramba.", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-29", "description": "Caramba is the place to go for hangovers. And you better get a scrambled eggs chorizo burrito (add beans). One is good enough. It's great for take out, otherwise, they have many tables. This place is usually more full in the mornings and pretty empty the rest of the day. The location is great and the food is affordable. Where else in the area will you find a $2.88 breakfast burrito? No where, but Caramba!", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-05", "description": "I went here twice in a week so we know I don't think its bad.. I actually liked the carnitas taco I had on Monday. Good flavor, reasonably priced, definitely not a bad thing.\n\nI had the torta yesterday with carnitas and jalapenos, I didn't like it at all. It was bland. Which is amazing because usually carnitas on their own are good, but they weren't salty enough and it wasn't cooked well enough to have that lovely outside crisp that I enjoy. I'll probably go back again sometime when I forget my lunch again, so I'll give it three solid stars.", "author": "Analisa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "I was stuffed with 2 tacos (carne asada & carnitas) and a beer.\n\nI thought the meat was pretty salty, but overall was flavorful. \n\nI would definitely recommend this place as a quick meal.", "author": "Anisha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-10", "description": "When it's a cold dreary day out in SF, you're super hungry and having a bad day, and it's past lunch hour...a cheap, warm, and gigantic $6.60 super carne asada burrito is just the perfect solution.", "author": "Sally C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-17", "description": "I went to Caramba on Monday morning for a breakfast burrito. I ordered a breakfast burrito with bacon and it seemed like it was already made (I dont know how long ago) because they took it from one container, put it in the pan to reheat it and done. :( Disappointed! Anyways I decided to give them another try. \n\nI went the next day and order a Popeye burrito which is an egg burrito with mushrooms and spinach. It seemed like they didnt put mushroom because they were cut into really really small pieces, I prefer bigger pieces so it can get more of a taste. \n\nOverall it was decent. The lady that works there in the morning was very friendly though, so they deserved a star for that. :)", "author": "Leslie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-25", "description": "Speedy service and a tasty burrito make this an excellent lunch spot if  you are in a hurry. There is a decent amount of seating if you have time, but this Mexican restaurant shines more on the quality of the eats than the ambiance and the wide variety of salsas to choose from are the icing on the cake.", "author": "Steven G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-19", "description": "This place should be called ¡Ay, caramba!  Apparently people who work too much downtown lose most of their taste buds and the ability to differentiate size.  \n\nThe food is bland and the portions are small.  For $7.00, I expect a super burrito to be SUPER!  Not so for caramba's super...  I would say its half the size of the super burrito from:\n\nEl Burrito Express 1 \n(http://www.yelp.com/biz/el-burrito-express-1-san-francisco)\n\nDon't listen to these 4/5 star reviews and save your money for McDonalds, at least you get your money's worth there.", "author": "Kailo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-15", "description": "I frequent this place often and love it! Great breakfast burritos. I usually order the Caramba salad. Yum! Burritos are very filling too. Very friendly staff and quick service.", "author": "Kristin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-02", "description": "I work around here and this is usually the spot I hit up when I want a burrito. Except every time I have lunch here, I usually get indigestion or heartburn. I know it's not Mexican food in general, since I never get this when I make it or eat elsewhere. The burrito isn't bad, but my tummy tends to hurt for hours afterwards. Anyone else experience this?", "author": "Jenn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Pretty good burrito, cheap, fast and super convenient. There are some places in the mission that are certainly better, but for SOMA Caramba is delicious.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-19", "description": "Absolutely terrible.  If I could rate 0 stars, this Caramba deserves it.  Ordered a combination fajita plate to get a feel of the restaurant's tastes... which were completely absent.\n\nThe carne asada, chicken, and shrimp were ALL overcooked.  Inedible.  If you don't mind burnt meat, you may enjoy this place.\n\nThe beans tasted smokey (smoked beans?), the rice was tasteless as was the meat.\n\nService is non-existent, and if you buy guacamole dip, be prepared to pay extra for chips to dip in it.  Speaking of which the guacamole is definately not homemade.\n\nSave your money, I walked away hungry.", "author": "Loren S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-13", "description": "The burritos are very good, but they are not amazing. They are also realllllly small.  My friend got hers with avocado in it which looked bomb!  I go every few weeks and i will make it a  point to try it with the avocado and see if it makes  a difference.  Its a  great breakfast spot if you have a fix for a burrito.  The salsa bar is also wonderful.  he avocado based salsa is the best.", "author": "Tami G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-19", "description": "copy and pasted from elsewhere because apparently I'm directionally challenged and suffering from short term memory issues and gave this review for another place that I've never been. *golfclap*\n\nShort and sweet:\n* awesome quesadillas, one of the best I've ever had (omg so much cheese)\n* the tacos are *huge* (for tacos anyway)\n* price is pretty flippin' awesome\n\nTwo forks up.", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "Came here for some breakfast the other day and got their veggie breakfast burrito (onions and peppers) with black beans (a little extra), overall was pretty fuilfilling! Service is fine, prices fairly cheap for the area, total came to about $5. Not bad at all! \n\nI usually hit up Cafe Venue on Montgomery for my breakfast burrito fixes, but liked that Caramba offered so many extras. Venue's great but I'd say its a smidge more expensive with less options. Both are awesome in their own ways.. but the veg plus black beans and hot sauce will put it over the top!", "author": "Tejal D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-19", "description": "I'm from Southern California and I know my Mexican food.  This ain't it.  I really wish it was because it's close by to where I am all day and the Chipotle down the street is the stingiest, crappiest Chipotle in existence so I would love a reasonable alternative.\n\nIt's not terrible or anything, but it's definitely not very good either.  Everything I've had is bland and unexceptional.  Anyone who tells you it's amazing is probably from the midwest.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-26", "description": "Chicken tacos were dry.\nCarnitas tacos were mediocre.\n\nSkip it.", "author": "Sarah Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-20", "description": "This restaurant illegally charges the customer a $.40 transaction fee for using a credit card. This is against California Penal Code and also against credit card vendor policies. \n\nWhy should the customer pay for you to do business? \n\nThe nickel and diming here is out of control. A bag of stale tortillla chips will coat you $1. Guacamole is extra, but check your burrito if you order it. I ordered it, paid for it, and found a small fleck of avocado in the entire burrito. \n\nI'm done with this place, their poor business practices and their mediocre food.  \n\nGo to Tropisueno at Yerba Buena lane. Much better food and prices.", "author": "sparkle f."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-13", "description": "Cool spot off Mission. Breakfast burritos are very delicious. The lunch time menu is ok.", "author": "Yonder B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-03", "description": "the new and updated menu features - drum roll please - super burritos de chille relleno - of course i cant pass this up and go to Caramba at lunch - only to be told - that they ran out of stuffed peppers. So props for expanding the menu. And thumbs down for bad planning.", "author": "Oleg H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-15", "description": "I tried this place 2 times.   I ordered a carnitas burrito and the 2nd time a steak burrito.   How can you screw up a burrito?  they did...  the black beans has no taste and were runny.    I even bought chips and salsa....  the chips had no salt and the salsa was greasy tasting and no flavor?  no spice what so ever. Who screws up salsa?????  not too mention when you walk into this place,  you do smell the nastiness of the floor.    Not a clean sign.    anywho I tried this place twice,  and never again.   disgusting!!!!!", "author": "Jerry P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-20", "description": "Average Mexican joint. The chicken burrito was good. \n\nChips do not come with the burritos. They do have a salsa bar though.\n\nEhhh. I wouldn't go out of my way to go here again.", "author": "Chili B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-19", "description": "This place looked sketchy the moment I walked in.  So I saw a sign outside showing, FREE coffee, water, or tea with purchase of breakfeast burrito $3.75+.  I go inside, ordered a bacon and cheese, with cheese (add another 70 cents) total cost of a breakfeast burrito $3.80.  So I asked, \"Does this come with tea?\".  The lady's reply \"No. That is only on Wednesday and Friday\".  I replied back but the sign says breakfast menu and it does not have specifc dates listed.  Then she said, \"Oh that is for lunch only\".  I was thinking why would you have a breakfeast menu for lunch?  Then she asked another co-worker and they said something in Spanish and laughed it off.  \n\nThe breakfeast burrito tasted nasty anyways. YUCK!", "author": "Elliot Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-25", "description": "It hurts me to give Caramba 2 stars since I've had so many good burritos here over the years, but it's justified by the fact that those burritos and the burritos they now serve are not the same thing. It's already a little pricey and small for what it is, but their carnitas was really really good and, most importantly for me anyway, didn't have any fat or bone or cartilidge in it. \n\nNot anymore. \n\nI had a burrito that was delicious until \"crunch!!\" and then \"squishhhh\". If you're like me these are truly horrifying sensations when eating meat. I chalked it up to an anomaly and tried it again and got a good burrito. Yay!! Then yesterday, crunch, squish, ..... BLECH!!!! Sorry Caramba, you made a decision to save a few cents on carnitas by not trimming it and you lost my business. Hope it was worth it.", "author": "jeremy m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-09", "description": "\"Cheese, I need more cheese!?!?!?!\"\n\nSo today, I was craving something somewhat healthy, but with a little more ummpf than a salad and so I searched Yelp mobile and found Caramba. Cool, I can do watered down tacos. And so I hobbled (new heels, gotta love em) down the street to Caramba and checked out the menu on the wall. Ahead of me was a couple, (who please God noooooo, don't let them actually be together or having f'ugly people sex as that visual may scar me for life), who couldn't decide what to order.\n\nI wasn't on a super tight time constraint or anything, but c'mon, it's Mexican food, it's the same 7 ingredients served multiple ways, so pick a presentation and let's motor already. After about 4 minutes (no, I'm not exaggerating), they settled on burritos. Hallelujah! But now they needed to talk the little lady behind the counter through it. Here we go.\n\nAs soon as she grabbed the flour tortilla, this broad was 8 steps ahead of her and asking for cheese. And not in the, \"Hey, I will be wanting cheese at some point, cuz boy howdy do I love me some cheese\" way, but in a super frazzled, amazingly panicked, the world is about to run out of cheese in the next 10 seconds!?!? tone. Jeez lady, calm down. \n\nAs she went down the line, she reminded the gal that she needed extra cheese. Yes, we got it lady, the whole restaurant is with ya, you will get your cheese. As soon as the thing was bursting at its cheesy seams (the burrito, not the broad, although she didn't look like much of a stranger to the effects of cheese, if ya know what's sayin') it was time for her to choose a beverage. Oh Lord, here we go!\n\nBroad: \"Do I like the Negro Modelo?\"\nAnnoyed Male Friend: \"I don't know, do you?\"\nBroad: \"Well I don't remember? Will it go with my burrito? Is it a Mexican?\"\nOver it Male Friend: \"I don't know, probably\"\nBroad: Well should I get the...what is this, the horchaaataaaa drink?\"\nMy New Hero Male Friend: \"Who cares, just pick something!?\"\n\nMan, I love people. Oh, and my two plain tacos were tasty.", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-17", "description": "So... I know I promised an update, and it's a little long in coming (because I haven't been in town in months) but I finally made it back to round out my review of this joint... and dragged along some friends!\n\nThe verdict is that I committed a complete and utter SNAFU the last time I picked up a b'fast 'rito here.  Yes, the chorizo is awesome and savory.  Yes, the tortilla was just as soft and it held everything together just right.  But!  This time... I got more than just chorizo wrapped in tortilla.  And the outcome was magical.\n\nThose \"extras\" that I didn't realize I needed to add to make a breakfast burrito a breakfast burrito last time (say... egg, cheese, and potatoes?) and hot salsa transformed a deliciously greasy and savory wrap into a steamy, filling, nose-sweat inducing, savory breakfast bounty... neatly wrapped in foil.  Y'know how bananas are kind of the perfect natural food wrapping?  Yeah, this foil was basically the equivalent of a banana peel.  Did that make sense to anyone but me?\n\nI'm pretty sure the conclusion by others was pretty congruous to mine.  Mmmm.  And to think that I'm going back to the land devoid of good breakfast burritos.  Stab me in the face.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "$9.5 for a chile relleno and an agua fresca, taxes included. Very nice. The line is long, though, and the tortillas were a little too sticky.", "author": "Bruno N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-06", "description": "What a delicious meal! Sauteed Chicken Super Burrito with oh so fresh and tasty rice, tender and flavorful meat and pretty decent guacamole. It was the perfect meal to rebuild calories lost to Lovefest for sure.\n\nThe prices aren't as cheap as some other Mexican places, but they were reasonable and they accept all credit cards. I had no issue with the service or the cleanliness for sure.", "author": "Ryan V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-25", "description": "Note:  This place is called Caramba now.  Not Si Senior...and it is not closed cuz i ate here today!\n\nDid you know.....\nThat all types of beans give you the same amount of gas? Thats what i found out when i first walked in to Caramba, and the woman in front of me asked that question.  I don't know if i believe that, but I'll take homeboys word for it.  After finding this out, she opted to get her burrito no beans.  Is that even a burrito anymore?\n\nI got  the vegetarian supreme burrito...it was tasty.  I hope black beans are less gassy than the rest.  For your sake.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-27", "description": "I'm not a big fan.  From the stern strictly business service to what I feel are largely bland burritos, it's hard to get excited about going here.  Guacamole costs extra and the amount that they is put on can best be described as a stingy smear.  The salsa bar is a plus...and unfortunately necessary to add some much-needed flavor to the burritos.\n\nThe tasty burrito drought near SF MOMA/Yerba Buena continues...hopefully a much needed burrito oasis will come to this area someday.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-12", "description": "To be fair, I'm not the biggest burrito lover out there.  And, I made the silly mistake of ordering the shrimp burrito here, where it soon became obvious that the shrimp had been languishing in their pool of ranchero sauce for an indecent amount of time.  I'll feel lucky if I don't get food poisoning because there was a tepid, bacteria-loving temperature to the shrimp and a mealiness that does not portend good things.  Other than that major drawback, I guess the burrito was okay.  I mean, it's hard to screw up a flour tortilla, right?  So let this serve as a warning: don't order the shrimp burrito.  \n\nAnd I just want to take a moment here to express my love for soda that comes from Mexico.  God bless Mexican soda.  They use real sugar, not HFCS.  Mmmm . . . Jarritos mango soda . . .", "author": "Chalk A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-29", "description": "This review is only for the breakfast burritos...  After a long hard night of drinking my body was craving some greasy food and when my co-worker suggested breakfast burritos I knew that was what I needed to get through the day.  On the outside this place looks kinda janky... I mean there's not even a sign that says Caramba, it just says Mexican Food...ignore this.   \n\nI went a little overboard on my burrito and added pretty much every extra side available.  It started out as an egg and chorizo burrito...then I added potatoes...and cheese...and guacamole...and two salsas.   It was worth it though, my burrito was greasy and good and the combination of chorizo and potatoes was delicious.  Next time I would lay off the salsa in the burrito though, it just made things a little too watery.  And, for about $5 it's not a bad deal either.\n\nIt's not the best Mexican Food around, but in terms of Soma, it's pretty good and I'll be back for breakfast burritos.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-05", "description": "Congrats, you piece of shit taqueria. You've managed to make 360 Degree Burritos look good. In between the wack-ass service, the carne asada that was oversalted to hide how long it was kicking it on the steam table, and terrible salsas, you reminded me why I never should get a burrito outside of the Mission. Worse than the burritos I've had in LA, and that's saying something.\n\nI'm gonna go make myself throw up now, because I don't want you inside of me. Taqueria San Francisco -- expect me there, tonight.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-13", "description": "Yum.  They open at 7a and some days, I just needed that kick in the pants.  I'm no longer in the neighborhood for work, but there was many a morning when nothing but a bacon + egg burrito with hot sauce would do me right.  Even at 7a there would be people in line.  The woman who takes your (breakfast) order is the same who cooks the eggs on a tiny hot plate behind the register.  Bonus - you can watch them making the guac for the day while you wait for your breakfast burrito.\nIn all honesty, the tortilla is a bit gummy, but I scarf it down nonetheless and am ready for the day.\nThe two women who work mornings - always the same - are always pleasant and end it with a \"have a good day!\"\nAll this for like three bucks.", "author": "Meg W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-24", "description": "I gave Caramba a try to day and it was pretty good. \nThe line moves very fast, so you need to know what you want when you get up to the counter. I had the steak burrito w/ out beans  and a can of diet coke for $6.50, not bad!\nMy only complaint is they had REALLY loud music playing. I know, I sound like an old lady, but it was loud! One guy even got up and moved away from the speakers.\n\nUPDATE 1/29/2007\nWent back today for lunch and the music level was much better! Also happened to see a yelp crew of four walk in. Can't wait to see their review!", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-09", "description": "This is my go to Mexican Food shop when I'm craving it and I'm at work.  Their stuff is kinda pricey, but it's not too bad.  I like coming here in the mornings for their breakfast burritos...they are so yummy and I like their Nachos for lunch time.  I prefer getting their Chicken instead of their Carne Asada.  I'm pretty picky when it comes to my carne asada cravings since i'm originally from San Diego and nothing beats the Carne Asada in SoCal.  This place has a pretty good menu.  It's definitely worth trying.", "author": "Leah A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-23", "description": "It's my boss' favorite near-work restaurant, so I don't have much of a choice about this one.  It's your run-of-the-mill, average burrito shop, one of very few in SOMA.\n\nBut, despite my occasional transgressions, this place does not deserve to be patronized.  Si Senor is the restaurant that paid illegal immigrants less than minimum wage, then retaliated against them when they tried to claim restitution (here's the Chron article: http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2006/05/11/MNGR8IPK9E1.DTL ) .\n\nThe liberal guilt factor is not worth their mediocre (and occasionally soggy) burritos.", "author": "Sharon M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-07", "description": "I go here about once every two weeks or so. Its convenient to the were i work and its cheap! It taste pretty good too. I usually order a vegetarian burrito with cheese, rice, sour cream, guac, and beans. You can also choose your choice of wrap. They have flour, wheat, and spinach. The line always moves super quick, and you can usually find easy in door seating. Overall this place is satisfying for lunch.", "author": "V I P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-02", "description": "Great spot for a quick lunch to go! The burritos have the perfect ratio of ingredients and the meat is always flavorful. The line often stretches out the door but they move really fast.", "author": "Neil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-14", "description": "Staff was friendly and fast. I went there for a breakfast burrito, which I felt was small for the price (~$5). The burrito was \"just okay\"... Potatoes were mushy; the \"hot\" salsa was mild; the eggs were a bit grainy. I'd go somewhere else before going again.", "author": "Levi B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-24", "description": "Good solid authentic burros and Mexican food for a quick stop on lunch.", "author": "Jase O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-31", "description": "Ok, so, I'm not getting all the positive reviews for the Breakfast Burritos.  I ordered a simple Chorizo & Egg Burrito with potatoes and cheese.  Service was very scattered, they couldn't figure out whose order to take, but my burrito was made pretty quickly, though the joint was empty at 9 a.m.  \n\nOn to the burrito....my first impression.... \"Man that sucker's tiny!\"  Like itty bitty.  I know it's breakfast, and I know it's the financial district, but I could have gotten a bigger burrito at McDonalds.  And it came to over $4 dollars.  The chorizo wasn't too plentiful and cooked directly into the eggs.  I counted about 4 small chunks of potato, which I paid an extra $.80 for.  A decent sprinkling of cheese, albeit flavorless cheese, but it was there and only $.06 extra.  Couldn't find the salsa in there, thankfully I brought some back with me from their salsa bar.\n\nAll in all...below average and disappointing.  Toall the reviewers that raved about the breakfast burritos:  Seriously guys, get out to the Mission once in awhile.", "author": "Yolanda B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-17", "description": "Why can't anyone in the Fidi/SOMA area make a decent burrito?!  \nWent here today for lunch hoping to find something better than Chipotle or Il Faro.  I hate to say this, but Chipotle is better.  The veggie burrito w/guac that I ordered was bland and just icky.  There's some kind of weird black-magic synergy between the rice, beans, etc that makes a burrito good.  This place doesn't have that.  Furthermore, their ordering system (or lack thereof) is annoying.  The people taking orders mixed mine up with the guy standing next to me and spent the next several moments trying to figure out who got the plain tortilla (me) and who got the sun-dried tomato tortilla (him). One star for having an okay salsa bar, and one star for being close to work.", "author": "Michelle A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-18", "description": "This review  is only for the breakfast burritos.  I work within a few feet of Caramba and I used to stop by in the morning because they have cheap and good breakfast burritos. They are small and if you get just the ham and egg, they're pretty healthy.  I used to love them.\n\nWhat changed?  The OIL.  They started using so much oil that when you unwrap the foil it actually drips out all over your hands and desk.  I've asked them the last two times to not use oil (or at least use a very small amount) and still, absolutely dripping.\n\nI've given up.  I may still go in for the veggie tacos on lunch, since they don't drown those in oil.  But no more breakfast burritos for me.  Bummer.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-04", "description": "French fries in a burrito are good.\nit's not my favorite mexican restaurant by any stretch, but for something different and just plain bad for you, it works.", "author": "Nedra D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-14", "description": "I go here fairly regularly for lunch.  The food is decent.  Not great, not horrible.  They're pretty quick with getting your food prepared.  However, there have been a couple of times when they're extremely busy (which is often) that they've messed up part of my order - wrong type of beans, salsa, etc.  You'll see other people in line correcting them with what they're doing.  Be attentive to get what you want.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-15", "description": "My fiance found these reviews and suggested we go to lunch. So we did and it was suggested (by these reviews) that before you die, you need to have their carnitas burritos.\n\nSeriously, when in between beans, rice, cheese sour cream, guac and tortilla, you get a delicious mouthful of perfectly shredded almost grilled flavor of pork in your mouth, you have totally hit a winner. I've never really been impressed with carnitas before, but this truly showed me the love, flavor and goodness of what carnitas can be. \n\nI'm very eager to try their other burritos and I would highly suggest trying this place. When we went at lunch time, the place was packed, but the line moved incredibly fast and it wasn't hard to find seating. \n\nGo. Treat yourself to some burrito loving.", "author": "Jacqi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-13", "description": "Good food and cheap prices.  The menu is basic, but good.  I like the Carne Asada platter which comes with tortillas, rice and beans.  There's also a salsa bar.  Their breakfast burritos are good as well.\n\nThe seating area is not exactly upscale, but I can live with that.  They are open for breakfast and lunch, but not for dinner.  They are open only on weekdays.", "author": "hoo d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-13", "description": "Okay, look. Here's the deal. All I've ever had here was a super veggie burrito. But I've had it a bunch of times. And it's perfect. Rice that stays out of the way, really good guac, packed with black beans and sour cream. What more do you want out of life?\n\nThey accept credit/debit. Take that Farolito.\n\nIf your main complaint is that your burrito isn't big enough, learn to eat less. Yea, it's more expensive than it should be, but it's 2nd/Mission. Good luck finding something that isn't.", "author": "jared c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-06", "description": "What can I say?  I'm suffering sour cream withdrawal after the incident at Chipotle where the burrito wrapperess' Engrish trumped my Engrish.\n\nThe usual suspects: Lou, Tori and I.  \n\nI asked for a Carnitas burrito with sour cream (it would cure the tremors that I'm suffering).  It was decent enough.  They charge $1 for the sour cream though.  I'm not digging that too much.  After all, the only money that grows on trees is also the tree that sprouts stem cell research openly, freely and with morality intact.  Ah, that's too much credit, it was only a burrito.\n\nCan you guess what Tori got?  Yes, yes she did.  The chicken burrito with guacamole.  Predictable, in that good way, in the way one comes to appreciate, like the bus always arriving in the morning.\n\nLou also got a Carnitas Burrito.  Nom nom nom.\n\nThe Carnitas here was pretty darn salty.  And although I really like my salt, my lips are still chapped from this experience.  it was like I trekked through the darkest Tibet, wind-blown like Brad Pitt, but ever so much more swarthy.  The skin, it peels away from my lips, tender, gently I lick them, and then they crack like a fragile month old egg that has been neglected in the corner by a scrabbled brained bird-mommy.  My lips are still chapped, a good week after this incident.\n\nThe two star advantage here, the thing that will make me come back and beg on my bruised little knees: FREE HORCHATA and hot sauce so spicy, my SCALP TINGLED!  \n\nDo you know how long it's been since anything excited me to the point where my scalp tingled?  Not since that Tiajuana winter, not since Pedro was traded to the Yankees, not since I started using Head and Shoulders Sensitive Skin Shampoo has my scalp tingled.  Ah, the memories, fondly, of youth.  \n\nFree horchata and hot sauce that makes my skin crawl up and down my spine.\n\nOnly bad thing is that this place is also open crazy stupid FiDi hours.  Like 7am to 2:30 or something really really odd.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-05", "description": "Love, LOVE the burritos here. I always get the same thing: A veggie super burrito with lettuce covered in enchalada sauce. It's always perfect and delicious. They have yummy pico and chips too. Their prices are great and the staff is friendly. Great lunch spot!", "author": "J D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-17", "description": "For my first day of training at Learn IT, I ventured over to Caramba to test their burrito mettle against my tried and true North Bay favorites.  The price was right, the portions were a touch small for my liking.  Generally I like to be busting out of my pants after eating a big lunch, but the portions should be sufficient for those of you with sound judgement.\n\nWhat can I say? I recommend asking them to put a bit of mild salsa, and a bit of the hot.  Mild is too weak, and the hot is pretty effing hot, so the mix is perfect.  A regular burrito will run you just under $6 after tax which is a bargain almost on any metric.\n\nA regular burrito comes with the industry standard meat, beans, rice, salsa.  The downside to my experience was that the carne asada I had was dry and too salty for my liking.  The price is right, but perhaps a different meat choice would push this place to 4 star status.  Still, a great place to go if you are on a budget.\n\nAs with most places, it's best to beat the lunchtime rush, I came in around 11:45 and didn't have a problem getting a seat. It's a real short walk from 33 New Montgomery, under 5 mins.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-03", "description": "Service was quick and the people were friendly. I wouldn't say it is among the best food I have ever had at a taqueria. It was the closes one to work during my lunch break.  I had the chicken fajitas and chips. The fajitas don't come out sizzling hot on a pan like you would see at other mexican restaurants but it was adequate for my hungry stomach. Their salsas were freshly made and the corn tortillas were warm. Their prices are definately reasonable so it is worth going  back to...especially when your stomach is growling.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-23", "description": "I come here at least once a week for lunch because I have a serious hankering for Mexican frequently. I really love the carnitas here. They're a bit salty so if salt isn't your thing, this may not be either. The burritos here are large and packed with goodness. You get your choice of beans, choice of meat, choice of hot or mild salsa, they will ask you if you want cheese, guac or sour cream. I always ask for some cilantro inside mine and they always oblige. The good part is that it's inexpensive! Great lunch choice for the budget conscious.\n\nOh, and before I forget to mention it, I've been here a few times for breakfast too. The egg, potato and chorizo breakfast burrito is also off the hook! \n\nIn summation, I LOVE THIS PLACE! Awesome food for cheap = happiness!\nOh, and", "author": "Amy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-01", "description": "No Senor, I don't like to pay extra for a small bag of chips.  Can't you just throw a handful on my plate?\n\nI had the enchilada plate with rice & beans--one enchilada with chicken, the other with ground beef.  The chicken was fine, apparently shredded (not chunks), but not very tasty.  The ground beef was better, and made the enchilada taste...better.  The enchilada sauce was the standard red routine, not especially tasty and nowhere near the enchilada sauce perfection of Casa Mexicana I.  Rice and beans were fine, but again, nothing special.\n\nDecent enough fare, and reasonably priced, but nothing to write home about.", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "My new favorite mexican restaurant.  The food is authentic mexican and very delicious.  Out of all the mexican joints in the bay area, they have the best customer service by far.  They are very friendly and are very generous with the toppings and the food in general.\n\nI recommend the vegetarian burrito w/ enchilada sauce.  You get a huge burrito with rice, beans, cheese and salsa for under $5.", "author": "Mack D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-11", "description": "Too heavy on the vegetable oil and the pinto beans didnt even have enough salt. Not the cleanest place. \nI came by before 7am and got breakfast here. They were scooping guacamole (?) out of a bucket with no gloves and using a steel bowl. No hairnet, just really down home.\nIf a server is sick or has sniffles there are NO precautions.", "author": "Nan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-31", "description": "Another great spot downtown to head to for lunch. I got a delicious (and large) carnitas burrito (about $5-6). Their salsa bar has a great guacamole salsa and a spicy habanero sauce. My mouth was pretty much on fire, and yes, I ate the whole thing! Next time I want a great burrito I know where I will going!", "author": "Casi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-21", "description": "Best Breakfast burrito in the city! Also think the Salsa Verde is the best I have ever had. It is not available for breakfast, they only put it out for lunch. But Oh LA LA - do I love it. \n\nMeats can be a bit salty and suspect but everything else is very fresh. My staples are the veggie breakfast burrito (eggs, peppers and onions) and the veggie taco for lunch. I go there about 2-3 times a week.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-14", "description": "Not sure what the fascination is with this place. There's a crazy-ass line out the door at lunch time. Got a pretty tasty burrito here because I waited until 2pm, and there was no one in the place then. Cost me over $7. I think I'll stick with Chipotle if I'm gonna spend that much money, because the burritos are much bigger. I'll probably be back if I end up around there after the lunch mob dies down.", "author": "Mike T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-28", "description": "Note: they changed the name of their ever popular \"Si Senor\" breakfast burrito to \"The Caramba.\" I get it with chorizo, and it's absolutely amazing. Best breakfast burrito in SOMA and I guarantee there are at least 9 employees from my office that will be ordering these on any given weekday.", "author": "Brianna H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-16", "description": "Lauren S is right -- this place is alive & kickin', but under a diff'rent name: Caramba.\n\nChicken burrito was standard. Pretty good, but I wouldn't advise anyone to make an effort to come here unless they needed a lunchtime burrito within a one-to-two block radius of their work.\n\nCaramba is just a'ight.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-16", "description": "Not the best buritto in town but not the worst. These guys are basically consistent and fast. Not as fast as Chipotle but not as tasteless either. So it balances out. I usually come here when there is a line at Sentinel and I don't feel like walking to Los Compadres Taco Truck.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-22", "description": "Lunch. Burrito. Salsa Bar. Quick. Seemingly healthy. Less than $5 with tax. Hooray.", "author": "Nikhil N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "i just love this place for two items only: either the carnitas, or al pastor (delicious) burritos. AND the breakfast burritos.  The BK Burritos are delicious and Cheap 2.75.  It comes with potatos which makes them so much better.  They are my go to shack when im downtown!!!!!!", "author": "Ishtar P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "Yes...breakfast burritos.  Perfect size and shape.   Yes my burrito was dripping from the oil of the cheese and the salsa.  It was cheesy and the eggs were freshly mixed with the potatoes right in front of me.  They also give you an option to go with a whole wheat tortilla.  Much better breakfast burrito that Rico Mex.  Poo on you nay sayers, SNOBS!", "author": "Ronjini M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-30", "description": "Food poisoning.  My coworker and I are both sick.   Someone else in the hall is too.  Not OK.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-29", "description": "Just when I was about to give up hope...\n\nFinally, a good Mexican joint in SOMA.  Fresh ingredients, tasty tortillas, and superb mole chicken.  Fast, fresh and, thankfully, not chipotle.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "Good a$$ veggie burritos that are affordably priced - I'm SUCH a fan of this place - I just wished they stayed open for dinner and opened a location in Oakland or Berkeley!", "author": "Always H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-17", "description": "Great little hole in the wall.  Don't worry if the line is long- it moves fast.  I had the tacos and they were stuffed with meat.  I bought three, probably could have gotten away with two.\n\nThe \"nacho fries\" looked awesome but they were probably 8,000 calories so I passed.  Maybe next time.", "author": "Danny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-23", "description": "One of the best Mexican food I have tasted in a while. The service is fast, very courteous  and the food is flavorful, portions are very good and it is very reasonable. (Cash only has its advantages).\nThe Fajitas, Burritos, Salads and best of all the fresh made Salsa, I have not been disappointed any time I have been there.", "author": "Yoddha Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-30", "description": "Let's get right to it: to me, a burrito tastes like a burrito no matter where it's from. More important to me is how easily it can be eaten. This was a loose, juicy, sloppy burrito -- I got my hands all messy and didn't even feel like finishing it.  With so many places nearby that offer better packaged burritos, I'm going to be picky about this.  +1 for accepting credit cards though.", "author": "Adam D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-19", "description": "Disgusting! \n\nThat's the only word you need to understand how bad this place is. I ordered 2 enchiladas one Carne Asada and one chicken. The meat was burnt, and very dry. \n\nThe most amazing thing was they put my enchiladas in the MICROWAVE !! Anyone that rates this place 4 or 5 starts in a complete idiot, just for this reason. They nuke your food !! I also got a large side guacamole and they charge me for chips. Did they think I was going to eat a half pound of guacamole with a spoon? \n\nI will never go back to this place, and I will never recommend it. There are so many better Mexican restaurants in the area I don't understand how this place is still in business.", "author": "D. X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-20", "description": "In the downtown/SOMA area, Caramba is the best taqueria around. Come early enough on some days and horchata is on the house. I've been ordering carnitas however they can make it - on tacos, burritos, sopes, whatever. The breakfast burritos are super filling. The people working there are super nice too.", "author": "Vien T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-18", "description": "They are great to hit up for breakfast. There have been countless times I have shown up for work, just leave my office and go there to pick up some Huevos Rancheros...it is really good.\n\nLunch and dinner, however, does not seem to be where the focus is. On my lunch break the last few times have been disappointing. I ordered a burrito one day and then a super burrito the next and there was virtually no difference in size between them. Super means more of something...an article of a superior quality, grade, size, etc. Well I guess it had more of a quality but lack of size minimized the enjoyment experience.\n\n3 Stars.", "author": "James J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-13", "description": "My lunch here at Caramba was a bit of an impulsive choice- I had originally come to the area with the intention of eating at the Chinese place a few doors down.  Unfortunately the Chinese place didn't seem all that appealing once we took a look at the steam table selections and we walked out without having a real clear idea of what we really wanted to eat.  Short on time, we saw Caramba and decided to get Mexican for lunch.\n\nCaramba does have some interesting menu choices (fries in your burrito?) but we decided to go with the steak torta and an order of with al pastor.  Both items were okay- nothing particularly wrong with them but nothing spectacular either.  The steak torta came with a decent amount of grilled steak pieces (got a hint of some smokiness), as well as a liberal amount of refried beans, some pickled jalapeno slices, large slices of lettuce, some onion, and a small smudge of guacamole on a Dutch crunch roll.  Not sure that the Dutch crunch went all that great with the ingredients but at least the bread didn't get too soggy from the beans.  As for the nachos, we were disappointed that they placed the nachos in the microwave in order to melt the cheese.  The al pastor was just okay- the meat was chopped up in pretty small pieces so I wasn't really able to get a decent taste.  Their guacamole and sour cream were a little on the runny side, but other than that, its hard to mess up with nachos.\n\n3 stars- not the best Mexican I've had by a long shot but it was decent.  I just wish they kept an eye on their salsa bar and the water containers- we were there not long after the lunch rush and the water was pretty much gone while I snagged one of the last two salsa containers.", "author": "Angela H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-08", "description": "Gotta ding them. Today I went in for a burrito. The employees seemed to have a little trouble directing the flow of traffic and this before a huge line of people came in. (Perhaps that's what caused the backup.)\n\nI ordered a Super burrito (which comes with guac and sour cream, but I requested no guac). The cashier called out for a Regular Burrito. I started up, remembered what I ordered, and waited.\n\nThe woman who made my burrito told the cashier it was for me, who then motioned it to me in the \"oh, this is your order after all\" sort of motion. I said I wanted a Super Burrito. Cue discussion. Burrito maker said I got a Regular one due to no guacamole. I glanced up at the sign and it says on their menu that a Super comes with BOTH sour cream and guacamole.\n\nI said this to her and she said, \"It's fine.\" Not that she put it in there, but the words, \"it's fine.\" The gentleman who was involved with the traffic direction issue said to me, \"That makes you feel really confident, doesn't it?\" I agreed.\n\nSo I paid and got chips. I went back to work to find my suspicions were confirmed. No sour cream. I'm also docking a star for their super bland salsa. What happened? It used to be spicy! I even tried scooping up the salsa juice, but it was like eating chips with tomato pieces. \n\nIt's a real pity, because I'm picky about my burritos and this place has chips consistently. And to be fair I was NOT charged for a Super Burrito. But I only said I didn't want guacamole, not sour cream. Clearly the burrito maker didn't want to admit her mistake.", "author": "AccioSoyMilk .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-13", "description": "My mom is probably the best chef there is....and I'm picky when it comes to mexican food bc I know how things are supposed to taste to me, and THIS place is right on the spot!! Breakfast burritos are almost the EXACT tasting as the one mom makes. And the salsa are the best also! Cheap food, filling food, and fast!", "author": "Norma M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-22", "description": "This was packed during lunch......so i figured it must be good.  It was good...great assortment of dishes.  An excellent option for great food on the go. They do have limited sitting...so make sure to be early if you want to dine in", "author": "JAN I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-06", "description": "As a selective trend follower I selected to follow the trend of Thursdays being the new Fridays last night 1 because I'm super chic and 2 because I really wanted to get hammered and I'll take any excuse (from not wanting the booze to go bad to my crippling loneliness). So Friday morning I joined the ranks of the super hung over co-workers and in between the naps I was trying to sneak in and the intermittent paper shuffling sounds I would make to sound like I was working I realized two things: sacrifices must be made to be super trendy (such as work productivity and the contents of your stomach), and I really needed something greasy. \n\nSo for lunch me and a co-worker decided to get Mexican for lunch, and we stumbled upon this place in our search for anything with a cartoon sombrero on it. We chose this place because of the fancy décor in the style of: Every Other Mexican Food Joint EVER, and that they had a salsa bar of lies and deceit (will explain later)....no, I'm going to explain it now..... no, later. So I decided to get the chicken chimichanga and when I got my order the chimichanga turned out to be dream crushingly small (because most of my dreams involve a comically huge chimichanga). They did provide filler beans and rice and the whole plate turned out to be surprisingly filling, but what they didn't provide were the chips. I assumed from the open salsa bar that they would have chips available (hence my cordial nick name of the salsa bar) but instead it was offered in a zip-lock bag for a dollar, ONE WHOLE DOLLAR!! That's like twenty nickels! You know how many bags of candy I could buy with twenty nickels, and a time machine? Like twenty! \n\nThe cashier was pretty friendly and upbeat and they do have free Horchata which made it better and overall the food was pretty good. The chimichanga had the right degree of crispiness and some of the salsa was surprisingly spicy. Despite the small size and what looked to be a precooked chimichanga, the meal was surprisingly satisfying and afterwards my desire to leave a flaming bag of dog poo in front of their door after I ring the bell and run away has gone down from a must do to a slight yearning. \n\nSo over all this place offers a good meal with many different choices besides burritos (they have the option of adding fries INTO any burrito or dish they have). The downside is that the chips aren't free, but hey, you do get a free zip-lock bag with the chips you buy, and that zip-lock bag really decorated my trash and added much needed differentiation.", "author": "Youchen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-26", "description": "For what Caramba is, it's 5 stars. It's tasty, fast, super-filling, and affordable. I recommend the super burrito with chicken, no rice. Expected bill $7-$8.", "author": "Tushar K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-19", "description": "Its right behind an AAU building- but considering Chipoltle is right in front of an AAU building and has more hype- students go there. I am almost greatful, this place doesn't get much business- it's lunch only, they close at 4pm. A  few $'s cheaper than Chipotle with more authentic cuisine and alot more options. This place is awesome. I've been here twice and had the chicken quesidilla- the best mexicn BBQ chicken i have ever had. I have never had chicken so tender in my life. Amazing flavor and authentic. All the workers are mexican and eat the actual food on breaks which is a good sign- a mexican friend of mine said that this place reminded her of the mexican family restaurants back home. It's the type of place you can come in and dine alone without feeling like a total loner like i did for an early dinner lol. Decent sized place. Doesn't matter if you wait in a line or not they take your order upfront depending on who got there first. They yell the orders out when they come and you pay to the right of where you ordered. Food is fast and good, they charge extra for sourcream or guacamole but when she asked if i wanted sourcream she did not charge me. Nice ladies nice environment including some even more secluded corner tables if you want more privacy. Never really crowded- they just close super early. If people go to Chipoltle over this place they either don't know the area, or this place is sadly closed. It's next to a bar that opens late at night and god they would get such business if they were open later! This is the place and the food is always great with large portions and is very cheap. Bang for your buck \\^-^/", "author": "Brittainie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "It's actually pretty good. I am a chile relleno guy and they have good ones.", "author": "Dougaldo C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-13", "description": "This place is on my way to work and on the mornings when i need a real breakfast I'll stop here and get a Popeye Breakfast Burrito. They are delicious! It has spinach which is why it's called Popeye. The portions for breakfast burrito are not huge, so you can eat it and not feel gross. The price it right, they are under $4. People are nice, you can't go wrong!", "author": "Colleen m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-21", "description": "Good Place for lunch.  Tasty carnitas burrito and a welcomed retreat from other places in the area.  It does get popular around lunch.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-06", "description": "Worst taco in the city. A gross mess unceremoniously slapped onto a plate, which just happens to have a corn tortilla underneath it. No art in its construction at all.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-29", "description": "One of my favorite lunch spots in soma! I was really surprised that the carne asada burritos rivals those in the Mission and Fruitvale. What more could you want for under $8 :)", "author": "Kirk R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-11", "description": "If you love yourself some carnitas burritos like I do, then you NEED to hit up this place. I used to work around the corner from Caramba and I think I came a bit too often, now it's like a 20 minute walk so I only get it on occasion, and what sweet occasions those are! I have never had anything else here besides the carnitas burrito, but really that's all I need...my suggestion to take your burrito to the next level, add some cilantro! I have an obsession with cilantro, but I truly believe all people should be as obsessed as I am cuz it's THAT GOOD! I got a burrito, chips and salsa (unlimited salsa bar...you can see my feelings about those who limit salsa in my review of Los Socios...cerdos...) for less than $7. Their green salsa is my favorite...but if you can handle it, my true fave is mixing their green and red together, so deeeeeeelicious!", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-19", "description": "Very good carnitas, I stop by here on the way back to the office from the gym.  Reliably good burritos, friendly staff, the owner is always at the register.  Good salsa verde.  -1 star for no free chips.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-02", "description": "This place is seriously awesome.  I go here for lunch often and sometimes for breakfast.  Their burritos are good portions, and love the prices for breakfast..", "author": "Raja D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-13", "description": "Wow... this place is good!!\n\nCaveat: I'm a vegetarian, so can't comment on the non-veg options.\n\nI generally go for a straight-up veg burrito-- rice, beans, cheese, salsa.  Everything here is spot on... the ingredients are fresh and the burrito is packed well.  On top of that, the salsa bar has some really kick-butt salsa.\n\nNow, generally, I will just get my burrito and that lasts me through the day, but on two occasions I've ordered the \"wet\" burrito... warning: only order this if you are very hungry.  For some reason (perhaps because they don't have to wrap the burrito in foil), there's just a lot more of everything in the burrito and their enchilda sauce is brilliant.\n\nI'm getting hungry just thinking about this place.", "author": "Sunil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-28", "description": "Simple burritos, but it hit the spot for being in my neighborhood. I was able to get a nice small veggie burrito. It really was just what I wanted, but I admit that their prices were kind of expensive. I was amazed that it was going to cost me close to $7 for two regular tacos. It still beats the pants off Chipotle when I have a burrito craving at lunch time.", "author": "Netty L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-31", "description": "I go there regularly. I usually get the veggie taco, which is super cheap and is a heap of food! They also often offer free agua fresca and have a salsa bar. Worth eating at!", "author": "Tim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-13", "description": "Si Senor's burritos are waaay better than Chipotle's. The spicy chicken salad and tostada are muy delicioso.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-03-21", "description": "it is not chipotle. that's about it.\ntaqueria no-no: chips are not included. what the hell? minus a star!\n\nwhy isn't there a decent burrito place in this area?!", "author": "Adrienne Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-30", "description": "Super carnitas burrito is really good -- not too big, not too small.  I've also had the taquitos, which were OK.", "author": "Mitzi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-24", "description": "The steak burritos are good, and it's a nice place to eat lunch by yourself, but the five-star rating goes to the highly addictive breakfast burritos. Unlike the pretentious overzealots who add things like black beans, or worse, spiced potatoes!! to breakfast burritos, Si Senor makes them like you would if you were in your house at home watching DVDs of tv shows. This review just got a bit too personal. Eggs, bacon, salsa, cheese, that's it. Every morning on the way to work I wonder if I should stop and get one. I could probably build a shelter for the homeless out of all of the breakfast burritos I have consumed there this year.", "author": "Caitlin P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-31", "description": "Decent burritos in the Yelpborhood.  I like to sit in the window and watch people walk past.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-21", "description": "Whenever my friend and I meet up for lunch during the work week, we can never resist this place.  Our favorite is the enchiladas which also come with rice and beans.  I've also had burritos and tacos here, but can't get enough of the enchiladas.  They also offer french fries in your burritos which I've never had here but am definitely a fan of in general.  Also can't beat coke in a bottle.", "author": "Emma S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-21", "description": "I Love the taste of their food but, They never get the order right especially on take out...Never more frustrationg then getting back to your office and have you mouth watering only to find out it's not what you ordered ARGGGG!", "author": "Paulette J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-28", "description": "The Burritos here are really juicy and filling and the price is pretty good.  They give you chips (but not many) but you can purchase s pretty good sized bag of chips for $1 and they have a good Salsa Bar.  I'm a fan.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-05", "description": "Easily the worst burrito I've had in San Francisco. Carne asada was in no way fresh and lacked any flavor except a slightly rank saltiness. It reminded me of a cabeza (head meat) burrito I had in the Mission, except in a bad way. Despite ordering the \"spicy\" salsa, the entire super burrito was a flavorless mush. Didn't help that everything here -- the salsa, the sour cream, the guacamole -- seemed to be two parts water, one part substance and one part blugh. Was also an unusually messy experience -- kinda like trying to eat a tortilla filled with a soupy plate of pre-chewed Mexican food. Next time I want a burrito that bad I'll just ride BART to the Mission and take a long lunch.", "author": "Carlos B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-17", "description": "I've been trying for a while to find a great lunchtime burrito, and here it is!\n\nIt's a longer walk from my office than I would like, but I still make the journey regularly and I'm always glad I did.  The burritos here are fantastic, service is fast, and one of these days I'm going to try the french fries in the burrito option - how awesome is that?", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-03", "description": "Oh. My. God. I ordered the chicken fajitas and they gave me a gigantic plate of food--black beans, rice, guac, sour cream--all the fixings. It was amazing, fast, and cheap. But with all that food, they only gave one tortilla :( I mean, it was a big tortilla, but I needed at least 3 for all the food they gave me.", "author": "Aunt B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-16", "description": "Excellent lunch burritos, we make a 3-4 block hike past 2-3 other burrito places to come here. Service is fast, burritos are tasty.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-08", "description": "I just ate here yesterday for the first time and it is my new favourite place to get a burrito in the financial district.  I guess it's technically in SoMa but it's a hop, skip and a jump from my work.  I got the shrimp burrito there and it was so good I finished it.  I have never finished an entire burrito before.  The shrimp was good quality (not those tiny baby frozen shrimp) and the rice tasted so good!  I guess I was too used to El Faro because I got savage with my burrito.", "author": "Mahogany G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-06", "description": "Food is average. I usually get the super veggie burrito. I agree with a previous poster that they're a bit stingy with the fillings. I only go here when I'm really desperate for some Mexican food (not many choices near work). Also, they only have flour tortillas (no wheat tortillas). Not a memorable place.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-29", "description": "French fries inside my burrito for just a dollar extra!!!  I've been looking for a place like this since I left SoCal!  \nGreat food, service is so-so mostly because they get busy during the lunch rush.  An excellent downtown lunch spot, I will absolutely go back.", "author": "eamon g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-18", "description": "Pretty good burritos at decent prices for the fidi.   Grilled chicken super burrito with black bean and spicy salsa hit the spot.  they were generous with the sour cream and guacamole, and the spicy salsa mixed with the creamy stuff were happy in my mouth", "author": "Legal D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-22", "description": "Food is prepared very quickly, good portions, and inexpensive.  I would come here again, not a bad place to come for lunch and not crowded.", "author": "Gena O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-29", "description": "I stopped in for a \"super burrito\"  yesterday, and I didn't even notice this place ain't called \"SI Senor\" anymore. The food is still the same, fresh and good quality tacos y burritos.", "author": "Aaron B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-10", "description": "A good place for lunch.  I usually get the Enchaladas.  Fast service, but sometimes I feel like I am at the Taco Nazi.  I have to wonder, if you have a sign up for something being a special for so long that you had to adjust the price, is it really a special?", "author": "Pele N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-07", "description": "The service is quick.  Seemingly more choices than other average Mexican places. I liked the medium salsa, different from your usual. The food is nothing to rave about. \nGood for a quick take out or sit down lunch. No standing space, so be prepared to be jostled in a crowd.", "author": "Chandra I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-16", "description": "This review is based solely on breakfast.  I have never eaten lunch or dinner here.\n\nI definitely recommend the breakfast burrito.  It is delicious.  The eggs are cooked fresh to order, there is a salsa bar, and they serve breakfast until 10:30am, which is later than some of the other places around.  I would give the bfast burrito here the edge over the ones at the nearby Rico Mex on Stevenson.\n\nNote: $0.40 charge for paying with credit card", "author": "Tim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-31", "description": "Caramba always treat me well, they have excellent carnitas, salsa is amazing, the horchata is perfect, and they have really really good tacos. Best financial district Mexican food in my opinion.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-31", "description": "I have to admit I was a little hesitant to enter at first. It's small, in the middle of the block, not a familiar name. But then I saw the sure sign of a good Mexican place: people of that nationality eating there. Phew. I felt safer already. This is the best place for a burrito anywhere in the area. They have strawberry pinafels and coke in bottles! See, I HATE Chipoltle. Baja Fresh isn't bad, but it's not great either. I don't understand $8 for a burrito and an extra $2 for guacamole. Wha? So when I found this place that has the chicken burrito in sauce which I adore, with sour cream and guac for a mere $7, I was thrilled! Chips for a mere .90 more. A place to fulfill my mexican food cravings near school that is not owned by McDonalds or Pepsi Co. And I get to continue my love of supporting locally owned and operated businesses. I am currently trying to convert all my classmates to going there. I do have to take off a star for not taking debit cards as I am one of those people who NEVER has cash, but planning ahead to make sure I can afford my lunch is well worth it.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-28", "description": "same as my rico mex review except they don't take credit cards...", "author": "Swarup B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-17", "description": "Love this place. The best pork carnitas in all of SF!!!! Their pork carnitas tacos are second to none! Yummy food and a clean place to eat.", "author": "John A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-10", "description": "today i had a super-intense craving for enchilladas for lunch here in the fidi.  not a fun thing to deal with down here since there aren't a lot of solid choices for a sit-down experience.  i found this place on yelp as touted one of the best places downtown (which isn't saying much).  luckily i got my enchillada craving fulfilled to the minimum requirements.  next time this happens i hope i am a little closer to puerto allegre.", "author": "e w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "I have become addicted to Caramba and eat there at least once a week. I am from Texas so I like Tex-Mex and Caramba is the only place that I've found that compares to what I grew up with.\n  I alternate only two platters when I go there..either the cheese enchilada's or the Carne Asada. Besides the tasty enchilada sauce Caramba uses cheddar cheese which gives it more flavor. It's a big platter but I manage to stuff down every last bite.  \n   Now to the Carne Asada!  Whatever they marinate the meat in they are doing it right! I usually stuff a large flour tortilla with everything but truthfully I could eat the meat by itself because it's so good.\n   The staff is friendly and it is quick service though you do have to wait a few for the Carne Asada to be made.  The only con I have is that they won't serve Carne Asada past 2 p.m eventhough they are open until 3:45.\n    Give this place a shot! Everyone I have taken there has already been back a few times by themselves.", "author": "Dexter S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-20", "description": "They've been making me a wonderful gluten free burrito (without the tortilla) for breakfast every weekday for the past several weeks.", "author": "Adam T."}
