{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-31", "description": "There's a lot of parking and enough seating if you wanted to eat in. I came on a Thursday evening and it wasn't crowded. \n\nMy steak burrito bowl was ~$10, and I thought this place was decent. They only gave one scoop of steak, so the portion size was less than I'm used to for the price. The steak also tasted bland, not seasoned enough. \n\nOverall, I've experienced better portion sizes + steak at other locations... but it'll always vary depending on the chef and workers. I'd come back if I was craving it.", "author": "Aileen J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-25", "description": "I was the only African Americans in the restaurant. I paid for my food in CASH. As I was getting my drink, the cashier tab up to me and yelled \"YOUR CARD WAS DECLINED AND YOU NEED TO PAY RIGHT NOW.\" She yelled this in the middle of the restaurant so now everyone is starring. I tell her it wasn't me I paid cash. She realizes it was the White lady in front of me, now she was using discretion, whispering. She never acknowledged that what she did was wrong or apologized. I was completely embarrassed.\n\nI called the store to speak to a manager Taylor and she told me that I was lying that the cashier didn't do that. Then she said get employee wouldn't be in trouble and that she needed to see who didn't pay. I have never been to a place where people confront you by yelling across the restaurant. I wasn't even the person that didn't pay, but because I'm black it has to be me even though I was the last person she rang up and I PAID CASH. \n\nThe people who work for this restaurant are racist and rude, especially Taylor!", "author": "Kura C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-17", "description": "During lunch time this location is packed. So order ahead or be prepared to wait. Also seating is limited and due to the crowd it's hard to sit and enjoy your meal. \n\nI ordered a salad. There isn't much to say about the taste and flavor. It is exactly what is expected of chipotle. The guy was slightly stingy with the lettuce but otherwise he salad was crisp and tasty. \n\nI also got a small chips and queso which I believe is slightly overpriced. But isn't everything at Chipotle overpriced. How about the $1.90 they charge to add guacamole to your food. They could easily raise the price of their items by say $1 and you can get it if you choose.", "author": "Ty S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "Burrito wrapping 101 should be a training video or course employees take. I've come multiple times due to the convenience of the location being close to work and the \"burritos\" are more like a tortilla covered in items then wrapped in foil. Always fall apart.\n\nGave the 1 star because the cashier, accepted cash from a customer then went to help his colleague wrap a burrito. He put gloves on without washing his hands, which screamed cross contamination to me. Think the location needs to better train their employees in food safety.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-26", "description": "I was craving a bowl today and because I was feeling adventurous I switched things up a bit.  Let me just say, I don't have anything bad to say about the bowl whatsoever, it was DELICIOUS!!\n\nFor some reason though, anytime I get a bag of chips they are DISGUSTING!!! This time around, not only were they stale but some were wet and super soggy.  Maybe don't make so many bag of chips and get rid of them after maybe 2 days or so.  Customers don't pay extra for stale and soggy chips!", "author": "Sabrina J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Not sure why this place have bad ratings. The staffs are friendly, it's clean and modern (as always) and the food is always bomb- it's chipotle, what could go wrong..?", "author": "Kaylee P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-06", "description": "Their mobile app makes it incredibly easy when ordering for pick-up. When I'm on a busy stretch, I usually resort to the chicken salads here. \n\nThe location is a bit tricky to get to. It's in the City Center Plaza East of Target. The parking structure looks confusing. \n\nService is decent. I like that they are generous with the guacamole scoops here.", "author": "Ann S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "This Chipotle is conveniently located in a center with Target and Ulta, so naturally after a day of Target binge shopping I headed over to Chipotes to grab a bite to eat.\n\nThis particular Chipotle location isn't nearly as terrible as others that I've set foot into. They were relatively quick and nimble in customizing and serving food. They also gave HUGE portions in comparison to many other Chipotles. These kids don't mess around! They know the value of a scoop and will fill it up to the brim. (see associated picture)\n\nI basically came home with a chicken burrito bowl that did not disappoint taste or portion wise. I'll be back!", "author": "Connie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-06", "description": "They were sooooooo rude my entire experience like how about instead of trying to rush me through you actually take time to listen to my Order . . . never coming back!!!!", "author": "Kasondra R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-28", "description": "By far the worst chipotle restaurant on the west coast. \n\nThe workers gave small portions and were super slow, considering we were the only ones in line. They were cleaning the machines and had removed the food from the trays while we were still ordering. The cashier was slurping down food while we waited for him to ring us up. \n\nThis all would have been okay except for the fact that the fajitas, rice, beans lacked ANY flavor whatsoever. It's like they forgot to add seasoning. For a chain in which everyone should just be following a recipe, this was extremely odd and disappointing. The root beer even tasted like seltzer water. \n\nTerrible chipotle experience!", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-22", "description": "Had a bowl which they skimped on the beef a bit. The music was way too loud. I felt like I was eating in a nightclub where nobody was dancing. Employees were nice, restrooms were out of paper and the trash in the dining area was overflowing...\nOh, and they hide their spoons...", "author": "Steve S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-13", "description": "This Chipotle could learn a lesson from Panera Bread, formerly their next door neighbor.  Panera Bread went out of business in large part because of their poor customer service.  Unfortunately, this Chipotle has the same low level of customer care as the Panera Bread had.  \n\nThe servers at this location seem to be always in a rush to dump things into the bowl or burrito.  It is very hard to hear what servers are asking because they play the background music so loud and they talk fast.  I have asked to repeat and it is still hard to hear them as they simply repeat the same thing faster.  Servers are not really that generous and frankly, its not a great deal for the amount they charge.  As far as this Chipotle goes, the service ranks far below an average Chipotle.  With other options for more authentic Mexican fare nearby, I really cannot justify getting food from here.", "author": "Re-pley Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "Place has a good location but the kids that work here are unprofessional. Most times, they are just making jokes with each other. It can hold up the lines at time. There is never an adult manager there so I can see why things go haywire.\n\nFood is good, just like any other Chipotle.", "author": "Nick Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-26", "description": "If I could give a 0 star I would. How do you run out of bowls? Ran out of guacamole as well. This keeps happening at this place. I guess no more Chipotle made track record.", "author": "Himesh P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-17", "description": "Always out of something, usually multiple things. Must have a stack of signs in the back ready to pass the buck. Not sure whose fault it is, but there seems to be a mystery person in \"control\" whose mission it is to run this place into the ground. \n\nDesperately needs a good manager (or any manager) to come in and save this place before the run off all their customers. \n\nTypically there are 14 people working there. 8 of them will be eating at the center island. 6 will be in the back working on the signs for the door, specifying what key ingredients they're out of (it was tortillas, chips and soda tonight) 1 will be desperately trying to keep up with the 3 people in line and the last one (the cashier) will be missing. Always, with fail, missing.\n\nDid I mention they had no tortillas, chips or soda tonight?", "author": "Jon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "So I go to this Chipotle all the time and I've always had great experiences but today in particular was one for the books. Fresh out of the gym I rushed my way to Chipotle. Walking in I assumed that the service would be just ok, I assume this because I had about 20 mins to order until their closed. I get my food and get to the register. AVERELL was such a delight and ended up giving me my meal for free. I was so surprised by the INCREDIBLE customer service I told him I would write this review and dedicate it to him. I am a regular at this chipotle and felt so grateful and happy that at this time of night the customer service  exceeded my expectation. I will continue to come to this Chipotle! #Shoutout to AVERELL !!!", "author": "Courtney C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-16", "description": "The worst chipotle in the history of chipotles. Been multiple times 2 hours or more before they close and they've been out of chips, dressing, steak, guacamole. Non-apologetic and they really don't care. Not one to write reviews but this place is terrible.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "The people at this Chipotle are so rude. There's this lady at the register who keeps talking smack about me when I'm right there. I ask for extra rice and extra guacamole in my burrito. As the patron, I have a right to have a burrito with things in it that I enjoy. She continues to get my order wrong or purposefully not put enough in.\n\nAtmosphere: 4/5 (good, not excellent)\nService: 1/5\nFood: 4/5 (the food is great, it's just the service that's off)", "author": "Kabir M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "So, I come to this location often and at times it's a total pain - they run out of stuff, some sass, whatever. I go tonight to pick up my online order. I showed up about 5 minutes late, it hasn't been made yet, and they're out of brown rice and black beans. My pettttyyyyy arse got a little sassy and obviously debated whether or not to leave like that has any effect on their business. And the employee handled it like a champ! Offered to refund me and give me the food for free, offered me free chips and guacamole, I could've asked for all the food left and he probably would've given it to me. What a solid little reminder that it's not always going to be perfect, there are good days and bad, just be kind and grateful. \n\nSo I'm giving them 5 stars because I left there humbled and my food was still very tasty. I don't know the employees name but he rocks", "author": "Cecile M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-14", "description": "They run out of items and then are jerks about it. Especially the little Hispanic guy who was there the night I was. Then what you're left with is old and dry. Wish they would learn how to wrap a burrito, too. It's always the worst.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "I though it was OK..? The employees didn't seem too happy about anything- no \"hello\" or \"thank you\", I mean not even a smile. I thought my bowl was good and chips were a little stale, but oh boy the Chipotle experience doesn't end after you leave the restaurant. That night, 2 out of 5 other friends were horribly ill and throwing up all night. Nothing permanent, thank goodness, but don't really feel in the mood for food poisoning for lunch.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-13", "description": "Wed 6-13-18 6:35pm\nThe service was quick and the staff were friendly \nThe food sucked.-The Bowl dish had no taste.\nI literally left most of the food in the bowl.  Even the chips had an odd off taste. Maybe they were not fresh.  The soda machine was out of Coke and Mr Pibb (no syrup) and 2 other sodas had out of order signs.  When I advised a young rep he replied I think the whole soda machine is not working and did nothing-not even telling anyone else.  The Mr Pibb and the coke at least were only out of syrup.  Easily refilled I have to assume.  I was graciously offered an IZZE bottled soda which I had not  tried before.  Izze sodas are all natural-not sweet like a fountain coke....full of syrup:)  The black berry flavored IZZE soda was a chore washing down.\n\nSorry to say the food is half the game and this place though friendly served food I would not serve a starving person.  \n\nThe only redemption was the city view.", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Last visit was by far the best I've had. Went in, clean area, great atmosphere and best of all employee gave us our meal for FREE. These people are generous and go above and beyond to take care of their customers. I've been to millions of other chipotle's but this by far has been the best. Convenient parking structure, especially in the city (parking lot) and it's close to target (walking distance)!", "author": "Maddy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-28", "description": "Not exactly the cleanest Chipotle that I've been to, big fan of chipotle but I stay clear of this one. They close before what is posted on THEIR OWN WEBSITE, and it's not worth to waste my time (and money) at a place like this.", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "Wow- this place went from bad to worse. They are constantly out of 3-4 things on the menu. Which isn't super good when there are like 8 things in the menu. Management must not care at alllll about this location", "author": "Brandon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "People complaining about the workers making jokes but that's what it's all about! They're super friendly and always willing to fix any problems you have.", "author": "Andy N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-06", "description": "It's a Chipotle, decent food for what it is. Good to know what's in my food. Food preparers friendly and courteous. \n\nThis evening, the cashier(receipt states Daisy) was sweeping the floor then came over to ring me up without washing her hands. She got very annoyed and gave attitude to say the least when I ask her nicely to please wash her hands before handling my food and credit card. Get your act together little brat, don't be unwilling to learn. It's not personal but a professionalism & a mandatory health requirement in California. Makes me think she hasn't been food safety certified. The last thing Chipotle needs is to have another food safety issue. Who's running this place?", "author": "L D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "I hope management reads these because this review isn't for the food. I like chipotle and have been here a million times but today a woman helped me who was on top of her sh*t. Quick, efficient, and sweet. I'm only writing this review because I don't know who else to contact but this girl SHOULD BE RECOGNIZED. Stellar employee. The day is Feb. 14th at 12:30pm. She had her hair in buns. Seriously she should be recognized above the rest. Good quality customer service should never go unnoticed or unappreciated. Thank your staff because I will exclusively be visiting this location just in hopes to make friends with this delightful person. She killed it!", "author": "Kalie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "I think they got new management because this location has definitely improved! I think his name is Averell, but he's the nicest employee. Super paitent with his staff and he provides excellent customer service.", "author": "Matheus R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Really solid chipotle! Good burrito bowl and good service. All the staff are super friendly, and the person who rang me up, Lauren, was really nice", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "I don't know why the reviews are so bad at this location... everyone is really nice, pretty fast, and the food is good (as usual). Devin was great at the register and the rest of the crew seemed to work together well. Wish they would bring back the chorizo, but I think that's a Chipotle-wide issue.", "author": "Kimiko L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-05", "description": "I can't believe how careless the staff is here. I know it's 9:30 at night but come on. I've worked in a cafe and a restaurant before and you should try to give the best service you can, even if people come in a half hour before closing. The girl who was at the register was so rude, saw that I needed something and looked at me and completely ignored me. When I got my food, it was overcooked and the quesadilla was sticking to the tin foil. How do you expect me to eat food like that? I will say the girl who made my food was nice enough to make me a new one, but the attitude needs to stop.", "author": "Devin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-16", "description": "This is the slowest Chipolte I've been to. 10 people in line ahead of me and these burritos are being made in slow motion", "author": "Max P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "The vibe is very chill. The arrangement is organized kind of like Subway. The staff are pretty laidback. The food is filling and fresh tasting. Very satisfactory.", "author": "Abigail S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Was here yesterday and as a previous chipotle employee I was really impressed by the customer service these ladies gave, bravo. Now that's some grade A service. They were pleasant, quick and courteous. My bowl was prepared quickly and exactly how I asked for it. Everything tasted fresh and the chips were delicious as well. This chipotle location is conveniently located near my place of work so I'll definitely be back. Thank you staff.", "author": "Karina Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-26", "description": "Last time I come to this freaking chipotle.  The manager needs to chill of the adderal. It's like he's cracked out.  Walk in and ask for a burrito bowl and he says which one a burrito or a bowl? And I say again burrito bowl. And he's like what's that? Totally being a smart Ass. Didn't the burrito bowl get known for what it is because of chipotle? I search burrito bowl on google and chipotle comes up. And this asshole wants to argue with me while I'm ordering my food.  Worthless!", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Laugh all you want but I love my chiplote. Try the bowl and ask for tortillas on the side (free) so you can make your own tacos.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-15", "description": "This place is gross everything was dirty they got my order wrong twice because the music was very loud and couldn't even hear me I didn't eat I have to throw away the food it was very cold and nasty", "author": "Immer V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-04", "description": "I go to this chipotle all the time, sometimes twice a week. I love chipotle. The portion size at this chipotle is not the best, I think they could be a little more generous but I guess it varies based on who serves you.", "author": "Shawna E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Don't tell Gordos!  I've been choosing Chipotle over Gordos a bit lately due to consistency of the product.  The only thing here is sometimes the new employees aren't the best at rolling a burrito... but always tastes good.", "author": "Alan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "Like the other reviews I was thinking this place couldn't be as bad as everyone have written so I decided to go since it was the closest location on my way home.\n\nClean and spacious\n\nOutdoor seating too\n\nNot sure what's with all the bad reviews but customer service was good\n\nNo lines\n\nQuick and efficient \n\nPortion wise - huge!! Don't know how their to managed to wrap my husband burrito.  \n\nTypical chipotle experience - got my food quick and out the door like every other locations I been too\n\nIf you don't like this one then just don't come back and go to your regular one since there are so many chipotle locations!\n\nWe shouldn't complain about fast food chains unless it's really dirty little or the lines are always slow and long (ahem--- Burlingame location (the only location I really don't like --always dirty and long). \n\nOff to eat my burrito :)", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-23", "description": "Worst chipotle location hands down. Food was salty and did not taste like the other locations, the person seemed like she hated my guts when I ask for extra corn and salsa, and the workers were chatting with each other and ignoring customers. This is the first time I threw away chipotle without finishing it.\n\n1 star for clean restroom", "author": "Kerry H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-10", "description": "I didn't realIze it was possible to have a bad chipotle. This place takes the prize. They were out of lettuce, cheese, and guac. If you look st the other reviews it's not a surprise. I'm never coming back to this location again.", "author": "Kianoosh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "I know that the food is the same at every chipotle so this is for the service. The man who checked us out, Averell , was so friendly even though they were crazy busy (even on a Sunday!) he overheard me say it was my birthday last week and so gave me my quesadilla on the house- which made my day! Great customer service and attitude. Chipotle is lucky to have Averell as an employee.", "author": "Heather W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-01", "description": "Do you love chips, guac, tortillas and large bulky burritos Chipotle is known for? Yes? Then don't come to this spot always out of EVERTHING!!! Hey guys if you're out at 5pm make more ya hot 5 hours to go! Lazy", "author": "Matt S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-25", "description": "I've been to this chipotle quite a few times and I've always been underwhelmed. I choose not to stay because it gets busy and the workers aren't very friendly. It's like they're in this robotic drone that prevents them from smiling. Surprisingly, today was different. \n\nThis review goes out to the cashier we had named Cory. We only talked briefly, but his bright attitude and his friendly demeanor was more than enough to make my day a better one. We bonded shortly over our college experiences - him at SFSU and me at USF. \n\nIf I see him working, I would be more than happy to come by and eat in again. \n\nThanks again Cory! You're probably the nicest dude in that chipotle. \n\n- Girl in the USF EMT shirt\n\n----\n\nCame here again on 4/25 and the cashier Rose is seriously high or on some kind of drugs. The constant blinking, staring, slow movement and slow talking? It's nice to see the kind of standards this chipotle has. We came here because we have a free chips&guac coupon, and after Rose had scanned it, she told us to have a good day. When I asked her about it, she's like \"... oh, yeah.\" She rolled her eyes and did the slowest 180 degree turn I have ever seen. She daintily grabbed the chips, and said \"can iiii get a side of guac?\". No apology, just an attitude. What should I have expected from this chipotle...", "author": "Jessica V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-28", "description": "Extremely rude manager named Cynthia. She gives so much attitude and doesn't give a sh*t about any customers. They won't honor coupons from other stores even when other SF locations don't give any trouble at all. This is exactly why Chipotle's stock price is tanking - they'd rather give extremely poor customer service than to honor a perfectly valid coupon.", "author": "Kazu O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-22", "description": "Dear Hungry People Who Want Regular Chipotle Portions -- Go elsewhere.\n\nThree or four out of the five times I have been here, they've run out of core items like corn or sofritas. They did not even have signs posted. The employees did their best to let customers waiting in line know, but they would mention this may once every few minutes, so a hoard of customers would go through the trouble of waiting in line not realizing they are out of softritas -- perhaps not an issue to some but maybe an issue if you are vegetarian and end up having to go elsewhere. Also, their portions are smaller than most locations. I haven't been there since these issues occurred.", "author": "John Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-27", "description": "This is one of those restaurant chains where not all are created equal. The one in San Luis Obispo, so good. This one, not so much. We expected it to cost more because everything in this city costs more. What we didn't expect was the portions to be so drastically smaller and the food so bland. The guacamole had absolutely no flavor at all. The carnitas was tender, but apparently they ran out of seasoning that day.  The only thing that had any flavor on my husband's burrito was the onions and peppers. Carne was, again, bland. We try to stay away from chain restaurants as a general rule, and will definitely adhere to that rule with this Chipotle.", "author": "Monica F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-26", "description": "I called because I realized I threw my retainers away in the trash by accident (it was wrapped in tissue) so I gave them a call 10 minutes after I left. When I called to ask when they take the trash out (because I wanted to know if they took the trash with my retainers out recently) the person who answered immediately responded with \"Nice prank call try again later\". I didn't even have time to explain myself, and found it really ridiculous for a worker to respond to a customer that way. Really bad customer service!", "author": "Kiara A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-04", "description": "My first time at Chipotle. I usually go to Gordo's. I ordered the carnitas burrito. The meat was slightly more consistent but there was less of it, the tortilla wasn't steamed or the cheese melted and the guacamole was $2.25 compared to $0.65 at Gordo. Chipotle has a choice of two types of rice but Gordo has three type of beans including refried. Also Gordo has a choice of four types of tortillas not one.\nI asked that the burrito be warmed up on the grill and was refused but was offered it heated up in the tortilla press so it was slightly warmer than room temperature.\nMy total was about $11.30 at Chipotle compared to around $8.40 at Gordo.\nFor both taste and price Gordo is my clear favorite.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-31", "description": "This place is appalling and the staff just doesn't give a darn. I really hope HQ or the manager or owner of this establishment does something about it. This is why Chipotle is suffering when it used to be beloved.", "author": "Stephen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-30", "description": "Management was sitting at the table with her phone. I asked if I could get avocado without onions because I'm allergic to onions, she looked up from her phone and said no. She then went back to her phone.", "author": "Dog W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-02", "description": "i always come here with my husband for a quick bite after getting off work. there's this one worker that usually serves us and every single time, she would be very rude and would give us attitude. she would also talk to her coworkers in the same manner, especially the ones working at the register. i like going to chipotle but she is very discouraging. i would rather drive to a different location than to be treated like that.", "author": "Joanne A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-19", "description": "Love foods at Chipotle but had bad experience service from female employees today. Their behaviors were unprofessional and were uncourteous. They need customer service straining.", "author": "Dr Rose S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-31", "description": "The worse chipotle in San Francisco. Me and two other girls got food and they gave us a portion of a kid plate and we paid $11. Barely put any rice and meat. Very poor service", "author": "Jenna L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-06", "description": "Dumb and rude employees... Period. and how do you run out of cups? last time I come to this spot.", "author": "Hock T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "I read about the bad rice in another review, and I thought to myself \"It can't be THAT bad... or maybe it was their off day.\" I was wrong. I bit into my burrito and felt immediate sadness as the hard (either uncooked or super dry) rice entered my stomach.\n\nAlso when I visited, they ran out of guac. Saddest moment of my day. And saddest burrito of my life.\n\nService was good, and the portions were okay. Lots of indoor and outdoor seatings, and clean atmosphere. Thus the extra 2 stars than the 1 star reviews.\n\nRecommended? No, please go somewhere else until they get their rice right at least. And please, make more guac because what's a burrito without a guac? a sad burrito.", "author": "Solongo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "Love this place! Sustainably farmed, natural ingredients, super friendly staff and delicious!!", "author": "Pep G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "The burrito bowl that I got was filled up since it is double meat (chicken and steak) with lots of brown and white rice and both beans. \n\nBut... The brown rice was hard and needs to be soaked longer. Also I was charged for steak (the more expensive meat at $8.75 ) on my double and not the cheaper chicken.  \n\nPortion was good this time at 11am tue.", "author": "Organic T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-03", "description": "they are so slow jesus christ somebody better be payin them 5 cents and hour working like that", "author": "Cal T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-25", "description": "I should have checked the reviews. The most ridiculously small portion sizes I have ever seen. I was getting a burrito and a bowl. I asked for veggies on both and the woman split a scoop of veggies between both of my items. As I was paying I saw her scoop guacamole for another customer's item and she was instructed to put only half of it on.\n\nIt's not easy to ask for more when they shuffle you through the line as quickly as possible. And I shouldn't have to ask for more. They should not be trying to put as little as possible into an item. The business practice should meet the prices.", "author": "Kara P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-31", "description": "The last 2 times I've been here my burritos have been 1/2 hot & 1/2 cold. So today when I ordered my burrito I requested that the burrito be HOT all the way through. I was told my Michelle that it was because of what I put on it. Anyway it was COLD AGAIN & I glad to put it in the Microwave to make it HOT. I think I'll start going back to Bonita in the Marina. Their burritos are always hot & I've never had to rewarm it even though I live almost 1/2 hrs away.", "author": "Monica D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "I attend USF nearby and have been to this location many times over the past couple of years, both for lunch and dinner. Not sure why the reviews are so negative; I've never had a bad experience. The service might not be overly conversational, but it's polite and efficient, which I like more anyway because I'm trying to get to eating. The food is just like any other Chipotle.", "author": "Julianne V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "I love Chipotle so much, I once wrote a haiku called \"Chipotle Love Story\":\n\nBurrito is love,\nBurrito is life. Add guac?\nIs that a question?\n\nYou can imagine how thrilled I was to hear there was a new Chipotle opening closer to home. Gone are the days when the denizens of Inner Richmond had to go downtown or to Sloat or Stonestown for a giant burrito! And good riddance to those dark times.\n\nThis Chipotle is much like any other. The service is ever-so-slightly less like the well-oiled machine I'm used to at most Chipotles, but this is still a new branch. The bottom line is that my food was like it would be at any other Chipotle restaurant. Unfortunately, they didn't have guac available today because their avocados were all too firm. That's never happened to me before. But hey, I'm not complaining. No more 30-minute drives for my burritos!\n\nOh, and this doesn't factor into my rating at all, but anyone else think it's a bit weird that the lights they put at the tables in front of the ordering station completely block the menu when you're standing in line? I mean I don't care because I'm a pro at ordering my Chipotle (who do you think I am?), but it's a distracting design flaw!", "author": "Ashish B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-01", "description": "Over-priced food, stingy portions, snarky attitudes -- what more could you ask for? (Besides everything.)", "author": "B T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-07", "description": "I've been eating here for years and I've never had such a terrible experience. Went to pay for my food and didn't know they did not accept $100 bills and that's all I had on me. The \"manager\" preceded to be a complete ass about it and told me I had to walk to another place and break the $100 before I could have my food. I cannot believe how I was treated for trying to BUY MY FOOD. never coming back to this location again and I hope the real manager actually addresses the issue. I'm sure I'm not the only one that's been treated that way.", "author": "Acacia N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-27", "description": "The staff here thinks it's a Nascar pit crew...super rushed my order for no reason. Over this location.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-06", "description": "We've been trying to give this place a good rating but it's impossible. The only reason we patronize is the location. But other than that it's an unorganized poor customer service poor training and poor attitude.\nThis morning I was over charged by $13, I'm getting over a cold and wasn't necessarily paying attention until I got into my car and thought the bill was high.\nThey charged me for the wrong protein and double portion. I walked back (in the rain) to the store and said you over charged me. The food prep guy was apologetic and communicated to the cashier... she immediately said \"that's how I do it...it's a circle..\" the guy \"so what did you charge the guy before?...\" After that argument she calls in the back something... \"...and it's not my fault this time...\".\nAnother guy (heavy set) comes to the cash register and inputs stuff showing her how to do I'm assuming a deduct add. She gestures with her hand give me your card. It takes three times before they can figure out what they're doing. She hands me back my card and I'm ready to go!? Nope. \nShe keeps inputting into the cash register and tells me $8.30! I'm wtf! Why should I pay? I refunded the amount! Ok I ask \"where' refund?!\" She shows me a paper she had inserted into the drawer...need to show the refund of -$13 to the customer right!!! Then she asks for my card again. She swipes my card. No -Sorry or -Explanation. Now I'm pissed off, the manager is scared about confronting a little bossy Spanish lady, he stands there starring at the cash register.\n\nBy the time I got home (a five minute drive) the food was cold, and I had no energy to deal with incompetence. \n\nI hope everyone who visits the terrible Chipotle read the reviews and if you encounter the little Spanish lady cashier, please check your receipt and understand she has ZERO customer service, ZERO politeness and ZERO communications skills. \n\nI might understand if english is her second language or culture, if that's the case!!! Then I blame the Damn! manager and management on not training their employees!", "author": "Pstephan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-15", "description": "I ate here for dinner last night then a couple hours later I had diarrhea and upset stomach. Today I have been on the toilet or in front of it non stop. Just wondering if anyone else is having issues from eating there last night. I'm thinking food poisoning. My other issue with this place was I noticed one employee with his pants hanging down showing his underwear. Come on no one want's to see your underwear what is with that. Second when at work were the public see's you the employee's need to dress professional and not be showing their *ss to everyone that is trying to eat. I wont be going there again.", "author": "Scott D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-06", "description": "Small portions.... Very stingy with food, even when I asked for more rice, meat, etc.\n\nrestaurant was clean and almost empty during peak lunch hour.\n\nEmployees were nice, but obviously trained to give out smaller portions.", "author": "max d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-26", "description": "I got charged $8.25 for a veggie bowl. What a ripoff. Meat is the most expensive item on the bar yet I got charged $8.25 for something that didn't even contain cheese or the vegan \"meat.\" So the total came out to be $10.80. I didn't even eat my bowl with the fork because every single bite was scooped up with the chips. I ran out of food in my bowl before I ran out of chips in the bag. The chips didn't taste well either. I didn't notice so little food in my bowl until I took off the lid to eat. The woman behind the counter was serving very small portions for everything on the bar. After she put the beans in I looked at the bowl and thought it looked empty so I asked her yo put more beans in. Even though I asked her to put more beans and lettuce in the bowl the bowl was still quite empty when I opened it to eat my food. This has never happened to me at any other chipotle locations. Still I am unhappy and rather skip chipotle from now on.", "author": "Eli B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-12", "description": "I've had issues with this chipotle a lot. Some of their staff members have horrible attitudes, but since I'm an avid chipotle eater and it's close to my school I just brushed it off. Unfortunately today was the final straw for me. I walked in with a Dodgers hat on and one of the workers heckled me (which I'm used to of course) but then she wrote a little note on my burrito bowl which was unbelievably rude. The note said \"f*ck the Dodgers\" very classy. I didn't have time to stand around and wait for a manager to complain to but I will definitely be going to the corporate level on this issue. I can't believe this girl thought that writing this note would be okay. And I hope this not a direct extension of the way chipotle as a company conducts themselves. Thoroughly disappointed.", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "Had a much better experience this time. Very friendly servers and food was good.\nThank you for the improvements today. Keep up the good work!", "author": "Mary P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-10", "description": "Yes this location is nice clean spacious, but their staff has high turnover and lack proper training. I would think that with all he bad press requiring the their food issue would have them give large portions, instead the portions are so small the workers use less than an half of a spoonful of each portion of food. So disappointed not sure if the location will last!", "author": "Burt L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-14", "description": "hmmmmm.. interesting location with extremely low reviews. I can see why this location is getting bad reviews but I gave 3 stars because I think they are definitely reading the reviews and management is trying. \n\nMaybe this place is a good example of a con result of Chipotle not selling branches to franchisees who are held accountable for the success of that one store they own. It was scary to read the one star reviews, and I especially felt sorry for the person who had inappropriate writings on her bowl. \n\nMy experience here wasn't as bad as the others but I can see that they need a lot of work making things consistent. The staff needs more training - Starbucks for example is a company that trains aggressively to ensure quality and they are like Chipotle in that they don't franchise. Whoever is in charge of hiring, training and managing is probably the first thing corporate should start with to ensure that their employees are even ready for the job or are even service oriented in terms of having the right attitude. \n \nI ordered a burrito bowl and the lady who was helping me was great. When I got to salad side of the bar.. there was about 10 leaves of salad left in that bowl. If it was another location, I think the employee would have grabbed a new salad bucket and filled my bowl with more salad but he proceeded to close the lid and I asked for more salad because it was too little. To me that's not even \"unwilling to go an extra mile.\" If mile was the standard, he didn't finish the mile - it's.. to me, being lazy.\n\nAgain- it looks like they're improving, but they need to pull things together to make this store successful. I read a lot of reviews about chicken not being fully cooked- I had some pieces that were overcooked and a bit burnt - I think they might be overcooking with undercooked reviews- so they need to really find consistency with the quality of food to be align with rest of Chipotles, consistency in service and the professional, clean environment that Chipotle represents.", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "I don't understand the bad reviews for his place???! This is right by my house so I have to admit .....I go all the time!! Lol I easily give this location five stars. The employees started to recognize me since I come in so often and even before that they always shouted a greeting when I, and every other customer would walk in. They are always really friendly and patient to my overly picky order haha :)\n\nFood and service aside, it's definitely worth mentioning they also have a great location. This one is located by the Target on Geary and they have a huge parking lot right outside! And if for some reason that is full, there are 3 other lots right by it for all the retail stores in that area. Also, because I drive a pretty big car this is a relief to me because city parking can be a nightmare, and if I had to parallel park every time for a burrito......I would probably be over it hahah. Also, the inside of the restaurant it's always really clean and there is a nice little area to eat outside. \n\nI only log into my Yelp account to give a review when I'm really, really impressed with a business. So I knew I had to write one for this chipotle after they started to recognize me as a regular. Not only did they tell me that they really appreciated my repeat business but the Store Manager, Storm, went above and beyond. She actually comped my meal a couple times when she noticed I was coming in a lot. That was so sweet and I really appreciated it!! I'll definitely continue to keep coming back again and again :))", "author": "Bryn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "One of the few chipotles with almost no line... That's about the only thing good here. I've ate here now 4 times and 3/4 of those times they under serve me on everything. I would say they serve about 1/2 as much as other chipotles I eat at. I'm very happy with chipotle as a whole but this particular one is so stingy with the servings it's a joke.\n\nRevised 4-23-16: I commend Chipotle for listening and training the staff better. Staff is friendly and gives the appropriate portions now. No lines and great parking in SF is pretty awesome.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-07", "description": "To be honest I used to like Chipotle a lot! It was so convenient and kind of healthy for me! But 4 times in a roll I feel stomachache and heartburn. Not coming ever again.", "author": "Francisco D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-25", "description": "I came here with my roomie Ddo.  He's a big Chipotle fan.  In fact, he's just a big Mexican food fan.  He works for Mark Zuckerberg's startup (which by the way is going for $86.64 per share right now).  They provide free food, and every time I ask him to bring me dinner home, he brings me an extremely spicy burrito, so yea, he's a big Mexican food fan.  Anyhoo...\n\nDdo drove his G37 and bumped his usual eclectic mix of underground hip hop, Taylor Switft, and Slow Jams.  The place is only 1.2miles away, but it took about 15 minutes to get there because Ddo's driving is subpar and this Chipotle is so hard to find.  It is embedded in between Target and Best Buy, which are 2 very large buildings.  It was like trying to find Mugsy Bogues inbetween Yao Ming and Shaq.  For some reason, we first walked into Best Buy thinking the Chipotle was somehow in there.  I asked the security guard where the Chipotle was, and he looked surprised that two male asians were so dumb. (It's located below the Best Buy btw). \n\nWhen we entered, the line had about 16 people, all of whom looked hungry and slightly upset.  My first thoughts were, why are you guys so upset? It's frickin Chipotle.  But then I started to get upset too.  Ddo remained calm, which is surprising because he sometimes becomes a stone cold killer( especially when we play Jenga. Barry knows wsup).  I began to get upset because the line didn't move for roughly 5 minutes. \n\nI also began to feel a little worried about the food.  The first worker, who is responsible for placing either white or brown rice in a Burrito, Bowl, or Taco, was solid.  Perfect placement of the rice, beans, and fajita mix. The second worker in the assembly line was foaming at the mouth.  It would lick its mouth constantly to remove the white excrement from its lips, but it would continue to resurface.  It's lips were also directly above the Chicken, which was my meat of choice.  For some odd reason, I still chose Chicken.\n\nDdo ordered double chicken (maybe he wanted double mouth foam?). Anyways, I followed suit lol.  And we went to go pay.  Before that, they had no gdamn Guacamole!  They ran out!!!! That some bs dude.  Anyways, we went to go pay, and it got rang up as $13, with no beverage.  In my mind, I was like damn son.  But I paid it because I was just hungry and I needed to get my laundry soon.  Ddo looked at the receipt and they had charged us for double STEAK!.  Steak is more expensive.  They jacked us.  And we probably got some foam in our food.  \n\nI will come back though because Chipotle is so good. \n\nI just wrote this because im doing accounting CPE at home and there was a 10 minute break.\n\nAnd now the break is over.", "author": "Aron M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-27", "description": "\"No cheese.\"\n\"No drinks.\"\nAnd they somehow manage to tear my tortilla when wrapping it every single time.\nThe only location that breaks chipotle's otherwise usual cross-location consistency.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-03", "description": "I was hesitant on coming to this location to order my burrito bowl because a friend had told me the sour cream was rancid when she went here a few weeks prior. I thought she was exaggerating but I experienced it myself today. Never in my life have I tasted sour cream that tasted sour and it was just awful. I ending up throwing my food away. $12 down the garbage.\n\nAlso compared to other chipotle locations they barley gave me any rice and beans, plus I had payed extra for guacamole only to get half a scoop because there was none left. \n\nDisappointed.", "author": "Shelby D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-31", "description": "I have to pile onto all the other posts about this poor representation of a Chipotle.  I have been to many of them around the US and I love the consistency it offers.  This one??? Not so much.  I have been there three times so far and here is the list of items they were out of.\n1) chips!  How in the lords name do you run out of chips?  They claimed the machine that makes them was broken, but I'm pretty certain it was just an excuse.\n2) Soda.  They ran out of soda!  I don't drink the stuff, but the couple in front of me was pretty disappointed.  \n3) Cheese!!!!!  Ummm, there's a target right near you.  Run down and get some cheese.  \n\nOne other issue I have experienced that should be rectified.  Stop having just one person serving and one person at the register.  Meanwhile employees are flirtering about doing stuff in the back.  Get some help up front so that the line isn't 15 deep.  \n\nThis is one of the poorest run restaurants I have experienced.  Going to have to find an alternative and let this one go out of business.  So poorly mismanaged.", "author": "Kurt S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-16", "description": "I like Chipotle and want to be positive, but they need to cook their chicken before serving it!! They obviously saw that some of it was raw and took some out of my husbands burrito but then left some of the raw pieces in there and didn't tell him what was going on even though he asked. He saw the server take some pieces out and then he was left with half a regular sized portion. But he doesn't like to complain so we took our food home. When we started eating at home was when he discovered why the server took some of the meat out! I can't believe they continued to just serve that batch of chicken like that!!!", "author": "Verna L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-31", "description": "Another negative review here...\n\nMy roommates and I live very close by and we were so excited when his opened, but each time we go we're disappointed...to be honest the place is a train wreck. \n\nI have been there maybe 6 times and each time they're out of at least 2 items. In fact, last time they were out of beef, chicken, black beans and guac, at that point why even bother? It's fairly comical how bad they are...there are 15 ingredients and they're all made/prepped/assembled on site, how do you run out?\n\nPerhaps bringing in Bain consulting to optimize the process and timing of moving ingredients from the back to the serving area would be beneficial?", "author": "Ben S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-02", "description": "Worst Chipotle without a doubt. Never go again. I've been to a lot of them but this one is terrible. Especially the unfriendly rude staff! They only want to chat their friends while you wait. Lettuce was starting to rot, I picked out blackened leaves. Big Sihk guy gave so much food to his buddy he couldn't close the burrito. Gave me so little and I usually don't say that - I don't like huge lunches but come on, just because I ordered veggie I shouldn't get half of what other people eating meat get. At the end he asked me did I want more lettuce...wtf! I said I would have liked more of everything else...you trying to get rid of the lettuce?? Never going there again and it's the closest one to my house.", "author": "G M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-23", "description": "Contrary to the other reviews, I actually had great service here, above average for all the Chipotles I've been to over the years. I'm kind of glad this is in the neighborhood because it's not really an \"obtrusive\" newer business and seems patronized by regular people. \n\nI would rate 4 stars, but the chicken in my burrito was awful. I've had chicken Chipotle burritos on and off over the past 10 years and the chicken has been consistently good. The chicken I had from here had an odd texture; it tasted kind of gummy and chewy and had a weird aftertaste. Hopefully this was an off thing, but the subpar chicken will probably keep me from coming back.", "author": "Lily C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-14", "description": "Why so rude!?!? I work in the area and was so excited for them to open. The soft opening was awesome and the staff was so friendly! But this week has been terrible. I just went in at 4:30 and they were \"out\" as the young lady told me, of black beans. My response was what do you mean out. She then had to ask the manager, who said it will be 20 minutes. I also wanted peppers which was going to be 15 minutes. The employee then just said well what else you want? Umm really you have like 12 items keep them stocked! Got to end to pay and asked for limes, which every other chipolte I have been to keeps them right by the guacamole, they told me I can't have them, they are only for there guac. For reals!?!? So annoying! When I get back work the bowl was not very full which is another shocker since usually the bowls are heaping with ingredients, oh wait they were out of most of them... \n\nI know it's not all the employees the ones just at that moment were to concerned with chit chatting then customer service. But when the manager can't control her own staff or keep things stocked we have a bit of a problem.", "author": "Kirsten W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-07", "description": "DO NOT COME HERE! If you want food I suggest you find a better place around the neighborhood. There is even a subway next door that I'm sure is better.\n\n1. This place is hard to locate walking and driving. You have to walk down a hallway on the left side outside the second floor of target.\n\n2. If you're expecting to get the normal amount of meat and items (corn, rice, lettuce and such) they will give you half the amount or less. \n\n3. The staff is highly incompetent and don't know how to cook rice. How do you mess up on rice? A 5 year old can cook rice! \n\n4. Half the workers are talking to each other and the other half just look miserable. I don't know where you found your staff but replace them quick.", "author": "Richard P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-01", "description": "Easily the worst Chipotle I've been to. I went a few weeks ago and they were out of chicken and brown rice. I went today and they didn't have cheese (or straws randomly). Cheese?! They never offer to give you something additional for free, its just - \"oh, we are out of that... sucks you came.\"\n\nGet someone to manage this who knows how to order supplies and it could be much better.", "author": "Devon A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "A good, clean and nice place to eat....it's been my favorite place for the last several months. The employees here are so friendly and always offer us their special deals...LOVE THEIR BURRITOS!!!!", "author": "Tom K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-23", "description": "Writing a review because I'm think many people who wrote bad reviews here are fake accounts. Of all the times I've been here, I've never experienced problems with proportion. All you need to do is ask for more or how much you want of each. Sometimes when I work past 2PM and miss the ramen shops for lunch I come here for a chicken bowl (brown rice, bell peppers & onions, black beans, chicken, salsa, medium, corn, guacamole, lettuce). Service is cafeteria style so I don't know what people are expecting when it comes to service.", "author": "Panchali S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-09", "description": "When they lure you in with their new rewards program but give you the smallest portions I've EVER seen at a Chipotle. -_- They rushed me through the line and made me feel like an inconvenience. Considering they need to win back customers after their recent scares, they really need to work on accurate portions and customer service. Two thumbs down for this location.", "author": "Kaitlyn B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-10", "description": "Don't waste your time with this location you'll be disappointed..\n\nPortion are way smaller than other location but your still paying the same price..", "author": "Karla T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-30", "description": "I just paid $24 for 2 mini-burritos. I'd say don't waste your time and money on this tourist trap.", "author": "Sa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "Food was great! Clean location.\n\nMinus 2 stars for the awkward situation while ordering.\n\nI asked for a kids meal chicken quesadilla. It's on the menu and I order it ever week at another location. Includes a small side of rice and beans.\n\nThe guy taking the order says well it's an extra charge for chicken I believe and you get only 2 sides. I said okay. \n\nThen he looks confused and turns around to ask his coworker for the details of what's included or not. If he can do chicken in the quesadilla or not.  He is unsure what sides you can do with a kids meal I guess? Which I understand they are a new location, no problem :)\n\nBut then.....his coworker firmly turns around to me rudely and she tells me about what's included in this kids meal. Nooo your coworker needed to know. Please don't speak to your customers like children. I knew what's included, I was never asking, and thanks for the bad attitude for no reason.\n\nWhatever. I will visit other locations that are trained properly and provide good customer service.", "author": "Katy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "My hubby reopened my eyes to Chipotle. I had tried it once in LA and didn't really care of it but that was also years ago! The hubby took me to this one and I really enjoyed! Fast food, they make it the way you want, and it tastes really good!!! I love their steak with cilantro white rice, fajita veggies, corn salsa, cheese, sour cream, and extra lettuce!!! You also might want to try their salt and lime chips with their quac!!! Sooooo good!!! \nOn another note I feel like the real test is not when things go right but when they go wrong! On Monday I went in and ordered my hubby and my usuals and when I got home and started to eat my food I realized the rice was way under cooked and crunchy! So I called them and let them know. I spoke to Storm and she said that the next time I came in she would replace my two meals! I went in today and she kept her word and went beyond that to really make sure my experience was a positive one!!! Thank you very much Storm for one listening to my concerns and two taking the time to make things right!!! Much appreciated and for SURE I'll be going back for my usual!!!!!", "author": "Sayuri I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-27", "description": "I was really excited when I found out there was a Chipotle opening up really close. But the first time I went to this location I was kinda disappointed. The serving size on the meat was a little on the small size. They can also not appear to wrap anyone's burritos tight to keep the food from spilling out. But being that they just open I figured it was just them getting used to the swing of things. \n\nSince then I have gone back multiple times hoping  it would be different, but every time its still the same thing can't wrap the burritos and small amount of meat. Considering that this is not exactly cheap I hope this will soon change otherwise I can not keep going here.", "author": "Kirk W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-05", "description": "Service is usually pretty poor which I don't really care about for fast casual, my major gripe is that every single time I've gone here they are out of veggies, chips or you have to wait 10 minutes for them to finish making beans. (HOW DO YOU RUN OUT OF CHIPS?!) I'm unsure of wether they don't buy enough product or if they just have terrible time management skills. Most of the time they're not even apologetic.\n\nA manager also yelled at a supervisor for not yelling at a cashier while we waited for them to finish our order. Super unprofessional and super awkward. \n\nDon't bother, go to Panera next door.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-22", "description": "This is the skimpiest burritos ive ever gotten from Chipotle! I cant believe i paid $17 for 2 tiny mini burritos. Thanks for nothing guys!", "author": "Zully A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "My favorite Chipotle! The food is always on point, the service is outstanding, and everytime I go to this location I walk out happy! My order can get annoying with double of this and that and sides of everything else and not once have I ever felt like they weren't happy to give me what I asked for. Thank you, Chipotle on Geary, for making my hangovers bearable & thank you La La for the killer customer service everytime!", "author": "Megan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-05", "description": "I've eaten at many different Chipotle locations and regularly eat at a location in Palo Alto and I'm usually pretty satisfied with what I order. My experience at this Location may have ruined Chipotle for me forever. The employees were perfectly nice, but my burrito was basically rolled into a ball. Even with the foil still on, it completely fell apart. Aside from that, the proportions and distribution of ingredients sucked: it was a tortilla filled mostly with white rice, with a teeny bit of meat, some salsa and beans, and all the cheese concentrated into two separate small blobs. Aside from that, the ingredients had almost no flavor. Rice, beans, meat, salsa...no flavor. It was weird. Again, pretty different my my typical Chipotle experience. I will definitely never visit this location again but I am sad to say I probably won't be frequenting Chipotle in general anymore. Gross.", "author": "m t."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-27", "description": "Man, this location is just terrible.\n\nMeat is always dry and old because of the lack of customers. The beans looked like they hadn't been mixed in hours.\n\nAs always, no bellpeppers or onions here. Every single time, none. They were clearly out and there were not even any cooking on the stove! \n\nManagers here need to get their act together. You clearly have enough free time to shape things up. Barely any customers ever!", "author": "Richard D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-09", "description": "I should have listened to the reviews but my stomach got the better of me.\nI have no complaints with the service. I came here Wednesday around 12:30pm and there were 5 people in front of me. I was able to order within two minutes and the staff wasn't rude at all. \nIn terms of the portions, you can always get the most by asking for a bowl with tortilla on the side, both white and brown rice, fajitas, both beans, half and half meat, and all the extras. \nI did notice that some of my lettuce was browning but I picked them out. The sour cream was also more sour than usual but I continued eating. The chicken tasted a little burnt but I've had worse. \nFast forward an hour and my stomach started bothering me. I'll spare you the details but I got it out of my system. \nI still have leftovers. Will I throw it away? No, I'll microwave it for dinner. Will I return to this chipotle? Probably not but it won't stop me from going to other ones.", "author": "Colin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "I googled this place for a quick bite to eat.  Good food, good survive they make me feel young", "author": "Stepan F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "Every time I go to Chipotle I get a chicken quesadilla with rice inside.  Same deal every time, \"we have to charge you for a burrito, is that ok?\".  And yes, that is fine.  But this time was different.  I got a \"we can't do that\" when I ordered.  And I asked why not?  \"Because the rice will contaminate the griddle and we might have to clean it again.  We clean it twice a day\".  Somehow this location is different from every other Chipotle.  Despite the quesadilla being sealed in foil, somehow rice will \"contaminate\" the griddle.  I argued with the person taking my order, the manager, and every other person that worked there to no avail.  This chipotle is special and can't make my quesadilla just like every other location can.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-30", "description": "I came here for a chicken quesadilla... They were out of chicken and cheese. And then also out of ice . Are you fucking kidding me", "author": "Grace L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-03", "description": "Yelp, please allow the feature of zero stars. This chipotle needs to focus on hiring some competent staff. Yesterday I came in to grab some dinner and was simply horrified by the cook on the line. An employee came from the back eating a burrito and proceeded to finish cooking on the line while eating her burrito over the grill. This is not your house! That breaks so many food safety laws and is absolutely foul. After seeing this display of incompetence and total disregard for cleanliness I made a B line for the exit. \n\nSure, this location is a disappointment when it comes to portions and overall service but no way will I compromise my health.", "author": "Chelsea C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-27", "description": "This place is a disgrace to chipotles everywhere. I've been a few times because it's the only location in the area but every single time I'm blown away at the incompetence. Ordering online for pickup has never successfully worked, they are painfully slow, and the staff isn't necessarily rude- just completely incompetent. Avoid at all costs if you are better at controlling your burrito cravings than me.", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-07", "description": "Manager and workers eating chips and freshly cooked steak right behind the counter where we could all see. Health code violation of I've ever seen one.", "author": "Madie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-10", "description": "I was hoping the negative reviews were because it's a new location. Sadly they haven't worked out the kinks. The trash was overflowing right when we walked in. I ordered a burrito without many ingredients and the girl overfilled it and ripped the tortilla while rolling. She added another tortilla on top to make it close. It was pretty ridiculous. Then they left my sons cheese quesadilla in the steamer so long it was hard as a rock. \nThe workers were arguing. Pretty poor customer service. I can't believe a big chain like chipotle has such an embarrassing situation going on.", "author": "Jamie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-27", "description": "I'm convinced this is a chipotle training facility. Constantly has people who have no idea what they're doing and always out of cheese. Today it was cheese and ice.", "author": "Kelsey C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-16", "description": "The food is bad and expensive. I ate one of their nasty $10 burritos and picked up a \"burrito bowl\" for someone else. the container wasn't sealed and leaked all over the paper bag they put it in, when I picked it up it exploded all over me and my car.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-24", "description": "I was excited to come to Chipotle after receiving a free burrito coupon in the mail. Unfortunately I had a negative experience with one of the workers. When I got to the end of the line to pay, I said I had a coupon for a free burrito. The girl says, \"Unfortunately, we no longer accept those coupons.\" I take a few seconds to review the coupon, making sure the expiration date hadn't passed. A few moments later, she finally adds, \"I'm just messin' with you.\" I wasn't amused and didn't find it funny. Luckily the food was alright.", "author": "Steven L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-02", "description": "I love Chipotle but this location makes me sad. During my last visit the girl helping me was very rude and seemed like she really didn't want to be at work. It was pretty much like pulling teeth telling her what I would like in my bowl. Thankfully this location has parking or I would go to another one.", "author": "Amanda Jean C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-25", "description": "I've been to this location 3 times, and each time I ask for a little bit of salsa, they serve it to me like it's soup. The portions of each ingredient is really inconsistent with their workers, but in the end, it still tastes like Chipotle.", "author": "Christine P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-24", "description": "By far the worst chipotle I've been to.\nI'm not one to take the time to write a review about sub-par restaurants, but this place was horrible.\n\nWe first waited in a 20 minute line with only about 5 customers in front of us. When we got to the front they told us they were out of lettuce. Not a big deal, so we went to ordering without it. When we got to the worker adding the fillings to the burritos THEY WERE EATING THE CHICKEN OUT OF THE TIN WHILE MAKING OUR FOOD. Not only doing this, they had an apathetic attitude about everything we asked for, as if it was such a burden to add medium salsa to our burritos. Then when we got to the guacamole, the tin was completely empty, but the guy insisted on scraping the crusty, 5 hour old guac into our burritos. When we asked for fresh guacamole, the employees pulled out a tin of avocados and looked around at each other trying to figure out who was the one that forgot to make a new batch. \n\nI hate to be the one complaining about a casual restaurant like this, but I will never be returning to this chipotle.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-13", "description": "The worst chipotle and one of the worst restaurants I have ever been to. The workers were talking to each other while serving me and asked me to repeat my order because they did not hear what I said. Secondly, the portion size was 1/3 of a normal chipotle.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-29", "description": "This is not about the food, but the poor customer service from the cashier.  I paid for my salad bowl, left a tip and realized that the cashier gave me the wrong change and short changed me by 10.00. When I asked them about the problem, I showed them the receipt. Told the cashier I gave her a 20.00, but she insisted she gave me the change. I showed her my wallet and my purse and said there was no 10.00 bill in there, so the change was wrong... Some guy told me he was going to check the camera. I kept saying that I wasn't trying to scam them and that I was being honest. The girl at the register kept whispering to her what I assume to be boss, that she gave me the change and that she knew what she was doing... all within ear shot. I kept saying, I gave you a 20, you gave me 0.09 cents back, and she got defensive, and kept complaining to her boss about me and how she did the right thing..\nGuy comes back from the office and hands me a 10.00 bill, not apologetic at all.\nI will NEVER go to this location again. Which is a shame because the lady the cashier was talking to was nice. Funny, I was going to leave an extra tip too, for the manager going out of her way to give me salad dressing (which they didn't have on hand for their salads).\nI am in the food service industry!  I would never scam another business. I know how a register works, I wouldn't short you on purpose.\nBut that's how I was treated. Like a scammer.\nSo, I think you should take your business elsewhere, plenty of other good burrito shops in SF.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-26", "description": "I wish I could give this zero stars. Hands down the worst chipotle I have ever been to. I go on a weekly basis and every single time, they are out of  more than 3 items every time. Most times, they are out of the core ingredients (rice, guacamole, salsas) and the workers can't do much to remedy the situation. On top of it, the employees are inconsiderate and rude. I hope this is a supply issue that can be fixed and not employees being lazy.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-17", "description": "I usually like chipotle. Just not this one. I came here a few times before and never had a problem until today. Ordered a steak burrito without beans adding fajitas and extra corn is a usual of mine . Usually it gets wider than my hands but today it's shorter and less wide. I saw when they scooped rice they put less than one scoop of rice and steak. That's why I knew it would turn out smaller than usual even before they wrapped it. Glad I won't be coming here anymore. I'd rather drive further to the one at Westlake .", "author": "Andy Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-16", "description": "Terrible on every level. Always missing ingredients, employees eating behind the counter and portions are scarce at best. Manger should be fired along with the rest of the staff. FITFO", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-02", "description": "Place just opened up. Glad there is a Chipotle in this location, but plan accordingly. Some orders could take longer than usual. Employees are still learning.", "author": "Jose S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-30", "description": "I am a huge fan of Chipotle but this location is very disappointing. I live across the street and was very excited when this Chipotle opened but every time I go they are out of a few things. One time they were out of Guac, another time they were out of pinto beans, the most recent time (3 days ago) they were out of cheese and the soda machine was broken. They should invest in hiring more staff. I used to work at Chipotle and I know how busy it can get, especially when there is only one person working the line. Other than that the food is good, as Chipotle usually is.", "author": "Valerie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-11", "description": "Omg!!!! There is NOTHING right about this location they are out of EVERYTHING!!! They don't tell you until you are already trying to tell them what you want. No black beans... More importantly OUT OF GUAC! I just died! I can't take it! What a waste of a trip and wait in line.", "author": "Marna A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-21", "description": "The girl who serve us today was so mean..  Shes  not in the mood like u can tell shes not smiling shes kinda on a rush even tho theres no customer next to us.. I like daly city better than here.. We're not coming back here!", "author": "Lovely D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-07", "description": "I'll give them another try in a few months since they just opened. Maybe they need more time to get things in order. For starters the music was turned up so loud I could barely hear what the employees were saying. After I placed my order & went to pay, the phone rings. A short girl who was preparing food tells the cashier to answer the phone. Now here I am standing & waiting while she talks & giggles on the phone for the next 2min. Then I get to work & realize I have no napkins or utensils!!! Get it together guys!!", "author": "Greg H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "So excited this place opened up as Chipotle's are few and far between in SF! To everyone complaining about portion size, open up your mouth and ask for more it's that simple. They were out of salad lettuce but had the shredded so I lucked out. Positive staff with the exception of one employee who looked as though he really hated his job :/ Hope his attitude comes around. I know it's hard but can't let the negative energy from rude ass customers eff up your flow!", "author": "Jasmin T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-22", "description": "Smaller portions than other locations. I know it's new, but staff needs to be trained better. I hope they step it up because I'm a few blocks away and always loved chipotle", "author": "Vance O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-11", "description": "Are there a million better places to get a burrito in the city? Yes. Are any of them right next to my favorite Target? No.\n\nI went to this location the first week they were open and then a few weeks later. They are still working out the kinks, but a lot improved in that short amount of time.\n\nThis isn't 5 star cuisine, but the food is convenient and consistent.", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Business must booming, 20 in line on a Sunday, we were lucky to get our food. A new clean place, perfect for the neighborhood.  Good luck!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-02", "description": "I love chipotle. Not this chipotle. Ordered a bowl and the top cover didn't even touch the food.   So if you wanna pay 10 bucks for half a bowl, this is your spot.  Taste wise it meets chipotle standards.", "author": "Natasha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Literally the best Chipotle I've ever been to. I've been here many times and each time it's 5/5 stars. The service is incredible. Super friendly, really easy going, and all around pleasant. I've never had a less than perfect experience here. They've even comped my bowls a few times! I honestly have zero idea what the other posters are complaining about. I actually just stopped in here earlier today on a whim, and the general manager and her team members were super friendly and gave me the meal on the house. Terrific place. Just be friendly to your fellow humans and good things generally happen.", "author": "SR S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-18", "description": "I found a piece of chicken in my sofritas. For a vegan item to be cross-contaminated with chicken is a huge problem and should not happen. I spoke with a manager who said cross-contamination happens and if they see a piece of meat fall in the sofritas, they take it out. I explained that is not the correct protocol and if a piece of meat falls into the sofritas, they need to throw the entire batch away and replace it with a new batch from scratch. I think there is a reason this specific location has only two stars.", "author": "Brandon G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-23", "description": "No guacamole for the past three times I have been here. No upfront warning about lack of staple ingredient either. Portion sizes smaller than typical. Food isn't fresh and staff is unpleasant. Go to Panera instead.", "author": "Kyle T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-11", "description": "Worst experience ever, I will never come back. First thing first, I walk in and 4 employees are just standing around, no one greeted me. Stood in the line for a good min and a half before someone offered to help me, keep in mind, I was the only customer in the store. As the young lady started to make my tacos her first mistake was in the way she handled the soft tortilla, after pulling them off of the tortilla warmer (which she burned), she then grabs the tortilla in a pinching motion and throws it on to the paper tearing the shells. The meat was as cold as sub-zero from mortal kombat, drink machine mix was not changed out, so my sprite tasted like carbonated water, the chips were stale, and to top it off, they didn't have salt and pepper out and ready, like I asked one employee about this and he looked at the my food like it's already suppose to have salt and pepper on it....smh (lord give me the patience), I explained that every chipotle I've been to has salt and pepper shakers by the drink machine and napkins area. This is definitely the product of poor and lazy management and my worst chipotle experience to date. I hope that the company can get it together and carry a culture across the board that shows that they can train their employees and teach them the true value of customer service. (Drops mic, walks the hell off)", "author": "Marquez C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-30", "description": "they like gave me a table spoon of rice, a table spoon of pinto beans, and a teaspoon of carnitas for my burrito. i think most of my bites were just the tortilla, cheese, and the salsa. thanks a lot breh", "author": "Jason A."}
