{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "Pros: They have a great lunch menu! They have a nice variation of lunch combos. They bentos are great because you can get a little bit of everything. I can always get a table too during lunch time.\n\nCons: Like all the other reviews, the waitress is superrrrrr slow because there's only one. There's usually just one person preparing the food and another attending tables. Aside from that, I've never really had any issues here.\n\nOrdered: Usually the salmon teriyaki and sashimi bento combo\n\nWould I recommend: Yes! It's a nice quiet neighborhood lunch place if you're in the area. Even at that lunch time it doesn't get too packed so you can always get a seat. Pretty basic Japanese grubs.", "author": "Terry N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-30", "description": "The service was really nice, but as for the food I was NOT impressed. By the way they do not serve hot sake or beer here. \n\nI ordered a sushi roll with the salmon teriyaki and both were really grim. The sushi roll seemed like it had imitation crab in it, & it looked rather odd. The salmon teriyaki was luke warm/cold to the touch & the portion was tiny and it oddly had bones in it. They both seemed like they had been sitting around somewhere waiting; not made to order. Also I was served a tiny portion of rice & the waiter said they were low on rice which left me clueless.\n\nI should've complained but I was very tired/hungry & the waiter was so lovely that I hadn't thought the food would've been so terrible. He was friendly & served an extra bowl of miso soup in the beginning which had my hopes up, but once my food arrived I was put off; it was frightfully terrible.\n\nThe food again was really grim & I won't be returning but I did give 2 stars instead of 1 only for the friendly service, not for the food & drink (lack there of) really. Lastly, it was definitely overpriced.", "author": "Julian I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "I go to this restaurant very often because the food is good and the price is really good. I love the lunch special and it's served even on Saturday.\nThe katsudon is also good.", "author": "Dwight L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-20", "description": "Really gone downhill. I want to like this place but the food is always delayed, the taste is hit or miss, and the staff is not particularly nice", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "To sum it up: cute neighborhood Japanese restaurant that serves good food and it's a little pricey depending on what you get.\n\nBetween two people we ate:\nAgedashi tofu - it's had a good sauce on top and light crust, not how it's traditionally made but yummy and would order again\n\n49ers roll - love that they have the thinnest piece of lemon on top so you can eat it with the roll and it's not overwhelming, would order again\n\nDouble hamachi roll - yummy, would order again\n\nAmaebi nigiri - delicious and order only when willing to spend $$$\n\nAll in all, delicious and will frequent regularly as I live nearby :)", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "This place is fantastic for private parities! They have a private room in the back where you can reserve in advance.  The sushi is high quality and sushi rolls are amazing! This is my go to spot in SF! A bonus is fantastic service!", "author": "Sunny K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-10", "description": "Among the worst chicken teriyaki I've ever had -- dried out and tasteless. Probably grilled for lunch and reheated 6 hours later for dinner.\n\nIt's been several years since I had their sushi, so I can't speak to that. \n\nI do recall eschewing the salmon teriyaki some time back because it looked to be a salmon product with fake grill marks, heated directly from frozen. I thought that was only served for lunch special, but I just saw it being served for dinner, so that hasn't changed.\n\nI'll never eat here again.", "author": "Crabcakes C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-24", "description": "I was not a huge fan of Miyabi Sushi. Firstly, our rolls seemed sloppily made and relatively tasteless. Almost all of them  fell apart when trying to pick them up, which was terribly unfortunate and honestly not something I've encountered a lot of before. Perhaps the rice was prepared in a way that lacked some of the regular stickiness? In addition to that though, the rolls weren't rolled particularly tight and seemed to have a sort of loose end to them. \n\nBesides the presentation of the rolls though, we were not at all impressed by the flavors either. It might have been the ones we chose or just the restaurant in general, but at least for the rolls we got, we would never try them again. \n\nI definitely would not recommend this to my friends, and would highly suggest trying one of the other sushi places in the area (of which there are a few) before visiting Miyabi.", "author": "John B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-04", "description": "I've been to Miyabi's many times over the years.\nIt was always pretty good.  Went there today for the first time in a while and it was AWFUL.  My husband and I both ordered the salmon teriyaki / tempura combo .   The waitress served us miso soup. 15 minutes go by. She comes back to tell us no tempura. Each of us had two tiny pieces of salmon and was charged the sane amount as if we had the tempura. On top of all this it took her about another 35 minutes to bring out our orders . Should have left after she said no tempura but we stayed because we already had the soup", "author": "May L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Great neighborhood spot that has been around for 30+ years. Really fresh high quality fish. The yellowtail in particular is amazing. Will definitely be coming back soon!", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-12", "description": "Was ordering to go and ask her to put sushi and soup separately .. guess what she said all here together. I said I don't want together because soup is hot and it will not good my sushi when I get home .. she was show me angry face and throw her pen and pick up another small bag.. thanks for a good experience first and last time here ..btw, food will be 2 stars ...", "author": "Zaw Win T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "My friend and I were here this past Tuesday.  We arrived about 30 minutes before closing and yet received warm and friendly service.  The miso soup hit the spot on a chilly night, and the tempura was just right.  I've passed by Miyabi Sushi for years and after this first visit, it won't be my last.", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "Friendly Service \nYummy Udon \nHappy Staff \nClean Place", "author": "Mika S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-06", "description": "Sushi is not amazing quality, especially when ordering in rolls. However, it is cheap sushi so if that is what you're looking for, then this might be the place for you.", "author": "Dorothy Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-25", "description": "Food would be a 2 stars as it is mediocre at best, clearly not fresh seafood and over-priced for that level of quality.\n\nOverall 1 star as the kitchen staff is smoking in the staircase area at the back of the restaurant, which is immediately adjacent to the dining area. Law of physics still apply and smoke reaches everyone in the restaurant.", "author": "Jean T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "Came here just after 6pm and it wasn't terribly busy yet. The staff greeted me friendly and got me my miso soup quickly with my rolls. I ordered some special roll and a Philadelphia roll. With some added salt the miso soup was delicious. The rolls also was amazing. He gave me the wifi password so I could watch narcos on my iPad.\n\nWill be back.\n\nYum Yum.", "author": "Thomas S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "I love this place. Ive been here to meet friends and all alone. The church roll is bomb", "author": "Alyc H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-19", "description": "I came here for lunch. My order was taken and food was served very promptly, which was nice. The bento - tempura and salmon teriyaki, with miso soup and salad - were all lackluster. In fact, the rice was my favorite part of the meal, flavor and texture-wise. The price was also quite reasonable (only $10 before tax!) so I didn't come in with especially high expectations. Probably won't come back.", "author": "I Like T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-28", "description": "I lived in sf for 25 years and this place was always the worst sushi joint. The mood is glum. The food is bland. And the service average at best. If you're eyes are falling out from hunger it'll do in a pinch bit steer away if you want anything authentic or quality. Today I came in and asked if they had brown rice. Chef dude said yes. Waitress said no in the most condescending tone. Without asking or checking with anyone. Out of brown rice by noon. Well there you go.  I would have stayed and made due but she kinda capped the experience for me.", "author": "Kriszti D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-10", "description": "Miyabi used the be my favorite restaurant in ze world, I would go there often.  But that was two decades ago.  I've finally had to admit the ugly truth, though: Miyabi seems to have been taken over by new owners in recent years, and the food is not as good as it used to be.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "Best bento box in the area for the money. Lunch teriyaki chicken and tempura under $12. Close to market, takeout orders are pretty quick.", "author": "R T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-30", "description": "1 star, only for the lunch special value. \n\nThis was my second time here and it was just bad. We ordered 4 lunch special bentos - 3 #22s and 1 #28 (?), and a lion king roll. Miso soup was saltier than other ones I've had. Salad was watery and my bf tasted something rotten in it and lost his appetite (probably old lettuce). Chicken teriyaki was decent. Tempura could've been better - the batter was coming off before we even touched it. Rice portions are smaller. The worst part was the lion king roll. We were halfway done with our bento boxes before it arrived and it was burnt af. The roll itself was small for what it was priced at - $12.95 (?). We asked to have it refunded and the waitress seemed super stressed out and frustrated and upset when we asked. But she kept asking if we would order something else and pushing us to have the sushi roll replaced instead of refunded. It took 3 people to tell her we didn't want the lion king roll and we didn't want to be charged for it. She took the roll to the back and we saw her talking to the sushi chef, possible owner, and another worker about it like they were confused as to why we didn't want it. The customer service was so bad - she didn't know how to handle the situation. So basically, you get what you pay for.", "author": "Tammy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-27", "description": "TERRIBLE SERVICE\n* Portions sizes were too small for such prices\n* Staff were disrespectful and were not tentative\n* Overcharged by $5 AFTER giving an 18% tip.\nOverall Bullshit", "author": "Quinn F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-08", "description": "Food was nothing like Japanese food at all. It can fill you up but if you want decent Japanese food this is not the place you'd want to go.", "author": "Hwajeong L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-08", "description": "Attending a friends art book signing at BebeBar in the Castro on 18th/Church Street.... home to a version of the Acia bowl.  Generally speaking I keep up with cultural trends and food developments but somehow the Acia bowl slipped through my loose knit sieve of consciousness. Yep, hate to admit it but, the Acia bowl is one phenom that has slipped through those ample gaps.  Applause, I suppose for an immigrant with blond dreadlocks to create this joint, slicing fruit and dumping granola on yogurt with some \"Acia\" infusion. Yay! .... I guess.  \n\nDidn't want a bowl of granola with wilted fruit for dinner supposedly made with the all mysterious and rare acia, so ventured out walking up Church Street toward Market Street. Passing a few folks hunkered down in their sleeping bags. \n\nAnyhoo, 2 of us landed at Miyabi:\n\nWaitress: cold, impartial, maybe disinterested, when done eating had that \"how much is my tip\" look on her stoic face.\n\nFood: The combo dinner, my sashimi was tough (a new experience for me),.. the bad cuts of a low priced slab of fish. Tempura fried in oil from the Edo period. Salad from a bag with a pungent unidentifiable dressing. Dinner guest with a safe and sane version of a bento, Teriyaki chicken. Sugar must have been on sale when they decided to make this syrupy concoction they called Chicken Teriyaki. They might try to make a new desert sensation the \"protein enhanced\" sweet desert - \"Sweet Chicken\", which most certainly would be a hit in the Castro. \n\nThe joint is close to Market Street, so....I gotta say, there were quite a few folks with happy faces, eating @ Miyabi on a date. Other diners who threw caution to the wind and wondered in, like we did. \n\nShulda gone for the Acia Bowl, and called it a night.", "author": "Matsuo U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "With nothin to do on a Saturday night we wandered into Miyabi in search of a quick snack; we ended up stuffing our faces. \n\nWe told our server, Danny, that our friend was visiting from out of town so he made sure we were all well taken care of. He hooked us up with edamame, hot sake and miso soup. Danny was all smiles and made our quick detour a memorable one.\n\nThe Hawaiian roll, basically a spicy tuna roll, was $4.50 and super fresh. The Godzilla roll was $9.00 and tasty. After miso soup, edamame, a Hawaiian roll, a Godzilla roll, jalapeño poppers, 3 large hot sakes and beer our bill was only $50. Such a steal. \n\nWill definitely came back if not for the sushi for our new bestie Danny.", "author": "Emily E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-23", "description": "This review is for the quality of the Sushi and not the service. \n\nSpicy Tuna Roll - Fish was overly spicy and VERY dry  for a spicy tuna roll, fish was over salted which may of contributed to the dryness of the overall fish and roll. \n\nSpider Roll- Crab was over cooked and dry. The rice lacked flavor, and the best part of this roll was the rice and the salmon roe sprinkled on the top.\n\nSashimi- DRY. The fish was not fresh, and lacked texture. \n\nOverall, the service was good but the sushi was very disappointing. If you are looking for cheaper sushi, this is the place to go with rolls ranging from $9.", "author": "Kimberly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "*This is a review based on just delivered orders*\n\nI've been getting delivery from here for a couple of weeks via Door Dash and have had nothing but good experiences. They have a lunch sushi combo with a spicy tuna and Cali roll for $8.50 (through DD) that also comes with miso soup. Order's have always been made as specified in the notes and timed well so that even after my delivery driver gets it to me, it is still warm. \n\nI hope to make it to the actual b&m one day but until then, I'll definitely continue ordering to go!", "author": "Leina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "*Warning to NOT order through Yelp for pick up*\n\nTwice I've done so and when I arrive they said they never got the order (more like they don't check up on it) and had me wait. They must have signed up to allow people to order through the software but don't look at it until you're in the store.\n\nStill a great sushi spot, just be aware and call the restaurant with your order instead of online ordering.", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "Been a returning customer for 6 years, whenever I'm in the city. I love this place! Unfortunately, their prices have gone up a few dollars, which can be expected. Service is really good & food is excellent.", "author": "Mickey B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-26", "description": "WORST EXPERIENCE OF MY LIFE. took half an hour to get little pieces of sushi. the customer service was appalling. they were rude, slow, and unresponsive. I decided to only tip 15% because of this terrible service and they came back DEMANDING at least 18% of tip. Might I mention the food was not even up to par. the sushi was over priced for tiny pieces. I checked my bank statement and they charged me $5 more after I had already paid for the meal with tip included. this is highly illegal that they did this. never eat here.", "author": "Carla E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "Completely respectable, relatively inexpensive sushi place in the Castro. I don't know if I'd make a special trip from another neighborhood to come here, but you could definitely do a lot worse. In this same neighborhood.\n\nA reasonable compromise between price and quality. It's good (not amazing) and it's reasonably priced (not expensive).", "author": "Sean B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-26", "description": "AVOID LIKE THE PLAGUE!!!!\n\nIn all honesty I would give this place a ZERO star rating if possible. This place has people working here who obviously hate their job and want to take it out on customers who are paying money for them to do their job. If you have terrible service you better hope your food is good, unfortunately for them they missed the mark on everything.", "author": "Daniel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "I have been coming here for over 4 years now. It's always been fast and great! The customer service is always nice and attentive.  The quality of fish isn't bad either. I recommend if want something seafood fast to come here.", "author": "Ree G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "This is an UPDATE to my 1 star review written back in May. I decided to give Miyabi another go, since it had been well over a year or two since I had been there last. The last time I went I had a bad experience which was MOSTLY based off poor customer service. I have never had much of an issue with food quality here, so figured it was worth giving another shot. Especially since not many places offer a bento box with EVERYTHING I want for under $15. My favorites/must haves are Salmon Teriyaki, Shrimp Tempura and tuna sashimi/maki/nigiri etc\nThey used to have one called the \"Shogun\" special but now I think it's called the 'Deluxe Salmon Bento\" or something along those lines. \nI came in for lunch around 1:30/2ish on a Saturday for my birthday. The front of the restaurant was full so we sat in the back, which was pretty empty. The customer service was GREAT (compared to previous times) considering they were a bit busy for lunch. The waitress was friendly and overall the customer service was great. She checked in with us to make sure our food was okay and overall had NO issues with customer service this time. The food was pretty good! My dad got the Deluxe Chicken lunch and my only complaint would be that some bits of the chicken were overcooked and really dry. Other than that though the food was really good and the fish seemed pretty fresh. I'm actually pregnant (Yes I am VERY well aware it is not advised...but keep in mind women in Japan consume it but prob cos quality is better) so I was actually being a bit picky about where and what I ate. Call me a daredevil or crazy but I had 2 pieces of nigri and was impressed by how good the quality was, for it not being a super fancy or upscale restaurant. I've been craving maguro sashimi (my fave) for quite sometime and decided I would lt myself have ONE piece while pregnant. Was very happy with the quality and freshness. They have tons of really affordable lunch specials for about $10! I think they have at least 5 different combos to choose from? I really enjoyed my lunch and will definitely be getting this again! Really filling and great for the price!  \nThe one I got was $14 for the Deluxe Salmon (Or Chicken) Bento lunch, which you get the following:\n- Miso Soup, Salad and Rice\n- Salmon (or chicken) Teriyaki (good portion size especially for lunch!)\n- 1 pc Shrimp Tempura, 4 pc veggie Tempura\n- 1 gyoza \n- 3 pc California Roll\n- 1 pc Salmon Nigiri\n- 1 pc Tuna Nigiri\n\nOverall was a good experience and they have definitely improved on customer service and quality!", "author": "Tara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-10", "description": "Been coming here for at least 20+ years, usually for lunch. The Bento Box for lunch is reasonably priced and always tasty. I'd recommend it.", "author": "Tim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "Fabulous sashimi:  Perfect salmon and tuna.  Rich miso soup.  Great service (thanks, Danny).  Fine salads.  Edamame needed some salt.", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-20", "description": "A cozy neighborhood restaurant with a friendly service. The food is mediocre though. The edamame was delicious but everything else lacked flavor. Wakame salad tasted funny and was borderline edible. Miso soup didn't have much flavor. Sushi was ok as the fish was not as fresh as it could be. It was a bit frozen in one roll (squid) and the yellow tail was a bit fishy. It's ok if you want a quick bite but I probably won't come back.", "author": "Anat N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-23", "description": "Miyabi made me test my moral compass.\n\nSigh........It pains me to have to write this review, but I think it is fair to let other potential customers know what occurred during my last visit. Read on, you won't regret it.\n\nI've been a year-long customer of Miyabi, managing to order twice a month or so. I always felt that it was a decent Japanese restaurant and was always content with exchanging my money for some of their food -- not the highest quality, but certainly not a place that I would be concerned with being unclean. PS: I'm one of those guys that has a Mother that's OCD about being clean, and so some of that passed on to me. My expectations are fairly high (though not unreasonable).\n\nOn July 23rd, I ordered by phone: Two rolls and vegetarian sukiyaki; this is my usual order. I have a little food now and enjoy some for leftovers. The order is always ready within 20 minutes, which I think is a fair amount of time. I pick up the order, take it home and start to enjoy the rolls. I work my way over to the packaged up sukiyaki, peel off the lid and find a COCKROACH soaking on top of the food. Words cannot describe how displeased I was/am...seriously, wtf.\n\nI marched back into the restaurant and calmly told the lady at the front that there is a cockroach in the food that they gave me. She said, \"excuse me?\"...Of course, I repeated it once again, a little louder and pulled off the lid to show her. She seemed fairly surprised and apologized. She offered to have the kitchen make more (uh, no thanks) or give me my money back -- the choice was obvious.\n\nThis is where my moral compass was tested:\n\nI considered going in, making an announcement to the restaurant that there was a roach in my food and offering to let people see for themselves so that they could make the decision as to if they wanted to continue enjoying their food. Honestly, I don't know why I didn't do it. I know that I would appreciate the warning if this had happened to somebody else, and for that I am truly sorry.\n\nMy two concerns:\n\n1) There was a cockroach in my food. That's disgusting and makes me wonder what else has been in my food -- cockroach eggs? cockroach feces? Other vermin?\n\n2) The cockroach was sitting right on top of my food (see photo). Restaurants should always pride themselves in cleanliness, but I hold restaurants that serve sushi to especially high standards. Mishandling food could cause extreme sickness and possibly death. If the kitchen let something this obvious go out to be served, what are they missing that isn't as obvious?\n\n--\n\nThe health department inspection from January correlates with my review: High risk vermin infestation.\n\nYou have plenty of sushi options in San Francisco and at least half a dozen in the Castro within walking distance from this place. Please consider other options when you are craving sushi.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-13", "description": "This restaurant was the worst part of my visit to California. We found flies on special roll and in soy sauce. Absolutely disgusting. But it gets worse. The waitress was being rude about the scenario and trying to make us pay for food with literal bugs on it. Isn't that insane?? Do yourself a favor and try somewhere else", "author": "Colette G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "3.5 stars in reality\n\nCrispy and tasty chicken teriyaki, nice amount and taste of sashimi with the dinner combo and the miso soup was pretty good surprisingly. The salad, the rolls and the service were... mediocre. Not my favorite but not too bad. Plus, at least it was affordable.", "author": "Ruobin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "Great, convenient location on Church near muni.  Came in right at opening for lunch and the place was empty.  Sat at the bar.  The staff is quite friendly.  5 stars for the staff! \nHad the Sushi Lunch, which was a little over $10. Comes with miso soup, 5 pc house choice nigiri, and 3 pc California roll.  Miso soup was standard.  Nigiri was fresh, the salmon especially good.  California roll was good.  I was still hungry so I ordered unagi.  Sweet and warm, a nice ending for my meal.  Altogether with tax and tip my lunch was $21.  I would consider this place affordable and decent quality.  I will definitely be back again when I crave sushi on the way home.", "author": "Audrey D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-17", "description": "6-September, Friday\nHamachi Sashimi: was descent, although texturally a bit firm because it was over chilled. \n\nSpicy Tuna: the level of freshness was questionable, and a huge red flag was wavering as it was texturally gritty as if it had fallen on the ground. The tinge of disgust is still on the tip of my tongue as I think about how awful this tasted. \n\nGodzilla Roll: While I do enjoy Westernized rolls every now and then (in contrast to the traditional sashimi). This roll was over-fried, as it was literally still had pellets of oil running off of it. And a whole glob of spicy sauce drizzled on top of it.\n\nUsually with places like this is even the latter of fried rolls aren't the saving grace, after compromising quality for the raw stuff. Then what is the point really? To the reviewer before me, you can go wrong with Japanese food, quite wrong actually.", "author": "Ty T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-05", "description": "I was in the area since I like a nail shop near by.  My friends and I were hungry so we decided to get Japanese.  Can't go wrong with Japanese food!  \n\nI really enjoyed Miyabi.  The restaurant was larger than I expected.  Had some sake but I can't really take shots of it.  My friends enjoyed it!  I ordered the lion king roll.  It was delicious.  I love cooked rolls with some sort of fattening ingredient to it.  It was so tasty! \n\nDefinitely a good on the whim choice for dinner.", "author": "Chrissie O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-24", "description": "Warning: DO NOT order the Combination Sashimi, especially for lunch. 1) The price listed is incorrect--it costs $17, not $11 as shown on Yelp 2) I received 3 pieces of tuna, 2 salmon, and 2 white hamachi, all exceedingly tiny. \n\nI could have purchased the Tuna Sashimi AND Salmon Sashimi for the same price and gotten double the amount of fish. What a ripoff.\n\nPSA: Warakabune Sushi is practically next door, with accurate pricing and portions. I'll be going there from now on, and you should too!", "author": "Vrsas S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "Terrific Sushi restaurant near the Castro.\n\nAlways fresh and delicious food.  Good value and wonderful service.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "First time for us last night. Brad kept his attention on everything fried while I insisted on something where I can taste the fish and be somewhat healthy.  We compromised on an order of the Califlower roll and a Godzilla roll. So glad we did. The Califlower roll was straight up delicious; fresh and beautifully presented. The Godzilla roll was everything Brad dreamed of: saucy with a tempura crunch. We both loved it but Brad thanked me for focussing on the 'not so fried' and so we followed up the Godzilla with another Califlower. YUM!! \n\nThe only thing that made my intuition-gut detector go off is when we ordered a large saki and then said Nigori and the waitress came out with one large hot saki and a large bottle of Nigori. She thought we wanted both. Obviously some miscommunication and she took back the hot saki with a little attitude. Upon looking at our bill she didn't charge us for any saki... So that made up for any awkwardness and we'll go back for sure! \n\nOur dinner, along with a large, cold, unfiltered Nigori, and a sprite, was heaven.", "author": "Roya D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-29", "description": "always had great service by friendly staff and even free add-ons\n\nI primarily go for dinner or take-out, have never had a problem", "author": "Jared W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-15", "description": "I always get the California Roll and Ebi Nigiri because it always taste fresh and that's always great. I would definitely try out more of the menu in the future!\n\nI've gotten the bento once and it was really delicious, huge portions, under $10. Definitely worth it!", "author": "Serena Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "great place for pick up and super reasonable prices. It's basic sushi and rolls with out the glitz.", "author": "Thomas S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Nothing fancy, but consistent, reliable, and tasty sushi. The restaurant is simple, but the sushi is consistently good. The staff will occasionally give us free sake if they're feeling generous, and they've even let us order katsudon off-menu.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "Very good food at reasonable prices. Excellent value for the money. I have eaten here twice now and enjoyed it each time.", "author": "Ira S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Excellent service. they were quick. They brought my girls their rice first, pretty much as soon as we sat down. The waitress was very kind with the girls. The sushi maker (sorry if that's not the correct term) sent little tiny baby sushi rolls to our table for them. How freaking sweet! My girls love it. I don't know if I've ever gone to a place to eat that were so considerate of small children. Food was good too!", "author": "Claudia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "Delicious! Titanic roll is amaze. Lots of veggie rolls also. Reasonable prices and great service.", "author": "TheOne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "This is one of my fav sushi places in the Mission/Castro. Really tasty, fair prized and great service. Highly recommend.", "author": "Tomce R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-21", "description": "This place aims to deceive, not please, it's unwitting customers. The menu has a section called Vegetarian Plates. The menu clearly states that all vegetarian plates are served with miso, salad and rice. I ordered the vegetable udon. My dining partner also ordered a different item in the Vegetarian Plates section. She was served miso, salad and rice, whereas I was only offered a salad. When I enquired about my missing miso and rice, I was scolded and informed the udon is never served with miso or rice. How was I supposed to know? Do I look Japanese? I was only going off of what they promised in writing on their menu. I do not have the benefit of 1000s of years of Japanese culinary heritage to know how these things work but I do recognize a lie when I see one.", "author": "Bertha F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-02", "description": "Ordered dinner through EAT24. Went to pick up our dinner and the restaurant stated they never got the notification for the order and therefore had not started it. The server was unapologetic and did not seem to think it was an issue, basically saying it was not his fault because EAT24 didn't call him. A bit frustrating since we are regular customers. Then we got home and part of our dinner was missing. Side note: Danny (who was not working tonight) is one of the nicest guys you will ever meet. I guess we will only dine there when he is working. :(", "author": "TJ W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "Miyabi won't be featured on any award-winning documentaries, but it's a good, solid, affordable sushi place with friendly service, clean interiors, abundant seating and tasty food. \n\nYellowtail lovers MUST try the Double Hamachi Roll. As a self-diagnosed hamachi addict, I get frustrated when the only hamachi-centric roll a restaurant offers is the hamachi-negi (because scallions are evil, foul-tasting things that should be burned off the face of the earth). It was so gratifying to find a sushi roll that offered twice the amount of hamachi and combined it with avocado (Nature's butter). The Salmon Ngiri was also pretty tasty and thankfully not made using wasabi. Cuts were rather thick and generous, and the fish was good if not the freshest I've ever had.\n\nAll of the servers were attentive and friendly, knowing when to appear and when to slip away. The sushi chef seemed a little cranky, but since I don't speak Japanese, he could have just been saying, \"I LOVE MAKING SUSHI!\" in a forceful tone for all I know.", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "This is my favorite restaurant for lunch in San Francisco.  It's right down the street from work so sometimes I'm in a rush. The service is fast,  accurate,  and kind.  The food? Excellent items,  low prices combination items,  and they give you plenty of food! The atmosphere is almost like a little boutique Sushi Bar.  It's very cute and cozy.", "author": "Arvi C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-23", "description": "I wonder if mediocre sushi is better than no sushi at all. The twists and turns of life have been induced by less consequential dilemmas, but I will put myself on the line and say...no, it's better to fry a catfish than have unfresh sushi.\n\nThat was the problem I was having when I decided to get a quick bite here after a Yelp Elite event at the Cafe down the street. I was thinking of going to Warakubune on the corner but didn't realize it was a sushi boat place. I don't care for those boat places since I never know how many times the uni plate has been around the flume.\n\nMiyabi is much more of a standard-issue Japanese place with absolutely nothing distinctive about it. I was intrigued by the $2.95 Steamed Green Mussels with Spicy Sauce, so I ordered them (see my photo). Three to a plate, it was a strange barbecue-tasting concoction that would have been a better hit had I been at Minnie's, I suppose. It was so gloppy that it obscured the mussels underneath.\n\nThe $9.95 Rainbow Roll was a tad fishy, not a good sign, and the avocado sliver was completely unnecessary. Hmmm, maybe the avocado was a cover for the fishiness. I also went for two pieces of Uni Nigiri (sea urchin) at $5.50 and four pieces of Hamaichi Nigiri (yellowtail) at $7.90 (see my photo). Both were adequate, but the damage to my palate was done. Game over. A few points for the nice server though.\n\nFOOD - 2 stars...a bit fishy...mediocre in a neighborhood that deserves better\nAMBIANCE - 2.5 stars...standard-issue decor like the one hundred other Japanese places you've been to\nSERVICE - 3.5 stars...she was nice and came by often\nTOTAL - 2 stars...pulled down by the food, I'm afraid...better to go to (gasp!) J-Town", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-25", "description": "It's been a while since I write a new review, so I'll start with this one since it's long overdue.  I came here a couple of times for lunch with a co-worker when we had to do work out of the office.  Both times I ordered their lunch sashimi plate which came with four or five different types of fish.  To me, definitely satisfying for lunch purposes, but probably not spectular enough for me to consider sushi dinner here considering this area is not one I usually venture to.  My coworker each time ordered a bento box, which looks as if one can't go wrong ordering it either.\n\nStaff has been nice during each visit, I give them credit for that.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "Consistently great sushi and open LATE! Our favorite server Danny is a hoot and provides excellent service. He even sends us a text when Uni is available. Great place for lunch on a budget.", "author": "Dawn D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "Great quality Sushi and service.  Go here with my Mom and best friend whenever in my area and want to sit down to Sushi.\n\nI like their \"Love Boat\" , Sashimi/SUhi combo's.", "author": "Jaiden F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "Love this place. Was always my go-to neighborhood Japanese restaurant when I wanted something for take-out. Good value and open late. Awesome customer service.", "author": "Adel J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "Great food at reasonable prices! My combination dinner of sashimi (3 kinds, 2 slices each), tempura and gyoza was $17. Other places in town charge $20 to 30 for the same thing. The quality was great. Simpler, quieter, and more casual than the sleek, modern sushi joints cropping up in recent years.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "I had the Titanic role and was very satisfied. I've had this item at several different restaurants and I'd say Miyabi ranks among the top third of sushi places I've been to.", "author": "Geoffrey B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-07", "description": "I was looking for a lunch spot, with my sister and my dad. We came across Miyaki and decided to check it out, the interior is small but cozy.\n\nAs for the food, I had the double dragon roll, which was great, since I love eel, the roll is basically unagi on top and the inside, and some veggies. My sister had the spicy tuna salad, which I tried, to me it was pretty spicy, but I have a pathetic spice tolerance; while my dad opted for the bento box, I believe he got salmon teriyaki & the california rolls. \n\nSide note: I think they lost their liquor license, so anyone looking to get a drink, that ain't gonna happen.", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-13", "description": "Needed to quench a mid-day craving for some good ol' sushi. Ended up getting the chirashi and it was hearty, varied, and delicious. The fish was overall fresh and pretty good but certainly not as succulent and melt-in-your mouth as more well-known sushi places in the city. If you're hankering for solid, satisfying (but admittedly not mind-blowing) sushi, Miyabi is a good spot to be.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-04", "description": "Time for an update. Returned and tried the sushi. Not as amazing as the donburi. Service was over an hour and a half for 3 people for lunch. Stables were less than a third full.", "author": "Sonya I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "The food and service here is amazing. Danny was extremely attentive and gave our table the best advice on items to order. I had the veggie udon- it was the absolute perfect meal for a cloudy cool evening. We had sake and thoroughly enjoyed the great selection of Japanese beers. We finished off with green tea ice cream for dessert. I'm basically an addict for green tea everything and by far this was the best green tea ice cream ever. We will definitely come back here soon.", "author": "Rachel Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "This place is a classic sort of neighborhood sushi spot. There is nothing fancy but the rock solid execution on sushi and AMAZING genial service from Danny made me feel like I was in one of the world's finest restaurants. Coming back asap.", "author": "Clayton H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-01", "description": "Miyabi is a small, relatively inexpensive, consistently fresh, always good service, sushi bar on Church St.\n\nI celebrated my birthday for the 6th time there on Feb 20th.\n\nIt had been awhile since I'd been there last. But I wanted to make a note that although not 5 star they are a consistent 4 star spot that u don't spend an obscene amount of money yet. Great place for a late dinner and large groups too.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-03", "description": "Do NOT use Eat24 app!! Was told estimated pickup to be 10 minutes and have not received food almost 3p minutes later. Call restaurant directly", "author": "Josh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-05", "description": "Oishi Always:\nWhenever I am in the Castro, I make a point to dine at Miyabi.  I never have to wait for a table.  I like sitting in the front where the sun shines.  I am new to sushi, but I already know I like sashimi best.\n\nMiyabi has a deluxe sashimi lunch combination that is my staple.  It has miso soup, green salad, rice and 10 pieces of sashimi.  I eat this combo without the rice.  The fish is varied and fresh, just what I want.  The price is right too.\n\nI am here almost every Saturday, and I have never been disappointed at the experience.  The service, the food, the atmosphere, the location, the whole deal is wonderful.\n\nI highly recommend this place for oishi fishi fun.", "author": "Audrey C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-10", "description": "Nope.  No need to go back here again.  SF has too many of these restaurants that serve Japanese food for non-Japanese customers.  Menu at these places are always the same with Sushi, tempura, teriyaki, and specialty rolls.  I guess it's a good place to go for Japanese food beginners since prices are low.  \r\n\r\nWhat are the problems?  Miso soup was way too sweat.  Seafood nabe used cheap frozen seafood mix found at cheap Chinese grocery stores.  Sushi quality was poor.  Saba was not fresh at all.   I ordered Sushi Deluxe, which is the highest level of nigiri, but the pieces lacked deluxe items like uni, ama-ebi, toro, nor ikura.  Quality wasn't much better than sushi at Whole Foods.", "author": "トモ T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-26", "description": "The title of this review:  Poor Service!!!\n\nWe order sushi twice a month or so from Miyabi on Church Street, and I ALWAYS GET THE SAME THING!  Tonight was no exception.  Except one of the rolls I always order?  They added raw carrot to, which I cannot eat (I'm allergic to it, it will close my throat).  So we thought, okay, maybe the chef decided just to change things up a bit, we'll call them, explain, and ask them to redo it, since it's not supposed to come with carrot.  This *should* have been easy, right?\n\nWrong.  The woman on the phone ARGUED with us!!!  She claimed that they've always put \"mountain carrot\" (what on earth is a mountain carrot??  It looked like an average carrot from Safeway to me!) in this particular roll, that she's been working there a long time, the sushi chefs are the same, and nothing's different.  Um, wow.  My partner kept trying to explain to her that we order the SAME THING twice a month, and it's never had carrot in it before, and that more importantly, I'm ALLERGIC, so it's not like I've just \"never noticed\" before!!  Trust me, I would notice!  But more importantly, why argue with us?  We've been their customers for over 10 years!  I've brought zillions of my friends there over the years and given them good Yelp reviews.  We spend lots of cash there.  Why is she trying to tick us off???  I told him to tell her that, which he did as politely as he could muster at this point...and she continued to argue with him!  Eventually, she agreed to remake the roll, grudgingly.  \n\nWhen he drove all the way back to the restaurant to pick up the carrot-less roll, she was smiley, but CONTINUED to berate him about how she was right and he was wrong!  Wow.  Incredible.  He thanked her politely for the new roll and left, because he could see there was no point in arguing, it was just beating a dead horse.  She had decided that she HAD to be right.\n\nThere are MANY other sushi restaurants in this city and we would be happy to take our money elsewhere if they no longer value us as customers.  \n\nDear restauranteurs (and business owners in general), when you read a bad review of your business, before you start arguing and castigating the customer, try to stop and THINK about what you're doing first.  Is it worth losing a paying, long-standing customer just because you HAVE to have the last word?  Could there possibly be a better way to address the situation, one that will end with the customer going away happy and then coming back to your business again in the future to spend more money and bring his/her friends?  \n\nIn the meantime, I'm looking for a new sushi restaurant to spend my bucks at...", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "Miyabis broke my sushi cherry when I was about 8 or 9 years old; I am now 25 and Miyabis is still my love and home for everything delectably sushi, and I will never be able to get enough of it. I have had all kind's of crazy sushi, in all kinds of crazy parts of San Francisco, and none of it will ever compare to the love I have towards Miyabis. Call me biased all you want, hell ill even throw it in as a matter of fact that Miyabis opened the same year I was born. It's a match made in heaven and I am sticking too it. \n\nThe sashimi is bomb, the rolls are bomb, they are open late night and they usually throw in free edimame for pick up or ice cream if your on a date eating there. The ambiance is great and the ladies are awesome. Chef is awesome too. I'v seldom had issues with missing items on pick-up, though they always make up for it with extra and many apologies. \n\nAfter take out and eat in's for many years, I can recall less than a few instances where my meal was not up to par with Miyabi's usually awesomeness. So I will always excuse. I have had experienced this with a lot of the other restaurants that I have been ordering take out or delivery for years from.\n\nPlease pay these guys a visit, they are super family and kid friendly!!! They also have a huge private party room in the back for Bday's and events. Love you Miyabi. Your my Sbom(super(sushi) buddy of mine) for life.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-10", "description": "T H E Y   H A V E   S O J U ! ! !", "author": "Eileen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-23", "description": "Just ordered take-out from them, and they overcharged us.  They claimed the price on their very own website was wrong.  The person helping us didn't speak very good English, and wasn't very helpful in resolving the situation.", "author": "Scott N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-06", "description": "I've been coming to Miyabi for 10+ years. Despite what some of the reviews say, I think their quality has remained unchanged (that's a good thing), the service is always friendly and prompt, and they haven't really raised pricess too much. PLUS - they stay open late, which I love.\n\nPros: Sushi is always fresh and their sushi menu is huge, bento boxes are cheap and GOOD, their entire menu is relatively inexpensive compared to other Japanese spots in SF.\n\nCons: Parking can be pretty hard to find, depending on when you go. Especially after 6pm and on weekends, when there is less parking turnover.", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-09", "description": "Stopped in for a quick, very cheap lunch. Everything was fresh and tasty, but the server forgot the rice to go with my sashimi combo. No big deal, she realized a few minutes later, but we were in a hurry and it wasn't like I didn't have enough food. \n\nThe miso and salad were nice and the fish was quite decent. The small chef's choice included ahi, which was not amazing, salmon, which was fantastic, and some other fish I couldn't identify. \n\nI would definitely go back - not many Japanese places are open on Mondays, and I can't think of anywhere in the city you can get such a generous lunch combination for $10 or less.", "author": "Sam Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-10", "description": "Been going here for a couple years. It's a decent sushi spot. Lately I been feeling like the customer service has been cold and neglective. Sadly, I won't be coming back.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-31", "description": "unsure if it was an off night but sushi was not the greatest :(\n\n I realize that we are in a drought but that is no excuse for not filling up our water throughout the evening.\n\n Service was shitty.\n\n I feel bad for taking my cousin here thinking it would be a great experience.\n\n I can't recommend any more.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-17", "description": "I don't understand what all the kvetching is about?! \n\nI still love this place.  \n\nGood price, good sushi (raw fish and cooked rolls).  \n\nStill good service, and prices are reasonable.   And next time our li'l bro visits and wants massive amounts of good sushi, we'll take him here! :) \n\nIt's a small location.  And parking is tight, just like everywhere else in San Francisco.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "Great sashimi lunch special for $12.95. Which includes Miso soup, edemame and salad. Their cold sake selection was decent bi had #4 ON llight, dry, just right for $9.95", "author": "David A R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-17", "description": "THIS RESTAURANT IS NOT FRIENDLY OR ACCOMMODATING WITH DISABLED PATRONS OR SERVICE DOGS. DON'T PATRONIZE THEM.\n\nI totally got harassed & embarrassed @ #Miyabi Japanese Restaurant on Church st & Market for having a service dog. They didn't believe me when I said he was a service dog and asked to see his license, so I showed it to them, no problem. It seemed strange because I've eaten there several times before with my service dog and never had a problem, even when they were really crowded. There were never any problems before so why now when it's not even busy?\n\nThey sat me in the dining room with everyone else and as soon as I got settled in, they returned to ask me to sit in the back of the restaurant so as not to \"bother their other customers\", which I did. I wasn't happy about it, but I did as they asked because I was hungry and I didn't want any problems. Before I even had the chance to get settled in, they came back again and asked me to tie my service dog in a small dark corner, on the far side of the table where he couldn't be near me and where he couldn't move, because they didn't want anyone to see him & possibly complain and they didn't want him \"in their way\". \n\nThat's not providing good customer service and it also happens to be disability discrimination to treat me differently from your other customers. Any business can deny service to anyone for any reason, but if you're going to allow me in your restaurant with my service dog, you're supposed to treat me with the same courtesy & service as you would any other customer, not embarrass or make me feel bad or treat me differently. \n\nYou're only supposed to ask if he's a service dog and that's it. I pay the same money as everyone else, so why can't I sit in the front, in the lit part of the dining room with the rest of the customers? Why do I have to sit in the back of the restaurant, by the bathroom, by myself, in the dark, where the employees are sitting?? Don't treat me like some kind of 2nd class customer because I'm disabled and require a service dog! I'm so damn angry with them!  I was personally embarrassed & ashamed to be asked to sit in the back of the restaurant like I had to be hidden away. They made a scene about it. It's a tiny dining room so everyone in the dining room was staring at us. You're not going to treat me like a damn 2nd class person and get my money. \n\n\nI'm never going back to this restaurant again and I don't recommend them at all, especially if you're disabled or a friend or supporter of the disabled. Forget trying to get a seat if you're in a wheelchair. It's too small and uncomfortable for a wheelchair. Learn from my mistake and definitely don't go here if you have an assistance dog. AGAIN, DON'T GO HERE IF YOU'RE DISABLED. YOU'LL REGRET IT.\n\nIf you take the time to read the reviews for this restaurant, you'll notice that they do have a loyal base of locals that enjoy the food and have had good experiences there. I'd been a customer for 2 years without any problems and I thought the food was reasonable and conveniently located. However, you'll also notice a lot of 1 & 2 star ratings for bad customer service, bad quality sushi and food poisoning. Until this incident, I would've rated them as about a 2.5-3 but now I wish I could give them a NEGATIVE rating. I'll also tell all of my friends about my bad experience and encourage them to go elsewhere.\n\nDon't support businesses that discriminate against the disabled.", "author": "Vincent P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-29", "description": "What a cute little hole-in-the-wall spot! It's about 4 blocks from my work and I came here as per my aunt's (SF native) request. The lunch bento boxes were very reasonably priced $6.50 - $8.50 and have a good variety of goodies.\n\nI got the chicken teriyaki and tempura. I'm used to the South Bay's messy presentation of food so it was so nice to have small/decent sized portions that didn't look like it was assembly line food. The chicken was good but was kind of on the dry side. The tempura was the correct consistency with my request of all veggie tempura requested perfectly. The small bowl of rice was just right for me not to feel overwhelmed after eating.\n\nThe service was okay. She only visited us once and that was near the end. Our tea/water wasn't refilled, that's why I minus 1-star for average service.\n\nWe walked in at around noon on a Friday and there were plenty of seats. The ambience was peaceful with dull roar convos all around. I definitely will return and try other menu items!", "author": "Stephanie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-06", "description": "On my first visit to a sushi bar I generally order sunomono, agedashi tofu, chirashi, and maybe something from their Specials list. On this occasion the special item was katsuo nigiri.\n\nPacing: Poor. Miso soup and green salad (included with the chirashi) came right away from the server. Before I had finished the soup, the chef handed me the sunomono. Finished the soup and was midway through the sunomono when the agedashi tofu arrived from the server. In the midst of the tofu when the chef handed me the chirashi. Halfway done with the chirashi when the chef handed me the katsuo (I expected them to come at the same time). For most of the meal there was at least one untouched dish waiting in front of me. Arrived at 8:00 on Thursday night to a mostly empty restaurant, out by 8:45.\n\nMiso Soup: Standard. Nothing about it stood out but it was competently made, with a few small cubes of tofu and some wakame.\n\nAgedashi Tofu: Different. Squares of tofu, about 1 1/2\" on a side, 1/2\" tall, nicely battered and deep fried. There were 5 of them served on a plate, on top of a piece of lettuce, topped with a sauce like a sweet version of katsu sauce. No ginger, scallions, or broth. Reasonably tasty but I prefer more traditional accompaniments.\n\nSunomono: Below average. They used Asian cucumber, seeded and thinly sliced, which was nice. The dressing seemed somewhat off-flavor - not terrible but not good. The salad came with 1 piece of ebi that was not very good - grainy texture and a sort of 'old' flavor. It also came with 1 piece of what I think was akagai, which was OK quality. The dish included two orange slices, which seemed incongruous.\n\nKatsuo Nigiri: Worst katsuo I've ever had. The fish seemed very off-flavor and it looked like it had been sitting around for a long time. Traditionally served tataki-style (seared on the outside), this fish did not appear to have been seared at all. It was drowned in ponzu such that the rice was falling apart. I ate the second piece hoping it would be better and wished I hadn't. I should have sent it back after the first piece.\n\nChirashi: OK. It came with about 20 pieces of 5 kinds of fish but they were cut small and thin (which I consider to be an appropriate size for chirashi) so I'd say it was about the equivalent of 10 pieces of sashimi. It also had some tamago that looked store-bought, a spoonful of seaweed salad, a few thin strips of oshinko and gobo, and a small mound of what I think was pickled plum. The fish quality was fine except for the ebi, which had the same texture and flavor problems as the piece that came in the sunomono. Plenty of rice. Standard presentation.\n\nShari: Great! The sushi rice was excellent in flavor and texture - just the right degree of sticky, chewy, and tender.\n\nCondiments: Wasabi from powder, standard quality. Gari (pickled ginger) was fine. Suma (shredded daikon) was typical rotary-grater style.\n\nTea: Standard with sufficient refills. No alcohol currently, so no sake or beer though they both appear on the menu.\n\nAtmosphere: Fine - clean and neat but nothing special. A lot of plastic containers and some plastic greenery in the sushi case, which I don't find very visually appealing.\n\nOther notes: No one behind the bar or hostess stand when I came in, took a few minutes for someone to appear. At one point an older lady came from the kitchen to behind the bar, took out a plastic container of something, and sniffed at it questioningly. This did not inspire confidence. Not a very impressive Specials board - it listed toro of tuna, white tuna, and salmon, as well as the katsuo. Considering how unspecial the katsuo was, I wonder about the various toro options. No oshobori (hot towel).\n\nOverall: OK for the price ($32, including tax) but not really worth another trip. If it hadn't been for the katsuo and ebi, I'd rank them higher.", "author": "Adrian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Me and my friends fav place for sushi. And the location is so fun!  I discovered it years ago. Their lunch bentos are so affordable and the amount of food they give!!!!- stuffed :)  Love Miyabi!", "author": "Tania Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-31", "description": "I come back once in a while and expect improvement, but I have not been so lucky.  There are many Japanese places in the area and they all seem to be priced about the same, but sadly Miyabi does not live up to its neighbors.  It is right by the MUNI station so maybe people don't know that much better places exist just a block away.\n\nThe chicken teriyaki seems to be a fixed item on the bento, so you would think it is amazing.  Unfortunately, it is pretty dry and chewy.  The sushi isn't great.  After waiting endlessly for our check, we just went to pay at the cashier and nobody said anything as we left.  I guess I have gotten used to hellos and goodbyes when I come in and out of Japanese restaurants.  They did welcome us in though.\n\nJust don't get the 4 star reviews that acknowledge the bad food.  Y'all seem to have fans out there who keep coming, do them a favor- read the reviews and step up the food for them.", "author": "Ian E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-02", "description": "The portions are big, but the food is subpar. The chicken teriyaki I got was not cooked well and had very little flavor.", "author": "Sam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "Fresh, lower priced sushi. $3.75 for California roll. $4.50 for ikura. Rice is sticky and doesn't fall apart. Portion size on the delicate side. Joint is run by a Korean family.", "author": "Griselda Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-26", "description": "There are two ways to eat there:\n1-the cheap way: a bento box (with tempura / sushi / chicken teriyaki / salad): for 10 dollars at the most. Nothing exciting and it is just good.\n2-The delicious way: order any roll (especially the three amigos rolls / baked rolls / rainbow rolls) and any grilled fish, and it is not expensive for what it is. It tastes wonderful!", "author": "Jinouchou T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-15", "description": "Pros:\n+ Great service -- They came by to fill up our tea quite often. \n+ Great miso\n\nCons:\n- sushi ranged from \"OK\" to \"kind of bad\", and the sushi should be the highlight of the experience.\n\nSummary: \nI've been here about 3-4 times now, and have never had anything better than a \"so-so\" experience. I believe that was my last visit.", "author": "Captain B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-19", "description": "This is a go to place when all other sushi restaurants are full, but don't think it's not good. It's a block or two farther than the closest sushi place, but I can always count on it being open, quick, and have available seating.\n\nIt's simple here, nothing too crazy, but the menu is okay. You've got your regular selections. It's also super cheap, which is why I think I usually go here. \n\nThe area is small, seating in the front near the window or more in he back. Service is ok, they usually leave you be while your meal goes on. I'm okay with that as long as I don't have to wait for the waiter to give me my check in the end.\n\nAll in all, it's not a place I urge you to go to, but it's not a place I would turn you away from. If you want decent sushi, and you just want it quick, I suggest going.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-18", "description": "Last time I went my salmon teriyaki tasted of strongly of chicken and I don't eat chicken, minus one star for that.  The sashimi and sushi was delicious.  I still love Miyabi, but I will never order the salmon again, I'll just stick with the sushi.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-04", "description": "Barracuda is my first choice, but Miyabi is good in a pinch. The ambiance is intimate, so it's a good date place. The food is average (you won't be amazed), but the staff are really friendly and appreciative.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-28", "description": "I love this place for its proximity to my apt., never having to wait for a table, low priced, sushi, and good selection of rolls.\n\nOur favorite rolls are the No Name, Saigon Crunch, Titanic, & Hawaiian.  In addition, there are quite a few small (non-specialty) rolls that are cheap and pretty good.  Like the mushroom roll.  \n\nThe service is fair and the location is convenient to the Muni lines off Market.  \n\nThe atmosphere is not stellar, but you likely can get  table near the window which is a cool lookout on to Church St.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-01", "description": "Better for lunch than dinner!\n\nI've been here multiple times for lunch and the price and taste were amazing.\nDinner, the food didn't taste as fresh and more expensive because, of course, it's dinner time...\n\nDefinitely give this place a shot. The atmosphere is cute.\n\n\nJust finished our lunch today and they gave us complimentary green tea ice cream! \n\nBonus points for them!", "author": "Vicente S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "It was really tasty. Watch out with the orders, they are huge. Accidentally ordered like eleven rolls.", "author": "Malik C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-13", "description": "I've been here three times now because I live around the corner and my husband has suggested we \"just go here instead of walking to barracuda\" and I've finally learnt my lesson. The food is awfully prepared, the menus are filthy, Sushi freshness is suspicious.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-17", "description": "Cheap $8 bento box lunches. \n\nBland $6.50 Chicken Udon soup.\n\nOK $2.50 Wakame salad.\n\nFree Green tea.\n\nFood for your stomach, but none for the foodie in you.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "The sushi chef was both personable and knowledgeable, explaining to me the different cuts of fish and even introducing me to a new style of preparation! Who knew some garlic and a blow torch could produce such a unique flavor!", "author": "Mike G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-01", "description": "WOW...just wow!\n\nSuper fresh fish, and cheap. Need I say more? I think not.\n\nOrder a few pieces of the super white tuna. It melts in your mouth like butter...", "author": "Miss T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-03", "description": "This is nobody's favorite sushi place... I haven't tried everything, but what I have tried has just been okay. It's not BAD, but it's not good either, it's just kind of there, to eat. I think I actually prefer the packaged sushi from Safeway... sad...\n\nAt least you won't have to worry about waiting long!", "author": "Barron K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-23", "description": "We came here for dinner because Warakabune was closed.   They have lots of interesting rolls, and the food came out pretty quickly.\n\nIt seemed fine at first, but then when we were about half way thru one of the rolls that came in ponzu sauce, we noticed that there was a fly swimming around in the sauce!  (And it hadn't just flown in or anything, so it had been in there since they brought it out.)\n\nOk, fine, whatever, that can happen anywhere I guess.  BUT, the problem was the waitress' response, or rather lack thereof!\n\nShe didn't even seem to think it was a big deal or apologize or anything when we told her about it and sent the food back.  She just said that \"oh, it's cause it's sweet stuff, that happens.  it's not like a dirty fly, it's just with sweet stuff\". \n Umm, first of all, sweet stuff?  This is sushi here, not some dessert dripping in honey.  And second, it's \"not a dirty fly\"??  I didn't realize they categorize flies into clean and dirty ones, and as long as it's a clean one, it's OK.  I prefer NO flies in my food, thank you very much.  \n\nThen when the bill came, they still charged us for the fly sushi roll that we'd sent back, which was surprising.\n\nSomething about that just seems wrong, and totally made me lose my appetite as it makes you wonder what else they think is OK.  Never coming back.", "author": "S. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "This seems to be our go to Japanese restaurant.  I have in reviews past commented on my inability to find the ultimate Japanese restaurant, so until I do, this place will do.  I always go for the bento combos and even add a few sushi rolls for good measure.  When going with the family, we like getting the Saigon roll or the Philadelphia rolls as appetizers.\n\nI think it is now public knowledge that the Udon noodle soup is a joke here.  Seems the cooks at Miyabi haven't got the memo yet on how bad their soup broth is, so don't even bother.  You have been warned. Everything else on the menu is fine though.  If someone discovers they have seen the light, let us all know.\n\nThis place is also good to check out the Market Street/Castro scene.  Lots of interesting looking people walking by outside on Church Street.  Parking can be a bitch, but you knew that already.  Muni's convient enough with Church Street station close by.", "author": "barry a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-09", "description": "There was a hostess at Miyabi who liked me. She would hook me up with free seaweed. I'm talking about expensive hijiki, the type of seaweed that lodges its dark green goodness in-between your teeth as you enjoy each succulent leaf. The type of seaweed that looks like a spawn of plant-life from the Florida Everglades and The Black Lagoon. It's delicious and I felt wooed.\n\nThen the manager caught her and angrily stared at me like an disconcerted father over violating his precious daughter and bringing her home from Freshman homecoming a half-hour past midnight. I never came here again.\n\nTakeout is a viable option when the food is served faster in a plastic bag than on a table. I can't articulate why I chose to be a takeout swine here but probably because the atmosphere is very small and often busy. I believe the few times I did eat in, the wait seemed uncomfortably long. The miso soup, edamame, seaweed salad, steamed rice and vegetable rolls are all decent options.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-05", "description": "The thing I liked best about this place was the service. Our server got us seated quickly and always came by with a smile. Our tea was complimentary and our cups were always filled. As for the food, it was nothing out of the ordinary. I thought the prices we actually kind of on the higher end and most items are over $10. I was eating light so I just had a Saigon roll. It was the right amount, but I would've still been hungry if I was eating my normal amount. I actually ate more later that night. My sushi roll looked nothing like the one in the photo in the menu. The beef udon looked like something I can throw together at home and each item in the bento box looked much too small for its compartment. In general, this is just a mediocre Japanese restaurant that doesn't do much for me. I suppose it'd be a pretty quick and easy Iunch spot.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "Went out Thursday night and met up with my bestie, although she was late (we can all blame Muni for that).\n\nBest bang for the buck: Dinner Combination bento box. Salmon teriyaki-could scale back on teriyaki sauce. \n\n(I gave up meats(beef/chicken/pork/other birds and hippity hops for Lent).\n\nHad a little extra: shiro maguro and ankimo nigiro.\n\nFinally! Ankimo!\n\nYou can feel a winner here and not be too empty in the wallet!\n\nMUNI Lines: J/22/37 just outside of door. F around the corner. 24 a block up.", "author": "Christopher V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-06", "description": "I would say the sushi is good and the service is good but they need to make sure they don't hand you a menu that's been scotched taped back together. The spider roll was great but we didn't care for the Dynamite roll. The Ton Katsu was tasty especially for the price. Probably would go back again.", "author": "John D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-22", "description": "I always liked this place when I lived in the neighborhood.  The fish is consistently good, never great.  Popularly priced though!  Comfortable and always-available seating, but unfortunately fluorescent...  \n\nI'd rate it 3-1/2 stars if I could, just to note the breadth of rolls, late hours and above average service. Convenient to Castro MUNI for whatever that's worth.", "author": "Ted R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-07", "description": "Warm sake is always good on a cold night. The food is very affordable and the service is consistently rude but because it is open so late and is so cheap I would certainly give this place a chance.\nDon't you dare ask her for extra Ginger, she may throw something at you. \nAnd if she brings you your bill as your appetizer is coming in, don't be surprised because she is not trying to get rid of you and besides there is no long line at the door.\nThat lady hates her job but those mexicans in the kitchen know how to make sushi!\nOh and the place is small so leave rowdy kids or adults at home lest you make a scene.", "author": "Jim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-12", "description": "Tons of space, incredibly cheap and delicious for the unpretentious price point ($3.50 for a deeeeeelicious Alaska roll? Yes yes yes!), great variety of rolls and reliable nigiri to boot. \n\nAnybody looking for a Tuesday night haunt will enjoy this place. The beer and sake also flow freely, and the service is friendly, fast and fabulous.\n\nOne more +1 for free edamame!", "author": "Megan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-04", "description": "We came in here really late and looked for some Japanese food. Unlike what I read about the bad waitress the one we meet is really friendly and nice. She recommended very nice food. The sukiyaki is delicious and I love the spicy tuna and Godzilla roll.", "author": "keer c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-09", "description": "This review is for their catering service only. I'm always on the hunt for quality, creative catering vendors for various catering needs for multiple meetings hosted in the Fidi. After some calling to both the Fidi location and Church street locations, I was able to connect with the catering manager (Danny). He was very accommodating to my catering needs, threw in some extras, supplied all requested essentials and delivered to the requested location on time. I was also impressed that little soy sauce dipping dishes were included and that no delivery fee was charged.\n\nA pleasant find for your sushi party tray needs that delivers to your office in Fidi at reasonable prices and after lunch!  Sushi quality is good and service is very friendly. They deserve my business again and thought I'd spread the word!", "author": "Carmina B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-31", "description": "I can ALWAYS ALWAYS ALWAYS guarantee this place will be TOTALLY TOTALLY TOTALLY disorganized. They can handle two tables. Max. Three tables and things start to fall apart. Pray that you aren't the fourth table. Please, someone open another sushi place at this intersection and put this business out of its misery.", "author": "Joel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-01", "description": "We were actually angling for some sushi boat action at Warakubune, but they are closed on Tuesdays (curse them! curse them!) and we'd already set our little hearts on a sushi adventure, so this is where we ended up bringing our sad-puppy faces.  \n\nTho hardly an adventure, it was good enough for second-choice Tuesday dinner.  Nothing made it shine, but nothing made it bad--it's pretty much your standard cheap neighborhood sushi joint.  By that I mean if you have to walk more than two blocks to this place, don't.  It's four from my place, and I don't see myself coming back.", "author": "Dana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-20", "description": "The food here is better than the average sushi restaurant - the chicken yakitori and the spider roll were crispy and they served plenty of edamame (well, not free though). The food was actually pretty cheap, and service was great. My most favorite part is that this place closes at 12:30AM...on a school/work night!\r\n\r\nGet the spider roll - crispy and delicious. JONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-06", "description": "Went here for lunch one day out of desperation. Almost every restaurant around this corner was closed and open for dinner only. \n\nAnd well, yucky yuck yuck... yuck. The seaweed salad, the udon, the tempura... it didn't taste necessarily awful, but it didn't taste good either. Bland and so-so... everything was an effort to eat. I felt like a fussy baby. I wonder if the Japanese waitress would be willing to slap a bib on me and say \"open up for the choo choo train.\" Ehhh, ok maybe not.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-18", "description": "Miyabi's, if for no other reason, gets five stars for the Godzilla Roll, which, like the name implies, stomps the living shit out of any other roll in its path. It is probably the most badass roll on the planet. It laughs disinterestedly at all other rolls. I once took a friend from Los Angeles here and he whined, \"This is so far from authentic Japanese cuisine\" and I slapped him in the mouth, that's how serious I am about this roll.\n\nAside from the Godzilla Roll, Miyabi, in comparison to the vast amounts of sushi restaurants in the city, has some of the better sushi around, and at really fair prices. Their lunch specials are priced so low that sometimes their accountant bursts through the door screaming that if they don't raise the prices he's going to quit, yelling about things like net operating income and capital gains. Then he orders a Godzilla Roll and leaves.", "author": "Dave G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-13", "description": "Came here during lunchtime and the restaurant was about 50% occupied with a pretty diverse clientele. Given how many waitresses there are, I'd expect the service to be a little faster -- though one was somewhat vigilant about refilling water and tea, you go vigilant lady. \n\nOrdered the lunch combo. Teriyaki chicken was OK, not that super god-awful Teriyaki chicken you get sometimes that tastes like solid paste meat drowning in a sea of sauce. The sashimi was really, really small and sliced incredibly thin. Rice quality was eh. Salad, overdressed. \n\nMiyabi is what it is and knows what it is and I appreciate that (unlike so many Japanese restaurants that are in DENIAL. your shit aint hot so please stop pricing your bentos at like $15). \n\nAverage Japanese food offered at a pretty fair price point. 3 stars. Done.", "author": "Charles T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-22", "description": "Hmmm, I ordered the bento box special so you do get a lot of food for $14.  (9 pieces of sashimi, 2 gyozas, salmon teriyaki, tempura + edamame, soup and rice).  I really wish I can give them more stars but the fish quality was quite low.  I noticed others ordered rolls and they look decent so I would go back and try out the rolls if I'm in the hood.  \n\nWaitress was very polite and service was prompt.", "author": "Yvonne Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-03", "description": "I love this place. It's open late. The fish is FRESH FRESH FRESH! Plus, they have my favorite sake, Hana Awaka.\n\nThe Hamachi kama is delicious, and I really like their wakame. \n\nYay.", "author": "SisterMable S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-17", "description": "this is my second review - and it's not good! i work right upstairs from this establishment and i MUST say that tho i love their food,the older woman that works/owns? this place is beyond rude. she' s incredibly rude and always shorts on change.  ALWAYS! the chip on her shoulder must be huge becuz she hasn't been able to shake it yet.\nmy 16 other coworkers and myself will definitely NOT be going to this establishment any further which is a shame when one bad apple ruins it for everyone else  - BUT just based on principal alone - NEVER AGAIN!", "author": "Scheherazade S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-18", "description": "Definitely cheap eats here! I got the combo plate with teriyaki salmon and california rolls for under $7.\n\nThe california rolls were ok but everything else seemed like it had been frozen.....I mean even the green onions in the miso soup.\n\nI've eaten their food several times before and I don't remember it being as so-so as it was today.\n\nEek! I may have to pass next time.", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-20", "description": "This place popped my sushi cherry four years ago and you know what they say, \"you'll never forget your first.\" In this case its 100% true. This place is great! Its location is convenient for Muni transporters like myself and the staff is very attentive. I always come here to fulfill my sushi cravings with their Godzilla roll. Miso, tea and salads are good. And did I mention their prices are very cheap. Come here for lunch and you'll get a great deal. Love this place.", "author": "Kirita S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-27", "description": "Service is prompt, food is cheap, there is really nothing I can complain about. What they lack in quality makes up in price hehe. I love how quickly they make your pick up orders! My friend and I ordered a crap load of stuff and they told us it would be ready in 10 or 15 minutes. We got there in approximately that time, and the food was already ready!\n\nMiyabi is definitely a cozy place to bring a date or just yourself. I wouldn't recommend coming here with a ton of people because they make you order a minimum of $20 per head. Its not a lot but still. \n\nThis place really deserves a 3.5 stars. \n-one for its being cheap\n-another for how fast the food comes\n-one for service\n-half for location", "author": "emily g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-06", "description": "For lunch, this is my favorite place in all of San Francisco.  For $10 including tip per person, you can get a bento combination choosing 2 from tempura, sashimi, teriyaki chicken, teriyaki salmon, etc., with all the side fixings of salad, miso soup, rice, and 2 slices of orange.  Get some green tea, and you're set!  What more could I ask for?  Love it, love it.", "author": "Maile N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-22", "description": "I am a fan of this place when I am in the city and looking to get a really quick bite to eat. \n\nThere prices are perfect, they serve edemame as soon as you sit, and ask for your drink. This I appreciate since most places now and days seem to lack proper hospitality, \n\nMy favorite rolls are the 49ers and the Mango with tempera battered asparagus!! Yummy both and I can eat this all day! \n\nThe gyozas is something that I always get because they taste so freaking perfect with that little sauce. \n\nHowever, one little problem, is that there bento boxes aren't exactly the best, but this is a four star in my rating for this reason. But there rolls are solid and fresh! I would recommend if in the area.", "author": "Carmen D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-29", "description": "the price is okay, the quality is so-so", "author": "Long C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-06", "description": "Great sushi in the neighborhood. Insanely cheap lunch specials, and tasty desserts.", "author": "James V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-21", "description": "Low prices, decent food and gay boy house music in rotation. \r\n\r\nI can't complain.\r\n\r\nAlso a good spot to head to after working out at 24 Hour Fitness on Market.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "The good: food is authentic and delicious.   The bad: the service.   Not very bad, but \"don't expect refills on tea\" bad.  There is only one waitress, but they really need two.", "author": "Harry P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-28", "description": "For the longest time, my friends and I called this place \"No Name Sushi\" since Miyabi lacked any signage out front. Blame it on Mendocino.\r\n\r\nVery reasonable prices that never let you leave hungry. The Uni could be better, but this can be said of 95% of the sushi restaurants in SF. A mnemonically-challenged 3rd Star goes out to Miyabi.", "author": "Be N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-07-02", "description": "2nd Update: I'm sad to give Miyabi 1 star, but the truth is, the server was extremely rude to us and made our dining experience SUCK. We vowed never to come back again even though we love the sushi here - it's not worth it. \r\n\r\nUpdate: We came back here and noticed they played really good music. Also - we ordered sake and there was a piece of red pepper in it and the server refilled our entire bottle for free. She hooked us up! It was awesome! \r\n\r\nOh and the Saigon Crunch roll is awesome!!! \r\n\r\nMy boyfriend and I came here last nite from a friend's suggestion. They sat us in the front of the restaurant right next to the window which was nice. There was only one server so when the restaurant picked up, we had to wait for a bit for tea refills and our check. We ordered: \r\n\r\nTempura - not that great. They used all american veggies - carrots, broccoli, onion, potato, but did have the traditional shrimp. I was disappointed because I like sweet potato and string beans instead of carrots! \r\n\r\nGreat presentation for sushi - they were all very colorful and looked delicious. The portions were also big. They give you a lot of fish and rice in each roll.\r\n\r\nMaguro - (tuna)  very shiny looking but didn't taste that great\r\nTamago - (egg) definitely not the best, freshest egg omelet\r\nPocky - (spicy white tuna with onion) this is the BEST one - very yummy\r\nDynamite - (spicy tuna fried in tempura batter with tuna and tomiko on top) OK, it was wasn't great but it wasn't bad\r\n49ers - (California roll with salmon and a small slice of lemon on top) This was a treat - the lemon brought out a great taste in the California roll. \r\n\r\nOverall, the sushi was good - there are definitely some good rolls and the service was ok.", "author": "Gladys C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-21", "description": "Came here on a date this afternoon. After walking around all afternoon looking (unsuccessfully) for a Thai restaurant that was open for lunch, we were just happy to have a place to sit.\n\nWe ordered a few rolls (49er roll, tempura roll, Philadelpha roll, and spicy tuna thing) for our lunch. I enjoyed what I had, but was kinda surprised to see they didn't include salmon in their Philadelphia roll. Nothing to complain about, though!\n\nIt wasn't the best Japanese place I've been to, but it made for a nice little lunch.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "A solid sushi place, the magic is its open till 12.30am. 10.30am on Sunday. They have generous portions and its inexpenisve. I had saba nigri the other night and it was very good. California rolls are moist and tasty.. I had forgotten about this place until i was searching for late night dinner after work the other night. Go here its quite good.", "author": "Madrone H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-11", "description": "I've been coming here for about 3 years.\n\nService has been consistently good, they also open late.\n\nFairly priced. Lunch is much cheaper than dinner, but they all fill you up! Also have good soju cocktails.\n\nFood quality is good. I usually get the salmon teriyaki & sashimi combo box, but also love their sushi nirigi combo and rolls. The salad dressing used to be the bomb, but they kind of lost the flavoring in past year or two. \n\nQuick note on their soju cocktails: you are never able to order whatever you want! When I wanted yogurt soju, they ran out of that and so I got a strawberry instead. Last time I went there, they had neither choices so I had to go with cucumber. They are all good cocktails, just have a very limited selection.", "author": "Ian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-19", "description": "Very good lunch spot, excellent lunch specials and good price. No compaints at all with the terriyaki chicken and california roll that I ordered. Very clean and pleasant dining experience. Would highly recommend this spot.", "author": "Ronette B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "This little gem tucked away on Church Street is certainly fantastic! We went to Miyabi for dinner tonight and were very happy with the quality and service. \n\nWhen you're walking into the small restaurant the sushi-chef's all collectively say, \"irashaimase\" - which is \"welcome\" in Japanese. It really is a small but kind detail that made us feel welcome and invited upon arrival. \n\nWe ordered the Shrimp Tempura Meal (A+), California Rolls (A+) & The Crazy California Roll (A+). All were well prepared, non-greasy and very tasty! \n\nI wasn't incredibly moved by the miso soup, but at $1.00 a bowl, what can you really expect? The waitress was positive and friendly, and in such a small setting, the personalized attention to details and service are omnipresent. \n\nWhen leaving Miyabi all of the chefs kindly say, \"arigatou gozaimashita, mata kite kudasai\" - which means \"Thank you, Come Again!\"\n\nFantastic!\n\nDefinitely recommend this place for small groups and late Saturday night eating (as they are open till 12:30am).\n\n:)", "author": "Carlos H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-03", "description": "it was ok.. the rolls are huge - which I don't like..\n\nWith so many other fabulous sushi places in the hood.. i give this one an ok..", "author": "Monica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-09", "description": "Miyabi is absolutely my favorite sushi place in SF and I've been around the sushi block once or twice in my day.\nThe food is always fresh and delicious and the prices cannot be beat. What's more, the staff is extremely friendly and all around wonderful. This place has it all!", "author": "Virginia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-27", "description": "I LOVE MIYABI!!!\n\nGreat prices, great food, and great quantity.  \n\nMost meals include miso soup, rice, and salad.\n\nFast service\nGreat for groups\nUsually no wait for a table (even when arriving with a large group)\nOpen late.  (midnight I think)", "author": "Lani P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-29", "description": "I love this place! Definitely my favorite sushi place in SF. Very clean, prompt, and food is always hot and fresh when served!", "author": "Marilyn D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-03", "description": "LOVE IT.\nWe spend $50.00 for 2 beers, a soda, 2 rolls, order of spicy tuna and 2 orders of Unagi.  For the kid we order Teryaki chicken from the appetizer section and ask them to leave off the vegetables, just meat on a stick.\nThey serve two big portions of the chicken.  We had Fried Tofu and a Seaweed Salad.  Too much food. SO good.  We have been enjoying this place for years.  Each time we go we have been trying to control what we order because we really stuff ourselves.\nService is friendly and very kind.  We even scored parking right out side\nwhich is rare for San Francisco eats.", "author": "Ari L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "food continues to please and the service is attentive.  i never have trouble getting a seat here.  My neighborhood favorite.", "author": "John A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-06", "description": "Three stars is just what this place is: A-OK. It's not a bad place. I wasn't disappointed or anything. I think there might be too much emphasis placed on four and five stars sometimes. It was clean and fresh enough, especially for the price. I'm glad it's in my hood and I can see dropping in for quick and casual dinners every now and again. It's just not a four star place. It is sufficient. Not romantic or innovative or memorable in any other large way.\n\nIt's A-OK.", "author": "Will R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Always Excellent! I live on the same block as this place and come here a couple times a week. It's quick and easy, always tastes great and the service is the best. I recommend their bento boxes as well as the 49ers roll!", "author": "Juan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-25", "description": "Decent. Not a place I'd go out of my way to eat at. The sushi tends to be ice-cold and often a little too mealy.  The service is pleasant, if rushed.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-07", "description": "Clean, cheap, open late (until 130AM on Friday for sure!), friendly service, cash or credit, spacious and no nonsense... sounds like a guy I once dated.\n\nAnyhoo! I've found myself with my nose pressed against their glass windows too often for my own good. So, here's the skinny in my own fine words.\n\nGOOD WHEN:\n1. You're lazy and cooking don't thrill you much... and the pay cut due to your furlough ain't helping\n2. You're looking to go on a first-second-third date... and its too early for that 3-week anniversary meal at Boulevard\n3. You're watching your wallet and don't want to spend a butt load on Warakabune and their sushi boat... unless he/she pays\n4. You're a bit tipsy after taking in the senior special at The Pilsner and need to carb up... and bring your senior with you too!\n5. You're tired of waiting in line at Chow's and you're seeing spots from low blood sugar... or coz your collar's too tight around your neck\n6. It's midnight on Friday night and you're REALLY NOT wanting to go to Sparky's... coz you've been there and done that and its a no! no!\n7. You just want to hang out with a friend (s), catch up, chat and are not looking to go all out... again, unless he/she pays\n\nGOOD FOR:\n1. Combination Dinner Boxes at $11 a pop are filling coming with soup, salad, rice and whatever combination you picked\n2. The Love Boat (I know! It's hilarious and comes in a boat) is a good deal with a nice variety of sushi\n3. Good old Japanese beers and saki (both hot and cold... like Kate Perry)\n4. Gyoza\n5. Oshiashi (boiled spinach with sesame seed) is nice\n6. Tempura Donburi is worth checking out\n\nAll in all, if you want simple Japanese that is cheap, quick, open late and a hop-skip away from Muni, this place is worth checking out.", "author": "Amit S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-19", "description": "I love this place. its soooo good so fresh. I order the miso soup and its always sooo good!!!! The sushi is the best! i love it here.", "author": "Betsy E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-05", "description": "3 Stars. Would probably give it a 3.5 if I wasn't comparing it to Warakabune, a block down the street. \n\nThe two of us each ordered albacore nigiri, which was just okay. It was fresh but the pieces were not very big and it wasn't as buttery delicious as I've had most other places in San Francsico.  What Warakabune lacks in roll selection, Miyabi certainly makes up for.  We ordered 5 rolls, which was way too much food, but we wanted to try it all since it was our first time. I especially liked some spicy tuna with tempura crunch roll and the crazy roll.  Good variety of rolls, something for everyone.  Prices were moderate. \n\nIf you want rolls, come here. If you want fresh nigiri or sashimi, walk the extra block and go to Warakbune.", "author": "kate m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-28", "description": "The food is still as good and great value as ever. But there's a new waiter who is truly terrible. He's impatient to take your order, as soon as you sit down, tries to push you into ordering what he thinks you should have. Then he decided independently to change what we ordered and had a really hard time putting it right. To finish off the evening he asked \"are you finished with your meal\" and when I said no he put someone else's plate on top of mine and took it away. He's the slightly chubby Asian guy. Avoid him and you'll be fine.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "Woh. \n\nI just found out this place is open past midnite! Talk about the icing on the cake! NICE! I've always dropped by this place for lunch. Great price, good portions, fresh fish. Here and there for dinner. Always I left Miyabi satisfied with no complaints. \n\nSome nights after work when I'm with the lady, I find myself craving sushi and wondering where I can go. Few places that come to mind are super expensive, or super Sh*tty if you get what I mean. To know that this place is open past midnite makes me want to do a hand stand! Especially since I work till 10pm+\n\nI'm sure I will be frequenting this place more often now.", "author": "Tip S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-26", "description": "Not only is it overpriced, but the sushi is awful. Even the soy sauce is incredibly salty and terrible.\n\nPerhaps it was just an off night, but man, not good.", "author": "K F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-18", "description": "It's ok for a late night Japanese place. I came here at midnight with a friend because their open sign was still lit up, but they refused to seat us and told us they had closed (even though closing time said 12:30). We finally ended up getting food to go.\n\nThe tempura udon was meh. The noodles were way overcooked and the tempura was too breaded. The gyoza tasted bland. My friend's sashimi dinner looked strange - he ended up not eating all of the sashimi because fish quality was questionable.\n\nI wouldn't come here again and it was pretty damn expensive.", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-25", "description": "Great service& food most of all freshness!\nMy favorite roll was double dragon roll!  Tempura and fried Tofu was yum too~ Fresh sashimi was outstanding. Overall great food,service,reasonable price, I will go back again.", "author": "Sook K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-15", "description": "I have just moved to San Francisco and have been looking for a good sushi place to go ---- and finally found one!\nI have been to many many many sushi restaurants - and you can rely on my comments here.\nFirst of all, GREAT price. Actually slightly less expensive compare to other sushi places.\nCute interior - waitresses are very very friendly - their appetizers are yummy - especially the warm aged tofu and \nfresh tempura place!!!! - my favorite.\nThe sashimi and rolls are delicious and very very FRESH - my favorite was the DOUBLE dragon roll! Must try! \nOn a rainy day like today - it's a perfect place to go and warm your stomach with some hot Sake and say hello to sushi and more~!", "author": "Super S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "REALLLY good food!!!! Had the baked salmon, and my friends had the lion king and some other rolls. They were all SOO tasty! The service was amazing too!! Will definitely come back!", "author": "Olivia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-27", "description": "Ive been here a few times since writing the below review but I went back today and the new waitress wouldnt let me sit where I wanted to.  There were only two tables full and I wanted to sit at a larger table since I needed to do some work.   I decided to leave and never return. \n\n--------------------\nUmmmm.... can I have some sushi with my SALT?  Holy cow, I dont know if they use cheap soy sauce, too many salted sesame seeds, salt in the wasabi... the rolls here are so salty that its not even a pleasant cheap sushi experience.   Granted its not as bad as Sushi Club... deep underneath all the salt I believe there to be truly mediocre sushi vs. just truly bad sushi.   Ill give them two stars because I had a Godzilla roll and it wasnt half bad.  Now, somebody please pass me some water.", "author": "Bigfrog W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-09", "description": "My first visit here I was expecting a lot. But the reason for going was the late night hour. The salmon tasted fine. However, I don't know the service was pretty sketchy. There was 4 of us and somehow the bill came out to $80? I think we got jipped! Two days later came back with the family and they said they had no kids menus, interesting I read them 2 days ago! They sat us waaaay in the back next to the bathrooms and never came back to check on us. I was eyeing the employees and they were eating in the front, not knowing we wanted to order more California rolls. Ah I'm cool-this isn't the spot for late night sushi!", "author": "Marie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-16", "description": "Great prices on vegetarian rolls and fair prices on special rolls, but nothing to make me feel this was anything other than a pedestrian sushi experience.\n\nThe seafood rolls came up a little lackluster. The eel in one of my rolls seemed to be mostly crispy skin and the sauce was less like a hint of BBQ sweetness and more like a melted lollipop. On the other side of the spectrum, the crazy-cheap Japanese plum roll was a perfect blend of salty sour and sweet.\n\nNext time we visit San Francisco, we're checking Yelp for a more \"foodie\" joint...but if you're in the neighborhood and want a nice, reliable sit-down experience, try Miyabi.", "author": "Keith S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-03", "description": "I ate here on a Thursday night after a long day at work looking forward to some good Japanese food.  Instead I got some mediocre food at best, and a really rude waitress.  I paid for my meal expecting a couple of dollars back in change.  When the waitress picked up my check, she didn't even bother to ask me if I needed change back so I waited patiently for about 20 minutes...still no change. So I go up to the register where she was standing and asked her if I could have my change.  She had the nerve to look at me all crazy and say 'Oh I thought you included your tip' to which I replied 'I am going to give you a tip, but I wanted change back first.'  So she grabs a couple of dollars out the register with attitude and places it in front of me without saying anything. So I leave a dollar for her without saying anything or without looking at her.  \n\nShe's lucky to have even got a tip.  \n\nHERE'S A GOOD TIP:  DON'T EAT HERE.  There are PLENTY of other JAPANESE RESTAURANTS in the CITY with BETTER FOOD AND BETTER SERVICE.", "author": "jason c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-08", "description": "I have always have good customer service here.  Maybe because we always go as a big group with co-workers.  I think their chicken teriyaki  could be more tender, it is on a dry side.  There bento box is nothing speical but reasonable priced.  I can see why they are not busy because as for most tempura item in other Japanese restaurant, I have seen more generous portions. They only have 1 shrimp in their tempura in their bento box.    They have smaller  CA rolls in the past. as I remember  are very tiny.  Now they are much better and bigger.  I think they are trying to be better to compete with so many good restaurants in the area.", "author": "Mar H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-06", "description": "Decently friendly service, prompt seating, and late hours do not make up for the poor sushi quality. They were rolled sloppily and did not taste fresh. The tempura was luke warm and appeared to be microwaved from when it was fried earlier. The seaweed salad was unappealing. I've tried this places a few times before, and it seems I will not be going back.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-19", "description": "I've been here numerous times over the years (dragged out by friends on birthdays or dates) and I have been disappointed every time. \n\nThe rolls are nothing special, underwhelming at best. The tastelessness of the rolls do not coincide with the price. Depending on the cook, the Bento boxes are either overfilled with unappetizing portions or lacking and a total rip off of your money.\n\nService is also sparse, even on a quiet night.", "author": "Manny V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-22", "description": "It was a toss-up between Crepevine and Miyabi today, but I have been in sushimania lately. The place was empty around 5:00, so I had a seat at the bar and got a few rolls. My server was very friendly and told me what her favorite rolls were, and the chefs each made half of my order to get it to me sooner. The pieces were larger than most sushi bars, so I was full and happy by the time I left. \n\nOrder:\nRock N' Roll (6pcs) x2\nSpider Roll (6pcs)\n$16.20\n\nParty:\nJust me\n\nPrices:\nFair\n\nService:\nFast, friendly\n\nWill I visit again?\nProbably, with friends.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-12", "description": "Was craving Japanese food today so decided to find an affordable place to check out. Decided on take out since it is quick. I got the chicken teriyaki and tempura lunch combo. For about $8 you get a large portion of chicken in syrupy teriyaki sauce goodness. The tempura was ok. Rice was soft and fluffy and salad looked fresh and dressing was mildly flavorful. If you are looking for dependable and affordable Japanese food, then drop by... I'd come back for more..", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-22", "description": "This place is consistently good for the price.I've been a customer for 4 years and I always find good service, great food and a nice atmosphere.\nThe bento boxes are cheap, and they carry some crazy rolls.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-06", "description": "This place is not too expensive and the sushi tastes good. I really like this place.", "author": "Joe V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-07", "description": "The worst piece of fish I've ever eaten in my life was served at this place.\n\nI had their Sushi Lunch ($7.95), and I truly regret ordering it.  California Rolls were just OK, but some of nigiri looked really sad.  I usually love Hamachi, but this one tasted like something frozen for a couple of years, defrosted, and sitting in the glass case of the sushi bar for a couple of weeks.  The after taste of the fish was so nasty that I had to eat a whole candy bar afterward.  \n\nI'm not a sushi snob who would not eat sushi in inexpensive places, but this one really made me reconsider my position.  Eeeeek!!!", "author": "Ryoko M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-06", "description": "Can you say sketchy? This place sucks hard. I've avoided it for years because it always looked marginal to me. Then my friend took me there and I caved. Big mistake. I was served a roll that had rancid avocado on it. When I tried to return it they refused to take it back saying that they get their avocado fresh daily. \"I don't f-ing care if you picked it off the tree. The avocado has passed and it's now rotten. Look at it, it's brown.\"  The people that run this place are serious idiots. Avoid it like the plague.", "author": "benjamin p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-06", "description": "I hate cooking for one. It means you will definitely have leftovers AND dishes to deal with all by yourself. No thanks. It's take out sushi time. =)\n\nRaw fish can be a hit or miss and last night I just wanted a sure thing. I can always count on sushi rolls with a combo of eel and/or avocado so that was my game plan. \n\nI called up Miyabi, told them I'd be there in an hour and ordered: \n\nDouble Dragon Roll - eel and cucumber on the inside and tobiko, avocado, and more eel on top. Everything I love in one roll! \nRock N' Roll - eel and avocado roll. Always good. As reliable as a side of french fries.. \nSpider Roll - Soft shell crab, avocado, and tobiko. Sometimes the soft shell crab is really small and sad but it was a pretty big here. Hot and freshly fried too. I'm happy! \n\nAffordable, convenient sushi. That's all folks!", "author": "Julia T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-07", "description": "I am highly allergic to MSG, when i asked if i could get my order without, the waitress said that everything on the menu had MSG.....so I left and i will never return.", "author": "tony n."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-23", "description": "Wins award for worst bowl of udon ever.  Great job.\n\n\nStay away from korean sushi restaurants. \n\n===Edit====\nLater that night... horrible stomach ache.", "author": "Rion S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-04", "description": "I know nothing about sushi.  I mean, it's vaguely ethnic and not deep fried, so you know, not really my thing.\n\nA friend was like \"meet me at Miyabi on Church\" and I was like \"jigga what?\" and he was all \"you know, the sushi place that is still representing for the 80s inside.\"\n\nAnd you know what?  This place was totally rocking big hair, hoop earrings and shoulder pads.  +1 star.\n\nWe ordered way too much food.  There wasn't enough space on our table for four!  I LIVE TO EAT.\n\nI thought the rolls we ordered were good but the binto box wasn't anything special.  I mean, if you're in the neighborhood and craving sushi this place will do.  Apparently there are better places nearby but I wouldn't know much about that.  Hmph.", "author": "Evan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-18", "description": "Miyabi is simply one of the friendliest and most trust-worthy sushi restaurants in my book. \n\nI go to Miyabi at least 3 times a week and in addition to their kind, friendly staff, I have never had any kind of concerns with the freshness of the food. Service is prompt, yet not intrusive.\n\nI really can't say enough great things about them.\n\nOh! and they're open until VERY LATE, unlike other places.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-07", "description": "Don't try to be cute & order nigiri because trust me, it sucks. Just order the big giant for american fatty rolls. It's okay. Really. You'll feel better. 3 stars because they're open fairly late (until 11:30, I think) which is very nice for me. \n\nAnyway, the first time I came here (in 2003) it was on a date with a person who spent the majority of their life in Japan. Now that I'm a much more experienced consumer, I really have to wonder what the fuck he was thinking by bringing me here. You really have to watch out with those people you meet on Craigslist.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "We stumbled in while wandering the neighborhood and walked out with one of the best food highs I've ever had.  Granted, this was my first sushi on the west coast, so I expected a treat, but this was above and beyond.\n\nWe were the first to arrive as they opened for dinner, and sat at the bar.  The executive chef was working, and was very friendly and welcoming, chatting with us as we ordered and tucked into our appetizers.  Service was attentive and efficient.\n\nTempura, salad and gyoza all struck me as okay; nothing to write home about but not what I judge a sushi bar by.  The miso was aromatic, flavorful, and just the right consistency.  The seaweed they use for their rolls stood out for its flavor and texture, the kind of attention to detail that tells you someone is really paying attention.  Presentations were traditional, not overblown art nouveau visual confections like you get in some trendier places, just good quality well-made sushi and sashimi.  Even the pickled ginger and wasabi were noticeably high quality.\n\nThe fish... Oh my goodness, such fish.  The uni, white tuna, and salmon were all the best I've tasted.  The chef recommended monk fish liver, which I'd never tried before, and while it won't displace my favorites it was an exquisite experience all the same.  I don't often leave a sushi bar feeling stuffed, but I couldn't have touched another bite, and the final price, for appetizers and soup/salad/entree for two, was surprisingly affordable.\n\nFor two Chicago natives, sushi of this quality and value is a rare treat, and I wish I could come back again and again.", "author": "Michael J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-22", "description": "Not extraordinary.\nNot horrible.\n\nAdequate sushi/sashimi.\n\nThe lunch menu is pretty decently priced - $6.95 gets you sashimi, chicken teriyaki, rice, soup and salad.  Not bad.  The sashimi is fresh (though cut very, very thinly.)  I also ordered the Hawaiian roll (aka, the spicy tuna roll) which was... adequate.\n\nI think that there are better places to get your fish on if you're a true sushi/sashimi aficionado... however, if you are truly jonsing for some fish & Miyabi is the only place you can find... adequate.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-03", "description": "Got the sashimi meal with 7 slices of sashimi (which would have equated about 3-4 slices  at any other restaurant), with salad, soup, and sushi rice.  This meal was pretty mediocre and definitely over priced for what you got.  I'm willing to give this place another shot and try their sushi rolls.  I'm staying away from the sashimi next time.  The fish probably would have tasted better if it was masked and doused with other sauces and veggies.   You'll get your value from a bento box/ California sushi style meal here.", "author": "Nadiyah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-16", "description": "Simple and Sweet.\n\n-Cheap FTW (for the win)\n-Good\n-Hardly a wait.\n-ToGo always ready on time.\n-Friendly\n\nDone.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "Looks mom and poppy, but the fish quality was surprisingly excellent. What more do you need?", "author": "Charlie Bolognese Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-26", "description": "It WAS good. I had the Samurai dinner which included sashimi, chicken teriyaki, shrimp/vegetable tempura, gyoza (2 pcs.) along with miso soup, salad and rice. My sister ordered some rolls, which weren't anything spectacular but still good.\n\nMy sister had one of my gyozas... told me it tasted rotten and that I shouldn't have eaten it. And yes, I did get a really horrible stomach ache after dinner... I sure paid for it later that night on the toilet. Never, ever again. :(", "author": "S. D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-20", "description": "I've only tried the sushi which was pretty good, but nothing I would go out of the way for. Service was mediocre. A customer thought I worked there and motioned me to seat him (!!!). The women's toilet was clogged with logs. \n\nI wouldn't really come back unless someone was paying for me. It is, however, better than that nameless sushi spot across the street, which I wouldn't go to, even if someone paid for me.", "author": "Zell C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-18", "description": "I've eaten here many times over the past few years and have always had generally good service and good food.  The decor isn't anything too exciting but the sushi and rolls are of mid/high quality, generous portions, and reasonably priced.  The house hot sake is also nice and tends to taste even better as I drink more.", "author": "Kent W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-04", "description": "Not bad.  Not good.  A-OK.\n\nLast time I was here, my friend tried the Nigiri Dinner, I tried the Tempura Dinner and I also ordered Salmon and Lemon rolls (Forgot the name already.  Urk.)\n\nThe tempura was disappointing but maybe it was my fault for not ordering sushi.  The roll was decent.  The salmon was relatively fresh.  \nI guess the price was OK and the quality was OK.\n\nBut OK gets three stars.  See above.", "author": "Aron L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-20", "description": "Hmmm. I'm reading the other reviewers and I'd say this place is no different from the other mediocre sushi places in the city.  I used to live a few doors down from here, would order pick-up or stop in every now and then and i've never really left feeling like they had good food.\n\nHow do you know when a place has good sushi?  When you get more fish than rice, meaning, they SHOULD NEVER pack on inches and inches of rice in your rolls or nigiri.  And sad to say, a LOT of sushi places in city do this. I call this cheating.  I'd say for amateur sushi eaters, they wouldn't mind or even notice, but I wouldn't qualify myself as an amateur anymore and good sushi is hard to find in the city.  The fish was not fresh and the food was just ok.  The wait staff have never been attentive or pleasant, sometimes, a little brusque.", "author": "I love t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-18", "description": "My favorite cheap sushi spot- you can buy rolls for $3.50. I love the spicy tuna, shrimp and avocado, and rock n roll. Basic stuff, but pretty fresh and delish. I'm not into all those crazy fried concoctions Americans love so much. \n\nSmall and a nice atmosphere.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-06", "description": "Ug, you know the last time I was here I noticed everything seemed to have taken a dive.  Maybe it was just a bad night, but it was really some of the worst sushi I have ever had.  Snapper and Yellow Tail were really not fresh.  It was very disappointing.  And I can say definitely the worst uni of my life!  It was quite literally hard to swallow, disgusting.  I'm really not sure what they did to it.  I'm going to shop around for new sushi places.", "author": "Luke M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-09-06", "description": "Please don't give this place business. I used to come here years ago, when I lived around the corner. The first 5 times, it was good/okay. You know, good for a bite after work. Decent sushi, comparitively priced with the neighborhood, and a special treat to myself during my financially scrappy years.\r\n\r\nThe 6th time must have been a charm, or omen. I ordered the sashimi, which the chef decided to slice paper thin. For the price they charged, I swear it looked like 3 slices were cut from one normal sashimi slice. I asked the server if this was the usual serving and she flew into a tirade at me arguing. She told me that this is how it's served in Japan. Huh??!!! I've had sashimi all my life, and in Japan, as well, and it was never like this. I shouldn't have lost my cool, but her instant outburst pushed my buttons.\r\n\r\nThe server proceeded to talk out loud to the chef in Korean obviously berrating me. I've not gone back since, and checking out the reviews here for the first time, it's apparent I'm not the only customer fallen victim to their service.\r\n\r\nIf you're hankering for sushi in this area, go to Warakabune down the street, or Hanabi near Haight & Fillmore. Better yet, check out Sushi Zone tucked away on Market & McCoppin (totally amazing if you can get in). Miyabi, thumbs down....", "author": "Antoi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-09", "description": "Ok. Just ok. \nIf you think this is great sushi that is in itself just really sad.\n\nI don't hate it here. I don't love it. I simply just won't go back due to so many other and vastly better options in the area.\n\n(Swear to god the sentence above was also uttered by an ex gf about me.......)", "author": "Rich S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-18", "description": "Miyabi has a friendly waitstaff that seems eager to please.  Too bad the fish isn't good and the miso is thin and tasteless -- two things waitstaff cannot change.   \n\nMy husband and I split a sashimi plate, Cali rolls, and ama ebi.  Fish was just so-so, unpleasantly soft to the bite and lacking flavor.  Not worth the price.  The fried shrimp heads were greasy and tough.  And I hate dyed pink ginger!  \n\n1/2 star for waitstaff, 1 stars for cozy ambience, cleanliness, and being open late, 1 star for offering real crab California rolls  (but you lose 1/2 star for having that by request only).  I wouldn't go back unless someone was treating, and I think I'd probably just get a California Roll.", "author": "saudade s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "This is a really good place for sushi. Very pleasant atmosphere, comfortable, not too fluorescent as these joints can sometimes be... really friendly staff... really fresh fish. This is way better than the place down the street with the boats.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-08", "description": "The service was lovely. The food, however, was very disappointing. It was strange how fast it came, too. Before I could even have a few sips of my miso soup my rolls came to me. They looked sad. The fish looked as though it had been in the freezer then put in a blender and formed around the rice. It was mushy in a bad way, and not fresh. My boyfriend's dinner box was similarly foodcourt quality. Perhaps Sunday is a bad day to get sushi because the fish isn't fresh?", "author": "Mark S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-13", "description": "I think the ridiculous house music is actually better than the sushi, but I'm not positive.\n\nAcceptable, not stellar sushi at good prices.  You can usually get a seat quickly as well.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-07", "description": "Pretty nice place to go for Japanese food.  \n\nSmaller tables up front while the larger family tables were in the back.\n\nI enjoyed the service I get when I go there.\n\nThe food is pretty good, not really the best, but a lot better than some places I have been to before.  I love their Chicken Katsu.\n\nIt's nicely priced, especially if you go during lunch.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-31", "description": "One step above Osaka Sushi in the Castro, mainly because Miyabi is cheaper, but also because I boycotted Osaka since last year. Miyabi  has been around for years and years, and they do know how to run a Japanese restaurant.\n\nThe starters are fine, and the seaweed salad is just as good as any in the city. The rolls are pretty much average but inexpensive, and the sashimi dinners are perfectly fine, especially for the price. \n\nDon't expect to be floored by the experience here. That's kind of a pun, because the floor was recently replaced or refinished. It makes the place much brighter and inviting. The staff usually distributes plenty of smiles in your direction, which is a nice departure from being served by zombies.  Try this place out a few times.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-01", "description": "The sushi here might not be what you'd find in Japan, but it tastes great. I went for a friend's bday. We started the meal off off with 2 bottles of hot sake ($5.50 for 4 or 5 servings), a complimentary order of edimami, and two bowls of seaweed salad. Mmmmmm...seaweed salad.\n\nIf you don't know what to get, order one of these:\n\nunagi & avocado roll (\"Rock 'n' Roll\")\ndeep fried asparagus & mango roll (\"Church Roll\")\nfried spicy tuna roll (\"Dynamite Roll\"\")\n\n...or order something else. It's all good here.\n\nAt the end of the meal, they served up a few complimentary green tea ice creams.\n\nGreat service. Great food. Great prices. Great for groups.\n\nI'm going back.", "author": "Wes F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "The service was good, but the food was Awesome.  Promptly greeted and seated.  We were given the perfect amount of time to decide and was served each course with enough time to enjoy before the next one was brought.  My only complaint is that I had to wait a bit for drink refills, but other then that it was a perfect meal for the price!!!", "author": "Rikki S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "The rolls are scruptious. Try the flaming cali roll or the firecracker! The 49 er is always a favorite. The atmosphere is a little bland but the friendly staff make up for it. There are several locations in SF so stop by and try one yummy sushi spot.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-06", "description": "This place is pretty good. The service is okay, the food is cheap and the place has a cozy atmosphere. I think this place is more suitable for a 2-4 people kinda dinner, since the place is pretty small and is just convenient for a small gathering dinner party. Another thing what i like about this place was how fast they serve your food. Usually in any other restaurants, i would have to wait for about 20 minutes, but in Miyabi they serve it to you in only 15 minutes. Pretty amazing, i would say. However, the food is just so so, didn't complain but since the price is pretty cheap. i gave three stars for it.", "author": "Cavin T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-20", "description": "Miyabi is perfectly fine.  It's open late.  And it has a great mango and deep-fried asparagus roll.  \n\nAnd its a nice place.  The food is nice.  The place is nice.  We enjoy it when we want a step above No-Name, although it's not super cheap.  Just cheap.  And nice.  The pickled vegetables are really nice.", "author": "Nicole and Kayvon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "Awesome place and awesome rolls. Sunny our server was quick and very polite. Must try the no name roll the next time you are around the neighborhood. :)", "author": "Lynne E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-10", "description": "Ended up here by default because I was craving udon? The sushi is really, really average but not gross. The service is good, but the food is pretty basic. Then again, you get what you pay for. \n\nThis isn't bad for udon and donburi, but skip the rolls!", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-16", "description": "My boyfriend and I just had dinner here and thought we should write a review because this is actually the first restaurant we liked in San Francisco. We just moved here from the NY and have a difficult time finding a descent place to eat, with friendly service.\n\nThe wait staff was very friendly. The prices were great, and sushi rolls were excellent.", "author": "Gina H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-17", "description": "upon learning that there is a place that dishes out korean, i was ecstatic for some bibimbap for lunch. but again, fidi eateries defeated me. \n\nfor $9.80, i had a bibimbap with bulgogi ($2) and an egg sunny side ($1). this is the first time i've had a bibimbap that did not have any sort of broth drizzled on the rice before topping the egg. how can you do that? the rice is incredibly hard and chewy, with zero flavor. i had to slather on the hot sauce (which i usually don't have to - not entirely anyway) to be able to digest the grains. \n\nand... there were RAW lettuce in it. i know it comes with veggies, but that's just a bit weird, don't you think? \n\nwhere are you international food court and why have you been burnt down?! it's in your absence that i must deal with these over-priced scrappy asian food. in snooki's words: waaaaaah!", "author": "Fiona S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-01", "description": "Very average sushi place.  The fish I find is okay.  Nothing to write home about. The service isn't so great.  In fact my boyfriend has claimed one of the waitresses is one of his arch enemies because when he ordered a beer that came to him flat, she argued with him that that was how it was supposed to taste for a few minutes.  \"I order this beer all the time and this is skunked.\"  I tried it too and no, he wasn't trying to get a free beer, he just wanted one that tasted right.  She was nasty with us the rest of the night and the other few times we went, she held her grudge.  So we stopped going for awhile because it was just okay.\n\nWe went back last weekend and the nemesis wasn't there, but the other waitresses seemed so unhappy to be there and the fish was STILL average.  We won't be back for dinner for a long time.\n\nIt gets 3 stars instead of 2 simply because they have mind blowing lunch specials...SUPER cheap deals...and cheap food gets you far in my book.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-08", "description": "This place was pretty cheap but the quality of the food was sub-par.\nI have had MUCH fresher sushi at places with the same pricepoint.\n\nmy boyfriend ordered the fried tofu steak with veggies and it was by none the WORST meal he has ever ordered in a restaurant. The \"fried\" skin was so soft that it was gooey and you could pick up the peice of super soft tofu with just the \"fried\" skin and it would stretch and ooze!\n\nwont be coming back here", "author": "Keila E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-15", "description": "This place is pretty good. It's not the best quality sushi, but the price makes it all worth while. They are reasonably priced, and in fact my sushi dinner never exceeds $15. And if you have an appetite like me, you would understand that this is very hard to do! I love their salad dressing. And most especially love that they let you apply the dressing to your liking. As well as keep the entire bottle at your table! YUM! I don't normally order anything but sushi, seaweed salad and a regular green salad. My friends have had the tempura and bento boxes and didn't have any complaints.", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-09", "description": "Just OK.  To be honest, this joint holds a special place in the ole kicker - the GF used to live above it and we frequented the place together.\n\nBUT, it is just an S.F. sushi joint - sub-standard sashimi (dyed all to hell - seriously, you DON'T want to know that color the maguro REALLY is...), worse sushi, and very good rolls.  And really the rolls are this place's strong point.  Better than any of the Van Ness joints, but not as good as Kamekyo's.  Again, par for the course.\n\nNone of the rest of the fare was anything to write home about - I'm admittedly a snob when it comes to Japanese food, and this isn't Japanese-Japanese food.  But really, for the price, in this part of town, the place is hard to beat if you're in the mood.\n\nBut if you're willing to spend some money and get genuinely world-class sushi, there's only one place to go (and I feel dirty for saying this EVERY time I say it): Ozumo...(ambiance-iCK!)", "author": "Forrest C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-11", "description": "Come to Miyabi on Church st if you want excellent sushis, I think the owners are Korean though! anyway, it's all good.", "author": "Will P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-14", "description": "love this place at night. I went the night before valentine's day. They had cute window decorations :) We had rock n roll sushi, godzilla, salmon bento, and some other stuff. Sushi was average, but I liked being here. It's totally worth the price......everything is so darn cheap. I'd come here again beause I love church st. at night. So beautiful..\n\ngreat place to go with your bf/gf", "author": "Bonita C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-21", "description": "I just LOVE this place. And don't get me wrong, it's not like I'm saying this is the best sushi I've ever had in my entire life, it's just that as an establishment, this doesn't get much better in terms of combination of GREATS in my book.\n\nGREAT sushi. This is very important. It's totally solid in my book, and I'm a sushi-lover. But what makes it stand out is that it is VERY affordable...makes it taste THAT much better. :)\n\nGREAT service....I can't remember the waitress' name that I usually see when I go there, but she is so super friendly, and courteous, and because I'm a regular and in the neighborhood (I go so often that I think she has figured this out by now), she totally hooks me up when I get take out, or when I'm dining in. A business that isn't afraid to do that for its regulars is a real PLUS in my book.\n\nGREAT hours...what sushi place out there is open and serving people until 12:30am? Miyabi!!! Has saved me on MULTIPLE occasions, and the atmosphere is super chill...\n\nGREAT for groups...took ten people there one day and they didn't even blink, seated us right away...which, now that I think about it, they ALWAYS seat me right away, almost never have to wait....MAJOR BONUS POINTS...\n\nGREAT location....now this makes me a bit biased, because it's around the corner from me, but it's also around the corner from the Church Street MUNI stop....definitely easy access...\n\nWhat else can I say about this place? Amazing combo! And I can speak with authority because I've been going there for two years now, definitely a regular (sometimes go once a week for months on end), and I can't believe it took me this long to review them....So there! Go !!!\nYou won't be disappointed!!", "author": "Martina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-12", "description": "My sister and I have lovingly dubbed Miyabi as \"our place\" and for good reason.  The sushi is consistantly good and cheap.  The atmosphere is relaxed and unpretentious.  I bring a lot of friends here and am hard pressed to find anyone who doesn't like this place.\n\nMy sister and I have started ordering the sushi to-go, to allow for more lingering over conversation and wine.  Though, I have never been rushed while eating-in and the staff is usually very attentive.  Anyhow, we never wait more than 10 minutes for our to-go orders.  A nice touch- they bring hot tea to sip while we wait for our food at the table near the hostess stand. \n\nThis is a simple place not meant for Sushi-snobs. If you want to try something a little less traditional I suggest the deep-fried asparagus and mango roll!  If you want an elevated expensive experience go to Blowfish.    \n\nNice people.  Good food.  Good prices.  Great for a casual meal with friends or siblings.", "author": "Maura M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-12", "description": "This is a great place to come for lunch while you work!  For $5.95, you can get chicken teriyaki, california roll, rice, salad and miso soup, all of which are sizable portions.  Is the taste spectacular?  No.  But does it taste good?  Yes.  And where else can you get a sit-down Japanese lunch in the city for about $8 (tax + tip)?\n\nThe restaurant is located right next to the Church Street MUNI station.", "author": "Pat S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-22", "description": "There are quite a few reviews for Miyabi, and the bottom line is, for me...once is enough.  If you like sub par Japanese food at prices that are not that inexpensive then by all means enjoy. Life is too short...even if you are a cat with 9 lives.  : )", "author": "Gregory C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "Nice friendly people working here. Place is not fancy and good look a little nicer, but the fish is fresh and the rolls are always consistently good and tasty. Get the window seat and watch everyone go by as you drink saki and have a good meal. Parking is tough in the neighborhood, but its right next to a muni station.", "author": "Eric K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-10", "description": "Miyabi Sushi has been my sushi go to spot since moving to the city four years ago. The food has always been fresh and delicious since my first trip here and continues to be so. I love the new look they have now with the remodeling! The staff is also very friendly and gave me free miso soup on a take out order last week. \n\nGreat place, great food, and great price!", "author": "Mindy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-09", "description": "Miaybe is a quaint little sushi bar with good sized rolls for fair prices. If you're trying to impress a hot date by taking them out to a 'hip' sushi scene, then this is not your place. \nBut if it's a weeknight and you don't want to pay extra for \"atmosphere\", you won't be disappointed with the fresh, inventive and affordable sushi at Miyabe.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-25", "description": "Meh. Decent sushi for the price you pay. Helluva lot better than that sauna of a sushi place across the street... aka. No Name\n\nAnd what's all this talk of house music? All I heard was Phil Collins playing on the loud speaker. Gotta give it to 96.5 - KOIT.", "author": "I Love Beef C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-20", "description": "One of my favourite *reasonable* sushi places.  Open late 'til 1am Mon-Sat.  \n\nThe oshitashi (spinach & vinegar) is fabulously, appropriately sour.  The fish is fresh and very good; the staff friendly.  Whenever I go with a large group we always get extras free: sake, croquettes, salad...", "author": "Claudine C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-20", "description": "I am planning a trip to San Fran and my friends and I love sushi. But it seems this restaurant isn't so accommodating to the disabled. I'm horrified to have read a review where a service animal was marginalized and the customer treated as a second class citizen. Since two of my group coming to this city are disabled, I will be sure to take my business elsewhere. \n\nBTW, if you live in the area and have a service animal, I would go there with the animal on principle alone.", "author": "jay g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-25", "description": "Mister Sushi Snob checking in!\n\nA friend of mine brought home some Miyabi takeout and asked if I wanted to polish off the last of his California rolls. I tentatively popped one in my mouth, experimenting to make sure it was \"proper sushi snob fare.\"\n\nZmog!\n\nToday, I made up some idiot excuse to be in the Castro today just to visit Miyabi and I loved it. I had my usual first visit meal; salad, unagi nigiri and gyoza - all of it was excellent! I didn't do soup because it was a hot day, and I was not in the mood to sweat all over MUNI.\n\nService is very quick. I barely got my chop sticks separated for my salad when the nigiri was deposited on my table. A few minutes later, the gyoza lined up right behind the nigiri.\n\nYummy.\n\nThe prices here are very reasonable, hell, they are cheap! I got my bill and had to stare at it to figure out why it was so cheap. A 10 spot got me out the door (minus a lavish tip of course)\n\nIf you too need an excuse to wander over to the Castro to sample the eats, there is a Walgreens at Market and Church. You could always move your prescriptions to the local Walgreens and use the excuse that the \"pharmacist on Church is a hottie\" or you could come up with some other creative reason. \n\nUse whatever works!", "author": "Storm W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-19", "description": "When I visit my sister in the city, this is my favorite place to eat dinner in her neighborhood. I am impressed at how good the sushi is when the price is so cheap. I eat sushi frequently at a variety of places and I feel that this place is at the top of my list for ambiance, friendly wait staff, quick to be seated, and creative, aesthetic, fresh sushi rolls.  \nI especially love the green tea that they serve as we wait for our food. It tastes exceptionally good to me. As for food, I have only ordered rolls here. They are plentiful, pretty to look at, and very tasty.  I usually feel satisfied after eating two rolls and a miso soup.\nThe restaurant is small, but well decorated and clean and has a relaxed feel to it. I get the sense that they have a lot of neighborhood regulars.\nI recommend this restaurant for a casual night eating experience for one person or small groups of 2 or 3 people.", "author": "Tricky H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-22", "description": "This is a good late-night and take-out sushi option. The prices are decent and the fish tastes fresh. I'm by no means a connoisseur but their salmon sushi is deeeeelish.\n\nI don't know what it is, but every time I come here and order to-go, the waitress is a total bitch. I don't deserve this treatment. I'm nice. I tip. I'm apologetic when I ask for extra wasabi and ginger (So VERY sorry. I know how much trouble it must be to roll up that extra ball of green goo.)\n\nWell too bad Miss Look Of Disdain! This thorn in your side isn't budging. I'll be coming back again and again. I'm here! I live near! Get used to it!", "author": "Chelsea T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-07", "description": "Miyabi offers reasonably priced sushi. You can easily walk out satiated for $15 and that is a good thing. Not much on ambience and a dated decor, but the price is the driver here. Easy location to get to as well. Recommend just about anything on the menu.", "author": "Jim H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-07", "description": "This used to be a great value of a sushi restaurant but after two visits of mediocre service and disappointing food, I would have to reconsider my original judgement.\n\nI am reluctant to make such a harsh comment because I have had such fond memories of this sushi bar when I lived down the street.  But that was years ago and now the service has been cold and sloppy and the sushi not so fresh.  They pre-slice the fish for crying out loud.  Anyway, I wish they would do something to bring back the old Miyabi I once new...", "author": "Joe O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-20", "description": "Miyabi's is my favorite place to get a huge Bento lunch for under $8 and if I'm feeling especially worthy of a good meal, I love the Sake Nigiri and the Unagi Nigiri too. Other yummy rolls include the Dragon Roll, Double Dragon and Godzilla. \n\nThe service is good. I took my best friend here for his Birthday and the waitress brought us out some ice cream for our cake : ) It was unexpected and I thought it was so sweet of them to do.", "author": "Shannon A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-16", "description": "Certainly, this isn't the best sushi joint in the world.  But it's generally reliable, the service is good, prices are reasonable, and they're open late (we never arrive before 10:30).\n\nOur group goes at least once a week, and they quickly learned to spot us as 'regulars' and treat us well.", "author": "Jeff F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-24", "description": "Nothing special.  A small neighborhood sushi joint.  A great place to drop by and get a bite to eat.  I got the godzilla, Saigon, and rainbow rolls.  I don't hate it, I don't love it.  If it's in your neighborhood, it would just be a convenient place to go to when you are having cravings.", "author": "Julie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-08", "description": "There are nicer places, but for the price it is a great deal.\n\nI had Yakitori for appetizer, and as a group shared Saigon rolls, Narita rolls, and a 'Love Boat', which is strange because it's only designed for one person (it included a single miso and salad). Miyabi proprietor, if you're reading: any product containing the term 'Love Boat' is supposed to be for two people, ok? Anyway, the Love Boat has about 12 pcs of your standard assortment of basic sushi, and provides a nice staple around which you can order some more inventive fare.  Saigon rolls are spicy tuna with tempura batter on the outside and Narita rolls are avocado, unagi, and shrimp tempura.  I thought both were well done.  \n\nI also had a soju cocktail.   It wasn't amazing but like everything else it was great for the cost.", "author": "K. B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-27", "description": "So my roommate and I wanted to venture out in the city and discover new places since we've been living in SF for about 3 years and we only really knew the \"usual\" places. Taking the M line, I mentioned how Ive never gotten off the Church stop. She said she has gotten off there before and knew there were a few restaurants there. I was starving, so I agreed to stop there. \n\nWe look around at all the different restaurants and we saw Miyabi. We were both craving sushi a few days before so we decided to try it. It was really empty when we first got there but it was probably cause it was 11am and I dont think a lot of people get sushi at 11 in the morning. We ordered a bento box with beef teriyaki, tempura, and california rolls. We also ordered a double dragon roll. We decided to share it because we knew it was gonna be humongous.\n\nA lot of people started coming in for lunch, so we knew that this place must be good if there were people coming in.\n\nThe waitress brought us two miso soups since we were sharing which was very generous of her considering the bento box only comes with one miso soup.\n\nOur food was brought to us shortly after. Fast service.\n\nThe food was delicious. It wasn't super spectacular like the best sushi ive had in the world but It was good and I was hungry. It totally satisfied both me and my roommate even though we shared.\n\nThe double dragon roll was delicious! especially if you love avocado! \n\nI definitely liked this place, way more than the usual sushi place we settle for at west portal, Suki sushi. I will probably go the this restaurant if im ever feeling sushi and in the area!", "author": "Ricialg P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-07", "description": "The first time I came here, I ordered the sushi lunch and decided never to come back again. The quality of the fish, especially the albacore and maguro were pretty bad. The quality of the salmon was also mediocre. When you have 3 out of 5 nigiri in the entree at a substandard quality, it means any other dish with those fish will be of substandard quality... at least until they receive their next order. \n\nFortunately, I decided to give it another chance. The next time I came back, I ordered a deluxe bento box. It comes with tempura, ca rolls, 2 pieces of nigiri (salmon and tuna), gyoza, salad, miso soup, rice, and whatever main entree you choose. I usually get chicken or salmon teriyaki. For the price (around 10 dollars before tip) it is a great deal. Nothing stands out , but nothing fails greatly either. Maybe that first time was a fluke.. but the fish that come with the bento box always seems to be fine. \n\nService is good, they refill tea often enough, and the waitresses are friendly. For the price, portion size, and location (close to Market) it is a good place to satisfy your craving for basic japanese food. If you are looking for super fresh, quality sushi with an ambience to match, go elsewhere.", "author": "Jim Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-15", "description": "I've decided to delete my previous snide review in favor of something much more gracious because my tune towards Miyabi has changed dramatically in the past few months.  \n\nSure it's far from authentic  and hip, and may seem like it's the same old  run of the mill, boring, Americanized, Japanese food.  BUT....\n\nIt's consistently delicious, open late, and the church roll is the greatest roll on the face of the planet.  Mango + deep fried asparagus= heaven, a vegetarian's wet dream.\n\nVIVA LA CHURCH ROLL!", "author": "Marie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-24", "description": "The not-so-ancient proverb of sushi: You get what you pay for.\n\nThat said, I left my credit card there in a drunken sake bomb stupor and they had it the next day for me. Thanks Miyabi!", "author": "Whit P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-01", "description": "I am giving miyabi 5 stars for the following reasons:\n\nService... Flawless. Every time I go in here I am greeted warmly, seated promptly, and my order is taken and brought out to me in a very timely manner. They are all very sweet, polite and hospitable.\n\nPrice... Totally affordable for casual, quality sushi.\n\nLocation... It's extremely convenient because basically every muni rail line stops here.\n\nFood... It's ALL about the godzilla roll. Oh... my... goodness. I have found heaven in a deep-fried sushi roll. Every time I have a few extra dollars in my wallet I like to treat my boyfriend to a few godzilla rolls and some miso soup... It's cheap, delicious, filling and the perfect amount of spicy!\n\nThis is definitely in the top 10 of my favorite restaurants in San Francisco... it's probably actually in the top 5!", "author": "Felicity M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-20", "description": "so yaaay! my first yelp review! and what better place to start than miyabi's!....the service staff treats us like family, cause we go here so much. Been going for years whenever me and my friends need a sushi fix this is where we go.\n\nthe church roll is all time fav. its deleesh, and the combo is so odd who woulda thought? (mango and asparagus)There is also a california roll with fresh salmon and a sliver of lemon slice wrapped around it, i forget the name, but its soooo goood.\n\nThe fish is always fresh and never smells fishy. The salmon and hamachi is yummmmmy!\n\ngyoza is super fresh as well and is fried to a crispy goodness...\n\nnot much more to say but  that miyabi's is definitely a hidden gem in the city, and is one of the most underrated places i know.\n\nyummm i kinda wanna go now.", "author": "Jennifer J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-21", "description": "GREAT for lunch.\n\nA lot of decent food for the price.  \n\nI usually go for the Bento for 8 dollars, and I can never finish it.\n\n(You get a Miso Soup, 4-5 pieces Tempura with 2 Gyoza, 6 pieces of California Roll, A small Salad, a side of Rice, AND Chicken Teriyaki)\n\nI probably wouldn't go for dinner though.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-07", "description": "This is the local Sushi restaurant that has been around over 20 years!\n\nThe fish is fresh and of high quality.\nIts updated its floors . it is not pretentious and has a very\n80's style decor, making it a place that is under-stated and\nnot for the fashion conscious.\n\nThe love the 49er roll. The fish Boats are a great deal and price to quality ratio cannot be beat.\n\nIts great where the people are the central focus and not the decor.\nThe food is consistent and love the take out from this place.\n\nThe Tempura and Teriyaki are great.\nThe lunch menu is incredible during the week if you are able to get there.", "author": "Joe R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-26", "description": "Not sure why this place gets so many negative reviews...the night I went, it was really good!  The fish was really fresh, they were open late (a good, more healthy alternative to greasy Sparkys, across the street), and how could you go wrong with $1 miso soup?\nOnly problem is when my friend and I entered at 11pm, they looked a little pissed as if they were closing and we totally disrupted that...but they were open for another hour.  Also service is a little spotty.  After the wasabi burn 5 times over, I needed a tea refill...it took forever.", "author": "Suzanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-27", "description": "I always seem to come back after trying several other sushi restaurants in the bay area.  The service is really good.  Always quick and excellent quality.  I prefer the sashimi and it is always fresh and portions are quite reasonable for the price.  Once again, the service is what makes it more appealing and for a small restaurant they do a good job.   I always have a happy tummy and my wallet is not damaged!", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-17", "description": "Been here a couple times for lunch. Definitely good lunch deal with the Bento Box. Incredible amount of food for less than $10. It comes with a salad, rice, tempura, chicken teriyaki, and california rolls. Very filling, and not bad tasting. I will definitely try this place again if i'm in the area craving Japanese food. 4 stars.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-18", "description": "I really like this place. Prices are right, especially for the locale. The salad dressing is great. The atmosphere isn't amazing, but it's totally comfortable. A nice refuge from the craziness outside. They let you hang out. The food and service are great. It's like Japanese comfort food.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-09", "description": "I have tried a few places in the city and this is by far one of my favorites.  I recommend the swamp roll as well as the godzilla roll.  Oh ya i had some other thing, yellow snapper jaw or something I can't remember what it was but sooo tasty!\n\nI wish I lived closer.", "author": "Nolan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-24", "description": "Above average sushi, but I don't think I would make it a point to visit this place if you weren't already in the neighborhood.  \n\nI've been here many times now since I have a friend who lives within a block.  There are 2 other sushi joints nearby, but one is cramped with no music, and the other is a sushi boat with traditional Japanese music and a much less selective menu.\n\nThis leaves us with Miyabi.  True, the top 100 music more amusing the conducive to setting an atmosphere.  The staff can be inattentive at times, and are almost always disinterested.  But the sashimi and rolls are always very good, and the price is fair.", "author": "Miller H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-24", "description": "This place is pretty good. Clean and fast, sometimes in the evening they get pretty packed so i usually order to go, almost weekly. Rolls are decent. Salads are OK. Never tried their sashimi so i don't know how it is.", "author": "dj g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-19", "description": "For those of us who can't afford the sushi of the SF elite, Miyabi does just fine. Good sushi, good prices, nice people, open very late, never annoyingly crowded. The church roll is, indeed, delicious.\r\n\r\nUpdate: I added the final fifth star to Miyabi cause they're just so damn nice, and after recently sampling some more of SF's cheaper sushi options, Miyabi is even better in comparison! So, in sum, a fabulous deal.", "author": "Judge M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-14", "description": "Wow, I haven't had such terrible sushi since...well never. Even grocery store sushi in Sylvania, Ohio is better than Miyabi. Hate to be harsh but no joke, my sashimi was frozen rubber. My teeth couldn't even bare to bite through all the way - stopped mid way and never looked back. I could tell from walking in not to expect fresh off the boat sushi, so thank god I didn't go for an all sushi dinner. I went with sesame spinach starter and salmon teriyaki with a side of sashimi. While the salmon was edible, the spinach was as bad as the sashimi. Typically when a restaurant says sesame, you get the thick sweet peanut like sauce. They served theirs drenched in some thin soy vinegar sauce. It was way too vinegar-y and it was tough to choke down, even with rice. Sorry, Miyabi, no stars for you.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-20", "description": "I have never been let down at this small, yet spacious sushi joint. Then again, I have only been twice...muahahaha\nThe fried softshell crab w/ avocado was tasty. Just the right amount of crab and fillings...\nThe Asparagus/Mango roll was sweet and tart and made for a delicious match... add eel to this and I bet it would be fantastic...\nThe spicy (white) tuna roll (pocky roll) was tasty! Not too spicy, but enough to tickle the tongue. The amount of fish was plenty, a mouthfull without giving an overpowering taste of the sea.\nLastly, you will be able to enjoy great company (here on a trendy street) and still be able to talk and connect. Whether out on a date or just meeting friends, this spot will always fill you up and not empty your wallet!", "author": "Mitchell W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-28", "description": "The food is great and so is the service . . . we never have to wait long to get our food. The rolls are very good and everything is affordable.", "author": "Karina S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-08", "description": "We have come here a few times and there are really not many options for vegetarians.  There is the vegetable tempura which comes with soup (that has fish in it).  The tempura is OK, but if you are vegetarian, do not come here.", "author": "Jonathan U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-22", "description": "Miyabi is my go to Sushi place!  Eat the Godzilla Roll!  It will change your life!  They have another roll that is essentially a fried roll of cream cheese... aaamazing!", "author": "Hayley T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-23", "description": "I just meet a friend here for lunch a couple of times a month. We both have the Bento for $7.95 -- so, we're out the door for under $10.\n\nPleasant, cheap, convenient.", "author": "BigJohnS F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-29", "description": "I love this place. I wondered into this place to meet a friend for lunch. They had this combo plate that had sushi, salad, soup, chicken, tumpra and more, all for the low price of 7.95. You just cant beat that deal. I had my sushi fix and for under 10$. I go back all the time, now!!", "author": "Heather P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-27", "description": "I make it a point to come here every time I'm in San Fransisco. Miyabi is so good! Taste's great, seems fresh, and very cheap! You can get two regular rolls and a drink for less than 10 bucks! I've probably been here about four or five times. Service is fast and somewhat friendly. I'm not a fan of their bathroom, its old and ghetto.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "I think Myabi is one of the best sushi places in town. Prices are reasonable, service is consistently good.", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-07", "description": "After being threatened with having coins thrown at me by a homeless man in the Tenderloin for not shelling out a dollar, my boyfriend and I in our shocked state decided to seek comfort through sushi and nice bowl of miso soup. \n\nWe got our miso soup and also a complementary edamame. I had ordered the Shogun dinner special. Before I even had time to squeeze an edamame pod in my mouth, my bento box dinner arrives. The waitress struggled to create room on the table given that she just filled it with our drinks, soup, and salad just a few seconds ago. My precious appetizer time had been stolen from us. \n\nThe restaurant must get their fresh load of fish on Mondays; we went on a Sunday. The tuna was brownish and the salmon slimy. The salmon teriyaki was lean cuisine bland as well. \n\nI give this place two stars because I did enjoy the yellow pickles. The price wasn't so bad either but I could pay the same amount on 9th Ave for better sushi and appetizer indulgence time.", "author": "Wing P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-10", "description": "After hearing of Miyabi from several friends and reading mixed reviews here, I decided it was time to try it out. The verdict? The sushi is good but not spectacular, but the service was very friendly and I liked the atmosphere. The fish and shellfish is nice and fresh, but the rice is not as good as I've had elsewhere... and that makes a difference for sushi. I definitely prefer Daimaru on 17th and Sanchez which is a bit slow but worth the wait for totally awesome sushi and sashimi!", "author": "José C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-16", "description": "So cheap!  So fresh!  Such big portions!  Such nice people!\n\nI am bored of No-Name's lack of salmon and lack of tempura.  I am extra bored of waiting in line for over an hour to be crowded wtih strangers and hurried out.  Go across the street to Miyabi, it ain't that much more, really.", "author": "Frankie D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-06", "description": "The food is fresh but the service can be unfriendly and indifferent. The Deluxe Bento is good and offers good portions.", "author": "Dean J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "The sushi isn't great but it's trustworthy. I like going here when I want tempura or teriyaki with my rolls.", "author": "m t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-16", "description": "Hands down good spot for lunch.  $7 will get u a bento box lunch which includes salad, miso soup, cali rolls and a choice of meat.  Cant go wrong with that.", "author": "Mimi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-05", "description": "TO BE CLEAR, the restaurant across the street from No-Name (which is fun the first time or two, but the steamy windows and often times warm sushi is off putting) is actually called Warakubune - a \"sushi boat\" type place which is entertaining and fast if you need a quick fix, but if you know what you want it's kind of a waste of time - hard to order from the chefs who are pre-occupied with keeping the boats stocked.\n\nMiyabi - ok, it's not a Tokyo Go-Go, Zushi Puzzle, or Ebisu.  But if you regulary eat sushi, and live in the castro/noe/mission area, this is your place.  Normal rolls are between $3-4, specialty rolls are $7-11, and nigiri is $2.50-5.  Always fresh, good specials board, EXCELLENT service.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-19", "description": "I used to be a regular at this place until yesterday.  The restaurant was at most half full.  My two friends and I wanted to have a few rolls, nothing too heavy, so we ordered 3 rolls, and a couple of drinks.  The waitress came back and told us that we hadn't reached the 6 dollar per person minimum.  While we were annoyed by this we decided to order a seaweed salad to share.  The waitress brought the salad plus edamame and when we informed her we only wanted the seaweed salad she spoke to the manager and then told us that we should leave.  After speaking to the manager his response was \"your generation likes to hold tables\".  Never going back again.", "author": "Gabriel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-09", "description": "The best lunch prices in town for a Japanese combo plate.  The food is always good. They stay open until 3 pm for lunch, which is nice for us that eat late.", "author": "Len M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-20", "description": "I would have given this place 3 to 3.5 stars if it weren't for the service. This place is good but the service is sooooo slow if not non-existent. I've been there twice and really like their rolls, but after being practically ignored when there were only 2 other tables (one of which the guy had to get up just to pick up his food at the sushi bar) I don't think I will be going there again.", "author": "Crystal P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-10", "description": "This place is super cheap for some decent sushi. The staff is nice and atmosphere is very casual. The best part is that they are open late!!! They close at midnight on weekends!", "author": "Lipa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-06", "description": "Tasty sushi rolls but pass on the Nigiri which requires quality cuts of fish.", "author": "Andy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-06", "description": "food here is cheap.  fills my gut just fine at a decent price, but definitely not high quality japanese food, nor can i say its close to authentic.  very americanized, with their various roll concoctions.  while eating, i get the feel that the fish could be colder, not room temp...\n\nthe godzilla roll - unagi and spicy tuna.  great, but very mashy inside, i couldnt tell wats in there if not for the menu...\n\nthe funky dooty roll - asparagus, mango, and spicy tuna.  best bite of the nite, although again, the tuna is kinda off, roomy temp...\n\nmeh.", "author": "Ethan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-30", "description": "I have a love-hate relationship with Miyabi. All the vegetarian sushi is GREAT, however, the miso soup contains fish sauce, and depending on the day/server you will either be clued in on this, or not when asked. Being vegetarian I always ask these questions to protect myself from any accidental meat-ingestion (yes fish is meat, its not a vegetable)\nOn my first visit there I was told there was no fish sauce in it, so a few times I ordered the soup. Another time a waiter told me it did have fish sauce in it (I asked again because it tasted funny) and then another time I asked again and was told it indeed did not have fish sauce...so I ordered it again. how stupid of me! The next time I went and ordered it, they waiter told me it *just had a little* fish sauce in it, and didnt seem to understand that *just a little* is not the same as *none at all*. It seems alot of asian restaurants are like this..they seem to not have an understanding that vegetarian generally means you also dont want to have your food cooked WITH animal products, even if its not an added or large ingredient! Come to think of it, its not just an asian restaurant thing, but thats where Ive had the most problems. Anyways...if youre veggie the rolls are great but stay away from the miso!", "author": "John G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-04", "description": "I would definitely say the food TASTES good... however, I have NEVER before gotten sick from sushi, and I got horrible food poisoning from eating here. I only recommend it to those who love to be ill.", "author": "Brian R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-17", "description": "I'm pretty sure I got food poisoning on my first visit.  I haven't been back since, and I'm too afraid to return.", "author": "Andrea U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-07", "description": "This place is pretty good considering it's price ( not too expensive compare to many ) I like the how the restaurant close at 12AM which allows me to have Japanese food late at night.  Their rolls are exceptionally good and their sashimi. Unfortunately their plate such as the bento box aren't so great. Sometimes it's too dry, no taste, too salty, etc and the good/bad part is that they give you too much. I also notice that their vegetables are fresh (in their rolls)  I hate it when avocado gets too hard, luckily theirs are soft. Hmm what else... I like their customer service, their chef is funny as hell and their staff are friendly.", "author": "Will C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-11", "description": "I've been to this restaurant a view times.  I guess I am a patience person.  This place have a bad service.  The waiter/waitress are slow like a turtle and probably senile too, although they are young, i gues they are just ignorant.  By the way, if you come in afternoon or after 9pm bring a newspaper or magazine, because if you order sushi only it'll take at least 1/2 hour to make 'em.  Some of the sushi are not fresh, spicy tuna rolls ........yuckkss....I almost thought it's nasty tuna rolls.  Anyways, my point it this place was good, but now is very disappointing.", "author": "Albert W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-03", "description": "I've been to Miyabi a few times for both dinner and lunch and have always been satisfied- the prices are reasonable and a place i will return to.  The sushi, sashimi, fancy rolls are fresh and creative. The menu pretty much covers the standard salads, seaweed, apps, edamame, miso soup (i) rice dishes- curry, katsu, pork cutlets, chicken/beef/salmon terriyaki; (ii) the soup-based noodles- udon, ramen and the bento box lunch specials. I was pleased to learn that they do serve more authentic items such as beef tataki and hamachi kama but more exotic soups like dobun mushi or anything other than miso were not available. So in other words- if you're eating sushi you can expect the tuna (chu-toro, oh-toro), salmon, yellow-tail to be good but not phenomenal and perhaps don't be disappointed if you can't order the more exotic items like; sea urchin, fish liver, live scallop, lobster.\nService is great and very polite/ friendly.\nDecor is simple with the obligatory bartop hello-kitty gizmo on display.", "author": "Akash D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-09", "description": "Open late, that is the plus. For the price, you can get much better elsewhere. I was here one late night and was basically rushed out but the turning off of lights and clearing of our table, even though I was still with food midway to my mouth!  Sheesh... they should have just turned us away if they weren't going to be patient with us.", "author": "Amelia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-14", "description": "I really do love this place everything I have had from here has always been really fresh and really tasty I even love the salad dressing they use for the house salad...mmmmm.  I would totally give them five stars but the last time I went there the waitress totally sucked! She acted really weird when I came in with my 2 year old and best friend and took a really time even saying aything to us at all.  When she finally did say something she pointed us to our table all the way in the back and told us to sit there.  After we sat down we waited for about 10 minutes for a menu.....never happened.  I just got up and grabbed us our menus.  She finally came over seeing that we were ready and took our order.  Our food came out in good time but she never gave my friend a spoon for the soup or even brought us napkins or chopsticks I had to steal them from another table. Luckily for us the food was at least delicious.  Im not sure what her problem was but oh well it wont deter me from coming back and enjoying their delicious food again!", "author": "Patricia P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-26", "description": "We waited 45 minutes for our food.  People who came in 40 minutes after us got their food around the same time we did.  LAME.  My miso soup turned cold and so did my heart as I kept looking at the one waitress serving everyone else but us.  She wasn't intentionally ignoring us; it was oblivion, the state of being clueless.  She apologized but I really didn't have anything to say.  I'm giving two stars because I've been here before and have enjoyed their affordable and decent lunch specials.  I like their salmon terriyaki.", "author": "Mijin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-07", "description": "The sushi was good. Not great but good.  But I was stuffed. My friend was stuffed.  We paid less than $40.  We had nigiri and rolls and beer.  That's absolutely awesome. The waitress was also attentive.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-10", "description": "The bf and I happened to be walking by on a Sunday evening and decided to stop in for dinner.  Like most others have said, it's a good place for sushi, but not excellent.  Service was a little weird (the hostess/waitress didn't speak a word, and the waiter left a lot of stuff uncleared on our table) but at least they were fast bringing us our food and the check.  The unakyu and mushroom rolls weren't as tightly wrapped as I'm used to but they packed a lot of fish/veggies into them, and they were only $3.50 each, if I remember correctly.  The bf got the udon and liked it well enough.  Salads were a little watery and they give you the dressing to put on yourself, which would be fine, except it's a little disgusting staring at a huge, unattractive bottle of mayo dressing while you eat.", "author": "Gina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-24", "description": "My friend and I were out  and about strolling through Castro, and we couldn't decide where we wanted to go for dinner. We had tried a couple sushi places in the area, but we were really wanting something new.  We stumbled upon Miyabi and figured we'd give it a try. There wasn't a wait, which can either be a good or a bad thing, for this occasion it was a good thing, a very good thing. First of all, the fish was fresh, the rice  was fresh-as rice should be when one makes sushi yet so many  sushi chefs seem to disagree with me on this. On my first trip I tried the tai, ika and the kappa maki,and  all of my selections were excellent. I also tried a kiwi soju cocktail, I was impressed by this as well. There were actual bits of kiwi right in the cocktail, it was pretty amazing. When the check came I was impressed, yet again. The prices were insanely low, I actually thought it was a mistake. However, I got over it and accepted the low fee. \nI have returned to Miyabi on several occasions and I have yet to be disappointed by the service, the food, the drinks or my tab! Well done Miyabi!", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-07", "description": "just discovered this spot the other night as my friends were grudgingly trying to accept burgers for dinner and the painful realization that our normal sushi spots were all closed. \n\nas we were about to turn in for the burger spot; we realized that we saw the magical words, \"open\" and \"sushi.\" Eureka, they're open and we still have a good amount of time left to chow down (closing was 12am)..\n\norder the amazing unagi... i think that ends this review..  ^_^", "author": "Anita J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-20", "description": "Be prepared to drink loads of water from them cooking with way too much soysauce. e.g. tofu steak.", "author": "Sunny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-06", "description": "consistently good sushi, decent price, convenient location, good service....there is a back room available for larger groups...the reason I only give 3 stars is because there was a miscommunication when I reserved the backroom, and they neglected to tell me that each of my friends had to order at least $20 of food to be seated there.  Other than that, I have had pretty good experiences.", "author": "regina k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-26", "description": "this place is my definate cheap destination to get good quality sushi at awesomely cheap prices. I usually can order about 6 or 7 rolls between 2 people and have saki and miso soup and edamame for under 35 dollars for both people. The staff is super friendly, it's in a really convenient location, they do some pretty fancy rolls like a dragon and catepillar. pretty much this place is the cheapest and easiest to get to sushi in the city IMHO. check it out and make sure to get stuffed for cheap!", "author": "Sean B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-11", "description": "This place has kinda taken a dive in the last few years- it's not as clean or as fresh and I've altogether stopped eating here.  I know that several other Miyabi's have opened up in other parts of the the city recently; perhaps they are just stretched too thin and will eventually rebound.", "author": "saru k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-13", "description": "This is my go to place when I don't to spend a ton of money at Barracuda. My bf and I always order the bento box, sashimi, and a couple different rolls. The food is always good, the people are always nice, and it is always consistent. Just went for lunch the other day and they had some great prices and it was quite nice drinking miso soup while watching the rain come down. Although, the quality of their tuna is questionable every once in a while but besides that very delicious.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-26", "description": "I actually haven't been to Miyabi in years. I went here with a friend last night because it's really close to our gym, and you know working out after work during rush hour at the gym left us starving. So, we quickly made our way to Miyabi before the urge to scarf down cheeseburgers won us over. I had the Chicken teriyaki and sashimi dinner. It was slightly heavy with teriyaki sauce but all of my sashimi (like nine pieces - no kidding) were fresh and decent in size. For $11.99 with soup, salad and tea, I think this is a pretty good deal, and the service was prompt and friendly.", "author": "J F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-12", "description": "This is an ordinary sushi restaurant. Not bad, but not great. My biggest complaint was that there were fish scales in my Hamache nigiri .", "author": "Robert C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-20", "description": "worst service ever. \n\ni understand that at most sushi places the tables are small and the service generally doesn't ooze warmth. but this was a little too much. when we arrived we were literally seated at someone else's table--the waiter physically moved a woman's purse so i could sit down and then slid the table an inch to separate our table from the women already eating. \n\nafter being seated, we sat there for 10 minutes until flagging down a waiter before he rushed away after giving someone else their bill. while my friend was ordering, the waiter abruptly cut him off for a second and walked away and at the end of the meal we again had to flag someone down to get the final bill. \n\nbesides the poor services, the restaurant is quite small. you either have to choose a seat by the door, which is drafty, or the kitchen, which puts you in danger of being hit by a waiter. \n\nthe food is actually pretty good. i really enjoyed my tuna poke--the fish was cut in thick chunks, and was arranged really artistically on a bed of lettuce and was topped with seaweed salad. so props to the sushi chef. also, the happy hour menu from 4:30-6:30 has a nice selection of small sushi rolls that are really cheaply priced. \n\nhowever, the bottom line is--there are about 12 other sushi restaurants in the same area. the food is good, but not enough to make up for everything else. you don't need to eat there, so go somewhere else.", "author": "Mary Beth D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-18", "description": "I order from Miyabi once a week on average.  Chicken teryiaki and of course... a godzilla roll.  Heaping portions and an extremely friendly staff who treat their regulars well, this late night spot gets 5 from me.", "author": "Clay K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-12", "description": "The food is great for the price, there Bento boxes are a nice combo of sushi, teriyaki, and tempura.  The staff is super friendly and very accommodating.  The place is easily accessible from the Church street Muni station.", "author": "Colin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-07", "description": "I've only had takeout for Miyabi. I stick with rolls because I'm a little skeptical about the freshness of their fish for sashimi or nigiri. The prices are reasonable compared to Crazy Sushi, and they're open late. Takeout orders are usually done in 10 minutes and it is in a super convenient place. Probably wouldn't bother with eating in because I live just down the street.", "author": "Lisa P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-04", "description": "The sushi is not outstanding cum in  your pants good, and the service is mixed; good one night, average the next. However there are a few things worth trying. The seafood tempura combo is more than worth the price. Usually when ordering said dish at other places, you get the standard 2 pieces of shrimp, and filler vegetable tempura. Not the case here, you actually get more than just shrimp, you get scallops, and crab tempura, and a mix of vegetables, I think even squid. It is quite filling. If I'm in the mood for sushi I get the dynamite roll, a combo of white tuna, and regular tuna, which I don't think is on the menu but it's up on their specials board. The asparagus and sour mango roll is also good.\nThe sashimi however is not the best I've had, so I probably wouldn't order that again.  Some of their soju cocktails are just okay, I would say go for the plum wine instead.  An added bonus; its one of the few places  serving sushi at 1 in the morning, and you get seated right away. Go here if you're in the neighborhood and it's late, but it's not special enough to make the trek to check it out.", "author": "X marks the spot .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-27", "description": "I love this place. It's reliable and affordable, though not much in the way of atmosphere. I would recommend this spot for weekday dinner and/or lunch. I come for lunch frequently and get 2 rolls and a green salad. Guess what folks? That comes to a grand total of $7! That's right. Now, the rolls I'm talking about are not on the specialty roll menu. These are plain ol' spicy tuna, salmon, avocado...etc. The service is attentive and the green tea is free. Works for me.", "author": "Liz R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-25", "description": "I went to this restaurant with my family on Christmas eve. We were so disappointed in the service. The waitress was rude and the food took very long time, we waited like about 30 Min's and the food didn't even come yet. The restaurant wasn't even busy. it was already 10pm at that time.", "author": "sherry w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-29", "description": "Not super great food, but clean, friendly, and a good value. Perfect for lunch, not so impressive for most anything else.", "author": "Jonny A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "Score!  A local sushi place that's open late!  Great to know if I ever crave some sushi around midnight I have a place to fulfill my cravings.", "author": "Debbie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-06", "description": "Update 1/22/08:\nive been here a few times since, and it was much better. cheap, tasty, nothing spectacularly special but always good. i never got sick again so it was just a one off and probably nothing to do with eating. the water is a little slow but the rest of the service is fine. yes so tasty and i'll probably keep going back.\n\n\nOriginal:\nI went here on a sunday evening for dinner. We were seated right away; there were other people but not full.  I don't like that you have to pick the rolls and sushi all from a little piece of paper. the main rolls and things aren't even on the menu. so there were four of us peering at one slip of paper trying to mark things down. n ended up getting the fishie ones, and j, b and i shared 5 sets of rolls.  we had 2 of the fancy ones, which i think were all $7-9 or so, and 3 of the non fancy ones, which were only $4. so it was very cheap. besides the paper, the other bad thing about this place was that it was very slow. sooo slow. we ordered, and it took i dont even know how long. by then there were only a couple other people. it took FOREVER. then it took another forever after we were done to get our check, we had to ask for it. j and b were almost late for an appt! the sushi itself was pretty good, i liked it. the only thing is, when i got home, i felt pretty ill. feverish or something and i dont know, something disagreed with me, i felt like something had peanut oil or something. but j and b ate the same thing as me and they were fine and they wouldnt be if there had been peanuts theyd be dead. so who knows. i'd probably still go back at least once.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-26", "description": "Yeah, I dunno. They had a couple of good rolls, but the services was less than stellar. Food quality was fine, not anything special, but the experience amounted to a mediocre sushi place that would have been enjoyable if our server hadn't been so over-worked and dismissive. Maybe it was just the busy Saturday night rush.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-11", "description": "Standard sushi fare. Sashimi is the way to go here as their sushi rice tastes like it is old or undercooked.", "author": "matt m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-08", "description": "This is my secondary source for great sushi ( first is chi, take a look at review). The service is pretty terrible, we sat for over 25 minutes to have our order taken, and the resturant was totally empty.. we had to ask for chop sticks, blah blah so they were having a bad day-eh?! As far as selection, not the absolute best, but it got the job done, and I recommend the gyozas for sure!", "author": "Liz C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-09", "description": "Oh man i would drive to San Fran everynight if I could. I tried it for the first time with a friend who raves about it all the time and I am so hooked. I dont think anything you order could be bad but my absolute loved the soft shell crab fried and the UNI is great. All of it was DELICIOSO!!!!!!", "author": "Brenda S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-05", "description": "Why go here when you can go down the block to Warakabune? Ah, because it's open late. It was so-so but I only ordered one or two nigiri and an avocado roll. I think this place is all about \"being seen\" in the window spot.", "author": "Anna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-02", "description": "my boyfriend and i go here all the time for many reasons:\n1. it's open really late\n2. it's pretty cheap\n3. it's yummy \n4. it has consistently good quality\n5. the church roll is amazing\n6. it's walking distance from his place\n7. it's never too busy (i don't think we've ever had to wait)\n8. their salad dressing is soo good\nit's not the best sushi in sf by any means, but for the price, hours, tastiness and consistency, it's one of my faves", "author": "lisa w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-02", "description": "poor miyabi gets a bit of a beating.  I'm not a big fan of their sushi, but the beef udon is the BEST.  Cute little spot in my hood, makes me feel at home walking past it.", "author": "rhiannon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-16", "description": "i've been going to this place for about 12 years  through different owners the food has remained consistently good. i always get the bento box and it's ALOT of food, enough to feed an adult (me) my  4 year old son AND my 5 year old niece. i had the chicken teriyaki, shrimp tempura,salad, miso soup,six piece california roll and a bowl of rice for $7.95. the price in 3 months has gone up ONE DOLLAR  to $8.95 still a bargain. this is a nice  place nothing fancy schmancy but good food to share with some good friends or family", "author": "Jo K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-03", "description": "The Sushi is okay but I like their lunch Bento box, it comes with a miso soup and a salad. Reasonable price!", "author": "Lavinia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-20", "description": "Love it. \nIncredible value. DELICIOUS seaweed salad. Cheap cheap cheap but never disappoints. Smiley staff and fun music.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-11", "description": "Patrons beware, this place doesn't even deserve the one star! I've never written a yelp review before due to indolence, but this place is so terrible that it prompted me to warn others. If you don't mind painful stomachaches and nasty diarrhea for a couple days from food poisoning, then be my guest and try this place. If you are still going to be brave, then bring your Pepto-Bismol. My sister and I both got sick, and it probably was the gyoza or the tofu.  Stay away!", "author": "Tyffani N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-03", "description": "I've had two wonderful experiences here. The first a dine in experience with wonderful service and great special rolls. Last night really sold me on this place tho. I walked in after droppin 30 dollars at Nihon and leaving with an even worse sushi craving than I started with. At Miyabi, we ordered 5 rolls off their basic makimono list and a seaweed salad to go. This came to about $22. We were greated with smiling faces, every employee that walked by had greeted us. They offered us hot tea and edamame while we waited. Sunny had served us with our to go order and was an absolute sweetheart. They even gave us complimentrary miso soup to go! This place is swanky or hip, and you won't chat it up with some cute guy at the bar over a well crafted $15 dollar cocktail. But will always be treated warmly and get that sushi comfort fill that I know I get every now and then. Gotta love the consistency :) Will DEFINITELY be back!", "author": "Brandi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-30", "description": "By far. the BEST Chirashi in San Francisco!  A generous variety of fresh sashimis and other treats makes this a winner!", "author": "Robb S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-12", "description": "I like it here. Good vegetarian selection, good prices. laid back. yeah.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-24", "description": "A friend had a bday party here a couple weeks ago.  The location was chosen for it's affordability.  So, that being said, I think the best thing about it is that the sushi is decent and affordable.  I don't think they have the waitstaff to accommodate big groups, but they also seemed to be aware of this fact because they comp'ed us appetizers and sake.  The food isn't fantastic by any means, but I think it's pretty good.", "author": "Martine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-08", "description": "What a great place for a healthy quick and cheap lunch. If I'm craving japanese and its before 230pm I order the deluxe Bento box and I must say its heavenly. California roll salmon teriyaki rice miso soup 3 pieces of nigiri and tempura all for about 10 bucks. Also the dragan and spider roll are extremely overrated. Staff is friendly and restaurant is very clean.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-17", "description": "I go here at least once a week for lunch and I usually get the Deluxe Bento Box which is a lot of food for the $$. Sushi taste good but its not the best I've had. Their gyoza is the bomb and the miso soup taste great. I really like the variety that they offer on their lunch menu. Service is great  and the wait staff is really nice. Cute and cozy place too and doesn't get too noisy like other places.", "author": "Christian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-19", "description": "I love this place.  Its the only sushi place I know with a fried asparagus&mango roll.  Its got great prices and bottomless green tea and the staff is awesome.", "author": "Ona E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-09", "description": "I love coming to this place!! I don't think its overpriced at all, love coming here and ordering my cali roll, and the service is always good they're really nice!!", "author": "Odracir M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-11", "description": "My dear friends took me to their favorite restaurant one Saturday evening. We were seated and the server took our drink order. What was cool after we received our menus there was sushi order card. On this card you check off the number of rolls you want to order. I'm assuming the card is used to cut down on confusion on what the customer order. We order seven rolls and an appetizer. The chicken yakatori was good, you can't go wrong with that dish, unless it comes out burned. The rolls were excellent. We pretty much ate all the rolls with a few pieces left.  The restaurant decor was really nice, but the bathroom could use some updating. I would definitely go again for more sushi and spend a $90 with no problem.", "author": "Baseemah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-29", "description": "Good sushi. I go here because I can get seated right away no matter the day or time. They like to give you extra goodies, like ice cream at end of meal. Always have funny top 100 music playing but sushi good and fresh and great selection. Plus fun soju drinks.", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-18", "description": "I actually think it has pretty decent sushi and rolls some of the time, then really really delicious fish everytime I go there. I haven't eaten there in ages though and do miss it. The servers are friendly and the chefs always say hi and bye to you! I'm probably biased because I live close by but I used to go to Miyabi all the time and never have eaten anything that tasted bad or unfresh here!", "author": "Gina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-22", "description": "everyone jocks no name, and dont get me wrong no name is cheap as hell and pretty darn good. But miyabi can bring it. Fresh sushi . Very very very nice staff who especially if you are from the neighborhood as I am get to really know you by name and make you feel at home. if you are getting takeout they will sit you down w some tea while you wait. I like what they are pushing", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-12", "description": "Now that I know what goes on in that kitchen I am never eating at a Miyabi restaurant in this city again and I encourage others to do the same! I have a friend who used to work in the kitchen here and told me how they take advantage of their workers. They only pay them $5.50 an hour (way below minimum wage) and don't pay for overtime. The owner also once threatened to call immigration and have a worker deported for complaining about the pay. I bet the reason why this food is so cheap is because they underpay and overwork their staff.", "author": "Pepita T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-14", "description": "I've never heard of Miyabi Japanese Restaurant, but Noname sushi at 253 Church is my single favorite restaurant in the city. You can't beat the ambiance. Do you know how much it would cost to fake the decor in a place like this? Just think of how much the set for Bladerunner must have cost. I swear to god I saw someone walk by the window with a fluorescent light-tube on their umbrella the other day. And stop whining about the quesitonable cleanliness, just eat it man you'll be fine it's not like handling raw fish is rocket science, I'm sure those greasy dudes in the back wash their hands as much as the next guy.  And my favorite thing about my favorite restaurant? We had Rick James as a server once, actual real Rick James, only he was disguised as a Japanese woman.  We saw through it though, DIDN'T WE RICK!", "author": "Geronimo G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-27", "description": "I found this restaurant pretty inexpensive for Japanese food. Quality of food is good as well. Not a fancy atmosphere, maybe you wanna go with friends, not with your dates.  Don't expect for a great service.", "author": "Jelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-11", "description": "As a Fillmore veteran, I consider the Duboce Terrace area an extension of home...and this was one of those spots that I frequented on a regular basis.  Try their Tempura, Spicy Tuna & Philadelphia Rolls...super fresh & deelish.  I wish that I still lived right around the corner...then again, the fact that I don't is probably a GOOD thing...", "author": "Amoura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-08", "description": "The price of sashimi and tempura rolls earned this place one whole extra star.  I'd forgotten where cheap sushi could be had since the no-name place across the street shuttered it's windows and doors post fire.  It was busy last night, I was doing the solo dining thing, my food came all at once - overwhelming, but not unusual for a sushi spot, no?  I got a big ol' Kirin, sashimi deluxe (11 pieces)  and tempura roll. Liked the roll, loved the white tuna, and found the other sashimi to be good.  Not great. Good.  30 bucks.  Not too shabby for a feast.  I'll be back for a sushi craving fix again, it was pretty convenient.", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-02", "description": "The food was good, sashimi tasted quite fresh, I got the deluxe plate and it came with edamame, miso, and a bowl of rice,  four types of fish, and octopus, quite generous for $11. service was great, prompt and polite, I felt the ambiance was a little tacky, more on the fast-food sushi style. I'll eat here again.", "author": "Isaac D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-05", "description": "Good neighborhood sushi joint. Not the higher end dining experience some crave but the type of place to grab some roll on your way home from work. I lived on 15th St. for 10 years before moving away and on a recent visit Miyabi hadn't changed a bit.", "author": "Jim G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-24", "description": "The Church Street roll is damn good. Really really good sushi, aspecially compared to a lot of places. The music is usually like Backstreet Boys and hip hop 90s. Pretty fun.", "author": "Liss C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-09", "description": "I went here about a year ago and it wasn't all that great. I went back yesterday for lunch and I thought it was excellent. Prices were right and the portions were huge. My co-worker got a Bento Box w/ Chicken Teriyaki and Tempura. I got the Godzilla Roll and a side of Tempura. This was an insane amount of food between the 2 of us. The Godzilla Roll was probably the best  \"special\" roll I've ever had. The combination of tastes is just incredible. Tempura was cooked well and was crisp and flaky. The chicken teriyaki was bomb and whatever that salad dressing they have there is also good. Service was okay, but it doesn't take much to make me happy. I might have to go back one more time just to see if this place is consistant. I was super stoned too.", "author": "Call Me Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-16", "description": "Yummy! This is a standard tasty sushi restaurant. Nothing about it really sticks out in my mind, but I definitely enjoyed my meal.\n\nI got the wakame seaweed salad (mmm) and the 49ers roll (California roll on the inside, with salmon and lemon on top). All very tasty, though the 49ers roll doesn't compare to Sushi House's Island roll. I tried my friends' meals too. The tuna sashimi was good, I thought, but my friend wasn't terribly impressed. He said the texture was off, even though the flavor was right. I guess I'm not much of a tuna connoisseur. The other rolls I had were: crazy roll (I got the end piece, not very much fish in it, but good), some sort of spicy tuna spring onion roll (pretty good but I don't really like spicy tuna all that much), whatever the sour plum roll is called (that was an experience!), and some sort of mystery roll that was deep fried and spicy (yum!!). My vegetarian friends got a roll with mango and deep fried asparagus that looked to die for, but I didn't try it, sadly. My boyfriend's beef sukiyaki was quite delicious as well--very flavorful & savory. I loved the rice noodles in the bottom.\n\nService: Only okay. It's a small restaurant and they were nice enough to push a couple of tables together to fit our party of 9--though they seemed a bit annoyed that we didn't just want to sit at 2 tables. The food came within a reasonable amount of time, but they were bad about filling up our water glasses--to the point where we were having to share waters because some people ran out and needed water immediately. When my water first came, it smelled icky, like moldy towels, but when I told the waitress, she was VERY prompt about replacing it, and very sweet and apologetic. So that was nice.\n\nFinal analysis: I'd go back! But I wouldn't necessarily go out of my way to go there. Though I do want to try that mango asparagus roll...\n\nOn a sushi scale of 1-10, I'd say Miyabi gets about a 6.5 or 7.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-17", "description": "good food and service for the price, mediocre ambience.", "author": "Wendelin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-10", "description": "Open late (well, later than the rest of SF), unique & fun rolls, quick seating, cheap saki, friendly staff...love this place. Added an extra star for the random encounters of acquaintences of sorts.", "author": "jen w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-23", "description": "I love Miyabi with all of my heart!  I rarely go more than 2 weeks or so without indulging myself in it.  Every single roll I have ever gotten here has been amazingly amazing (try the Narita roll...or the Oshinko...or Jumping California...or Tobiko...or Inari...all of them, actually) and the service is excellent.  I'm quite the regular so I tend to get a free bowl of edamame or miso.  The Udon is also quite tasty although I like my soup very flavorful and theirs is very tame so I usually have add some spicy ground chili-peppery-stuff.  A+++!", "author": "Suzanne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-22", "description": "Great Sushi  ... but even better simple everyday Meals (to go!).  Pork Cutlet (Tonkatsu) try it with house dressing or the plum sauce.  Chicken or Salmon Teriyaki (grilled), Tempura (battered and fried)  and my Heart-Healthy Favorite Saba Shuyaki (grilled mackerel).  Hey! try it First ... and you'll never go back to Salmon!", "author": "Jerz Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-18", "description": "loooooooooved it.  sushi counter was very clean and elegant, yet comfortable.  booth seats looked really nice as well.\nsushi course was as good as it gets.  all dishes are made with care, and fish were so fresh and right temperature.  truly one of the best in the country, and i'd go there everyday, if i can!", "author": "SANG WON J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-28", "description": "I used to love this place, but there is a reason you can always get a seat here now... Back in the day (dot-com come back!), quality was top-notch here.  At 1am on a Friday night you could get a crispy spider roll fried in clean oil and a spicy tuna hand-roll with a wrapper that snapped in against your teeth, but lately it's been rubbery seaweed wrappers, dry-ish rice and stale fish. Hmmm... the economy is hurting us all.  Proceed with caution.", "author": "E L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-12", "description": "Started off the meal with some miso soup and edamame. This place is so authentic they don't even give you a soup spoon and you drink it straight from the cup. Both were good. Then we had a California roll, a roll with fried salmon, a roll with fried crab, and some roll with unagi in it. All were good except I wasn't crazy about the unagi since it had some sort of BBQ sauce in it. The crab legs were sticking out of one of the pieces, making it difficult for me to eat...even with my hands, because I fail when it comes to chopstick usage. Overall I'd definitely go here again.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-14", "description": "Overall a good average sushi spot.  What makes it stand out for me is the Asparagus and Mango roll.  Gets the extra star to bring it to a four.", "author": "Jayson J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-01", "description": "Miyabi's sushi makes me wanna barf! I've seen better sushi than their's. A friend  recommended it for me and i regret listening to him!", "author": "edwin q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-17", "description": "I like Miyabi.  Prices are extremely reasonable, the waitresses are all super friendly and the sushi is straight forward and usually extremely fresh.", "author": "Erik R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-17", "description": "I would have loved to love Miyabi, but I just cant!  Dinner was really disappointing - their sushi was not fresh and even the ginger seemed old and dried out.  Even worse, our tummies didn't feel so hot afterwards.  I think I'll walk a block down to Warakabune next time.", "author": "Jon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-26", "description": "This is another lunch place during work days. I've taken many people here and they all like it. It's inexpensive as japanese restaurants go, and the food is good. Not spectacular and won't knock your socks off, but will fill you up enough to go back to work. I usually go for the bento box as that's the best deal in the house. I do notice that if you go when they first open at 11:30am, they'll fill your bento box with the previous night's chicken teriyaki. It comes out kinda tough as if it was recooked. So go around 11:50am if you can wait. The sushi is ok as i sometimes go for the tekka maki. So if you're on furlough or your credit card is maxed, then this place is for you as you'll still have a dollar or two left when you leave. Service is better when the newer waitresses are there. the older veterans tend to make you wait for your tea, as if they'll get to you when they feel like it. i wouldn't recommend this place for large groups. Probably good for groups no larger than 4.", "author": "Hagow C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-31", "description": "The restaurant was fairly busy when we ate there, and after our experience, I have no idea why or how.  I ordered a dinner combo - tekka maki with 6 pieces of chef's choice ngiri plus salad and miso soup.  The miso soup was not good.  The salad was even worse.  Wilty, questionable looking lettuce drowned in dressing.  The tekka maki was ok, but the ngiri was definitely not fresh.  The worst were the tamago and ebi ngiri.  The tamago was a dull yellow color and extremely rubbery.  I didn't even know egg could have that texture or (nasty) flavor!  And the shrimp looked like it had been sitting on the counter for several days... and then dropped on the floor.  Blech.  It is a little cheaper than the average sushi joint, but Sushi Delight has actually edible sushi for about the same price (if you can get over the kitschy name).  Miyabi is possibly the worst sushi restaurant I've been to in SF.", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-08", "description": "prices are right and food is pretty good, but the service leaves something to be desired. Most of the time you just get ignored for a LONG time. That's the downfall .", "author": "RED L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-26", "description": "Friendly, efficient service and low prices, especially for Japanese in this area.  But you get what you pay for.  Chicken udon was okay but the quality of the meat was poor.  Cold tofu was the most boring dish I could imagine; zero effort expended on it.  The sushi was okay but avocado was discolored.  I would stick to the deep-fried rolls without any raw fish in them to be safe.  Finally, for some unknown reason they play the absolute worst adult soft rock music on the planet.  If you are dining alone, bring headphones or earplugs!!!", "author": "Geoffrey U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-21", "description": "Affordable and good.  Their bento box combos are a lot of food for your buck!  Shout out to their new location!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "author": "Allison M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-15", "description": "was not impressed with this place at all. i only went here because my friend wanted sushi and we were in the neighbourhood and it was too late to deal with the wait for sushi zone (which is close by to this crappy sushi place). my friend is Japanese and she loves this place! i was pretty surprised she liked this place. the place and the customers were pretty ghetto looking. the service sucked. i ordered a couple of nigiris (maguro and albacore) and they didn't seem all that fresh to me. i won't go back here EVER!!", "author": "James J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-15", "description": "This is a Koerean Japanese sushi restaurant. A lot of spicy sensation to the \"zen-like\" japanese sushi. I love it for the variety of ROLLS.... Good sashime too.", "author": "T L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-15", "description": "you can't go wrong with their delicious, substantial rolls and not only that, they have reasonable prices!!!. dinner and combo plates are pretty decent.", "author": "Nelle A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-23", "description": "mmmmmmmmmmmiyabi.  tasty, fresh, uncomplicated rolls and super nice, if slightly inattentive, service- what more could you ask for at 1130pm?", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-08", "description": "i dont like this place anymore. used to stop here on the way home for some sushi, but i'm finding that the sushi here is not fresh, not great,rolls unimpressive, service is a bit cold for a japanese joint, and not much interesting about this place that makes it stand out amongst many great sushi places in the area.  i looked closely at the nigiri and the fish looked old, thin, and unimpressive. i dont mean to knock on this place, but i dont think i'll stop by anymore. and this review is based on eating there quite a number of times. very so-so.", "author": "Miss Lili F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-21", "description": "first off, i didn't have the sushi so i can't comment on that.\n\ni got the beef udon and it was just not good.  i mean, i eat a lot of udon and not only were the noodles soggy (it was take-out, but i live in the neighborhood - so not enough time for noodles to get soggy), the broth was not good and the beef was old tasting.  and it tasted like major msg or something just not good.\n\ni really wanted to like the place after all the great reviews, but alas, this is not going to be my local udon shop.\n\nextra star for really nice service.  i was served hot tea as i was waiting.  AND! the cups are really nice.  the tea was really hot but the cup was not.  at first i thought it was lukewarm tea, but no, the cup provided really good insulation.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-12", "description": "My favorite sushi place ever. The dressing for the salad is the BEST. I have tried lots of their rolls and havent been disapointed yet!", "author": "Melisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-09", "description": "Great sushi & service + open late. Plus if you leave your wallet\\purse there, you will get it back.", "author": "sizuck m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-02", "description": "This place is great! I've been going here for years and I can't get enough, the prices are crazy low and the food is down right delicious. If you get a chance to go for lunch you can get the lunch bento box for cheap cheap cheap! Totemo Oishii!!!", "author": "Jesse V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-26", "description": "pretty good fish for good prices. the seaweed salad was delicious, and the service was great.", "author": "Julia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-28", "description": "I came here for lunch today. Being lazy, i just ordered the bento box.  The portion is really really big. For 8 bucks, you get 2 pieces of gyoza, some tempura, chicken teriyaky, 6 pieces of california roll and the usual (rice, salad, and miso soup).  The service was great too.  The reason for only 3 stars is that the chicken was pretty dry. I expect something simple like the chicken teriyaki would be better.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-13", "description": "This is my favorite sushi place in the city (and I have tried a lot of them.)  You get great sushi for a mid level price.  Every time we go they bring us something to try on the house and all the sushi we have tried have been excellent.  I cannot speak for other items on the menu since when we go here, we want sushi.", "author": "Jeffery B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-02", "description": "not crowded (at 10 pm) and very relievd that they are opend till 12am! how many good sushi places are open for you when you need them....got the love boat, can't go wrong with that=)", "author": "Janelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-09", "description": "We have become Miyabi regulars for those nights when we need something nearby, fast and tasty. A Vegetable Tempura starter, followed by a selection of rolls including Alaska, Mango Tempura, and Cream Cheese Avocado just hits the spot. It would be nice if the starter was served before the main course, but I'm just happy to get my food fast.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-28", "description": "eh.  The service was ok.  The rolls were pretty good, but nothing great and nothing I haven't seen already.", "author": "blythewood m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-11", "description": "Nothing fancy.  Neighborhood restaurant with consistently good sushi and rolls at reasonable prices.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-25", "description": "this place is on the top of my list for sushi...it may not be the fanciest ,but what it lacks in refinement...it more than makes up for in taste and price...they are open late and that's great for those late sushi attacks... Some of my favorite things are the asparagus and mango roll and salmon teriyaki...also their salad dressing is really good , i cant explain it, and maybe its just me but i have to admit i have stolen a bottle or two for use at home...shhhhh...granted this place doesn't serve the most traditional of Japanese cuisine, they dont charge the prices of those traditional cuisines either... the tempura is light and crispy and they use that butternut squash for one of their vegetables in the tempura, my personal favorite....id say if your looking for great neighborhood place to eat some quality sushi and not break your wallet ...i highly suggest this place.", "author": "ridin' d."}
