{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "This is one of our favorite restaurants in San Francisco. We come here all the time and always try something new on the menu! The menu rotates and it's delicious. They gave a good wine selection too. My fiance spilled and broke a glass of wine all over the table and floor and the staff were so kind and helpful!!", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "This place is so cute! It's a little small, but the vibe is great. They don't have a huge wine selection for being a wine bar, but I did really enjoy the Pinot Bianco I got. I ordered the Spanish octopus gnocchi , and I really enjoyed it! I'm a huge octopus fan right now, so to be fair, I would probably like any dish with octopus. It wasn't rubbery at all and was really tender. The gnocchi was okay. It was a little too soft for my liking, but the dish as a whole was pretty good. The other good thing about here is that they make all of their pastas in-house which is always a plus! We also ordered the panna cotta which I really enjoyed! It was perfectly creamy and delicious. \n\nThe only downside was that the waitress we had wasn't super friendly, but she did give us a lot of menu suggestions!", "author": "Frannie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "YES to the sexy, artsy, wine-centric, music-centric vibe at 20 Spot. The lighting is perfectly low & glowy. The music & wine is always thoughtfully curated. It's my ideal SF date night because it feels lively any night of the week, and casual enough to drop in and grab a seat the bar, lounge area, or communal tables. \n\nFor wine & small bites, it's solid. Mid-range prices. But main courses can be hit or miss. I once had an incredible gnocchi here, and then had a super disappointing $20 octopus \"paella\" (more like fried rice). The avocado toast is pretty unique, with halibut ceviche. \n\nOh, and service -- so so cool and unpretentious. Always on top of it, accommodating, and happy to pour little tastes of wine before deciding. \n\nI've been recommending 20 Spot to all my wine-loving friends looking for a chill, sultry, low-key date night.", "author": "Nique F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "This spot is an absolute gem; artsy yet edgy, romantic yet casual. There's a nice lounge vibe which is perfect to bring a date or just have a girls night out. \n\nMy two girlfriends and I loved all the food we got, but dear baby jesus, can we talk about the crab mac and cheese which is RIDICULOUSLY delicious. It's cheesy, crabby, and carb-y, just everything you want in your mouth. I would come back just for that. We got the kale salad so we would feel less guilty. Highly recommend both.", "author": "Cindy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "It's a cool little joint.  Some groovy art. Hard to spot from the signage. Nice staff.  Went for a glass of wine and enjoyed hanging on the couch and watching the crowd. Would like to go back some day and try the food", "author": "Rich P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "This place is hella small- it is a trendy place but not my first choice. \n\nI want to have convo - i can hear what they say on the other end of the wall - \nLimited menu - and if it's a slow night then this is spot to be otherwise - not my first choice", "author": "Victor D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-16", "description": "Tucked away on a corner of 20th Street in the Mission, 20 Spot is a beer and wine bar with a solid menu of bistro fare that rotates seasonally.\n\nI'm currently catching up on Yelp reviews and I notice that they're currently offering a duck confit entrée which is slightly different from the one I had at this time last year. My version came with bourbon-poached cherries, polenta, and asparagus. It was a decently prepared and presented dish, and it was then quite reasonably priced ($17). It was also a good way to soak up a couple of their wines; here, they've got pretty much all the varietals covered, whether my own favorites like gruner veltliner, riseling, pinot noir, or cabernet franc.\n\nThe vibe is laid-back and casual, as the inside sort of feels like someone's living room, right down to music coming from a record player. Service was merely perfunctory, as it was obviously skewed towards regulars. Overall, a good neighborhood venue to try various wines by the glass and grab some decent food while you're at it.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "20 Spot is more than just a wine bar, it is a pretty legit restaurant. They serve more than just bar/finger food.. although I haven't gotten a chance to try many of the dishes.\n\nThe place is pretty small and cozy, and it has a cool/hip ambiance. The food that I tried here were pretty good and the wine were reasonably priced. \n\nWe had the tuna poke served on top of crispy seaweed, which was pretty tasty. When we were there, they were serving $1.50 oyster, which was a good deal but I'm not sure if it's always $1.50 or just that day. We also had the roasted asparagus; it was served with some creamy sauce and it was seasoned nicely. The cheese plate was pretty good too; it came with 3 different cheeses (one soft and two semi-soft cheeses) and served with perfectly crisp crostini, honey, pickled veggies, candied mixed nuts and some marmalade... not bad for $20 and definitely good for sharing.\n\nI will definitely be back to try other dishes in their menu.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "I came here for the first time last night and really enjoyed the vibe. I've found the wine bars usually excel in either a unique selection of wines OR delicious food, but it's hard to find a place that can master both. I was pleasantly surprised that 20 Spot not only had a great wine selection but also some of the tastiest apps I've had in awhile. Added bonus was the friendly and helpful staff. I'll be back!", "author": "Mia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "Came here on a Friday night with friends for wine & snacks. This is a cute small wine bar and serve  seasonal dishes. They have a decent selection of wine and other alcohol. We got a bottle of Cab and we really liked it. The wine was full body and rich in taste. Recommend for cozy sf late night wine bar!", "author": "Clare L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This place has the most unbelievable avocado toast EVER. It comes with halibut ceviche on top, which is a very novel way to do avocado toast, in my opinion. And the bread part has just the perfect degree of crunch in its toastiness--so delicious. My friend and I were so blown away we asked for a second order. And when we finished that one, we contemplated getting yet another one. Definitely coming back for this fantastic avocado toast! Thank you, 20 Spot!", "author": "Lissette C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "What an incredible find! This hidden gem in the Mission was suggested to me by my niece, and it was a nice surprise. Small space but with an artistic vibe and remnants of its former record store days. Food and wine selection is pretty decent. The bread with radish butter is a real highlight, as was the heirloom tomato salad and roasted cauliflower.", "author": "Suzie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-13", "description": "Very cute, intimate setting and simple menu. We ordered the deviled eggs, avocado toast, octopus paella, and beef tartar. Best item was the avocado toast, it come topped with flavorful, perfectly seasoned halibut. Slightly disappointed in the beef tartar, it was overly spiced with mustard and lacked salt. Other than that, this is a nice place, perfect for dinner for two.", "author": "Angel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Cozy spot with attentive bartenders - came by on a Tuesday night so it was just the right amount of people but could see how it can get packed during busier times. Recommend the Cabernet franc - the crudo was a little too fishy for my taste.", "author": "Joanna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "The bare reflection of the owner, his vibe, his style, his music selection and an exceptionally curated, international wine list.  And for the cozy kitchen in the back, they put out some pretty stellar dishes.   It can get pretty packed, and the energy is always incredible.   Bodhi is a true badass.", "author": "Lance H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "Very attentive bartender. Wine selection is broad. Food selection is slim picking but solid. If you want a hearty meal this may not be the place to go. But the ambiance is great. Never really too crowded or busy for a walk in at the bar on a week day night.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "This is a great little corner spot for wine in the Mission. It's a little loud, but if there are just two of you, still easy to have a conversation.  The wine selection is decent, staff is nice, and the record selection is excellent. They will seat you when you arrive and have several communal tables.\n\nThe banana cream pie was a little underwhelming but the wine was good. It's a great option to grab a drink with a friend.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Small, quaint and relaxing wine bar that a good friend introduced me to.  Great wine selection and friendly service.  The food however really stands out here, and I feel guilty saying that 20 Spot may make one of the best avocado toasts.  Yes it's $16, yes it clearly is the poster child of gentrification gone wrong, but with Halibut ceviche, cilantro, and lemon mixed with the avocado, it makes it worthy of a second order along with a nice bottle of Chardonnay.", "author": "MJ A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-21", "description": "Stopped here on a Saturday night with a friend to grab a drink before dinner at Central Kitchen.\n\nThis rating is only for drinks, service, and ambiance.\n\nI found the wine selection boring.  You're a wine bar....please offer patrons more wine options....*sigh*\n\nService was ok but neither warm nor inviting which is weird since this place is tiny and can easily foster a warmer environment if the staff made an effort.  But I suppose the staff are too cool for school given the hip location.\n\nWould return if friends wanted to meet here but would not choose it myself.", "author": "Lev E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "This place is a great place.  Awesome bartender and great vibe.   The food was really good as well", "author": "Marc L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "20 spot is the perfect name for it, it's a cool little spot tucked away at the quiet corner of 20th and Lexington, right between the busy main drags of Valencia and Mission. \n\nIn what used to be a record store (remember those? sad face), it still keeps that musical charm with some great music bumping over the speakers in this railroad car-sized venue. There are still choice cuts of vinyl in the shelves behind the bar area, which reinforces the mood that you're not in a conventional wine bar or restaurant.\n\nThe menu is all eclectic modern American small plates. We had the deviled eggs (solid), crab toast (very tasty), winter panzanella salad (epic), and the sausage and ricotta flat bread (very tasty).  Not a disappointment in the bunch.\n\nService was prompt and friendly, no complaints.  Definitely will return.", "author": "Saminda W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-10", "description": "I mean, whahtevs. \n\nI'm not into the hipster wine-bar groove, sorry.  My first thought walking in there, \"this place smells like throw-up\".  Seriously.  Some nasty whiffs I got when I stepped in this joint last night.\n\nIt's sort of cool-ish concept done hipster-style.  I felt like they decorated with a bunch of stuff they picked up at garage sales, or free stuff people had given away.  If I'm in the Mission on Lexington with no way to walk anywhere else and I just HAVE to have a freaking glass of wine, I guess I'd come here.  But to me it was like a cross between a dive bar and a wine bar.  They've got a (not-so-loungy) couch area, a bar, a few flimsy communal tables, and here's the rest:\n---\nPROS:\nYes, the wine pours are generous.\nJust enough variety on the wine list.\nBread and butter is good - nothing special, but generous and good.\n----\nCONS\n*To me, the food kinda sucks.  Olives are hard and flavorless.  Cheese plate looks a mess. And one of the cheese they served to me yesterday was rotten.  \n\n*Tables are flimsy and cheap, have no room, and once someone sits next to you, you'll feel claustrophobic.\n\n*Wait staff is a little flippant.\n\n*If you're looking for a nice-ish wine bar, this aint the place.\n\n*And last call for food at 11pm?  GURL BYE!\n-------\nI really wanted to like this place.  And believe me, I always loves mi wine, but if I really wanted to go somewhere cool, I'd pop into ABV instead.", "author": "Angella S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "I can't imagine a place in this city that I would rather spend several hours drinking interesting wine selections with delicious food pairings. Hospitality is second to none, and I would definitely recommend asking your server what they're interested in, or what's fun tonight, or just spilling your guts at them and finding out what wine matches your guts perfectly.\n\nAND THEY PLAY REAL ASS RECORDS. \n\nwhat's not to love?", "author": "Elliot E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-09", "description": "I will start with the fact that I really wanted to like this place! Sadly, I did not. Firstly, the music, which ate up all the air in room, sounded like repetitive nails on a chalkboard. Secondly, the food was nowhere near the caliber of its photos or its sticker price. The octopus dish was saltier than the Mediterranean, the poke was swimming in tomatoes and diced so small I wondered if it was even on the plate, and the squash was so peppery I drank half my bottle of water just to assuage the taste! Don't waste your time or money!\n\nPS- The waitress was kind and attentive, and this is why I am not rating it a one.", "author": "Marisol H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-18", "description": "Caveat: granted, there was no crab pot or hamachi on the menu...clearly crowd faves. Neither was the cauliflower being served last night.\n\nA very fair 2.5 for a dinner that was unmemorable. $83 for 2 people, 2 glasses of white (averaging $13/ glass), and 3 starter/small plates. Portions are quite small. Come with a tiny appetite or else be prepared to drop over $100 for a party of 2 for mediocre vittles.\n\nThe service: meh. Server was not conscientious in checking in with us, save to clear plates and ask whether we wanted to add cheese plate and/or dessert. We didn't find him too concerned. \n\nIn short, deviled eggs. Longed for the flavor to be even deeper, even with the umami- seafood atop. Burrata was the best in flavor of the 3 plates. Like the seasoning on the baby arugula, crostini toasted properly.\n\nLast of all, tartare. Where was the unctuousness, the silky fresh egg and the bright flavor of fresh beef? Didn't agree with the cut of the tartare. It ate not right with the texture in the mouth. Also felt that it needed more flavor,\n\nBoth dining mates decently well-eaten folk. Sadly, we couldn't say we would ever return, save to partake of a glass at the very cool, retro bar. It's the property that seems to make this place, at least for me and my first dining experience here.", "author": "Jana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "Giving my favorite local hangout 5 stars because its all that.\nPlease don't ruin it my mobbing it all at once, it special the way it is.", "author": "Simon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-11", "description": "3 stars, \"A-OK\" as Yelp says.\n\n20 Spot is fairly cozy and cute inside. Location is a bit tucked away, although not rocket science to find. Service was decent - not great, a bit on the slow side, but not terrible. The wine was pretty good, as were the prices.\n\nAll-around, I'd just use the word \"decent,\" which is pretty darn similar to Yelp's \"A-OK.\"\n\nNot a place to run away from, and not a place to run to.", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "Wonderful neighborhood spot with excellent service and really nice wait staff!!", "author": "Frank S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "Really great food and wine. It's very small so get there early if possible because it gets very busy. We were all very happy with the food and wine selection.", "author": "Molly O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "I've been here a couple times. \n\nOn a weekday night, it's fairly quiet here so it's a good spot to catch up with someone / have a drink / date spot. \n\nOn the weekend, it's must busier and might be harder to snag a table; however, it's still not as busy as one would expect \n\n+ nice waiters with good wine recommendations\n+/- cheese plate - standard blue cheese, brie and cheddar variety; none of the cheese stood out\n- doesn't take reservations", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-13", "description": "Very nice ambiance in this cool place.  Very cozy, relaxed, and romantic.  Not the best wine selection or appetizers choice though.", "author": "Thomas P. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "This is a cozy cute restaurant. Not many tables so not sure if it is good for groups. The steak tartare was good and we also enjoyed the wine menu", "author": "Suna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "As promised, came back to actually enjoy a glass of wine. Or in this case, a glass and a half. Love anyplace that let's a customer order in increments.\n\nGenerous pours, that's for sure. And very helpful guys behind the counter who let you taste a bit before deciding on a varietal. \n\nWhen can I come back and pick the record playing???", "author": "Abby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "What a lovely wine bar.  I heart you, 20 spot :)\n\nMy husband and I were so happy to have found this place.  You would think SF being so close to wine country and being a city that loves its wine, that there would be excellent wine bars litered throughout every neighborhood.  While there are definitely certain \"gems,\" unfortunately there are too many \"meh\" spots that leave you disappointed.  Not the case with this neighborhood gem.\n\nI had stumbled upon it and \"book-marked it\" as a \"must-go at some point,\" but just never got around to it.  Until earlier this month, and now it is on the short list of \"where should we go for dinner tonight.\"  Needless to say, I believe we will become regulars at this spot...\n\nFOOD: \n\nOur first time in, we went with another couple.  We had some cheese/charcuterie at our place before stopping in, so we decided just to do a few things to share.  Here's what we tried:\n\nDella Bread Plate (4 stars) - Wasn't expecting much with this; we opted to get it just so we had something to munch on while we waited for our other items to arrive. Well, were we blown away.  The bread was simply delicious.  Fresh, warm, and chewy - came with a variety of breads, and all were delicious.  The butter it came with was yummy as well; loved the addition of sea salt (love me some salted buttah!!).\n\nCoconut Milk Ceviche (5 stars) - This dish was one of my favorites - perhaps THE favorite of the night in my opinion.  The fish was so fresh, and the sauce/ingredients accompany offered so much flavor and the perfect amount of texture.  Yum - definitely recommend this dish.\n\nPotted Rabbit (4.5 stars) - Decadent, flavorful, creamy.  Was actually expecting not to be much of a fan, but I was blown away by this dish and couldn't stop myself for going for seconds.\n\nGrilled Octopus (5 stars) - My husband and I love octopus when it's done correctly - but it's always a gamble, because some places just don't execute it correctly.  This dish was perfectly cooked; crispy at the tips, yet soft throughout (no rubbery, tough texture like you can get when it's over cooked or gooey/flabby texture if under-done).  And the fennel salad and sauces that accompanied the octopus rounded out the entire dish.  One of our favorite dishes of the night - huge hit with all of us.\n\nWINE: \n\nThree of us (including myself) decided to do the wine flight - so glad we did that.  My husband opted to go for the sparkling rose (but was a bit jealous of our wine selections once they came!)  The wines included in the flight were impeccable.  You could tell that whoever selected the wine really know what they're doing.  Later we found out that the owner of 20 spot is actually the owner of Bacchus Wine Bar on Hyde Street in Russian Hill (close to Elephant Sushi): http://www.yelp.com/biz/bacchus-wine-bar-san-francisco.\n\nBacchus was one of our favorite wine bars in Russian Hill, offering a great selection of quality wines.  No surprise that 20 spot offers the same - a wonderful selection of quality wines at reasonable prices.\n\nWe had such a wonderful experience the first time, my husband and I made the decision right then and there that we would be back soon.  Aaaand, less than a week later, we were stopped in again.  This time we chose to sit at the bar, and ended up meeting the owner who was working behind the bar that night.  Such a friendly guy - it was so nice to chat with him.  He was also very generous with the wine, offering generous servings of those we ordered, and offering an \"extra\" pour of another red toward the end of the meal.  As with last time, every wine we tried was amazing.  For the food the second time around, we decided to do the cheese plate for 2, the ceviche, and one other \"main\" item (though it's slipped my mind what we actually ordered!).  All of the food was once again, amazing.  \n\nWe were out of town the last couple of weeks, and while we kept saying \"I can't wait to go back to 20 Spot when we get back!\" :)  We will definitely be in again soon, and I highly recommend stopping in.  Definitely recommend for a quiet/intimate dinner spot, but would also be great for a pre-dinner/post-dinner glass of wine or snack.", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Great spot to hang out with friends. they incorrectly charged my credit card by about a dollar extra, and I wrote a review of it. The manager reached out to me and took the initiative to rectify the charge, so it's only fair if I update my review to reflect their honesty!", "author": "Yoon P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-13", "description": "20 Spot is a wine bar. I have never been to a wine bar. Wine seems to be the thing in San Francisco. \n\n20 Spot was cool and laid back. Unassuming from outside, this is a small wine bar with decent space for a group of friends to enjoy a night out. They have bar seating and a couple smaller tables. All other tables give the feel of community style as they are tightly spaced along the wall. There was still a good amount of privacy, it simply felt more homey than your typical bar setup. \n\nWe had a few glasses of wine and some bread a cheese. The bartender helped us and was friendly. We actually sat on the couches and love seat that were available and used the small coffee table.\n\nI believe the music here was all via records and was \"DJ'd\" by the bartender. Selections were classical greats, some Big Papa made it into them mix, and the volume made it a loud experience. This is just a note, nothing negative. There were some lulls in-between music selections but somehow this worked out. The breaks were never too long and picked up just at the right time.\n\n20 Spot hit the spot and was a surprising first experience at a bar like this. Definitely worth the try if you are a millennial and love wine.", "author": "Rawlins R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "Cute spot in the Mission for a glass of wine or a romantic dinner before going out to the bars down the street.\n\nThe servers/bartenders are friendly and knowledgeable. There's not a good place to sit with a group over drinks, but we took over the couch area by the front of the place and it worked well for our group of four.", "author": "Leana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-23", "description": "cool place super mellow. good service. good wine list. decent prices. mainly small tight table seating. score the couches in the front if you can", "author": "Christine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-08", "description": "With all the 5 star reviews, I really expected better. My two girlfriends and I came here for dinner. Their menu is relatively small and changes daily. Their items are also meant for sharing. We ended up ordering 5 things. \n\nDella fattoria bread plate (2.5/5): 3 chunks of bread, butter, radish, and cucumbers. There was no excitement with this bread plate. ($5)\n\nDevilled eggs (3.5/5): The eggs were simple but tasty. The roe gave them a nice flavor. Was hoping that there would be more than just 4 eggs. Accompanied by mini pickles and cucumbers. ($10)\n\nRainbow carrot salad (4/5): Rainbow carrots roasted and pureed in a salad. It was nice to try carrots that were prepared differently. ($13)\n\nCoconut milk ceviche (3/5): Served in a small bowl with tortilla rounds. Refreshing dish but not too many pieces of fish. ($15) \n\nGrilled octopus (3/5): Grilled octopus with potato and fennel. It was okay. More potato and fennel than octopus. ($18)\n\nOverall, an average meal. None of the items we had stood out. Also, the portions were tiny for sharing. Definitely not worth the price.", "author": "Marti L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "This place is an absolute GEM from the adorable corner space itself to the staff, food, wine and lastly, the music. The vibe feels so great in this place and if you are going on a date, this would be the spot to impress. \nThe wine selection is in its own league and the pizza.... It was honestly the very best pizza my boyfriend and I have had in SF. The dough and ricotta were perfection. The flavor and texture was orgasmic. Taste buds blown away.\nThey make their own ricotta and dough for their pizza AND they also make a garlic radish butter from the garlic they grow in their garden. For me, it is the little things right down to the butter that I love and damn, even 20 Spot's butter is the best I've ever had!", "author": "Erin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "This is a romantic and charming little wine bar with a solid (and reasonably priced) selection of wines. Although we didn't taste any of the food, my friends and I enjoyed splitting a bottle of red late at night while listening to some great tunes. They even print out their playlist on the menu, which was kind of quirky and fun. The decor is very eclectic as well. \n\nOur waitress was sweet but left us alone for the most part, which was fine since we were just drinking and not ordering food. I had a lovely time and would recommend it for a date or small group gathering.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Love the vibe, the food is awesome, the wine selections are ridiculously fabulous, and the people working here are just the coolest.\n\nWe came by last weekend and had the best time.  The restaurant is dim and sort of hipster/romantic, and they (true to their sign outside) play records all night long - the daily menu lists the records they'll be playing, but they also went \"off-book\" while we were there.  The folks working there are super friendly and really knowledgeable - it was fun to talk shop with them about different wineries and varietals.\n\nThe food was really impressive.  Not just for a \"wine bar,\" but in general.  It's pretty much vegetarian, which is cool - my meat-loving boyfriend said he could be a vegetarian if it meant eating like this all the time!  The only non-vegetarian item was the raw oysters - which were great.  Big and briny :)  We also had the clay pot asparagus, cast iron radishes (woah - turned me into a radish-lover!), snap peas, and chocolate avocado pudding.  Everything was awesome.  I could elaborate, but it would probably be too much.  Every flavor was spot on (appropriate given the wine bar name!).\n\nThe wine list was also fantastic.  We had stopped by Lark and Blush in Castro earlier in the night and had been uniformly disappointed - U.S. / California wines were very underrepresented, and the selection of Italian/French wines were pretty pedestrian.  At 20 Spot, they have tons of trailblazing U.S. winemakers on their menu (Donkey & Goat, Broc Cellars, etc) and then they have super unique foreign options, like an amazing Chardonnay/Posip/Pinot Grigio blend from a Croatian winery named Bibich.\n\nI can't wait to return!", "author": "Tay H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-28", "description": "Uncomfortable vibes. \n\nWhat led to uncomfortable vibes? Waitstaff, bartender, bleh wine, ok food for somewhat steep prices. It's a hole in the wall that is not worth recommending. My husband saw an old episode of Check Please that made him curious but I think we're good now.", "author": "Crystal S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-23", "description": "Amazing cozy place,  nice staff, great music, decent prices, but not cheap. Good selections of wine nothing too crazy. Good little bites, would go back sometime!", "author": "Enrique G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "Definitely a fan of 20 Spot! I really like how everything is set up in the restaurant from the interior perspective. It's a dressy/casual spot and a great atmosphere with some intimate lighting. It's a perfect date spot too! Not just the food was great but the servers/hostess too! \n\nI ordered the Syrah blend wine which was great temperature! Two thumbs up for that! I ordered the deviled eggs which had a kick to it! The shaved asparagus and fennel salad was really refreshing and light. I enjoyed the cheese plate as well but I wish they had options of meat plate which they don't offer. Oysters were fresh and delicious!! I would also recommend getting the crab pot as well. I would definitely come back here again!", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-15", "description": "Probably my favorite wine bar in the Mission. The ambiance is dark, with couches and tables, so it can feel more intimate or friendly depending on what you're going for.\n\nI just ordered a single glass of the Trig Point Cabernet Sauvignon which was great. If you like bold reds, this is your wine. I didn't order the food, but it looks yummy.\n\n20 Spot is on the pricier side for wine bars, but worth it to experience the atmosphere, good service, and quality wine.", "author": "Emmy Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "Amaz-a-balls!!!  Here for the first time and love the wine selection, the food (so fresh and tasty), and most importantly the staff are fun, knowledgeable and generous.  \nFabulous music too.", "author": "Sharon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "what to order: octopus gnocchi and pork belly dish\ntip: call ahead to check for the wait, small place with not many tables\n\nWhat a cute little wine restaurant! Perfect for a date or catch-up session. The restaurant is dark and the tables are very close to each other but the decor and feel is very cute and romantic. When my bestfriend and I first got seated, I was hesitant we would be able to have any meaningful conversations because of how close we were to the other tables. However, since everyone is having their own intimate conversations, you don't hear other conversations.\n\nWe ordered the:\nArugula salad- ok, tasty but not super impressive\nPork belly dish- which comes with rice, pickled veggies and some greens, the pork belly is DELICIOUS. like a nice thick flavorful cut of bacon! so good. \nOctopus gnocchi- definitely my favorite! the octopus was so flavorful, slightly chewy but in the best of ways. and the gnocchi! YUM so gooey and delicious. We ate every piece!\n\nA little pricey for my peasant income but I would come back for a special occasion.", "author": "Thuy-Vy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "Had a lovely evening here.  Great atmosphere, good wine selection, yummy bites.  Look forward to coming back to check out the desserts.  My only criticism, the music was a little loud.", "author": "Mark N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "\"CUTE\"\n(4.25 stars)\n\nWines that you cannot pronounce and are not from this country... are usually the best!!!\n\n-FOOD, yummy\n-PRICES, fair\n-SERVICE, good\n-AMBIANCE, \"cute\"\n\nThat's the only way I can really describe this place... \"cute\". I think by the end of my review, you will hate the word \"cute\". It's an every Friday ritual. After a long week I require myself a quality cocktail or a nice glass of wine to welcome the weekend. The place looks like a tiny \"cute\" little house on the sidewide. The ambiance inside is very simple, \"cute\", and clean with very artsy and interesting decor. Bar stools, tables, and couches, great place to sit and relax. However, I may warn you - there is a regular who is really annoying. Talks your brains out and talks to whoever he can grab their attention. JUST IGNORE HIM and you will be fine, he'll get the point.\n\nHEIFER STATS.\n\nDELLA FATTORIA BREAD PLATE ($4) - butter, crunchy veggies, and maldon salt. LOTS OF BREAD, a slab of delicious cheese with maldon salt on top, and salty veggies. This is a great filler when drinking wine. The cheese is SALTY, a thin spread over the bread will go a long way. The raw veggies, I'm not a fan... Raw radish? Your breath will be kickin. \n\nDeviled Eggs ($10) - smoked salmon and trout roe. it was lovely and \"cute\". This was probably one of the best deviled eggs I've had. the whipped yolk was smooth like silk and creamy, the smoked salmon gave it an additional layer of flavor, and the trout roe added the salty factor. It also came with a side of pickled vegetables and cucumber. Not sure that was a great combination with the eggs. And the presentation was beautiful... just not the teal round dinner plate it was served on (i know, i'm so judgemental LOL).\n\nSANGUINETO SANGIOVESE/CANAIOLO MONTEPUCIANO 2011 ($14/glass) - where do i begin?! This WOW'd my face off. It was a very nice smooth red wine. I can go back for several glasses, heck... order a bottle!!!! I will say it is a creeper and it will hit moments after. I AM A FAN.\n\nWill I be back? YUP.\n\nJABA APPROVED. Until the next review...", "author": "Jane A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "20 spot has the good vibes. Super cool vinyl playing in the background. We heard Kendrick Lamar's new album while sipping on some wine and eating the famous carrot box cake. My boyfriend and I were relaxed and after went to Bruno's to go dance. Great area and safe to walk at night. Will return for more wine and laughs.", "author": "Evelyn O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "Wow, pleasantly surprised! We just happened to stumble upon this place. Everything we ordered was delicious. We ordered the cheese plate, octopus gnocchi, Brussels sprouts, and pulled pork sliders. They even threw in comp olives. The restaurant is a quaint, unique, intimate with funky decor and great lighting. All of the staff was super friendly. I recommend it for a date night or a girls night.", "author": "Terese O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "I really enjoyed the atmosphere here. It is a pretty tiny place, but they've made the best possible use of the space to offer as much seating as they can. The concept is great! You get to relax and drink wine. Plus the music was spot on. \n\nI'm not sure if the menu changes at all, but I ordered a red blend wine and the bread with porcini butter. The wine was excellent. And the bread. Wow, the bread had just the right amount of chew. And they offered an assortment of bread too. There were 4 slices on the plate, all very unique. The porcini butter was clearly housemade with a hint of lemon, really delightful and fresh. I would certainly make this my go-to spot if I lived here.", "author": "Mandy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "I had a splendid birthday dinner here w/ the bf. The service was awesome, & the vibe is lively but not too loud, relaxed but still nice (I'd feel comfortable dressing up or down). \n\nDECOR: Well-thought-out classy retro, interspersed w/ random colorful art (Die Antwoord concert posters in the bathroom, geometric brass Africana-looking statue in the hallway). I love the retro & antique mismatched dinner- & silver-ware:\nhttp://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#uPB5I6Z5nlMf6uPcULvHsQ\nhttp://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#EyqZV-lnip2tKgtbUmshzQ\n\nTHE WAIT: My bf called at ~8pm on a Thursday to hold a table. It was waiting for us at 9pm, but there were a few tables open anyway. When we left around 10:45pm, there were plenty of people still eating & at the bar!\n\nSERVICE: Excellent! We were greeted right away, they knew our name on the list, our server came to our table immediately & checked on us regularly. I felt terrible because I tried three different wines before settling on one she'd originally suggested. She was incredibly patient, professional, & nice.\n\nMUST-HAVES: None, unfortunately! Almost everything was well prepared but at the same time could have been greatly improved w/ one small change. That being said, of what we tried, the Burrata, Duck Lasagne, & Panna Cotta were more memorable.\n\nREDS: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#VIGZbXmfftnpwg6HthzlUw\n\nBILL OF FARE: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#Dy47Mh22TXM6Bl04LoK2jg\n* 1/2 dozen beausoleil oysters (shallot mignonette, 20 spot hot. $20) - 4 stars\npic: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#oq_ThUsTHO4bMPqnoJUINw\nhot sauce: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#OQBv9q0k1_wzf9QYVmFPPw\nServed on a wooden board on top of a bed of pebbles! Fresh, tasty, & we totally loved the hot sauce (made in house!).\n\n* Burrata (asparagus, fennel, salsa verde. $14) - 4 stars\npic: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#IABzRzAHrPlXzJs_9DMRZg\none serving: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#Z-Nm81-k47_-2TFfseJCjw\nGreat! The burrata was soft & stretchy, subtly flavored, & the fresh greens & small slices of asparagus were a perfect complement. I wish there was an extra dash of sea salt to add a bit more flavor. We added some hot sauce from the oysters & that was good.\n\n* Devilled eggs (smoked salmon, trout roe, cucumber. $10) - 3 stars\npic: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#LeLtRmZPTqm-8Blp9Zt3-g\nWell made, but not particularly a stand-out. The filling was very soft, & while the roe was a nice touch, it all just got blended in when you took a bite, probably because there was just an overwhelming amount of filling. Less filling & a topping w/ more texture/flavor (i.e. bacon!) would have made this much more interesting.\n\n* Rabbit lasagne (chard, tomato, fromage blanc. $20) - 4 stars\npic: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#lr6r9VcZ2GvBHOzweBwwCg\ncross-section: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#YKqSGQ3tHlpJLglZSYf2VQ\nReally nice, but in retrospect this was pretty pricey for a dish for one. The tomato was zesty & fresh, the cheese balanced it well, & the lasagna sheets soft. It had a bit of a spicy kick. The spinach layer at the bottom was tough compared to the lasagna & harder to cut through when I wanted to get a bite w/ good proportions of everything. I think it would've been better if integrated into a layer of the lasagna.\n\nDESSERT: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#Ir7t_sxwp10CBCKTvHPcSA\n* Buttermilk panna cotta (lemon curd, blueberries. $7) - 4 stars\npic: http://www.yelp.com/biz_photos/20-spot-san-francisco?select=lGbRZvmE6ZCs4pvwDHeTsA#eITDi_h8Es-iJEElsyA3tg\nThis was great, but don't make the mistake of digging only into the top! It's hard to tell, but only the top 1/4 is the lemon curd. My first few bites were purely lemon curd & I was overwhelmed by the sweetness. The panna cotta's (which had perfect soft texture) flavor was more neutral & blended really well w/ the lemon curd. The blueberries weren't ripe enough - they definitely could have been softer & sweeter.\n\nSWEET & FORTIFIED WINE\n* Nieport 10 year Tawny Port ($12) - 3 stars\nOnce again, that grain alcohol fortification - you can definitely taste it, & it doesn't blend well w/ the wine, a lighter port.\n\n* Landgraf Riesling Auslese, 2009 ($10) - 4.5 stars\nCame chilled, lightly sweetened, yet w/ a little bit of a tart fruit flavor. Well balanced, just strong enough, & light. I enjoyed this throughout my meal.\n\nTo try next time: Hamachi, Mussels (smelled great!).", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "4.5 STARS\n\nThe First Date.\n\nMany people have asked me for suggestions on where they should bring a first date. You want to impress the girl (or guy) without looking like Mr. Desperado who hasn't gotten laid in a century by forgoing your rent with foo-foo tasting menus. But, you don't want to be that guy who gives off the cheapass vibe by suggesting to grab a banh mi in the TL and share a pee-stained curb and a 40 with the hobo you're sitting next to. The latter actually happened to me. *Sigh* Damn you, Match.com. \n\nYou want a place in the middle of the cost spectrum and that's intimate yet low-key. A place that you can hold a conversation without feeling like have to shout so nearly deaf, Mrs. Simpson (Saved by the Bell) can hear you. \n\nEqually important is a place with good food and drinks. Nothing quite gets a date going as booze right? Remember to always follow Patti Stanger's rule of a two drink max or you may end up like Mr. NSS and I; we have no recollection of our first date other than the hangover we both had the next day. No bueno. \n\nWalking into 20 Spot, I immediately knew this would be THE perfect first date spot. Formerly a record store, 20 Spot has been transformed to small restaurant and wine bar with a contemporary vintage rock ambiance. There's just four 2-top tables, a communal table, and counter seats so do come early to snag a seat as it's a walk-in restaurant: http://bit.ly/1as0tzQ. You can also chill on one of their leather sofas and they even have a vintage rocking chair. Candles and soothing soul music really set the mood if you know what I mean. *Wink wink*\n\nTheir New American menu is small and changes daily. There's less than 10 items on the menu excluding their cheese offerings and dessert. We sampled about half the menu and I have to say, I was very impressed (there were some slight misses though) because they don't have a real kitchen other than several appliances like an immersion circulator, a toaster oven and an induction burner.\n\nWe started off with the Oysters ($3 each) which are a must order: http://bit.ly/1cYy5tr. They were like taking a bite of the fresh ocean breeze. Next, came the Hamachi ($15) served sashimi style: http://bit.ly/174WKYC. Although fresh, I felt some the combo of the leeks, preserved lemon, grapes, espelette overpowered the delicacy of the fish. But this is coming from someone who likes to eat her nigiri with just a dab of wasabi and soy.  \n\nIf you like smoked salmon, you must order their Deviled Eggs ($10) if it's available on the menu: http://bit.ly/1ioEzSn. It was deliciously creamy with a nice pop of saltiness from the cured salmon and roe. And because it's crab season, we couldn't miss the Spiced Potted Dungeness Crab ($18) served with warm toast points: http://bit.ly/1cYo4MQ. It was chockfull of freshly sweet crab meat with just a hint of creaminess from the crème fraiche and zip from the meyer lemon. \n\nNothing sticks to your ribs like a hunk of braised meat and that's what we thought the Farro & Short Ribs ($18) would be but it was more like a porridge: http://bit.ly/1aVGNHk. It was still delicious especially with the decadent soft boiled egg with an oozing yolk and generous shaving of  pecorino but I wish there was more short ribs. \n\nWe ended dinner with the surprisingly and insanely divine Vanilla Panna Cotta ($7): http://bit.ly/1cYp97u. It was a tad stiff but once it hits your tongue, the silkiness was sublime. I adored all the vanilla bean flavor and soon found myself with an empty  jar. *Sad pouty lip*\n\nIn honor of hump day, I had two glasses of wine which the ladies at 20 Spot recommended; both were great. One offered me a tasting of Spanish wine to go with the faro and short ribs fish which was spectacular. I'm a total wine noob so I won't get into the nitty gritty details other than it gave me a good buzz. Two thumbs up from me. \n\n20 Spot may be in hipsterville but there's not a bit of 'tude here. Service was wonderful. The ladies who waited on us were warm, attentive, and knew their sh*t. If I could take them to every restaurant I eat at, I would.  \n\nAs for parking, if the parking gods aren't kind to you, there's a garage 2 blocks away on 21st and Bartlett. \n\nMr. NSS and I are well past our first date but 20 Spot made me feel like we were on a first date again...minus the WtfHappenedLastNight hangover.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "This is such a cute place for a date. The music was a little loud and the restaurant is a little dark, but both contribute to the classy mood, I suppose. It's a new-ish place. I came here with my friend and we were initially skeptical of the food because it didn't sound all that appetizing. We decided to take a risk and order a few things.\n\nHoly crap. The Deviled Eggs ($10) are to die for. They have trout, roe, and cornichon... words cannot explain how godly these eggs are. Seriously. Hands down my favorite dish of the whole meal. I would go out of my way for these 20 Spot Deviled Eggs anyday. We also ordered the Spanish Octopus ($17) with fingerling potato, castelvetrano olives, and harissa. It was my friend's favorite dish. The quantity of octopus is super generous and the texture is very tender. \n\nBefore I progress further with food, I want to say that the House Wine Flight ($20) was the second best idea next to the deviled eggs. It comes with three different selections, and they matched well with the variety of foods that we ordered. \n\nIn our second round of food, we got the Rainbow Carrots ($13) which was pretty good, and that's coming from a person who does not like carrots. The Lentil Soup ($9) was recommended by our waitress. THAT is the best lentil soup I've ever had. The menu is very counterintuitive because I liked dished that I normally wouldn't order because they did not sound appealing. \n\nAnyways, our meal ended with the must-have Panna Cotta ($8) which was topped with chunks of rhubarb. Light and refreshing. Would recommend. Overall, thank you to our waitress Karina for showing us a fantastic culinary experience! Fantastic recommendations. And remember... get the DEVILED EGGS.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "Great spot. Solid list. Solid food. But my favorite part is its character and you know the place was built with love and not money. Kinda like the old SF spots that would open and the few that remain. Not to let this get into a \"SF is changin\" convo, because that would be unfair to 20 Spot. \n\ndef. check it out. Authentic, high quality, memorable.", "author": "Mohammad G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Love love 20 Spot. It's a very low key mid-century modern space in the mission that's fit for a first date or a 100th. Intimate and dimly lit with vintage vinyl selections by the owner, it makes for great sipping and conversation (and maybe even a little G-rated canoodling). 20 Spot is a don't miss if you live in SF or are visiting and want a glass or 2 of wine in a great space.", "author": "Sandy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "First of all, I completely echo the sentiments of Yelper's reviews:\nPLUS: Cute spot that used to be a record shop\nPLUS: Ridiculously nice servers\nPLUS: Awesome music - so awesome I had to request the name/artist of a song from the server because I couldn't get my Shazam pulled up fast enough\nPLUS: WAY generous pours\nPLUS: Awesome selection of wine\n\nAND NOW the big BUUUUUUUTTTT...\nAfter reading these yelp reviews about pate and pot of crab and oysters (omnomnom salivation) the menu had none of these items!! Heads up...the menu is one of those that is constantly changing. Do not get your hopes up until you see it in person!!\n\nWith that said, we ended up with a light dinner of bread, deviled eggs and an octopus that was off-menu. Everything was of course, delicious, but it just wasn't what we were expecting. BUT (another but!) now that you've read my review you know what to expect and that is not to expect what you expected.\n\nDon't let this last bit deter you from 20 spot - scroll up and review all my previous PLUSES! It really is a great low-key spot to enjoy a Friday night and I am glad we stopped in =) Will be back some more menu surprises!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "Love love love this place!  My wife and I had a date night out and had read so much about 20 Spot that we had to try it out.  We sat at the bar and the server was so attentive and gave us great recommendations.  We had the olive and nuts, deviled eggs, crab pot (soo good), salad and the cheese platter.  The cheese platter was awesome and highly recommended.  Heck, everything we had I would recommend.\n\nI also got the flight of wine and they were very full pours :) \n\nGreat intimate date spot in SF.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "Deviled eggs were good.  A little pricey for being just 2 eggs, but it's SF.\n\nCrispy duck was delicious.  I wish I had ordered this instead of the cod.  My friend cleaned her plate.\n\nCod was flavorless and bland.  It came with quinoa and this salsa verde sauce, which you couldn't taste at all.  I ended up dumping half a bottle of hot sauce.  It was edible, but not something I would have paid $20 for.  I would not buy again. \n\nAtmosphere was cool lounge. Music very loud, so it's difficult to hear if you're sitting at a table across from someone.  \n\nOverall, 4 stars for great customer service and good crispy duck.", "author": "Sasha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "If you are interested in amazing food and wine this is your place. Yes, the wait can be long at times but we'll worth it.", "author": "Millie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "Awesome food! Crudo, buratta, potatoes, etc. all good! The ribs were a miss and hence the 4 star.\n\nIt's new American tapas style, good for a group of friends to try multiple items.\n\nDefinitely try both desserts!", "author": "Raj S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "Such a cute spot tucked away in the Mission! The setting is very posh, perfect for a date or a girls night. I'd also say its reasonably priced for the food, but bottles of wine will start from the $50 price point. I went with a girlfriend and our bill came out to over $60 a person - but what's cheap in SF? \n\nOn the food, everything I tried was very delicious and fresh! I had the deviled eggs, ceviche toast (so lemony!!), octopus (the potatoes had tons of flavor) and the corn and snap pea dishes. I will say I was disappointed that they didn't have the crap pot that is all over its Yelp page, but overall, I was very satisfied and want to come back to try more! Great wait staff too!", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Had a couple of wonderful wines and delicious food. Owner Bodhi Freedom and the rest of his staff was incredibly helpful and hospitable. He picked a Cabernet for me that was to die for. Highly recommend this place. The music really adds to the atmosphere.", "author": "Todd T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "They do everything really great. Literally any food you order will be tasty. Even the bread is well done and a delight.", "author": "Kade S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "One of my favorite places in the Mission for date night or to meet up with friends.  It has the best ambiance - lively but cozy, great decor and they always play awesome music.  The food is delicious and perfect to share.  They focus mostly on European wines which I prefer. You may not like the selection as much if you drink mostly California wines, but the servers are great and I'm sure would help you find something you like.", "author": "Kristina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "I stopped in at 20 spot for a drink with a couple friends. The setup inside is nice and cozy with several different couch areas to sit at. The service left a lot to be desired, but it was overall a great place to have a drink.", "author": "Joelle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "Highly recommend this place! Great wine and food with a very cool vibe and excellent service!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "Excellent food. But feels like the place is confused .. Wine bar or restaurant?\n\nGrab a glass early and sit in the rocking chairs in the front ... Nice!", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "This Mission gem is a wine lover's dream. Great wines, super fun mid century meats modern hip decor and an interesting and well executed food. The menu isn't expansive but everything they do they do well. The ambient e can't be beat. Perfect date spot or chilling with friends.", "author": "Chad R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-07", "description": "Fine for drinks but had a very negative experience for dinner. Our table was given away because of poor staff communication, and our thirty minute wait turned into an hour and thirty minutes. Unfortunately, this isn't the first time it's happened either.\n\nI suggest having a backup if you come here for dinner, or just avoid all together. I'd recommend Dosa for vegetarians, or Hog & Rock for those who aren't. Again, great wine.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "Love, love, love this spot (no pun intended)! \n\nThe staff is so great and makes sure you're always taken care of, even when they're busy (which is most nights). It's also a great place to grab a drink by yourself (as is sometimes necessary). The ambiance allows for a feeling of community and socializing with neighbors and/or the servers. \n\nThe wine selection is always great, they have a good range for all flavor profiles, from lift to fruity to earthy. And the staff will always help you with a great rec if you need one. \n\nThe food is v tasty too. I love the deviled eggs! They used to have a really really great chicken liver mousse with champagne jam, but I think the they took it off. Hope they bring it back (hint! hint!). I've also had their cauliflower soup - so rich and creamy! The menu is seasonal which I appreciate.", "author": "Rita K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-23", "description": "Very nice environment/decor/wine, but bartenders weren't very friendly, had to wave them down to get water or more wine, waited quite a while for the check, and they seemed happier helping everyone else (regulars?). Hope it's friendlier to all next time we try.", "author": "Ms X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Amazing wine- awesome atmosphere. Want to come back for dinner.\n\nMy friend and I had wine- place was packed but we found two seats up front. I can't get over how awesome this place is. Old record store. #cute", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Stop what you're doing and get yourself over to this restaurant right now.  And do it quick because they don't take reservations.  This place is a gem hidden within The Mission.  The food, the staff, the vibe, and the overall experience was a 10/10.  Every dish wash was inventive and delicious.  I cannot recommend this place enough.", "author": "James C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "Really Good.\nThe atmosphere was cool and laid back. It felt more like a wine bar with dim lighting, cool crowd and small but nice set up.\n\nThey have wine and beer and pretty good selections too.\n\nFor food, the portions are tapas style so the good thing is you can order a bit of everything. \nWe started with olives and nuts and the accoutrements that came with it. Delicious. \nThe bread platter was very well received by my husband and friend as well, i am not crazy about bread but i did taste some and it was very, very good. The butter was super fresh too!.\nWe also ordered the burrata and it was very good, soft and creamy. Yummy.\n\nWe also had a special sea bass that they had that night and it was absolutely delicious, not overcooked and i wish i remembered what was the sauce that the seabass was in because it was fantastic. We were very happy with this place that i wish we would have had more time to go back again before we left town.\nGreat addition to the Mission district. Our server was also great.\n\nThe ambiance was and decor was really cool as well. Laid back music and nice , younger crowd.\n\nNice place to have a few drinks in the evening and get a bite.", "author": "Carolina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "So in love with this cozy, welcoming space. We stopped in for a glass of wine & fell in love with the decor and helpful staff.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-13", "description": "Stopped by to grab a drink with my cousin at this new neighborhood depot.\n\nTapas style restaurant with about 10 or so seasonal dishes, wine by the glass/bottle, draft and bottled beer.\n\nDimly lit ambiance, thought I saw a couple of first dates going on.  Relaxed, casual bookstore kind of feel.\n\nHad the: Deviled Eggs and Black Cod.  Black cod was well prepared and super tender.  Deviled eggs were great, but could have used some more paprika.\n\nWill come by again to check out the alcohol selection.", "author": "Alan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "Drink 5 \n I like their selection of wine.\nFood 4\n Olives infused orange was amazing! the best olives I ever had. \nAmbiance 4 bit too dark?\nService 5\nPrice 5", "author": "Tory T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-02", "description": "I have no idea how this spot got the positive reviews. The Food is below average and the service is bad! Seems like they not familiar with the wine selection and they can't provide a descriptions. They didn't suggest any water which is pretty basic thing to do. \nI am definitely not coming back to this place!!!", "author": "Yana A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "Totally fell in love with this little gem!! \n\nFood 5 x \nSelection of wines 5 x \nAtmosphere  5 x \nService 5 x \n\nTry their Spanish octopus and buttermilk panna cotta! Heavenly!", "author": "Nao N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "Cute little wine bar with a somewhat mod/mid century vibe. Came here with some friends on a random weekday night around the time of its opening in fall 2013. \n\nI was one of the first people in the place at around 5:30 pm for dinner service, and I remember seeing a woman at the bar with an empty glass of wine reading a book looking just so comfortable and at home and I thought \"wow this place must be something special.\" Mgmt was very welcoming and friendly and chatted me up before my friends arrived.\n\nPlace would make a good date spot--would def come back again.", "author": "Sam R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Pros:\n - Nice waitress. very helpful.\n - Great music, ambience, and lighting.\n- A bit on the smaller side, but not too packed and we were able to find a place to sit.\n\nCons:\n- Nothing in particular.\n\nOverall:\n- Would definitely go back, especially on a date (e.g. after grabbing dinner in the mission).", "author": "Sid D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-24", "description": "It was ok. I was not impressed by the pricing nor the food/wine. I do like the location and the inside is very cute, but overall, I would not recommend this place to a friend nor would I go again myself. It's just overhyped (am I old?)\n\nI ordered the potato soup and it was very good but not filling. My friends and I went to grab tacos afterwards (and it wasn't a cheap dinner) because the food didn't fill any of us up.", "author": "Carina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "It's all around a great spot for wine, bites and a great night! It's unpretentious especially with Bodi at the helm.  Pear salad with peanut sauce and blue cheese...wow!", "author": "Stacy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "Funky name and great new gem.\n\nI secretly loves restaurant that doesn't take reservation, sometimes you just wanted to make last min plans and drop into a delicious local spot.\n\nStopping by before 6 was a great decision, we got seated promptly at the sofa area, and we got a mix of few things, a bit of Asian fusion. \n\nThe fresh Hamachi was really good, and so as the grill octopus. \n\nThey have about 6 beer on top, but also about 6 wine plus on tap, they also have flight of the day, we tried some pinot, pretty good.\n\nOverall is a layback spot, and service is overall good, staffs got pretty busy at some point, but they make sure you know they got ya.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Really fun atmosphere for girls' night! We enjoyed a flight of wine and appetizer on our way to dinner. Will definitely make plans to eat here next time!", "author": "Paula W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-24", "description": "Ok the records sign out front was the best part.  Unfriendly inattentive service, mediocre wine and cheesy music. I love a record player as much as the next person but it only works if you're playing good shit.", "author": "Christen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "Casual and elegant neighborhood place. I arrived early and the staff was welcoming, with no pressure to order before my friend arrived. The bread and cheese plate and the cheese options were well curated (4 distinct cheeses are available, from regional cheese makers). The octopus was excellent - warm and flavorful, not overcooked or rubbery. The wine list was not long but has a good range as well - local, German, Greek, French, Italian. Seating options include a couple of lounge-like tables with sofas, as well as a bar area and more traditional tables and chairs. Staff are friendly and knowledgeable, able to guide my friend to a wine she liked based on her preferences. They were also happy to chat with two well-behaved and curious young children (approx. 6 and 8) while their parents ate dinner.    \n\nI look forward to returning and trying more from the menu.", "author": "A N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "Great ambiance and wine selection. Pretty small and intimate space. Came here with a large party and there were not many tables besides us. Menu is good but not extensive. Really good cheese plates (fruit, nuts, vegetables), mussels, deviled eggs, bread and butter. Don't go if you are really hungry- more of a nibbling place. \n\nService was perfect! Very accommodating to a large group.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "The food and service were great. Even on a Tuesday night, this place was very crowded, but we were able to get a spot at the bar for dinner after waiting for just a few minutes. The deviled eggs, the caprese salad, and the spanish octopus were all excellent. The wine was great. The service was impeccable. It is not cheap, but prices seem appropriate for the level of quality and the swanky atmosphere. Highly recommended!", "author": "Toby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "Not sure if it's always this hot here, but it was about 75 degrees inside last Thursday night. Our entire party was sweating and gulping down carafes of complimentary water.\n\n\nAside from the sauna-like temperatures, the interior is very cute and cozy. The dim, candlelit room creates a feel of intimacy and anonymity all at once. \n\nFriendly service. Expect to pay. The most affordable glass of wine starts at 12$. But hey, there's always beer.\n\n-1 for the heat\n-1 for being too expensive for a poor student to attend on the regular\n+1 for having lots of seating when we arrived (granted it wasnt the wknd)\n+1 for interior design\n+1 nice service", "author": "Nina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Cozy wine bar, relaxed & great selection. Haven't tried the cheese plate yet but that's next!", "author": "KS K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "Great little place for wine bar without too many craziness. A good addition to the Mission for a laid-back place to hang. The riesling was the best of the white wine by the glass (Eva Fricke Riesling, Trocken, Rheingau, 2012). I also liked the Burgundy Red (Berthoux  Pinot Noir, Givry 1er cru, Burgundy, 2011)\n\nFor food, I liked the spiced potted dungeness crab with crème fraiche, toast, meyer lemon. Chunky fresh crab with not-too-heavy creme fraiche, making it the perfect spread for the toast. I like sitting at the bar the best. The seats in the front are a bit isolated and lacks energy in the air.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Love this place! Really knowledgable staff, always interesting tasty wines and generous pours. The food is pretty good, I like the cheese plate and whatever vegetable they have. It's a bit small so not good for large groups but good for a date night.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-05", "description": "GREAT date spot.\n\nFinally, a destination in The Mission worth it's weight in wine. Leave it up to proprietor-bottle jockey Bodhi Freedom (who also owns the ten seat hideaway Bacchus on Russian Hill) to suggest an outstanding wine you've probably never heard of with an equally tasty nosh from their creative menu.\n\nIt's easy to strike up a chat with the random cool customer, surrounded by a distinctly stylish retro couture in a part of town-that really needed it.", "author": "A N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Went here with a friend and got a couple of glasses of red wine, the halibut ceviche and the burratta. Would highly reccomend all the dishes I tried. I wouldnt come here if you are starving though!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "Rock on.\n\nFormerly a record store: http://www.grubstreet.com/2013/03/20-spot-20th-street-mission-menu-opening.html\n\nNow spinning old LPs and some of the Mission's finest small plates.\n\nThere is a first time for everything and tonight it was oysters. Needed instructions a non-judgemental eye. Basically needed the person with me. \n\nTopped with bits of apple and a taste that was surprisingly appealing by the time we finished our dozen all that was needed was one more.\n\nMiscommunication with our server meant deviled eggs instead of the bread plate. Fortunately these roe topped wonders were a delicious surprise.\n\nBread was not lacking as plenty was served with the chicken liver mousse (rich and very good) and crab pot (so much butter it unfortunately overshadowed the crab).\n\nHighlight might have been the tuna accented with some sort of seed or grain. Can't remember the last time raw fish tasted so good.\n\nWine is a specialty just like their impeccable 60s, 70s and 80s soundtrack. My dining companion's opinion mattered more than mine. She enjoyed her glass of Carignan.\n\nSpace is small and intimate but relaxed which is perfect for first dates, hundredth dates or is this a date. No wait for a table at 8:30 on Saturday which was a nice surprise.\n\nRoughly $60/person which felt reasonable and very much worthwhile. Only thing holding back a fifth star was the service.\n\nTable next to us was more engaging than our server, aforementioned order snafu and the long wait for our bill left us with no time for dessert. Never like missing dessert.\n\nBut 20 still gets a strong four. Expect them to rock on for a long time to come.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "I love the intimate vibe of this place.  Located on a corner- you would miss it if you didn't know it was there.  Disguised as an old record store, 20 Spot is a dim lit wine bar with mis matched furniture- making it super homey and comfortable.  Great wine list, cool crowd, tasty bites.  A must try if you haven't been there.", "author": "Melissa P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-07", "description": "I don't like to leave bad reviews but this place was awful!  We got one drink at the bar and then the bartenders ignored us for the rest of the time we were there...we sat there with empty glasses for like 45 minutes until we decided leave. And the funniest part of the entire experience was that while we were sitting there (at a very small bar with empty glasses) the 3 bartenders were pouring each other wine and drinking!  Anyway, I won't be going back...it was just poor bar service on a very slow night.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "Only reason it wasn't love at first sight is because we walked right past 20 Spot....backtracked a few paces and realized we'd arrived. It really is an unassuming place, so keep your eyes peeled!\n\nLovely little wine bar - it's a tiny shoebox type space, but boasts a beautiful bar area and a handful of two tops lining the wall. Dim lights, awesome 90s classic rock music, and a solid wine and snack list, what is not to love? There was a fabulous duo of ladies working the bar area - friendly, attentive, and clearly knew their way with wine. \n\nWas a perfect spot for a V Day night cap!", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "My roommates & I came here for a few Monday Fundays, and we were hooked!  The bartenders, servers, & owner are knowledgable and friendly.  The food is amazing and the service is top notch.  The wine list has never disappointed me either. \n\nI'm hesitant to write a raving review because I selfishly want this place to be a hidden gem, but I think the word has gotten out.  \n\nThis is definitely my neighborhood go-to spot.  Love that it's intimate, stylishly casual, and laid back.  I will keep coming back!", "author": "Aya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Great spot in the mission to get a glass of wine and listen to good music! Perfect for intimate conversations. The staff is prompt but don't bother you too much! Highly tecommend!", "author": "Alex D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "I really love the atmosphere, warm and cozy. Came to grab drinks before dinner. Had some wine and snacks. The olives so good, it's unusual to be surprised about magnificent olives.  Also had the deviled eggs which were tasty as well. The staff was really friendly.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "The vibes of a laid back coffee shop, universally liked music from a record player, and the menu of a wine bar. I'm in.\n\nGreat place to hang out with a few friends and enjoy some drinks and conversation. Maybe it's the music, maybe it's the physical appearance, but there's something jazzy and relaxing about this place that I really enjoy. I get a lot of the benefits of those speakeasy (cozy, feeling like you're going back in time) type bars without the pretension. Also, the couch is comfortable - if you can snatch it you'll sink right in and never want to leave. \n\nThe flight is a really good deal, by the way! Super generous pours, although it would be nice to get some choice in what wines you got. \n\nGreat service.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "10 Reasons why 20 spot is the perfect place to spend your evening:\n\n1) It's located just off of Valencia St. so as to be in the Mission, without being in the thick of things or overly crowded.\n2) It's also not too far for you to feel uncomfortable walking. The Mission can feel that way, at times.\n3) Great wine selection: my personal favorite is the teutonic from Santa Barbara. The perfect summer drink. Once in a while, they let you taste before settling, but you need not worry if they don't. Every bottle selected for the menu is wonderful. \n4) Pours are generous. If you've been served the bottom of the bottle, they're sure to give a little more.\n5) Wait staff is attentive and charming.\n6) Food is delicious--from the bread plate to the deviled eggs. Please don't come here expecting to get a full dinner experience--this is definitely a wine bar, and the food selections are small portions. (Amazingly delicious small portions.)\n7) The atmosphere is smart and intimate. This is the biggest selling point, for me. I find myself spending an entire evening here, rather than what I'd planned to only be the beginning of my night.\n8) They play their music from a record player. It's a mix of classic rock and indie hits. Off the top of my head, I remember hearing The Cure and The Black Keys in the same night. It's at just the perfect volume to facilitate conversation.\n9) Variety of seating: you can pick a table, a seat by the bar, or even one of two corner sofas. All cozy. \n10) One of the bartenders has begun to remember me. Becoming a regular is the ultimate perk.\n\nI'm away from San Francisco, at the moment, and I can't help but miss this place terribly. I daydream about the riesling, lightly toasted whole grain bread, and orange infused olives. I think I have a problem.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-11", "description": "Service was great. \n\nAmbiance was definitely romantic. \n\nWe ordered a bottle of wine, three (smallish) plates 1. Oysters 2. Shrimp Cups 3. Some sort of salad and had the choco pudding for dessert (which was the highlight of the meal) ..........and ended up paying 120$+ dollars!\n\nToo pricey for me, which is why 20 spot gets only 3 stars.", "author": "Geralyn Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "20 Spot is a cozy little wine bar perfect for a date or a small group of friends.  A little get together over some wine and small bites after a long day of work is always a nice touch before bed.\n\nFirst time I was here with some friends, and we all fell in love with this cozy place.  We ordered everything on their menu except the salad which they just threw in there for us since that was the only thing missing from the menu on our order.  A couple bottles of wine later, some laughter, and another round of bites we vowed to be back.  That we did.\n\nTheir menu changes quite frequently depending on what they can get their hands on.  There are a couple of things on the menu that were always available every time we've been there.  The oysters are always fresh and a great start to the night with a bottle of champagne or sweet riesling.\n\nI'm a sucker for deviled eggs especially when the flavors and combination of ingredients are endless.  The little kid in me awakens every time I see a different devil to try.  Over here, they make theirs with smoked salmon, trout roe, and cucumber.  Little bites like these always tend to make the bottles go faster as the girls gossip and laugh.  \n\nMussels are steamed with tarragon butter and leeks.  First things first here.  Dip the bread into that tasty butter and indulge in its aroma as your palate salivates for more.  Then reach in for that fresh juicy mussel!  Hate it when a restaurant either overcooks the mussels or serve mussels with a smell.  That won't be happening here.\n\nIt's too bad they don't always have meats on their menu.  When we did get the chance, we were able to have a beautifully braised lamb shank.  Meat falling off the bones with flavors deeply infused.  It melted in our mouths.  Amazing.\n\nI don't want to put up false 411 so someone please let me know if my hunch is correct.  I think they may have changed their chef.  The most recent time I was there, the food seemed a little off or different as a whole.  Not sure.  I hope they didn't change their chef because that would be a sad reason for me not to spend more time at this little gem in the city.\n\nService however can use just a little bit of charm.  The owners, a brother and sister maybe in their 40's, are such kind and friendly people!  Such warm hospitality from them all the time, but their servers don't seem to have that same energy totally misrepresenting the owners' love for their bar.  I've had 4 different servers here, and I always seem to feel rushed or on the other end of their mild irritations... for what I don't know.  What I hear from friends and from other reviews, it seems like others are experiencing the same thing.  It's not too bad but it sure needs a little help.\n\nI agree with some other yelpers about the menu being on the pricey side.  It's not expensive but a bit up there for what they serve.  Not too bad if everyone in your group is splitting the tab.  If you don't mind spending a little more this place is a really great place to wind down.  I'd still come back for the most part unless someone can confirm for me that they changed their chef.  Quality of their dishes aren't spectacular the way I remember the very last time I went.\n\n3.5 stars based on my last visit but overall because of the owners and the handful of times I've been there I have to round up to 4 stars for the fond memories.", "author": "Colin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-26", "description": "Dropped in on a Monday night to get a little wine and a light nosh at an affordable price. Turns out Monday was $20 off a bottle of wine, so we got a nice French red, a cheese plate, olives, and caviar for about 60 bucks. Bravo. \n\nThe place is small with a neighborhood-y feel. Lots of mid-century furniture. Attentive service. Will definitely be back.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "Stopped by for some wine to kill time while waiting for a table elsewhere. Warm, cozy atmosphere. It's definitely quiet enough to have a proper conversation with someone. Bartender was very sweet and helped us choose our wine!", "author": "Haru M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "If you want a laid-back yet sleek experience in the world of wine 20 spot is the place to go. They have an extensive selection of by the glass wines and I have yet to come across a dud, after a dozen visits. I have a lot of respect for well-curated wine lists and 20 spot really nails it on this criteria alone. The service is professional and attentive and they give great recommendations and feature interesting flights of wines on a rotating basis. \n\nI haven't tried the food yet but it looks delicious! \n\nA great spot for a date, catching up with friends, or for a an after dinner drink when you don't quite wan the night to end yet. \n\nCheck it out!", "author": "Reilly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Was here 7-2-16, what a lovely place to be at.  Small restaurant but very crowded.  My husband and I enjoyed it very much.  Waitress seemed a little impatient with us, but we will still return again some day.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "20 Spot is a cute little wine bar, but with a very limited menu of food that changes.  We tried the green toast (which has toast, cheese, strawberries, and mustard greens), cauliflower, and oysters.  The cauliflower and oysters were pretty good, as was the wine.  The green toast was okay, but I would've preferred something else if there'd been anything on the menu that sounded better (nothing on the menu sounded that great the night we went).  The place also had a weird scent that smelled a little like vomit.  I think it might've been caused by the cauliflower dish they offered that night (I noticed that a number of tables ordered it), but I'm not 100% sure.", "author": "Cici A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "Too bad this spot is discovered and now popular. It was a lovely little secret for a while ;) I love the wine menu and the simple, casual atmosphere.  Food is pretty good too. One of my favorite local wine bars in the mission that is still fairly unpretentious.", "author": "Hema P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-07", "description": "So I really wanted to like this place, however, I don't think I'll be back. The bread was good, but not amazing. The hamachi was good, but it vanished from our table (i'll get to that shortly). The wines were tasty, but pricey comparatively. \n\nOutside of the actual food and beverage, the place is cute and trendy. It was however, the service that killed it for me. It started out fine, if not a bit rushed...no, I do not know which wine I want as you put the wine list on the table....Our night progressed, and each time we were not even halfway through a glass, we were asked to order another. On our third glass, our waitress tried to take the hamachi away, saying it had been sitting out too long...ummm, really? This is a wine bar, somewhere people come to chat, nibble and drink. There was no line, thus, no reason to rush us. We spent over $150, so, again, no reason to push us out.\n\nI will not be back, there are far too many places in SF to enjoy", "author": "Bianca L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "Excellent spot for a date or din with a few friends. Lounge-y feel, dim lighting, and records all work well. The food is excellent and the menu changes constantly, but right now, the potted crab (called a crab pot by one reviewer, which I kinda think is a better name) was divine and made me miss maryland blue crab. Oysters were tasty and the apple mignionette was really creative and quite tasty. Makes sense tho.\n\nThe poke and endive salad were both nicely done. We were a bit shocked to be so full after 4 small plates, but they got the job done.\n\nMy date chose the sparkling rose and that too was delish. \n\nThey're doing good work over there and we'll be back.", "author": "Rob G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "Dropped by here after a disappointing meal elsewhere. Snagged a spot by the door for the desserts. Cool vibe, nice people and absolutely amazing desserts. Will come back and try the meal next time.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "Wonderful vibe here with delicious wines to choose from. It feels like a small spot that belongs in the Village in New York City. I huddled with friends at the bar for about 2 hours, nursing our wines because they were so good, and yet our tolerance was not equally there. Nice waitstaff as well, very courteous. Looking forward to returning for a meal as everything coming out of the kitchen looked delicious.", "author": "Erin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "Felt like a friend's festive and stylish house party. The service was attentive and warm without being overly pushy, and the food divine. You can't go wrong with the short ribs nor the burrata. And be sure to ask for their wine pairing suggestion -- a great way to learn and enjoy. We're eager to come back and can't wait to become regulars!!", "author": "Crystal K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-18", "description": "A wonderful little spot to share food, wine and stories with friends.\n\nThe staff are attentive and friendly.\n\nFun fact for all your cinephiles:\n\nWoody Allen's Blue Jasmine filmed upstairs.", "author": "Colleen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-03", "description": "Stopped in for a drink before dinner and found a winner!\n\nThis well appointed corner wine bar had tasty snacks. The owner is very welcoming and we felt like regulars despite being tourists. \n\nDon't miss this gem.", "author": "Frankie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-20", "description": "I can't say enough good things about this place. Small and unassuming, if you didn't know better you'd think this was a simple wine bar. \n\nAu contraire! \n\n The moment I walked in I was greeted warmly and seated at the bar to begin my culinary journey. The bartender was exceptionally knowledgable about the wine list and willing to help me choose the perfect wine. \nI started with the hamachi and cucumber plate. Excellent and well prepared! It danced on the palate and was a very refreshing start to the meal. Next up was the Burrata and red beet salad. The frisée was fresh and edible, paired with a huge slice of burrata and garnished with delicious beets made it perfection. The dressing was minimal, which was important because the dish did not need to be overpowered. I finished with the potato and leek soup; I could have licked the bowl! \n Each dish was paired with a perfect wine that was all at the suggestion of one of the owners of this fine establishment. \n Amazing space, delicious food and exciting conversation all made this a special night. \n\nDon't miss out!", "author": "Eden F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Happy hour at 20 Spot is charming, to say the least.  A delightful little place in the Mission that serves pretty outstanding and shareable items for a large group too!  Sitting just off Valencia, it's pretty easy to miss this little gem - I almost walked right by it thinking it was a furniture store! In any case, there were about 10 of us that showed up to 20 Spot in need of some Friday food and libations and we certainly got it.  Despite trying to say no, I caved and ate a significant portion of the Della Fattoria bread plate by myself.  Three different types of bread showed up, and when slathered with some maldon salt butter, this was hard to say no to.  Other items that showed up on the table were the olives & nuts, deviled eggs, and some grilled octopus. I couldn't stay for very long, but this would be a wonderful place to have a quiet/intimate happy hour with some close friends over some delicious looking wines and bubbly.  Definitely a gem in the Mission worth going back to!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "My boyfriend and I stopped in here on Thursday for a glass of wine before dinner. Love the cozy and welcoming ambiance! The bar manager/owner Brody? was super friendly in helping us find a wine we liked and turning us on to the vinyl they were playing. As we were leaving, it was pouring rain and hail. Brody? gave us an umbrella from the back to get to dinner. Thank you for your fenerosity! We're definitely excited to come back for more!", "author": "Payton F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-03", "description": "This is a great spot for a glass of wine!  We stopped by around 9:30pm on a Saturday night, were greeted by a warm, inviting atmosphere that was not too crowded.  The bartender was awesome, and let us taste a few different wines before we made our selections.  Our wines were great, and we loved the record collection and music.  We'll be back!", "author": "Barnali D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-23", "description": "Trendy but warm setting, not a huge wine selection, food decent but small / sharing portions only. Likely a better place on a week night", "author": "G T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "This place is THE BEST.  Please order the Rose and the cheese platter and enjoy some incredible tunes on vinyl.  The hosts were incredibly kind and generous for a group of new mamas who were out letting their hair down.  Thank you Bodhi and the rest of the ownership for making our night!", "author": "A S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-25", "description": "This place is a leader in wine selection in San Francisco based on variety, quality and value.  The wine selection is paired so well, all you have to do is ask.  The staff is friendly and attentive.\n\nI have been coming here with my boyfriend who  is a huge foodie and he only takes me to the best places.\n\nWe usually sit at the bar where we receive exceptional service by one of the owners Bodhi.  This place gets soooo... busy that we understand when he has to step away to help other guests. \n\nTheir chef is Amazing!!! His style of cooking has gotten better since the last time we ate here.  The potatoes with cheese are by far my favorite and I get goosebumps just thinking about them! I also love their fresh salads and fresh cheeses. My boyfriend loves their fresh seafood.\n\nHere are some facts you must know if you are planning to visit...\n\n-they make their own butter\n-they go out and buy fresh organic local produce every day\n-the chef is so talented for having such a small, limited kitchen to work in\n-the decor is so cool and I like that they kept the \"records\" sign outside\n-beer selection is good too!!!\n\nIf you're looking for a non-pretentious place that has a spectacular wine and beer selection, paired with amazing food, you have to visit 20 Spot - you will not be disappointed.", "author": "Gabriela Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "Great ambience and food. Had the halibut which was fabulous although it was a tiny dish. The couch is the best spot.", "author": "Eindra K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "I am glad that I checked this place out. My Chef suggest I should go. The place is a cute/romantic place. Great wine list and they play cool music. The staff is lovely and the food was on point! Will for sure go back.", "author": "Der Maibaum L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "My new go-to wine bar in the mission.  Excellent wine menu and beer selection.  \n\nLove the ambiance and cute, cozy spot for a date or catch up with friends.  \n\nI'm a fan!", "author": "Jackie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-01", "description": "The good: lively place young crowd. Excellent mushrooms and mussels. Good wine and beer selection\n\nThe bad: small portions. Little for vegetarians. Super loud. Old folks look elsewhere.", "author": "Paul D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "I had a great night at 20 spot. It's not cheap but I thought the food was excellent and the service was better. The atmosphere is intimate but upbeat.\n\nThe staff were super friendly and knowlegeable and let us try all the wines we got before we actually ordered it. They ran out of the desert we wanted, and gave us a desert wine for free and after I paid, I got an espresso and they did not charge me. \n\nI'll definitely be coming back again.", "author": "Aadil M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-29", "description": "We went the other night and had a pathetic time. Its sorta a scam. We were deep in the mission with low ceilings, no air circulation, and a view of the brightly lit bathroom area...\nThe service is very casual, taco shop casual, and although there is some creative food stuff going on, the prices for wines by the glass is more Fillmore Street than the mission. I was reminded of central kitchen but then that place spent a mint on their kitchen and is a BEAUTIFUL space. When the bill came, all four of us we shocked, disappointed and sorta pissed.", "author": "Kate S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "Cute place, food menu isn't that extensive but a few appetizers and wine and you're set! It's a great, cozy hangout spot-comfy lounge chairs and a bar. I stopped here with my boyfriend randomly for some oysters and wine and they were delicious and the service was great!", "author": "Marina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-11", "description": "Great selection of beer and wine. Small dishes to share with friends that taste fresh. Noise inside and crowed", "author": "Denise S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "This place is small and lacks the hype of some others, but it's fantastic.  Had the privilege of eating here right at opening time, and therefore got personal service from the owner who described to me how he bought the space and completely renovated it (decor is awesome).  He recommended some dishes all of which were incredible.  I also had to eat quickly given a flight I had to make, and they got me in and out of there in time.  Overall excellent experience and looking forward to go back.  Far superior to my meal at the much more hyped restaurant \"the house\" a couple weeks later.", "author": "Marc P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "First time stumbled upon this place last weekend and absolutely love it. The owner himself was incredibly nice and the service was great. Thinking we were just walking into a wine bar, we were beyond pleased with the food. Favorites to note were the duck dish + octopus. Love love love, and can't wait to go back!", "author": "Ava A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "After a less then thrilling dinner somewhere else we stopped by 20 Spot for dessert and a glass. My mood was lifted and my frown turned upside down. Super yummy chocolate pudding with maybe a tad too sweet marshmallow top and a nice glass of port can take your bad mood away. \n\nIt's a cool spot and it's super close to home. Had a good chat with the owner and left in a wayyyyy better place then I arrived in. Great vibe and cool cat decor.\n\nThanks 20 Spot!", "author": "holly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Quaint little spot just opened about three months ago.\nDaily Candy featured the opening of this neat spot.\nBeing a wine lover, 20 Spot quickly became my top check out spot.\nThe wine list was not as extensive as I thought it would but a good mix of mostly European wines.\nThe servers were also very willing to answer questions and let me tried different wine.\nWhat surprised me pleasantly is the food here.\nThe tuna tar tar was served very sashimi style but decorated with flowers.\nThe rabbit was definitely intriguing as it was prepared as a pate....\nExcellent flavor ~~!\n\nBoth the food menu and wine menu were small but fit perfectly well with the setting...\nA cute spot in deed~~!!", "author": "YC L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-16", "description": "20 Spot is a gem that I just recently came across. Intimate setting with dark-reddish lighting, this is a place to celebrate the end of a weekday, enjoy wine with your favorite people, a first date, or even a client. The fact that they did not take down the vintage, neon \"RECORDS\" signage in the front makes the place even more charming. \n\nThe service staff are super friendly and attentive, so you never feel rushed. I also love that they are not overly crowded and you can actually talk to your table partners. The only two desserts they have are the vanilla panna cotta, and a chocolate pot de creme, and believe me, they are ridiculously delicious and sinful, and worth every bite. Portions are small and delicate, so make sure order a bunch of dishes from their menu. \n\nI would definitely return. Thank you 20 Spot, you've done the quiet neighborhood a nice deal!", "author": "Rika P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "What a cute little spot! Stopped in here for a glass of wine and just loved everything about it. Good wine, good lighting, great service and solid music.", "author": "Janette W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-22", "description": "Come here for expensive good bread and beer.  If you have any other expectation, you will be disappointed.  On the outside, you will have to squint to see 20 Spot.  I was outside and thought the place was Records.  The place is nicely decorated inside.  Nice long bar.  There's a blue red neon feeling inside.  Tables are solid wood.  Service is decently attentive.  Pork chop is soft.  The dips for the bread are interesting, but costly.", "author": "Byron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "I'm pretty confident this is my favorite eatery in the lower 48 as of late. And this was before I found out blue jasmine was filmed upstairs. By far the best oysters I've tasted and the cheese plate tastes like heaven. . This place is right up my alley and cozy as can be. Kyle is a great bartender and the music and lighting were on fleek!", "author": "Laura H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "The staff was personable.... Very friendly.... and the food was amazing!! The restaurant felt like I arrived at an intimate dinner party! I appreciated how isolated the sound was! It's very rare to find a spot like this that isn't too loud and crowded!!! I love how intimate the place was and the food was spot on!! The balance of taste was amazing....every bite complimented  the next!", "author": "Paul B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "Visit 20 Spot before it gets REALLY tough to snag a seat. It's chic, has great ambience, interesting wines and absolutely wonderful food. \nTry the grilled calamari, duck liver mousse, potted rabbit, steak tartare and all cheeses.", "author": "Coco M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "In an old record store converted into a wine bar within the Mission District sits this savvy spot. Close to Valencia but not right on it, this location is actually be considered a bit hidden if you're not a local.\n\nI remember this place for two things: an amusing bartender telling jokes I can't state here, and tasting their wine flights (the \"20 Spot Flight\") with friends during another visit. I do tend to like the Grenache, but that's the point of tasting a flight, isn't it?\n\nThere also some various foods to try (though I haven't yet), like oysters, deviled eggs and dungeness crab. Fun, relaxing and a bit more complex than your typical neighborhood hideout.", "author": "Garett T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-06", "description": "I love the atmosphere, and the servers are nice.\n\nBut I don't like their wines. I don't think of myself as a wine snob, but I like the wine selection much better at, say, Etcetera than here. Most of the time I get a glass or share a bottle with a friend, the consensus is that it's just ok.\n\nThis would be fine if it were cheap, but of course it's not. So I don't go very often.", "author": "Jared B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "My neighbourhood wine bar exceeds my expectations.  I love the 20 spot space--so fitting and fits nicely in it's small space.  I remember when Wood Allen was using this as a filming location (upstairs).  \n\nI want a space that is both cozy, intimate and comfortable--that is a tall order I know. I appreciate their edited wines by the glass as well as their wines by the bottle list.  I have been here twice--though I live very close by--I found the service to be quite attentive.  I went her for a pre-dinner glass of wine and oysters--thoughtfully served.  If the oyster plate was so well done how might be the rest of the menu.  Look at photos I will try the food beyond oysters next time.\n\nA well executed wine bar--attention to detail was done here superbly.", "author": "Jaime Patricio M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-01", "description": "Cool spot, this 20 Spot. Great wine list and I definitely recommend the cheese plate.\n\nWe had no problem getting a table and it was a great atmosphere - not too loud either.\n\nAs with most wine bars, I wish the pours were a little more robust but I think I will just opt for buying a bottle next time. The oysters were my favorite - a great combination.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "Lamb chop ... They said it's the best we'd ever taste bc that's what ppl told them. The ppl tell the TRUTH! Complimented with the crap and a wine flight. Chardonnay was especially great with the crab. Great mood music and ambiance. Give it a shot.", "author": "Rob A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-05", "description": "@20spot is awesome! Love vibe, wine & all delicious little nibbles. Pinot Gri was just right with deviled eggs & salmon & loads salty meats & cheeses. Went for private party last night. Perfect spot & going back ASAP!", "author": "heather s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "Nice little place, very clean rebuild with great brickwork around the side. Excellent wines, and the cheese plate was nicely put together, with unique honey, jam, black walnuts and some mini-pickles accompanying the cheese. \n\nKeep an eye out for the Zoltron art before it sneaks up on you...scaaary :-)", "author": "Brian K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-30", "description": "Excellent white wine choices, even if served a bit cold.  The reds were interesting but a fairly narrow flavor profile. \n\nThe place has some amazing potential with a few caveats:\n\n1) WAYYYY too loud.  It was actually difficult to carry out a conversation across a small table.\n\n2) Better get there early, as it is a really small place.\n\n3) This place is quickly going to be popular with the hipsters.\n\nOverall, a win for the neighborhood and somewhere I will definitely re-visit.", "author": "Adam R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-27", "description": "Hey there, Cary Grant lookalike waitperson!  When you were so condescending last week to a couple of mild-mannered women regarding a question regarding wine and acidity, did you know you were talking (down) to a well-published, well-reviewed California food and wine writer and scholar?  No, it wasn't I (I wouldn't write that about myself), but my best friend, who deigns to Yelp so I'm doing it for the both of us.  The joke's on you, mister.  You would be well advised to educate yourself on the current debate among California winemakers and sommeliers regarding acidity in wine vis-á-vis the shaping of \"California\" wine identities.  If you had been privy to the ongoing professional discussion on the topic, you would have known better than to claim that all \"California wine is acidic.\"  If you had known whom you were talking to, you would certainly not have been so condescending (for the record, you should be nice to ALL of your diners, even if they're asking you for White Zinfandel--lack of wine knowledge is not a character flaw, and people come into your establishment to have an enjoyable experience).  A couple other pointers:  1.  It's okay to bring people bread when they're sitting with a half plate of burrata--don't skimp on the toast, son; 2.  If a little fly lands on the wall behind a diner, please don't smash the bug against the wall behind her head and then smear the blood down the wall.  Unless you can suggest a good wine to pair with insect blood.", "author": "Kennau K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-18", "description": "A beautiful wine bar with a modernist american cuisine of small plates. lovely menu. I could come here every day and will never get old.", "author": "Les K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Cute little wine bar. The atmosphere is very nice, relaxing, and it's a good place to go enjoy with your significant other. The servers are also very nice and enjoy making you feel welcomed.", "author": "Eduardo C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-28", "description": "I love the decor and intimate atmosphere, and the service was excellent with personal attention from the lovely husband and wife owners.  \n\nThe menu is very eclectic. In all, we had oysters, the bread plate, olives and nuts, deviled eggs, hamachi, burrata and prosciutto, little gem lettuce, steak tartare and a selection of cheeses.  The burrata and prosciutto and the little gem lettuce were the best dishes.  We also worked our way through the wine list, the boys starting with bubbly - a Bernard Remy Chardonnay/Pino Noir and moving on to a Slovenian 2012 Furmint, a Suisun Valley 2013 Farmers Jane Field Blend and finally a Verdicchio from Ancona.  I tasted the Cote du Rhone just to see what a $9 wine tasted like.  Didn't care for it.  Moved on to the Crozes-Hermitage 2009 Syrah, then a Montefalco 2010 Sangiovese/Sagrantio and finally a Napa Valley 2012 Madigan Cabernet Sauvignon.  The buttermilk panna cotta with lemon curd and peaches was supremely delicious.  We had a lovely evening.  The bill, including tip, for three people was $330.", "author": "Lorraine F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Loved the atmosphere and more importantly...the food! Perfect place for a night out with the girls.", "author": "Tara W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "Beautiful edible art is presented on each dish served and they taste even better than they look. It doesn't hurt that the venue happens to be charming, cozy, vintage and quirky in all the good ways with owner Bodhi spinning vinyl in honor of the old record store that used to live there. Bodhi also happens to have great taste in wine and will take you on a delicious and educational wine journey if you let him. The menu is smallish but with plenty of variety to make you happy and keep you interested in coming back as Chef Todd masterfully changes the menu dish by dish each week with the changing seasons. Chef only uses organic everything including top quality meats and fish and dairy. The menu seems to always have oysters, devilishly delicious deviled eggs, insane bread if you eat gluten (and worth breaking your abstinence for), a couple different salads, a unique burrata dish, a crudo or ceviche, steak tartare, roasted potatoes with a wicked tasty aioli, an amazing octopus dish and a melt in your mouth meat dish of some kind. Of course, the menu may change significantly come winter. I can't wait. It's my favorite date night spot.", "author": "KarenYaella F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "This place is pretty cozy and cute. The food can be a little heavy but the wine selection is decent.", "author": "elizabeth m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "Good spot. A little bright in my opinion but great nonetheless. Happy they're there to bring some nice wines to the block.", "author": "Lenny K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-28", "description": "This is a cute space with good service but the wine selection is sub-par.", "author": "Eater S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-19", "description": "I have a special place in my heart for 20 Spot. I stumbled upon this cozy, classy wine bar one day by chance and found myself imbibing in a glass or two (maybe 3) of really good wine. The manager, who I got to chatting with, was a total gem, as was the rest of the staff. All smiles, wonderful personality, the type of place you want to roll into after a long day of work to enjoy ambience, a fantastic glass of vino and light bites such as their amazing deviled eggs! 2 thumbs up!", "author": "S C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "Might be one of my favorite new spots. Cozy, great lighting, great vibe, friendly staff, and delicious food and drink!", "author": "M D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "I loved this place. The food was really delicious, my sparkling wine was excellent, and we could actually have a conversation! I love a corner of the world where you can unwind and the noise level is reasonable. It's a rare find.\nI have to highlight two things: the first is the bread. Really delicious. The second is the salad - you know that bright green, super fresh salad that tells you everything else will be good? That's the one. Finally, lots of gluten free, dairy free things to choose from, if you or someone in your group is picky. (In my group that would be me.)", "author": "D Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-31", "description": "Good food, though a limited selection. Wine was tasty and Iberian. The service was perfect, no hanging on us & not far and distant. We had the chicken liver mousse, butternut squash soup, and black cod. All very good. Just a bit pricey. But then, this is the \"hip\" Mission. Worth a try though.", "author": "Erik T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "Great low key spot to grab a glass of wine and enjoy some good food. The staff is knowledgable about wine and the liver mousse that we had was excellent. We heard about it on Check Please Bay Area and it didn't disappoint. Only thing they could change is the decor which is a little confused.", "author": "Rachel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "great atmosphere, super friendly staff, great drink menu and food options - all in all a winning formula.", "author": "Ruben K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-22", "description": "Every single thing is delicious including the desserts. Get the mussels and burrata though.", "author": "Loren A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-17", "description": "Love this place! Love the people! They care and everything they offer reflects the love and care and attention to stylish detail they put into this place! Cool and yummy. Come here for a good time.", "author": "Daydream Believer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "It's a rather small tasting menu but everything on the menu was quite spectacular.  The deviled eggs were so creamy that it melted right on my tongue.  By far the best vegetable Ratatouille I've tasted in a very long time.  The vegetables were perfectly stewed and the sauce was tasty, savory, and paired fantastically with my exotic red wine.  Come early because this place gets extremely packed after 8pm.", "author": "Sharon N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "I almost hate to review this place because it's bound to get discovered eventually... I've been here probably around a dozen times since it opened. It is quite similar to my vision for what a perfect wine bar should be. The wines are beautiful and the owner's taste and recommendations are impeccable. (If Bodhi is there, always ask him what he's currently drinking.) The food is great - both for quick bites, and for dinner. The ambiance is cozy and friendly, the decor is interesting, and the music is good. It rarely gets crowded because it has no street presence. Go now before it's on everyone's radar!", "author": "Adam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "Great food and service. I will be adding this place to the list of go-to restaurants. Try the soups...they also play a great variety of music. Good place to take a lady on a first date...or any date no matter how long you have been together:", "author": "Hamza S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-08", "description": "We had our doubts based on the dollar signs Yelpers have assigned this place, but it really was delicious, no corners cut, and the service is spectacular too. We'll make an excuse to come here for a light dinner/primarily of wine more often.", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "The oysters and grilled calamari here are very special. The wine list is also. Grab your besties and a few hours; you'll be glad you did.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "We were there on Halloween just last week and the food was spot on amazing! A bit hard to find but well worth it - cool atmosphere - cool music - awesome food.", "author": "Manny D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-17", "description": "There really needs to be a 2.5 star selection. I wouldn't say the entire experience was \"Meh\", but I'm not feeling the \"A-OK\" option either. I've been here twice. Once for dinner and drinks and once for a drink at the bar. The food was really very good. Surprising actually. It was fresh- distinct flavors and great presentation with little treats all over the plates we shared. \n\nHowever, when I took my husband back for a before-dinner drink we had a disappointing experience. One reason why we live in San Francisco is because of the amazing food and drink options and in a town so saturated with amazing spots, I don't know how places get away with bad service. We were served by the owner, no less. He barely gave us the time of day. He said no more than five words to us and was too busy drinking bubbly with some friends to notice if we needed anything. This was disappointing for such a cute, quaint little joint...I'll reconsider going back...bummer!", "author": "Robyn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "The 20 spot is a great place to go and have good wine, great company, and yummy bites to eat while in the Mission. The staff is always amazing and will always give good recommendations on the current wine selection. The ambiance is very relaxing. They even play good music from vinyl. Highly recommended!", "author": "Brian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "Lovely historic setting and waitstaff made us feel like family. Ambience, wine quality, and the delicious smorgasbord of appetizers were all excellent. Looking forward to my next visit.", "author": "Emily V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "3 beers and 3 wines on tap.  25 wines available by the glass.  About 110 wines by the bottle.  Take a look inside the Force of Habit record shop, and record shop it is no more!   Its now a snazzy new Mission wine bar.  It was great to check out the space and see the awesome little layout.  There are various intimate seating areas.  The furniture is super trendy and the behind the bar is a huge intricate system for storing the bazillion wines they have.  The food is top-notch wine bar fare - oysters, clever salads, sandwiches and fancy cheeses.  This is going to be one of the Mission's hottest new little night spots for wine lovers.  Great addition to the SF night scene! :-)", "author": "Jaydee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-31", "description": "A friend & I stopped in on the second night it was open and it was PACKED! OUr server, Marc, knew his wines really well--he just asked what kind of wine we typically liked and brought us both tastes of very different wines that we both liked. Very cool interior, excellent wine choices by the glass and an even larger selection by the bottle. We didn't have the food, but the people next to us did and it looked great. My guess is this will quickly become a Mission hotspot. A tip: Get there early if you want a table and look for the neon \"Records\" sign outside.", "author": "N B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-12", "description": "My new favorite spot! Great service, GORGEOUS food plating, amazing food. Mega win all around.", "author": "Amber K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-02", "description": "The most enjoyable part of our meal was poking fun at the restaurant.  We were told before we came that \"40% of their menu was vegetarian.\" Not!!  We particularly got a good laugh when we were told, when asked what was vegetarian on the menu, that the bread and butter and olives/nuts were good options.We were told by staff beforehand that \"We always have a salad and roasted potatoes with sauce mornay,\" neither of which were on the menu. The roasted king trumpet mushrooms, while tasty and priced like a full meal, was smaller than a tapa.\n\nThe cheese plate was quite good - but there is not much you can do wrong with a cheese plate.\n\nThe burrata beet salad had to be returned; it was difficult to find the tiny beets buried under the plate of mashed cheese.\n\nAnd... this was one of the noisiest restaurants we've been in.\n\nOn the positive side, the wait staff were attentive, friendly and tried hard to please.\n\nTo conclude, this is really a wine bar with a few light snacks and limited options of small portion main dishes. Don't expect to make a full meal out of it.  Unfortunately you will have already paid for a full meal by the time you leave, but  the good news is you can go around the corner and get a great burrito or a fantastic dosa for a fraction of the price. 20 Spot needs to decide what it wants to be: either provide a real dinner menu or just provide the bar bites and price them accordingly.", "author": "Joseph S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "A wonderful bar with great service and a good ambiance. It was bustling till about 11:30-a nice little spot to have a good ol' time!", "author": "Vivek N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-25", "description": "Great new spot in the Mission. They have done a great job with the wine selection and the small plates. Definitely worth a trip for all.", "author": "Dilly M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-01", "description": "Very rude waitress. We asked her to lower the music that suddenly started playing at an uncomfortably loud level. She told us \"it was a bar\". But she forgot that this is a sit-down \"beer and wine only\" place that also serves food. So, actually this is more of a restaurant! She completely ignored us when we so nicely asked her to lower it a second time. I'm tired of rude wait staff in the Mission so I'm starting to call them all out on their crap. It's not our fault you're mad at the world! Get a grip!", "author": "Den M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "I have been meaning to sit down and write a review of our experience at 20 spot.  First, the space is amazing.  They did such a great job on every detail.  The wine list, fantastic.  I would expect nothing else from the owner of our favorite Russian Hill wine bar.  The food, light, refreshing, packed with flavor.  We tried a sampling of a good percentage of the menu.  Oysters, so fresh and delicious sauces on the side.  The cheese place was beautiful and every element added a punch.  I especially loved the pickled vegetables. The razor clams, a first for me, were amazing.  I could have eaten 5 more plates of them!  Every dish had such care and so much flavor.  Great spot!", "author": "Jaime C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "I really enjoyed my experience here- love the decor and ambiance, and the owner was very friendly and welcoming.  I only had wine and the cheese plate, so I can't comment on the other dishes, but the cheese plate was the most generous cheese plate I've ever had.  The servings of cheese were larger than any I've ever gotten elsewhere, and it came with plenty of bread, fruit, almonds, pickled veggies, honey, and a fruit spread.  Would definitely go back to try more wines and some of the other dishes.", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "Excellent wines, amazing food. Had a great chat with John about many things, including grat wines and food pairings.\n\nTried the Hamachi and the plate of bread. I still can't believe the quality of the bread they serve, and that it's just $4.", "author": "X O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-21", "description": "First time.  You will likely spend a lot more than a 20 spot, but you will have some great drink, eats, and excellent service.  The staff is obviously happy doing what they do.  Cool atmosphere.  We had the Hamachi, Trumpet Mushroom, Beets and Burrata, and one other dish.  All were very good, but the Trumpet mushroom was my favorite.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "My favorite wine bar in the Mission, without a doubt!", "author": "Olivia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "My new favorite wine bar!!  Love the atmosphere, food and wine.", "author": "Tom F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-28", "description": "Great service, romantic ambiance (a little loud, though), and fantastic wine. Intimate and low key; would come here again.", "author": "Krystine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "I don't write reviews often, but this place is AMAZiNG! The food, the wine list, the atmosphere are all tops. Just come.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "Fun place to be. Loved the ambiance. Our waitress was more than helpful, offering great choices and giving us a few extras. Really looking forward to going back. Great beer and wine selection, loved the cheese plate and the olives were some of the best I've ever had. Tucked away nicely between the crowds on Valencia and mission.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "20th Spot is such a sweet wine bar! The selection is great, and the small plates they serve are carefully curated and prepared. The cheese plates are very reasonable in price and generous in portions. I love the mid-century furniture they have, and they have done a great job of creating different spaces in the restaurant that serve various purposes. For example, you can curl up on the couch for more intimate conversations, sit at the bar with a good book, or come in with a group and have a lively discussion around the table. The staff are warm and extremely knowledgeable--they know about their wine and they want to share their expertise.", "author": "Belinda S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-09", "description": "The menu looked great, but the food didn't meet the expectations unfortunately.  Even the bone marrow, usually one of my favorites, wasn't that great.  The cheese plate was meh. :(", "author": "Allan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "Really cute spot!. Perfect for a pre/post-dinner drink or a light meal.", "author": "Natalia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-01", "description": "Celebrated my birthday here with a small group of friends and had a wonderful experience. Great venue and staff was super nice, very thoughtful in their wine recommendations and extremely accommodating as our group switched tables halfway through. I would recommend 20 Spot for any occasion, especially for smaller group hangouts.", "author": "Eva R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-29", "description": "Great neighborhood spot. Good wine selection and enough of a beer selection too. Cheese plate has great accompaniments. Excellent and attentive service!", "author": "Christine P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-25", "description": "Definitely hip, small and cute.  The staff were super nice.  Food is more snacks versus meal (we went nearby to get a full dinner afterwards).  I wish they had some remnants or design inside to show it used to be record store..  I thought that was the coolest part, but you'd never know it from the inside.", "author": "Melanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-26", "description": "Very nice interior, I loved the wine, the service was good, what we ate was tasty if a little lite size-wise.\n\nI have to knock off a star because it is LOUD. So loud that the server didn't hear our order and brought us the wrong thing. I was hoarse afterwards from shouting to be heard by my friends and we were close to each other. I feel bad writing it because I have no idea how they could change the acoustics and it's an otherwise lovely space.\n\nI would go back but only with my husband as I can guess what he's saying most of the time anyway :p", "author": "Odette L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "for what it is, a small, intimate little bar/restaurant, its perfect.  we tried wines they recommended at the bar and the cali cheese plate. overall, a nice place to take someone for a classy nite in the new mission.", "author": "Roy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "The burratta salad was outstanding and the server had great pairing suggestions.  It was a little hot inside (on a hot night), but worth it for a lovely evening!", "author": "Laura V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "My favorite little wine bar in the mission!  Great vibe that is both chill and fun, perfect for dates!  Great wine, and food is amazing too!  Try the cheese plate, deviled eggs and oysters!", "author": "Dun W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "Great food, atmosphere, wine and beer list. Really well appointed with cool art. Met the owner who is surprisingly articulate, when you consider that he looks a tad on the residentially challenged side.", "author": "Jeremy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-04", "description": "Fabulous! Cool atmosphere tasty Spanish wines. Friendly. Quiet location.", "author": "Josh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "Have been here several times now and thought it time to share its goodness (& hope this doesn't backfire into me not getting the coveted Eames rocking chair spot in the window on a busy night). \nI have come here both alone and brought in friends and outa-towners many of which are in the industry. The consensus: deftly curated wines in a cozy-artistic-funky-musical setting with unique and delicious small plates/ smaller hot dishes. Seriously, the attention to detail is something to behold. Even the WC is dope. Their crew is fun and attentive and will definitely help you choose the right wine for the right moment/mood/dish. The menu changes up a bit, too. The clams and pearls is one of my current favorites and always the burrata, oh and the house cured caviar, delicate! Deserts always hit the spot (get it).  It gets busy so check it out on one of their quieter nights or  if you can swing it early, they have a happy hour on wines, win-win. Just don't get in my Eames chair!", "author": "Vic R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "This is a place I would recommend highly to anyone. Small intimate layout, records playing, amazing art, such friendly hospitality, and fantastic food and wine. We asked about multiple wines (all of which we got tastings of before pouring) and they definitely get out of the big bold CA red styles. The food...don't even get me started....must haves are the crab pot and pork chop. We declined dessert but the guy helping us as we ate at the bar (owner we think?) gave us small pours of sweet Riesling for free before we left. I would 100% go here and recommend it to all of my friends!!", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-17", "description": "definitely a fan of this place. Service was wonderful, wine list was really great and the pork soup was delicious! Gluten and Dairy free so extra good in my eyes!", "author": "Natalia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "A wine bar that introduced me to new wines and has good food? Count me in. The waitress was knowledgeable and pointed us in the right direction - I tried a red from Mendocino that delivered like a Pinot Noir, exactly as she claimed it would and the buttermilk panna cotta was great, too.", "author": "JJ C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-12", "description": "Used to be a loyal patron of 20 Spot until I was denied service one Saturday night for having an out of state ID. The new manager on duty claimed my NY drivers license seemed 'flimsy' and refused to serve me and my friends. What a big day for this tiny overpriced wine bar to have an out of state patron! It's unfortunate this place will likely go out of business should this manager continue to turn away patrons who don't have a California ID.", "author": "Penny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-21", "description": "You'll want to go here for a glass of wine, but you'll end up ordering dinner.  Great wines, and really amazing food!  The Bean Salad was so fresh and tasty that we ordered bread to soak up the olive oil.   The cheese plate was great, but  you'll need to save room for desert!  The chocolate pudding with meringue was absolutely yummy!  So happy to have found this neighborhood hangout.", "author": "Kellie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "20 Spot has quickly become my favorite destination in the Mission. This place has nailed it on every level: great atmosphere, amazing wine selection, delicious food, and top notch customer service! Perfect place to grab a drink and a bite or enjoy a leisurely dinner.", "author": "Whitney B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "I absolutely love this little place! The decor is warm and cozy, but the vibe is chill! I was blown away by the delicious wines, particularly the unusual  white wines by the glass, including a yummy Marsanne Rousanne from California. The food is also great - though the menu is somewhat limited,.  We've had hamachi and avocado, mussels in whte wine, creamy burratta with asparagus, and  an amazing chocolate dessert.  The service is warm, friendly, and professional.  Can't wait to go back.", "author": "allison s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "One on the most amazing meals I've had in years.  A good friend of mine took my to 20 Spot to celebrate my birthday   I wasn't expecting much.   But to my surprise it was better than great.  We shared my absolute favorite oyster \"Boh Solei\".  Small, super flavorful, slightly briny, not creamy, and served with a homemade hot sauce and vinegaret.  Pared with some bubbly champaign suggested by a lovely host Bodhi Then we shared King Trumpet Mushrooms with artichokes and a Bernaisse Sauce which was out of this world party in your mouth good, pared with a lovely Pinot.  Our next dish was a potted crab which was a pot of cleaned succulent crab ready to eat. No mess, and served with perfectly toasted crusty French bread. It was so YUM!  Oh and the salad of baby fresh crispy hearts of Jem leaves with a fresh mozzarella cheese was divine.  I was full but wanted to try the soup which was our last dish. The butter bean soup with chunks of bacon (the candy of meats). It was was amazing. Of course more wine,  a Cab Franc which I loved.  Deserts because it was my birthday... but there wasn't room left to eat it.  If you haven't been there you are in for a treat!  It a great place to get Amazing Food in a a comfortable great atmosphere with a lovely host \"Bodhi\", who knows his wines and a place.  Ladies this would be a place I would feel comfortable going by myself   It was warm and inviting yet chic.  I definitely will be going back with another friend.  Such a \"Jem\" in and unexpected venue.  Don't miss this one!   Oh ... and I am super picky.  KK", "author": "Kyra K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-16", "description": "the seafood salad sparkled with freshness of the raw tuna, lightly smoked salmon, perfect shrimp, with mussels and adventurous uni on a light avocado mousse.\noysters on the half shell, a separate dish, was accompanied by both a cocktail sauce and a delicious unusual relish of tiny dice of vinegary apple, which was a nice contrast in both taste and texture to the oyster. the vegetable salad offered a delicious mix of  seasonal fresh and dehydrated veggies- tomato, eggplant, pepper with a light house made farmer cheese.the wine menu meets fine wine bar expectations, and the servers offer a small pour to taste and be sure you like it before filling your glass. \nworth trying and coming back to..again..and again!", "author": "Susana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "Nice cozy wine bar. Good food and wine selection. Especially, we like an ambiance there. It made us feel comfortable! All of us enjoyed the night there and good people except only one waitress. She was always in a rush to clear all plates, no smile, unfriendly. Unfortunately, this was a big minus for our Friday night.", "author": "Masayuki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "love it! the bar bites are top notch as is tgeir drink selection. i love the atmosphere and neighborhood feel. xo.", "author": "Best M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "Super friendly place. Knowledgable staff, good beer. Quiet. This is a great place to bring a date, or drink with friends.", "author": "Klevin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "Great first date spot or hang w/ pals and actually hear each other spot. Cozy - not too hipster-y. Excellent small but unique wine list. First-rate service. Snacky snacks are little inconsistent but I appreciate the healthier wine bar offerings. And I dig the tunes.", "author": "Carson R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-14", "description": "Super charming with delicious wines! The staff is amazing and incredibly friendly. Perfect hangout spot.", "author": "Mark Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-30", "description": "Super awesome space, friendly vibe, good wines and excellent tunes.  A winner.", "author": "Todd S."}
