{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Great spot, super chill vibes. Staff were super friendly, I think you get a free refill which is nice. \n\n10/10 will return when in area.", "author": "T K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Came here for my birthday & I must say this place made my experience amazing. Had great hip hop hits playing while my friends & I got to have a great time. The owner has top hospitality skills & everyone who worked there was so nice. The hookah flavors were very tasty! Would recommend coming to this place. You won't regrets it!", "author": "Paige M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "I had an amazing time, the hookah is smooth, the music is great and so is the staff !  The vibe is very chill yet absolute. Thank you Oz for a good time & outstanding hospitality next time I'm in San Fran I will visit again.", "author": "Jazlyn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "Good service, good music,  and the hookah hits really smooth!! Come around happy hour!", "author": "Neda S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-07", "description": "This place is super crowded and wayyyyy overpriced. I did not like the vibe or the people inside. They gave a weird vibe to everyone else. Wen to try this location because we were in the area and damn this place was not what I anticipated. I wished for something more comfortable and welcoming. \nTwo stars because the flavor was good tho.", "author": "Gus L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Everyone that works there is great, owner Zaki also a very accommodating and always great with his customers. Definitely recommend this spot.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "Hookah was bomb really the best I've ever had. Kinda hidden not a lot of signage outside, especially since we were from out of town. Seating was crowded but the host found us a place after our hookah arrived. Coal service always A1 (really good). Kinda pricey compared to my Seattle prices. Overall great will be back.", "author": "Kenzie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Awesome place, had great customer service, GREAT HOOKAH. This place is a must go if you want great hookah and wanna have fun with friends. Will be back.", "author": "Maedeh Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "Great music , great energy , hookah was well Done !\nNo alcohol , teas , water , Redbull. Open until 2 am", "author": "West C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "5 star for the great hookah in the town.\nEach hookah is 25$.\nHot black tea is 5$.\nMoroccan tea is5$.\nYou need to pay at first. \nI enjoyed the ambience.\nCostumer service was fast.\nEach hookah at least works for 3 hrs max.", "author": "Atosa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "Decent service, the music selection was pretty nice as well the night I went. The bathrooms are acceptable but they're not the cleanest in the world. I only wish is they had more walking space inside out the lounge. All the couches & chairs are pretty jammed inside the place. Other than that it was pretty dope.", "author": "Matthew N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "I've been coming to this spot for 5 years. A regular customer. I went on Thursday night and a guy named Az or Ass tried to charge me a much higher price than usual. I told him $30 is not the price I've ever paid here. He created his own prices. He was extremely rude and disrespectful. That's not how business works. The owners need to know about this. Please reach out to me so we can discuss in detail. I am a district manager and have treated my customers and clients all with honesty and respect.", "author": "Princess Jasmine J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-20", "description": "I've been in here at least a dozen times and while I have some issues with this place, the hookah itself is actually really good. They definitely know how to pack a bowl and the quality of smoke is fantastic compared to most places in town. Service is okay but most service at hookah lounges leaves something to be desired. I think hookah maintenance would be immensely improved if they could give people tongs but I can also understand why *most* people should not be trusted with managing coal rotation. \n\nMy biggest qualm with this place is the seating arrangements. There is a lot of space and seating, but every time I've been in here, it's really hard to actually navigate in and out of wherever it is you're seated. There isn't a lot of legroom and it's easy to bump into and knock over coals or entire hookahs, especially if you're seated in the booths where you have to crawl through a maze of legs and hookahs to get out. It's just not super safe and makes for an uncomfortable \"lounging\" experience. Also, a lot of the seats themselves aren't very comfortable (too upright) and some of freestanding benches aren't stable either, which isn't safe when you're getting around hookahs. \n\nThis place could probably use a new layout design and probably more people on the clock for better service, but it's still a solid place to come in for hookah on the off hours when you can navigate more comfortably.", "author": "Nikki I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "Best hookah in the city! Great customer service! Hookah lasts a long time and flavor is perfect", "author": "David E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-02", "description": "Worst place I have been too. The worker is very rude and they literally have only on menu. Will never go here again. I would rather watch paint dry", "author": "Vikram M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Lit AF gone with co workers and it's a great place to just chill and smoke. It's so great that everyone there is so friendly and customer service 10/10.", "author": "Christian M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-25", "description": "This was one of the worst hookah bars I've been to. The inside was dark and tacky, there were \"Fail\" videos playing on repeat like it was a frat party, and $44 for one hookah and 2 mint teas in the cardboard cups you get at gas stations?! \n\nIt took them 25 minutes to put coals on our hookah, and when they finally did, the coals kept going out early. Definitely not coming back here when you have way better options in the Haight and Fillmore.", "author": "Jenn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Let me first off by saying I walked into this place in a bad mood ,it was a little difficult to find due to there was no sign outside. I walked in and was greeted by a familiar face I was my guy Ivan I had been to a different hookah spot that he was working at and I knew if he was working here I was going to be taken care of. We talked to the guy at the register his name was Oz or Ozzy but man this guy was cool took really good care of us was on his toes and kept the energy in the room he brought us out his hookah mix I think it was a Gun mint mix but it was good and smooth! They changed out our coals and even tho they don't hand out tongs to everyone they let us get one. I ordered a black tea and I was piping hot the way it should be ! Ozzy was telling us that they are doing renovations and it's looking really nice only down side it was a tad bit too hot in there but other than that they put me in a good mood I was happy and singing along to the music and felt relaxed ! So over all I love this place thanks to Ivan and Ozzy because of them I will be back I will tell my friends for sure !", "author": "Michel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "I have been coming to this establishment for over 3 years. I can hands down say that 724 has the best hookah in the city! Great hookahs, amazing customer service, and awesome vibes. Yaqub makes spectacular mixes of flavors, and there are a variety of different types of hookahs like glass or traditional. Highly recommend this spot for locals and those visiting the city!", "author": "Omead A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-15", "description": "We stopped by this place after Happy Hour because we were craving Hookah after getting our buzz on.\n\nIt was a small spot but per Yelp photos Chris Brown and Steph Curry frequented this spot. That's what really sold us, thank you Yelp! It was empty when we first got there and the service was great.\n\nI asked him what type of coals they used and they said Coco naras and they had both starbuzz and fumari tobacco. Starbuzz is mid quality tobacco but fumari is that top notch stuff.\n\nWe got the white peach with ambrosia and the flavors mixed really well. The amount of clouds you get was good so you know the packing of the tobacco was done well.\n\nThey don't get four-five stars because as it got a little busier then older clients got a bit neglected. We didn't get any coal refills at all until we asked and we had to ask multiple times. They don't offer water that is not bottled. The music was a bit low for a hookah joint. The seating area is also a bit weird and looks sort of dirty. But for the most part it did the job for my company and I who were buzzed.\n\nIf anyone has any questions or concerns about this spot please feel free to contact me. I'll be happy to answer anything that comes my way.", "author": "Jeremy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "This place is definitely a must! Os was very welcoming and made us feel so comfortable!!! He was so nice and made sure that we were taken care of!", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "I am here on a business and since i love hookah i decided to go to a lounge and endedup here. The afghani guy who served us was extremely nice and his staff helped us find bars and gave recommendations for us to go to so we enjoy SF. The hookah was a good price and overall a great experience. Def somewhere i will take friends.", "author": "Pasha V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "This place is relaxing, yet social.  The venue isn't huge, but it is just enough space to have room to yourself, but not too secluded where you can't socialize with others.  There were multiple televisions, so I was able to watch some footballs games while using the hookah.  There are so many different flavors of hookah offered, and of course there are the options to mix different flavors.The service was good, and this place really is a hidden gem.", "author": "Bradley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Nice hookah vibe. Great music. Try the house blend (white gummy) with a hint of mint. Also ask for Frank (really personable server who will help newbies and experienced hookah-ers pick the best flavor, have a great time without the hassle + blend in like part of your party!) Definitely recommended!!!", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "There worst hookah In San Francisco \nThe service so is so bad \nI just order a double apple hookah and he bring to me mint hookah and I told him to replace it but he told me this is not my business !!!!!! \nAnd I order a cup of tea and he doesn't bring the sugar I ask him about it and he told me 2 minutes and he'll bring it after 10 minutes he bring the sugar finally  and the tea was so so cold \nDon't try to go there promise me the worst lounge in SF \n\n\nBy the way you must pay before you smoke hookah", "author": "Mohammed A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-27", "description": "As someone who went to Cal, and someone who's been a long-term resident of the Bay, my friends have constantly expressed surprised at the fact that I've never smoked anything, be it weed or even hookah. Because of that, coming here the other day to accompany my date, I had no idea what to expect, or what to compare the place to, but I WILL say this: my first thought upon entering the bar was that it reminded me of the opium dens you'll see in movies from time to time, with Snowpiercer standing out in particular. Not dirty, albeit a bit dingy, and quite dark, but mostly because of all the cushy seating spread throughout the place, and people lounging and relaxing all about.\n\nOne of the major complaints in other reviews was in regards to the service, and I will agree that after getting your initial drinks and hookah, service tends to fall off the radar: attention is hard to get, and even once you do, they take forever to bring you whatever you've asked for. Service, for the most part, is friendly at least.\n\n***Accessibility Info***\n\nVenue - Due to all the seating throughout the place, accessibility is a bit hit or miss. There's a walkway down the center of the bar that's on the narrow end, and if some of the seats are moved around, space can certainly be made, albeit limited.\n\nBathroom - Didn't try them.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "Nice place. They had really good pan flavored hookah which I loved. There was a bit of a wait on a saturday night but I guess that is to be expected. Will definitely come back to this place again if I am in the area.", "author": "Nibha K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-26", "description": "Why was my hookah $35?  I really don't understand how they charge you so much for hookah... 10mg of Shisha is like $10... and you only get like 2 mg of it in the bowl they pack the shisha in...\n\nThe service was pretty good. However, I know when i'm not in Anaheim/Orange County for the most part. I wasn't allowed my own set of tongs to make adjustment to coals. I had to request for a new round of coals. And quite simply, the hookah was $35... WTH! Hookah in Orange County with the same exact set up that they provided (KM tall Hookah) is like $15... Mind you, I had the same set up at home. I definitely think Hookah is overpriced... I get that we were in the city... in Palo Alto, we paid $20 for a hookah... it wasn't great either.. but that is more reasonable to me than $35...", "author": "Susan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Love this place. The guys are so sweet . The hookah came out super fast & they are on top of refill your coal. Love the vibe", "author": "Raquel W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-03", "description": "Eh. I'm not a fan. The place is too small and can easily get crowded. Service is a C- here. The guys don't do a great job checking on people and making sure either the hookah is on par or how well the customers are doing.\n\nI spent $30 on three of us last night which is expensive. I like the fact that it's inside this urban area but still not a great place to smoke. I've been to better places. \n\nI asked the front desk kindly to clean our table because there were ashes and used cans and water bottles on top but they just ignored it. It's a dirty and messy hookah place for sure. I don't recommend anyone coming here at all. The employees are also busy flirting with the women all around and just taking down their orders rather than treating everyone equally. It's pathetic. \n\nLast night was bad. Not coming here again. As a Elite to the community for Yelp, I will pass this on to the people all around here. Something needs to change.", "author": "Allister D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-06", "description": "It was 5 of us and 2 hookahs. The tab was over 100 dollars!? Is that even real? I've never been to a hookah lounge that charged that much for 2 hookahs. It wasn't even a weekend. Thursday night. Very disappointed with this place. There were some people in there that were so rude just because they know the owners. I'm sorry but I wouldn't waste my time at this place to get disrespected by 'owners friends' and pay that much for such crap hookah. I will spread the word to everyone I know. And I hope I help you guys steer clear from this place especially if you're with 2 or more people. Shame", "author": "Linda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "Not bad for SF... \nWe came in here during our stay at a nearby hotel and coming from Glendale where hookah is very popular on every other street, this place was pretty good. \n\nThe only down side is it's indoors and if you don't like to be somewhere stuffy... \n\nOtherwise, good service and pretty bomb hookah :)", "author": "Nella M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Definitely an amazing experience, visiting from Vegas; TOP NOTCH hookah & service from Noah! It was my birthday and he had paused the music to wish me a happy birthday from everybody! For sure made me feel special. So far loving SF", "author": "Christina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Had a lot of fun at this hookah spot, everybody here was nice was hell. My mans \"OS\" hooked it up and took great care of us. Great music, great vibes, probably the best hookah place in SF. Most definitely recommend it for anyone staying or visiting the SF. Will be back very soon!", "author": "Xavier B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-17", "description": "Was really excited about trying this place out. For the record - I'm versed in hookah. I own three Maya's and frequent smoke shops in the east bay regularly. Brought my girl from Atlanta to try this place out. We came on a Sunday night and it was relatively quiet. We bought one hookah, one green tea and a bottle of water - $32 total. Would say this is definitely on the pricier side for hookah but again, was really excited to try it given the reviews. I got a white peach/vanilla/blueberry mix. Everything came out okay and our server was hospitable. Unfortunately, ten minutes into smoking I got very nauseous. Like, nauseous to the point where I had to tell the server. I've NEVER had that reaction to shisha before and I'm not new to this. I let the server know that the hookah made me sick shortly after smoking and kindly asked if there was anything they could do for the inconvenience (i.e., a refund because I legit threw up). He told me that there was nothing he could do and \"different people have different reactions.\" I thought that was super inconsiderate given that literally no time had passed from the time I received/smoked the hookah to the time I started feeling sick. So sadly, I can't recommend this place. They should look into possibly how clean their materials are/how they are packing shisha because I'm not sure why else this would've made me sick. \n\nAnd no, I didn't eat anything weird or out of the ordinary before coming. My dinner plans are totally ruined because of how sick I feel writing this in our Uber", "author": "Kareema T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Yaqub has Great customer service and makes the best hookah! Make sure you ask for the ring!", "author": "Abochn D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-05", "description": "One word to describe the place is meh. \nIf I'm paying for a hookah it better be higher quality than what I can do at home. \n\nFor one the hookah is way too expensive. Basically $30 for a basic hookah. \n\nThen they bring it to you using the cheap easy to light coals. I don't even use that at my own house. \n\nI guess hookah is not much of a thing in sf so the standards are a bit low. San Jose has much better hookah lounges.", "author": "tsubasa m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "We decided last minute to try this place out at the suggestion of our Lyft driver. The customer service was awesome. The vibe is very sexy and chill. Definitely try the double apple.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-20", "description": "I guess I'm just really disappointed with my experience yesterday. I feel really bad giving them one star but here it goes....\n\nThe hookah itself was amazing! I think I'm spoiled because normally we pay 10-15 bucks in the east bay for hookah and over here was kinda expensive but it's SF ... And it was my birthday yesterday! So basically we came in at 7 pm ish and had fun and left ... \n\nThen After clubbing we came again at 1 ish and they literally kicked us out at 2 on the dot .... Even though I asked for five extra mins... No exceptions. I go to dream all the time in Fremont ... It was my birthday ... I came to this lounge earlier in the same day.... Nothing I said was convincing them..They literally wouldn't let us even stay an extra 5 mins they were so adamant. \n\nFine we leave Bc what can we do.... Then I see that they are letting other people in! How was this fair ... I can't get an extra five mins but you have time to make brand new hookah for others ??  Seriously? Idk I was really really upset with the way they handled the situation. So one star it is. But the hookah is point ! Go during the time frame and leave before 2 am and you're good! Lol", "author": "Nikita B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "This place is so freakin dope! I remember coming in here with my friends and the dudes working here were so attentive and friendly. The way they pack the shisha are effective. When the coals need to be replaced, they do it right away. The music is awesome too. If anyone wants to find a chill spot to kick it and just smoke, definitely come here!", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "Decent Shisha! Good place to chill and hangout! First time here, coming back for more!", "author": "Kevin Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-31", "description": "Always crowded and hard to get a seat. Hookah flavors always seem a little too harsh because their coals have a short life. Atmosphere is pretty sexy though, good luck hearing your companions though but its honestly not as bad as some places are", "author": "Nina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Just wanted to drop in and mention how much of a good time I had at 724 hookah. The server Jon was polite and on top of my coal. I work in NY but come to the Bay Area on business trips. This is now my new spot to kick it, 724 has that \"New York speed\" which I've been longing looking for. The hookah was smooth too as well as the ladies ;D Until next time gentleman !", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-28", "description": "This place is nice, with good hooka and music, but the some of the sofa are very uncomfortable", "author": "Phuong T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Great service, safe comfortable environment. Ahz (think that's how it's pronounced) was a great host, cashier, and aid. Definitely will be going back! Thanks guys!", "author": "Blair C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Come here on some weekends, and have to say it has an awesome vibe. When I ordered my hookah the guys had it out as fast as possible. \n*Great customer service \n*Fast service \n*Great environment \n If you every end up in San Francisco, this is the place to go!!!", "author": "Dee A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-28", "description": "Staff is very nice BUT, I smoke mint hookah every night at my house, and the mint hookah we ordered tasted like burnt double apple. Very upsetting considering prices are very high & we also can't even get tongs to control our own coals. Coals came directly in center and we waited 15 mins to move coals. Definitely looking for a different hookah bar for our next trip.", "author": "Ramsey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "Really loved the flavor mixes... The guy at the counter was pretty funny... \n\nMy fav - Pan+Gummy Bear", "author": "Deebs M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "We here for the first time about a month ago on a Saturday night. Music was not loud at all. I read reviews of how loud it was but nope not at all! Service was great. Music was great. Hookah was good. Parking bad of course but that's expected. I would definitely go back.", "author": "Kelinda C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-07", "description": "Omg the most ghetto over priced dirty hookah place ever. The couches & chairs are all ripped & dingy. The place looks like a garage turned into a hookah joint. Horrible lighting no ambience or atmosphere what so ever. Playing rap music from the 90's & it's really over priced! One hookah & 3 teas $50 definitely not worth it for tea & mediocre hookah! Only positive was the service & they get a star for that. I had an out of town guest from SoCal OC (nice hookah places there) brought them here & I was really embarrassed with my poor choice. Just because a couple BB players visited this place does NOT make it cool. Save your money Bay Area is lacking a nice hookah lounge go to LA/OC for the real deal!", "author": "Zaro A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "Great staff! The inside could look a little nicer but the hookah flavors were on point!", "author": "Howard S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "This hookah place is legit. It's super comfy and the flavors are delicious. Super well priced and they have a great happy hour.", "author": "Sally P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Yaqub, Aladdin, and Mohamed are the nicest people. Good genuine people make the place alive and people come more.", "author": "Hamzah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Love the amount of options and mixes they give you and the prices is unbeatable and if you're a regular customer they give you more discounts", "author": "Laid C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Great people and good prices. Coming back forsure. Great open area, they play good music and use awesome coals/flavors", "author": "Suki K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Awesome place! Great environment, good music, workers are friendly, guaranteed good time! Yakoub is amazing great guy and great place! Coming back forsure!", "author": "Farah A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-13", "description": "I think smoking at home would worth more than coming down to this stupid place. Very disappointed with the behavior of the staff and how disrespectful they were to us. This is my first and last time coming here. Very unprofessional place with unprofessional customer service. I think Middle East is the only place to have hookah lounges because they know how to treat their customers and their place is meant for the name of it.", "author": "Shukran R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "Great place! 724Hookah is my favorite hookah lounge. The hookah is served extremely fast, and service is excellent. The employees are so friendly and pay attention to the customers by refilling the coals timely. The spot is extremely chill, sexy, and relaxing. The flavors are amazing but I would say the hookah is a bit pricy.", "author": "Sharara F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "I'm visiting from ATL for a few weeks. The hookah spots out there are lit... with actual spots that have drinks and hookah. \n\nUnfortunately this spot doesn't serve alcohol, but they make it up with their flavors and vibe. \n\nI came in on a Thursday and it was at a great capacity. \n\nIt wasn't too packed, music not too loud... the vibe felt a lot like ATL. \n\nSeriously, this spot is pretty on - point! Good work 724!!\n\nPS: it's right next to the Pizza Hut", "author": "Saket T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-16", "description": "They sat us down in one area then moved us because they wanted to close early without even asking us if we wanted to move. Then the worker dropped a burning coal on my friend while he was moving out hookah. They clearly don't know what they're doing and this is bad customer service. They offered my friend a water, but that doesn't make up for almost burning her. Do better!", "author": "Melissa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "My favorite hookah bar in San Francisco so far.  Highly recommended.  Good flavored as well.", "author": "Duke J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-13", "description": "This place is pretty dark and gloomy, went by on Monday night so I didn't expect to be busy but there were maybe two people in there, Hookah was OK but I make a better one, they don't serve any alcohol which was a bummer, wouldnt go back but I'm a Tourist so I didn't know where to go.", "author": "amal s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Best Hookah Lounge in SF hands down. Make sure when you visit that you ask for Yaqub. He was very hospitable and took care of us. I will be coming back!", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-18", "description": "Came here after I checked Yelp and Yelp makes me sometimes wonder who are these people giving these places 4 star reviews?? It's really nothing to brag about. Don't get fooled by the pic of Chris brown and Steph Curry in the Yelp pics. I'm really trying to figure out what they were even doing in this run down place. It's really dirty looking. You can def see the years of wear and tear. I didn't even stay to try the hookah. Oh and they don't serve drinks major negative", "author": "Brittany N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Excellent hookah, some of the best I've found in the US. It can get busy on weekends and late evening, so come early if you want a slower vibe.  Props to Sabrina and Yaqub for great service and hookah mixes.", "author": "Mack S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Really the only place to smoke Hokkah in SF. The places on haight and ashbury are for the hipsters (dont smoke over there). \n\nOnly place in SF with real authentic middle eastern hookah.\n\nGreat kind and welcoming staff.\n\nThat Russian kid always looks out and takes care of you\n\nBEST HOOKAH IN SF!", "author": "Wesam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "The best Hookah place in SF. I've been coming here for over 2 years now. I always work while smoking. The service is simply amazing. The staff is friendly. They love working in this place which makes it a fun  place to be in.\n\nYaaqoub, Osman, Marco (working one day a week now sadly), and Miguel are the best. They make the best hookah flavors and are just a pleasure to be around. Yaaqoub is super passionate about what he does and experimenting with ice and other flavors. He makes this place alive!\n\nSimply, 5 stars.", "author": "Mohammad A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Hookah's great. Lights are groovy. They give you the options of a ring that makes the hookah last longer and ice to keep it smooth. Cool flavor selection too.", "author": "Tanik J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Honestly i came back for the second time and the customer service was phenominal. they are really attentive, cater to you and are really friendly. the best of all of the workers there is OS! He is funny and friendly, really relatable. The Music is pumping and theres a lot of flavors. Its a really chill spot, strongly reccomend this place, and if you do ask for OS!", "author": "Andy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "This hookah lounge is one of the best lounges in the Bay Area and I highly recommend it! Great customer service never have to ask for coals", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Service is great! Oz and Marvin are great employees and really know how to give optimal service to customers! They were so helpful and very nice! I felt so welcomed and I'll most definitely be visiting this hookah spot again! Venue is very low key and relaxing...Liquor store right next door is very convenient too!", "author": "Solove N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "Good vibes and good music. All around great, hookah and service couldn't get much better!", "author": "Trevor H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "My friends and I were visiting from New York and some from Los Angeles. We found this spot on Yelp and it was great. OS was amazing and really catered to us and made us feel at home. Will recommend and will visit again when I'm back in the area!", "author": "Yinet C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-04", "description": "I was really disappointed at the service at this place.  I've been to many different hookah spots  with my friends and they are regulars.  We would normally get a hookah for $15 and last night they tried to charge me $120 for 3 hookahs, 4 waters and a can of coke??!!!!! When I argued with the guy that I usually pay $15, he didn't have an explanation other than we raised the price to $35/head.  And all he kept asking was that if I was a student he would take off $2.  At the end he brought it down to $78.\n\nAll I can say is wtf - from $15 for a hookah to $35???!! Not cool at all.  They kick you out and let their friends in - and they don't really care about proper business etiquette.", "author": "Amena E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Their lemon mint hookah was phenomenal! The owner was super accommodating, and helpful with our visit!", "author": "Kae G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-30", "description": "Good place to to hangout on Friday night. Good costumer service here, try the mango flavor. My \nonly negative part is the music videos playing all you see is bullshit music now these days, put the real stuff back on like tupac, biggie smalls, andre nickatina, mac dre etc. All i see is girls half naked and bad rappers not even making since at all.", "author": "Priscilla G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Osman and yacom were so awesome! They let us stay later and gave us amazing service with a great discount. Thisnplace is awesome...highly recommend!", "author": "Saloni M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Zach is so awesome! He got us a good deal and the best customer service\nI wouldn't go anywhere else\nI love this place!", "author": "Azzi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "Good hooka for sure. The workers are really nice and friendly. I recommend this place if your looking to smoke bomb hooka.", "author": "Sanaz T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "This place is good to just sit down and chill.\nOne of the worker with the tattoos that sereved in the military for a bit,he needs a raise! Such a great customer service, always checking on us for coals.... deff coming back", "author": "Ela N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Ryan was an awesome host. Our hookah died really quickly and he gave us a free refill since we hadn't been smoking long. A+ place, highly recommend it. Best hookah in SF!!", "author": "Nic D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-15", "description": "Pros:\n-Shisha was good\n\nCons:\n-no coal refills\n-This place looked NOTHING like the photos! They rearranged the furniture?  Got more furniture? IDFK! It just didnt look like the nice photos on yelp\n-The place felt really sketch. Saw someone walk out with a baby in a car seat before my friend and I went in.\n\nWon't be coming back", "author": "Rose G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-30", "description": "Nothing special. The hookah and flavors were doable. Service didn't really exist - they weren't even that busy, but perhaps were still understaffed. The outside seemed a bit sketch but I gave it a shot and went in with some friends. Yup, inside was pretty seedy too. Definitely would also be a much better place if they had better ventilation. I still prefer venues with an outdoor patio option. It was still an okay time with my friends, though I was counting down the minutes until we could get out of there.\n\nThe music videos they were playing were entertaining though.", "author": "Shanise M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-23", "description": "Place was very filthy, considering it was in the tenderloin. The place has been neglected since the furniture and even walls has damaged holes and cracks and seem to have never been wiped down. Even though it was dark, you can still see that this place wasn't well maintained. The service was decent since they didn't charge us for bottled waters but I left not enjoying the experience at all. They didn't serve alcohol and felt that they could've done more considering it was $35 for an hour of using the hooka. The flavor that we got was rose with lemon mint and it made me more dizzy than relaxed. Most likely, not going back.", "author": "Nikki T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "This is an authentic spot. No fluffy customer service. You know what you want and they get it for ya, that's it. Love flavor is the best! They served wine and beer.", "author": "Hutch K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "No frills place and they serve no food, but really great hooka and customer service was outstanding- we called 15 min before closing time asking If they could take us in- sure thing they said- and once we arrived they made us bomb ass double apple hooka:) Steven, our server was so sweet and all smiles, definitely a great asset to this place, \nwe def we ll be back! best hooka ever hands down.", "author": "Liza B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Visiting SF and this place had the best reviews and rightfully so! Great hookah, friendly staff, ambience was not as intimate as I usually prefer but overall no complaints. I ordered the double apple/mint and the guy making the bowl asked what ratio I'd prefer in the mix. Would definitely return next time I'm in SF!", "author": "Brit L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-31", "description": "I'm visiting from Texas on Halloween weekend. I've been to many hookah spots in the US and internationally, and this has to be the 2nd worst one I've been to. \n\nFirst, it looks nothing like pictures which means to me that maybe it has gone down in quality since folks have been here. \n\nSecond, we are all crammed in on leather sofas in a dark not-very-well ventilated room that is the hookah bar. Whatever happened to tables and private seating like a restaurant? \n\nThird, the kids they got working at the counter are a little snappy and distracted by friends who come in instead of attending to their paying customers. We asked if we needed to seat ourselves and the kid snapped back \"I'll sit you after we finish our transaction.\" So we finished the transaction and right after he started talking to one of his friends, ignored us for about 2 minutes and then I had to ask again if we could be seated, because half of the place is roped off for VIP I guess? \n\nForth, the 2 of us ordered a hookah about 10 minutes before a group that came in after us and they received theirs before ours. Strange. \n\nFifth, we ordered a mix flavor of peach/rose/lemon and we were served something with mint. And when I went to ask about it, they asked me if I ordered a completely different flavor. After getting the second one, it tastes like lemon /peach and...you guessed it: mint!\n\nI'm not a picky person when it comes to my establishments of entertainment. I mean, I've been to a hole in the wall in Bali but this place- not so bueno.  \n\nI give it a one based on the proximity to our hotel. The only reason we are still here attempting to smoke our hookah is because we paid for it and I don't think we'll be able to get a refund. I normally don't like to give bad reviews but there weren't enough good things to say about this place.", "author": "Monique M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Really cool place! They're open late and the owner (I think he's the owner) is very friendly.", "author": "Yas T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-23", "description": "Worst Bar i've been to. Hookah doesnt taste. Paid 35 for nothing! Place looks dirty and Cheaib. Wouldnt recommend to go there by night because the area seems very dangerous", "author": "Amin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "Hookah was great, service was great. The prices are comparable to other places in the area.  There was no cover charge to get in. I will come back here next time I'm in the city.", "author": "Christina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "Fantastic hookah, cool environment, and great staff -- Osman was making sure we had everything we needed. Definitely ask for the paan hookah, that's way tastier than all the fruity/minty stuff.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "Its a great place to sit, relax and have a nice chat. Just chill and hookah. They are prompt in their service and are willing to take care of you. Best to come on weekdays as it gets more lit, crowded and loud on Friday and Saturday. If that's you're into then come and get hype though, great place to bring a date.", "author": "Carlos V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "I'm not an avid hookah smoker because  I care about my precious lungs, but I do smoke once or twice a year when I'm out with friends. This place had some of the smoothest hookah I'd smoked (one of my friends who also smokes frequently agreed). \n\nI personally think the prices are pretty reasonable. The service was also good.", "author": "Deepti N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-09", "description": "If I could give them less than 1 star I would! They don't refill your coals. The coals were very small and if asked for a refill they took coals from other ppl hookah to put on the hookah your smoking on! The staff has bad customer service and the music service was horrible! They only played Mexican music! The place was very small considering other hookah lounges I've been too! \n\nBut I will say you will feel a little buzzed off of their hookah! Like they put alcohol in their water so that was a plus! Other than that I do not recommend anyone to try this place especially if it's your first time!", "author": "Chenia J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "In general, it's a very good place for smoking hookah! Hookah is nice, they have different flavors, good arabic atmosphere (with music), but they don't sell alcohol, it's getting cold there sometimes and sometimes this place is swarming! \nBUT for us it's the best place in SF (we tried to find a good hookah place in SF and we found it)", "author": "Ilia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "Having been used to the open-air outdoor hookah bars in DC, initially, this place's dark, smoky interior was a bit of a turn-off, but after getting used to it, I've really come to enjoy 724.\n\nTheir hookah is very smooth due to the natural coconut charcoals they used (unlike other places which will use the horrible-for-you quick-lights) and coal service is excellent. The downside is that they don't serve alcohol, but if you're looking for a buzz there are plenty of bars in the area.\n\nAlways a good crowd on the weekends, and great music/atmosphere for chilling out with a friend or two. I go nearly every other weekend, and I expect I'll continue doing so (until I get my own hookah at home).", "author": "Ananya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "I've been coming here for over a year now for about 5 nights a week! Osman and Yaqub are awesome! They make awesome hookahs and are really responsive to customer requests. If you're in SF and want hookah it's the place to be.", "author": "James O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "This place was legit! Came on a tuesday night and had the best service on top of a great hookah flavor. Osman is a real one! Definitely worth checking this place out.", "author": "Zee H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-29", "description": "Unreasonably priced. Not worth the money. Service was slow. Seated very badly. Had to pay extra if we wanted to sit in a so called \"VIP\" area which really wasn't so VIP. Don't waste your money here.", "author": "Marten P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-03", "description": "I will keep it nice and short, service is horrible. Place is small and crowded!! There is only one bathroom for both men and women..! It's really filthy. \nWe ordered two hookahs and we didn't like one of them, it was too harsh. We asked him to cancel it but he came back with another hookah claiming it was free!!! Either way we barely touched it..!! Such a liar, he charged us for both and made us pay $65 for 2 hookahs and did I mention we didn't even drink water..!! It's is outrageously expensive, I feel like they just wanna make money and don't care for the long term. We were 4 agreeing to never go back, I mean $65 just for hookah is beyond ridiculous!!!! And the guy argued with me that he has to charge for 2 even though we didn't smoke one of them, pretty much he forced us to pay for both!!! Very disappointing experience..", "author": "Mari S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-12", "description": "This much was much like every other hookah place I had been to--dimly lit, loud music, lounge chairs. We ordered the double apple which tasted a lot like licorice (which sounds gross) but it wasn't too bad. Service was friendly and overall, it was a relaxing time.", "author": "Hye Eun C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-24", "description": "Came here tonight with a few friends for the first time. Osmon gave us a great spot and was really helpful deciding on tobacco flavors. Great music and vibe!", "author": "Alexandria G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "The best hookah lounge in SF hands down!!!\nThey are fast and efficient and the atmosphere is great. You get a mixed crowd and it's a fun place to be at with family and friends. It's also known for well known basketball players coming to show their support!!", "author": "Howa Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "Greatest hookah and the service is outstanding. Everybody should try this place at least once.", "author": "Mohammad Shoayb B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Great Service. Amazing hookahs. Osman is the man, A+ service! Thanks for a great night out on my birthday!!", "author": "Noor A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-07", "description": "This place is waaaaay expensive. And the way they base their prices are dumb. I went with a party of 4 people and they charge you for every extra person after 2 people EVEN if you are not smoking! Wtf! You basically are paying to sit on their furniture. Not only are the hookahs here 4 times the price of a regular hookah bar, the ambiance is so lame. I think they were trying to go for a club feel, but the place is just full of a bunch of barley legals trying to look like they are older cool people, it's actual pretty hilarious. \nAlso, they really try to pack everyone in tightly and you end up awkwardly sitting next to a bunch of strangers...which you could probably talk to and be friends with if the music wasn't so loud. I'd rather go to fog city hookah, their place is huge!! Not to mention cheap cheap yummy hookah and they don't charge per person!", "author": "Aiko R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "Best service ever!  Yaqub is always friendly and gives the best service !!! love this place", "author": "Raya D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-06", "description": "Really very nice and attentive staff. The person who took our order, Osman, was super sweet and checked in on us often (but not to the extent where we felt uncomfortable). Their hookahs are quite smooth, but I think we chose the wrong flavor (ambrosia, lemon mint & white gummy). They also offer the glass hookahs which are a bit more expensive, but worth it in my opinion. It can get quite packed so if you're planning on going during the weekend, I would suggest arriving before 11!", "author": "Julia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "This place is lit. Dope atmosphere, great music, and the hookahs were bomb. Osman over there hooked me up and made sure me and my group were taken care of.", "author": "Ellias H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "Finally have time to write a review for this place. Came in on Friday, my god was this place packed. I thought no in hell way would I get a seat for me and my two friends. Walked in and walked to the front register and talked to a man name Ozman. By far the best hookah employee I have ever dealt with. He had a great customer service, went out of his way to find us a seat. Although it was so busy, not once did I felt I was being ignored or forgotten. He checked up on us on a regular basis. I felt very welcomed. The hookah was really good also, and the price was good. Definitely recommend this place, money well spent.", "author": "Daud M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "I'm from San Jose and 724Hookah beats all the lounges here. The ambience was perfect for a hookah session. Decors were nice and clean. The person managing our hookah bowl checked up on us regularly and made sure the hits were clean, smooth and thick.", "author": "David V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Can't touch coals! kinda annoying,\nHookah Quality great, theses guys know what they are doing.", "author": "Mohamed A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-20", "description": "I came here last night and enjoyed it. We arrived at 8pm and got a booth in the corner and ordered Moroccan mint tea and water. We chose lemon mint/strawberry to smoke. \n\nI like this hookah spot because the smoke is light and fresh. It doesn't make me dizzy or nausea like other hookah places and I can literally smoke it for hours. \n \n There are plenty of seats and a great variety of music that they play.", "author": "Court S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "My husband and I were in town for a wedding and needed a good place to relax after a very busy day and this place was PERFECT! Marcos treated us great, gave us a discount for it being our first time in the city, and was very attentive to us the entire time. Very fair price compared to the MANY hookah lounges we have visited across the country. I HIGHLY recommend this place and we will definitely visit the next time we are in the city!", "author": "Kourtney A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-10", "description": "I haven't hookah'd since right after college so it was like a blast from the past.  We got 2 hookahs, and the guy at the counter was super nice and helpful.  Made the experience very pleasant.  The place was empty when we got there but it was right when it opened, probably not prime hookah-ing time.\n\nIt's easy to miss, the sign on the door looks like they're part of the pizza hut next door, but if you venture in, you'll be pleasantly surprised.  They have a nice selection of flavors and are attentive to your needs.", "author": "Tu T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-13", "description": "Horrible Experience! This place screams scam, there are no prices on the menu or anywhere! After having 2 hookahs and 5 waters with 5 people, the price was originally $98, I then complained my way down to $73. The attendant totally was making up the price as he went along, it was a complete scam. He was winking at me as he told me he was giving me the neighbors + student + first timer discount. I highly discourage anyone from going here.", "author": "Brad R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "First time, definitely coming back. Chill atmosphere, good music. Employees very helpful if you need anything.", "author": "Jo E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-09", "description": "Poor customer service, guy at the register completely out of it, got the wrong order, hookah was descent!!!", "author": "Karl H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "Good spot. Gets crowded at times but the staff will normally try to make room for you to sit and squeeze in. also prices arent bad. $50bucks for two hookahs and 2 flavors not the worst pricing", "author": "Alonzo T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Best hookah I've had in a while... lemon mint all the way.. I'll be back next time I'm in San Francisco!", "author": "Lefty E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "First time here, good hookah, great service. Took care of us as family and the tea is on point too. Small cozy and chill vibe.", "author": "Dawood M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-13", "description": "Hookah is a decent price ($25) and you are able to mix flavors for no additional price. If you are looking to have a private session, you can make your own reservation. I decided to come on a Wednesday night and the turn out was decent. The only downside is they do not serve alcohol and it is not BYOB. Other than that, still good spot to chill with friends.", "author": "Anthony J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "Updating review to 5 stars since the staff has consistently been attentive and sweet. I'm a regular and always have a good time. Also, ask them about the best flavor mixes (they may not already be on the menu).", "author": "Irina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "Yaqub (manager I believe) is such a great employee! His customer service is one of a kind. Honestly whenever me and my boyfriend go there we pretty much have gone there because of him. As being regular hookah smokers we can definitely tell the difference between a good bowl and a bad bowl and his are pretty good. This place gets four stars just because of him. As far as the cleanliness of the place it needs a lot of work. The bathrooms are really bad and the floors need to be cleaned. If the owners clean up a little bit this place can have much more potential.", "author": "G A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "This is one of the very best hookah places in Bay Area!!! Great hookah! Great service! Comfortable sitting! Good music! Definitely coming back!!!", "author": "Evgenia K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-12", "description": "They took 20 min to get us our hookah and when we got it the flavor was weak. It didn't smoke at all. Their customer service was good though so that made it a little better.", "author": "Soraya F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Angelo, Michael, and Eilene are very accomadating here! They are super attentive, making sure you have a great experience, and that the hookah is up to par! I definitely recommend this place, if not for the chill atmoshphere and great music, for the awesome service!", "author": "Gabriela M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "Hookah is the best in SF and Steven is amazing with a awesome smile that makes you come back every week!", "author": "Quynhu T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-29", "description": "Too crowded. Not enough room. The coal took forever to come out. We had to leave after just 30 minutes of smoking because it was burnt. They made us move like 3 times, so we just got fed up and left. Do not go on the weekends. Pretty bad experience.", "author": "Shivam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-21", "description": "I don't have much to say about 724. Simply put, this place has a rather relaxing atmosphere, and a respectable assortment of flavors. The staff is super friendly and attentive. Prices are reasonable. \n\nMaybe I'll be back.\n\nOne more thing. My friend and I had a difficult time finding 724 and we walked right by it multiple times. What can I say? The sign outside said \"Cigarettes Cheaper\"", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "Came to this lounge on 12/11 for a friends bday. Was hesitant about coming because hookah in other lounges gave me a migraine, well not this hookah lounge. The guy at the front register, I think his name is Osman suggested a flavor that was fruity and sweet. The hookah hit so well, and tasted amazing. Osman was very nice to us, he had sparklers for my friends bday and his customer service was perfect. My friends hookah was harsh and he came by and we asked for a refill but he suggested us not to get a refill and that he will fix it, all he did was blew in it and it was smooth like it just started. Thank you guys for the great service.", "author": "Bryan I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "They were nice and kept coming around to check if everything was okay. Our hookah wasn't hitting right at first and they came and fixed it for us. The atmosphere was comfortable and the you can really taste the flavor and it was fresh(guava mint)", "author": "Sophia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Steven made the best hookah for my friend and I. It was  great. They changed our coals often. The music was cool. I don't know why they played so much Indian music though. If they wanted to be \"culturally diverse\" they should have played more than one cultures music. But overall, the hookah was great.", "author": "Anahit J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-02", "description": "Asked price for Hookah (apple mint) + coke + mint tea was $37 + $200 (special seating!!). We didn't see any special seating, so he discounted the seating to $50 (since it is our first time). We still don't know why to pay extra $50 since all seatings look alike. We end up paying $37 which is still little exaggerated, but hookah is good though. And we sit wherever we wanted. Mix Arabic and western music in background, 50+ costumers in and average age ~25", "author": "Nadia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "Came here last night with my cousin and sister. They had some really nice flavours. Angelo was helping us out,  he was awesome. Everyone was really attentive and we had great customer service. Definitely coming back. We loved it!", "author": "Brittany H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "Ive only been here twice. But this is probably the only hookah lounge I'd go to an would totally recommend it to friends. The music is usually chill; sometimes ethnic and sometimes modern day r&b artists. (First time was totally a Drake night)\n\nI think the first flavor we had was Sex on the Beach and it was smooth! I used to have asthma and it's hard to inhale any time of smoke but this was alright after a few hits. \n\nToday we tried the white gummy and it had a fruit, yet, minty flavor to it. Not bad. Still wanting to try more flavored tho! \n\nThe pro's is that it stays open late and you can usually just get situated and attended to right away. Seeing that it's a family owned business and the OG's come in brings a slight grin to my face. You go uncle! \n\nOverall, this is a great place to hang with friends after dinner. Good atmosphere, people, music, and no drama. It's not crowded, and all the employees are very respectful. I will def come back next time. :)", "author": "Sadia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "Osman was very nice and took care of us. Nice place, friendly and good prices. They are not far from the union square and for tourists like us it was easy to find and walk there.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "Must go! Best hookah you can find in the city! Im a huge hookah smoker and been to every lounge in the bay area! 724 by far has to be my favorite! The place has amazing hookah and the service is by far an A++! The place is always packed! Guaranteed to have a good time!", "author": "Shakib S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "Good service and music and atmosphere. Ira a good place to unwind especially after a long day or night at after work", "author": "Bayea J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "This is the only hookah lounge I go to when I'm in the San Francisco area! The customer service has always been great. The very last time we went they served khalil mamon hookahs, which is an automatic +1 for me because I believe they hit the best out of any hookah. I highly suggest it to other people into hookah. The inside was set up pretty cool and the person in charge of the charcoal checked up on us a couple of times while we were there.", "author": "Kiana R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-31", "description": "Fuck this place now! Went here for 2 previous NYE's & no whack ass cover charge. This NYE 2014,\" turning 2015, there's a $10 cover charge. Went to \"Nile Cafe\" on Jones & Geary instead. They're located right down the street. Sad thing is, my 1st time in SF I went to Nile Cafe. My 2nd & 3rd time in SF for NYE 2013 & 2014 I went to 24/7 Hookah Lounge but I guess I'm back at Nile Hookah on Jones & Geary for 2015.", "author": "Josh B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-08", "description": "The music is so loud here. Conversations with old friends was almost impossible. I mustve walked out sounding like Screech from Saved by the Bell after straining my voice for 2 hours. \n\nI checked in on Yelp and the check-in came with a 50% off refill. I tried to redeem the refill and the guy asked me to show my Yelp review first. I told him \"hell no. I review AFTER my visit,\" then he told me he'd hook us up with something special. Our refill was exactly the same flavor as the last flavor we ordered. The hookah burns off really quickly and the price is steep for the amount of time it lasts. I don't even know how much things cost here because my friend who bought the first round said he paid $19 then our friends who joined us later said they had to pay a $25 fee just to join us. The place is located in the sketch neighborhood of SF and the workers here are no different. Now I see why there are so many 5 star reviews..", "author": "Cheryl Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-14", "description": "Place is pretty cool the hookah was good the downsides are it's kinda small so there's not much privacy, it's a little hard to find if you've never been here before as there is no sign. Another thing was the music they had playing was mostly in another language I'm not familiar with maybe punjabee I'm guessing. Which is fine but it took away from the experience for me.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Good hookah !!! Yaqub was the guy that helped me out had a good experience here. great staff they play music videos on tv screens threw out the whole place wich is good! and they sell soft beverages aswell if you get thirsty. Gets busy on weekends and week days are more slower and mellowed. keep up the good work guys!", "author": "Bariska Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Awesome service! Steven was really nice and friendly. Totally recommend coming here. It's very calming place to come relax with friends. I will most definitely be coming here again :)", "author": "Vanessa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "Excellent customer service. Always a great atmosphere when I come. My favorite places to come in the city.", "author": "Monique M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "To be honest, this is the best hookah spot ever. I went to many different hookah spots, but hands down this is the best. I'm always here like every other day. \n\nThe hookahs are always on point. Can't complain about it. I always get white gummy and lemon mint or tell the workers there to surprise me sometimes. They never disappoint me and it doesn't give me a fat ass headache. \n\nAll the workers there are so friendly, they're always checking up on you constantly, Making sure that you're getting the best service from them. They may even crack some jokes with you while they're fixing your hookah. They're always wanting the best for their customers. \n\nFriday thru Sunday are mostly their busiest days. If you want to come those days I highly recommend coming early for parking, because you wont find parking on the spot. Trust me. It's a pain in the butt lol. \n\nIf you still haven't hit this spot up, then you're missing out on great quality hookah!", "author": "Sonam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "This is def the place to come if you wanna have a good time !! Marcus was very helpful & professional !! Music is coo & it was the perfect amount of people . Def would recommend this to anyone & everyone", "author": "Taima M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Best hookah lounge in San Francisco. Conveniently located, great music selection, and the service is superior. Osman helped my husband and I the last time we visited and was very accommodating. He's super friendly and made us feel right at home, not to mention his flavor recommendation was perfect !!! If you're looking for a great time out around good people 724 is the place to be.", "author": "Erica J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "It's a good place for having a fun night with friends. They have a good customer service and good hookah, just the parking is kinda hard but worth it", "author": "Dina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "I was stunned by how polite and attentive the staff was when we first walked in! The atmosphere and the vibes in here are awesome. The flavors are incredible. This is my first time here and Im definitely coming back. 5 STAR JOINT FORSURE..", "author": "Gerardo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "There's not a better place to smoke hookah in the city matter fact In the whole bay area than 724... You never know who will show up at any given time", "author": "AJ R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "I'm not from SF, so we came to check this place out and it's really great!! Great music, hookah, and environment. They checked on us and asked how we were doing very promptly. Angelo, a worker, had a whole interesting conversation with us. Definitely wouldn't hesitate to come back.", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "I smoked at 724Hookah two nights in a row, security was super chill and management created a really mellow vibe that was easy to lose track of time while enjoying awesome blends. The music, people, and environment were really cool.\n\nThe whole experience is worth repeating often. Thanks 724Hookah!", "author": "Russell P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "This place was great. The service was excellent. I loev the hookah variety and the ones they have for sale here are dope. They're Gun hookahs..and more. I had trouble accepting this place as a \"cafe\" almost,, because they didn't serve food or alcoholic drinks (only tea) but apparently it's against the law for them? I dont know why but I think this place would benefit wayyy more as a restaurant/hookah lounge style place than a cafe.\n\nThe guy that worked there was super nice he came and chatted with us for a while.\n\nThe venue is amazing. The front makes it almost unnoticeable, it has large tinted windows and a dark door. Pretty fancy inside, nice decorations. The floors could be clear where the carpet area was. But I'm still trying to look at this as a cafe. It's hard! They hooked it up here !!! I loved it.", "author": "Karina G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-08", "description": "Someone said it was the nicest hookah lounge in SF...  I thought it was just okay. \n\nI was visiting from SD and wanted to hookah and relax. The place was pretty packed on Thursday night... mostly younger crowds. They don't check IDs or serve any alcohol, maybe that explains why. They do have some soft drinks for sale.\n\nI never went to any hookah bar where I order at the counter and have to pay every time I order instead of having an open tab. This place could be great for a big group so you don't have to worry about splitting a tab. \n\nOnce it died down a little,  the service was better, and hookah wasn't bad (they use fumari). \n\nI guess not too bad to satisfy my hookah cravings, but nothing really impressed me. I really wish they had some beer. I felt like it was place where underage people hang out.\n\nMake sure to check-in. $5 refill is well worth it when the first one is $19.", "author": "Ann H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "This hookah place is really chill and delicious and the flavors are amazing will definitely go back here without a doubt.", "author": "Tanzeem K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-15", "description": "Worst place ever ! They made us buy 2 overpriced hookahs because we were a group of 5. $30 a hookah. The place is definitely not well maintained, holes on the wall and crappy paint. We got our coals changed once and our hookah was burning the whole time. When we asked for tongs to flip the coals ourselves they looked at us weird and asked us to leave an ID. Definitely worst service ever !", "author": "Mannyy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "Best hookah lounge in San Francisco! Lounge is super chill, great vibe with excellent staff. Owners are great guys, the crowd here is chill and know how to turn up. Ask for Marco to make you the best bowl you'll smoke all night!", "author": "Vladimir K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-19", "description": "Good hookah, attentive staff. Otherwise... maybe just not the right atmosphere for me? Everyone has a vibe they like, and this isn't mine. Somehow hookah and blaring rap music don't fit for me. It feels like a dance club inside, with the black lights and loud music. Not conducive for 'chill' which is, for me, what hookah is all about. It's also a bit sketchy outside, beggars sitting around the door, hard to find (I had to call after we walked past it twice and still never found it as it just has a logo that is a combination of the numbers 7/2/4 but not very evidently.) Anyway, not my preference, but if you don't mind all of that... like I said, hookah and service were both good.", "author": "Andrya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "I was on google looking for a Hookah Bar and came across 724. Reviews looked great thought I would swing by. \n\nFirst off the service is impeccable and the atmosphere is awesome. They have a huge variety of flavors. I had the guava and lemon mint and it was amazing. The guys here know what they are doing and they check on you to assure everything is good with your hookah. \n\nDefinitely recommend you stop by and check it out. They do private parties also and plenty of street parking also. I'll be back for sure....", "author": "Vikas S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-26", "description": "Good atmosphere for a chill group. The house blend hookah was delicious and hit really really well. \n\nLike most things in the Tenderloin, it's a bit gritty once you get inside. Non-descript on the outside, black glass. Busy on a Saturday night, playing hip-hop music videos after 9. Staff was cool, if a little pushy that we \"squeeze in\" so they could fit more groups in. High school crowd taking turns going outside to hit their $10 handle of vodka.  Not a problem, but you've been warned.", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "Probably one of the best if not THE best hookah lounges in SF! Service is great, the employees are so friendly, and the hookah is amazing! Such a variety of different flavors to choose from, and coals are always going around! I like that they have tv's so people can enjoy music videos while with their friends. It's pretty spacious, also very up beat and lively. Oh & shout out to the guy with tattoos on the cashier for being so nice & helpful, always seating us right away and attending to all the customers needs! and hooking it up with bomb hookah mixes! :p", "author": "Dandoun J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "i went to 724hookah with a few colleagues after dinner and found it to be relaxing with a good vibe. there were plenty of seats and each area had plenty of its own space, which really helped keep things pleasant.\n\ni believe there were about 10-15 flavors to choose from, so we settled on vanilla so it would not be too sweet. i thought it was excellent, it was really smooth, lightly flavored, and never got harsh. the tips fit well on the end of the pipe, and we did not really have to tap or adjust the charcoal to keep the hookah going.\n\nat one point i started to get very thirsty, and it took a while until anyone came over so i could ask for some water (they were actually out of sparkling). but, this is not necessarily a negative, since in a hookah lounge i don't necessarily want a ton of interaction from waitstaff.", "author": "Jamie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "The Kings mix is the way to go! This place is a great to hang out and chill with friends while listening to hella dope music in the background.", "author": "Jeffrey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "Well they have awesome magician acts out of no where. Blew my mind. And they let me leave for 2p minutes because I had stuff to do and saved my seat. They have music videos iv never seen before. Great music by the way. And staff is way chill!", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Amazing hookah, great customer service, such a great relaxing place, lighting is on point too. Great experience.", "author": "Zara K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "I really like the hookah taste in here but coal service is not enough and also employee is really friendly sometimes arabic music can be annoying that they play everyday but generally best place in SF", "author": "İsmail Cem E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "Great place! Very friendly staff and the hookah was on point. Not going to any other hookah place again", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-25", "description": "Awesome place... Tourist from san diego and they made me feel comfortable and staff is friendly... Prices are fair and great decor. \n\nWhen hookha tasted burnt i was gonna buy another bowl but the guy said \" let me fix it for you\" saved me 10 dollars. \n\nOnly down side they ran out of ice hose bit whatever still a great hookha lounge walking distance from downtown.", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "Great place to chill! Came on a night when my friends and I wanted to hangout but weren't energetic enough for a club/bar. Very relaxing with good music and hookah flavors. I've never been to a hookah place where the smoke hits so thick and smooth; I was very impressed and had a lot of fun attempting tricks haha!", "author": "Kimmy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-17", "description": "This place was alright. My friend took me here after a giants game and I had come here another time after happy hour. It is kinda ghetto and is going to be playing hip hop videos all day. There are other places that are better in the city for hookah.", "author": "Varun Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-16", "description": "Best hookah ever in Bay Area . Nice service and lovely place.\n\nAnytime I come here with friends I feel great of the services that they provide. The owner so friendly and always welcoming everyone.\n\nBest for group or birthday party.", "author": "Omran I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-03", "description": "We had some decent hookah here, but honestly the place looked super sketch before walking in. Also, I like being able to have a conversation with friends over hookah, but the music was so loud I could barely think. Probably won't be coming back here.", "author": "Linet O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "Immediately serviced and seated. My hookah was there before I even had a chance to collect my thoughts. I definitely recommend these guys over any other lounge in San Francisco. They have a respectable VIP location and the staff is amiable and will take care of your needs. Highly recommend.", "author": "Ali W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "Great place to be, chill atmosphere. Watermelon + mint flavor is amazing. Worth a try.", "author": "Badal K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-03", "description": "Thursday night, 10 PM - party of 4. \n\nI've visited this spot a few times before, so I kind of knew what to expect.  The high level overview:\n\n-Music is too loud and you end up shouting over it.  Maybe this depends on where you sit.  I'm usually sitting in left front corner of the place, so maybe the right side is better with acoustics.  \n-Music choice is also not what I prefer, but it's not horrible.  Top 40 with an urban influence...sometimes the music videos are playing on the TVs.  Again not my first choice and certainly not at the volume it's at, but you come here for the conversation anyway (which is more difficult when the music is blasting, making it a con, not a pro)\n-Service is very hit or miss.  I've been here when they replace the coals more than you need, and this time was the complete opposite of that - I had to get up once to ask for the metal tongs, and then again when our coals had almost burned out to ask for a change.  This is not cool in a hookah bar - I should never be requesting a coal change.  \n-Drinks are nothing special - would be nice to have a fresh juice or a smoothie rather than just basic tea and soda choices.  \n-I've had good hookah flavors and bad ones - the 'special combo' with 2 flavors mixed together was actually one of the highlights because of the uniqueness of it. \n\nI'll come back here because it's within 15 minutes walk from my place, and it's $15-20 per hookah (enough for 2 people for 2 hours).  I wish there were better options, but this one suffices as the baseline option for late night hookah.", "author": "Ben K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-20", "description": "Came on a Saturday night. \n\nGood vibe, good music..mostly rap I like that they play music videos on the tv. Very spacious and an ideal layout for a lounge. The seats were a little hard. \n\nCan't complain about the customer service. We were checked on multiple times to make sure we didn't need coals or anything. \n\nNow for the main reason why I came in..the hookah..\n\nI really want to give this place 5 stars because they use Fumari shisha (I work at the Fumari lounge in SD). However..I ordered white peach and Lemon mint, a pipe I've had numerous times and I couldn't taste the lemon mint or white peach which to me seems like they do not clean their hookahs. I looked at the hose and found some residue from other flavors. Bowls were big but a little over packed. After getting additional coals, the bowl just tasted burnt.\n\nThese are all things can easily be fixed..I'd gladly come back if they were.", "author": "Drake R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-30", "description": "Great hookah lounge, very low profile looking from the outside.\n\nCustomer service is good, music is upbeat, everything is chill.\n\nTheir shisha tastes great and their hookah setups are legit.", "author": "Aaron K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-10", "description": "PRAISEJESUSHALLELUJAH\n(or should I say \"Praise be to Allah?\" is that racist? I don't care, I have a pipe in my mouth)\n\nThere is one hookah bar left in the city that does it RIGHT.\nNile cafe made an executive decision to suck sometime in the past year, Pride, Kan Zaman just don't take care of their pipes the way they should, but these guys are setting the new bar. If you want good, smooth, long-lasting hookah, come here. I'm also pretty sure they're selling Al-Fakhr shisha, which gets you niiiiiiice and mellow. I hope they never realize they could be charging more for it, because $15 for that big pipe between two people is deal.\n\nWe went there on a Friday night. It appears on the weekend this place turns into something of a club (loud hip hop/Arabic music, low lights, slightly cheesy curtains). But the hookah came out very fast, and the coal guys were checking on us every 10-15 minutes. The pipes lasted over an hour. The cushions are comfy, and lighting is flattering. I might not take a date here on a Fri/Sat unless you're sure they're into Arabic tunes blasting their ear drums, but otherwise...\n\n...I found Graceland. I hope this review doesn't jinx it.", "author": "Diana H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "Good music, great atmosphere. Definitely enjoyed my first time at a hookah joint here in SF!", "author": "Rachelle P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Had great time fresh coals all the time friendly staff. Great place to chill will go back again.", "author": "Jason D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "Hella good hookah been coming here since they opened. Good workers and great customer service. Really chill spot to smoke and hang out", "author": "Chris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-27", "description": "The  place is hella nice, the  staff is  really nice. Gave me a water for a good review and that's what I'll do XD seriously  is a good spot. Worth every penny.", "author": "Azuro P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-13", "description": "I'm a long way from arabi. I'm a long way from SoCal. Wiz khalifa for an hour. Service is bad. No table. Tea served on the floor with no bag. No mint. I miss my arabi peoples. 35 bucks for this.", "author": "Khalid N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-12", "description": "After reading all the great reviews about this hookah lounge, I told my friends we have to check it out when we are out in the city. Well, I ended up going to this place this past Saturday at around 8:30pm and to be honest, the interior is nice but I was not too happy with the hookah itself. I think I would have had a better time if the coals were brought out a bit faster as it seems like the coals kept dying out for us. Also, while the staff in terms of personality are nice, they were slow with our request and kept getting busy dancing with the patrons. \n\nThis is def. not going to be my last time coming here since I always believe in giving each and every place a second chance... so lets hope they do a better job next time around!", "author": "Imran M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-15", "description": "This place is hella coo, I been coming here every week since the first time and we come from on the other side of the bay... These guys are cool and the Saturday vibe is hella chill with all the rap music they play. My type if place!", "author": "LPthang S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-24", "description": "This place is so lowkey, you can't tell it's a hookah lounge from the outside. Inside it's pretty chill and lowkey as well, dim-lit, good vibes. They play really good music, and the hookahs are really good too. Service is nice. They only have drinks, no food. You can order for delivery from a nearby Mediterranean place but you can't eat on there after 9 or 10. I feel like a lot of the people who come here are regulars of some degree. Overall, it's a good experience.", "author": "Kat D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "Super friendly staff, great flavors, and they play all hip-hop!!! Why have I not found this place sooner. #ayyy", "author": "Nehika M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-27", "description": "The hookah was really good but the service was suck. I ask the guy to fix it and took him about 30 min to come.", "author": "Maged N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Really friendly staff and great hookah. Nice hope in the wall hookah lounge with different assortment of flavors\n Good hookah lounge for san francisco", "author": "Danyel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-25", "description": "First time coming here with a few friends on a Thursday night. There were 6 of us and we only paid $30! \n\nAtmosphere was nice, and good music also. They have tvs and they were playing ridiculousness at the time. Staff were nice and friendly and were checking up on us frequently if we needed our coals changed. \n\nDefinitely recommend this place and willing to come back! :)", "author": "Kat S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-13", "description": "Customer service is lacking. My friends and I waited for a good 20 minutes for our hookah and saw that people who had come after us get theirs first. The hookah I had with friends was watermelon mint and it was pretty rough. The gentlemen who were sitting next to us had a gummy bear flavor and let us have it upon them leaving. Their hookah was waaayyy smoother than ours. Seeing as this is one of the few places left in the city for hookah I wasn't too surprised it got packed on a Saturday night.", "author": "Shana Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "This is my favorite hookah lounge in the city. Osmon is always killing it with the service, packing great bowls and keeping the coals coming.", "author": "Richard A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-02", "description": "Hookah is decent exept their house mix i wouldnt recommend it and they take a long time to change your coals but the place is nice and the workers are not rude like other places", "author": "Sunshine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-25", "description": "I have been interested in the hookah sub-culture for the past three years in San Francisco and I have been seeking a lounge that strikes a balance between something comfortable and something boisterous. I am happy to say that 724 is that happy medium. \n\nOpening at 6, it sets it at the perfect time for a relaxing, and de-stressing,   after work smoke. Or, going a mere three-four hours after opening, it becomes a very fun and very welcoming hotbed of community and culture--usually Thursday, Friday, and Saturday.\n\nThe staff is knowledgable and friendly and the hookah flavors are fantastic, particularly ambrosia; white gummi, ambrosia citrus mint; orange; and rose mint. The staff are a friendly bunch of guys who always strike up genuine conversations with customers while never forgetting tasks at hand. \n\nThe price range is great and the ability to choose cash OR card trumps the neighboring lounges in convenience. I recommend this hookah lounge to anyone who is an experienced hookah smoker or someone who is curious or wants to get his/her night out going with something that isn't the usual per-game.", "author": "Cody R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "Great place for hookah. Chill, good music, good atmosphere!\nThey're mixes are amazing! I always ask for what they think is the best! It totally works out!\nI go here a lot! \nBut if you want to take a picture of yourself smoking, you know for Instagram lol, it's dark. You have to use flash, which is sometimes a bummer for me LOL", "author": "Eman A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "It's a moderate place. \n\nIt was SO hard to find, we came to a door blacked out in curtains which made me and my best kind of skeptical since it looked like a \"Oriental massage parlor\" haha It's right next to the pizza hut on Geary St.\n\nIt's $15 for a hookah and it lasted about 1.5 hour of us(two) just sitting there lounging around continuously hitting it. \n\nWe got the house blend with lemon mint which tasted awesome! The mint helps it run smooth when it starts to get harsh.\n\nOverall, give this place a try. Didnt give them a 5 star because the seating area wasn't private enough, the seats arent that comfortable.", "author": "Josie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-29", "description": "Tried this place out for the first time this past Friday.  It was ... ok.  Not terrible, not fabulous.  I'd probably go back if I was in the area in need of something to do.  Here are my pros and cons:\n\nPROS:\n-  Good price ($15 per hookah)\n-  Nice seating arrangement, couches were pretty comfy.  The square cushion seat things didn't look as comfy but I didn't try them.\n-  Good variety of flavors\n\nCONS:\n-  It was freezing inside this place!  At first I thought it was so cold because the door was open, but I looked and it seemed to be closed, so I'm not sure what the deal was.  My friends and I would have had a much better time if we weren't freezing our asses off.\n-  The music was way too loud.  I can understand music being that loud at a club where people are dancing, but nobody was dancing here. Everyone was sitting in groups, trying to relax and talk with their friends.  It was really hard to hear our conversations with the music that loud.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-23", "description": "Chill spot! Great for a hookah and tea. I suggest their special flavors. Great customer service!", "author": "Jamir N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "Favorite kick it spot. Great staff great hookah. Good music. You gotta come here if your in San Francisco", "author": "bahar e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-13", "description": "Anyone who has smoked real shisha before would not come to this place. \nThey use chemical charcoals which ruin the flavor of the shisha. They also mix their masoul (fruit tabacco) with their hookahs which means you don't get the true flavor of your shisha. I did enoy their Morrocan tea but not much else. The staff are friendly and they try hard to please their customers.", "author": "Peyton L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "This guys know how to make perfect hookahs, good music. One of the good hookah places in the city", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-23", "description": "My boyfriend an I come here a lot. It's a chill place of you wanna relax an smoke it up. If I lived closer I'd come here more! Love it good vibes here! Friendly staff an decently priced!", "author": "Jesse G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "the hookah was good here and the service was good except the coals were set more in the middle than on the side but they did come check on them.  the only other thing is the atmosphere isn't like pictured. looks like it can use some touch ups in the place but again hookah was good and decently priced.", "author": "Natasha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-12", "description": "This hookah is smooth!!!  Although mine got quite a bit of ash coming up.  It's a bit more than I would have liked, but I ha d a great time so I'm willing to pay a bit more than I expected for awesome atmosphere and music.\n\nI had white peach with two friends and it was very nice.  They also have candy at the front which is a nice touch, but no bubbles(boo!)  \n\nThis lounge is nice and large so you don't feel super cramped(yay!) and Zach plays the best music...\"ahhh Habibi!\"", "author": "Kat D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-28", "description": "This was our first experience here and this will be our last. The \"manager\" was rude (the one with glasses). They have no business card to get a hold of the owner. They give no refunds if a guest is unsatisfied. What kind of customer service is that?", "author": "Ciara A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-05", "description": "Lalaloooooveee this place! Totally beats every hookah joint I've been to in SF. I have been loyal to Cairo Nights but this is by far the best one. Reasons why:\n\n-Good, friendly, and fast service\n-Flavors are amaaaaazing!! Get #12 from the house special menu. Comes with strawberry, watermelon, and mint, I think. It's delicious\n-Ambiance is cool; Lighting isn't too dark\n-Spacious with lots of places to sit\n-They play Arabic music! If you're lucky, you'll get to see customers dance!\n\nJust a warning, if you're looking for or expecting a huge ass sign that says \"724 Hookah\" on the storefront, you won't find it. It says \"Cheap Cigarettes\" or something like that on it. Why it has that instead of what it's called is beyond me. The easiest way to locate this spot is to remember that it is right next to a Pizza Hut. The one that has its windows covered with billowing curtains. Yep, that's the one.\n\nGrab all your friends, take a seat, and puff, puff, pass! :)", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Customer service is really great! Good service and great tasting hookah! Recommend this hookah bar to everyone. Great location too!!!", "author": "Zasha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-25", "description": "724 music was very good, played hip hop which I enjoyed. But needs a little ventilation in that place.", "author": "Matthew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "This place is legit. I took my date on a first date here and we are having so much fun. I love hookah. It was her first and she's loving it. We smoked the lemon mint and we probably will smoke more!", "author": "Kamuran K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-12", "description": "Kind of a funny place as far as hookah lounges go.  I like the gangster rap videos... But I just prefer to smoke outdoors. Good place. Vibe is dope. Just make sure you like hip hop", "author": "James T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-04", "description": "Best hookah lounge in SF... great ambiance, great service, great staff, great flavors and the BEST HOOKAHS! They also play cool videos and good music. I love this place, they keep coming by with coals and the hookah hits real smooth. Did I mention they have great prices?!!! \n\nThank you 724 hookah for giving me such a great experience.", "author": "Azizi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "Best hookah place in SF! I had so much fun tonight !! I will definitely be coming back again and the service was great! Everyone was so friendly! Met some awesome people", "author": "Yasmine P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "Stopped by last night for their grand opening, and these guys are cool as f***!!!!\nSeriously......great service, delicious hookah, cool music, and a friendly, good looking crowd. Perfect spot for you to chill and get a hookah while waiting for your friends to show up so you guys can go hit the clubs......and perfect spot to sober up and finish up the night after clubbin....I think they're open til 3am, at least on weekends.", "author": "Ocee D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-15", "description": "Good hookah. Good atmosphere. Nice staff.  Little expensive but what isn't in San Francisco.", "author": "Kate C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-03", "description": "Was not that impressed with this Shisha bar. Was expecting better from San Fran, atmosphere was dingy and seedy with fowl bathrooms and the shisha itself was poor quality.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-15", "description": "Terrible service. They did not replace our coals once. They put us write by the door where the wind kept coming back and even though we asked the security to keep the door closed 3 times it was open for the most part. The hookahs are over priced, about $30-$40 for only 1 refill?!?!?!? None of the staff pays attention to you unless you nag them constantly until they listen. I am willing to spend a lot on hookah, usually in the $80s range if the quality is right, I don't care much about the price. But this is a place that takes the fun out of hookah.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "I had the best time and the hookah was great.  Customer service awesome.  We ended up sitting for hours beat atmosphere! !!!", "author": "Felyca W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "I stumbled upon this hookah bar while in the city. The service was great and the flavors were really good. They played great music and if I am ever in town this is the hookah bar of my choice", "author": "Frank S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "Chill lounge, Awesome staff, and great flavors. The atmosphere of the place is really fantastic and once you get here you'll definitely want to come back. I haven't been to any good hookah lounges lately but this is by far the best one I've been too. I would recommend this for anyone who wants to come alone or even if you bring a big group. It's busy, that's for sure but that just proves how great the place is. 5 star lounge for sure.", "author": "Katherine S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-11", "description": "No ventilation, everything under smoke, wll never come again there is more better places near bei", "author": "Süleyman A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "Good hookah, best service", "author": "Thang P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "The staff is amazing.  It was my first time to this hookah bar from Sacramento.  I have never had service so fast. Sammy was so nice and Frank as well", "author": "Mya M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-30", "description": "Chill spot in the middle of an eclectic neighborhood. Service was super fast/friendly.", "author": "Kristophe C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-11", "description": "Do not go here. I called and this stupid guy answers and i say \"hey is it ok if i come by and buy shisha ill be coming around 1:45\" and they close at 2am. And he said yes for sure. Its 1:30 i go there early and im right in front of it and it says closed. dumb idiot worker", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "I love this place. It only took me one time to know that this was the vibe I was looking for. Staff is friendly and patient. They'll sit down and chat with you especially if you're a regular. I'd recommend this spot to anyone looking to start or cap off their night life", "author": "Kofi F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "Coming from New Jersey, this place is super cheap. You walk in tell them what you want pay for the hookah and find a seat. Very simple. If your looking for something super fancy and high end it's not here. Great place to get your hookah session and listen to some music. We enjoyed !", "author": "Emilio L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "Amazing customer service and fantastic hookah!!! The owner and workers.hung out with us the whole time we were here and very nice, professional and fun to talk to. Highly recomend. Great music and ambiance", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-19", "description": "Solid place to come chill and enjoy some hookah with a group, definitely recommend it!", "author": "Jose L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-28", "description": "Went here a month ago and thought it was decent. Service on the slow side. Live entertainment was great.hookah was decent. Music was a little loud though. And it was pretty dark. I understand the ambience concept but I would of like a little better lighting and the music turned down a bit. It felt more like a club than lounge.", "author": "Brother B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "Great place awesome environment. The only play to go for good hookah in the city. Definitely a customer for life. Good job. Music playing awesome vibes", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-02", "description": "Pricey and not the best hookah place in San Francisco.", "author": "Edwin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-15", "description": "great atmosphere and nice vibes an good customer service!  i honestly can say it's nice pricing an just a good place to relax an smoke", "author": "Sky S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "Smoked hookah there last night and was perfectly fine with me and my new girlfriend, visited San Rafael for just one night and liked it. San Rafael is the good city to visit.", "author": "Steven J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-22", "description": "Very relaxed atmosphere! Hookah was pretty good too. Also bought a house mix to go. i will definitely come back here upon my next trip to the area.", "author": "Nicoya V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "First timer ! Great service , we were greeted in a polite manner and serviced greatly.  Great hooka , try the speical mix number 5 !", "author": "Alliyah B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-14", "description": "It looked better online. The place is not very big and the music is a bit to loud.  Hookahs were good but they mAke you get one for every two people even if not everybody is going to smoke.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "I was impressed with this place.  The atmosphere was right for a hookah joint.  Low key, quiet, it was a place you could totally hang out with your friends and actually hear the things they say.  \n\nThe owner seemed super friendly and way on top of things.  He was able to keep track of everyone in the room and keep all the hookahs flowing.  He wasn't the sort to hide out behind a counter or anything either.  He would sit down and chat when things slowed down a bit for taking care of all the hookahs.", "author": "Leah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Great place. Fast service, nice staff calm vibe and good music would recommend for sure.", "author": "Courtney B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "Best hookah lounge ever! Can't be anybetter! It's a ONE BIG ROOM! Great music! Awesome DJ! Nice atmosphere! Great! If you haven't been to this spot then you are missing out Big Time! There's a big variety of hookah flavors it's so awesome! And it's a great place to hang out with friends!", "author": "Mahmoud A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "Newcomers from Southern California. Not used to hookah being so expensive but Marcus hooked it up with a sick group deal! Thanks for the good looks bruh.", "author": "Trevor D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "I only found two good hookah places during my stay in San Francisco and this was one of them. When I visit a new place, I need hookah and luckily I found a spot to smoke hookah, suprisingly there isn't that many in San Fransisco. But I must say this is the best hookah in the area! The atmosphere is really nice and their hookah pulls so good. The prices for the hookah are really good too and even with the refill for the hookah. This is the only hookah place that I ever been to that has rose as a flavor and I can't find that anywhere else but here. I love mixing rose lemon mint and their guava lemon mint is also a really nice mix. The best part of this place is their staff, by far one of the friendliest staffs I ever met, especially the one young guy working here. Great person to converse with and very cultured, you don't find that at many places. I know for a fact that this will be my go to hookah place for when I officially move out here!", "author": "Omed B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-28", "description": "First time here. Chill place with really good hookah. Good vibe and music. I especially like the service. Definitely coming again.", "author": "Rasha M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-13", "description": "Waste of time! As i hookah lover hookah was okay but the place is so dirty and unprofessional. And there are those signs that they say if you vomit they will charge 35$ cleaning fee, if you remove the clay head you will be asked to leave and etc. employees are sitting and smoking hookah, hookah hoses are worst quality ever they look like a straw sticked to a garden hose... !", "author": "Araz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "Best hookah spot in sf. Awesome staff and great quality hookah. The vibe and atmosphere are great. Great music and cool atmosphere. If you're looking for an awesome spot in the city to smoke some hookah I highly recommend 724. Ask for Greek Gorilla, he's the best!  Ask for the Greek gorilla mix it's the best flavor.", "author": "Robhy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-30", "description": "724 hookah in SF interesting place. Yelp reviews are completely wrong in my opinion. This lounge is 3 stars at most. The hookah isn't that bad but that's not the only thing that makes a good lounge. Definitely not worth the price. This place is crazy small compared to most lounges in San Jose. The bowls seem to be pack pretty good but they put to much water and use small disposable hoses making the draw kinda tight. The pictures are of the old location. It no longer looks that way.", "author": "Antonio I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-14", "description": "It seems like I caught this place on a bad night. A friend and I decided to check this place out on a Monday night. The place seemed poorly maintained with trash remaining on the tables and no toilet paper in the bathrooms. We paid $20 for our guava white gummy bear and then sat and waited about 10 minutes for our coals and then had to hunt down a staff to get tongs because they seemed to like to either hang out in the back or sit at one of the booths with their friends and smoke. After we'd smoked our coals down to little pea size lumps, I ask the staff who was hanging out with his friends if we could get new coals and he bluntly tells me they're coming. 20 minutes later.. They don't come, so I wave down the guy who hides behind the counter. The coals come after about another 10 minutes from a guy who has his earphones in and hood pulled over his head, looking like he hates his job. The same process happens about two more times until we finally decided we had wasted enough time.", "author": "Krista C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "This place has a chill environment and is definitely enjoyable after a long day. I feel very relaxed and comfortable here and the prices are very good for how much you get. Highly recommend 724Hookah.", "author": "Alexis D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-15", "description": "Went there last week with friends. Prices are good and they use good shisha. Place is chill. Everything good but hot tea is too expensive. Otherwise a 5 star place.", "author": "Kourosh F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-16", "description": "I don't know why I keep doing this to myself, there are no good hookah bars in SF and this one is just like every other hookah bar. Not cozy, to top it all off, their hookah was terrible, we had to leave to a different hookah bar after 10 minutes", "author": "Anna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "This place was disguised well, but we found it.  Had a great time smoking some great hookah with some good friends.", "author": "Jon F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "A great experience is what this place is! Very comfortable environment super chill staff and really bomb hookah flavors with a huge variety. Will definitely be here again!!!", "author": "La L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-21", "description": "Didn't expect place to be so good. Must visit after getting drunk in bar late night.", "author": "Malhar T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-30", "description": "I've been here several times.  I mostly visit during the week but have also stopped by on the weekend.  I just started working in the FiDi so I usually swing by after work for their happy hour pricing.  \n\nWeekdays are pretty quiet before 8.  The weekends are a little more rowdy - lots of high school aged kids.  I've seen a fight break out which is really strange for a hookah lounge.. especially since they don't serve alcohol.  \n\nStaff is pretty friendly (hence the 2 stars) but the experience overall is consistently poor.  I've tried several different flavors and none of them hit very well.  Service is slow and inconsistent - I constantly have to get up and request changing of coals, problems with the hookah, etc.  I don't mind the staff socializing with friends and smoking but please don't let that detract from your attentiveness!\n\nI think I've had enough.  This place gets points for location (meaning it's easy to get to on the bus... the neighborhood is pretty questionable) and friendliness.. but every time I come I feel like I've wasted my money.  No thanks!", "author": "Brittany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "Hard to find but worth to do it :) Best shisha in the city! I mean it!", "author": "Nikolay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "I love this place!!! Great atmosphere and good music. Great service overall and Adel offered us some awesome mixes.", "author": "Andy Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-28", "description": "Tonight was the worst hookah experience I've encountered. The hookah was very harsh and hard to smoke. When I asked for someone to come over and check it for me they \"forgot\" to come. So I had to get up and ask again. After seating there for so long with a bad experience, I decided to just get a refund and leave. This place does not give refunds and they don't have a sign or anything to inform you. Also, I like to smoke it with a ice tip so it would be more smooth but they ran out. But my friends next to me had a ice tip but it wasn't frozen correctly. This place is really unorganized and shitty quality. Anyways the \"manager\" with the glasses is rude and very unprofessional. The other guy who claimed to be the next thing close to a \"manager\" was very nice and understanding of the situation. We ended up not getting our refund but received a voucher for next time.. But why would we come again, after having a bad experience. If you want cheap & shitty hookah and bad service this the place to go!!", "author": "Christy N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-27", "description": "It was okay. Friendly service but the door was part way open making it super cold. We did have to wait for fresh coals. And they kept asking  if we wanted our pic on their FB, after saying no several times. I wouldn't come back again and definitely not the best hooka", "author": "Jacklyn B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-09", "description": "I generally hate to criticize a business, I just make a point not to patronize businesses that provide poor service.  However, in this case, I feel the need to warn everyone away from this place for issues ranging from incredibly slow service, broken hookahs with chewed off mouthpieces (gross!), and the cherry on top, sketchy hidden costs imposed after-the-fact (such as a minimum # of hookahs for a group and clean-up fees).  \n\nAfter being passed over for a seat multiple times, then waiting over 30 minutes for 2 hookahs, we finally received our hookahs (one of which had the aforementioned mouthpiece that was so mangled we couldn't fit the plastic piece into it).  \n\nOnly a few minutes later, we were informed by our server, then by the owner (!) that we would now have to buy one more hookah because we were a large group despite the fact that the table next to us had the same number of people and hookahs.  This started the general impression that we were arbitrarily being hit with price hikes.  Also, being pestered with servers every few minutes, after being ignored for so long was pretty obnoxious.\n\nThis only continued as a friend of ours started feeling very light-headed and moved to go outside.  He tried to make it outside, but started to vomit as he went out the door.  Without hesitation, our server approached him and tried to hit him up for a cleaning fee of $25 dollars.  We brushed past the server to follow our friend outside and make sure he was ok. Another employee came out several minutes later and informed us it was now $30 for clean up.\n\nIn addition to the bro-y, cheap club ambiance, the repeated poor service, rude treatment, and price-hiking ensure that I won't be back. Steer clear of this place!", "author": "Jillian C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-26", "description": "A cool, chill place. My husband and I wanted to do the whole hookah experience and this lounge was the closest one we could find. We were hesitant at first because of the location and it looks a bit intimidating on the outside. However, once you go in, it's a decent establishment. The crowd is laid back and the staff is super friendly. I would come back again if I was in the area.", "author": "Alyssa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-26", "description": "Ordered a mix of orange and vanilla not much flavor also they put way too much water in the hookah and it does not drag smoothly. The lounge is decorated great and the music playing is awesome. Staff is very knowledgable. Just tighten up your hookah making", "author": "Eugene K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "I went to this place when I was visiting the city and I really enjoyed it. I've been to other hookah places and nothing compares to this place. Great crowd and great hookah. Nice music most of the time. Definitely will be coming back every time I'm in the city.", "author": "Jarrell P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "I haven't been here since August, but when I did go it was very fun! I really like the decor inside, and everything is very well spaced out. The hookah was pretty good here. The only negative is the location, it is literally in one of the worst parts of town. But overall good atmosphere, good music, good hookah.", "author": "Nikita K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-08", "description": "Outrageous how rude and disrespectful the \"manager\" is here. Place sucks period. Saw the reviews figured I'd give it a shot, walk in no hostess to seat you, just a dude in the back with glasses couldn't be more  than 23 yrs old and clearly overwhelmed. He was helpful in recommending a decent flavor and the hookah was ok, but everything was a complete disaster from there. You pay up front for what you order, i paid for a Moroccan Tea to go with my hookah which never came. How long does it take to prepare a tea? I asked where the restroom was same ass clown manager points to the back but said someone was using it so i need to wait. Fine no problem, i wait about 10 min see the door slightly open so i decide to knock and not burst in. \"WHAT!!!!!!!!\" Jerk Manager screams from inside the bathroom.... I respond back i didn't realize someone was in here the door is open??? No answer i go back to my table still no tea...... WTF man i leave 1 dollar for the poor guys replacing coals and have to work for that bozo and walked out. F this place do yourself a favor and don't go.", "author": "Melvin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "Hands down The Best hookah lounge in SF. Great service and nice owners who are not spending all their time trying to get in your underwear if you know what I mean. I tried to bring a group to Cairo nights but the owner was rude and their hookahs are some kind of electronic stone smoke, so forget them...", "author": "Florence M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-13", "description": "Thank you, thank you so much Zach and Adul for letting me celebrate my birthday in your wonder establishment this Saturday. These two guys and their entire staff took outstanding good care of me and all my guest (and there were a lot of us).  Don't think I've ever been accommodated by an establishment like this before. From the time I called 724 Hookah and spoke to Adul I felt like I was in good hands. You were willing to work with me on everything I wanted to have a successful birthday and made sure we had a good time. Don't think I ever heard a \"No We Can't Do That\" from you guys.\n \nEVERYONE really enjoyed themselves and raved how yummy and smooth the flavors of the hookahs were. We ordered at least seven different flavored Hookahs which everyone rotated. My favorite was a house special that had guava and rose in it. One of your staff members came around very often to make sure our coals were always hot. We never had to ask. \n\nI was also blown away of how nicely you set up a private area for us to hold my guest in. There was enough space to fit us all. The atmosphere was very nice and chill. The music was great!!! I think I learned a few new dance steps from your regular guests too\nWe are looking forward to coming back very soon. I really appreciate you guys for making everything run so smoothly for us. This will be a birthday to remember for a long time!!!", "author": "Carolyn D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-07", "description": "I don't really know what to say but the hookah it's not just about the place that you set on it's also about the taste that you enjoy it and takes you far away from where you at .!! \nBut this hookah sucks  \nI'll just give these three starts for the guy that try to fix it for me but he did not but he at least smile for me lol that doesn't really worth the $19 that I paid for it cause that's kinda pricy  so I don't really wanna come here anymore", "author": "Laith A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-20", "description": "Nice chill spot, good selection of music, and not that expensive!", "author": "Jesus L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-16", "description": "The 12 is spot on... I have to agree with every review I've seen so far, and the people working were really attentive to our coals. After an hour and a half of four people splitting just one flavor, it was still hitting exactly the same as it was when we first started. There isn't much seating, but they some how work it out so every person can fit in the lounge. I would for sure come back because this place is really cool and has its own great style.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-20", "description": "i haven't had hookah since travelling to egypt and turkey several years ago. initially, i thought that no hookah bar will beat my past hookah bar experiences in the middle east but 724hookah surprisingly blew me away. \n\nwalking past 724 geary, you would never think that the place was a hookah lounge. the huge sign above the door says \"cigarettes cheaper\" and the windows were covered with sheets. \n\nthe service was fantastic. they had dozens of flavors to choose from and the hookah goes down really really well. my favorite is and has always been the apple mint. they take care of your coals frequently so the hookah never dies; your first puff is identical to your puff an hour later. the prices are very reasonable too!\n\nthis is definitely the place to hang out past midnight. next time my friends are in town, i am totally taking them here!", "author": "The Hangry Chef O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "This is one of the best hookah bars I have ever been to. If you're ever in San Francisco and looking for a place to go this is the place. Their service is incredible and they keep the charcoal coming until you're ready to leave. They have a garret of flavors to choose from.  It's 15 dollars for a hookah, which is a great price. The atmosphere is relaxing and chill. Definitely my go to place.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-21", "description": "This is a true hidden gem of a hookah bar. \n\nAt first glance, it would be easy to pass by 724 without noticing it.  The sign above 724 that says \"Cigarettes Cheaper\" and the Pizza Hut next door give the passerby the impression that there is nothing of interest here.\n\nOnce inside, however, both novice hookah-partakers and connoisseurs alike can appreciate this hole-in-the-wall treasure.  The staff was immediately welcoming and courteous, and the comfortable couches, soft lighting, and internationally eclectic music all lend themselves to an overall relaxing atmosphere.\n\nAnother plus is 724 has many flavors to choose from, both classic and experimental.  We tried a combination of cherry and vanilla (delicious!)  along with the triple apple (didn't even know that existed!)\n\nThis is definitely a good spot to go if you are seeking a nice staff, upbeat and friendly crowd, and a place to smoke hookah comfortably.", "author": "Steph S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-08", "description": "This place is very hard to find and had the worst service ever.. I had to ask for charcoal over five times! That honestly got me irritated. I constantly go to hookah lounges to relax and enjoy myself I did not have a good time here! I've never had to actually get up from my seat to ask for charcoal at any lounge regardless of how busy they are. The restrooms were filthy and has a really bad oder. Overall my experience had horrible. Won't come back here again :(", "author": "Cash M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "Great hookah and friendly service. They made my visit very pleasant and I defiantly plan on returning here more often. Kudos to you gentleman!", "author": "Adelina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-24", "description": "Such a chill hookah lounge in the CITY!  Great prices, plenty of room for big parties and best of all, they're OPEN LATE so it's always easy to swing by if you're out clubbing.", "author": "Combiz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-26", "description": "This place is awesome! It's well decorated, comfortable, not expensive at all and the staff are GREAT! They are nice and they make you feel right at home!", "author": "Chad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-06", "description": "Got Bad Service from a Different Hookah bar (marrakech) and Decided to take my Business elsewhere, I wound up at 724 Hookah Not only did they have Room for my 8 person group but they had GREAT Service Before we even walked in the door, it did'nt stop there though we intended to stay for 1-2 hours by 3A.M. we had to force ourselves to leave. all around they Have a great NO B.S. Environment with great service and to Top it all Off at the end of the night when it was time to pay the bill it was a fraction of the price we would have spent at the other hookah bar. An all around great experience i Fully recommend them i know they have a customer for life with me.", "author": "Devin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "stays open late and serves good quality hookahs. It's my new go-to place for hookah", "author": "Azin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-18", "description": "Good service and good hookahs. The music was cool. Mixed crowd cozy. 724 was recommended by yelp. Easy walk from the hotel.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Excellent service and great hookahs... Love what they've done with the place and all the new renovations. Highly recommend stopping by here to grab a hookah and enjoy the positive energy", "author": "Chris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-13", "description": "I'm from LA and hookah here is pretty on point so I was a little worried about going to a hookah spot in SF. It's a nice little spot, the employees are all friendly and they were very attentive with the coals. I also liked it cause its freakin cheap! $15 for hookah, how could you go wrong with that. I'll be back there the next time I visit SF.", "author": "Diana A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "This spot is absolutely amazing and a great addition to the city! Not only are the hookahs top shelf in quality of tobacco, but the ambiance is one that I've never seen before as far as a hookah lounge is concerned. The decor is elegant with warm red tones throughout, the seats are very comfortable. There are two large flat screens on each side of the two surrounding walls where they often play music videos. The music is AWESOME! The service, VERY IMPRESSIVE given they are just getting started. The Grand Opening was just this past saturday when I was there and the turnout was unbelievable! They were extremely busy but seemed to cater to everyone as much as possible and as equally as possible and accomodated everyone that came through that door. People seemed to truly enjoy the place, and not feel rushed even as busy as it was. Great location and I definitely will be going back on a regular basis along with my friends! I KNOW this place is going to be a huge success! Way to go!", "author": "ST1223 T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "My friend and I wanted to hookah after dinner and drinks. This place is nearby to Union Square (as a reference point). It's a cute spot, nice vibe, has good music and super friendly staff! I'll be back!", "author": "Anna G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-01", "description": "It's good, spaciously.  Only wish they served drinks here with the hookahs.  Compared to hookah bars in New York, this one is meh...", "author": "Alyse S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "This place is the best shisha lounge I've been to in the United States. Great vibe, great music and the staff is second to none. They take care of their customers! Ask for Adel, he's \"the man\"", "author": "Joshua s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-20", "description": "some friends and i were in the city for the day and decided to try out one of their hookah spots. this was the nearest one to where we were staying so we decided to give it a shot. we were seated quickly and our hookah came to the table quickly but that was the only positive. we ordered premium blend flavors and after 4 or 5 pulls from the hookah the tobacco was awful! it tasted burnt and very low quality. it was making us gag after just a few hits. we got up and left without even finishing. 2 stars for having a decent interior and keeping the seats and tables cleaned.", "author": "Al J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-29", "description": "This place is terrible!!!!!! The worst hookah lounge I have ever been to...  I have been to many across the country and this is by faaaaaaar the worst.   Extremely filthy and way over priced.    Took them 30 min to get the hookah out.... Bathrooms were out of order..  hookah looked like it had never been cleaned.  Very very very disappointed..  not sure how they have slipped through with the health department .", "author": "SJ V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-26", "description": "If you are interested in; Overpacked, burned bowls, bad music on repeat and  a bunch of sweaty nasties jam packed into one spot, this is the place for you. Girls, beware, creepy men lurk around every corner aging from 18-85. Hookahs taste dirty, and metallic. They just keep putting coals, on top of coals, which gives off an unflattering harsh flavor.", "author": "Anon A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "Had a great time, there was just two of us. The hookah was super clean and smooth. Only complaint is it was a bit cold in there and the music was way too loud.", "author": "Heidi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "Just reiterating what everyone else has said. Hookah, in the city? This is the spot! The place is chillspot on weekdays and becomes amazing on the weekends. A great atmosphere for anyone (people who want to sit and talk and people who want to get up and dance). The music is good and unlike many other places in the city it loud enough to enjoy but not too loud as to be intrusive in peoples conversations.  The hookahs are very clean and flavors are very nice. The gem of this place, that distinguishes it from EVERY other hookah place in the city ... is the service. The guys running the place know how to run a business and they treat their customers no less than their friends. You'll see the owners going around introducing themselves and making sure if everything is good.  Im a regular there and on a name basis with these guys... not once have I had a complaint about this place. Anytime there is something wrong with the hookah, they make it a priority to fix it.   And I've been to every hookah bar in the city (and bay area), this place ranks at the top.  The only other place where I've seen as good a service is SmokeThis is SJ (which I think is partially owned by the same person.. so go figure)\n\nThey carry the usual fruity mixes people love, and they also have Nakhla's Double Apple that us old arab fogies love.\n\nThe prices are very reasonable, very nice decor, seats are plentiful - and they dont play musical chairs with their customers... moving people around to seat others, they always try to accommodate. Free WiFi and TVs. Without being too much of an advertisement, its a place where you gotta try it to believe it!", "author": "F S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "Great service great hookah definitely coming back ! Great place to come and relax with friends. Will recommend this to everyone I know.", "author": "Jay M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-31", "description": "First time here and the hookah was subpar. It was thin and got harsh very quickly. The staff did not replace the coals in a timely manner and it was not milky enough to do any tricks.", "author": "Leilani O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-26", "description": "724Hookah has become one of my favorite neighborhood spots for relaxing with friends and catching up on life while relaxing.  The staff is insanely nice and makes it feel like family.  The hookahs are great and at a great price.  I enjoy coming here in the early evenings when they first open and it's pretty quiet.  They do get packed and become more of a social space later at night on the weekends, which is also pretty awesome.", "author": "Miguel V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-19", "description": "Dope place with great ambience, weekends are best for your visit day. A variety of different hookah flavors are bound to satisfy your smoking craves.", "author": "Gerson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "Best hookah lounge in the bay area!! Service is amazing, the staff is always walking around and checking in making sure the charcoals and flavor is good. Hookahs are clean. Staff is very nice and start conversations, also very knowledgable about the flavors with good recommendations. The place is very spacious, good for big parties and has a warm feeling with red curtains and red walls. They also have two tv's and always playing good music that isn't obnoxiously loud. The owners zaki and abdul are very nice and welcoming, if you ever have an issue they will try their best to fix it. These guys know how to run a business and keep ever happy. Thank you!!", "author": "Viktor M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-25", "description": "Best place ever! Chilliest environment and the guy who helped us gave us a beautiful blend! Stop by if you are in the sf area for a good hookah and a good time", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-01", "description": "My friend did not get in because he lost his ID and had to wait in the car, they will not let you in even if you do look over 25 and my birthday and his birthday week apart and thats a bummer. They make you get 2 hookahs for 5 people. You can mix flavors, I think we got rose and lavender and some fruit flavor and it tasted nice. Sanitary, they give you plastic mouth pieces for the hose. They play music videos on big screens but it is what they want to play.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-10", "description": "hookah was ok . atmospphere was kinda cool. tons of neat little leds . loud music with tv playing but you cant hear it  haha. i wish i could actually listen to the tv instead of reading lips if theyre gunna have a tv they should do music videos", "author": "Cassandra P."}
