{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "It can take some time to get your order, but always worth it. I find it very difficult to walk by and not stop in and get a mocha to go. If you decide to stay they have some of the cheapest beer prices.", "author": "Kari E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-03", "description": "Columbus Cafe is probably a tourist trap but `at least they deliver excellent breakfast sandwiches. When I like to indulge on my cheat days (Just kidding, everyday is a cheat day for me because breakfast is my favorite meal of the day) I go to Columbus and order myself a croissant sandwich and an ice cold chai latte. Who am I kidding, I go here on my lazy mornings because I dread doing dishes from making breakfast because when I make breakfast, I go hard. I should open up a brunch spot for aggressive brunchers cause I make a mean breakfast!\n\nWhen I first had their chai latte, I was immediately impressed. I had it in house and it was beautifully frothy, creamy, and super decadent for chai. They probably used whole milk the first time which it probably why I was so enamored. \n\nThe second time I ordered chai to go and literally the barrista poured milk into a cup and then some pre-made shelf stable chai mix that you can get from the grocery store. Charging patrons $4 for this seems excessive in my opinion because it's little to zero effort or artistry.\n\nFreaking Lombard and it's tourist prices!", "author": "Connie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-12", "description": "Surprising that the north end of Columbus is so devoid of places to hang out or get a drink. Just four or five blocks over toward downtown there are dozens of bars and restaurants buzzing with action.  But not near 901. \n\nSo, 901 is the best of not much. Imagine a bar that crashed into a market / deli and then got halfway through a remodel to make it a coffee shop before stopping in full mash up mode. It's like a pocket knife with tools for a range of purposes but not one done really super well. \n\nThey have 2-3 tables in front where you can sit in warm weather, but even that is pretty underwhelming. \n\nFine in a pinch, but pinch yourself to search a little wider and you'll do better.", "author": "Lanny B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-07", "description": "This place is awful. The bagel doesn't even have any cream cheese on it. It was stale. Basically a stale bagel with thick slices of cucumber on it. Disgusting. And they have terrible service. I am shocked to see this place has a four star rating.", "author": "Beckie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "I had the best BLT with mayo at 901. It was honestly the perfect sandwich. It has a super cute neighborhood vibes.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-09", "description": "I just bought a panini.  I have been sitting here for about an hour.  It is not busy.  There are only two employees, both of whom have interacted with me.  One of them just tried to stop me from using the restroom stating (as the posted signs do) that the restrooms are for customers.  I told him I was one and stated I bought a sandwich and pointed to where he had seen me sitting for the past hour.  He didn't believe me and had to check with the other employee (speaking in Spanish presumably so I wouldn't hear what they said) before allowing me to finally use the restroom.  I have no idea why he stopped me, but I do know he didn't harass a less flamboyant man who went to the restroom before he left. Don't sell food or drinks if you won't let paying customers pee and you insist on treating them like criminals.  This was my second time here.  I won't be back.\n\nAfter I used the restroom I went to the other employee to complain about how I was treated.  He laughed it off, literally laughing at me to my face, and the rude employee kept speaking over me.  Only go here if you have a catheter or colostomy bag and enjoy rude service and mediocre food.", "author": "Clarke F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "Good coffee and pastries !  Friendly service although there was only one person helping at the counter.  Great spot for morning coffee!", "author": "Basem T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "I ordered the Crunchy Tuna sandwich on a panini. It was pretty big, delicious and filling. The place had a cool ambiance and was really clean. The staff was very friendly and patient with us as we looked on the menu trying to decide what to eat. The reason I'm giving it 4 stars is because I don't think it's reasonably priced, it was pretty overpriced. I'm from NYC so I know overpriced, but this seemed over the top. $10 for a panini ? I guess that's San Francisco for you.", "author": "Janice D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-25", "description": "Looking around for something to eat and came across this cafe. At first glance was hesitant because the menu is overwhelming. My wife and I contemplated on what to order and the server was patient with us. I ordered the turkey club and she ordered the crunchy tuna sandwich. We were told if we wanted to make it a panini it would cost an additional $1. The paninis were surprisingly a decent size and actual quite fulfilling. \n\nI ordered the iced tea and their weren't refills. Refills were only for the coffee. This was my only negative comment about this place. The most you'd pay for anything is $10.50\n\nGreat location.", "author": "George D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-30", "description": "Remarkably mediocre food. Usually at this price point and in a larger cafe, their pastries (bagels, croissants) are ordered from a bakery on a daily basis. Here they're ordered from a chain grocery store and kept frozen. Eggs were tastelessly prepared, bacon was atrocious, and egg bacon bagel sandwich doesn't even come with cream cheese so it's as dry as can be.\n\nIn short, only eat here if you have to.", "author": "Theo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "MMMMMMMM!! Delicious, fresh food and amazing coffee!! My son had the panini and said it was the best he ever had! The smoothies were also excellent. Love the personal vibe inside, art for sale in the walls and books to read on the shelves. Exactly the type of place we were looking for this morning!! Thank you for the excellent food and customer service!!!!", "author": "Kristie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "I've lived in the neighborhood for 11 years. The 901 was always been one of my favorite spots. They have an amazing B.L.T.M. and chai latte. I've never had a bad experience here. The staff is great, the service is fast, and they always play the local sports games. I will continue to come here for as long as I'm in the city. I would highly recommend the 901 to anyone in this area.", "author": "Brittany B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-05", "description": "I'm not sure how this place received 4 or more stars.  The ambience was missing tables was old and dirty.  But my waffles was good and a lot more than I wanted to spend.  I ordered the house coffee it was eh, watered down and probably sitting for awhile.  We ate there but charged me for $1 for a second cup?  really?  Staff could be friendlier", "author": "Lanie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-15", "description": "it's a good place to stop for a $3 beer. Especially if you just walked up to the top of Lombard St.", "author": "David F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-19", "description": "The employees here are really rude. I was ready to grab a tea and kill an hour before meeting the rest of my party for a show at Cobb's. But I don't patronize businesses with rude employees. So I left after interacting with the guy at the counter tonight. (Just as well - it was pretty grungy and generic, anyway.)", "author": "H.E. O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-15", "description": "I'd go with 3.5 if that was a choice. Very relaxed environment and a very large menu but by 11 am on a Sunday they were out of many types of bagels and it seemed the clientele had to ask for secondary options several times. \n\nThey were super polite to customers who were visiting internationally and didn't speak perfect English though. \n\nAlso not as cheap as a true local option would be. Food was ready fast at least. \n\nDrink selections (alcoholic, non-alcoholic, shakes, sodas, energy drinks, juices, odwallas, etc was massive.", "author": "David A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-04", "description": "Came here to have a few beers before heading to the comedy club next door.\n\n$2.50 draft beers are a awesome price. They serve food as well but just had drinks here.\n\nSeating is low key and staff is alright.", "author": "Sal M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-20", "description": "901 Columbus Cafe, I don't know if it's  considered a best kept secret around here or not but it's definitely a saving grace for the hungry and thirsty person doing a walking tour around San Francisco. Why? Okay, I'll elaborate.\n\nFrom the outside this place really doesn't look much different than your typical, space-restricted SF cafe except for one thing; a sign that says it has $2 pints everyday.  That's right, $2 pints of beer on draft.  For a place in SF it would probably be acceptable even if it was $2 for some domestic trash beer, but it isn't.   It was like a tractor beam that pulled me in.  \n\nThe $2 beers (at the time) were a choice of  SF's own, Speakeasy Brewing's Big Daddy IPA, Prohibition Ale and Tallulah Extra Pale Ale.  Sure, they might not get an average rating of 4 or higher on BeerAdvocate but at $2 for a pint of craft beer...in SF...on a Saturday, are your really going to argue? I didn't think so.\n\nSo aside from the $2 beers and some pretty cheap bottled offerings, they also make sandwiches, pastries, coffee and other breakfast options here for affordable prices to really round out their function as a cafe.  However, based upon what you've read already, you know what I was here for.  I had to grab a cold one before trekking up to the top of Lombard Street.\n\nThere's still ample seating bot inside and out despite the size of the cafe, which in reality, is pretty decent in size. It isn't the most modern, upscale cafe you'll probably visit in the SF area but the fact of the matter is that it serves it purpose quite well.  Beer, food, wifi, you really can't go wrong here.\n\nIf I found myself walking around SF on any given day and I wanted to grab a few cold beers without breaking the bank, this place can easily be my regular spot.  Easily.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "Came here with my family after we concluded our walking tour of the famous Lombard Street. This place fulfilled all of our picky food desires! I got the Maui Smoothie and a Hummus sandwich, both were exceptional. San Francisco has some delicious eateries, and the 901 Columbus Cafe fits the bill. The service was impressively fast and we were all very happy.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "Perfect place!\nWe stopped here for breakfast on the way from Lombard street to coit tower, and came back on our last day here.\nThe food and coffee are amazingly delicious, high quality and fresh ingredients!\nSuper recommended!", "author": "Yarin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Cute little cafe with good drinks (hot & cold) and their chicken sandwich was excellent! The owners seem to be very involved and keep things clean and running smoothly. We love to get some work done here on the weekends.\n\nIf you're looking for a nice corner cafe to work, eat and have coffee, then this is the right place to be!", "author": "Nadia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "Small and nice coffee shop in one of the most touristy parts of SF. They have a variety of breakfast items, coffees and smoothies. I went with the salmon bagel and it was great, my bf had the breakfast burrito and said it was okay. The only downside is that the service is a bit slow and they only take cash.", "author": "Yéva M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "Stopped in here for lunch as I had seen on Yelp they do soup and that's what I was in the mood for! $4.50 for a cup as I thought a bowl would be too much for me, however I think they gave me a bowl anyway! Tomato ravioli with delicious bread and iced water on tap.\nThe menu looks great and the decor was cool. Not loads of places to sit - many people came in and left because there were no free seats!\nWill definitely return here", "author": "Ellie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "I always seem to find myself stopping here while walking around North Beach on a nice day. I was initially enticed by the $2.50 draft beer sign and outdoor seating. This little cafe has a nice selection of wraps, salads, sandwiches, coffee and pastries. I've tried the falafel wrap, nice and spicy and quite filling with a small side salad. The $2.50 beers offered are all from Speakeasy Ales so you're not just getting some cheap PBR. Also, I think glasses of wine are around $3. Nothing fancy here just a great affordable place in the area to grab a bite and enjoy the outside.", "author": "Kelsey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Great selection of sandwiches and waffles. Also great coffee drinks. I had the El Granada sand which, it had spicy salami, fresh mozzarella and a pesto sauce on sourdough. It was fantastic. They only take cash but otherwise great inexpensive place for good solid food while walking around the city.", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "OMG thank you 901 Columbus Cafe for saving my tummy from what seemed like eternal starvation! Originally, we'd decided on some sourdough at Boudin, but when we were told we'd have to wait 45 minutes, we thought \"nevermind!\"\n\nSo off we go in search of another place. Walking... more walking ... baby screaming ... hurry up and find a place ... oh look that place says $2 drafts ... let me check with Yelp first ... Yelp says OK! ... Let's go! \n\nWe walk up to the counter and place our order. The guy at the counter recommended the wise guy panini, so I went ahead and tried that. The panini was ABSOLUTELY delicious. I loved the large slices of mozzarella! Soooo good! My husband had the pastrami and wasn't too happy with it. He kept complaining about a weird taste, then he took out the lettuce and said that it was the culprit. Needless to say, I felt kinda bad that his meal wasn't as great as mine. \n\nAnd YEP, $2 drafts. Not sure if this is an every day thing, but it was there when we went and we took full advantage. \n\nThe one thing I didn't appreciate quite as much as that delicious mozzarella, was the not-so-friendly guy behind the counter. Seemed annoyed that we were there. Is this a trend in SF?? I'm starting to think so! \n\nAnywho, food was good enough. I'd go back for another panini, or two!", "author": "Joana F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-11", "description": "Service wasn't very nice and cash only....being it at bottom of Lombard street you would think they would at least take Visa...but it's local, cute and quaint!  Obviously love the rainbow lights at the counter- prideful ! The open mic night was a blast and an added special touch. \n\nLocated at bottom of Lombard street- plus!", "author": "Kara K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "YUMMERS!!\n\nWent here on a Saturday afternoon after visiting Lombard Street. \nThere was no line when we got there which we lucked out on because as soon as we sat down to order, a crapload of people entered & formed a decent line.\n\nLove the decor, feels so 'lax & chill.\nThey had the Warriors game playing & a good amount of seating.\n\nYou order at the front & pay (CASH ONLY), they hand you a number & you can either sit inside or outside. They bring the food to you.\n\nI ordered the Sinatra Warp (Vegetarian friendly!) OMG sooooooo yummers!!! A wrap with feta, olives, hummus, and avocados. \n\nFYI, lots of tourist since Lombard street is right there.", "author": "Camille C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "Super cheap draft beers after 5pm. Had the ale and it was light and hoppy. Tiramisu made in house and absolutely delicious. The lady taking our order could smile more, but who could blame her. All these useless tourists pouring in from Lombard being all touristy! Definitely a good place to stop by!", "author": "Thien-Tam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "In my opinion this is best bar/cafe in North Beach. The location is amazing at Lombard & Columbus", "author": "Burt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "901 Columbus Cafe is an awesome spot to enjoy great food and conversation.  My wife and I enjoyed a bite here after checking out Lombard St.  The owner Terik was a great host and offered super suggestions for our trip from San Francisco to San Diego.", "author": "Cordell R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-04", "description": "Tourist hotspot alert! I walked in on quite a busy day (the St. Patty's Parade), but my order was quickly taken, and I had my meal in no time. If you manage to drop in during a clear sunny day, find a seat right in front of the entry way. There is a beautiful view of Coit Tower, which makes the city feel like home. \n\nAs far as the food goes, I had the \"Sinatra\" wrap. It's a healthy take with feta, olives, hummus, and avocados. The tortilla it was wrapped in was very soft and fresh. Although, I wish they had whole grain options (I have to admit I didn't ask, so not sure if they do or don't). It also seemed like they had a full dinner menu? and beers on tap.", "author": "Sarin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "So glad we stopped here. Upbeat, yet relaxing, friendly people, great coffee, great food, fresh pastry. We settled in for the whole morning.", "author": "Danna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "The perfect place to rest in San Francisco because the restaurant is down from Russian Hill on Lombard, close to Fisherman's Wharf, while in North Beach, drink as the cable cars pass.", "author": "Thomas Chase Leo S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-14", "description": "I love this place.\n\nSituated in one of the best neighborhoods in the city - 901 Cafe is a nice, comfortable and quaint establishment. \n\nI enjoy their house coffee here along with their breakfast bagel that includes egg, cheese and bacon. The order of these two things is under $8.  There is outdoor and indoor seating and the servers are completely nice.\n\nIf you're ever in SF, I'd stop by 901 Columbus Cafe. It's right by Lambard Street and on the way to Fisherman's Wharf.", "author": "Trung N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "One of large handful of low key neighborhood places that are pretty low key where you can relax for a beer ($2 drafts 3-6), partake a respectable menu ranging from soup to sandwiches to breakfast. ..or slip into a great coffee and plant your self in a leather chair and chill.\n\nConvenient locale on the way to/from the Wharf and the Financial District.\n\nI always like their cappuccinos.", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-30", "description": "Some people see this as a great secret gem in the area but each time I have gone to this place I have been highly disappointed. The first time I went I ordered a wrap at the register and when I got the wrap it had the only two items I asked not to be on there. It made it inedible. I am not the type of person to return things so I left unsatisfied. \n\nThe second time was the same deal. The register person couldn't understand what I was ordering and then brought me the wrong item again. I can't get over this happening twice and I will not be returning to this establishment. \n\nIt is incredibly expensive for what they offer including lackluster salads and wraps. It is also cash only which it is not worth doing when you could go to many other better cafes in the area. Do yourself a favor and walk up the street to Cafe Sapore for lunch and Roccos for drinks. There are few places I actually refuse to go to and this is one of them.", "author": "Nick R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "$2 draught beers from 4 or 5pm I think? Every day. Instant 5 stars. Although they only have 3 different types available on draught, they are still good and you can't complain for $2! I think the beers available were Prohibition Ale, Big Daddy IPA and Baby Daddy IPA. \n\nThe service was good. The food was great with a large selection. \n\nA relaxed vibe, with chilled out people and some decent tunes makes for a great experience in this cafe. I wish I could have spent more time here!", "author": "Shane R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-10", "description": "Disappointed  in total experience.  Slow and unresponsive  counter guy taking  orders.  Very unfriendly and impersonal plus missed two items that we ordered.  Very slow in getting  food out.  Though  the prices for a \"order at the counter\" place were  way to steep.  Would not recommend. \nBTW. Had no restroom.  Was advised to go across  the  street to another place of business.", "author": "Jim T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "I like to come here for lunch when I'm on break from work nearby. It's pretty fast so you can eat there or take it to go if you really need to. The place is usually playing rock or pop on the radio, so the atmosphere is nice and casual. Plus, the area is mostly families so the people coming by are always great for conversation while waiting for your food. There's plenty of seating for a small place but I do wish they had outdoor seating. As far as the food, I can't say much about their pastries but their sandwiches and paninis are a wonderful treat in the middle of the day!  Definitely stop by!", "author": "Stephanie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-13", "description": "Belgium waffles- yum. Large menu. Couple of 2 top tables on sidewalk. \nCash only, ok prices.", "author": "Tim K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-22", "description": "I've been coming here for a long time now, 15 years. Unfortunately nothing has changed. The tables are disgustingly sticky, the chairs have who knows what on them. In addition the floor is decrepit and dirty. At least they have a tv and a decent bookshelf.  On the plus side the coffee and bagels are good and the staff is usually pretty friendly. In any case this cafe could be so much more than it is, It is in need of a major face lift. One more thing. Tourists sit right outside and smoke. The smoke blows right back in. No thanks.", "author": "david b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-17", "description": "How could I resist a Happy Hour from 5 to 9:45pm everyday!!!  It is more like a Happy Year!!!\n\nThere are $2 pints of local SpeakEasy on tap.  Three to choose from.  I got the white ale or that's what I understood from the guy behind the bar.  Also cash only.  That's a great deal.  I totally love the pint glass... it has eyes on there like the angry birds.  (check my picture)  I would love to steal it but that would be wrong!!!\n\nThis place also has coffee, cake and free wifi. The happy also includes $3 wines!\n\nThis place is everything a coffee shop should be...crammed tables, fake brick paneling, Christmas lights, a window with a note that says, \"Do not open Window seriously!\"...I am starting to sound like Stefan from SNL!!!  If you've never seen the character then you need to and you will probably be laughing at my last comment.  \n\nThey are also rocking U2 in here too.  I love it when a place just puts on a CD and plays the whole thing.  It reminds me of my youth.  You listened to the whole album and you learned to like all 11 songs. Sad part is I have this CD, maybe that's why I'm enjoying it.  Who needs Pandora and Sirrus? \n\nOkay I kind of like this place and would hang here if I lived here!!!  I think the extra alcohol beer is kicking in!!!", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-16", "description": "Stopped in here for some caffeine before Lombard. Not good, messed up my Cafe Breve order and ended up throwing most of it away. \n\nAlso how in the world is this place cash only...", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-17", "description": "Uhm, $2 beers during happy hour, which lasts 5 hours on weekdays? Yes, I will have that, and a little more, please. Decent sandwiches (but lackluster salads) for under $10 (I am partial to the salamocado. I wish it had bacon, but it has salami, fresh basil, lettuce, and cheese. That's already a pretty good combination. There's one couch, and it's perched in front of the small flat screen, so get there and snag a seat early. They show Giants game and other local sports teams, but the majority of people who I see frequent this place are just ordinary folks who want to work or just hang out and enjoy the weather. They even have a printer that prints pages for .75 if you're on a deadline of sorts. Cash only, though, so make sure you hit the ATM, but $2 beers! Come on. That's a win.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "If I'm in North Beach, this is where I want to be. The beers on tap are only $2 or $3 each. It is a steal!\n\nI have only ever had beer here - big surprise. Haha.", "author": "Russell Allen E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-28", "description": "I was staying at a nearby hotel on a recent visit to San Francisco.  I saw a sign hanging above this cafe near my hotel proclaiming \"HAPPY HOUR 5 PM - CLOSE WEEKDAYS 2 PM - CLOSE WEEKENDS $2 BEERS.\"  I thought: \"Surely it's a very small pour?  Surely it's crappy beer?  Or surely there is some other catch?  This is too good to be true!\"\n\nLadies and gentlemen of Yelp, it's true!  They have three different Speakeasy beers on tap, all for $2 each!  You get full pours of them!  (A pint or a goblet, depending on the beer.)  When I went, they had Big Daddy IPA (very good, super hoppy), Prohibition Ale (less hoppy but still robust amber ale), and a really great Belgian wit beer whose name I can't recall.  The guy in line ahead of me ordered a tea.  And it cost the same as my pint of delicious, local craft beer.  How is this possible?\n\nIf I lived in San Francisco I would be here ALL the time.  Camp out with your laptop for the food/coffee/wi-fi during the day, then celebrate your day of hard work--or mourn your day of Facebooking/Yelping/reading the comments on news articles in spite of yourself--with $2 beers at night!", "author": "Alida R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-28", "description": "We were here when we went to SF last time..walking distance from lombard street...\n\nWe rode bikes all morning and didnt eat anything and we had a dinner reservation in about 2hrs..so we stopped by here for a quick bite and some coffee..\n\ni loved the coffee and my wife liked the chai..we got one of the muffins they had and it was tasty..\n\nThe place was lively cos they has a 49ers game on that day and people got some beers and we getting pretty exited abt the game..they had a good selection of house beers and it looked like they are famous for their beers too..\n\nGood spot to stop by for some coffee..latte or mocha..or some fresh juice/smoothie with a quick bite during ur tourist trips to lombard streets", "author": "Sivaram V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-25", "description": "Stopped here on our way to Coit Tower for a quick pick me up. was upset to hear that they didn't have any soy milk, what coffee shop in SF doesn't have ample stock of soy milk? definitely won't be going back. didn't even offer to discount the up-charge for almond milk. the latte itself wasn't bad but not coming back.", "author": "Mario C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "I love this cozy spot.  Sitting on the corner of Columbus and Lombard, with a small patio in front, this place serves coffee, sandwiches, salads, smoothies, and BEER.  And more.  So awesome, a cafe I can take my coffee hating, beer loving BF.  Nice wooden tables, plenty of outlets, and shelves of books you can borrow to read.  Red walls, art on the walls, huge windows, some open air.  Free wifi, twinkly lights, and decent service.  This place is the beatnik living room you want to spend a few hours in, a living room away from your living room.  \n\nRandom, they also have a printer, so you can print things.\n\nThey just turned the game on and it's loud, and no more cool ambient musica to help me write my heart out, so I'm taking off now.  But I'll be back tomorrow.", "author": "Super L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "Locals and tourists alike are drawn to this corner cafe on the cusp of North Beach and Fisherman's Wharf for the ambiance, good prices ($2 draft beers) and decent food. Characters are abound, so grab a drink, snack and enjoy the scene as it unfolds. Menu is similar to other cafes in the city, sandwiches, soup, crepes, deserts, all for under ten bucks.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "$2 beers during happy hour and a great location with a view of Coit Tower and cable cars rumbling by.  Perfect.", "author": "Vince F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-19", "description": "Solid 3 stars. \n\nCozy little cafe in a great spot, good atmosphere. Unpretentious. The menu looked tasty at first but my iced chai latte was sickly sweet and I'm pretty sure they made a mistake on my Corleone panini (it's supposed to come with pesto, but it had a marinara sauce on it instead?). It was edible but I probably wouldn't come back for it. Altogether a 4 for atmosphere and 2 for food, so a solid 3.", "author": "Kelli C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "5 stars all the way for this place. It isn't easy to find an affordable dining establishment that hits so many spots. Tasty selection of salads and sandwiches await you along with a large selection of coffee drinks. I recommend getting the chicken Caesar, easily enough for a meal. What is truly awesome about this place is that they have WIFI, a TV with soccer consistently  on, and 2.50 draft Speakeasy Brewery drinks. If I lived here full time,  I would absolutely come here to get some work done or to watch soccer in peace with a quality brew.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-13", "description": "It says that it's open til 11:00p, but it really only serves food til 9:00p. Then it becomes a glorified bar that only has 3 beers on draft ... albeit at only $3 a pint.\n\n2 workers that only pour beer for the last 2 hours? How can I get a job here? I'll have my iPhone ready and charged for that 2 hour paid candy crush marathon!\n\nBut hey, the food is good, if you can get them to serve.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "The cafe I go to when I'm in North Beach.  They serve Speakeasy beers on tap (which I think are $2 at some times), have pretty decent coffee, and a laid back atmosphere.   They also have a TV for catching the game, if you're so inclined.\n\nFor the casual cafe experience minus the faux-Italian glitz of many nearby places.", "author": "Carlin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "Efficient lunch, drinks counter with good amount of seating. Comfortable couch right in front of TV. Good coffee. Recommended stop in hike up Lombard.", "author": "J. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-11", "description": "Stopped in to do some work and just kinda hang out for a bit and really enjoyed this place. It's in a great location - not a far walk from fisherman's wharf or chinatown. I had a Chai Tea, which really wasn't all that great. But it looks more like a bar than a coffee/team place so I really wasn't surprised.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "great spot to have a beer and wait for the cable cars! CASH ONLY!", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "This place was cool! \n\nMy friends and I walked in craving a warm cup of something to drink (we didn't want to go to Starbucks because we go there all the time and wanted to try a local spot) and were instantly set on ordering the Zebra Mocha because it is their house specialty.  And why not try their best/most popular drink since it was our first time here? \n\nLet me tell you - the Zebra Mocha was ON POINT. I loved it. I'll be sure to get it again whenever I'm in the area because it was perfect. I ordered it with soy milk and it was amazing. \n\nThe place itself is pretty chill. There are tables all around and outlets so you can charge your phone or laptop. \n\nThis place also has $2 beers! WHAT WHAT?! And I love beer. \n\nWhat more can I say? Even their menu looks good. \n\nPlace is simple yet trendy and cool. I suggest everyone should visit this place and give it a shot whenever you're in the area. I love finding these gems in my city.  :)", "author": "Vanessa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "Really friendly with lots of yummy vegetarian options! Cool atmosphere and somehow we were able to trade some foreign money for 3 cookies haha. Definitely would come back!", "author": "Laura O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "They have a lot of veggie bagels here. I tried the avocado croissant which was delicious! They also have sandwiches, salads, wraps and waffles.", "author": "Anton P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "This place has THE BEST cappuccinos!! Vanilla and hazelnut are the best but seriously best I've ever had. Try one and stroll up Lombard St!", "author": "Kristina S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-19", "description": "I walked in and looked at the menu for a while - at the salads because I'm gluten free.  Having chosen one, I asked the guy if there were any that were completely gluten free (it's the dressing that's the danger), or should I have my choice of salad without the dressing.  He did not respond - he just stared at me, still with his hands in his pockets.  So, I asked again and his response was that he did not know (and by his look it was clear that he did not know what I was talking about and did not care).  He then asked which one I wanted.  It was clear that he was not going to pay any attention to any ingredients and would be quite happy to serve items which poison me, so I left.\n\nI'm amazed that places like this are allowed to remain open in a place like SF.  Ignorance is one thing, but being quite happy and willing to serve items with allergens in them to people who have allergic reactions is grossly negligent.  I hope the place is closed down.", "author": "Norman B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-10", "description": "Tho I go here most every day. Tip well even. Today I stopped in for a paper cup for water. Even tho I'm pregnant, they refused.", "author": "Mariana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-04", "description": "Corner cafe. You can take the cable car and hop off right in front of this cafe. Free wifi. Close to a nice neighborhood park. Enjoyed the food - pancakes and a breakfast egg croissant.", "author": "S Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-20", "description": "We weary travelers needed a place to rest our feet after walking through the North Beach street fair and decided to duck into this non-descript shop for some refreshers.\n\nMy friend and decided to share a soy latte, some homemade tiramisu, and a few bottles of water.  This cafe was relatively expensive but the tiramisu's soaked ladyfingers were exceptional and the latte had a nice subtle sweetness to it.\n\nThis cafe was a great place to rest our dogs (feet) but there's also a table outside where your real dog is allowed to hang out.  You can't bring their great happy hour drink deals out there but anything else is fair game.  If I lived in the area, I would definitely drop by for a drink or even just to get some work done.\n\nFood: 7/10\n\nService: 7/10\n\nPrice: $$\n\nAtmosphere: 7/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-18", "description": "Terrible service and terrible pastries. Went here on a Saturday morning to grab a coffee and croissants. The guy behind the counter was incredibly rude... Seemed like he was spaced out or high or something. Forgot half of our order... Made a soy latte instead of chai. When I asked about the mix up him he just shoved it at me and told me to take it. I've never had such terrible service. And then the croissants we ordered were 3 days stale and clearly from Costco. Would recommend to the owner to better hire his staff... The counter clearly did not belong working in a cafe or in a cafe at all.", "author": "Simon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "The strawberry waffle with whip cream was a little taste of HEAVEN.  Thank you for the absolutely wonderful breakfast.\n\nP.S. the caramel Latte and the fresh o.j. was also delicious.", "author": "Amy V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-01", "description": "I don't like to leave bad reviews, especially if I've only been somewhere once but I haven't had crappy customer service like this in a while - so please excuse the rant. I just stopped by to grab lunch and realized Columbus Cafe only accepts cash. I had some cash on me but not enough for what we ordered + tip, so I asked the cashier if he could just take off one of the items. he said he couldn't b/c he had already rung it in and told us to pull more cash out of the ATM machines instead.\n\nI might have been fine with this if the cashier was at least friendly about it, but he said sarcastically to look at the clearly marked cash only sign scrawled on the cash register. Sorry, I was busy looking at your menu dude, but if service is normally like this I never plan to come back here.", "author": "Jasper S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "Since we are only passing through San Francisco this time around I had to find a good cafe, NOT Starbucks, that was nearby the hotel. This place did not disappoint. Everything is made with care. The espresso was just what I needed and the wraps and granola with yogurt was an added bonus. Get a wrap! They were so good that we ordered more for the road. The employees are super friendly and entertaining. I wish had more time in San Francisco.", "author": "LeaDan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "Amazing place, friendly employees~ Their paninis are dope so as their cappuccino!\nIf you are in SF, That s the place for a good morning breakfast with nice music on the background ... Cant wait to go back there..", "author": "Pelin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "Gotta give these guys a good review. Good coffee good food and a small business feel to the place. Feels very San Francisco non tourist. Not to mention if y u want coffee or a microbrew you're set.", "author": "Luke H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-02", "description": "Ca$h only, lovely little cafe at the corner of Taylor n Lombard where you can conveniently point and laugh at tourists taking pictures with their ipads whilst sipping on some yummy coffee, eat a hearty bagel, drink $2 dollar beers during happy hour, and watch TV.  \n\nhomey and quaint ambience, I love the chill vibes.  Come back for open mic night or take your first tinder date here LOL", "author": "Kimson D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "This place has good coffee, cake and a great location. It is really nice to sit outside or work on your laptop inside. Others have mentioned this already, but they have a nice selection of beer with good choices for the $2 happy hour. I make a trip over here every time I am in SF", "author": "Samuel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-29", "description": "Stopped by San Francisco for a quick weekend trip and decided to go to a nice coffee shop for breakfast to take a friend over to the touristy Lombard Street.  What do I do?  Yelp it of course! Hahaha..  \n\nI had the zebra mocha and a panini and it ain't bad at all!  Coupled with the free wifi and cool neighborhood coffeeshop feel, it was a great escape from hustle and bustle I'm used to in LA..  Street parking was plenty and, after the breakfast, we were all fueled up to just walk up the hill to our destination... too bad I didn't have a chance to come back later in the day for their cheap beer and wine!", "author": "Johnson K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-26", "description": "It's really hot in here (maybe because it was pretty warm outside), but the smoothie I had was good (strawberry banana). Cheaper version of the Starbucks kind. They also serve beer, which is cool. A huge menu meets your eye on the wall behind the cashier, so it seems there's plenty of dining options to choose from. If I'm ever back in the North Beach area, and needed a beverage, I'd definitely stop by again.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-05", "description": "Terrible service. \n\nOrdered the salmon bagel with cream cheese lemon and sprouts, Iced latte with hazelnut syrup and Iced tea.\n\nFirst of all, no sprouts. They were good enough to sub avocado at no charge.\nIced latte came WITHOUT the hazelnut syrup. Super bland coffee, didn't even taste the espresso.\nIced tea was good but again, very light.\n\nService was super rude. The bagel comes open faced and we asked them to slice it in half again (for easier eating). The guy gave us a rude look and said, it's open faced. Uhh...that still doesn't do it for me. Can I get a knife? Nope, he just walks away.\n\nNEVER AGAIN!", "author": "Annie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-15", "description": "Normally I love the coffee here and would give it 5 stars but I had the 'Santa Cruze' (bagel and smoked salmon) but the cheese they used was terrible and bland. I asked the man at the register about the cheese and he just stared back at me. Zero customer service even when I went back to buy a beer. This may have just been the Friday night at 7pm atmosphere but I just wasn't impressed.", "author": "Martie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-09", "description": "Sometimes the best place to grab a beer isn't a bar or pub, it's the little coffee shop on the corner. I LOVE San Francisco's independent coffee shops that also happen to serve wine and beer. \n\nMy friend introduced me to this place--they have a great happy hour that runs until 9 PM where they serve $2 pints of 3 different Speakeasy beers on tap. My friend pointed out that this is even a better deal than the Speakeasy Brewery itself! \n\nOther great things about Columbus:\n\n- free wi-fi\n- a bookshelf library with communal books\n- yummy looking treats\n- generous seating area\n- a comfortable environment", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-10", "description": "Most of the cafes in north beach are over-priced and super touristy. 901 is pretty much the exception to this. I think it really helps that it's about halfway between north beach and fisherman's wharf, kind of a tourist no-man's land.\n\nI usually drink tea or beer when I'm here, but I've heard the coffee is pretty good. The vibe's super calm and you can just chill here for hours. Free wifi and you can print too (not sure how much that costs)\n\nNext time I go, I really want to check out some of the food. Last time I was there, I noticed a few vegan/vegetarian options that seemed appetizing.\n\nOnly downside is that it is indeed in North Beach, which means you kind of have to go out of your way to get here. But hey, if you're going to see a show at Bimbos, why not stop here beforehand?", "author": "Jon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-08", "description": "The cashier guy who works here is R-U-D-E! \n\nI haven't received crappy customer service like this in a while. I stopped by here with a few of my friends for lunch. Columbus Cafe only accepts cash. As we were reading the menu, thinking about the prices, because once again, It is JUST CASH, the guy is staring at us like we need to hurry up. Me and my friends frantically ordered some salads. \n\nWe were in a rush to get back to our classes, and we kindly asked the cashier if he could be a little fast with our food because of this. He was rude and did not seem like he cared. Our food finally came. The salads were large in size, and nothing special. The Iced Chai is delicious, I have to give them that. \n\nOverpriced, and touristy. Probably won't come here again.", "author": "Emmanuella Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "Good coffee, great paninis and above all  - a cozy, comfortable cafe to sit, read, or work on the computer - something you can't take for granted these days when such places disappear one after the other.", "author": "Arkady I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "Dropped by for coffee this AM en route to work, lots of options in NBeach I come maybe once a month.  GREAT HOT BLACK COFFEE it was so good I drank it black, very tasty.  Maybe just a good day all around but I didn't remember the coffee being as good usually.  Then I went back for lunch to check on Champions League futbol and again (coincidental) had the smoked salmon, on ciabatta, FANTASTIC.  I don't write many reviews but do love the quality non-chain, non-yuppie local businesses and this cafe is one of 'em.  Amy Adams also bought me a bagel here once : ) : ) : )", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Lovely spot for a beer and a bite. Their wraps are quite tasty and filling. I chose the veggie Sinatra and ended up splitting it with my honey. The peanut butter cookie topped off a great relaxing meal. Take the time to sit and watch the people strolling by.", "author": "Cynthia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-04", "description": "LITTLE COFFEE SHOP NEAR THE CROOKED-EST STREET IN SF\n(4 stars) \n\nHow do you enjoy a baybreezed yet humid evening in the city when trying to kill some time before heading to a place you dearly dread?  Felt sorry for myself that I'm the selected \"lucky\" one to work overnight at the office. Thought I'd treat myself to something yummy. Sit at a little cafe and post up listening to itunes over a hot beverage and dessert and people watch. \n\n- taste, beverage and desert - great. they have a full menu from beer, espresso, breakfast & lunch items, pastries, etc.\n- price, i could get better for cheaper but i'm willing to pay\n- service, great!\n- ambiance, little cafe with a bunch of random house plants for decoration\n- atmosphere, very chill. everyones in their own business mostly on laptops. F/M ration, 1:12 (including staff 1:14). I being the one -- ackward. HAHA jk but i thought it was funny\n\nHEFFER-STATUS:\n\nHOT COCOA ($3) - the barista put it in a clear glass mug and topped it with whipcream. the hot cocoa wasn't chalky and rich like those nestly quick mixes, it was perfect. i'm not suppose to take in caffine while i'm currently on my \"treatment\" for my illness, so i went with Hot Coco instead of my usual.\n\nTIRAMISU ($5) - i love me some desert. There wasn't much pastries behind the glass case at this late in the hour. I chose the Tiramisu and hope to godness it is good. I know i'm not suppose to have caffeine on my \"treatment\" but it wouldn't hurt if i'm not drinking it *winks*. I need something to keep me awake if i'm slaving myself overnight. Good stuff, pretty decent. The bottom was a bit liquidy but edible. \n\nWill I be back? Maybe.\n\nUntil the next review...", "author": "Jane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-28", "description": "Damn, I should have come here for my 901st review!...\n\nWell, I'm glad the owner didn't come up with some misconceived name like the Coffee Hut or Caffeine Express or Jolting Java for this super-casual place. Keeping the address in the name makes me remember it all the more since I don't live in North Beach. Jamie W. and I were strolling feeling a bit peckish after our paninis at Mario's Bohemian Cigar Store Cafe.\n\nWe saw a group huddled around the sofa watching the Democratic Convention on a flatscreen, while others were focused solely on their laptops. They appear to serve the typical sandwiches and salads, but we went for the last piece of tiramisu in the glass case. It was really light and tasty, and I have no idea where they get it. But I'd come back for that in an Italian minute.\n\nNot much else to say except they serve a good cup of joe, too. If I lived around there, I'd be spending some serious slouching time there. The vibe is so laid back here that it feels like one big Valium in a martini. That's a compliment actually.\n\nCOFFEE/DESSERT - 4 stars...that tiramisu was definitely homemade but whose home?\nAMBIANCE - 3.5 stars...casual to the extreme\nSERVICE - 3 stars...chill, dude\nTOTAL - 4 stars...for a coffee place, sure, I'll give it four stars", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-21", "description": "Love the zebra coffee drink- both hot and iced.  It's very laid back here, and you're guaranteed relaxation with conversation, a game on the flat screen, or even a board game or two (ie. Cranium) that are on the bookshelves. \n\nService is OK, not effusive. I see some regulars here from time to time wih their laptops.  Note that waffles are not served all day but you can get sandwiches with Italian gangster references, ie. Corleone, Gambino, etc. Very cheeky.", "author": "Miran C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "I really love the atmosphere in this place. It's comforting, warm, and quaint but still has the hip vibe of a typical coffee shop in the city. I'm also a huge fan of the free wifi and $2 drafts! Didn't have any food, but the nice young man next to me commented that his sandwich was excellent!", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-10", "description": "I went to a comedy show at Cobb's (next door) and waited for my friend at this cafe. It's a charming place- small, but they have everything you could want. Beers on tap and a looong happy hour, sandwiches, salads, pastries and a variety of coffee and tea drinks. They also have a large TV for catching the Giants' games and board games to play during football season. There are comfy couches and also some tables and chairs and WIFI and even a couple computers in case you forgot yours. I try to stop here whenever I'm walking through North Beach. If I lived in the city I would have to live in North Beach so I could make this my neighborhood hangout. Anyone in the area looking for roommates? \n\n;)", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-14", "description": "This place has gone down the hill much. I live 2 blocks from here and used to come here for coffee and sometimes bagel. Went there today to get coffee and a lox bagel. The bagel came out missing half of the ingredients on the menu and I got charged $1.00 extra for a splash of soy milk.... Plus the guy works at the counter is pretty rude.", "author": "Ladywolf M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-26", "description": "-Cash only always is a downer.\n-The food is pretty good, a little over priced, but I continue to go back.\n-CHEAP drinks (beer & wine) during happy hour, which is like all day everyday. Really good prices there, but not much of a selection.\n-It would be a good place to go and get some work done that doesn't require much focus (searching for apartments, jobs online, etc.), not a good place to study for tests or really do serious work though because the music is really loud and it gets pretty crowded.", "author": "Megan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "Lots of healthy options. Cash only. They do have an ATM inside though. Our family of four had a Strawberry Banana smoothie, Sinatra wraps, Turkey sandwich, and the salads that come as sides are delish. All food was fresh.", "author": "Andy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "Great spot with great specials. We were traveling to the area and needed wifi but didn't want to give in to the great commercial god of coffee. Thankfully this corner shop came to our rescue. Check it out!", "author": "Justin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-01", "description": "Bestest, most coffiest deliciousness.\n\nNothing beats this place! Absolute awesome and friendly service, amazing coffee with a great selection, good waffles free wi-fi, soothing atmosphere, I honestly could go on forever (and ever).\n\nThis is a place to come to when you just wanna hang out, write, read, and drink coffee. \n\nAnd they play The Smiths here quite a bit too! Which makes your coffee shop way less cool, bra.", "author": "Lee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-29", "description": "Only knocking off a star because of the TERRIBLE SERVICE.\n\nFood  & Service: \nWe ordered a few bagels and an egg sandwich and they were pretty tasty but it took 45 minutes to get our food; meanwhile patrons who came in after us were walking in and out with their orders. Ridiculous.\n\nHoping it was a fluke bc I'd like to come back!\n\nAmbience:\nNice and peaceful vibe to come in and do some work or web browsing.", "author": "Sangita A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "I couldn't get enough of this cafe when I was staying down the street in North Beach last weekend in San Francisco.\n\nThey have great breakfast sandwiches that range from $4-$6, which was my go-to every morning. I recommend getting it on a bagel (they have croissants too... tough choice)! Grab a cup a coffee with your breakfast too because it's delicious.\n\nI went three times over the course of 4 days. Enough said.\n\nDon't forget that it is CASH ONLY. They do have an ATM, but I recommend getting money from you home bank before to avoid the charge.\n\nNow I want a breakfast sandwich...", "author": "Kathleen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "Good sandwiches, chill atmosphere. Great happy hour beer specials. No cell phones at the counter sign!", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "Lovely local cafe conveniently located between Columbus Ave and Lombard St ! Free WiFi, ample outlets, a variety of inexpensive food options, $2 draft beers and $3 wines from 5pm. Local cafe with chilled out tunes. The staff are smiley, nice and helpful. Diverse crowd.", "author": "Lianne M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-15", "description": "3.5 stars - a gorgeous day in SF so we were out looking for a place with outdoor seating.  After missing the boat at a couples places closer to home, we walked toward fisherman's wharf and stopped here.  \n\nAlways wanted to try this spot because of their HH special but the place feels a bit blah.  While we were checking out the menu and scoping out outdoor seatings - some folks were kind enough to let us know they were leaving.  Hubby sat outside while I went in to order.  It's not a big menu but it took me a while - the various salads, bagel, panini, regular sandwiches all look pretty good.  But I focused on choosing something that went well w/ a cold beer and not too heavy.  \n\nGot the gambino panini (mozzarella, tomato, basil, pastrami and purple onion - $8.50 and two pints (DBA? and a pale ale) at $4.50 each.  Grabbed the beer and our number outside.  It took quite a while for the sandwich but we were enjoying the sun and not in a hurry.  \n\nSandwich was good but the bread was too toasty - just a bit too much crunch, at least for us.  It came w/ two pickled jalapeno peppers.\n\nIt's a great location to people watch and close to Cobb's.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-06", "description": "Thinking back is dangerous business. Reminiscing is often a sure-fire way to the bottom of a bottle, what with those warm days long lost, and all that Jewel and Duncan Sheik playing for some reason... and why is it always raining outside? \n\nWhen I think back to the coziest days in San Francisco cafes, nothing tops memories of 901 Columbus Caffè. It's my go-to place for work. Why? I'll head here around 2 or 3 in the afternoon, grab some coffee and maybe a delicious bagel sandwich, and start tapping away on my MacBook until 5. By then, I'm about as drained as Ron Jeremy. Luckily, it's happy hour: $2 Speakeasy pints and $3 house wines from 5-10pm every day. It's spinach and I'm Popeye. Yabba dabba doo, I'm back in form, mixing up my cartoon references.\n\nIt's a day well spent, rain or Jewel, and I'm always sure to bring a few friends with me.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-26", "description": "Crowded and noise everywhere , if you want to read a book and some coffee and want to have a wonderful afternoon , don't come here.", "author": "Xu J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "Typing as I'm sitting here. Famous for its speakeasy beer, its a small gem good for studying, reading a book or playing a few rounds of chess.\n\nThere's always popular music playing in the background and the coffee's not bad either.", "author": "Minks M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "Initially the counter server didn't seem to want to look up and notice me, but then was friendly.  But this is god coffee and amazing boscotti.   Sweet, crunchy, larger than normal boscotti perfect for dunking in a tall glass of Italian roast coffee.  Very cool old coffee house vibe.  Cash only.  Good for breakfast.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-06", "description": "A coffee shop that serves beer.  What's not to like?\n\nI also saw my husband's doppelganger here.  It was a little creepy.  But he wasn't a gay version, or a spanish wrestler version, or cab driver version.  He was just a normal laptop using doppelganger.  I'd like to think he was some secret warlord plotting to take over the world.  What?  It's possible...", "author": "Angeline K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-03", "description": "What cool little pace to drink coffee, enjoy some food, cozy up with a good book in the rain, imbibe in some adult libations, or do whatever other leisurely activities that might tickle your fancy when you've got some time to kill.\n\nOver Thanksgiving weekend, the lady and I decided it'd be a fun idea to get saucy in Sausilito, via cycling across the Golden Gate Bridge. The only problem... was that she didn't have a bike, so we rented one next door at some touristy spot that typically slings two-wheelers to boners from Nebraska or Ohio. \n\nThe weather had been rather ominous all day, but it remained clear for the better part of the morning/afternoon... right until she'd signed on the dotted line and we were about to peddle off into Marin County. It started pouring right outside the bike shop, so we decided we'd wait out the storm with a tall cup of coffee across the street at 901.\n\nThe interior is very warm and inviting. From the street, you'd have no idea it was such a welcoming place to kick your feet up for a while. They had TVs streaming a college football game, a stocked bookshelf with literature to borrow for the day, couches, tables, armchairs and more. Of course, they had a nice selection of coffee drinks, teas, sandwiches, pastries, and all of the other goodies you'd come to expect from a neighborhood coffee joint like this one. Maybe it was just the spirit of our visit (lazy day off, just enjoying the slow-moving afternoon), but there was just the most amazing vibe reverberating throughout the space, and I almost wished the rain would have never stopped.\n\nThat being said, the storm passed in about 15 minutes, and we were back on the road... but not until I made a serious mental note to come back for a return visit, with at least a good 3-4 hours to spend doing nothing at all.", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "Funky, eclectic place. Friendly service. My wife had the Marlon Brando, it was so GOOD, we can't remember what I had. My sandwich was good also, but the Marlon Brando was just FANTASTIC!! Oh yeah, $2 drafts, in SF, seriously!", "author": "Barry B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-01", "description": "I hung out for a few hours at 901 to do some work before heading over to see a Sketchfest show next door. I had never been here before so I wasn't really expecting much. I ordered a vanilla latte and was surprised at not only how flavorful, foamy and delicious it was - but how pretty it was as well!\n\nThey have a lot of seating and tables, and their music selection was really great. It ranged from 80's funk to jazz standards. I believe Borat would say that it was \"Very Niiiice.\"\n\nThe Godfather was playing on the flat screen, muted with subtitles so those who wanted to pay attention could. Very cool. I'll be back soon!", "author": "Tatiana J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-12", "description": "My go to cafe to work out of in the city. They make a good latte as well. The homemade cookies are soft and tasty. \n\nMore awesome is when there is a basketball game going on they put it on.", "author": "Vinay A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-23", "description": "$2 Speakeasy craft beer pints, 3 different choices on tap, from dinner until close during the week and from noon to close on the weekend??? Seriously, how do they stay open? I went here every night I was in SF. Simply the best beer deal in the Bay Area, hands down. I wish I lived next door.", "author": "David C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-18", "description": "how to I explain this place?  Well, we were told by a pretty drunk guy to go here because \"that's where Jesus is\" so we figured, why the hells not?\n\nTurns out, we just missed Jesus...his shift was over...ZING!  But really, just a nice little cafe in the middle of a very fun neighborhood in San Fran.  If you're looking for some coffee that's not Starbucks, head here.  Didn't get a chance to eat anything, but ya know...tasty drinks.", "author": "Glen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-28", "description": "I always go here while waiting for a show at Cobbs around the corner, when the line reaches my table outside I get up and take my place with the herd.\n\nThey can be slow here and good luck finding a table but it's a cool spot with drinks (coffee, booze, etc) and light snacks too.", "author": "Christopher Steven O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-20", "description": "I'm reviewing this place based upon their awesome happy hour specials only!\n\nI've visited the 901 twice now, and what brought me back was their cheap $2 draft beer happy hour!  Seriously...where can you get that awesome deal?  And we're not talking Bud or Coors...they have $2 hefeweizen!\n\nLooking to get away from the hustle and bustle of North Beach, head here.  It's got the chill atmosphere of a coffee shop, but they serve cheap beer!  Their food looks and smells great too, but so far I haven't tried it.\n\nIf I'm ever in North Beach and in need of some libations, I'll head here for sure.  What a great deal!", "author": "Greg S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-27", "description": "**BASED ON ATMOSPHERE** I walked in and then walked out. Dislike the atmosphere. So dark and gloomy. Went to the neighboring Cafe Sappore instead", "author": "Letiza M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-08", "description": "It's a great place to grab a sammy or a salad and do some work since they have free wifi. However, the day I went it was about 100 degrees inside, not sure why since it wasn't a really hot day in SF, so I sat at a table outside. I had the Fillmore Blues salad- mixed greens, crumbled feta cheese, roasted pecans & dried cranberry with raspberry vinaigrette. It was good and would have been even better had it not been drenched in dressing. When will I learn to ask for dressing on the side? I would eat here again or at the very least have a cup of tea while doing some work.\n\nFor the full review please visit:\nhttp://consumingcolumbus.blogspot.com/2013/05/901-columbus-cafe.html", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-29", "description": "\"No phones at the counter, baristas are people too\" - At the register\n\nHow can you refuse a study bar open late, close to opening time at Cobb's next door.\n901CC is the perfect little place for activities and festivities.\n\n-$2.00 Speakeasy draft pints\n-$3.00 wine \n-Board games  \n-Free Wi-Fi \n\nIf your headed into Cobb's like I was or on a bar hopping adventure in North Beach you can't go wrong with 901CC.  With all the other pricey places around the area its nice to see such a simple place have some success.", "author": "Dennis S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-01", "description": "Nasty nasty customer service. Went to order at the counter and found out its CASH ONLY. Tiny sign on their cash register. We didn't have any cash on us, only credit card. We apologized and asked to cancel the order (by the way order wasn't entered yet and no food made). He wouldn't cancel it and called it unfair. He insisted we pay??? What??? The order wasn't entered and we didn't eat or take anything??? I wasn't sure what's so unfair but ignored and went to another store. Places like this that demands cash only should be on the watch list for government tax authorities, let alone on the avoid-at-all-cost for most restaurant goers.", "author": "Ah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "So, I stopped in here the other day to enjoy a couple of their $2 happy hour pints.  I realized late that night that my wallet must've fallen out of my pocket and i retraced my steps back to the Columbus Caffe.  \n\nYou can imagine a sleepless night knowing that $200 in cash, my diver license and credit cards may be long gone.  I rushed to the Caffe early the next mornign at 7am and they had it waiting there for me!  \n\nIt's good to know there are decent people at the Columbus Caffe! Thank you to the #1 place in the city!", "author": "Charlie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-12", "description": "Ooh, I have a new favorite cafe!\n\nPluses:\n1.  Super friendly staff\n2.  Cozy\n3.  Free WiFi\n4.  $2 Draft Beer/$3 Wine from 5pm on\n5.  Delicious Cafe au Lait\n6.  Seats outside for people-watching\n7.  Sinatra Wrap is deeeelicious and healthy (cucumber, spinach, tomato, hummus, feta, and olives in a wrap and heated)\n8.  Bookshelf with a mini library of books\n9.  Great music.  (Today I stopped in during a torrential downpour on my way home from the gym.  I heard old Cure, Echo & the Bunnymen, and even A Flock of Seagulls.  Heaven.)\n\nMinuses\n1.  It's not closer to where I live (the walk is about 15 minutes)\n\nOK, scratch the Minus.  That should actually be in the Plus category.  If this place was located any closer to my apartment, I'd be there for breakfast, lunch, and dinner every day and would never eat at home.\n\nI think I'll go tomorrow and try something from their breakfast menu...", "author": "Kimberly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-19", "description": "I think a lot of times, I stumble into random cafes just to use their lavatory. But someone told me last night that theres no such thing as \"random\" even when you put your ipod on shuffle. \n\nThis place seemed nice, I like cafes that sell beer and coffee its always nice to have that option.", "author": "kim w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-20", "description": "Extremely disappointing pastrami sandwich! One piece of pastrami \n and no cheese on what was supposed to be a 'melt'. We will not return.", "author": "Matt T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "Oooh Monterrey Bagel  where have you been all my life!!!!\nI get an everything bagel with cream cheese topped with a huge amount of lox (salmon) and red  onions.\n\nIt doesn't came with tomatoes but I always ask them to add it. \n\nThey are some tiny improvements that could be made such as slice your red onions paper thing and soak them in vinegar and I thin tomatoes should be part of the sandwich.\n\nI got brewed coffee on the other hand is no good and NON-dairy creamer they have on the table is  terrible and should give you the option for some half and half.   On the other hand they seem to make some excellent Espresso machine coffees so I would stick with that.", "author": "Manny R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "Although I didnt eat here this place has $2 draft beer all day! And it isnt bud light, actually good craft beer.  I will be back for sure!", "author": "Sarah E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-03", "description": "It's blissfully quiet here on a sunny Saturday afternoon. Spirited red and blue walls, worn by an undulating tide of cafe goers, stand in salute to football (as defined by the rest of the world) playing on the flat screen tv in front of a small leather couch that has seen more than its share of ebullient children and spilt beer. There are no more than a small handful of customers huddled over laptops, ambient instrumentals drifting over their heads.\n\n901 is another 1-stop shop cafe offering coffee, breakfast, lunch, beer, and homemade tiramisu. Given the breadth of offerings, you'll sacrifice nuances like yogurt & granola interpreted as strawberry Yoplait yogurt layered on conventional store-bought granola (in a tiered parfait, no less), but it's acceptable if you're simply looking for a quick bite to eat and a place to rest your legs.", "author": "Christina J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-04", "description": "My husband and I recently spent a few days in San Francisco. We were on the way back to our hotel after walking around chinatown and needed a caffeine fix. That's when we stumbled upon 901 Columbus Cafe. The cafe latte was good and looked beautiful. The chocolate chip cookie was also very good, soft in the center. :)", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "$3 house wine? Ok by me.  Went here for a glass of wine and to wait a bit before seeing a show at Cobb's.  It has a very nice, friendly, cozy atmosphere.  There were a couple of people working on their laptops, but it still felt pretty chill and laid back.", "author": "Chloe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-25", "description": "Delicious homemade tiramisu to be found here!! It's baked in a glass pan and is a tad pricey for $5 a slice, but the fluffiness of the whipped cream and the generous espresso flavor makes it a delight worth sharing. We came in late at night, bought the last piece left, and it was still delicious! Even though the place says it closes at 10:00pm, we stayed a few minutes after and no one was rushing to kick us out.", "author": "Evonne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-30", "description": "Hooray for cheap draught beer! Hooray for a flat screen TV that will showcase Giants games whilst you enjoy cheap draught beer! Hooray for a place that serves cafe food and drinks in case you want to watch the Giants game, but are not in the mood to enjoy cheap draught beer!\n\nThe staff is nice, too.", "author": "M M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-08", "description": "I GUESS 901 Columbus Caffe was not too crowded and had available seating.  I GUESS the internet was not too slow, since it was not bombarded like a busy Starbucks router would be.  I GUESS the music was a good mix of 80s and 90s hits.\n\nNo matter how hard I'm trying, I can't rationalize a can of diet Coke costing $1.75.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-08", "description": "I think I've been spoiled by all the fantabulous coffee shops in the east bay...Perhaps my expectations were set too high by yelp, but maybe this kinda vibe is just not my cup of joe :P. (Pun intended).\n\nAnywho, had 2 hours to kill before work and after reading about this place on  yelp a few weeks ago I was excited to try it out! (I love my coffeeshops!).\n\nDespite the large # of outlets and free-wifi (which if a coffeeshop doesn't have now a days it's just behind in the stone age), the vibe isn't as welcoming as I had hoped: feels like a bar, the cushioned seating is torn, the tables are a bit grunge, and the service priorities are a bit skewed.\n\nWhen I went to order a sandwich, the guy said \"It will take about 20 minutes to make though because we just had a large order over the phone\"... Is it just me or would you not try to make a sandwich for the 1 person waiting for food in your restaurant rather than an order for 100 other folks NOT present?\n\nAll in all, the food IS good for the price and there is a huge assortment to choose from which all piqued my interest, but I shall venture else where otherwise to unwind.", "author": "Gail N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "Fine comfy place to enjoy lunch.  I also really liked the mural on the side of the building-  although noone inside seemed to know the artist.\nHere's a photo of one of the murals\nhttp://www.flickr.com/photos/scotthessphoto/4972011229/", "author": "Scott H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "A simple deli, but with truly delicious food. Warm wrap sandwich (chicken, cheese, greens) with an excellent green salad. Fresh fruit cup, even the cantaloupe was tasty. And we all know how rare that is! Flavorful and chewy oatmeal cookie. My favorite part? The homemade iced tea. Black tea, unsweetened. Superb flavor. Savor it, because refills are not free (evidently thanks to surrounding businesses who abused the privilege).", "author": "Jeannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "Stopped in for a quick lunch while walking from chinatown to fisherman's wharf. As a fan of bacon, I had to keep it simple and go with the BLTM. Delicious. Crunchy, but still meaty, salty...it really is like meat candy. I'll have to go back again one day and try some more things on their menu. \n\nYes, their bacon earned them 5 stars.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "Good little coffee joint.  We ordered a soy mocha and an americano.  Both were very good.  It has a nice vibe but I would make one suggestion.  Clean the tables because they are sticky.  Windex and a towel and then this place is even better.", "author": "Joe D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-01", "description": "Chill little cafe - think Central Perk from Friends. This place isn't just coffee, cake and a paper. Whether you're looking to browse the web/kick your boyfriend's butt at checkers and sip a cup of coffee....OR have lunch and a beer or few (at $2 a pint during happy hour, you can't beat it!), I think this is a cool spot for anyone. Not too loud, either, and I like the music they usually have playing. They also have a couple seating areas outside, which is awesome for people watching whilst sipping your $2 beer, haha. One of those places that I would frequent if I lived in the area. Minus 1 star for the smelly, although interestingly decorated, bathroom.\n\n**White Lightning beer was good, tiramisu was eh....the lemon bar was delicious!!!", "author": "A. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-13", "description": "I have been looking for a truly great coffee shop in the Bay Area (not San Francisco in general, but the BAY AREA) for years.  YEARS.  That's a friggin long time.  And I think I've finally found one.\n\nIt's everything I've been looking for in a coffee shop.  It has great drinks (including an excellent white hot chocolate).  It has a happy hour, during which beer (GOOD beer) is $2 and wine is $3.  It has great food, including options beyond the usual sugary pastries (I got the broccoli-cheddar soup, it was delicious).  It has a COUCH and a big comfy chair (why is this such a big deal in coffeehouses in the Bay?  Does everyone here just like to sit on hard-ass chairs in general?), as well as a lot of seating for big groups and general socializing with people who aren't hiding behind their laptops like I was.  It has outdoor seating. It's open relatively late. Did I forget anything?  Oh yeah, it's CUTE too.  I sat and wrote for hours.\n\nI'm really excited for our second date.  I think this one's a keeper.  It might be the one.", "author": "Sydney H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-14", "description": "April 2012.  Walked by this place, plates on tables were cleaned so assume the food would be great. Waited in line where you order, then they bring your food.  More dirty plates at counter.  Service terrible.  Clearly staff was missing.  The guy who finally started to take our order became distracted with another patron.  There is a big breakfast bagel selection but upon ordering the Belvedere (egg cheese bacon), we learned they were out of croissant and bagels.  Decided to leave.  Wouldn't recommend for anyone walking around the neighborhood looking for a quick bite.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-08", "description": "This place is so awesome I don't know where to start.\n\nI lived right next door, this place boasts the cheapest happy hour within a 3 block radius, and has the most amazing staff.\n\nFree WiFi, comfortable environment, good beer, and movies...\n\nBesides not having capers for my bagel with lox this place is FLAWLESS!!!!!!", "author": "MJ D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "Great service! The ice moka is delicious! A bit overpriced...but like everywhere in SF!", "author": "Stéphanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-09", "description": "Oh my god the coffee; not only can they make a killer cup o' joe, they even do latte art, something I haven't seen since I lived in Melbourne. The ambience is awesome, chilled music, friendly staff and a homey feel to the place. Cookies are homemade and sublime and the menu looks awesome.", "author": "Alice R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-27", "description": "Two people working the whole counter. Service was decent but slow. I ordered the \"house special\" the Zebra Mocha. It was the worst coffee I've ever had. The Monterrey bagel was horrible, the salmon wasn't fresh. I would not return or recommend.", "author": "rena s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-13", "description": "It's apparent in other reviews why this cafe is so great.\n\nI'll just say this: If you don't totally love this place, and especially if you don't like it for whatever reason, you need to seriously reevaluate your standards as a human being. What more could you want from a cafe? Really?\n\nThe only way it could possibly be better is if, instead of the 80s music, they played what would normally play on your Pandora (without the random commercials trying to get you to buy diamonds or Sketchers). But you know what? It isn't physically possible for the cafe to play everyone's Pandora at the same time-- so shut up, eat your yummy food, drink your $2 speakeasy, and smile.", "author": "Jen N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-09", "description": "North Beach is an awesome place for awesome food. You can pretty much go anywhere and the food is good there. The one thing I did notice though is that there was no AC, so on warm days, it's not very refreshing. \n\nThe food was really good though, I will say. The bread was nice and toasted and fresh, and the stuff inside the sandwiches were really good too. There was just something about this place that seemed very.. fresh and healthy. Clientele looked like they were frequent visitors to the place and were very relaxed, sitting and reading, enjoying the warm day. \n\nFood was good, and North Beach is always awesome for food. I'll probably be back to this place for another good sandwich. Maybe on a cooler day though.", "author": "Jenna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-01", "description": "Very chill music and atmosphere in the evening with very comfortable seating. $2 drafts of Big Daddy. Free Wi-Fi.\n\nAs a local I love meandering the city and finding cool new places. I immediately fell in love with this place and little did I know this comfortable Friends-ish style cafe was also right next to the comedy clubs and the park on Columbus Ave as well.\n\nMy only complaint is it gets a little busy and is hard to find a seat sometimes, but everyone seems to keep to themselves and not get too loud conservatively.\n\nI definitely need to come by here again more often.", "author": "Terry C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-21", "description": "On a lovely Monday morning off work, I decided to revisit my old stomping grounds in Northbeach. After a long walk up Columbus, I ended up at 901 for a cup of coffee, a good book and some free wi-fi.\n\nListening to Johnny Cash on their sound system, watching the cars drive down Lombard street and watching CNN on closed captioning was one of the best ways to start the morning. I only intended to go in for a cup of coffee, but when I saw banana pecan belgian waffles on their menu, I knew I had to have it.\n\nThe cappuccino was delicious and rich but didn't have the same beautiful artwork like the pictures. The waffle was the perfect texture--crisp on the outside and soft on the inside topped with banana slices and whipped cream. It was delicious and I was all too happy to spend a fantastic afternoon in a shop with reliable wi-fi and a great cup of coffee. I will be back.", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-31", "description": "We came to visit on July 20th between 11 am and 1145 am. My brother wanted coffee so we walked there after visiting Lombard Street. My dad (who is a diabetic and in need of a restroom) walked in with my brother and proceeded to walk towards the restroom. A bodyguard (seriously) blocked my dad from using the restroom until my brother paid for the coffee. He made us watch the whole transaction go down before letting my dad in. Is that really necessary? The bottom line is that we were paying customers. And it's just a restroom for goodness' sake! What did he expect my dad to do? Pee in the street? Give himself his insulin shot in the middle of the restaurant? BTW, the other stores said that we could use the restroom inside 901 Columbus Café. They are right but they don't make it easy. As far as coffee goes, it was mediocre. I was going to buy a mocha but didn't because I was pissed. My kids got chocolate chip cookies and they were decent. They would have been better if they were warmed up, which they didn't.", "author": "Karine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-22", "description": "I work here and I love it. Obviously, I'm a little tired of the menu, since I've been eating lunch every day for the last couple years, but everything is very fresh, and we won an award for cleanliness from the health inspector. Lots of stuff made in house including the hummus and salad dressings.\nThis is a place I would hang out even if they didn't pay me. Couch, high definition tv (we'll let you change the channel), friendly regulars. Of course, much busier on weekends, especially holidays. Wide menu available all the time (including coffee drinks, tea, beer, wine, waffles, granola, bagels, sandwiches, panini, wraps, salads). Open 7-7 daily, including most holidays. Free wifi for your laptop, also desktop computer access for a nominal fee. \n\nStop by and say hi to me, I'll make you a pretty latte. \n\nEdit: Now open until 10 pm every day.", "author": "Meredith K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-28", "description": "It's hard to describe how delicious my Babylonia Sandwich and Strawberry Banana Smoothie were at 901 Columbus. I'll try, though. (I'm plucky like that.) They were SO delicious, I was humming to myself as I ate, and that's something I used to do as a kid, but only when I was really happy. The Babylonia is avocado, cucumber, red onion, sprouts, hummus, lettuce, tomato, pickles and cheese, and I had mine on toasted wheat bread. (Check out the photo, which makes me weep with nostalgia.) The smoothie rocked 'til the break-a dawn.\n \nMaybe I loved it so much because I'd just arrived in San Francisco, and was starving, and probably would've been ecstatic to munch on some Wheat Thins. Still, I'd rate the meal highly under any circumstances. Additional temptations on the menu included the Grilled Foccacia \"Wise Guy\" Sandwich (pesto, chicken, mozzarella, tomato and onion) and the Pastrami Melt.\n \nOther plusses: friendly service, cozy seating, free WiFi, cute location (with an outdoor view of Lombard 's \"crookedest street\" in the distance), and what appeared to be a tiny lending library.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-03", "description": "NORTH BEACH LOCALS BEST KEPT SECRET !!\n    This place is everything that Starbucks wants to be. A true neighborhood cafe. \n     If you are looking for a good place to hang out,use your computer or just have a few drinks with friends while in North beach Columbus Caffe is a great choice.\n     Not only is there FREE INTERNET -you will be happy to find outlets strategically placed so that no matter were you are sitting you can plug in.\n      SPEAKEASY is on tap (3 choices) for only $2 everyday after 5pm\nFor $10 I had 2 beers a huge bowl of Corn Chowder and bread.While I downloaded a movie on net flicks and still had enough to tip the friendly professional staff.", "author": "mike r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "I ordered a Maui smoothie and it was delicious! Also had an onion bagel, very burnt but still good! I will definitely be back to try some thing else! Awesome vibe & good customer service!", "author": "Bailey C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-23", "description": "I'm shocked at all the wonderful reviews, because my experience was terrible. I got a take out of the chicken wrap. It was the blandest thing I've eaten in quite awhile. Not only that, but there was something wrong with it as it tasted off. I think it was the hummus, as it had a slightly chemical taste to it.\nI ended up getting food poisoning, as I had some nausea, upset stomach and mild light headedness after eating it. I felt like I wanted to vomit. I know someone else who got take out with me who got sick as well. \nDefinitely not coming here again.", "author": "Kel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "Favorite coffee shop in SF! Great prices! Cafe Ole is amazing!!! Heaven in a tall cup!", "author": "Eve V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-12", "description": "Living in North Beach, this is the perfect place to bring visitors from out of town for a very casual breakfast.  It's convenient, inexpensive and has a very \"San Francisco\" vibe based on its random interior decorations and the fact that it's located right on the cable car line.\n\nTheir espresso drinks are fab, as are all the bagels I've tried so far.  I haven't had the breakfast burrito, but friends have said its quite good.\n\nI also like grabbing an evening coffee or beer here with friends.", "author": "Kelley W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-13", "description": "Cool little cafe. Our barista was nice and funny, not snobby or elitist like some people fear when they walk into a place like this.\n\nMy zebra espresso was pretty delish and the boyfriend enjoyed his ice coffee.\n\nOH I ALMOST FORGOT -- the chocolate chip cookies were amazing. They looked hard and burned in the case, but they were soft and squishy and almost melty when we got them. Awesome.", "author": "Amuse B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-12", "description": "They didn't make my coffee drink correctly (ordered an iced drink but they made it hot). I couldn't believe they wouldn't make it again and instead tried to argue with me! Poor business sense.", "author": "B W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "Great place to relax after traveling all day! Great atmosphere and friendly service . I recommend", "author": "Assaf L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-27", "description": "I've been here once - it was a few weeks ago as I waited for our show at Cobb's (they're very close in proximity - the line for Cobb's actually wraps to the front of the cafe).  \n\nThe place wasn't super busy on a Friday night - I recall that about 3 tables were occupied.  There was a happy hour special going on - I think it was for $2 beers and $3 wine.  I ordered the wine - I felt a little weird about it as the guy poured it from a bottle sitting next to the register and the bottle didn't look \"fresh\".  The bottle looked a bit sad as if it had been sitting on a store shelf for a year with no one wanting to buy it.  The wine was also served in a lowball styled glass which was fine by me - a bit ghetto, but A-OK.  \n\nBetween our party, we ordered wine, beer, soup, a panini and possibly a sandwich (sorry, memory is hazy).  Overall the food was OK - nothing really special to write home about.  \n\nThis place is good if you want to grab a cheap beer before your show at Cobb's (assuming it's happy hour).  Aside from that, it's alright.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-14", "description": "I live and work a couple blocks away and decided to try 901 out with a couple colleagues for lunch. It was an utter disappointment. \n\nOur group of three ordered two salads and a sandwich wrap. We were one of only three tables that were occupied. It took about twenty minutes to get our food. I'm willing to accept a lengthy wait if the food is stellar, but this wasn't the case.\n\nThe food was incredibly mediocre. A $10 sandwich should taste like a $10 sandwich, not a public school lunch. The lettuce was brown on the edges, the flour tortilla on my wrap was gummy. Perhaps the worst offense was the \"chicken\". Remember the grilled chicken-like product you were served in school? Basically the white-meat version of particle-board? I'm pretty sure this was the same product. It's got a spongy, tofu consistency, with a bad aftertaste.\n\nMy colleagues were equally dissatisfied with their salads and soup.\n\nI will probably not be eating here again, which is disappointing because I try to support as many local businesses around here as I can.\n\nIf you're thinking of trying 901 out, I'd highly recommend instead going to the other end of the block down Lombard to Caffe Sapore. I've eaten there numerous times and have never been disappointed.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-28", "description": "Decent food, not too cheap. They have a hodge-podge of events on some nights. No frills and great for a quick sandwich.", "author": "Amber M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-19", "description": "The barista is RUDE! I asked for a spiced chai tea and the barista gave me a chai latte with whole milk. When I told him I ordered the plain chai tea, he argued with me. He wouldn't give me my money back or provide me a different type of tea to replace the terrible latte. He also refused to give me a side of eggs, which admittedly wasn't on the menu but many dishes have eggs. The employees offered service grudgingly and refused to answer questions about the menu.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-25", "description": "This place is my new favorite spot for nom noms!\n\nI had been in before for dessert and coffee, but today I got to watch PeeWees Playhouse (woo) and hung out for a good couple of hours while the boyfriend did work stuff. \n\nWe had 2 delicious sammies, the BLT and the Corleone panini. The BLT was one of the best ive had, the tomato was delicious (which im a nazi about!), it was full of bacon and on delicious sourdough bread! The panini was yummy as well, stuffed full of salami and cheese. Mm!", "author": "Britney K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-28", "description": "A little coffee shop at the bottom of the hill of Lombard street.  I had the chai latte and a bagel sandwich with egg, turkey and cheese.  Really light and simple.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-05", "description": "I'm generally a big fan of cafes and chugging coffee like there's no tomorrow. However, when I stopped in 901 Columbus, I took full advantage of their awesome happy hour ($2 drafts FTW!). Sorry, coffee mug, you'll have to take a backseat this time!\n\nI paid 901 a visit with my boo after he and I biked across the Golden Gate Bridge to Sausalito. It was prime time for happy hour so we grabbed a few $2 pints. The place is quaint, staff is friendly and they had foreign films playing on the TV. The cafe is located on a semi- busy corner, which makes for a fun time aka people watching! My bf and I took noticed their fleet of board games and played a round of intense Scrabble. Note: there must be 2 bags of tiles mixed in with one Scrabble board because our Scrabble game lasted foreverrrr and we had a bazillion tiles left over!", "author": "Laura L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-04", "description": "Happened to walk by here on the way to Lombard Street with a friend while acting like tourists. was drawn in by the big happy hour sign which made us sit for a few beers before hiking up the crookedest street in the world (sounded like a good idea at the time).\n\nBartender was extremely nice and the seating arrangement was great. We sat outside (a little chilly) but was able to quickly warm up after a few drinks.\n\nStop on by! Would give 4 stars but definitely trust a local's review.", "author": "Andy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-10", "description": "I stopped by this place on the morning of my wedding for a quick coffee. I dug the music; the scenery; the young lady behind the counter was very sweet for 9:00 a.m.; and my best friend said her zebra mocha was out of this world tasty. My coffee wasn't too shabby, either!\n\nThe Verdict: Had it been any other day, I totally would have hung out there. I would love to go back.", "author": "Cara S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-22", "description": "This was our rest stop before we walked up the steep hills of SF on Lombard to see the Crooked Streets and Coit Tower nearby.  Nice service and cute ambiance.  Coffee is cheap, so it beats the tourist rip-off places.", "author": "Geraldine K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-02", "description": "Worst breakfast burrito ever, but I do like the $2 Speakeasy drafts!", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "EDIT: I posted this review earlier under Columbus Cafe, but it should have been posted under 901 Columbus Caffe! I certainly got confused...oops! My mistake, and a big thank you to Karlee D. for the heads up!! \n\n********\n\nAfter about 20 minutes in this cafe/bar, I was pretty impressed.\n\nThe draught beer choice was good, the service was friendly, the location was great and the ambiance is entertaining. \n\n901 Columbus Caffe (CC) has a lot to offer, whether you're looking for a snack, happy hour special or just a place to surf the internet on their computers. \n\nAnother cool aspect: the ceilings in this place are HIGH, which allowed the decorators to get creative and give CC an even more amazing feel. \n\nGo there immediately and be merry!", "author": "Tom A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-18", "description": "I love this place.  The 2-for-1 beers are as good as it gets.  It's always a fun time when hitting this spot up in the city.  Good people, good vibe, good service.", "author": "Chad N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-05", "description": "Great coffee... if you are coffee lover and love to chill in a nice place with a cup of coffee and some snacks, this is the place to go to. They have free wifi.  The most important thing is they have good lattes...", "author": "Judy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-06", "description": "You can't beat a neighborhood cafe that offers $2 beer, service by friendly familiar faces, and a low-key chillax atmosphere. This is why 901 is a winner. Jason, Rachel, et al are awesome and deserve some love. Oh and the smoked salmon bagel is delish.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-13", "description": "$two draft beer after five pm all night....sandwich and panini too...wooden large cafe and plenty large table seating..in and out...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-11", "description": "I spent a lot of time here. I can guarantee you that the staff thinks I died or was kidnapped by the creep who jacked Elizabeth Smart. I'd job hunt here all day online- sometimes clocking 10 hours-- so I'd say I'm a slight authority on 901. Free wifi. Great space. It's one of the few coffee shops in SF where you don't feel cramped. You can work, eat or sit on the sofa and watch the Giants game. 5 PM is quitin' time! $2 brews. Get the 'Big Daddy IPA.' It's super strong. I'm a lush and two would do me in. Nothing like a $4 high. All of the staff (The owner, T, the barista, Alex and other staff are really chill and great.) However, there is one barista (short/angry/always there during the day) who is the biggest prick. He never smiles. He's rude and 9 times out of 10 he gets your order wrong and acts like it's your fault. I actually saw him tell a customer he needed to change the keg for the beer he wanted then when the guy went to his table he poured him a beer he didn't order! This place gets a lot of gullible tourists- so he gets away with it. \n\nDon't let one douche spoil what is otherwise a great spot to grab pints and have a laugh with friends. And, if you see that rude worker- tell him Lianne from New York says to fluck off.", "author": "Lianne S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-13", "description": "I was VERY displeased with the service I received here. I ordered the turkey club, DRY, no mayo,and it was served to me with mustard, which I am allergic to. When I alerted the man behind the counter,and asked politely to have the sandwich re-made, he pointed to the menu with a \"can't you READ IDIOT!?\" look on his face, claiming the menu said mustard and I'd only specified no mayo, so it was my my mistake, not his and he wouldn't re-make it unless I paid for a second one.  Perhaps it was my fault for not reading the menu carefully enough (in what world is mustard put on a standard turkey club?), but this man's shitty, condescending attitude was unnecessary, and at $9 a sandwich, I decided not to pay for a second one, and left the place hungry, irritated and having wasted my money on nothing.\n\nWhether my fault or his, clearly I was unable to eat the sandwich and any other cafe would remake something for someone with a food allergy. \nNeedless to say I won't be going here again.", "author": "Jenna S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-13", "description": "The server is very rude since the minute he saw us. He made us wait next to the other Custer coz he think we're too slow.  He always says \"what do you want next\". Apparently his English is very limited but he has a big attitude. I asked for a hot milk, but he have me cold milk. I came at the counter and I asked him politely if he can warm my milk. He didn't answer for a few seconds and just smirking.  A couple seconds later, he took my milk and didn't say anything.  After a couple of minutes, he just left my milk on his counter.  I took my milk and it was only a little bit warm. I was looking for a manager but there is none. We were waiting for our meal for 30 minutes and is still not ready. Eventually  spoke to the elderly manager (that appears to be his mom )that her server was rude. Before I even explain the detail, she already said: \"no he's not.  We have to be that way. \" she eventually let me finish my story and later apologize, but I don't think she did anything else. I think this place has changed ownership and the new owner apparently ha no sense of customer service. Don't go to this place of you don't want them ruin your vacation mood.", "author": "Thomas E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "This is a good choice for a neighborhood cafe in North Beach. Free wifi, lots of seating, and the lattes are pretty good. The food is fine, nothing spectacular, but it is much better (and friendlier) than Sapore at the other end of the block. Some outdoor seating for when the sun is out. Cash only, so don't forget to hit up the ATM first!", "author": "Katie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-09", "description": "Their coffee (and beer) is good and cheap. I'm no coffee connoisseur, but the price ($2 for a pint glass) is worth it! The staff is friendly and helpful, and the ambience is great.\n\nIt's always busy but not packed, right up until closing. I'm usually there for the wireless internet from 6-10, so I don't know what it's like earlier in the day. Everyone is super friendly, there's always games being played on the screen, and it's generally a cozy atmosphere. I'm a fan of their music choices too--I often find myself foot-tapping to the beat.", "author": "Tracey Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-24", "description": "This place has a distinctively sitcom-y vibe to it. I mean literally. \n\nMy mum and I went here for the $2 beer and a $3 glass of wine happy hour after moving me into my new flat in north beach. We both kept commenting on how we expected Ross, Rachel, Chandler, Joey, monica, and Phoebe to show up. you can almost hear \"smelly cat\" playing in the background.\n\nHahah, but this place is truly neat. Very San Franciscan in that business people come here after work for wifi and a beer and students do the same. A good place to wind down after a long day of working at that internet start-up your so proud of working at, or trying to finish those art school projects. \n\nOh and the food is tasty too. Cheers, sf!", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-16", "description": "Not a bad spot, but nothing blew me away. The decor, the quality of the food and the prices all seem pretty average considering the amount of similar establishments I've been to in the city. The menu is fairly large and there is plenty of seating, but i wouldn't go out of my way to stop by. That being said, if you are in the neighborhood and happen to be close, it's not a bad place to try out", "author": "Taylor C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-29", "description": "We've been here a couple of times for breakfast and I think it's OK.  The location is great!  Nice place to walk to if you're in the neighborhood.  Good for kids.  Good cup of coffee.", "author": "t d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-20", "description": "LOVE this place for breakfast and caps... Just hate how slow the service is!", "author": "Lacey L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-30", "description": "Been coming here a couple times a week for years, and will continue to go, since it's my neighborhood coffee shop. I guess I'm a creature of habit, and I do like the food and the staff. However...\n\nCoffee drinks: No good since Jason left.  I keep ordering them, but they're laughable now. The barristas just sort of slop it out there as quick as they can. Are the barristass untrained, or just don't care? Hard to know.\n\nSound system: awful!!!!!! It often has this weird high-pitch whine to it. Maybe their ears aren't so good and they don't hear that high of a pitch, but it actually hurts my ears. Also, they keep it up way too loud, so I'm guessing their ears aren't so good or they're inurred to it.\n\nBathroom. Where do I start? Never, ever, enter their bathroom. It's dirty, will go months without soap, and has one of those paultry hand dryers that everyone knows doesn't work. \n\nBut more than anything, for years and years it's smelled like raw sewage. Ugh! I guess they're used to it and don't smell it anymore. People, you cannot have a public bathroom and have a non-working fan. The fan...  which barely worked to begin with... broke down completely about 4 years ago. The room has not had a breath of fresh air for years. The stench will turn your stomach. Honestly, how much can it cost for a new, powerful fan and an electrician? Soap and paper towels? Honestly, do they care that little?\n\nAlso, recently, their \"art\" is crap. They used to have interesting stuff, but now it looks exactly like that stuff you buy for a few bucks on Chinatown sidewalk, bad still-life on cardboard with some varnish thrown on top so it looks like the real stuff. \n\nStill, I love you guys. Funny how much we'll put up with once we've become comfortable with a routine. Aren't people funny?", "author": "Sharon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "What's not to like?  $2 pints for happy hour that goes to 10, free wi-fi, great coffee, comfy/homey environment, and friendly staff.  I'm a north beach local and this is a regular hangout\nthey also have computers to use if you are traveling!", "author": "Sameer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-15", "description": "$2 draft beers for happy hour? ...SOLD!\n\nOh yeah, and they have friendly baristas that crank out cutsie latte art, yummy snacks, and a big selection of veggie-friendly foods. Top it all off with free internet and a few outside tables in prime location for people watching and you've got yourself one fine cafe.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-03", "description": "Good coffee and great Carmel frappe!  The bagel breakfast are good also. Great place, highly recommend. The one thing to note is they are cash only.", "author": "Rick B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-15", "description": "Craft Beer on Tap!  Tables outside!  Ahhhhh", "author": "Jenn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "Great little cafe. Didn't have the coffee, but the food is good and the $2 craft beer for happy hour every day is great. I like the atmosphere, too...couches, a bookshelf, and the game is usually on their one big screen tv for whatever \"the\" game happens to be.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-06", "description": "The hubby and I stopped in here after a long day of moving and apartment hunting. We were tired, hungry and in need of coffee. 901 Columbus Cafe was convenient and highly rated. The smiling guy at the counter was eager to take our order so we hastily made our selection, a panini and an iced mocha and chose a table outside as it was way too hot and stuffy to sit inside. The sandwich and coffee came quickly and were good, a nice addition to our afternoon. Although there are so many other shops in the area, this one was reasonably priced, didn't require a long wait at the hostess table, and was quick. I won't say it was the best sandwich I've ever had in SF, but it wasn't bad for the money. Another time I'll have to try out their beer selection and maybe another panini. Overall, nice place, nice people, fast service. That's good in my book!", "author": "Emily S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-01", "description": "If I lived here in San Francisco, I'd live in North Beach.  And if I lived in North Beach, I'd be HERE at 901 everyday.  \n\nYes, it is cash only.  I have no problem with that.  They offer free wi-fi, newspapers, games, books, and a really good menu of sandwiches and salads.  Apparently, they make good breakfast and coffee drinks... but I wouldn't know about that because:\n\nAfter 5pm, this is the best place to read a book, the papers, or take advantage of the free wi-fi---the wine and beer go super cheap!\n\nThe guy with the pony tail is always nice.  The seating options are good for a place like this (the wall/window-bars, the two-seaters, the limited four-tops, outside), though it can get a bit crowded at times.  \n\nLike I said, it's cash-only.  Fine by me, but because of the variety of foods and drinks, I do suggest they adopt a credit/debit card system.  I think the increase in sales would make up for the processing fees.  My largest bill there was about $20-some bucks for two... this could easily have tripled if they took cards.  We could have added deserts and more drinks.\n\nOverall, very much recommended.  If you go here just once, you will probably become a regular.", "author": "J C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-14", "description": "Tasty muffin, tasty coffee.  Little pricey, but the location's good, and the hours they're open make it really accessible.", "author": "Tim W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-25", "description": "So my husband loves stand up comedy. I really could take it or leave it. So, we agreed to meet up after the show at Cobb's. I got there early and  was looking for a spot to hang out. 901 Columbus Caffe was the perfect spot. Free wifi, pleasant atmosphere, and a great cappuccino.", "author": "Bernadette W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "Great local cafe right across from the North Beach Library and where Lombard Street meets Columbus Avenue. The coffee's are always smooth, never burned. Wi-Fi works well and couches and seating is comfortable for a place that just feels \"chill.\"  Good crowd, not too hipster or yuppie; just regular folks. :)", "author": "Omar M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-16", "description": "I lived up the street from this place and it's definitely better than Caffe Sapore around the corner. Comfy and relaxed atmosphere, decent chai tea lattes and a couple of toasty sandwiches that are 99% satisfying. A good place to stop in for a coffee or a snack.\n\nThe only issue is that it's in the middle of tourist central--but, well, so are you.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-12", "description": "901 is far and away my favorite coffee shop in North Beach, and I've pretty much been to them all: Roma, Greco, Capriccio, Sapore, Trieste, etc. What I like about 901 is the super laid-back vibe - though things do heat up a bit at night during happy hour. The food and coffee are great, but what really makes 901 stand out is the ambiance (great music, nice layout, comfort) and super friendly staff. I've also found it's a great place to read, study, and be productive if you like to work in coffee shops. Reliable Wifi is a big plus. I'll give you a heads up that the service can be a bit slow, so if you're in a hurry maybe 901 isn't your best bet. Aside from that, this place unequivocally rocks.", "author": "Ben D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "Bustling cafe that attracts an even amount of tourists and regulars. The high energy atmosphere that I experienced (heightened by the showing of Terminator 2 on one of the TVs) might not be for everyone. Nevertheless, I enjoyed my afternoon working on my laptop here, enjoying the free WiFi and ample outlets. The coffee was good and served with great care by a friendly barista. In short, I'll be back.", "author": "Daniel Levis K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-30", "description": "Busy little neighborhood coffee place filled with people staring into their laptops.  (At least when I go there for a coffee...) \nI'm all for a little web surfing, but crowding up places to just sit lonely clicking away seems like a sad way to spend a weekend afternoon.\nDecent cafe sandwiches and coffee and beer selection with a Happy Hour.\nCool.", "author": "Kev M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-05", "description": "I bet that most people have no idea that this place used to be the location of a club called \"Wolfgangs\" that was owned by Bill Graham, and that Jerry Garcia, Randy Newman, The Grateful Dead, and U2 (one of their early US appearances), and many other famous acts played here.  Take a look around...when you are in here, you are in a place of rock and roll history.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-28", "description": "This cafe is everything a great cafe should be\n\n- Nice, friendly staff\n- Comfortable environment\n- Completely free, unrestricted Wifi\n- Good music that isn't too loud\n- Really good food\n\nI love coming here to study. The employees never care that I take up a table and their wifi for hours at a time while getting coffee refills or drinking free water. I almost always get one of their smoothies when I come here, they're delicious! The food variety is impressive- wraps, salads, paninis, breakfast bagel sandwiches- and everything I've gotten so far has been quite tasty. The vibe here is so chill, they have outdoor seating for when it's sunny, and their happy hour can't be beat. I wish every cafe were this great. Only bummer is cash only, but that's half the places in San Francisco anyway.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "Surprisingly good. I wanted to go to a coffee shop and get some work done before heading to Trader Joe's, and this was nearby. Good atmosphere, reliable wifi, and an iced chai tea latte that tastes like apple butter (which I'm told is an Amish -- not California -- thing).", "author": "Adam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-23", "description": "This place is my local favorite for relaxing with friends. It serves perfectly either as a casual place to relax on a warm Saturday afternoon with beers, or as a great cheap place to meet up with friends before heading out to dinner/bars.\n\nThe panini sandwiches and salads are very tasty if you want to stay here and eat.\n\n$2 draft beers! And we're talking GOOD beer - Firestone Double Barrel Ale is my favorite currently on tap. You just can't beat that in this city.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-10", "description": "Coffee is alright, atmosphere is awesome. Great place to work and hang out... plus it's open late!", "author": "Ben D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-24", "description": "I ordered a cesar salad and was very disappointed. It took forever for them to make it and there wasn't anyone ahead of me. The salad came on a big plate, but was a very small portion and the romaine lettuce was so soggy that I couldn't even finish half of it.", "author": "Gina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-12", "description": "Good place to stop in for a coffee or a beer. Bring your tourist friends and they will be impressed. \n\nAmbiance is very cool, bartenders are quick and attentive. Happy hour is a touch cheaper. Good place to kick back with your lap top and watch the world go by.", "author": "Yoen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "Nice atmosphere fair prices. Had the bagel with cream cheese and lox, which was really good. Had a latte which also was really good. Would go here again.", "author": "Westwood D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-03", "description": "Needed to get something to eat before going to Cobb's which is almost next door (you have to pass the entrance to a \"weekly\" hotel first).\n\nI read the \"YELPS\" before heading out to Cobbs, but didn't realize that this place was located right next door.  Anyway, the billboard proudly stated that they serve draft beer for $1.50 each until 10pm (duh, they close at 10pm).\n\nOK, I ordered a veggie sandwich with hummas, sprouts, tomato, onion and avacado on wheat toast.  It was $8, but really yummy.  And I'm a meat-a-sauras too!  So that is quite the compliment.\n\nMr. meat-a-sauras - won't touch anything healthy unless it's iceburg sweetie pie of mine ordered the BLT Club thingie on the Ciabatta, and he thought it was awesome!\n\nThere were little bistro'esque tables outside and some tables inside, along with couches and oversize lounge chairs facing a big screen TV.  There is a bar along the outside wall, books to borrow and enjoy and a seating area with Wi-Fi.\n\nThis place was awesome, the staff was super cool and friendly.  When we stood in line, we told other people about the great price of beer and then held their spot in line while they ran and had a drink.\n\nThis is a great spot and deserves your business....if you're cool enough to stand it!", "author": "Bee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-15", "description": "Awesome local coffee shop, I recommend the turkey sandwich", "author": "Guy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-07", "description": "The Zebra Mocha is heaven.  Love this place!", "author": "Kim S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-25", "description": "Great location, good menu and reliable internet have kept me as a customer for years. I've even had work meetings here, as it's usually quiet.  For someone who lives across the street and works from home... I couldn't be a more reliable customer (for years as I mentioned)\n\nHowever the customer service, which has always been painfully slow and lacking in personality, finally reached the point of losing me as a customer. \n\n-By slow, I mean 10 minutes for a bagel with cream cheese. If you plan on staying for hours, this is no problem, just don't expect your food to come quickly. \n\n-As for customer service, if you want a refill of a cup of coffee, you get it for half price. If you want a refill of an iced coffee, you pay full price. Even if you just spent $14 on lunch.  If you want to dispute this logic with the workers, you get snide comments about coming back later to talk to the owner. \n\n-If you need to print a page out, you can also do this here. But you'll end up paying several dollars for just one page. Far more than other coffee shops. \n\n-If you want a $9 sandwich, and aren't in a hurry, this is your place. \n\n-Usually not too crowded. Chairs are whatever, nothing fancy, no different than most other places. \n\n-Lots of tourists stop in and out given proximity to lombard street\n\n\nAs for me, there are just too many great options in the area to deal with an annoying workforce and expensive coffee. \n\nCafe Sappore, on the other side of the block.... HERE I COME!", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-01", "description": "Recession, re-shmession, that's what I say. \n\nFrom 4-7 pm here, good draft beer is cheaper than a grande starbucks coffee. Cheaper even than bottled water. \n\nFrom 4-7 pm here, all is just as it should be in the world.  So come mourn the loss of your purchasing power with a frosty brewski and watch as other patrons stuff themselves full of sinful splurges like waffles and homemade cookies.  \n\nMinus one star for the early closing time.  I rarely get off work before 7 pm, and the bosses frown upon returning to the office after a mid-afternoon beer break, even when I explain that financially (we're talking calories per dollar here) it makes more sense than a trip to the  vending machine . . .\n\n******UPDATE . . . . they are now open till 10 PM, with happy hour till 9. Damn, I am powerful", "author": "Chelsea R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-04", "description": "This is my favorite place to drink Firestone Walker's DBA. \n\nand not just because all beers are $2 a pint!\n\nThe folks at the cafe are all super-friendly and it's a great place to people-watch. Plus there's (free) wi-fi, and it's walkable from downtown. \n\nPlus, Firestone Walker on tap!", "author": "alejandro p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-13", "description": "I came here with my friend for TIRAMISU after walking her dog around the pier.  We were on the way back to her parent's house, and stopped by here, because it turns out that of the many years that she has lived in North Beach, she has NEVER had a tiramisu.  CAN YOU BELIEVE THAT?!  \n\nI love that they have outdoor seatings, because it's often troublesome to find a place to eat whenever we have a dog tagging along.  +1 star just for that!  \n\nBased purely on the tiramisu that we ordered here, I'd give it 3/3.5 stars.  It was alright, but having tiramisu as one of my favorite desserts of all times, I have high expectations for them.  I have still not yet found anywhere that can top the tiramisu from Whole Foods in Washington DC's Dupont Circle.  The ratio of sweetness and slight bitterness from was just PERFECT.\n\nCafe Greco would be runner up to Whole Foods in DC, meaning it's the best place SO FAR in SF.  I am still on a mission to find that PERFECT tiramisu in SF!  =D  \n\nSidenote: Not all Whole Foods are created equal!  I've been to the one in downtown SF and one in Colorado for their tiramisu, and was left deeply disappointed. =(\n\nBased on the other yelpers' reviews, I will definitely come back to try the paninis and other yummies! =D  Stay tuned for my updated reviews on this place!", "author": "Lisa Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "One of the best cafes in the area! Great prices, food, ambiance (whether to study, people watch or catch up with an old friend)! Only drawback at times - cash only.", "author": "Elle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-20", "description": "I'm happy to have this spot as my local cafe.  Coffee is always strong and tasty.  In the mornings, I'm partial to the Tiburon bagel (fresh basil, tomato, bacon, and cream cheese on a whole wheat bagel)  or one of their great waffles.  I like the one w/ fresh strawberries and chocolate chips.  My boyfriend enjoys the banana and pecan(?) one.\n\nLunch I love their BLT.  I know. . .I know.  A BLT is a BLT.  Not hard to make it tasty but for some reason they are especially good here.  Also they have great Ice Tea.\n\nService is always very friendly.  Free Internet access for those days you want to hang in a cafe and read up on the latest news/gossip/etc.  And I believe they just put in a jukebox-type thing for those who enjoy playing dj.\n\nOnly negative, like the other review said, is that it can get packed with tourists on weekends.  For some reason, big tour buses love to stop right in front of the cafe.  So that can make for a long and noisy wait.\n\nOverall, it's a great neighborhood spot.", "author": "Amanda U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "Great place to grab a bagel and sit outside to people watch. \nNot necessarily the BEST bagel I've ever had but the ambiance and service made it well worth the trip. I recommend.", "author": "Brooke L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-16", "description": "The drafts are now $2, but whatever, I'm older, uglier and more expensive these days, too. They're still $2 from 5 pm to 10 pm.\n\nBagel with hummus and coffee is $4. You can watch European football -- that's \"soccer\" to you, meathead -- on the plasma TV, sit on the couch or give tourists bad directions from the tables outside.\n\nIn sum: all you could want in a neighborhood coffee shop. Bravo 901.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-15", "description": "Wife and I came in for some breakfast had a breakfast bagel sandwich called Bellvedere wife had a Waffle, both ordered Americanos coffee was good breakfast was delicious and hot freshly made, nice ambiance friendly staff. Read sign that advertised Speakeasy for $2 a pint from 5-7 will be back for that.", "author": "Rafael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-25", "description": "Friendly staff. Great coffee.. GREAT waffles.\n\nThey put on Football whenever its on. I watch English Premier League games from here (and these days Euro)\n\nI spent a lot of Saturday and Sunday mornings here (And Cafe Sapore). I spent a lot of working days (Fridays) over here too. Its generally peaceful and you can do your own thing. No one bothers you", "author": "Brijesh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-12", "description": "Good wifi, good coffee and food, and $2 beers at happy hour. Booyah.", "author": "Tommy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-27", "description": "Conveniently a minute's walk away from Tattoo City, I walked in here for some food before my tattoo appointment. \n\nThe small cafe with free wi-fi boasts affordable breakfast items (nothing over $10) and a lot of sandwiches to choose from. \n\nI ended up selecting the Crunchy Tuna sandwich on ciabatta (you have your choice of bread) because it had avocado in it and a Pellegrino Limonata to wash it down with. \n\nThe sandwich was one of the best tuna sandwiches I'd ever eaten. It had toasty ciabatta, cheese, tomato, pickles, lettuce, sprouts and celery. The tuna mixture wasn't too creamy nor dry and the avocado was a nice touch. At $8 for the sandwich, it's a little pricy but I loved every bite of it, before and after my tattoo. Love to go back again!", "author": "kristin e."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-12", "description": "Stopped by for lunch after a walk back from Fisherman's Wharf.  Was hoping to have a Turkey Club on a Croissant, but they were all out of Croissants, so I had it on a baguette instead.  They failed to list the club had mustard on it, so I didn't realize until a couple bites in.  I'm not big on mustard, so I ate the meat and toppings but skipped the bread.  Also had a strawberry smoothie, again not bad, but not great.  Most of my downrank of this review is that the place is CASH only, and I preferred to use my corporate credit card to make it easier to expense later.  Really laid back place, and was otherwise fine, but who takes cash only these days?", "author": "Nick F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "Watch Peru - mex soccer game a couple of weeks ago, it was great!! Great happy hour, friendly bartender, very helpful and fun !", "author": "Karen P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-27", "description": "Great selection of vegetarian entrees and tasty looking smoothies and desserts. We didn't get to try any of it because the service was SO slow. I was the 4th person in line and 20 minute went by before I was the 2nd person in line. As I was leaving I noticed a small sign on the cash register that said CASH ONLY. good to know before you come here :)", "author": "Denise L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-10", "description": "Got nothin' but love for 901 Columbus!  I've been a lunchtime devotee since April, and it's by far my favorite cafe.  While it gets its fair share of tourists, no one can deny its close-knit neighborhood feel.  A real breath of fresh air from those tourist traps down the street!\n\nMy ideal solo lunch break includes a good book, a seat at the high counter along the far wall, and one of 901's incredible sandwiches or salads (or maybe some waffles one of these days).  The dining area is so cozy, and the music is great too.\n\nTheir salads and sandwiches are really, REALLY good.  Some personal faves that you need to try: 1) SUNSET BOULEVARD SALAD: baby spinach, cucumber, watermelon, feta cheese w/ raspberry vinaigrette...they used to have mint leaves & pine nuts but took them out!  If at all possible, please please please bring 'em back. 2) ANGEL ISLAND SALAD: baby spinach, pineapple, feta cheese, w/ dijon dressing...again, took out the pine nuts but still a good bet. 3) SEACLIFF SALAD: romaine, red onion, toasted pecans, sprouts, tuna salad, parmesan, w/ olive oil, balsamic vinegar & lemon...was a staple for me while on the South Beach diet. 4) DIMAGGIO WRAP: hummus, lettuce, tomato, red onion, pickle, falafel, yogurt dressing, and hot sauce...in a panini-pressed wrap.  I love this thing, it's incredible.\n\nThe only thing that occasionally irks me is the service: it's soo o o o SLO OOO O W.  I've watched potential customers walk out because no one's at the counter to take their orders, and a couple of times the staff straight up forgot to place orders.  I try not to let it get to me and I wouldn't have a problem with it, but my lunch break is only an hour long.  I still recommend this place to co-workers and friends, and I still support this cafe because it's simply a great place with a cool vibe.  If you've got a little patience, it's totally worth it.", "author": "Andrea U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-12", "description": "One of the best coffee shops in the neighborhood. A variety of great breakfast and lunch items and good coffee drinks.\n\nAfter 5pm, they have $2 beers. Sit outside, play a boardgame, drink cheap beers, and people watch. Sounds like a great afternoon to me.\nThey also have a great assortment of boardgames, and two computers to use for a cheap rate if you need to hop on the internet.\n\nTwo negatives- cash only. And because this place is so popular, sometimes service is slow. But if you don't have any place to go, this is a great place to sit and hang out.\n\nIt's a coffee shop you def. want to spend time in...not just hop in and hop out.", "author": "Holly O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-25", "description": "J'adore 901 ! I'm a local in North Beach and this is my fave coffee spot.  All of the staff and the owner are super friendly. Their WiFi is great and you can study there for a while without getting the boot.\n\nTheir espresso is great, and their cookies are THE BEST in SF. Get the chocolate chip cookie right after they come out of the oven and you'll never be the same again! \n\nSpecial props to $1 Draught Beer EVERY M-F from 5-10 pm... I guarantee you NO other place in SF has that kind of deal!", "author": "Mai A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-04", "description": "Any place that makes me feel like I'm in my Italian family's living room at Christmas is AOK with me. What is WRONG with me?!!? How could I never have been here?! \n\nI was waiting to meet a bunch of friends here for breakfast and the best song came on \"Eh Cumpari\" - Julius Larosa - please download it and sing and laugh along if you are Italian! OMG- I called my dad immediately and said, Dad- what's that song you used to sing at Aunt Marty's?! Doot doot doot doot- ooh sah-o-phone...\n\nToo funny.\n\nI only had a fruit salad here, which was yummy...but the bagels looked good and I'm definitely going back and going to see about parking my butt down with some wifi and Italian classic tracks in the background :o)", "author": "Diane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-02", "description": "Great food especially the tuna club and waffles. Comfy environment and free wifi. My favorite place to go and work.  Good coffee.  They are also into soccer so they show a lot of matches which is great.  they also show all other sports.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-18", "description": "To the owner of this establishment,  I think you've accomplished cafe perfection! To start, everything one can consume here is perfect! I've tried just about everything. Let's see...there's the excellent espresso to compliment a delectable cookie or homemade tiramisu. There's the deliciously healthy wraps and sandwiches (Sinatra for veggie-lovers, or the WiseGuy for the carnivores). The salads are just as scrumptious, the soups are delicious. The waffles are heavenly (with bananas and pecans...or OR strawberries and nutella...oh dear).  \n\nThen there are the beverage offerings! A perfect cafe must have excellent coffee and espresso which is exactly what you will find here. My first drink here was a zebra mocha which is a cafe favorite but lately, just having the solo espresso is satisfying as it is wonderfully rich and aromatic. Oh, and then, here's the best part...ahem... $2 drafts/$3 wines from 5pm?!? Seriously, you can't find a deal like that in any kind of cool neighborhood. Not only that, but the draft pale ale and house red wine is really really nice. \n\nThe perfect cafe must also have the perfect ambience. This spot is cozy, comfortable, and unpretentious with nice music and lighting and even outdoor seating if that's your thing.  To complete the package, there's free wifi, computers and a printer if you don't have your own, an array of books and board games, and ultra-friendly staff to serve you. You can even zone out and watch the tube. And if you don't want to do any of that, the location is great for people-watching. Grab a seat outside and watch tourists, locals, and cable cars pass you by.\nI've been to plenty of cafes in my time and this has remained my favorite the last couple years. In fact, I think I will head there now...all this time reviewing has got me craving an espresso. \n\nHere's to 5-star cafe perfection! Cheers!", "author": "turtle power e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-13", "description": "Um, let's see. $2 beers. Free wifi. Yummy salads (which I do admit have a bit too much cranberry dressing). Nice staff. Warm and pleasant environment.\n\nIsn't that enough to warrant a 4-star rating? Well just in case it isn't, this is THE spot to go to if you're waiting for a show at Cobb's next store too. Just come try it out.", "author": "Aaron F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-30", "description": "I think because they bank off of tourist going up Lombard they don't care to create a pleasant experience. I live right next door and would consider myself a \"regular\" there, not a bad spot- comfortable, clean and usually a nice crowd of peeps.  The coffee was decent, the bagels were tasty, and they have a really good happy hour ($2 beers). After my experience this morning I'll take my business elsewhere. My boyfriend and I sat at a table, opened our computers and not even 10 mins went by when the barista came by and rudely asked if we were going to buy anything. I hadn't even had a chance to contemplate what I wanted to eat but I was so turned off by how he approached us that I decided to leave.  He could have approach the situation differently, instead of asking us if we were going to buy anything maybe he should have asked what we wanted to eat- it's all about how you word things, in my opinion. I'm sure me not going there anymore will affect their business but I was just astounded by their ill-mannered staff.", "author": "Dani A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "Damn good coffee and goods prices to match", "author": "James G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-26", "description": "Food and drinks is yummy and not too pricey.\n\nI had the male employee and he was sorta nice but not really.....if that makes any sense.\n\nWould eat here again if I'm in the neighborhood which is rare.", "author": "? ?."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-05", "description": "The husband and I have our best Sunday morning warm fuzzy memories here... sitting at \"our\" table outside in the sun with our \"regulars.\"  Me and my Bodega bagel with avocado, tomato and sprouts and he with his strawberry/chocolate chip waffle.  It evokes my appreciation every time for being a local and just walking down the street to enjoy a casual breakfast reading the paper.\n\nIf I could change two things it would be: \na)  Their coffee is incredibly bitter (and I typically drink it black)\nb)  I eat here at least two weekends a month and I still don't feel like anyone there recognizes me.  Someone play me the Cheers song people!  :)\n\nI'll keep coming.  For some reason I do like it better than it's next door neighbor Cafe Sapore.", "author": "Shasta N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-07", "description": "Any respectable review of this place must begin with a mention of the $1.50 drafts.  From 5-10pm... like every day.  Awesome. The setting is super cozy with couches, dark wood floors and a real neighborhood feel.  Even tourists stopping by on the way to the Wharf seem to blend in with the locals, as people sip, surf, read, and write.  \n\nThe sandwiches are solid and the juice selection is ample, but let's get back to the draft beer.  On a clear evening I can sit outside with my pals, do some people watching and try to solve the world's problems without breaking the budget.  My buddy Thel turned me on to this place, and it's worth my first shout-out on Yelp.", "author": "Renner V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-14", "description": "Being a true yelp-believer, I researched and listed highly rated North Beach restaurants prior to walking the Barbary Coast Trail. We got as far as Coit Tower before the hunger pains hit, we were drunk, dehydrated  and tired. 901 Columbus Cafe happened to be the closest spot on the list. Yelp rarely disappoints.\n\nThey had a variety of vegetarian sandwiches and wraps. I got the DiMaggio, a vegan wrap with falafel, pickles, hot sauce, veggies and grilled to crunchy perfection. One bite into it and I was in food heaven. My friend had the Sinatra and seemed satisfied with it. \n\nFriendly service, great food and nice atmosphere. Too bad there isn't anything similar in Santa Clara.", "author": "Tif W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-07", "description": "Great place to sit and write Yelp reviews... :-)  Not too noisy--comfy couches and a TV usually tuned to some kind of sporting event.\n\nPastrami Melt was delicious a few days ago and the guy that handed it to me was cute to boot. \n\nI'm actually sitting here right now contemplating my lunch and can't decide because everything looks delicious.", "author": "Krystha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-12", "description": "$2 firestone beer on draft. No need to say more.", "author": "Mauricio S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-12", "description": "I went to 901 Columbus Caffe for a quick dinner before class and it was okay. I had a good vegetarian wrap which took about 10 minutes to make even though there were only a few people there and no one else had ordered food. There is a lot of seating and free wi-fi which is nice. The music is pretty loud which makes it a little hard to study. Cash only.", "author": "Gina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-15", "description": "If you like the feel of a local coffee shop coupled with great coffee, excellent sandwiches and free WIFI, look no further.\n\nI had the breakfast burrito with eggs, spinach, cheese and bacon. This thing was grilled on a panini press and was served piping hot. Okay I'm hungry again. \n\nThe coffee was also exceptional - I opted for the regular instead of the flavored. Since that is usually my preference, I hold high standards for the flavor of the actual bean (no hazelnut to drown out a sub-par bean). This one passes the test with flying colors.\n\nOne thing worth noting is that there is a $5 minimum purchase for credit cards.\n\nWe will definitely return when we visit SF again!", "author": "Chris R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-31", "description": "Good food and coffee, tainted somewhat by the usually loud bad music.\n\nGreat nighttime happy hour.", "author": "Alex N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-28", "description": "Totally average coffee shop. Maybe during happy hour the ratings are kicked up, but my lunch panini & cappuccino experience was pretty blasé. No way would I give this 5 stars.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-10", "description": "I've been here several times, especially when I lived in NB. I love 901's waffles and paninis. They are delicious! I also dig the environment. It's mellow, yet helps get the juices flowing if you need to do some serious work. The people are pretty nice here and 901 draws a good crowd. \n\nOne Sunday morning, my bf and I were earnestly looking for a place to eat some food, have coffee and just enjoy a nice Sunday breakfast. After looking for parking for what seemed like FOREVER, we walked up to this restaurant packed with patrons. Without time to kill, we left. 901 was across the street so we went there. They definitely helped resolved our hungry bellies and my thirst for caffeine. \n\nI have yet to go there for happy hour but I can only imagine it's a chill spot to have a couple of beers and chat with friends. \n\nGood stuff. Two thumbs up!", "author": "Dorothea G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "Best happy hour in San Francisco in my opinion.  $1.50 drafts... yes, only $1.50 for a pint of ice-cold beer!  Can you believe it... $1.50?!?!  Happy Hour is 5pm - 10pm, any day which means WEEKENDS, too!\n\nIt's not a bar, obviously, it's a cafe.  Actually, it's called 901 Columbus Caffe (two \"ff\"s), not to be confused with one of my favorite bars in North Beach, Columbus Cafe.  Food including soup, salad, and sandwiches; and drinks like caffeinated drinks and $1.50 draft beers!  There's also some really good looking desserts like home-made tiramisu, various cheesecakes, biscotti, and other sweet treats!  Big, flat screen television showing sports and lots of board games to play with -- my boyfriend, Ian and I played a great game of Scrabble the last time we were here.  It was so much fun.  \n\nGreat casual atmosphere, lots of people on their laptops taking advantage of the free wi-fi.  Outside seating also available during those hot San Francisco nights -- great for people watching (tourist and locals walking by or on the cable car, and looking at the Bikram students keepin' it hot doing yoga across the street).  \n\nWill keep comin' back for more... more beer, off course.  Now for the catch... there's only 3 beers on-tap, only one the last time we were there, but it was still worth it because I cannot think of a better way to spend my $1.50 :-)!", "author": "Celeste M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-23", "description": "I have a love/hate relationship with this place and right now I'm on the hate side of things... well, hate is a bit too aggressive.  Maybe just the not-good side.  \n\nThe service is pretty awful compared to other coffee shops in the neighborhood and i get the feeling that the guys behind the counter couldn't care less if you were there or not.  Not a big deal usually but annoying when there is no line and you are still waiting to place your order.   \n\nI do like the atmosphere otherwise.  The beer is cheap, the coffee is good enough, and even the tiramisu is pretty good.  Not a bad option but for now im headed to other coffee shops.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-01", "description": "I wish they had more places like this in southern cali. This place is awesome. Great service, great prices, great food! I had no idea what to order, had very little cash & was trying to feed 6 people haha. I wasn't expecting much, but the guy taking my order was really patient with me and very helpful. When I took the food back to our hotel, everyone loved em! I wish we could have tried everything else on the menu mmm...", "author": "Keith O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-19", "description": "I spent a considerable amount of time at this cafe during my trip. My friend had to work on some freelance writing so I put in a decent amount of reading time. I liked how relaxed it feels here - the staff is friendly and you don't feel like you have to rush to finish. It's a great place to get some work done or just spend some alone time if you want to graze and read. \n\nI was pleasantly surprised by my \"Crunchy Tuna\" sandwich. I usually don't order tuna sammies because they're always so mayo heavy and soggy but this one was just right and loaded with veggies.  The second time I was there I had a bagel with lox. It wasn't as good as the tuna sandwich but I think it's because I'm admittedly a bit of a bagel snob. I can't lie - I think bagels are better in New York. \n\nI'm sad to say I didn't have any of the buck fifty drafts.... next time.", "author": "Alli J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-28", "description": "901 Columbus is great.  I come here all the time.  The staff is friendly and makes you feel right at home.  The coffee as well as food is delicious (try the falafel).   What is remarkable is how they have made it into a fantastic place to work during the day (very fast internet, low music volume) but also a really cool place to hang out with friends during the evening ($2 beers!).  My favorite cafe in North Beach.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-05", "description": "Came here on a lazy Saturday afternoon.  Needed a quick lunch, so I walked down the block and into this local cafe.\n\nThe interior's very cozy, with a large tv, benches, and outlets everywhere.  Plenty of folks just hanging out with a book, or a laptop... or a few friends.\n\nI had the pesto chicken panini, and it was delicious!  A pretty big portion, and was surpirsed I inhaled the whole thing.  It was that good.\n\nMy roommate came here for breakfast and mentioned the blueberry waffles being superb.\n\nI haven't been here for happy hour yet, but I do the see a decent size crowd forming when I walk by at night.", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-11", "description": "I don't think you can find Speakeasy for $2 a pint in many places.  I'm staring at a tap with Prohibition, White Lightning, and Big Daddy.  \n\nThe food is decent, but nothing to write home about.  The coffee is okay, but ~ shots are not double ~.  \n\nThey gets five stars because they do a couple of things really well though.  The ambiance is really chill, they have free wifi, outlets, and good, cheap beer.", "author": "Chris J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-05", "description": "The draft beers are quite good and the happy hour is very reasonable in cost. The cookies have been good sometimes and just so so other times. In general the food is good, but slightly overpriced. The espresso is good, but the coffee has not always been the best. I've had it a few times when it was luke warm and kind of burnt tasting. This place is a good place to study in the day time, large tables and plugs for your laptops.", "author": "Joy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-15", "description": "Love this place. It's near where I live so most mornings I'm camped out there with my laptop eating one of their killer waffles and surfing the web with a cup of coffee in hand. The people are friendly and the food is good too (try their Pastrami sandwich for lunch), and if you're a laptop using fiend like me, don't worry....they'll never look at you funny or pressure you to leave.\n\nI haven't been there for the $1.50 drafts like other Yelpers have mentioned, but I HAVE been there when the crazy old Chinese guy waltzes in, does a figure eight  around a couple of tables for no apparent reason, and then leaves. Which is, like, basically every time I've been there...", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "This place is fantastic, there was plenty of room and tables, with free wi-fi. The food is ridiculously tasty, and the owners were extremely friendly. Plus they have a really good happy hour. and this cappuccino us treating me quiet well this morning.", "author": "Angus P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-06", "description": "Great service, atmosphere. Had two sandwiches with a friend - solid.", "author": "Danica F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-17", "description": "Free wi-fi, delicious coffee drinks, pastries and CNN on the flat screen TV plus fun people watching (tourists scrambling to get on the cable cars).", "author": "Johanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-11", "description": "This is my favorite coffee shop in the city -- it wins best ALL-AROUND.\n\nThe food = excellent.\nThe staff = friendly.\nThe coffee = delicious.\nThe prices = fair.\nThe internet = FREE\n\nTry it!\nK, thanks.", "author": "M J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-11", "description": "The recipe for a five star cafe:\n\n- A delicious menu that can keep me all day. Start me off with a distinctive breakfast, follow that with a vast array of sandwiches and finish it off with an afternoon parfait snack. 901 Columbus delivered on each one - an excellent belgium waffle, a very satisfying turkey on ciabatta (bonus points for not charging to swap mayo for hummus) and a generously sized strawberry filled parfait. And don't forget the coffee with sugar free syrups - 901 has that covered as well.\n\n- Free internet and plenty of outlets. Done and done at 901 Columbus. Too bad I was using it mainly for work.\n\n- Friendly and attentive service. Loved how the guys working the counter let me open a tab. I was never rushed, totally could have been there open to close and no one would have cared.\n\nNext time I might.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "Love the salami & avocado sandwich on toasted Italian bread... the basil adds a wonderful twist of flavor.  Their tiramisu is small, but moist, with just the right amount of cream & ladyfingers.", "author": "May L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "LOVE this place. Decent food, excellent happy hour special, super friendly staff, WiFi, board games, TV....just a great place to hang out with a small group or by yourself without feeling creepy.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-05", "description": "Hands down my favorite cafe. Great for families. Very welcoming and attentive. The Zebra is a knock-out coffee drink, as good as anything in North Beach. Highly recommended.", "author": "tegen d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-17", "description": "I'm hesitant to write a review in fear that I won't have a seat next time I go over.   I simply ask that if you, attractive yelp user, decide to show up here based upon my review, that you offer me the open space next to you.\n\nJust discovered this place - and it is EXACTLY what I want in my neighborhood.\n\n1) A coffee shop open later than all the other ones!\n2) The option to switch from coffee to Beer!\n3) A wide range of food that suits coffee breaks, snacks, and meals.  The panini I had was pretty decent.  I hope to try more things.  \n4) Free WiFi without the annoying Starbucks sign-in BS \n5) Great atmosphere. Comfortable, spacious, and relaxing.\n\nUpdate:\n\nI come here A LOT.  \n\nThe owners are very friendly, and you can't beat $2 beers.  Seriously.", "author": "Stryrker S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-02", "description": "I like this place because it has wi-fi internet, the service is really nice and very down to earth. There a lot of different things to eat and drink while you hang out there for a few hours and they don't care. The place is warm when it's color outside instead of most places that don't want to spend the money on the heat bill. It just goes to show that this place, that sells some pretty good vanilla latttes, cares about the customer first.\n\nThat's just the vibe I get.", "author": "Katherine F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-05", "description": "901 Columbus Cafe is a good place for a bite and beverage before or after hiking Lombard Street. Small corner building with limited indoor and outdoor seating, free Wi-Fi and some quality fare. Service was a little slow due to a lower staffing level.", "author": "Jay M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-01", "description": "I've never before been accosted for using the bathroom. I've gotten my morning coffee here on several occasions. This morning... after walking several blocks... I really needed to use the bathroom. I had my laptop in tow... clearly intending to stay. but as i entered the bathroom i was dragged out and asked to purchase something first. the man behind the counter was then quite rude and unsmiling as if he didnt want to serve me. not coming back .", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "This is your cafe - look no further if you find yourself wandering in north beach. Fresh homemade sandwiches, pastries, cakes, and locally roasted bean. Plenty of sitting space and wonderful people watching (it has the corner of columbus and lombard to itself after all). And let us not forget, $2 drafts from 5pm until close.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-27", "description": "I'll start out with the positive. The atmosphere is great and it's a local find. \nThe negative just relate to the short hispanic worker that works at the cash register.  We walked in and before we could load our laptops up, we were told that we had to leave because the internet was for customers only and that we had a time limit to leave.  Then we purchased a bottled drink and after we paid he told us the cafe was closing in a couple minutes.  When we asked for the money back since the cafe was closing soon, he said that he could not give us our cash back because he already gave us the change.  All he had to do was give us the couple dollars we gave him, in return for the closed bottle drink that was still on the counter.  I would love to speak to this employees manager.", "author": "Brooke Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-28", "description": "This place is awesome. Cozy, inviting, warm, diverse. The food is excellent and better than you would expect. Breakfast burritos are super yum. Try the bacon, egg and cheese. It's big. Their lattes are great and they have these amazing aromatic waffles that beg to be ordered. The chocolate one has poof of cream and the blueberry one takes my vote for favorite. \n\nAnd what's better than $1.50 drafts! Save up your laundry money and spend it all here! Outdoor seating has made it more of a chill place in the evenings where people smoke butts and have what I'd imagine to be life-changing conversation. \n\nStaff is real nice, unlike another reviews suggests. Believe that. I go here often, too. Place gets crammed though from the tourist rush, so don't get cranky if you have to wait. Peace.", "author": "n b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-28", "description": "First of all they were AMAZINGLY rude.  Get in line WAY before 10:00, watch as the super super super slow staff acts all bitching and snotty and SLOOOOOOOOW, and get up to the front of the line right in time for the guy to say, \"Oh sorry, we JUST stopped serving because it's 9:50:14, despite our LYING sign outside that proclaims beer until 10:00, because, you see, we love to lie, we are liars and such.  It's just who we are.  Liars.  Child molesting liars.  We can't help it.  It's just how we roll, you know.  Yep, molesting children and lying, the two best things ever, other than pissing in our customer's drinks, of course.  Oh, and we are gonna be douche bags and pretend that last call was 14 seconds ago.  Oh and by the way, I'm a total dick, don't ever give me a tip or visit my establishment.  That goes for ALL of us who work here.  In fact, not only don't even tip us, intentionally spill any sort of foul smelling difficult to clean up thing that you can on your way out.  We appreciate the extra work since we are COMPLETE ASSHATS.\"  \n\nI'm paraphrasing, of course.", "author": "Mason G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-20", "description": "$2 beers and board games???? YES! they have both.... \n\nGreat place to hang out with friends and drink a couple of beers, coffee or just chill. \n\nThe food is also great! The tuna special is MOUTH WATERING kinda want one right now just thinking about it. Great little spot!", "author": "Ka C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-20", "description": "Stopped in shortly today while waiting to get let in for Freaks and Geeks next door at Cobb's and ordered a Mocha Latte. He made it right there for me without making me wait elsewhere. It was reasonably priced and delicious.", "author": "Jaimie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "The baristas know what they are doing at this convenient location on Columbus. The coffee is good, and the cafe style food is great too. I stop by occasionally and enjoy the 2 dollar pint night.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-15", "description": "This place is amazing.  They make a great cappuccino and the sandwiches are pretty good.  It's a nice place to study and they have free wifi so bring the laptop.  Check it out.", "author": "Allison P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-10", "description": "You will find me sitting at a table outside of 901 pretty much whenever the weather and my schedule premits... There are a host of reasons to come here; the least of which is that it's two blocks from my home. They have an excellent beer special everyday from 5pm-10pm, $1.50 for Speakeasy, Becks or Windermere hefeweizen. Their food is a nice selection of wraps, salads and both hot and cold sandwiches really tasty and they always have super fresh veggies.  Also the owner \"T\" is a really nice and friendly guy that cares about his establishment and seems to genuienly want people to enjoy their time there.", "author": "Thel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-23", "description": "Ridiculous happy hour beer specials, and just an overall chill vibe; great place to relax.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-10", "description": "This is a great cafe so my only sour note is that it closes at 7 p.m.  What I like about this cafe is that there are a lot of plugs for laptop work.  They also have computers if you don't have your own.  They have an assortment of comfy seating (couch, love seat and stuffed bench) and traditional work seating (wooden tables and chairs).  Their Zebra Mocha is yummy.  They have a big screen t.v. if you'd rather watch t.v.  They offer real food if you crave non-pastries.  Service is fantastic (T and his team are major sweeties).  In fact, they took care of my one time complaint of insufficient caffeine high by customizing my coffee order for me.", "author": "Caitlyn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-04", "description": "As I sit here, starring at my lap top reading  a review about people starring at their laptops wasting there day, I ordered another $2 dollar beer and didn't really care.  The beer is good too.  Nice hoppy taste, mouth waters for more...", "author": "Greg Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-16", "description": "New to North Beach from the panhandle--on the quest for a local cafe to hang. Planned on writing my xmas cards and having a glass of wine and stumbled upon Monday movie night, nice since I don't have tv or cable (gasp) at my new place. Good food and I think the menu said happy hour every day from 5-10?!? or maybe my eyes deceived me. Good soup and nice crowd, think I will be hanging out there to people watch and relax on the couch with a good book.", "author": "Laurie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-04", "description": "Great coffee, comfy seats, free wifi, smiling friendly staff: the recipe is simple and this place gets it just right. If you need to take a break and chill out in North Beach, try 901 Columbus.", "author": "chewie33"}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-16", "description": "ugh, went here in my lunch break today. service was terrible. I ordered the #41 to go, which was just spinach, feta cheese and pineapple, with a dijon dressing. it was terrible. i waited 20mins for this salad, and when i opened it up there was no dressing and hardly any feta. seriously 20minutes in a nearly empty place for this?!  i also noticed the girl behind the counter, in the green dress and white shirt, who was making food, without gloves, with her hands all in her hair. yuck. never coming back.", "author": "Allen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-20", "description": "Awesome place. Comfy seating, clean, tons of outlets (hint: look behind the bench seats along the wall -- that escaped me for a few minutes until I saw the girl behind me plug in), friendly service. Feels much more like a neighborhood joint than a lot of the other places I've frequented in North Beach. Good coffee and free wifi means I'll be back.", "author": "Allison L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-26", "description": "i can't believe i have been going to school for two years down the street from this place and i just discovered it a few weeks ago. i feel like everything i have tried here is good. good smoothies, excellent vegetarian sandwiches with a variety of options like feta cheese and basil, avocado and sprouts, you name it. the servers are nice too. one stopped me on the street and said hi! (i might have a small crush on one guy who works here, shhhh)\r\n\r\nedit: i went there today and had my first bad experience. i ordered a bodega on wheat bread and one server totally forgot to give it to me. i was sitting right there the whole time. \r\n:( maybe i'll get something for free next time, you know, after my boycott.", "author": "Oleya P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "I was looking for a place to lunch when I bumped into this cosy place. What I like is that it's a little out of the touristic area's, so it's not too crowded. When I was there (2PM on a Saturday) there were some people doing some work on their laptop with the free wifi, some people reading a book, and others were watching the Italian soccer match on tv: just a great relaxing atmosphere.\n\nI ordered a sandwich with a cup of tea, and both tasted great. Especially the tuna sandwich was fresh and delicious. The staff was friendly, the music blends into the space and it's just a nice place to hang out or do some work.", "author": "Frank d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-03", "description": "It's a fine neighborhood cafe for coffee and doing homework.  But I wasn't impressed with the breakfast or the service.", "author": "Jess S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-03", "description": "Great place, try the zebra mocha. Free wifi is always nice plus outlets to charge up.", "author": "stephen j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-25", "description": "Nice location, delicious paninis, and decent tiramisu. Prices were ok. We weren't able to stay for happy hour, but I bet that would have bumped me up to a 5- main reason we're staying at a 4 is that the women's bathroom smelled awful and was sort of dirty.", "author": "Rika Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-30", "description": "I was wandering north through San Francisco on foot for a long time -- I finally stumbled into 901 Columbus Caffe when I heard Belle & Sebastian playing and went for an iced chai.  A great place to spend an afternoon with a laptop, chatting with friends, etc.  And I had a delicious onion bagel with cream cheese, tomato, and basil.  Mmmmmm...", "author": "Moku D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-26", "description": "The coffee is great, the outside tables have sun for most of the day and the owner is almost always there making sure that things run smoothly. The food is good and they also have beer on tap. Sometimes it gets a bit crowded with tourists headed up Lombard Street, try it on a weekday.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-12", "description": "YES!  My second 5 star on Yelp.  901 is an amazing little corner cafe.  The staff is really cool and the food is delicious...so good.  Last time I had the Wiseguy and it was one of the best things I've eaten while here in San Francisco.  Prices are good and they also have a nice selection of beer in the fridge.  It's right next to my apartment and has a great atmosphere, so you'll definitely be able to find me here more often.", "author": "Nate V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-16", "description": "Just moved to the neighborhood and looking for a regular \"go-to\" spot near by. Happened in on this place because of the $2 beer sign outside. Had a salad, which was great and very huge. Also, there's a few outdoor tables, which is a huge plus. I'd say though that the food is a little overpriced (though it's really made up in what you pay for beer) and that it's a little dark and cluttered inside. But all in all, this is definitely a contender for my usual spot.", "author": "Emily F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-26", "description": "I work next door so I'm in here a lot. I'm a big fan of the salads, sandwiches, cookies (if they're fresh out of the oven which they often are), and the zebra mocha. Days if I get out of work the $1.50 beers from 5-10 make any evening more bearable.", "author": "Constance C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-14", "description": "This cafe has a long list of foods. I order either something to eat or drink and I'm never disappointed. The locals hang out there, and the tourist stop for a meal. This is a great place to eat.", "author": "Manuel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-13", "description": "A great spot:  comfortable, clean, wireless.  Friendly, laid back atmosphere.  Great tasting coffee.", "author": "Sal M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-19", "description": "three star smoothies and 4 star bagels.\nand the guy runnin the joint was just such a sweetheart.\nlove all the chairs outside with the happy lil couples soakin up some sun.\ni'm doin that next time I'm there.", "author": "Jeremi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-08", "description": "The place sits in a great location and has outdoor seating. Everyone who works there is super nice, probably because the owner, T, knows how to keep them happy. A big TV where you can catch a soccer game during the afternoon. They have a scanner too, just in case. Beers are 1.50 after 5, doesn't really get any better in North Beach. A great SF spot!", "author": "Zhenya S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-12", "description": "I had two surprisingly negative experiences with two different cashiers today.  First, when I was charged $3.50 for a bottle of water, I told the cashier it was too much and he told me that if I didn't like it, I could go across the street to the liquor store and buy a bottle of water that was cheaper.  I then ordered a bowel of soup that was 80% broth.  When I complained about it, the cashier told me that that's the way that their soup was, he took the bowel back from me and gave me my money back.  I asked to get the contact information of the manager, and the employees wouldn't give it to me.  Later, the manager came in and I told him what happened.  He told me he would be happy to treat me to their tiramisu to make up for my troubles.  I told him that I didn't want any tiramisu.  He asked me what would make up for my experience.  I told him, that if I was him, I would offer to comp the salad and water that I  had paid for because I had such a negative customer service experience.  He refused.  I told him that I would write a yelp review and he told me to go ahead.  With so many different cafes in N. Beach, how can an establishment afford to treat its customers like this?  I know that I'll make sure to choose one of the other 50 alternatives in a 10 block radius next time.", "author": "Kate H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-24", "description": "We chose this cafe one afternoon because it was the midway point btwn our house and the hotel where our friends (country mice freed from their children for the day) were staying.\nWe had coffee, bagels and biscotti and it was all delicious.\nI loved our Lodi bagel; feta cheese, tomatoes, basil and olive oil. Nummers!\nI hope we have an excuse to come here again because their whole menu looked oh so good!", "author": "A W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-21", "description": "this place would be a perfect location for a starbucks. i don't think there is one within 2 blocks so whats the deal? ;)\n\ni sit and write chez 901 as a host of locals and tourons alike alight to imbibe and nourish. a little girl with her own mini stroller just walked out the door with her prego mommy. there is a horror flick on the flatscreen and a hot curly haired girl banging away on her black mac. the wait staff is super friendly and the pastrami sandy i had yesterday was terrific. \n\nso what's it all about? i feel dry bowled creatively since our latest investor prospect decided to make us look stupid but i will say that this is a good lower no. beach hang. free wireless and though the occasional busload of chinese tourons descends, its never too crowded to find a spot to work. \n\nso eat heavy...", "author": "tommy p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-30", "description": "This is my spot, my jam, my homie.  I love love love the coffee, it is amazing.  The people that own it, and work there are so great, and they really care about the neighborhood.  This is the type of buisness people want to have in their hood!", "author": "Rachel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-25", "description": "If I'm in North Beach it's my default coffee shop. I will try new places as the urge strikes me, but if I need somewhere to be for a while this is a good choice. Open wireless and available outlets mean I can take my laptop and relax. Staff has always been attentive, polite, and interesting, moreso in all categories than I generally expect at a coffee shop.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-01", "description": "I used to live across the street from this place and I miss it dearly. Fresh food, great coffee, and very nice owners. It was like my version of Central Perk. Seriously. Couldn't walk by without popping inside. I miss you 901!", "author": "Cat S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-25", "description": "Words cannot express how great 901 is.  The staff is friendly and remembers you by name.  The food is high quality and consistently great.  The coffee is excellent.  AND now they serve beer for $1.50 til 10:00 pm!!!", "author": "gaby g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-30", "description": "Awesome spot for working.  Good food, reliable internet, tho not a whole lot of outlets.  Friendly service, TV inside a bit noisy, but cheap beers, fair amount of space.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-14", "description": "Great service, free wi-fi, good music, outstanding coffee, really good bagels. What more can you ask?", "author": "Kyle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-07", "description": "Strolled in here after spening 4 hours exploring russian hill on foot. Peckish for a panini, I ordere a pastrami one and it satisfied my expectations indeed. The cappuccino was the best I've tried even beats blue bottle... this place commands the repeat of a visit.", "author": "isis n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-22", "description": "If this place had beds, I'd move in. :-D $1.50 Big Daddy IPAs make me happy.", "author": "Cameron K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-28", "description": "They're open later! Yay! And the schwerma is still great- that chili sauce &amp; yoghurt hits home. Also- the happy hour deal is unreal, as other yelpers attest.", "author": "Anna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-24", "description": "Great local cafe for a quick bite or a ridiculously good deal on beer - $1.50 drafts from 5-10pm everyday! Good not great  food but a much better option than the neighboring cafe. Don't expect glowing service though unless you're wearing skinny jeans and give off that \"I hate my dad vibe.\"", "author": "Justin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-02", "description": "I come here many weekends for breakfast and coffee. For breakfast I usually get the yogurt granola parfait, a waffle, or a bagel sandwich. All hit the spot. Prepare to wait a while for your breakfast/lunch on the weekends since they get pretty busy and don't have much help in the kitchen area. There is a good seating area with free wifi inside, and also seating outside for warm days.", "author": "Laura W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-23", "description": "great atmosphere for watching a baseball game. loved their firestone beer. the al copone sandwich was tasty.", "author": "George I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-29", "description": "Columbus Caffe rules.  When I first moved here I was there pretty much everyday looking for a job and place to live.  Got lunch there, had coffee there, drank a beer there.  Its a cool place.\n\nThe employees are pretty cool as well.  I shall not forget Columbus Caffe....", "author": "Richard C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-07", "description": "Love the neighborhoody vibe, the board games, the comfy couches. Great waffles- banana pecan and strawberry chocolate chip were delicious! Tasty smoothies and fruit juices. I had something called Cubana or something; watermelon and lime juices fresh squeezed and blended- the perfect drink on a summer day", "author": "Jay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-28", "description": "That's pretty much where I go for coffee when I walk out of my house.  Great coffee!  Can't really comment on the food as I hardly eat there. But the interiors and the outdoor area could use some serious updating and beautification (please, please, please).  I would love to buy the coffee from then and then go and sit at one of their neighbors outdoor table at Caffe Sapore (don't care for their coffee).  I am glad they finally put some planters out there.  It's a first step. Thank you! The staff/service is so-so unless the owner serves you.  He is super nice and friendly and always smiles.", "author": "Manuela P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-15", "description": "This place is great.  Awesome atmosphere, its warm, and comfortable. Has great coffee and food.  Enjoy a coffee in the morn and guzzle a beer in the late afternoon!", "author": "Laura J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "901 Columbus serves a variety of panini on foccacia bread and each one is spicy... exactly the way I like it.  I also had minestrone soup, which tasted fine, and italian soda.  Unfortunately the selection of syrup flavors for the soda is a bit small, but that just pushed me to be more adventurous and try something outside my usual strawberry-kiwi order.  Service is great; the waiter keeps an ironic playfulness about himself.  He was also more than happy to give my partner tips on how to drink her italian soda, as it was her first time.  The TV was playing The Never-Ending Story with captions.", "author": "Tim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-23", "description": "This place is the Cheers of San Francisco..... complete with the group of \"intellectuals\" who enjoy most of their day at 901 Columbus. It even has an owner / proprietor like Sam.... that would be Tarek.... or \"T\" for short.  He and his mother run the place and they are both wonderful people. The food is honest and fresh. The beer is CHEAP... but a great local brew. The coffee is superb and I believe custom crafted for 901 Columbus. My only complaint is that I can't spend my entire day here. I also think Tarek should open another business that has a full bar and kitchen. I can't wait to see what he could do with that!", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-31", "description": "The sandwiches here are delicious and a great deal for the money. They average $7-9 and are pretty big. The atmosphere is great for just kicking back or getting some work done. It kind of feels like a cafe fused with a bar. There's free wi-fi and $1.50 draft beers from 5-10pm everyday. With both outside and indoor seating, you can really make this place work for any situation. Service is friendly, although you can expect to wait 5-10 minutes for your sandwich. But boy, is it worth the wait. Paninis, wraps, whatever you choose - they're all wonderfully delicious. Plenty of vegetarian options, too.", "author": "Willy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-12", "description": "I was recently laid off from my job, so I have been on a quest to find cozy cafes to spend my days searching for jobs.  Columbus Cafe is near my home, so I thought that would be a great place to start.  Internet is free, coffee is good, and it's a great spot for people watching. You can choose to sit outside or you can cozy up in a chair or couch on the inside.  I only had the fruit and coffee, but there was a wide array of menu items to choose from. I would definitely recommend this spot if you want a quick bite to eat or want to curl up with a good book.", "author": "Shawna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-21", "description": "901 Columbus is a great neighborhood cafe with distinctive and tasty sandwiches, friendly help behind the counter, free wireless internet, and (of course) good coffee.  What more does a digital nomad need?", "author": "Robert P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-19", "description": "Free Wi-Fi. Super friendly staff. Great coffee and tea drinks (my wife drinks the coffee and I drink the tea). And, some nice little food dishes. Plus, they have a beer and wine license, so it's a great little spot to have a business meeting and have all the options available.", "author": "Bryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-05", "description": "I really like this place.  The people are friendly, the sandwiches are good, the atmosphere is cool, the wifi is great, and the latte's are fab.  I will be coming back again and again.  The only thing that gets old are the tour buses that stop out front and unload mobs of tourists that make their way up to the curvy part of Lombard... but that is just a function of being in North Beach and has nothing to do w/ 901.  Great spot.", "author": "ardian b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-21", "description": "I like this place.  It is laid back, warm and cozy inside.  A great place to sit and have coffee or the occasional snack.  Very comfortable.  I have tried several bagels from the menu.  All have been good.  The baristas seem to remember you and have always been nice.  I get a latte and have never been disappointed.", "author": "Robert A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-15", "description": "Love this place. Great environment, good food, the best Chai I've had in SF, and the $2 draft beers are a great way to transition away from a workday. Friendly staff and a few choice seats round out a great caffe.", "author": "Eric D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-03", "description": "This place was awesome. The paninis were good, they serve beer, are a decent price and it has a cozy atmosphere. I can't wait to go back.", "author": "Vesna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-10", "description": "I live in the neighborhood and have never gone here before today.  My boyfriend and I loved it!  It was a super great value, friendly service and delicious food.  We'll be back for the great happy hour- two buck drafts and three dollar house wine.", "author": "Stacy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-26", "description": "Found this place for lunch via Yelp.  The sandwich I had was delicious.  The people there were friendly.  The atmosphere was pretty laid back - a few people working on computers, and there might have been someone reading at one of the tables.  It felt like a great place to study/work for a while if you're looking for a place for that.  If you're just looking for a good place for lunch, then this would be your place, too.  I'd likely go back frequently if I lived in the area.", "author": "W Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-12", "description": "By far the best Cafe I have been to in North Beach! It is family owned and you can often find the cute little mom running around working just like the other employees. They have free wi-fi, a happy hour that will rock your world $2 beers and $3 wines.-all night. This place is so relaxed and chill and you can just sit here and mingle with the other people here or get lost in a good book. The food is amazing for cafe food and you can totally tell everything they use is fresh. The employees are nice and actually like helping definitely recommended", "author": "Cleo H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-08", "description": "when i first moved to this city, i would go here so often that two of the guys behind the counter would already recognize me and smile.  it's the kind of place where i walk in with my headphones and take them off because the music is always on point.  the chais are delicious and the sandwiches are light and delicious.  $1.50 draft happy hour?  AND... they just extended their hours from 7pm to 10pm, which had always been a wish of mine.  cozy ambiance, super friendly staff, good food, coffee, chais and beers... and all pretty cheap..?  come on dude, how can you lose?  i LOVE this place.", "author": "Beccie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-29", "description": "I write this review as I enjoy a stupendous latte and wonderful peanut butter cookie.  The service was prompt and very friendly.  The atmosphere is comfortable and relaxed. I'm only in San Francisco for a few days, but I plan on visiting here several more times.", "author": "Jason G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-26", "description": "Possibly the best atmosphere in North Beach, but with the worst coffee. They could serve instant coffee, though, and I would still come here every day. It feels like a living room, with a couch and a tv, and the staff here is awesome and sweet. Order a cappuchino or a zebra mocha instead, which are both great.", "author": "J S."}
