{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "What a great park!  Not only is it very popular with the kiddos--the swings, the slides, the monkey bars--but the mom's and dad's looked to be having a fun time themselves.  After all, the view is spectacular, looking down across the city, relaxing as the sun sets.\n\nStrollers skirting the jungle gyms, hemmed in by the picnic tables and the fencing.  That's right, picnic tables!  The park is perfect for having a light lunch while also letting the little ones wear themselves out, and isn't that what you've really come for, tired parents?  This place will do it.  You'll even get a bit fresh air and exercise yourself.", "author": "Craig F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "As humans, we have this innate connection to nature. When we sit and watch a beautiful sunset or marvel at the expanse of mountains in the distance, something inside of us feels at peace. \n\nI think this need to go somewhere quieter and more spacious was tugging at us as we were navigating our way through the narrow and busy (quite claustrophobic) Fillmore strip.\n\nHence, we trekked towards the closest park nearby. \n\nWhat a beautiful and spacious place! Alta Plaza Park is right off the Fillmore and provides a wide space for people to appreciate the view of SF as well as the cool breeze as you sit on a park bench, or on the grass like the many who were either on a picnic or sunbathing. It's also a great place to bring your dog to.\n\nThere are also tennis courts, basketball courts, and a children's park.\n\nNote: You have to climb a few wide set of stairs to get to the top.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "This park is super close to Japan Town and all those cute eats. We had stopped by Jane's where I got an acai bowl and we just chilled and hung out at the park. There are couple stairs to climb up, but it's so worth the views! We actually sat down at a flight of stairs for the views and it was amazing. There's a kid's playground as well with a rounded bench seating that overlooks SF. I would definitely recommend coming here with a picnic blanket to just hang out. Super cute and not too busy!", "author": "Ada C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Great place to take kids or dogs.  Lots of open space and grass and a nice playground.\n\nBut the BEST part of this park are the AMAZING views.   On a clear day you can see the Transamerica tower, the cathedral at USF and the hills in the outer Sunset - which is not to mention the really cool San Francisco houses in the area.\n\nI do not personally have kids or dogs.  I just go for the views.  :)", "author": "Gary A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "Alta Plaza Park is one with a sky scraping view of the entire city; 360. The nighttime skyline is breathtaking. \n\nNestled in the quiet neighborhood of Pacific Heights, the thing I like most about this area is that it's not heavily trafficked and almost offers a calm oasis outside the usual hustle bustle of the city. \n\nWhen the Blue Angels come out for Fleet Week, kick back with some shades and you'll have front row to the air show. Another great perk are the stairs; long and steep enough for you to have your Rocky moment. \n\n*throws fists in air*\n\nThis park also offers 3 full sized tennis courts, a basketball court, and if you're a family person, a large playground for children to enjoy. Not to mention tons of green grass for your dogs to run about. \n\nTotally underrated. \n\nLOVE!", "author": "Ann S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "This park was absolutely beautiful and perfect for kids young to teens. Plenty to do around the area and the view is spectacular", "author": "Denise J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "My new backyard, how can I not give 5 stars? \n\nIt's the view, the proximity, the stairs that make a pretty good workout, the many dog stalking opportunities, the view, and did I mention the view? This has easily become my favorite place in San Francisco so far. Sort of like a major crush. Even when I'm not there, I cannot stop thinking about it. And if there was food there, I'd seriously be in love. But for now, it's all I need to take a short break from life.", "author": "Katja S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "One of the nicest parks in the city, especially in the area.  On top of a hill with great views of the water on one side and great views of the city on the other.  Large areas of grass, tennis courts, basketball courts, children's playground, bathrooms, dog areas, not much more you can ask for.  The park itself is kept pretty clean and is in a nice and safe area.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Great views. Currently some construction for mostly irrigation purposes and sod (estimated completion Spring 2018), but overall a great place for relaxation, exercising (steps, paved trails with differing elevations), kids (playground), and sports (basketball, tennis).", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Not too bad and very dog friendly. I'm just in it for the view of San Bruno mountain and the grand staircase. I must declare this has to be the most dog friendly park in the city of San Francisco. It's a multi story park that is good for photos at any level. I love how it's pretty laid back here and not too crowded like Alamo Square. This is mostly a spot where SF workers and residents take their break before going on to whatever task they need to complete. I have never worked in this exact area before but as true to word is a great place to relax and hangout. If you have a dog please bring them over. It's one place where they are free to be themselves without a leash. If you feel comfortable do so at your own risk. If you don't have access to a stairmaster this place also doubles as a workout area. Note: there is construction so only a limited amount of spaces is open. Don't worry it's not the photo area", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "There is nothing like being on top of the world and looking down on everything around you. My one visit to Alta Plaza Park literally took my breath away. First from the uphill walk to the park. Then from the 50 to 75 steps one climbs to get to the main level. And finally from the majestic, cloud-shrouded views of the city around me. I get an ache of sadness knowing that my city doesn't have these views. \n\nWe lugged a parcel of pastries from nearby b. Patisserie, found a pleasant sun-drenched bench, and gobbled up a kouign amann while watching surprisingly great tennis. My lucky day to catch two former collegiate female players and their perfect strokes. Tennis courts, oh yes tennis courts. Three courts I believe. Ahh...I am a sucker for beautiful tennis courts. How I wished I had my racquet with me. One day, you beautiful courts perching on the top of San Francisco...one day I will be back to play you.\n\nWe never made it to the uppermost level of the park, but it looked like a tree shaded pinnacle with some more benches, and provided a bit more distance from the babble of noises from the playground.", "author": "Stephen K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "It's okay. Tennis courts, jungle gym, a few trees, and a well tended lawn. If that is what you are looking for in a park then here you go. The views can be okay but are mainly blocked by the surrounding buildings. Aesthetically this park is bottom tier. \n\nI 'discovered' this place on a long walk after a meeting. There were several people enjoying themselves with the amenities.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "Pretty with great views of the ocean and city. Big park with playground for kids and lots trees. Great place for jogging and running up stairs", "author": "Gracie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "One of the parks in San Francisco with great views - especially at night!\n\nMy boyfriend and I went here and parked along the streets and trekked up the small incline towards the park area.\n\nIt was my first time there and I thought the view was beautiful! I can't believe this park had such a view like this!\n\nAlso, if you appreciate architecture, some of the houses around this park in Pacific Heights are stunning!\n\nDefinitely a great place to take your kids and play with your dogs.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "Um, most beautiful park ever? \n\nAs scary as I find some of those San Francisco hills to drive up, it's places like this where you get the most insanely beautiful views where I see what all the fuss is about. \n\nLe fiance, a few friends and I tried to hit up Pug Sunday here yesterday. Unbeknownst to us, pugs don't come out when it rains so that was kind of a bust. (Or Pug-st? Teehee. So many easy pug puns). But it was such a beautiful view and walk around the park - none of us minded!! If we could enjoy this park in rainy, 45 degree SF winter weather, I can only imagine how fun it is on a pretty summer or spring day with a picnic. \n\nBottom line: check it out!!", "author": "Courtney C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-18", "description": "I went on a jog through Pac Heights and the Marina and ended up running through Alta Plaza Park. It's a smaller park, but has a spectacular view of the city. Noticed that it is very kid-friendly -- lots of families playing in the jungle gym area. A few benches to enjoy your lunch. There is plenty of lawn space to lounge out.", "author": "Elysse P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "4 Stars for the vast, green park, cute doggies, and breath-taking alluring view of the City, baby! My mentor lived nearby and wanted to take her cute canine out for a breath of fresh air. She pointed out that Alta Plaza was the closest park but also a great one too. Driving up SF hills, I was surprised to see that the whole park itself is slanted on a whole block. There is 2 hour parking all around the park, so hopefully you can score a spot! \n\nYou will always see dogs and children running around, so if you dislike either of those, don't come here haha. BUT do come here if you enjoy a beautiful SF overview! It does get chilly up top this hilly park so bring a light jacket! For the most part, the park is well-kept although there are some dry parts of grass here and there. There is a great kids park at the peak of the park, just make sure to watch your kid so they don't fall off the hill haha.\n\nAs everyone else has mentioned, there are tennis courts, basketball court, restrooms, etc. Nice park overall. Magical for a picnic date ;)", "author": "Donna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "Good place for a creative, fun stair workout! You want stairs? Oh, they GOT stairs. I use to come here during early mornings as part of a bootcamp class. Good views. Place has tennis courts and playgrounds also. Filmore Street is just a block away. Not that much street parking.", "author": "Joanna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "Another patch of green in the beautiful city... with a magnificent view!\n\nA lot of various paths and a lot of grass... popular with the pups.\n\nPlayground is awesome. It's huge and spread out, one side for little ones and one for older kids. There are plenty of benches for parents to sit on, and some tables also if you wanna have a picnic, all inside the gates of the playground so you can keep a watchful eye on your kid.\n\nIt does tend to get overrun by older kids during the after school hours. If you have a toddler, I would recommend coming here in the morning or early afternoons.\n\nThe view is really breathtaking. We were lucky to come on a sunny day, but I can imagine how cold and windy it gets on a cooler day.", "author": "Sara K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-24", "description": "Now this is a city park to love. Who wouldn't want to live near a park like this? Either give me the lively cacophony of Washington Square Park in the Village in NYC or give me the tranquility and spectacular views of this one. You can leave the rest to the young moms and agile dogwalkers who just need a path to pick up their poop (hopefully). I meant the dogwalkers or more specifically, the dogs they're walking, the dogwalkers themselves and the moms I don't know. Maybe. It's quite a climb up Fillmore to get here, at least it was for me and Jamie W. since we didn't bother getting on a MUNI. We were more interested in hitting five digits with our FitBits.\n\nAnyway, Alta Plaza is a four-square-block patch of greenery laid out on multiple levels with three hard surface tennis courts (...it's Pac Heights after all) and a small playground in its center. The terraced lawns on the southern half is really the best part because you get a panoramic view of how the 1% live. OK, maybe the 3%. On the northern side is the prospect of walking down Pierce to the Marina, a steep climb down among the wealthy residents who clearly have servants who carry them down to Lombard Street. BTW, did you know the reason the steps here are chipped is because Peter Bogdanovich filmed the chase scene in \"What's Up, Doc?\" with Barbra Streisand and Ryan O'Neal's VW bug here? So blame Barbra, you Republicans.", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "Beautiful view overlooking the city. It's a perfect place to take a jog or just to talk a stroll. You'll be greeted with many furry friends and if you're lucky, you'll even encounter a man walking his cat on a leash. I had the opportunity to watch his cat climb a tree haha. It is a bit windy but the scenic views are amazing.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "Growth story.\n\nFollow these guys: www.adrenalinroom.com/\n\nFind this guy: Giant tree on the north end of the park provides excellent shade while enjoying one of those warm San Francisco days. \n\nIn fact there are plenty of trees throughout the park. Plenty of views too. You'll leave with plenty of reasons why, despite many challenges, the city can still capture your heart. \n\nMusic just might capture your ears.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "Pug meet ups are every first Sunday of the month at the top of the hill! I went for the pug meet up and was welcomed by all the pugs in the neighborhood. It was a great experience. The park itself is spacious and there is a nice jungle gym for the kids. Since it is in sf, there are of course, high winds so make sure to bring a jacket! If I were to come to the meet up again, I'd bring a packed lunch, blanket, and camera ready. Pugs at the meet up are usually unleashed to roam around and play and I'd recommend doing the same for your pug unless it has a tendency to runaway.", "author": "Sheila B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "A cool park that is often overlooked for the more cliche SF spots. Great views of the city and an interesting terrain. Reminds me a little of Lafayette, but less busy.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-31", "description": "Love this park!  It has a great view of the city.  Perfect place to bring a blanket and picnic on a nice day.  I like to watch sunset here.    \n\nThe playground at the top is large with lots of activities for a variety of ages.\n\nThere are a lot of stairs, benches, tennis courts, bathrooms and plenty of green area.  \nGood mix of people.  Families, couples, friends, people working out and people taking in the view.\n\nStreet parking is available around the park.  Park towards the top if you don't want to walk up the stairs.  \n\nIt can get super cold here on windy and foggy days, be sure to layer up on most SF days.", "author": "Kristi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-28", "description": "In all of San Francisco, this is my 2nd favorite park. It's close enough to Fillmore street, that you can pick up a coffee, and go to the park to hang out on the stairs or the hill. There's basketball courts and tennis courts and a kids playground which is great for families. I see a lot of dogs around the park, and if you're on the side by Washington and Pierce, you see a glimpse of the Marina, and you can actually walk down to the Marina that way! \n\nI love this park, especially at night time. We hung out with a a few friends once, and joined a couple who was drinking champagne from the bottle, just chillin' and enjoying the city lights and views. It does have amazing views, and really makes you appreciate everything around you.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-23", "description": "Now that this is my new hood, Felix and  I can't get enough of this park.   It is laid out so favorably.  From wide open grassy flats, to tiered walking paths,  stairs,  and that same clumpy grass type covering the hills that snarls my golf balls in the rough, each day here is different.   There's enough space for everyone and I think that's the beauty.  You can sit on one of the many benches overlooking the city,  or spread out a blanket,  and never get interrupted by a dog,  a kid, a tennis ball,  a homeless person...\n\nThe sun shines last on the crest of this park, while shade has descended on other parts of the city, which you can watch from your perch.", "author": "Tamar D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "The view here is so breathtaking that I could just park my bum and lay here all day long", "author": "Paige C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "Nice city park. \n\nTrue story... Sitting on a bench not far away are two women chatting and occasionally yelling at their dogs. One dog (Coffee (sp) - a Schnauzer) seemed to be particularly overreaching and disappeared frequently which was was made more obvious by the amount of yelling... Coffee...CoFFeee...COFFEEEEEEeeee. \n\nAlong comes a woman with a medium sized poodle on a leash pleading, \"Does anyone know who's dog this is?!?!\", pointing to Coffee who is hump-hump-humping the poor poodle. The poodle and her owner were clearly not amused. Finally Coffee's owner claimed the beast but not before he made a couple of last ditch attempts to nail the poodle on the fly. \n\nAfter the poodle woman left, Coffee's owner could be heard explaining to her friend, \"If you don't want your dog to interact with other dogs you shouldn't bring it to the park.\" \n\n5 stars for this stupid slice of life.", "author": "J T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "Probably my favorite park in the city. The view is absolutely gorgeous; because it's such an epic climb from the bottom you can see most of the city! Likewise, if you walk towards Jackson street when you're at the top you also get an amazing view of the bay.\n\nThe playground seems awesome, really family-friendly, and there's usually a bunch of cute dogs running around so that doesn't hurt either. Go! And take a picnic! Woo!", "author": "Casey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "Very nice playground with a great view of the city. Very big too. I took my son here and we played for a few hours. \n\nParking can be tough as you park along the area, but it is also surrounded by houses, so it can be tough.", "author": "Roger A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-20", "description": "This park has the ideal playground for kids (and adults) of all ages!\n\n* The playground is large, with an area for younger kids and an area for older kids.\n* The entire play area is gated.\n* The gym sets are of good quality.  The dome climber has sturdy ropes and the seesaw has good springs -- none of that fulcrum stuff when I was a kid.\n* The rubber soft ground landing makes it safe for those prone to falling, like the little ones who are starting to walk.\n* There are benches for parents to chat while their kids are playing together, and tables for snack breaks.\n* There is an amazing view of the city.\n*** Get ready for this: There is a bathroom and it is actually clean!!! ***\n\nNo, I am not making this up.", "author": "Ally W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-28", "description": "PUG SUNDAY is every first sunday of the month in the afternoon. PUG SUNDAY is the greatest thing I've ever experience. If I ruled the world, it would be PUG SUNDAY EVERYDAY.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-05", "description": "One of my favorite parks in the city, I think this is great since you get a nice view of the bay and usually great weather, without the hoards of people you usually get at the more popular spots like Dolores Park or Alamo Square.  It's not too lively, but others are definitely there, but still very quaint and relaxed.  \n\nIf you're looking for a great spot to read a book on a nice sunny and warm San Francisco day, this is it.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "God bless the city planner who looked at these four city blocks and decided: \"You know what? We're not going to build any houses here. Yeah, it's got a great view, and yeah, the tax revenue from this ritzy neighborhood would pay for a dozen parks elsewhere, but we're going to open it up to the public.\"\n\nWhat looks at first to be a fairly plain park actually holds a lot of options... you can climb (or run) the huge staircase along Clay St., you can put your kid in a swing or a sandbox at the playground, you can play a game of tennis or basketball in the secret courts, and you can have a picnic with a view of the bay to the north. Oh, and then there's pug Sunday.\n\nEven on a lousy day, Alta Plaza park is a great place to be. If there's a strong wind from the West, just hide out at the bottom of a slope on the leeward side of the hill.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-10", "description": "My favorite neighborhood park hands down.  Nice playground for the kids with sweeping views to the south, including Sutro Tower on Twin Peaks.  On the north grassy side of the park you can look out to Tiburon across the water.  This is a dog-friendly park, however it's always muddy on the north side so it can get messy if you have a furry friend.  There's a basketball court and decent tennis courts.\nOn the south side of Alta Plaza, there's a ton of steps up hill.... and there's always people exercising up and down these steps channeling their inner Rocky Balboa.", "author": "H H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "Like the basketball courts - sometimes hard to find others for a pickup game but I've looked on unofficialchat.slack.com to find people that are free on the #pickupbball channel which usually works", "author": "Nicole E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "Very, very beautiful views. Note - for dog owners, I didn't see any fenced section, so if your dog does not have great recall, you might want to keep the leash on. It's a great park with tennis courts and a lovely big play area, and plenty of grassy spots to sit and read or take in the view. Very dog friendly - so a winner in my book. There is an approach on the corner of Clay/Pierce that has steep steps, so go round the side if you don't feel like the extra exercise!", "author": "Koshika S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-12", "description": "One of the best parks I've ever taken my kids!! While waiting for our car to get detailed along Bush, we walked around and yelped this park up. Very very safe. Seriously, just park your stroller in a corner and let your kiddies go!! The walk was a bit steep pushing a stroller, but it was the only flat* way to get to the park. Definitely a park to check out if ever in the Fillmore area with kids.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "Generally quiet and not as crowded as other parks. There's enough space around the park to still yourself and gather your thoughts. Nice view.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-08", "description": "I stumbled upon this park at night -  awhile back with a friend and fell in love.\n\nLooming amove the city with an unparalleled view of San Francisco in it's dazzling evening lit glory - Alta Plaza Park takes on a surreal quality. \n\nThey have it all  -from basketball courts, tennis courts, a sturdy jungle gym - which is well matched for older kids, and a vast expanse of land for dogs to frolic in.\n\nI plan on coming back here soon to practice some night-pull ups on the monkey bars.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "New grass is nice (and has unusually long blades?!) but watch out for dog-owners who don't pick-up after their dogs well becasue the grass makes\" things\" linger (hopefully not on your shoes!)\n\nNorth end of the park is full with dogs-off leash is actually NOT OK but people are generally well-behaved. Also good views of the bay from this part.\n\nTennis courts/hoops are first-come. Well maintained.\n\nPlayground is nice for the kids.\n\nLeast windy on the east side (facing Steiner St).", "author": "Liz C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-25", "description": "This is a great park. The view is breathtaking. I love sitting here with coffee and a good book. Sometimes I people watch, sometimes I attempt to jog around the perimeter. Whatever I choose to do, this park supports me 100%.", "author": "Court S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "I love this park because I am a pug owner and enthusiast and they host San Francisco's Pug Sunday the first Sunday of every month.  People tend to show up maybe around 11am or so, and meet with their pugs and let them all run around with the other pugs.  The dogs love it and the people are very nice and sociable.  PugPROS (Pug Rescue of Sacramento) often shows up as well and brings dogs who need foster care/new families.  I come from out of town, so parking can be a total pain, but after circling for a while, I tend to find something within a block or two.\n\nMany owners take their dogs off of their leashes but they are all very mindful of cleaning up any bathroom messes.  I always bring a towel or two to sit on, an igloo mug full of chilled water, a dog bowl for the water, and some treats for the dogs.  I also always bring a book and a camera but never read the book because I'm too entertained by all the funny dogs running around.  Pug mixes and other breeds are always present as well, and they all seem to have a blast running around together.", "author": "Danielle P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-22", "description": "If you have kids the playground seems to be a hit and the views from up there are awesome. Plenty of grassy areas for lounging or a picnic. The park is pretty dog friendly and there are some areas where dog owners and their pups tend to congregate and it's off leash (mostly the North-West corner). There is also a basketball court and a couple tennis courts. On the South side you'll find a very long set of stairs where athletic types like to train (beats the boring StairMaster!). One of the better, safer, cleaner parks in the city.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "This is my favorite neighborhood park, best after grab a coffee from Tully's down the street and seat by a bench to watch clouds drift by, dogs play, children giggle and young couples who are in love, all with blue ocean and occasional slow moving ships in the background. \n\nhttp://asmalltrip.com/v/a-few-hours/dogs-babies-young-parents-at-a", "author": "Grant G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "Love this park. The playground is very big and roomy and mostly rubberized turf.  The view is spectacular as well!! Check my view pics!! It's always clean here with no trash in sight.  Parking can be tough as there isn't a parking lot.  You're kids will love it!!!!", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "If you play tennis, this is a premier destination. Not that the courts are particularly well-maintained, it's the view, the view from Pacific Heights will leave you spellbound. The northern-most court provides shelter from wind whilst the other two (one doubles as a basketball court) posture your match in a setting of incomparable grace. The playground is a curtain raiser, with children in their jollity. And you can picnic on the turf with the Sunday Times.", "author": "Dana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "Great structures, great views but NO SHADE! On a hot day this place is a bit miserable. Other parents and I were clamoring under the slides for some relief. Only able to spend about 20 minutes there but I'll be back on a cool day!", "author": "Coco G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-30", "description": "I love this park! Amazing views of the city, great playground for the kiddos and a great set of stairs if you are feeling like some cardio!\n\nI'm doing Playball sports skills for preschool kids at this park once a week, check out the Playball website for more info:\n\nhttp://www.deedee.usaplayball.com", "author": "Deirdre L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "We went here for a pug meet up. So many good looking dogs at this park. Stayed on top of the hill. It was really windy up there but the view is amazing. View of sailboats at the bay was beautiful! There's a playground here for kids, parking isn't that bad and it's close to filmore street. I love shopping there and usually park near this park to go. This park is a good place to just chill. Also, if you wanna work out, there a set of steps to run up and down.", "author": "Jamie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-21", "description": "This is one of most spectacular park in San Francisco and has some amazing views.   I commute into the City to work here temporarily, and love finding some space and play area.   So lovely.   It starts my day connected to life, Spirit, and the people here.   Lots of dogs, children, and walkers/runners.   Great place to hang out.  \nDenese S.", "author": "Denese S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-21", "description": "This is one the best parks I have been to.. Awesome views of the city, steep climbs within the park. It has a nice tennis court and a playground area. \n\nPerfectly suited for picnics and get togethers and is dog friendly as well. \n\nOffcourse the best part is that its just three blocks from my home. As good as it gets.", "author": "Rahul P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-13", "description": "I love this park. It has amazing views (and one particular park bench with a view of Alcatraz!) Good for dogs, couples, families, picnics. Last week I saw a bum and a pile of puke, but I've never seen that before, ever. \nTennis courts and a kids' park.\n\nI would LOVE to see fourth of july fireworks from this place at night. \n\nOh, and the bathroom is very clean.", "author": "Cindy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-16", "description": "I review restaurants, Ruggles reviews dog food stores. I review clubs, Ruggles reviews parks. And Ruggles gives Alta Plaza Park 5 stars!\n\nWe stopped by Alta Plaza yesterday even though it was raining because we were in the area. We played lots of throw, catch, and chase with the ball and met nice families and nice other dogs. Ruggles wished he could play on the colorful, fancy play structure but seemed pretty satisfied playing with his slobbery, muddy ball. The grass was lush and he enjoyed tons of wide-open space all to himself.\n\nI enjoyed the great views and the availability of clean restroom facilities. We definitely plan to be back!", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "LOVELY park! I love it. It is so beautiful. I biked there. And carried the bike up the steps. I love the view of the bay with lots of benches, that were all occupied the other evening with love birds enjoying views. The playground looks like a lot of fun and can't wait to return soon with my little one. And the paths look perfect for getting some running in. Soft pavement and great hills to inprove my pace ;-)", "author": "Rayhaana A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-12", "description": "Stumbled upon this park after some light window shopping on Fillmore, and it's a real gem. I've only been in the day time and its views are breathtaking.\nCan't wait to come at night and see the City lights!\n\nSafe neighborhood, lots of families, dogs and no sketchy people. \n\nGood for doing a little light running on stairs (lots of em!), but also VERY relaxing and peaceful even though there's a park with kids and a good amount of people.\nI'll definitely be back!", "author": "Elena P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-03", "description": "Snugly located amongst rows of really fancy looking houses, this place has a very homely upscale kid-friendly park vibe. It's not a huge park, but still it manages to encapsulate many of the things that you'd want a park to have - a nice playground area for kids with all your swings, and slides and stuff, a couple of small trails around its periphery that offer you a good view of the miniature hills that lie in between Pac Heights and the Golden Gate Park, a tennis court colored to look like a grass court and another one colored to look like a clay court (that was kinda cute), and in general a very dewy freshy feel to the air.", "author": "Srivatsan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "A gem ! Simply love this park. It's got great views , benches , tennis courts. A lot of times there are community events held here and I simply love em !", "author": "Priyanka P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-16", "description": "[From our dog.]\nDear Alta Plaza Park,\nThank you for hosting the monthly Pug Sunday.  I have been several times and have sniffed a lot of friends.  You don't seem to have any food dispensers, though.  You should give me free nuggets.  Anyway, I like your grass toilets.  Most of all I like to visit you because I can run free and disobey my masters' commands not to lick strangers in their mouths.  I like your breathtaking views to the south and like how I can see Alcatraz island.  My parents let me watch the Blue Angels from you and I saw a gopher.  My dad said to say he always can manage to find a parking spot close by, too.", "author": "Daryl E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-07", "description": "Pug Sundays!\nhttp://www.flickr.com/photos/c3white/sets/72157629165169818/", "author": "Charlie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-30", "description": "This park has great views of the city, and isn't on the tourist's to-do list, like Alamo Square Park is. Great place for kids, pets, adults alike. There's a nice playground that's fenced in, paths for walking and grassy areas for picnics.\nThe only thing I noticed were the trash bins, they were more like dumpsters, than the regular green ones found in all the other parks; what's that about?\nParking is relatively easy, and safety isn't really a concern here. Go out and enjoy your weekend al fresco!", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "I love this park!  It is so pretty and gives you great 360 degree views of SF!\n\nI have a pug and we love coming here for the Pug Meet Up every first sunday of the month.  It really is a great park for dogs.  You can let them run off leash (as long as you keep a good eye on them, of course) or walk them on the many tiers of the park.\n\nGreat on a sunny day and in the spring the cherry blossoms bloom and the park looks heavenly.", "author": "Carmel U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-12", "description": "OHHHHH, ALTA PLAZA.... You and I have so many memories.  There's a lot of trees, it's on a hill, and it has a killer view.  There are hella stairs, if you're into running stairs.  You're in Pac Heights so you're usually dealing with a snobbier crowd.  It's right by Fillmore Street so there's a ton of shops nearby.\nThe playground is usually what I go for, at this point.  It's always crowded and after 3pm, when the big kids get out of school, it can turn into a mad house. But it has a gate all around it and a small divider (not a big deterrent) for babies and bigger kids.  There's a huge jungle gym too.", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-01", "description": "Bring a hat and a sweater it's very windy! This park is big, pet friendly, great for families, and big groups. I am partial to it because everyone I go to Alta Plaza Park for the San Francisco Shih Tzu Meetup Group. There are also tennis courts, bathrooms, and a playground. It is also close to Filmore Street so it's easy to grab a sandwich and then take it to the park for a picnic.", "author": "Kelsey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-17", "description": "ZOMG how did I miss this place!\n\nI had an afternoon with my daughter and stopped by here to play on suggestion from a non-Yelpie. Excellent call!\n\nThe kids' area is fantastic. Newer park equipment is great to see and I love the fence for separation.\n\nThere was a decent amount of grass to play in as well (but watch out for doggie messes!). A big plus to me was the views as well as light breeze blowing. It really made for a picturesque day playing and having fun.\n\nGood times!", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-28", "description": "Wery nwice Swan Fwrancisco cwity pwark, one of the hwighest in the cwity with wery nwice view to the nworth, swouth and east.\n\nNwice unfwenced area for dwogs to run but to be pwerfect nweed sepwarate fwenced areas for bwig and smwall dwogs, which is swadly lwacking in mwost of this cwity's pwarks.\n\nExcwellent plwayground for the kwids, one of the bwest in the cwity!\n\nDog friendly, unfwenced, but cwan run off lweash.", "author": "Finnegan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-05", "description": "This review is only about 4th of July fireworks. We went to Alta Plaza Park to watch fireworks. We were able to see most of them, though some were too low and our view was obstructed by some of the homes. There were a lot of people there, but we got their 40 minutes before the start and easily found some space.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-18", "description": "This park is SO cute and the views are crazy! We walked our poochie here today and had a great time. We even found parking in the area. Overall, it was a great Sunday in the sun!", "author": "Kayla N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-20", "description": "Every first sunday of the month, a convention of pugs gather here for a fine time of play, sniff, poop, and mingle. If you're a pug lover, you have to visit Alta Plaza park!\n\nOnce in a while, you'll spot a golden retreiver amongst the crowd of panting pugs. \n\nIt's quite a sight.", "author": "Sue L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-30", "description": "Brought a dog that I was pet sitting here for a walk. Spectacular views of the city, friendly people, beautiful sunny day...heaven. You can go for an extended walk around beautiful Pac Heights as well. I am a fan.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-17", "description": "Sweet little park with an epic view. \nThis place is Pure Nor Cal.\nThere is the south side and the north side.\nIn the spring flowers bloom by the tennis courts. Keep this place secret. Its nice. Share that bottle of wine on a gorgeous sunny SF day!", "author": "Bert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-26", "description": "Okay so it gets foggy.\n\nOkay, so the wind whipping across the northern end of the park by Jackson Street sometimes feels like it's the Arctic Express barreling in off the ocean.\n\nSo what?!\n\nThe views from Alta Plaza are among the most wonderful in the City (other favorites include Alamo Square and Dolores, of course), it's nearby Fillmore Street so you can grab a quick bite before frolicking with the kids and dogs or snare a meatball sandwich at Dino's (corner of California and Fillmore) and hunker down on a bench or one of the logs at the very top of the park looking south.\n\nWant to play tennis? If it's a nice day, get there early because the courts fill as soon as the sun cuts across the skyline when it's sunny!\n\nHave a dog? Technically the \"legal\" off-leash areas are only on the south side of the park, but those who frequent the park frequently (a group of which I am one) there's a gentle person's agreement. The dog people keep their canine kids in line, and the two-footed pups don't dig holes either - unless they're in the S-WEET sandbox in the playground. And yes, that's me, an adult effusively commenting ... on a sandbox.  I mean, who doesn't like building sand castles right? Especially in this park where they have a built-in crane/digger thing.\n\nAdmittedly I don't spent much time on the playground as my kid has four feet and a penchant for running in circles and chasing a ball, but it looks swell.\n\nSo come on by ... and if see a rather large, silvery shaggy dog named Truman racing around, I'm not far away.", "author": "Cathy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-27", "description": "On a sunny day, this park shines!\nI took my baby Parsley (shih-tzu) there for a Shih-Tzu meet up! heuheuheu. There were many little shih-tzu all playing around at the park. SO lovely!\nPark has great views of the city, Alcatraz and has tennis courts, kids playground area..etc. \nReally nice park, we meet there almost every month and you can go without a leash!\n=)\nEnjoy the park on a sunny day!!\n=)", "author": "C A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-14", "description": "Beautiful city views to the south, lovely marina views to the north, and possibly the cleanest park bathrooms I have ever had the pleasure of encountering.  That's Pacific Heights for you, I suppose.  I don't have a dog, but this is a popular place for them.  Plenty of benches and lawn space, sun and shade.  \n\nMe, half a bottle of wine, Alta Plaza Park, and the Sunday NYT crossword had a great Valentine's Day...", "author": "Allison D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-07", "description": "Had a nice walk with my two pooches here on a sunny afternoon. The weather was nice with barely any fog, so we were able to see a great view of the city.  The park was very clean and serene. Saw a few other people walking their dogs too. Others were sitting in the grass and eating their lunches. There's several tennis and basketball courts and a children's playground. \n\nGreat park to just walk around and hang out in. I'll probably go back and picnic there one day.", "author": "Gina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-08", "description": "So this is where all the rich peeps hang.  One of my favorite places to take Ethan.  I'm living the dream!", "author": "Minh N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-09", "description": "Pretty nice views peeking out from behind equally nice houses. A great place to come to relax on a sunny afternoon but not quite the Hippie Hill or Dolores. You can see the marina, Angel Island, and on an exceptionally clear day - Mt. Diablo", "author": "Tatyana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-20", "description": "You dog will be so happy you brought them here. There is a fun off-leash (unofficial I presume) area on the upper bay-side of the park. On the other, city-side of the park, amazing views with benches which facilitates sitting with your sig other or just taking it all in. If you have little kids there is a great enclosed playground here as well, also with amazing city views. \n\nFYI: It is often windy at the top of the hill, so bring a windbreaker!", "author": "Steven G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-12", "description": "WOW, stunning park. Very very different from Lafayette (I live a block away). The tiers remind me of the older pyramids or Mayan ruins. Extremely unique layout. \n\nI strolled through there on a late night, it was very foggy and made for a pretty surreal scene when I got to the top. Like Lafayette, very dog-friendly. But once you get to the top there are some well kept tennis courts and playground.", "author": "Nelson C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-09", "description": "Beautiful park, breath-taking views (come on a non-foggy day, if you can find one in our wonderful city!  :)\n\nGreat place to come for some peace & quiet, a mini-get away.   Also a great place to come check out lots of cute dogs!", "author": "S. M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-11", "description": "Alta Plaza is a nicely kept park in pacific heights, with a childrens playground, tennis courts, and a large area for dogs. Equipment is well maintained and the view from the top of the park is fantastic. And the fact that it's at the top of a hill and has a long set of stairs off of Clay Street makes it ideal for a short intense run provided you live where I live.\n\nHowever, I'm subtracting one star for having the bathrooms locked when I was out for one such run at twilight.\n\nAnd I'm subtracting another for not having bushes thick enough to afford me any privacy.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-15", "description": "i've passed this park a couple of times with going there with my son in mind. while looking for a place to scarf down a sandwich from Lucca. I was surprised when i got to the top of the stairs to find a fenced in playground for kids. my son went ballistic when he started to play on the grounds manuevering new toys to experience in the playyard. No strange people roaming the park which is a plus. very relaxing place to see the city from a far.", "author": "Shawn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-21", "description": "Random Factoid: \nAlta Plaza park used to be a quarry and also used to be recreational hunting grounds for SF's elite on weekend retreats from the hubbub of the original part of the city. \n\nPlusses: \nAmazing playground\nLots of gophers for the dogs to hunt\nWater bowls for dogusses\nTennis courts\nPug Sunday\nBest place to check out the blue angels - you can see the pilots' nosehairs when they fly by \n\nMinuses: \nSICK DOGS\nDrainage is poor which allows for water puddles to sit stagnantly during the average rainy winter. The dogs eat the mud which makes them sick, and it's essentially worthless to exercise your dog here in the winter. \n\nTENNIS VS B-BALL\nThe renovation of the playground and 1 tennis court is phenomenal... except... They got rid of the basketball hoop outside of the courts and put basketball hoops in the renovated tennis court. This essentially eliminates this court for tennis purposes on most days. Also, they added a backboard - AWESOME - but, again, since it's in the \"multi-use\" court, you almost never get the chance to use it. They should put a hoop back on the outside of the court and create a backboard on the fenceline that connects the other two courts. The backboard & hoop situation make for a lot of clashes of interest. \n\nKIDS ON A RAMPAGE\nSchool kids run RAMPANT through the park on weekdays - there's like 4 or 5 schools that use this as their playground, which is cool, but the kids aren't that well supervised. Even if you're trying to keep your young child &/or dog away from the adolescent screeching and dashing, you WILL be intruded upon and have to move elsewhere. Also, I see kids wandering about this park unattended all the time during recess. I SO WOULD NOT LET MY KID GO TO ONE OF THESE SCHOOLS.", "author": "Hannah Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-16", "description": "Our son can't get enough of this park! The playground area is an enclosed area that houses a side for older kids and side for much younger kids. Usually I'm opposed to my son playing in the sand because he gets very dirty, but the sand at this park is clean and almost pebbly. Even though there are a lot of people at this park, the space to run around and play is grand. Nothing is cramped--the space between all the apparatuses have so much allowance. On a clear beautiful SF day, the views of the city are magnificent! \n\nIt's all street parking because it's in the middle of a Pacific Heights neighborhood, but we have never had trouble finding any.", "author": "Jenn V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "Beautiful park with great vistas. What more do you want in this part of the city?", "author": "Stephen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-10", "description": "The best thing about this park is that it's quiet.  The higher you go the quieter it gets.  It's not even located around noisy streets in the first place.  Everyone is pretty respectful of the tranquil atmosphere.  Stroller moms keep hum to each other, dogs don't bark madly, and book readers can be found enjoying their literature.\n\nIdeal for anyone willing to take a walk or nap.  Dogs are common yet they don't overpopulate the place.  If you want to do step exercises, there's a lot of wide stairways for you.  You could even do a run up a la Rocky Balboa.\n\nThe paved paths are surrounded my semi-unkept grass; yet, the grass is unbelievably green.  The walk up rewards you with a great view of the city.  I ended up laying on a bench listening to my iPod.  Sun bathing never felt so good.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-10", "description": "Such a beautiful and decent size park equipped with a nice playground for the lil ones and tennis courts! \nOur friends brought along their little one and took us to this scenic park. The playset is targeted for toddlers to young kids and also a sandy patch available to build sandcastles.\n\nGreat view looking south of the city and great place to roll around and enjoy the sun as well.", "author": "Yan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-03", "description": "Nice assortment of shady and sunny spots to chill out.  Good views in all directions.  Parking isn't too bad on a weekday, but watch out for the meter maids which have multiplied as the city looks for more money.  Grass is a bit jacked up in places.  Good breezes from being on top of a hill.  No seediness seen.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-05", "description": "This park is beautiful and clean.  A nice park to lounge around and get a little sun.  The pup loves it too!  Just wish it had more protection from the street for the pup.", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-07", "description": "It does get breezy up here in Pac Heights so bring a warm sweater or jacket. Just beyond Pierce St is a great view of the bay and its boat sailors. Also, if you plan to stay for awhile and feel the need to sit, I usually bring a picnic blanket for my friends and the dogs. You might want to think twice about bringing snacks and beverages because I guarantee you will have a group of food sniffing and treat begging pugs at your lap ; D\n\nYesterday's meetup was absolutely crazy! There was a good show of dog owners and pugs.  I couldn't count how many puggies there were. A friend, first time goer and father of two pugs, said he was getting all dizzy from just trying to keep track of his own dogs and that it was Pug Heaven.\n\nFirst Sunday of the Month --------------- Pug Sunday at Alta Plaza Park", "author": "Oanh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-31", "description": "So many dogs.. I want to pet them all!!!! I love dogs.. I love tennis... I love views  and I love playgrounds for the kids to run off their energy. That's what Alta Plaza specializes in. There are a ton of dogs here walking.. running.. playing.. so many that I'd think twice about rolling around in the grass. But they are so cute! \n\nThere are also two tennis courts with a third in the middle of a basketball court. The two tennis courts are nice because they are fenced in and each one is separated by the other. They court surface doesn't have any cracks and it's pretty nice compared to the rest of the city. The third tennis court I wouldn't use as I leave it for the basketball players. \n\nThe playground is renovated and nice. There seems to always have a ton of kids and it's has a small gate though any kid can walk out if they want to. They have a few play structures and I think it's one of the better playgrounds in the city. \n\nThe view is awesome too. Alta Plaza sits on top of a hill so you get a good look at part of the city. But be prepared. The parking can tough especially when there's street cleaning and after work hours. It can get cold and windy too so bring warm clothes. Nonetheless I love it here!", "author": "Dan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-24", "description": "Beautiful park, beautiful view over the marina and into the bay, lots of fun trees to climb if you're itching to relive those childhood days, or pretend you're on top of macchu picchu as mentioned earlier.  Each level of this park has something different to offer: a playground,  tennis courts, trees... what else could you want?  \n\nmaybe a beer.", "author": "William S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-01", "description": "My new backyard has the most glorious views of the city and a built-in stairmaster.  If you want a good workout start at Pierce and Clay and head straight up the stairs.  Pause at the top for a breather and to see the city laid out at your feet, then start back down.  Repeat as necessary.  Once you're done, come on back up to watch the dogs having a grand old time.  \n\nUPDATE:  The playground (which finally reopened) is great fun for kids.  Geared to the under 12 crowd and complete with a squishy surface, this is where you take the wiggly short people when they start to tear apart your lovely non-kidproof apartment.  Aunty wisdom!\n\nOf course, this is also where I've sent some wiggly big people after a bit too much wine - they had just as much fun even if the teeter-totter is the 'safe' kind and therefore kinda lame.", "author": "Suzanne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-27", "description": "Big open park with lots of grassy area. Picnicked with KFC (review to follow) and a little too much beer for about five hours in the sun. Needless to say, SPF 4 didn't do me much good. \n\nGood times had by all, especially the tourists we waved at as the drove by in a double-decker. Oh, and kudos to the park for fantastic proximity to corner store markets, which were great for when we ran out of beer.", "author": "Carissa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-07", "description": "Alta Plaza rocks.  Go for the views, stay for the dogs.\n\nI want to shrink myself down Rick Moranis style so I can make full use of that amazing playground.\n\n... and there is a beautiful hawk that makes the pine in the NE corner its home.\n\nI love eating my breakfast/lunch here whenever I have a chance...", "author": "Chad T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-10", "description": "Ran by here too, and stopped on the south west side looking out over the peaks and valleys of San Francisco.  I didn't know there were more places with beautiful views of the city to explore.  I'm coming back here just before sunset to catch my breath.\n\nLooked like a nice playground on top for 5-12 year olds.  Kinda wanted to play on the red climby thing.", "author": "Haru K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-26", "description": "You can't ask for a better view from a neighborhood park.  I love to go by myself, with friends, with my friend's dog, with friends who act like dogs, etc.\n\nEveryone there is always friendly and smiling and strolling ever so happily through the winding paths that lead from the inconspicuous tennis courts to the seriously cool kiddie playground to the steep steps that I look out on from my living room window.  They kind of remind me of an Egyptian pyramid, although I'm not sure why.  I digress...\n\nPack a lunch and go eat it near the happy people/dogs at Alta Plaza.", "author": "Marina Maven C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-11", "description": "I came here looking for the \"painted lady\" houses from the TV show, \"Full House,\" which I later learned (by losing a bet and paying for dinner) was some where else in the city.\n\nNevertheless, this is quite an impressive park...kind of reminds me of a Mayan or Aztec temple since the bottom is wide and it gets narrower as you go up the stairs. At each indentation, there are park benches for you to admire the city view. At the very top are tennis courts and a playground for kids. There's a lot of green grassy area to sunbathe, picnic, read a book, etc. On a clear day, you can see the tip of USF's cathedral, Mt. Sutro and even more. Parking wasn't too bad on a sunny Sunday afternoon and even though it may be sunny and warm, bring a light jacket, because it's still a bit windy at the top!", "author": "Janel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-12", "description": "Stumbled upon this park one day as I was riding my bicycle around town and was stunned! Seriously an amazing view of the city! It is a must-see if you are in San Francisco, and I plan to take every friend here when they come to visit me. Great for picnics, dog walks, resting, laying in the sun, taking photos, and families with kids (there's a playground!). Love this park!", "author": "Leigh W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-30", "description": "I can't believe that I've lived here my whole life and found this park by accident. I was running the in the neighborhood with my lovely gfs and we were like, \"Oh! Babies!\" And then we saw the VIEW. \n\nAnd what a view it is! It reaffirms the value of the cost of living in this city of mine. \n\nWe've returned to the park to enjoy picnic lunches that we purchased from Fillmore Street. \n\nAnd for better or worse, there are tons of dogs here. I like the ones with disciplined parents.", "author": "Jacquee P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-13", "description": "This park is very pleasant.  It has nice grass and well kept tennis courts.  However, in 3 different occasions there was no basketball to be had.  My search for consistent pickup bball continues\n\nAs for tennis,  It is a nice place to play, however the surface on the singles court seems oddly hollow.  Also, I feel like this court is highly susceptible to wind since it is high up without too many obstructions surrounding it.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-10", "description": "An excellent park with excellent panoramic views of the bay and the city.  There are also excellent folks here who all know one another by name; and for those they do not know, these people are just as friendly and warm to the newbies as if they did know you name. \n\nI find this a great spot to take the DaWg because I know I'll encounter those who are social and welcoming and will not have to deal with those grumpy curmudgeons with the small snappy off-leash dogs.\n\nAnother wonderful thing about this park is its conveniently located up/down the street from Pets Unlimited.  Many of the volunteers bring the \"up for adoption\" dogs here to teach them how to behave around people and other dogs.   Great way to get to know these sweet little pets and one day I'll be tempted to take one of these \"up for adoption\" pets home.\n\nOther great things about this park is that it is versatile in having something for all, tennis courts, kiddie play-ground, fields of green grass, and stairs...", "author": "Cris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-10", "description": "This is my favorite park in SF!\nI used to live right across the street from it and spent many spring and summer afternoons there.   Between tennis and picnics with great views of the bay, pugs on the first sunday of every month - there is something for everyone.  Friends of Ala Plaza Park raised money to build a new playground for the little ones - one day when I have little ones I will take them there!  If you ever feel like you want to give back to the park you love - the first Sunday of every month is VOLUNTEER DAY.  Come get coffee and bagels donated from Peets and Noahs - and from 9-NOON you can help plant flowers, weed and just help to beatify the park!", "author": "Catherine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-13", "description": "Alta Plaza is a wonderful park. Small enough to not lose your dog, but big enough to feel like you have your own space to spread out a blanket and kick it. The maintenance crew does an amazing job of cutting the grass, trimming the bushes and keeping the park clean. \n\nThere is an area where all of the neighborhood dogs play up at the top by Jackson Street. So many beautiful breeds to check out. \n\nLast year, they ripped out the old playground and replaced it with a new one. As if my nieces and nephews did not like the park already, now they think it is amazing. The structures are challenging for them to climb on but give them a good workout. The playground area is divided into two areas- one for toddlers and the up to 4 set, the other area built more for 5 and up.\n\nNestled within the park are many benches which are good spots to read a book or just hangout and people watch.", "author": "carina b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-11", "description": "So this is where they hide all the children in San Francisco!!\n\nSeriously though, I haven't seen so many kids in all my time living in this adult-dominated city as I did during today's stroll through Alta Plaza. The park's playground is fairly expansive and definitely beckoned to my inner child. The running, laughing children were adorable and almost made me want a miniature person of my own to justify playground trips...that is, until one fell off a swing and started screeching uncontrollably, at which point I thanked god that I'm 23 and single. \n\nEven for those yet unencumbered by strollers, this is a lovely place to stroll and take in a breathtaking view of the city. It also seems to be a popular destination for dog walkers. I love the tiered landscaping...if you go down a few levels, you can almost escape the playground ruckus.", "author": "A M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-17", "description": "Every time I visit I always leave with the same feeling...I just feel that I could just be better somehow.\n\nAn analogy...its like going to a restaurant that just seems like it should hit it out of the park, e.g. great view or location, good staff, nice exterior, good neighborhood.  However, every time you visit you feel like there's was something missing or maybe the owners are just relying on the nice exterior and great view to make them money.   You walk away ambivalent.\n\nUpon approaching the mere size of it reminds you of Alamo Square as well as the paths leading up to the top.  The views are pretty damn good...that's to be expected.  You can easily see that there are others using the park as well...so that is nice too.\n\nHowever, where it leaves me wanting more...\n\n1.  Slightly dilapidated B-Ball courts.  \n2.  The state of the shrubs overall growth is mediocre at best.\n3.  The cemented path throughout the park is marred by cracks and age.  It is also rather uneven...Good for a jog but aesthetically not too pleasing.\n4.  Bench placement is just OK.  A good park needs more and closer together.  Its OK to be close yo your neighbors.\n5.  Weeds.  All over steps and paths.  Not just small ones.\n6.  Sequesterization.  I just coined that.  There is no real flow through the park or a sense of overall connectivity.  When you are in a part of it...that is it...you are in a part of it.  Nothing lends itself to being an overall park.\n7.  ...\n\nSo, I don't want to make it seem like I'm bashing AV.  I like it.  I still give it 3 stars for the damn great views and the utilitarian environment.  I'll probably add this park to my jog route...but I just feel like it has a chance to be so much more.\n\nThen again...I am spoiled.  15 min to Dolores, 3 min to Duboce, 4 min to Alamo Sq, 5 min to Buena Vista Park, and 10 min to the Panhandle...For a park lover and urban planner I have to say I have a very high bar set for parks.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-30", "description": "A nice park for  you, a great park for your dogs.  You'll mostly find  small dogs here, and the bigger guys are always nice to their smaller friends. \r\nPug day - first Sunday of every month - is a  must see for any dog lover (I swear they all start to look a like).   And while you're 4 legged  friends play, you can take a look at the nice views. \r\nBring  a jacket - it gets windy up there!", "author": "Baby C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-04", "description": "Perfect place to play tennis, except that everyone else in the neighborhood knows that so there is usually a wait.  We don't like getting the court that doubles as a basketball court because all you can hear is the screaming kids at the playground.\n\nBeautiful view and easy to park.  Just get there early!", "author": "Tamara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-09", "description": "My favorite park in the city. Great for doggie play, romantic picnic, sun bathing, kids playground..tennis and basketball..and simply mediatation on top of a beatiful hill!", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-16", "description": "Looks eerily similar to Lafayette Park, just a few blocks away.\n\nThis is a GREAT spot for dog owners, babysitters and nannies, semi-pro photo shoots, picnic-goers, view-lovers, and lovers. Oh, not sure if the teens are still doing it, but this was the spot back in high school...\n\nAlta Plaza is gorgeous with it hilliness, and absolutely panoramic view of The City. \n\nThey re-did the play structure a few years back, and it is very modern and safe.", "author": "Misha F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "Located in the scenic, plush, and lush Pac Heights neighborhood, Alta Plaza park is the place to take a walk, have a late night brew with high school kids, or just take a look at the grand view.\n\nNestled between Divis and Fillmore, Alta Plaza is close to many restaurants. Go to Divis if you want to eat cheaper and Fillmore is you're looking for a more \"refined\" spot.\n\nSFCritic", "author": "David J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-03", "description": "The playground is GREAT!  When you're looking for a way to entertain your little one, be prepared to spend hours upon hours here.  I have taken my 3-year old niece here several times and it is a really nice way to spend the afternoon.\n\nThe playground is fenced in so you can let your child run free.  The ground is cushy and rubberized, perfect for testing your theory on whether kids bounce.  Lots of gym equipment to play on and a big sand box await.  For a city park, this is pretty good.  \n\nApparently lots of other mommies, aunties, nanas and nannies think so too.  While the kids are playing, the adults get a chance to interact.  A nice break from toddler talk.  Plus, you can look up every now and then to breathe in and enjoy the view of the city from the playground.  Every now and then you need a sanity check when you spend the day with a child!\n\nThe other nice thing to see are the variety of dogs that trot by.  Everything from Bernese Mountain dogs to pugs will march by.  There's a big grassy hill (well the whole park is on a hill) that is used for fetching.\n\nThere are some decent tennis courts available.  Plus restrooms (which aren't as bad as I was expecting them to be).", "author": "Adrienne P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-10", "description": "I've always wanted to sit on a throne at the top of Alta Plaza and have some friends drag people up to me kicking and screaming and, after I rip their hearts out with my bare hands and behead them, toss their heads down the terraced south face like a bouncy basketball. \n\nThere isn't really much charm here, though. It lacks the wilderness of the hiking hills like Bernal and Campbell, but doesn't have the meticulous care of Alamo, either. I think it might be the patchy landscaping, the fact that some parts of the park are left to grow wild, with stray tufts of long grass poking out of various edges, while others are well-manicured and controlled.\n\nOn second thought I don't think I will perform any human sacrifice here. I'm sure that all the gazillion kids at the playground wouldn't like it.", "author": "Geronimo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "This park is AWESOME!! Bring my kids here at least 2 times a week! It is never to crowded just a couple people walking through. There are tennis and basketball courts also but my kids just play on the cool toys. One of my favorite parks in the city and its just such a bonus we live so close!!", "author": "Emily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-14", "description": "It took many passes till I finally checked Alta Plaza Park out on foot as opposed to a window seat on the 3.  If I walked far enough on my lunch hour, I'd reach this park and sit and relax for a minute before heading back to the madhouse known as work.  On walks home, I'd again find myself gravitating towards a bench, usually to watch the fog roll in over Sutro Tower.  \r\n\r\nSit on the northern end @ Pierce and glimpse out towards the Marina and Alcatraz.  If you've had enough of the views, forget people watching--it's all about dog watching at this park. There's also a playground for the kiddies and tennis courts for the big kiddies. \r\n\r\nAnd for you movie buffs, the cement steps here were featured in \"What's Up, Doc?\" with Barbara Streisand.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-05", "description": "There's only one reason I go to Alta Plaza Park....Pug Sunday.\r\nI don't live near here, so it's an out of the way trip.  I don't even have a dog, yet.  I only venture out here about once every few months.  I usually go when it's a nice and sunny day.  Yes, not everyone loves Pugs, but for those who do, you get to see them frolicking amongst one another.  A funny sight to witness.  And a great view of the bay from that hilltop, too.", "author": "CE Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-29", "description": "It's a block away from my house.  It has an amazing playground for kids which is impeccably clean and refreshingly wholesome.  Three above-average tennis courts provide some of the sport's best views as you smash the ball into your opponent's court.  Or into the fence, whatever.  There are dogs to boot (watch out for their poop!) and an overall relaxing and enjoyable atmosphere on a sunny Spring day.\n\nGrab your friends, pick yourselves up a bucket of KFC, more beers than you think you'll need (having shotgunning contests makes them go fast!) and spread out a blanket.  This is the life...this is what SF is all about.  That's what I did this past Saturday, and the sunburn, hangover and 7 hours spent doing nothing useful were the best 7 in recent memory.", "author": "Louis M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-08", "description": "There's something about coming here with a flashmob of cyclists late at night. Oh and swings and seesaws don't hurt either.", "author": "Navi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-07", "description": "Great location and neighborhood.  Used to come here every first Sunday of the month so my god-kids (pugs) can socialize a bit.  Yesterday, parking was difficult as the Fillmore Street Fair brought more people to the area than usual.  There were about thirty to forty pugs there and plenty of  'sniffin' going on.  It was disappointing to find all of the garbage cans overflowing and the wind blowing it around the park.  I know it's a holiday weekend, but couldn't someone have cleaned up on Saturday?", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-03-22", "description": "Breathtaking views of the city, and far less touristed than many of the other green places I know, Alta Plaza is a great place sit and gaze at our fair city while  devouring pastries from Bay Bread Boulangerie (2325 Pine Street @ Filmore) which is  convieniently close by.\r\nhttp://www.sfneighborhoodparks.org/parkhistories/altaplazapark.html", "author": "Stellah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-02", "description": "my new favorite park/ spot for a coffee break! :)\n\nclean\nnice fenced in playground\nlots of benches\ndog friendly\ncool pyramid layout\nAMAZING VIEWS!", "author": "Stacy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-18", "description": "Climbing the stairs on the Clay Street side must be close to climbing the stairs of a Mayan pyramid. . they just seem to keep going and going! But - totally worth the effort. The views from the top are amazing, especially at night. If you walk around the other side, on a clear day you can see GG Bridge. \n\nThe park seems to be kept very clean and at night is pretty quiet.", "author": "Sarcastic T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-01", "description": "For tennis peeps, this is THE nicest place to play tennis in the city. Two courts (well three, but the other one doubles as a bball court and people are always using it for that), good surface, view of pretty mansions on one side, view of dear SF on the other. I've had to wait 30 min or so almost everytime I've gone but I just console myself with nice views of PacHeights, boo hoo.\n\nIn the morning, lots of dogwalkers. I heart dogs!", "author": "Dan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-28", "description": "This park makes my dog happy, thus, it makes me happy. I get a good workout walking up to the top of the hill, and I can let my pooch off his leash to sniff around at his hearts content. There are friendly dogs of all sizes for him to play with...he looks all sad when they chase them but I know deep down he loves it. The stairs are also a great workout! \n\nThe views, even on a foggy day, are incredible. It's a fantastic place to check out this beautiful city we get to call home.", "author": "Annie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-09", "description": "This is probably one of my favorite parks in SF. It totally caught me by surprise one day when I was out running. The climb up the stairs is intense but, hey, it's good exercise and when you reach the top you are totally rewarded by the view. Dog watching is great there too. \n\nAlso, I've never personally participated but I have friends who play basketball there and there seems to always be a court available. \n\nIt may not be the greenest of all parks but the variety of people and dogs, the view, and the central location, make up for it.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-02", "description": "Great Park, What a view, lots of benches and stairs to exercise up and down on.  Fantastic upgraded playground for youngsters.  Easier parking and fantastic place to spend time while you are waiting for someone to get their braces placed at the local dental school just 3 blocks away.  As mentioned above, views of the city are 5 star.  If you have a doggie great park to take them or just want to look at doggies having fun.", "author": "Susan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-29", "description": "Wonderful park for dogs. Dogs allowed off lease but not fenced, so only for dogs who are well trained. Walk to park or street parking only. Friendly dogs; our puppy loved it here!", "author": "Molly R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-01", "description": "To tell you the truth, I never liked Alta Plaza that much. It has draining problems that fill the sidewalks around it with muck. The grass isn't quite as green on the south side as it used to be. They are ripping up the bushes on the south side too. As my neighborhood park, it lacks the character that some other major parks (Glenn, Dolores, GG, etc.). \n\nThen again, I have to say that it is coming along. With a brand new play structure for kids, the park is now safe and fun. As for the four legged friends, you just can't get any better. There are more dogs here than I've seen almost anywhere. Go to the top side (north) to check 'em out along with a fantastic view albeit usually a bit windy. Tennis courts get moderate use but have been redone so that they are looking quite spiffy. It can be nice for a picnic but beware for dogs who want your food and wet/muddy grass.", "author": "R K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-12", "description": "I love this park. It has beautiful views and a great park for kids. I don't even live in San Francisco, but I bring all of my out of town friends to the Groove, then walk over to this park to see San Francisco and walk around the neighborhoods.", "author": "SuSu O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-05", "description": "What an awesome park with an awesome view! I wish we went on a day when it was sunny and warm! But that's okay my little companion and I had a great time and he had a great time showing me \"spiderweb\" park (which he likes to call it because of the spiderweb looking climb structure). You don't have to be a kid to have a good time--great place to play tennis, run around with your dog, play with the kids and meet new friends. Oh, and did I mention a awesome view of San Francisco?!!! This is the park to be at!!!", "author": "Mel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-06", "description": "Every dog deserves a walk through alta plaza! It's my dog's favorite place with lots of paths to walk and plenty of friendly dogs and owners. nice city views and a small view of the water, you can even spot alcatrez on clear days. Plus it's an awesome location to watch the blue angels.", "author": "linds c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-23", "description": "I love this park for so many reasons. It has a gorgeous view of the city, parking is relatively easy to find, the tennis courts and basketball court are kept clean, there are happy children always running around and most importantly, my dogs love it here! I think they might even like it better than Fort Funston!", "author": "Margaret Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-19", "description": "The first and last flight of steps on my jog path, Alta Plaza offers something beyond that of Lyon's scenic splendor: flowers that smell of maple and the playful sound of children laughing.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-28", "description": "they renovated the play structures and now there's lots of places for the kids to play.  beautiful views from the top.  always lots of dogs and joggers.\n\nlittle neighborhood secret - this is one of the best places to watch the fireworks on july 4th.  you don't have to deal with the traffic going to fisherman's wharf, and there's plenty of parking.", "author": "Ray R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-03", "description": "PUG DAY!  First Sunday of the month at this park.  I don't even have a pug but I still come and sit out on the grass with a bowl of water for the puggies as they run around.  This is a beautiful park!", "author": "Anna L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-05", "description": "Decent park for hanging out in with a nice view of the bay. What really makes this park work is Pug Sunday that happens on the first Sunday of every month from 1 to 5pm.", "author": "Jerry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-07", "description": "For nostalgia alone I'd give this park 5 stars but on a recent visit I was disappointed to find that they had completely dismantled all of the play structures. The massively tall swings are now shortened to a plastic stature. I miss the towering wooden play structures... Or maybe it was towering because I was so short... ?\nI went to Waldorf, right down on Washington St., so we were one of the groups of obnoxious school children running a muck on Friday afternoons for years... so it has so many memories of capture the flag, make-believe and so many wonderful days laying out in the trees and telling secrets. It's not the same anymore, but it's not worse necessarily... I think that there is still a lot of potential for kids to use their imagination and play. I appreciated the sea-saw and the slidey-bar thing... it is a lot more cohesive now, but come on... why ruin my child hood memories like that Alta? Whyy?! (It's just like the SF Zoo, is it better? or just different?)\nIt's still a beautiful park for any occasion!!! I heart Alta Plaza.", "author": "Mary Ella D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-30", "description": "My dogs LOVE this park because of the stairs and the sloping grassy sides leading up to the top.  They chase each other up and down the slopes until they are exhausted.  So far, all the dogs we have met at this park have been friendly and well behaved.  The park is clean, well kept and offers great panoramic views of our lovely city.", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-12", "description": "I use roll my fat ass around this area.  At the end of my roll I always stopped here to reflect on my fatty life.  The views here are amazing.   Especially at night time.  This was my sanctuary when I first moved to SF.  Then I moved to the Sunset where everything is dark, cold, and wet.  Woot!", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-13", "description": "I live near this park and I take my niece & nephew here pretty often.  They re-did the playground a few months ago, so now everything there is brand spanking-new and shiny.  Pushing my niece on the swing (\"higher!\") while enjoying the amazing view of the city is a pretty nice way to spend an afternoon.  And all those steps make for a great workout.   Plus, I can always find parking somewhere on the perimeter of the park, so hooray for that, too.", "author": "DD B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-03", "description": "Beautiful park with one of the greatest views of The City. I remember coming here when I was younger and how much I enjoyed visiting this park. They have a playground, a tennis court, a basketball hoop, and plenty of space to play football, frisbee or even just to sunbath. I'm especially glad they re-did the basketball area, since it used to be right next to the stairs at the very top, and if someone missed the hoop and it went down the stairs you would've been assed out.", "author": "Rommel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-06", "description": "i eat lunch at this park every day that i'm at work and it's reasonably sunny.  it's called alta (tall) for a reason--it's a big hill and you definitely get a workout walking up to the top.  you also get a bunch of wind in your face, which often makes it difficult to eat your vegan lunch without getting it on your shirt.  but you also get frequent visits from hummingbirds, cherry blossoms, the telegraph hill parrots flying overhead, and of course wonderful views of the bay and san bruno mountain.  once i saw an immature red-tailed hawk swoop down, grab a vole, and fly up to the top of a lightpost to dismantle it.  it sure beats the lunchroom.  \n\nonly problem--hard to get a bench at lunchtime, and sitting on the ground isn't quite safe with all the friendly dogs leaving their marks.", "author": "kate s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-02", "description": "Beautiful park to play tennis in.  Three courts in exceptional condition, though I feel bad when some kid wants to shoot hoops on the last court which is multi use and painted to accommodate three basketball nets.  Pick up a racket son, you in Pac Heights, I'm sure your parents have spent mad $$ for your tennis lessons.", "author": "Sam N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-25", "description": "a walk to the peak of alta plaza park facing the bay with views of sailboats along the pale blue skyline reminds me of all the reasons why i am so blessed to live in this beautiful city.  come here for all the reasons mentioned by our yelpers:  pug sunday, the swanky playground complete with foam floors, the tennis courts and basketball court (which i believe stays lit on certain nights), the endless stairs - great for working out those gluteals, the wraparound pathways for walking to get your blood going, and the hills of grassy green for your doggies to romp on (thanks responsible doggie owners for picking up your pet's poop!).  \n\nwhen i'm up on that hill inhaling the crisp ocean air with the cool breeze whipping through my hair,  and little zeus by my side, i know that all is right in this world and i'm happy to be alive!", "author": "Josie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-22", "description": "I love how I can play tennis while having an awesome view in front of me- Its beautiful! The courts are clean and well maintained and there are a lot of people who bring their dogs here to play. Situated above a hill are 3 hidden courts and a playground. I would have never known there were tennis courts if I hadnt walked up! Love it!", "author": "M W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-20", "description": "Although it's a small park (compared to Golden Gate Park), it's an enjoyable place to take a walk or hangout. Like William S.said, it has elevated levels much like Macchu Picchu. I don't have a dog to walk, but the view is spectacular. On a great day, you can see south towards downtown and Market. The area is close enough to Fillmore to have some good food and coffee at Royal Ground if you want. It's a great place to relive those days when going to a park was enough to have some fun. The only reason I'm giving it three stars is that it's a little small and busy with dog walkers. That and I don't make it out here much.", "author": "Stan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-21", "description": "Probably the closest thing I'm gonna get to Machu Picchu with the economy as booming as it is these days...a great place to take the city in, and work out your glutes as you climb higher and higher to greatness. I love that you wouldn't really know it's there either, a quiet haven on a hill, all in the *comforts and priviledge* of Pac Heights...", "author": "Danielle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-04", "description": "It doesn't get better than this. Tennis courts, an immaculate playground (complete with kids on play dates), and situated atop a hill overlooking an altogether awesome view of the city. Perfect for small picnics and reading out in the sun. But I think my favorite thing about this park is its individual tennis courts. Unlike courts with three tennis courts lined up in a row, stray balls did not necessarily lead to pissing off neighboring players.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-03-29", "description": "Favorite place to walk to. Amazing views of the city, lots of dogs, people reading the paper, tennis court and surrounding homes are amazing. Head a block over to Fillmore to get some coffee or shop.", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-23", "description": "My favorite place in the whole city.  Too bad they are doing construction on the kids playground, but it should be a sweet playground when they are done.  By they way there are the BEST doggies here.  I've seen oodles of poodles, pecks of pekinese, and lots of labs. Oh yeah great view of the city, and the water, and beautiful houses, and DOGGIES!", "author": "Moi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-03", "description": "A sweet little park in the middle of Pac Heights with a view clear out to the bay and Alcatraz to the North and Alamo Square to the south. It's a little condensed slice of a happy outdoor recreational goodness appropriate for the whole family. The dog park always had at least a couple of four legged friends romping about, sniffing in the sights. For a great feel the burn walk/round of self inflicted pain and torture day, start from Van Ness up Clay and then take the long way up. If you have hyper active kids with you (perhaps friends are visiting from out of town and they brought their little terrors with them or you have some sweet little beesters of your own) make them do this walk with promises of one of the coolest playgrounds ever. There's plenty of things for them to climb, swing on, spin on enough to put themselves into napland while the folks can take pictures, layout, meet other visitors/locals, have a picnic--all the fun parky things you can think of in a setting that's quintessental San Francisco. \n\nP.S. Being that this place is so San Francisco, the wind up here can be a little nippy. Consider bringing a windbreaker/ sweatshirt and/ or bubbles. The sweatshirt will keep you warm and the bubbles will keep you entertained.", "author": "Veronica G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-10", "description": "Attractive people doing all kinds of attractive things.... I wouldn't recommend smoking here though...", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-08", "description": "I have spent a lot of time in this park.  Beautiful views, great location near Fillmore St. shops and restaurants.  Oh and there are tennis courts!! If you want  some exercise while there, take the steps on the south side of the park up and down, up and down.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-08", "description": "My kid's favorite park in the city - and mine too! The playground is so cushion-y soft and check out the sandbox. You have never felt sand as soft and beautiful as that - outside of some beaches in Hawaii maybe. The view of the city is fantastic and proximity to Fillmore is great if you want to pick up some lunch or coffee or what have you!", "author": "Melani A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-24", "description": "Great spot for letting your dog romp with other well socialized mutts.  Lots of space and friendly owners to chat with.  Head for the Jackson/Scott corner between 6 - 7:30 now that its staying light longer.", "author": "Tracy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-25", "description": "Small dog run on Washington Street side also used by caretakers of adoptable dogs from Pets Unlimited; plastic bags stored on wooden post for humans to pick up after dogs they are caretakers, 60 year old Afro-Amer. woe-man with old toy terrier never picking up after poop pellets, damn does the same thing on Fillmore Street and Hamilton Park. Rant and Rave. Will someone just toss those pellets on her ass cuz she could give a rats' ass about picking up her dog's shit pellets.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "Awesome dog park!  Yes, dogs rule SF.  I live super close to this wonder and take my dog almost daily.  Your dog can roam off leash and smell all the stains and spots and do her business where ever she likes (just pick it up, please).  Most people are pretty cool, but there are always a few people with their kick-me dogs that freak out when your dog runs up to them to play.  Not my baby!!!!  Yes, my dog may be part pit bull but get over yourself.  Any whoo, this place is green, has a billion dollar view of the bay, an awesome kiddy play ground and great grass.  My only complaint is the dang wind.  It never seems to stop but I guess I should get over that fact since it is a natural occurrence called San Francisco.", "author": "Carolyn D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-01", "description": "Great park for kiddos who like to stalk dogs in between trips back/forth to the twirly slide. Kudos to the friendly dog owners who nicely share their slimey tennis balls with demanding toddlers.", "author": "S S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-07", "description": "i love going to this place during all hours of the day. perfect for a warm summer/fall day to just lay out in the sun and scope out the beautiful view of SF's mid city. the view is equally spectacular if not better at night. never very crowded like dolores park which is also a nice perk. always the occassional dog walkers and school kids at the playground. the spots complete with tennis and basketball courts too. be careful on the basketball court though, always has tiny pebbles that have caused nasty falls for me. many stitches attributed to that court. but i love the spot never the less.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-14", "description": "except for twin peaks, i would say that this offers one of the best views of SF.  free street parking if you can find it and if you own a dog, i would highly recommend this area.\n\ncan you really complain about a place that is free and offers views like this one?  if you walk a little to the corners, you can see views of the bay as well.  awesome park.  the people who live close to this park are spoiled.\n\nyou can even visit this park at night for a gorgeous view.  dress lightly if you want to freeze to death.", "author": "Bryce K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-09", "description": "9/7/09: beautiful park with benches to burn off those calories from lunch. we hung out here for a couple hours enjoying a rare warm san francisco afternoon. hugs and kisses out to the black and tan norwich that taunted us, we miss gherkin! anyways, too bad our kids can't be here to enjoy the park too!", "author": "Jesse W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-14", "description": "I used to love this park.  It's has tons of benches and great views of the city to the south and the marina to the north.  It is a great place to eat lunch or just lay out.  There are also three or four tennis courts that are in really good shape and this would be a great place to play accept for all of the snotty pac heights parents who kept trying to make us leave our court so their kids could play.  I wouldn't bring this up if it happened just once but we were interrupted FOUR times while we were playing one set with people asking if they could take over the court......NO, are you people not familiar with sharing?  You can wait just like everyone else and have it when we're done....and just because you have kids with you doesn't mean you have first choice on everything at the park, yeah they're cute, they need to learn to take turns because apparently you never did.  Anyway, now that I got that off of my chest, I will go back to Alta to eat lunch but I will probably head over to Lafayette to play tennis in the future, even if the courts aren't as nice, at least I won't have to deal with snotty poo people.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-13", "description": "it was so sunny and refreshing to play bocce in a new park..\n\nthis park was full of dogs, on the top of a hill, sunny, full of lounging couples, nice playground if you have babies..\n\nit was just a nice change from other sunny parks that are full of PBR's and piercings\n\nclose to the 22 bus line", "author": "Kate R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-07", "description": "the bf and i have come often w/ a picnic basket of food so that we can enjoy the view and watch the dogs play.  sitting on a bench and looking out to the bay and marin on a sunny day makes me appreciate living in the bay area.  cheesy i know, but it makes for a relaxing afternoon.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-08", "description": "just a great park.  i like it better than the nearby lafayette.  set on an overlook with a great view southward of the city below, with twin peaks and sutro tower to the southwest, buildings of tenderloin to the southeast.  nice place to walk a dog (though i don't have a dog) and play tennis.  but this is usually a pretty quiet park.\n\nawesome playground, one of the most extensive around.  lots of stuff to keep the little ones occupies, on soft padded artificial surface (as opposed to sand).", "author": "Greg H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-07", "description": "You have to check out the monthly \"Pug Fest\" that happens here the first Sunday of the month from noon to 4!  Walking through the park seeing all the people having a picnic, tons of children playing on the beautiful play sculptures and equipment, on a beautiful Sunday afternoon, we came upon this herd of little pooches that was hilarious!  Can you imagine seeing at least 30 pugs of all sizes, shapes and ages just running and romping, having a good ol' time! While the majority are white with black, there were some all black pugs to be seen.  Check it out sometime!", "author": "P G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-03", "description": "an open sunny space to chill out and relax. plenty of grassy area to just lay down and stare at the sky. close proximity to fillmore makes alta plaza better for hosting picnics.", "author": "Court L."}
