{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "First timer when it came to South African food and I became an instant fan.\n\nI've been back three times in a couple weeks ever since. \n\nGive it a try!", "author": "Jaye P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "I just discovered this place...I am so happy I stumbled upon it!!! It is absolutely delicious!!! I have had food from South Africa before but not like this. This truly tastes like home cooking to me....even though I am not South African:)\nI cannot wait to go back:)\n\n(I know it looks sloppy...don't judge...just try it:)", "author": "ada l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "Slap Chip Roll and Bunny Chow are amazing. This is a regular lunch spot for me.\n\nThe Rooibos Ice Tea is also worth a try.", "author": "S H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "This place is tiny but so popular. They usually run out of food by 12:40 or so, so -1 star for that. The place is so popular that the host has to convince people that they ran out of food. Malay rice with sour cream was delicious", "author": "Sushma R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-16", "description": "Much better than the last time!\n\nLast time I ate here the food was so salty I could not finish it (See my first review below), but because of all the other good reviews I decided to give it another chance and I am glad I did!\n\nAs the first time, the folks behind the counter were very helpful and friendly. The young man who I spoke with helped me identify the dish (Bobotie paleo) that I saw another customer have. Based on my first experience, I was a bit uncertain about how I would enjoy my meal, but I was proven wrong. It was delicious and I enjoyed it very much. The flavors were pleasantly different and the food was not overly salty unlike my first meal here.", "author": "Afshin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "My first time eating South African food. The beef with raisins was great...I am a fan.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "I have been meaning to go here for years. My father had recommended the Frickadelle flap chip roll, but I decided to try their Chicken bunny chow. If I haven't already mentioned ladies and gentleman I am very particular about chicken. A chicken hater if you will. \n\nOver the years, I grew to dislike when chicken is still slightly raw in the center. I also don't like if it is not thoroughly washed and prepped to get rid of the raw smell. Then why do I always get chicken? Well in the hopes that one day, I will come across chicken so thoroughly cooked and delicious of course!\n\nThe chicken chow is chicken curry in a little white bread loaf. They cut the top off. In the hollow center, they scoop the chicken. Then you can rip the bread and sop up the curry.\n\nI ordered the chicken bunny chow with trepidation. My worries were for not. Amawale's chicken bunny chow was everything I hoped for and more. \nHallelujah! There chicken chow was so so amazing and actually spicy!! They used cardamom pods and seasoning so that it tasted like spicy South Indian curry. \n\nYou know it's legit when they use cardamom pods. This curry is more authentic and far better than any curry you will get in an Indian restaurant in the U.S. Bow down to the awesomeness that is chicken chow!\n\nI loved their generous portion size and very reasonable pricing of $8.00. You can definitely share an order with 2 people.\n\nWhen you read the poster on their wall, the fact that it tastes like South Indian curry is unsurprising. It indicates that South African cuisine is a mix of many African people as well as Indians, Malaysians, Dutch etc. \n\nI got the Frickadelle flap chip roll the week after the chicken chow. Amawale's Frickadelle roll comes in a baguette with 2 large beef meatballs, a small amount of lettuce, fresh floppy vinegar soaked potato chips, and plenty of their peri peri hot sauce. This was not as amazing as the chicken chow (3.5/5) , but definitely worthy a try.\n\nI felt that the meatballs were overcooked and wished there was more lettuce to fill up the inside of the sandwich. Towards the end I was eating bread and the peri peri hot sauce. Their hot sauce is delicious though!\n\nI am a huge fan of Amawale's chicken chow.  Due to their generous portions, reasonable FiDi price under $11, and their amazing flavors, I absolutely cannot wait to come back and try their other dishes!", "author": "Uma A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Cant rave about this place enough. Nice people, cheap prices, and delicious unique foods. You order to go and eat in the fancy rincon center with indoor rain machine. I opted for the daily special a meat pie and it was the bomb. Kind of like a pot pie but the crust was made of croissant and it was loaded with african spiced beef. It came with an orange tomato based vegie curry that was very tasty as well. All in all very filling for around 10 bucks.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Hands down my favorite lunch spot. Everything is absolutely delicious, filling and exciting! What these women do to chicken is out of this world. Run by amazing people who make it seem effortless.\n\nLove it!", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "When the lunch world is dominated by salad bowls, quinoa bowls, and automated quinoa salad bowls, a South African kitchen is godsend. Add the touching story about twins from South Africa bringing traditional recipes and techniques, and you a meal with all its layers, from ethnic roots of South African cuisine, to the sisters' passion for cooking, to a Californian sensibility for quality ingredients. (I feel bad hating on Eatsa, but seriously this is so much more interesting and real than generic food with a robotic interface)\n\nAmawele's has a straightforward but diverse menu. Essentially, any dish can be vegan or vegetarian (with butterbeans aka lima beans), chicken, or bobotie (i.e. a piquant ground beef). You can choose cape malay rice (traditional), quinoa (for the basic), paleo (over veggies instead), or bunny chow (a bread bowl, with an adorable name). For something sando-like, there's also a frikadella meatball roll, or curry wraps. Items run around $8-$10, which is very reasonable given the large portions. They are so generous with the chicken!\n\nThe only times I've tried African food include Ethiopian wraps from a cafeteria and delicious roasted meats at Jubba Restaurant in San Jose. The unique spice blends at Amawele's definitely stands out and compares with Jubba's similarly complex seasonings. \n\nAmawele's explains South African cuisine as a melting pot of influences from English, Indian, Dutch, Malaysian and Native African cookery, with some Portuguese mixed in as well. The diversity was screaming in my chicken cape malay rice, which at the base seemed remotely related to turmeric-predominant biryani, with the addition of hearty chunks of chicken that evoked a European theme of a simple yet fragrant stew, combined with a more provocative curry-based Southeast Asian style. Blend in raisins for sweetness, sour cream for a detour, and a handful of spices (the mini flavor explosions are quite intriguing when you come across whole cloves and such!) and you have a cultural masterpiece.\n\nI think my only hesitation is the sour cream; the dish does benefit from a creamy dimension, but I'm gravitating towards something yogurt based or the mythical peri peri sauce. FYI they also make their own rooibus iced tea and peri peri sauce in branded bottles! \n\nService was efficient and very friendly; as for seating, Rincon Center offers several chairs and tables. There's even a fancy indoor rain cloud in the building that incidentally helps with the building's thermoregulation as well.\n\nQuintessential SF workday lunch: authentic and delicious South African cuisine, crafted by two sisters, with quinoa and paleo options available, with a backdrop of eco-friendly indoor recycled rain.", "author": "Edna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "This is Downtown San Francisco. A meal here is under $10. March,  2018. You will be full. \n\nLet that sink in.\n\nOK, so I may be biased because I don't work in Downtown, but I have friends who do and they tell me about the ridiculous downtown prices for lunch. Your experience may vary. \n\nTheir menu is small, but definitely unique. Cape malay rice/quinoa. Peri-peri chicken. Frikadella slap chip. Bunny chow. \n\nNo bunnies were hurt in the process of making bunny chow. \n\nI don't think the bunnies will like bunny chow very much either. \n\nI decided to try the frikadella slap chip roll (as in on a bread roll, not a wrap). The chips were fries, slathered in a pink, spicy, vinegary, creamy sauce, hundled together with Dutch style meatballs (frikadella) on a roll. \n\nYes, it's a lobster roll without the lobster.\nYes, it's technically a meatball sub.\nYes, it's a starch fest. \nNo, I'm not on a roll, but the meatballs are.\n\nYou can thank the people who designed that certain T-shirt. You know which one I'm talking about. If you don't, ask a friend. \n\nEating was a challenge. It was pain, it was pleasure, but I guess, no pain, no gain? The roll was too big to shove in my face, the fries too hot, and it was dripping sauce everywhere. Anyone who's had an authentic vindaloo or buffalo wings know vinegar turns spice into pain. Then the cream in the sauce comes to the rescue like the creamy dressing that comes with wings. It's a perpetual mind frik to continually jab your face with fries, bite, exhale as the vinegar drill spice into every corner of your mouth, wow your mouth, and repeat. \n\nFrik is also what they say to the cook when someone orders the frikadella slap chip roll. I don't blame them. \n\nBefore I left, I saw a man receive his bunny chow, a half load of bread loaded with what looks to be their curry. Makes sense. South Africa had/has a lot of Indians and Malays. It wasn't half a loaf of the Wonderbread (or whatever American sized loaf you may use), but it was at least as long as it was wide, stuffed with curry. Good grief, that's a good deal! \n\nVindaloo eaters, how do you eat a whole bowl of that stuff?", "author": "Chi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "What an amazing gem in soma/SF in general! The roobios tea is a blast from South Africa and the bunny chow is so yummy. The flavors are what I remember from my time there and this place makes for a wonderful lunch spot.", "author": "Megan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "I tried Amawele's South African Kitchen for lunch a couple of days ago. It is located in a small corner of the Rincon Center Food Court (close to Arabi Mediterranean Cuisine) which is close to my work place. There is a small menu board outside the restaurant on the right that I was walked through by the person behind the cash register when I asked for some help understanding the dishes.\n\nI decided to get the Paleo Meal ($10.50) which is basically some protein of your choice on a bed of vegetables and a side of mashed sweet potatoes and went with the ground beef option for the choice of protein. After about 5 minutes I was on my way.\n\nTaste wise the entire dish was on the sweet side but not too sweet. I would have definitely liked the sweet potatoes mash to be a lot sweeter (it tasted almost neutral) and the ground beef to have a little more spice (it tasted a little sweet) but they worked well together specially after adding the hot sauce (peri-peri?) that I took from the counter.\n\nPrice wise it was in-line with or maybe a tad cheaper that what you would pay at other lunch spots in the Financial District but the quantity of food was almost twice of what you would get at other places. Even I could not finish everything at one go and has some leftovers for the next meal. \n\nOverall I liked what I ate and have made Amawele's part of my regular lunch rotation. Generous 4.5 stars rounded to 5 is how I'd rate Amawele's South African Kitchen (mainly for being authentic).", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "I accidentally found this hidden gem at Rincon Center One, and I'm so glad I did. For starters, my dish was DELICIOUS! Secondly, I didn't know what to pick and the staff was very helpful in helping me decide. I will be back for sure!", "author": "Fabian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "WOW, just had a godsend of a wrap from Amawele's! Durban Chicken Curry Roti Wrap!\nFlatbread filled with curry and pickled vegetables, legit felt the spice in my scalp, which has never happened before. It is a little on the heavy side, but only just. It's great value for your money and WOW I can't wait to try the other wraps. Very impressed and super stoked to come back.\n\nWendy and Pam are sweet sisters who run the show, but their brother Zayne (not sure if that's how it's spelled) is a super cool guy. BOOM", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "The staff is so nice! The chicken curry was spicy and delicious. I'm not a huge fan of beets, but it tasted really great as a combo with the curry. I would recommend this place.", "author": "Joy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "If you've been to South Africa you will appreciate the home cooking. It's a kiosk but don't let that put you off. Its worth going, generous portion and delicious.", "author": "barbara r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "My first time trying South African food, and I will definitely be coming back! The food here is very different. Their menu is pretty small (thank goodness, otherwise I'd never be able to decide). I went with their Babotie Paleo. I was not prepared for the amount of food, lol. Their portion sizes are ridiculously large, and you can feel it in its weight! This dish is like 90% meat. The beef was delicious though and had so much flavor, so I can't really complain. It's served ground up over a bed of veggies and fruit (broccoli, pineapple, raisins, carrots, cauliflower). Whatever seasoning they use--it's perfect! Wasn't really a fan of the potato-like thing that came on the side. Not really sure if it's even potato. It tasted like they mixed truffle-oil or something with it, and I'm not a fan of truffle...at all, so I didn't really enjoy it. \n\nBut besides that, I'm a huge fan! Prices here are reasonable and the wait isn't too bad if you come before peak lunch hour. Highly recommend giving this place a try.", "author": "Ashley Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Wow, first time having South African food.\n\nTaste great!", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "This place is amazing. Great food , great service and at the right price. I'm glad I tried it again as I just needed to find a dish that wasn't spicy for me.  This place sells out of their more popular meals, I just wish they were open for dinner as well.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Thanks to other Yelpers, I was able to find Amawele's South African Kitchen, which is tucked away in a corner of Rincon Center.  It is between the Mediterranean restaurant and a coffee shop.  \n\nSo far, I have tried the Bobotie paleo, which features ground beef that is generously seasoned.  Adding the Peri Peri hot sauce elevates the dish even higher for me.  Next, I tried the chicken roti wrap and the Bunny Chow, which is chicken curry smashed into a soft bread bowl.  I especially loved these two dishes because I tried them on a day when I was craving Indian.  \n\nLunch is affordable and portions are very, very generous.  I suggest that you bring a bag to transport these leftovers, which you will appreciate re-experiencing during dinnertime.  The food heats up in the microwave very well.     \n\nYou can even bring home an extra serving of Peri Peri sauce or purchase a bottle to experiment with other food when Sriracha is feeling a bit too tired.", "author": "Miran C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-20", "description": "I heard good things about this place and tried for the first time through mealpal. I opted for cape malay rice (veg option) and i want to tell you just avoid this at any cost. I understand that they are offering items which did not get sold through regular walkin through mealpal. The malay rice is just tamarind rice without any taste served with broccoli/raisins and sour cream. Please dont try this. If you want to try order something from their menu but never order malay rice.", "author": "S C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-04", "description": "Extremely nice people but unfortunately the food  tasted really bad which will keep me from coming back here.  I had the spicy chicken, which tasted extremely sour and salty but still somehow lacked flavor.", "author": "Praneeth W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Who would have thought to find South African food in the heart of the Financial District?! SF truly has a little bit of everything. \n\nI had never had it before and didn't k ow what to expect. I saw people rave about the bunny chow so I started with that first and it definitely did not disappoint! A sort of chicken curry in a bread bowl you can't really go wrong. The curry Is distinctly different from Indian or Thai. \n\nAlthough I'm sure this only scrapes the iceberg in terms of South African food, I was really glad to be able to try what I could get my hands on. Although the bunny chow is great it is a bit heavy for a lunch where you have to go back to work and focus (especially since I always end up eating the bread bowl as well) so what I usually come here for is the Cape Malay. It's a spiced rice dish that is awesome and doesn't feel as heavy as the bunny chow. They also offer paleontology options like chicken curry and sweet potatoes which is REALLY good. \n\nThis is a great escape from some of the bland tastes of the FiDi. On a side note, make sure to get the peri peri hot sauce! with whatever you end up getting.", "author": "Thielson D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-04", "description": "I got a bunny chow with chicken for lunch on a weekday. http://tinyurl.com/zd3agr6\n\nIt's kind of like a curry in 1/4 loaf of bread with some pickled carrots on the side. I've never had South African cuisine before so I had no idea what to expect. Overall, I thought the meal was decently tasty but probably not something I would recommend to others as a must try. It was also a lot of food so I had to eat it over 2 meals.\n\nThe curry was a bit spicy - they didn't ask me how spicy I wanted it so it's probably  the default spicy level. I'm a fan of spicy food but I could see how others can be unpleasantly surprised by this.\n\nI think my biggest complaint about this meal was the chicken. It was pieces of bland and dry chicken breasts. The spices in the curry can certainly help w/ the bland part but the chunks were big enough that the chicken pieces just didn't have any flavor inside.", "author": "Lily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "There aren't many genuinely South African restaurants in the Bay Area (this might, in fact, be the only one) and so it's a treat that it is walking distance from my office! The food isn't amazing but it is authentic.", "author": "Sunil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "I had never tried South African food before, until I ordered from Amawele's for the first time. It reminds me of home cooked comfort food, so while on the one hand it was a cuisine I had never tried, the tastes were still familiar. \n\nWhen I'm in the mood for something that has that home cooked taste, I usually get the Bobotie, either the paleo version or the rice. The seasoned rice they use is absolutely delicious, and the bobotie which is a ground beef mixture is fantastic. The paleo version comes with sweet potato truffle mash, which is also good. \n\nI also appreciate that this place does not skimp on the portions. The other options on the menu, like the cape Malay rice, the Durbin chicken and bunny chow, are also wonderful.\n\nOh, and they have some of the best hot sauce I've ever tried-I load up my food with that stuff.", "author": "Gary H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "3.75 stars!\nInside the Rincon Center food court, Amawele's (means \"twin sisters\") takeout counter serves South African fusion cuisine (Cape Malay, Dutch, Portuguese, etc.). The menu has a mix of modern home cooking and traditional street food ($9-$10).\n\nOn some weekdays I only eat vegetarian. I really like the vegetarian Cape Malay rice with sour cream, and the vegetarian quinoa dishes (both get 4 stars!!). Yeah, quinoa is from Peru/Bolivia, so that's not really South African. It's a modern home cooking style dish. Both dishes can be made with Bobotie (spicy ground beef).\n\nOn my meat eating days, I tried the Bunny Chow (curry served in a square bread bowl) and Curry Roti wrap (choice of same curries on a thick Indonesian style roti flatbread). Both South African street food dishes were just okay (3 stars). Although the bunny is a better value (by volume) than the smaller wrap.\n\nNotes: the curry sauces can be too spicy for some people. So not everyone might like it. Service is friendly, so just ask the cashier if u prefer something less spicy.\n\nCape Malay cuisine (curries, sambal, masala, ginger, garlic, rice, stir fry, etc.) derived from Southeast Asian slaves, mainly Indonesians (influenced by Indian, Malay and Chinese cuisines), brought to South Africa by Dutch colonists.\n\nAmawele's is one of the few SF places that makes Peri-Peri chicken (spicy marinated chicken), a Portuguese influenced dish because they brought South American chiles to South Africa. Peri-Peri is very popular in former British colonies, including Australia. Amawele's Peri-Peri version is a very spicy stew, rather than the whole grilled chicken version available elsewhere.\n\nI wish that South African restaurant chain Nando's opened a location in SF (all US location are in the east coast). That chain is famous for excellent grilled Peri-Peri chicken.\n\nI haven't tried the Peri-Peri from new FiDi rotisserie Spinnerie yet.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "Love Amawele's South African Kitchen. Had the piri-piri chicken with sweet mashed potatoes the first time (very spicy), can't remember what I ordered the second time and got Cape Malay rice with Botobie the third time around. They are very generous with the portions, and the prices are very affordable. Have dragged a couple of friends here to try the food; both ordered the bunny chow and have professed an enjoyment of the dish.", "author": "Sharon H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-03", "description": "I love that Amawele's is something different in the Financial District. It's refreshing to find restaurants that don't just have sandwiches and salads! They have a small menu with some pictures, which made ordering South African food for my first time a lot easier.\n\nI wasn't quite sure what to expect, but I ordered the Bobotie Paleo. I was surprised when I picked up my order because the box was so dense and heavy! It smelled really good too though and I was excited to eat it. The meat was full of flavor and it was mixed with both fruit and vegetables. Was definitely full after eating what seemed like only a small portion of the box! Everything inside was very flavorful and juicy. \n\nNot sure if I'll be back! It was fun to try something new, but I'm not sure if it was really my thing. Also the wait was a bit long compared to other places in the city.", "author": "Kathy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "One of the best options on mealpal! Had the chicken rice bowl with sour cream and raisins and it was fantastic.", "author": "Jacob J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "The chicken curry over quinoa dish is my go-to lunch.  \n\nThe roti served with half bean curry and half with chicken is also really delicious.\n\nThe staff here is from South Africa so their food is authentic.", "author": "Jane G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-18", "description": "Talk about a hidden gem! Amawele's is tucked away in a corner inside the Rincon Center, away from the craziness of Yank Sing and the other places that get more traffic.  I can't say that I've had South African food before, so this was certainly a new experience for me when I decided to have their Bobotie Paleo for lunch! The ground beef had an assortment of flavors and spices, and was impressed with how much food you get for one serving - fed me for both lunch and dinner! Having a Paleo friendly option (assuming you eat sweet potatoes) is pretty awesome and the food is simple but delicious. I will definitely be back!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "I've been here twice. The staff is friendly and the food is great! I've had the vegetarian sandwich roll with the pickled fries and bean curry. The creamy orange sauce is great, the bread is soft, there is hot sauce on the side which is good and the portions are big. The prices aren't bad either, you can get a meal for about 10$ or less. It usually comes out within 5 minutes so you aren't waiting long either. \n\nIt is a bit annoying that most things are sold out by 1:30Pm, but I guess it's to prevent waste. Overall good food but come early if you want any selection. It would be convenient to put in green the vegetarian stuff on the menu, as it takes a while to find the vegetarian ones.", "author": "Neil P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "It is insane how much bunny chow $9.50 will get you at this place. I didn't think they'd be able to close the lid on the take-out box, but these people are pros and I am full of curry. South African comfort food that will set your mouth on fire - and you'll like it.", "author": "AJ P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "Oh my God, this place is Amazing.\n\nThey make one of the best curries in the Bay Area just like how my mom used to make them when we were kids.\n\nAnd their peri sauce is to die for.\n\nThey are defiantly different from other places, they are very nice and grounded people.\n\nIV been here a couple of times now and one day they were discussing between themselves how the chicken was a bit more tender and how the chicken was today which showed they take great care in the food they make. \n\nAlso I came early one day and saw them bringing cooking stuff on the trolley. They had real Organic yogurt. The rest of stuff looked nice too. \n\nI would and have come here again and again again and again. Last Monday I came a bit early and they gave me A lot of great Curry. \n\nThey probably didn't realise it was Eid day and shared the pictures with my family who live far away. It was just like I was home again.\n\nThanks, guys you are the best.", "author": "Sam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "Haven't been to South African since 2003, but ummmm that chicken curry roti, so good it's like transporting me through time and space. Just try it or anything! I don't think you could go wrong here and peri peri sauce will make you happy.", "author": "Cara J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-18", "description": "Glad I came across this place while looking for something different in the area.\n\nThe food was good, though it has a potential to be much more tasty. If you like hot stuff (i mean hot sauce :), definitely try their's; it has a nice taste and texture, and not too spicy at the same time. Also the food quantity was large (even for me :).\n\nThe service is slow, and definitely can be improved.\n\nThat said, this place is still worth checking out if you are in the Rincon Center.", "author": "Gilbert B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "This place is hopping at 12:10pm so get there early or be prepared to wait! I put my stamp of approval on this place. I am so happy that they have paleo options, easy for someone like me with a restrictive diet to know I can eat what they're dishing up. \n\nI tried the Paleo lemon herb chicken which was SO delicious! The sauce was full of flavor - lemon, herbs, and I am pretty sure heaps of garlic. There were veggies in there, too - cauliflower, broccoli, and carrots. But I am pretty sure they were frozen, the carrots weren't too good. Loved the beets on the side, too. \n\nI'd recommend giving this place a try but decide for yourself what you want to try. I think I would try the curry next time, I was just trying to avoid spicy stuff this time.\n\nI'll be back, for sure.", "author": "Jess A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-18", "description": "I've been meaning to come here for a while and was planning on getting the frikadella slap chips but then got flustered at the menu (probably because I was hungry, I missed the helpful one with photos) and my eyes landed on the bunny chow section. Beef bunny chow it was. I wasn't even sure what I was getting until after I ordered. Oh, there's the photo menu! Guess I was getting beef curry in a bread bow.\n\nBut this was not your typical curry and it wasn't your typical bread bowl. A big hunk of bread cut off the loaf with a hole cut out of the bottom (or was it top?). Into it was a ladleful of beef and potato curry that overflowed into the plastic container. Tasty and spicy! I didn't expect it to be spicy because honestly most ethnic food is toned down for american tastes. And maybe they did tone it down but that stuff had a slow afterburn. Yet I couldn't stop eating. I would take pauses to tear off bread, swish it around in the curry to eat. Slightly less spicy.\n\nI couldn't finish the entire thing, maybe slightly more than half? Dropped off the leftovers with hubby at work and he texted to say \"Yum, curry is so good!\".\n\nI'll have to come back to get that slap chip roll....", "author": "Jean K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-02", "description": "I went here looking for a paleo dish and got the Babotie. It's definitely paleo and the beef was good, though it was pretty heavily spiced with cloves. It was a bit overwhelming so I'd be hesitant to recommenced it to someone going for the first time. The mashed sweet potatoes were pretty bland so I tried tossing on the peri-peri sauce from the front counter and that proved to be unwise. That's some super spicy sauce right there. The vegetables were also pretty bland since I think they just boil them whole. It was a little difficult to eat those big broccoli and cauliflower chunks with a plastic fork. Not the most tender vegetables I've ever eaten. \n\nIt was healthy, but overall just so-so on the enjoyment factor. I'll try one of the chicken paleo dishes next time. Let's see if this rating goes up...", "author": "Britton N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-05", "description": "I got the ground beef paleo option and it's...interesting?\n\nIt's definitely a bit of a culture clash because it's familiar enough to not seem exotic and yet it definitely has some twists. \n\nThe meal consists of three components:\n1. Ground beef\n2. Sweet potato mash\n3. Steamed veggies\n\nThe sweet potato mash is by far the tastiest element. Yammy, smooth and slightly sweet. The beef and veggies are both rather bland, but here comes the strange part; the beef is full of raisins and pineapple chunks...making the whole thing overly sweet. On top of that, the veggies are overcooked (over steamed?). \nSalt/pepper and some sauces can definitely fix this dish up though and I'll be back to try one of the chicken offerings (it comes with pickled beets!)", "author": "Boris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "First time I had South African food. It was delicious. The cape malay quinoa with rice and pickeld beets was sooo good. Also I had something with chicken and broccoli with spicy flavor. Be back to this place. Great food.", "author": "Elvin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-21", "description": "I got the Bunny Chow for lunch (note: based solely on the name). It's basically stew/curry-like concoction poured onto a loaf of what could have been sliced sandwich bread. I enjoyed the spices and interesting flavors of the stew but was not a fan of the bread. It's a little on the heavy side and you definitely need to eat this quickly as the bread will get soggy fast. \n\nTo sum it up: interesting lunch option, warm, spicy, heavy.", "author": "Tammy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "The bunny chow and the roti are most delicious.\nTo make things even better, the price point is hard to beat", "author": "Francis B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-28", "description": "Doesnt keep track of who ordered first. I am waiting for the last 20 min seeing people who were in the line after me take the food. What the hell!!", "author": "Aakash T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "Amawele surely cooks up some great smelling South African, spiced-up foods from their kitchen!\n\nFrikadella - Warmly served out smothered with creamy, spicy orange sauce and packed with grounded beef that were stuffed with grilled onions and fries, in a sandwich bun, this was mouth-watering delicious!\n\nCape Malay Rice Bobotie - Their minced beef, mixed vegetables, a toss of raisins and well seasoned and spiced up rice, is so heartwarmingly fulfilling.  I believe the smell of this dish that is cooking, is what lures customers, such as myself, during the lunch hunt, to come here!  I love this entree the most!\n\nBunny Chow - I ordered it up as chicken for the meat option.  The concept is like clam chowder, but curry chowder!  The chicken curry was stuffed in a hollow bread bowl and the curry sauce was good.  I would avoid this dish for lunch, personally, because curry gives me food coma and I am super unproductive when that happens!  I do recommend to go early for lunch, to get this dish because they sell out quickly and don't restock!\n\nTheir entrees are reasonably priced about $10.  The owners are the chefs as well!  They are super friendly and personable!\n\nThe smell of spices that this kitchen exudes, is undeniable!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "Delicious, flavorful, and interesting dishes. My favorites are the pot pies!!!, Cape Malay Rice w bobotie, and the Durban Roti. Excellent slightly hidden lunch spot.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-24", "description": "The choices are good.    But they have serious consistency issues sometimes.   Last time I got the bunny chow , the curry was so salty i could barely eat half.    Had to throw the remaining.   Would have taken it back, if I wasn't already back at my office. The other time the taste was completely off - way too much of some spice.     They need to seriously taste their food and mix the curries thoroughly before they serve.   Plus the curries are already pre-made and sits there.   It takes them forever to just pack them.   Just scoop and pack.   I just sometimes decide to go elsewhere just because of the wait, even if no one is in the line.", "author": "Tony P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "Nom nom nom! Inexpensive, incredibly filling lunch!! I tried the roti Wrap and the bunny chow. Both were delicious and perfect for cold SF fall days. \n\nSuper flavorful! One of my go tos when I'm in the mood for something... curry-ish", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-14", "description": "I had the lemon herb chicken paleo style.  Sliced chicken breast over broccoli and carrots covered in a sharp lemon and herb sauce, with some pickled beets.  The whole thing was microwaved to heat it up, which dried out the chicken and made a watery mess of the vegetables.  The overwhelming flavor was acid.  Not yummy, threw half of it away.  Sadness.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-28", "description": "As Prissy could have said to Miss Scarlett as Melanie writhed in labor, \"I don't know nothin' 'bout South African cuisine\", but frankly, my dear, I like what I had. To my unsophisticated taste buds, it tastes a bit Indian, a bit Moroccan, and probably a bit East African judging by the rich stew-like consistency in some of the dishes. A pair of enterprising twin sisters, Pamela and Wendy Michaelson, have decided to share the recipes of their mother Nadia Drew to create dishes one can assume could be found in a cafe in Cape Town or Joburg (photo: http://bit.ly/15LVAfQ). It's a modest operation nearly hidden away in the Rincon Center and just open for lunch until 3PM, but it's worth seeking out for its authentically eclectic menu (photo: http://bit.ly/10oME1k).\n\nThe challenge, at least in their first few weeks of operation, was that they started running out of several of their specialty dishes as early as noon. I was there around 1PM and found that they only had the $7.50 Durban Chicken Curry Wrap left. No worries, as  I thought it was truly abundant and savory-good with huge shards of spicy stewed chicken curry with tumeric and cumin, potatoes, carrots and other vegetables, all of it wrapped in a thick pita-like bread that had been grilled (photo: http://bit.ly/11RxH5s). It was quite different than its Mediterranean cousin and certainly filling for the price. I just ate it in the food court and needed a fork to take in all its home-cooking goodness. It definitely motivated me to come back and try some of the other appetizing dishes I saw in their display case (photo: http://bit.ly/12umwi0).\n\nFOOD - 4 stars...uniquely savory and hearty fare...South African could be the next foodie magnet\nAMBIANCE - 2.5 stars...just a food court operation, nothing fancy here\nSERVICE - 3.5 stars...very charming but oh so hectic during the peak of the lunch hour\nTOTAL - 4 stars...South African fare provides the real rainbow connection", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "I love the friendly service here the most - and if you're feeling a good spicy lunch, this is a good spot to try. I usually have the Frickadella roll that comes with meat and fries with their spicy sauce inside a bread roll. The last time I came, I forgot to ask for mild so it was too overly spicy that I had to eat it with yogurt to help calm the spicy. The Bunny Chow is also quite spicy with a block of bread and chicken and spicy sauce. Will return and not forget to ask for less spicy :)", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "By far the best food option in Rincon Center food court to date!  Tucked in the far corner, you could easily miss this new addition if you're not aware of its existence.  It feels less like fast food and more like eating from a mom & pop stand.  I know they're relatively new, but I'd love to see some South African drinks and desserts offered.\n\nVetkoek & Ground Beef Curry: Probably my favorite dish on the menu; I mean it literally translates to \"fat cake\"!  It's basically a savory doughnut (no sugar at all) sliced halfway and stuffed with a generous helping of runny ground beef curry.  The fried dough does a brilliant job of soaking up the curry, especially the bottom-center portion of each vetkoek.\n\nChicken Bunny Chow: A thick block of white bread, about a quarter of a loaf, hollowed out and filled with a sultry chicken and potato curry.  Served with a side of tangy marinated carrot shavings which helped cut the richness of the curry.  Apparently it is a pretty authentic South African specialty, originated by Indian immigrants.  It was definitely very filling, I had to take some back to the office for an afternoon snack.\n\nDurban Chicken Curry Roti: Essentially the same chicken/potato/carrot filling as in the bunny chow, expect with a few strands of lettuce.  The roti was thick, more like a Caribbean roti than an India roti.  It held the curry pretty well, despite the filling being so saucy.  Seemed a little skimpy on the chicken though, but other than that, it was totally delicious.\n\nCape Malay Rice: Another permutation of the chicken curry, this time mixed in with rice and tons of vegetables.  Feels like one of the healthier menu options, but that doesn't mean it skimps on taste.  I'd even say this rice dish is tastier than Pakistani biryani since it has so much flavor (especially if you ask for spicy)!\n\nFrikadella Slap Chip Roll: Apparently it's the Danish version of a meatball; the grilled meat pucks totally reminded me of a Middle Eastern kofta kebab though.  Minced meat with tons of veggies and spices.  Served in a medium sized hoagie roll slathered in a very tasty creamy and spicy sauce.  I really liked the concept of adding French fries to the sandwich, but I was disappointed that they were so limp... but according to a South African friend of mine, they're supposed to be so at least they're authentic.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "I absolutely love this place. One of my favorite places to go for lunch near the financial district. If you haven't been here before, I highly recommend ordering the Chicken Bunny Chow (South African curry bread bowl with chicken, potatoes, and carrots). The chicken roti wrap is great too, if you want something smaller. Most of the dishes are a little bit spicy, so be ready for a kick!   \n\nThis restaurant is located in a food court with several other restaurants that are only open during business hours Mon-Fri. I only wish they were open in the evening too!", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-21", "description": "I am always excited to try new cuisines so it should be no surprise that I jumped at the opportunity to try South African food for the first time. I was pleasantly surprised at how close it was to my work but it was certainly a challenge to find it, its tucked in the corner on the same side as Soma Chicken. \n\nAs I glanced over the menu, I found myself to be quite indecisive. Finally, after much pondering, I decided to get the Durban Chicken Curry Rotti. \n\n-Highlights-\n\nPortions were filling \nChicken was moist\nHeat level had a kick, curry flavor assertive \nNaan was sensational, definitely sweeter than I was used to but paired quite well with the heat of the curry\nThey serve many Paleo friendly dishes \n\nSide note, they serve water that's sweetened with something, I loved it and would glad go back for more of that. Also, the spicy chicken paleo entrée is spicy so beware, they don't shy away from the heat. \n\nOverall Thoughts\n\nI will be back again to try all the other wonderful things they have to offer", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Are you tired of the same old, bland lunch options in the Financial District?  If so, then do yourself a favor and try this place.  It's so nice to actually have a high quality and unique option in the area.  Usually, the food in the Fi-Di is crap or extremely overpriced.  Amawele's is the exception to the rule.  Not to mention there are choices that are both healthy and delectable at the same time.\n\nA word of caution - the food has bold flavors and is heavy on the spices.  You will probably smell this place before you see it.  If you are the type of person that thinks Chipotle is not insipid, boring, and dismal then you may be overwhelmed by this type of ethnic food.", "author": "Erik G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-04", "description": "I love all kinds of spicy food, of all cuisines and I have for a long time. However the peri peri chicken is way too much, it is a struggle to eat it. \n\nIf you go early, the wait is kinda long for a lunch take out place.", "author": "Janet B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "I've been here many times, and I usually get the Bunny Chow or the Frikadella Slap Chip Roll. \n\nBunny Chow (4/5) - Huge portion. Sometimes it takes me 3 meals to finish. Lots of curry in a large block of bread.\n\nFrikadella Slap Chip Roll (4/5) - Nice, spicy, drippy, mess of a sandwich. Really tasty, but I have had a couple instances where it was just wayyyy too spicy that it made me tear up.", "author": "Cynthia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-10", "description": "So spicy!\n\nFood was inexpensive with large portions. Served hot and with a smile. I don't have much of a frame of reference for this cuisine, but it's clear that the heat was not to cover a lack of flavor. The food was rich, heavy, and flavorful. I couldn't hang with the heat and dumped it, but that's on me not them. Everything on the menu seems to be pretty spicy so I can't really rate them super high even though they seem like a quality spot for grub (if you like spicy food). \n\nThe food reminded me of Ethiopian and Indian food in basic texture, but with heavy meat and potato influence from so much English influence.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-22", "description": "Reminds me a lot of Ethiopian food in terms of the curry and spices. \n\nThe durban wrap was very good, although a tad carb heavy. \nMashed potato with butter was absolutely delicious, and sinful since there was a very generous serving of butter in there.\n\nChicken curry and lima bean curry were both decent.", "author": "Christina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-03", "description": "Came across this spot during my lunch hour and got the frickadella wrap (vegetarian style which swapped the beef meatballs with butterbean curry). If you like spice, savory bold flavors, and good bread in your sandwich, I think you won't be disappointed! Price was $9 and most items in their menu were around there. Pricey for a sandwich in general, but what can you expect for lunch in Soma San Francisco too?", "author": "Valerie F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-06", "description": "I was really excited to try some South African food because I'd never even heard of it, but sadly I was very disappointed! I'm a pretty big fan of Ethiopian food and one of my friends had told me they were quite similar, but I would definitely disagree. \n\nI tried their vegetarian version of the Cape Malay Rice and it was pretty bland. There were a lot of pieces of cardamom which made the rice taste very bitter. The beans had very little flavor and altogether, I would not recommend this dish. \n\nOne redeeming quality was that the staff was super friendly and helpful in making the decision for what to get. They have a variety of items on their menu so I won't give up just yet. I'll be back again to try something different that'll hopefully change my opinion of this place.", "author": "Malika R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "Came here during lunchtime because of the great reviews. It was pretty busy but they were getting the orders out relatively fast. I decided to get the bunny chicken chow and it was very rich, flavorful and delicious! This was my first time trying South African food and they did not disappoint. \n\nI took off a star because I felt that there was too much curry. By the end of the meal it got too salty with not enough bread to go with it. It is also a big portion and since the dish is so flavorful, I found myself feeling sick of it about 3/4th of the way through. Be sure to pace yourself if you're not used to food as rich as this. Other than that I had a great experience and will definitely be back!", "author": "Jasmine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "First time trying South African food. Took ya'll's advice and went for the bunny chow. Split it with one of my girls (wise decision). It's basically curry (heavy on the spices) on a huge brick toast. VERY carb-y. I would say get the beef bunny chow. \n\nMy only complaint is the water seemed kind of dirty or perhaps had too much lemon squeezed into it. It had a metallicy flavor to it. But otherwise, bunny chow was SOLID.", "author": "Jo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-19", "description": "Eyes red, tears streaming and nose dribbling-call me a p*$$y but I couldn't even finish an eighth of my bunny chow.  I had four of my colleagues try it and they weren't able to take more than a bite!  It definitely packs in some flavor in addition to the heat though; I'll give it that.\n\nI really do want to like this place since it seems like the most interesting lunch spot in a district saturated with $15 salads and sandwiches.  Perhaps I'll give a different dish a shot.", "author": "Jenny Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "For lunch it's pricy at $10-$12 per item but as son as the good came out realized the portions are huge.\nHad paleo peri peri chicken which was ok but need carbs to soak up the spicy sauce.\nThe bunny curry which is actually beef or chicken and very filling.\nLocate inside the food court.\nI was hoping for some ostriches it was very popular in cape town and Dam good but not available here.. Anyone know where I can get some ostrich meat?\n\nValue 3.5/5\nAtmosphere 2/5\nService 3/5\nQuality 4/5\n\n12.5/20", "author": "Nina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Hidden gem! Rich and flavorful.  I had the Paleo chicken curry dish. They have large portions that are actually filled with food of substance (i.e. Large chunks or chicken and fresh vegetables). I'll def be back!", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-04", "description": "My friend recommended me to try this place last weekend so I headed over here for lunch smack dab in the middle of lunch hour. I get there and there's a long queue of people waiting for their food. I initially thought that was a good sign so I lined up immediately. \n\nI wanted to try one of those paleo meals but the the cashier guy had to talk, excuse me, holler, at the food preparation ladies on whether they had any paleo bowls left. I think he got an answer of 10 mins or they are out of it.  So I asked him to ask again and then he was told that they are out of it. So I ordered a chicken wrap instead.\n\nThe wait to get my food was about 20 minutes which makes me think that the two ladies that I saw buzzing around earlier, were the only two kitchen staff! Seriously?!  My other coworkers went to Yank Sing and got their food in 5 mins and by the time I joined them, they already finished their lunch.  My wrap was then given me stuffed into a very small plastic container with a thin small piece of foil enveloping it. The wrap was actually not bad, curry was legit and moderate spicy in spice level. I don't remember asking for any spiciness in my wrap!\n\nI don't want to be a downer on this place as it seems like a solid small lunch business with what appears to be a fairly well earned reputation. But wait times, running out of product during lunch, and lack of information on the menu are things that can potentially undercut their business in the competitive Rincon center environment. A paper menu for customers to order off containing lists of ingredients in dishes can go a long way to educate new customers. And if it takes you a long time to turn food out quickly, then make sure to notify your customers so we don't have false expectations. \n\nI'm not saying that I won't come back because the food wasn't horrible but I can't sacrifice my time and dollars to a place that can't meet the standards of its neighboring eateries.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-16", "description": "Seriously good flavors with cardamon, star anise and hot chilies!  My mouth was on fire for 20 minutes but it was all good.\n\nI don't think I've ever had South African food before.  The spices are similar to Indian food.  But it doesn't leave you running for the bathroom.\n\nA lot of love is put into their food.  And the quantities are huge.  I had spicy beef with rice.  I ate half and was totally full.\n\nLovely place to go when you need to feel taken care of and are craving an almost-home-cooked meal.\n\nOne thing:  I recently heard from a vendor in the Rincon center that Amawele's doesn't have a kitchen.  So they microwave all of their food.  Bummer to hear. If you aren't anti-microwaves, come here for a tasty meal!", "author": "AnneMarie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "It's a mix of Zulu, Indian Curry, English and Dutch cuisines. \n\nOrdered Bunny Chow, a dish resembling beef stew made of chicken curry, potatoes, carrots and African spices. 3.5 stars. Nice flavor, but gets tiring after a while and really heavy. $9 range\n\nFrikadella - stuffed meatballs w vinegar dipped French fries in a delish orange sauce. Def a nice sharable sandwich w/unique flavors.\n\nShould have gotten the minced meat rice. That looked great too.\n\nI'd come back.", "author": "Chuck N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "Occasionally the highlight of my day is coming here and sweating profusely as I devour the amazing bunny chow or beef pies.\n\nI'm not kidding, you will sweat. Bring a towel.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "My go to's are the Peri Peri Paleo (HOT!!!) and the Chicken Bunny Chow, but I haven't had anything on the menu that I didn't like.", "author": "Tahir P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "Great food all around. Try the paleo chicken with lemon sauce. Good iced tea too.\n\nOnly issue is the wait for the food. Sometimes it can be up to 15 minutes after ordering.", "author": "Alberto R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-24", "description": "I ordered the Cafe Malay Bobotie with organic quinoa topped with sour cream and was not disappointed! There were unique spices (including cinnamon and star anise), spicy ground beef, veggies, and raisins in my bowl. It was topped with sour cream. It was like a party in my mouth! Best of all, it was gluten free (and it taste good!!)! The portion was pretty big and I ended up only eating half. While you wait in line to get your food, they have a fruity punchy water that you can help yourself to. You can also get some chili sauce to add an extra kick to the bowl. I will come back again and try other dishes!", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-14", "description": "This review is for mainly the chicken curry and the \"plain rice\" -- Catered\n\nNot sure if this was a one off occurrence, but the chicken curry had WAY too much spices.  I'm not saying it was spicy since I'm a big fan of spicy foods, but the spices are just too overwhelming where you can't really taste the curry or chicken.  The plain rice also seemed to have spices in it as well or could be that my taste buds could not longer distinguished any different flavors.\n\nDidn't try the durban, but people seem to like it (+1 star).  The other dish that was catered was the lima bean curry, which I also didn't try was hardly touched.", "author": "G M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "Gave me uncooked chicken. \n\nHad to wait for 20 minutes after my order. Not sure if they just took out the frozen chicken and had to cook it. My stomach is still bloated and very uncomfortable.", "author": "Srinivas N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "So good, so good, so good. (and really different too). We got there around 12:10 on a Wednesday and the line was long...we waited maybe 12 minutes to order, and our food took another 7-ish.\n\nMy bf bought the $15 Groupon deal) and gave it to me so I could eat here with a pal from work.\n\nI understand why they have the bowls of sample entrees displayed so you can get an idea of what you will be ordering (becasue honestly I have never heard of one of the items offered before), but honestly the \"sample bowls\" don't look nearly as appetizing as the live food when you get it - or for how delicious it is. So they are kinda doing themselves a dis-service by the samplys looking kinda un-appetizing (but again I get it, the line would be 45 minutes long if they had to explain everything to everybody before they ordered.\n\nI got the fried bread with meat curry - Viet____(something) The display only has one (qty) featured, actually came with two pieces. I will admit that fried bread with meat curry might only sound appetizing to my ear, but I do love that word \"Fried\" (\"F\" words are often my favorite: Free, Food, Fried, F-ck)\n\nMy order consisted of 2 light sweet fried bread balls - not really greasy, (bigger than a golf ball, smaller than an orange), filled with a slightly spicy and cinnamon-y ground beef curry. I cannot say I have ever had anything quite like it before, but it was very enjoyable and an agreeable portion for a gal who has to go back to the office and churn out some productivity (rather than a nap) in the afternoon. \n\nThis is a Groupon spot I actually WILL re-visit.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Had the curry roti wrap.  Very tasty and I will definitely go back for another.  Service was good and fast.", "author": "Steven L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-17", "description": "Great food.  I had the peri peri paleo.  The pickled beets were fantastic.  The chicken was good and flavorful.  But it was too spicy.  Let me explain.\n\nI usually love spicy food, but this was incredibly spicy.  Not the \"ooh, that's a spicy meat-a-ball!\" kind of spicy where it enhances the flavor and awakens the senses.  More like the kind of spice that starts off mild, so you don't even really notice it that much, but then it builds and lingers on your tongue and won't go away no matter how much water you drink and how many pickled beets you eat and then you're just sitting there sweating and breathing with your mouth open and not enjoying your meal anymore.  Maybe I'm just a mzunga, but the spice was intense enough to actually take away from the flavor and enjoyment of the meal.  Hence three stars instead of the four I would have preferred to give.", "author": "William N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-10", "description": "Decided to try a new spot for lunch and saw that Amawele had high reviews. Located in the west corner of the food court at One Rincon, Amawele didn't have a very long line when I went there for lunch. The staff was nice enough, but the guy behind the register seemed a little rushed and not very attentive. \n\nThey have a few paleo/primal/gluten-free options on the menu, and my order took about 10 mins to come out. I got the lemon & herb chicken over vegetables, which was flavorful, but I thought the chicken was a little dry. The portion size was huge and I had plenty leftover, although it wasn't very appealing the next day.\n\nOverall, I probably wouldn't return with so many other good options around the area.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-10", "description": "Wow sooo good.  Don't let the food court location bother you, just go!  \n\nSlap chip roll -- spicy, meaty, vinegar-y goodness.  A fork and knifer sandwich for sure, maybe not best for suit and tie days.  Bunny Chow -- excellent, was our kids favorite.  Its kinda like soup in a bead bowl, but with a chicken stew, almost like a jerk chicken, instead of soup.  Quinoa veggie style -- light and flavorful.  Bobotie -- meat, rice and veggies in a single dish, seems like South African comfort food.  \n\nWish they were open for dinner...this place is too good to be in a food court.!  \nLarge portions, you likely will have enough for the next day.", "author": "Joe P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-14", "description": "Had the \"paleo\" sweet potato curry chicken - looks like a safe choice but is actually extremely spicy. Are sweet potatoes paleo...? Not that it matters - the dish itself was very flavorful.\n\nTry the pineapple flavored water!", "author": "Linda X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "This place is unbelievable.\n\nMy boss mentioned one day that this place had opened in Rincon Center and that it looked tasty. A week later, I looked at the pasta I had made for lunch and promptly abandoned it and headed across the street for some South African food.\n\nAmawele's is located a little south of the corner of Spear and Mission, and you really can't miss it if you head in the first door on the Spear Street side. There you'll find a small booth with a glass display and a chalkboard menu. There's sandwiches and stew-like dishes, but I was drawn to the meat pies. I went right when they opened, so I had to wait a little for my meat pie, but I didn't mind.\n\nMy meat pie was of the bobotie variety, which is a ground beef sweetened with small chunks of fruit and is really pretty spicy. The pie was perfectly flaky and soft, and the bobotie was unbelievably flavorful. I'm drooling as I'm thinking about it. It doesn't like that it could fill you up, but this meat pie is definitely chock full of flavor and fills your stomach perfectly. Just keep a glass of water handy.\n\nIt's definitely more of a take out place, but Rincon Center provides some seating if you need it. Go to Amawele's. Try everything on the menu. You will not regret it.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "The FiDi lacks just about everything of culture and substance. \n\nAmawale's chicken durban roti breaks up my day like a perfect lunch session. Spicy, piping hot and delicious bread all wrapped up like a perfectly swaddled baby. \n\nThis South African kitchen is a semi hidden gem in the financial district. \n\nTheir homemade hot sauce is the perfect amount of heat and is a great addition to the tangy spicy curry flavor that adorns the chicken roti. \n\nAmawalessential.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "Frikadella! Frikadella! Frikadella!\nI have no idea what that means, but it must be something like \"spicy droplets of perfection\". It's spicy, it's delicious, and it's flavorful. And for $9ish (+tax), it can be yours! Delicious beef stuffed with grilled onions and fries, all covered in a spicy orange zesty sauce.\nTake that first bite, your taste buds will be kicking and jumping around in excitement.\nTake another bite, your saliva will be drooling everywhere. Your friends will look at you weird and awkwardly.\nToo spicy for you? No worries, they have free cups of fruity-punchy-water that can cleanse your palate.", "author": "Xin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-05", "description": "It's hidden gem in Rincon.  At first glance, it may not look like much at all, but the food is great.  Service was super nice, and very helpful to me when I wasn't sure what to order.\n\nI got the Chicken Curry Wrap, and the roti has a sweetness that blended well with the mild spiciness of the curry.  It looked pretty heavy, but was surprisingly not THAT heavy.  Perfect for a good meal and affordable lunch in FiDi", "author": "Andy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "Love you down.\n\nPlaying in the background: https://www.youtube.com/watch?v=q96o9AvJO0M\n\nDevoured in the foreground: Rich and spicy wrap filled with chicken and bean dairy free curry on the first visit. Brilliantly flavored chicken and beets on the second visit.\n\nHad to return because the menu was so appealing one time wasn't enough. Loved both the food and the friendly and enthusiastic staff.\n\nEverything is priced at a more than reasonable $8 - 10 considering the portions are big enough to split into two meals. Taste will make that very hard to do.\n\nPlenty of drinks are available but you really shouldn't miss the free flavored water. Would almost return a third time just to have more.\n\nLoved it all.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "If you're looking for authentic Durban curry and other South African food, you will not be disappointed by their large affordable priced meals. As a South African, their bunny chow is some of the best I've had.", "author": "Gary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "I used the Whirl app (www.getwhirl.com) and got two free meals nice lunch place over all :)\n\nFor someone with dietary restrictions (I'm celiac) this place is perfect for something with variety. The staff is really from South Africa and they make the food fresh everyday. For something on the sweet side I get the sweet potato curry and highly recommend the lemon and herb as well. Their wraps sell out some days so get there before or during the lunch rush (12-1pm)", "author": "Iman P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-01", "description": "It's tucked in the corner of the food court (entrance at the corner of Mission and Howard).\n\nCould not digest the chili (oil?) used in the malay rice. Wouldn't come back...\n\nNice people running the little area. Food seems authentic (but I wouldn't know).", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "This is my favorite lunch spot right now! IT'S AMAZING!! I get the Bunny Chow, which ends up being about 3 pounds of food for $9, which is great. I've never had this type of curry before, but I like it. I'd have to describe it as like an indian curry, but slightly more sour and less creamy. It comes with a generous piece of this wonderful fluffy bread that you can use to scoop curry goodness into your face :-P} Additionally, they offer a delicious orange-colored hot sauce that you can use to kick it up even higher if you want.", "author": "Justin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Still can't finish a meal here!!!! Sooooo good, soooo big portions.  Tried a new tea today, rooibos iced tea..... I feel good, nanananananana", "author": "Chad C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-04", "description": "I tried the Vegetarian Malay Rice and it was too salty. Overall the meal was just ok. The meal tasted just like indian chole rice and nothing exceptional/different about it. So will not be visiting again just to eat an indian look alike meal!", "author": "MK S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-02", "description": "South African inspired food is hard to find, and this place is good & has bunny chow, which I always wanted to try -- it's a 1/4 loaf of sandwich bread carved into bowl with curry in it.  I think it's eaten with your hands originally, but I ended up using a fork and then broke off some pieces that you can munch on.   I tried the chicken version.\n\nI went back and had the Cape Malay rice bobotie style (ground beef). This was great. It's spicy but has sweetness from raisins to balance it.\n\nI encouraged my friend who grew up in Durban, South Africa, to go, and he said it's good too.\n\nService can be slow if they are still catching up in the kitchen, but it depends on what you order. If you're in a hurry, you may want to ask.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-13", "description": "I tried their Peri Peri chicken on a bed of quinoa. I usually hate quinoa but topped with the kitchen and their special (actually spicy!) hot sauce, it was a good, protein filled pairing. \n\nThe line gets long fast so try to get their early, although their service is also really fast so you won't wait as long as you think.", "author": "Analisa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "Amawele's is my absolute favorite restaurant in San Francisco, and that says a lot! Their beef bunny chows, roti's, frikadelles, and mostly their chicken and mushroom pies are simply amazing and have me hooked. \nAs a repeat customer, I am highly impressed with their consistency and their hospitality. South African food is delicious and is such great quality, and they do a fantastic job at presenting authenticity. Be sure to try their rooibos iced tea.", "author": "Keagan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-16", "description": "Super friendly cashier. Didn't know what to expect but the bunny chow is pretty cool. Definitely strong on the spices and kinda of spicy. Could use more balance..so not something I can eat everyday, but I enjoyed trying a different cuisine.", "author": "Howe L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "Yumm! I tried the chicken bunny chow ($9 + tax) and instantly fell in love! The curry has such great blend of flavour and tasted distinct from any other type of curry or curry-like dishes. Not to mention, it has a nice kick. It comes with a thick slab of bread that is smothered is a generous amount of chicken and potato curry and is served with a side of picked carrots. This dish is soo comforting-- there is just something about soaking bread in warm, hearty and filling stew/curry that just warms up the soul. And the portion size is very generous-- I was full after eating 3/4 of the dish. The only two downside I can think of is that the food is pretty heavy and is maybe a bit more on the expensive side. But overall, this is a lovely place that serves delicious food and I would be more than happy to come back again to try their other dishes.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "You don't often expect to be wowed from restaurants located in food courts, but this is one of the rare exceptions. I absolutely love their food. I usually get the bunny chow, chicken Durban wrap, or frikadella (sandwich or wrap). All of these options are delicious, but the frikadella is a bit heavy for lunch. They have a really good spicy vinegary hot sauce that they make in house, I'm always sure to slather it on everything. I'd suggest getting her before 12:30 as they often do run out of the most popular items.", "author": "Nicole T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-28", "description": "What I got: The Chicken Bunny Chow\nWhat I thought: Delicious. The food took about 8 minutes from ordering to having it in my hand. A perfect blend of spicy and flavorful. I added their red sauce to about half of my bites and that kicked the heat up an extra notch but while adding just as much flavor. But the time I finished the whole thing I had worked up a little forehead sweat and was stuffed. For less than $10 it was a ton of food, full of flavor, and something you're not going to find on every other block in the city.\nWould I do it again: I will defiantly be back to try some of their other dishes... or just keep on eating the Bunny Chow.", "author": "Derek B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "I took my first trip to South Africa last month. I was as far from home as possible, and yet I knew exactly what to eat, because I'd already had everything on the menu at Amawele's.\n\nUnique, complex, and intensely flavorful, this lunch spot stands out among a sea of FiDi sandwich-and-salad sameness.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "Them ladies know how to make killer African food. I walked in there a boy and after I ate their food I walked out a man.", "author": "Sr. Misha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "BUNNY CHOW, BUNNY CHOW, BUN-NEE CH-OOOOOOOW!\n\nBest dish to get here. The Bunny Chow is not as spicy as it has been in the past (which is a crying shame), but still! Delicious, spicy curry in an Acme bread bowl? Yes, please. Grab some Peri Peri sauce, so you can kick the meal back up to the hot heat it should have. Other great offerings are the Durban Curry Roti Wraps, Frikadella Slap Chip Roll, and Cape Malay Quinoa, which can be made with or without meat. Prices run no lower than $7, and no higher than $13 (including tax). Grab some of the free rooibos apple tea while you wait for your order. \n\nPro tip: get to the counter before noon strikes so you can chat with the cute and friendly cashier and get your order in before the hungry hoards descend!", "author": "Dominique F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "If you need an afternoon nap with a satisfied grin on your face, hit the Bunny Chow.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "I stopped by here on lunch looking for something new.  I really enjoyed the Sweet Potato Chicken Curry on vegetables with pickled beets off of their paleo menu.  I was impressed with the healthy portion size and the delicious taste of the curry.  The pickled beets on the side added good contrast to the dish.  I will definitely go back again to try another one of these healthy paleo options.", "author": "Branden W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "Yelpers :STOP COMPLAINING ABOUT THE LINE! \n\nGreat food takes time and brings everyone from the neighborhood here. That previous 2 star review comes straight from the heights of yelp stupidity: \"two stars because I waited in line.\" As diners, we CHOOSE whether or not we want to wait on line. If you CHOOSE to go out in the rain, don't write Mother Nature a 2 star review because you got wet.\n\nAnd while you're at it, don't write bad reviews based on a single sitting. That's the height douchebaggery. \n\nThe folks that run this place work their fingers to the bone to deliver us food that is unique, delicious and authentic. And they succeed 99 times out of 100.", "author": "Conrad F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "I highly recommend this casual dining place in FiDi area of SF for lunch. It is delicious. Each time I come here I order the (Chicken) Bunny Chow. Other reviewers have already noted what that is. I tell myself I will try something different every time, yet, I don't. I order the Bunny Chow.\n\nI wish to see this place succeed as the food is that good. \n\nOh, did I mention that the Bunny Chow is like $8 and the portion size is equivalent to 2 meals for a total of 5 lbs? It feels that way and I eat it in one sitting. I can't help myself. I always wish I left some behind both because I want to eat more later and because eating that much at once is bad for me. Calories be damned!\n\nGive this place a shot and tell me if you feel this review is unfair.", "author": "Howard Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "I keep forgetting about this place. If you like true spicy food (not European spicy!) this place hits the spot. We found it when it was a holiday weekend and nothing was open but we wanted to avoid the tourists at the ferry building. Oh man that spicy rice hit the spot. It was so filling and so darn good. I need to go again. \n\nIn this Rincon area where the establishments make \"good enough\" food the the no-time-to-cook office crowd this place is a gem!\n\nAs mentioned the ladies are very nice too.", "author": "Emm C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "MY FAVORITE PLACE in Rincon center!!!! Bunny chow and Frikadella wrap are both amazing. I would recommend to get the beef chow instead of chicken. Super spicy, and the service is really good too. You may have to wait in line during lunch hours, but it doesnt take that long and it is worth it!", "author": "Heidi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "I've NEVER had such a delicious and authentic meal, made with a combination of magical ingredients and then some extra Love. The friendly gent at the register told me so.\n\nSuper friendly staff, delicious food, can't go wrong!", "author": "D L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-18", "description": "As a South African I was delighted to hear that there was a place offering South African food just a few blocks from my office...and I wasn't disappointed! \n\nI went for their vegetarian Durban Curry Roti wraps and it was absolutely delicious! Bursting with flavor with just the right amount of spice. A sizable portion at a good price too. \n\nI can't wait to go back to try the Bunny Chow and Frikadella...\n\nJust a pity they are stuck away in a dark corner in the Rincon center where most people won't see them. Definitely worth looking for!", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "In a city full of diverse cuisine Amawele's stands out as truly unique.  It's a lunch spot and the lines can get long but it is worth the wait.  The food isn't spicy but they use a variety of spices and the flavors are very distinct.  The dishes I like the best are bunny chow, durban roti wrap and cape malay rice.  The portion sizes for the bunny chow and cape malay rice are pretty generous so you can share or not.  The durban roti wrap is a great dish for newcomers.  The wrap is made of roti, very similar to South-Asian roti but a bit thicker and slightly sweet.", "author": "altaf g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "This is the gem of Rincon Center. The food is fantastic and unique. I got the meatball sandwich with vinegar fries in it and I loved every bite (it's menu name evades me at the moment).\n\nHighly recommended!", "author": "Dylan G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-17", "description": "Sadly, by the time I arrived, they were out of the chicken durban roti. I settled for the Cape Malay chicken with rice. Though it was good, filling, with lots of vegetables, the dish as a whole didn't wow me, the carrots tasted weird, and the chicken didn't taste as yummy as it could have. I really wanted to love Amawele's and didn't; perhaps I will return earlier in the day to try the roti.", "author": "Eva UnTiger S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "Located inside Rincon Center, this little food counter has great South African food.  I sampled the Bunny Chow with Chicken (a hearty stew of chicken and simple veggies over a hollowed out fresh loaf of bread), but also noticed about 10-15 other menu options that I want to try.  Don't skip the hot sauce!", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-29", "description": "I used to give my ex-girlfriend a hard time about licking her fingers (gross).  I will admit (as long as what happens on Yelp stays on Yelp) to having gone to town on my sauced-up fingers behind the closed door of my office -- and came frighteningly close to similarly hitting the run-off sauce left behind on my quickly-emptied Frikadella Slap Chip Roll wrapper.\n\nSeriously folks, Frikadella must be South African for f**king delicious.  If it is not, I shall petition the South African government to change this.  (Hopefully they will overlook the fact that South African is actually not a language.)  The Frikadella is by all accounts an amazing balance of spices and flavors, while the roll on which it comes is so good that even bites which were without much or any filling (NOTE:  these were few) were an adventurous undertaking for my taste buds all on their own.  Stand-up hot sauce for the win!  \n\nThe twins, evident owners of the joint, are super-friendly, rather adorable sorts to boot.  I'll be back to make my way through Amawele's menu posthaste.  Post.  Haste.", "author": "Christopher C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "Their roti is amazing and I love their lemon chicken.  Definitely one of the best lunch places in the area.", "author": "A T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "Everything is delicious and spicy. The bunny chow is a lot of bread and potatoes, Quinoa has more veggies. This is possibly my favorite place for lunch in the area. The only down site is that it's difficult to find because it is tucked away in the corner of the food court.", "author": "Brian T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-18", "description": "I first heard of Amawele's South African Kitchen because the owner was my Lyft driver! She had been driving to save money until the restaurant opened and we promised that we would go once it did. \n\nThat was back in December. \n\nToday Amawele catered my company's lunch and I was so excited. It is amazing! I had never had South African Cuisine and I am saddened and disappointed that I have been depriving myself of it. \n\nGo eat there. \n\nNow.", "author": "Dominique D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "This place was great, close to work. I didn't realize but it's actually in like a food court for business lunches, so there are lot's of options if you are going with a group and don't all want the same thing.", "author": "Dylan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-15", "description": "They have nothing for you if you don't like spicy.  Just sayin.  Really wish they had options for the rest of us!  My friend liked her food though, so that was good.  This also happens to be in the Rincon center, so I was able to go get some other food elsewhere.  I was kind of disappointed that I couldn't really try it.", "author": "Esther S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-07", "description": "On my heavy lunch rotation.  \n\nMy feelings about this place are as follows: if you don't rate Amawele's with 5 stars I think you're a jerk.  LIke, you're literally a bad person and I feel sad for anyone that comes in contact with you.", "author": "Luke W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-26", "description": "If you want to try some new food, I would say try this place. I was here on a wrong day may be, it took over 20 mins for a togo office lunch, generally places around financial district are know for a quick togo lunch service. There was a hair in my roti roll, but these guys were kind enough to apologize and replace it with other dish. I guess I was here on a wrong day. People seemed very nice but were super busy and were certainly taking more orders than they could complete in reasonable time.", "author": "Suyog D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "Beef bunny is sooooo good and sooo spicy!", "author": "Chizzy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-18", "description": "First off, can yelp get me more stars for this review?! This is the absolute BEST lunch option in the financial district! If you are looking for a mouth watering meal that is abundant with flavors that you cannot even begin to comprehend, then this is your place! I can't get over how good the food is, and what's even more alluring for me (and my colleagues) is value for money. The portions these twins spoil us with could not come with a better price tag -- I almost always have food leftover for later, or to take home to my guy (which he loves).\n\nNow I will say I was skeptical at first, being a South African native myself I was set on being the harshest critic - however I have to admire what Amawele's has done. All their meals are what would be considered \"street food\", which makes it perfect for lunch, but these girls have created fusions of authentic South African traditional foods and incorporated their own twist to some dishes making them authentic Amawele's dishes. \n\nI have been coming at least twice a week since they opened, and I honestly cannot say that there's something on their menu that I don't enjoy. I personally love the authentic South African dishes like the roti wraps, bunny chows and the slap chips - OMG they are so good! not your average french fry, traditionally they are meant to be limp, but boy do they burst with flavor - it's been YEARS since I've had some food with homegrown flavor, so I can't get enough... But the way that they have fused the copious cultural heritage and flavors of South African cuisine with their personal creations (Babotie Pies & Cape Malay Quinoa anyone?) is nothing short of genius!\n\nNot sure how much longer this hidden gem will stay a secret, so come early and come hungry - you WILL not be disappointed!", "author": "Simone S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-11", "description": "Great lunch spot in the Rincon Center, kind of tucked away in the back past the live piano player and ridiculous waterfall thing in the middle. Got here around 12:10, no one in line, fast service - great for a work day. I ordered the quinoa bobotie, it was fantastic! It was hotter (spicy-wise) than expected, but I liked the combination of veggies, dried fruit, and ground meat. Not too heavy. Portions are big, I saved half for another lunch. The one weird thing is the water you get from their dispenser. It has lemons floating in it, so I expected a bit of that flavor but they also seem to add straight sugar to it, and not an insignificant amount, too sweet for my tastes.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-02", "description": "I really wanted to like this place but I unfortunately could only eat a couple bites of the peri-peri chicken. The chicken was so unbelievably spicy and the pickled beets were so sour that my tongue couldn't catch a break. After a few bites, I had to ask them to put another sauce over my chicken because I physically couldn't eat it. They were kind enough to put the lemon and herb sauce over my food (free of charge) but it made the meal even worse. The spiciness became intensified with the sourness of the lemon and the whole meal became overpowering for me with sensory overload. I appreciate the love and care they put into their food but their food just didn't taste good to me. We also got the bunny chow and I didn't particularly find it as good as other reviewers have stated. It tasted like Japanese curry poured over a loaf of white bread. Not saying that that's a bad thing but I had higher expectations. The service was good and I really appreciate that they've brought a taste of South African cuisine to San Francisco but the food was REALLY not for me.", "author": "Hana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "Massive shout-out to Pamela, who catered my party with 100+ guests. The food was received with great enthusiasm, enjoyment and curiosity (what ARE these awesome hors d'oeuvres?) We absolutely loved the food, and know you dear review reader will too. As a South African American, I promise you, Amawele's food is spot-on authentic. \n\n'Course, I've had their bunny chows at the counter, and those rock as well.", "author": "Wayne D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "Oh this week lace was sooo good, very spicy, new food for me, and great portions!!  value/price = 18/10 = 1.8 this place is fantastic.  I can't wait to try the rest of the menu..", "author": "Erik V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "If you want value for your buck then this place is the way to go. For under 10 dollars you get such a huge portion that makes the rest of San Francisco look bad. I have a huge appetite and I come from the South (so we know how to eat), and even I could not finish the Bunny Chow. I doc the place one point because it wasn't absolutely perfect to me, but it was pretty darn good. I recommend this place for anyone who is starving and wants to spend less than $10.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "OMG!!! The food was soooo spicy I was perspiring during the entire lunch. I got the peri peri chicken, which is spicy chicken over a bed of vegetables and beet salad. For $10 they give you so much food, I was almost unable to finish mine. As all of my friends know, I don't give up easily and I finish everything in front of me, so this is saying how much food they give you here.\nThe chicken was great, definitely really spicy and perfectly paired with broccoli and cauliflower veg mix. I wish they would give me some rice with it.", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-02", "description": "Love this place.  It's a great spot in Rincon with a crazy assortment of Dutch, Indian English and African influenced cuisine.\n\nI had the Curry Chicken Rice, while my co-workers opted for the healthier Vegetarian Quinoa Curry Rice and a Dutch inspired French Fry Stuffed Burger thing.  All came flavorful and incredibly tasty.  You would definitely like this place if you're looking for something different in the FiDi.\n\nTry it, the two sisters who run the place are really nice!  I'm coming back for the meat pies...Can't wait...", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "I love the unique cuisine this place offers amidst the endless sandwich shops and cafes around FiDi. I got the beef Bunny Chow which is a curry/stew inside a bread bowl. The curry itself was well flavored and had a nice spicy kick to it. The bread was soft, and the pickled carrots were quite tart but went well with everything. The portion size was good and had to work on it for a while. My only complaint is that the beef chunks were fairly dry and not very tender. I'd still love to come back and try some of the other unique things on their menu.", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-18", "description": "Amazing!\n\nThis is a great addition to the Rincon offering of restaurants.  \n\nI tried the frikadella slap chip roll and it was out of control.  Very spicy!! Which is actually great as I love spice and most places do not make it hot enough.  NO extra hot sauce required on this sandwich.  The sauce is amazing and I love the tanginess the \"chips\" (french fries) add.\n\nI will definitely check out other menu items.", "author": "Rebecca B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-06", "description": "Got there during lunch rush, long line is usually good sign, so figured I'd give the african place a few of my coworkers recommended out. \n\nOrder taking time was on the slow side, when i got to the front the cashier was too busy talking to a friend to engage me. Personal pet peeve of mine, don't hold up the line to chill with your buddy. Check time from order placed to food coming out was good, props to the kitchen. \n\nGot the Lemon Herb Chicken, \nThe good: decently sized portions for the price. Veggies didn't appear to have been frozen, chicken was of good quality. Certainly different from other places in the food court. \nThe bad: Potato side was very bland. Though the spices on the chicken and veggies were interesting at first, everything was seasoned the same so after a bit it didn't feel like there was any variety in the dish. \n\nBottom line: probably will try it again for it's uniqueness compared to surrounding places but it didn't impress the first time out.", "author": "Erik H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-24", "description": "Really strange ingredient pairings make for strange flavors.  Definitely did not enjoy my meal although I did eat more than half of it.  Since I ate half I suppose 3/5 stars is fair.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "Pros - \n- Great place to get quick lunch. \n- Very flavorful food. \n\nCons - \n- I don't think the food is prepared onsite. \n- Rincon Center can get very busy during lunch, so it's hard to find seating. \n\nMy vote is for is the cape malay quinoa with beans.", "author": "Paddy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "Generous portion and friendly staff. Definitely check this place out if you want to remember the good food of South Africa. Wish they would expand their menu though! Come here for lunch.", "author": "G C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-04", "description": "Great curries!  I had the roti, which was an amazing wrap filled with a fresh saucy chicken curry.  GREAT flavors and the roti breading was really nice as well.  Today they had meat pies on display which I have no doubt are insanely good, I really wanted to take one for the walk back to the office, but that would have ruined the day.\n\nMy buddy had this meatball sandwich which was really good too, very herbal meat, super fresh and tasty with vinegar fries.  These fries are nothing like you are used to, they call them \"slop\" in Africa.  They tasted like vinegar onions and added a nice contrast to the meat.\n\nThis place is in a quiet corner of the Rincon Center, but if you use the door closest to Mission, you can't miss them.  I'm really looking forward to my next visit, great addition to the FD.", "author": "Jon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-08", "description": "Good food, good portion sizes, long wait. It took a pretty long time to get out food; I came at 12:40 and it took over 30 minutes to order and get my food, but it's really flavorful food and you get a lot for what you pay for. The bowl of quinoa I got had to be over a pound. The dish was quinoa spiced with curry and had a good mix of vegetables, broccoli, carrots, cauliflower, and some starchy one that seemed like a potato, but I wasn't quite sure.. It's a little spicy, which I really liked, but if sriracha is too spicy for you, then this might not be good to order. It was also pretty heavy(not just physically) given that it was only quinoa and veggies, so if you're looking for a light, simple lunch, this might not be the best. \n\nThe bowl had enough food for 2 meals. You could definitely eat the whole thing in one sitting, but it's just enough to make you regret finishing it. The guy at the register has a cool accent and is quite a character. He takes his time and likes to make conversation. He was convinced he'd seen my friend somewhere else and it made my friend a bit uncomfortable because he just kept staring. But other than that very friendly!", "author": "Maleenee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-30", "description": "I had a pretty nice sandwich from here.  I was a bit disappointed they had no real sides, also they were sold out of pies.  The food is a little slow here, but mine was worth the wait.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "The cape malay rice with chicken was delicious and just the right amount of spice.  I plan on going back and trying more of the menu.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-24", "description": "The place is pretty new and sort of hidden in the Rincon food court. They have a nice staff and EVERYTHING I've had so far was really good, especially the Frikadella roll and Vetkoek. I still have a couple more items to go through on the menu ( there's only like 5 items right now) but I have a feeling they won't disappoint. \n\nI will give them 5 stars.. as much as I would like to keep this place a secret, it won't be fair to give them anything less. I am a happy customer.", "author": "Don Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-07", "description": "Amawele is in the back corner of the Rincon center, opposite Yank Sing. \n\nDecent food. I ordered the Cape Malay rice with Bobotie (fruit & spicy beef). Good rice to meat ratio. The bobotie wasn't very spicy but they did have hot sauce on the side.\n\nDefinitely wouldn't crave Amawele but it's a decent lunch option if you're looking for something besides salad and sandwiches.", "author": "CL S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-02", "description": "Come here for a fun, reasonably priced, lunchtime culinary adventure in the Financial District!  I can't verify how authentic the food here is, but I will say that it is truly delicious and definitely worth a try.  The Cape Malay Quinoa with Bobotie (sweet fruity spicy ground beef) was super flavorful, snot-inducingly spicy and very satisfying.  The quinoa was also loaded with veggies like eggplant, beans, corn, peas, carrots, and cauliflower, making it possible for me to believe that the food is also good for me.  I also had a bite of the frikadella roll and that was delicious as well.\n\nDepending on how big of an appetite you have, you might even have enough for another meal.  They start running out of stuff around 1pm, but with so many great options on the menu, it shouldn't be hard to find something else to try.  Can't wait to come back!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-21", "description": "If you get here at 11:59 am, right before the 12 o'clock rush you will be fine. The food here is unique and I would definitely recommend the Frikadella as its the best sandwich to have. Its a little bit spicy but its manageable. \n\nDo not get the chicken curry wrap. Its pretty much curry chicken wrapped in a tortilla with some carrots. This wrap is not worth your time when you have the Frikadella on the menu.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-13", "description": "It was just ok.. a lot more european than I expected. Meat was rather dry.", "author": "Julie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-23", "description": "To start, they're really friendly and nice.  It's clear the food is done well and with love.  I ordered the Chicken Roti and it's a really substantial lunch.  If I were a construction worker I'd be really happy.  Everyone in our group said the portions were huge, we all tasted one another's items and everyone liked what they tasted.  \n\nMy roti felt like it weighed at least a pound and half.  It was spicy and the heat continued to build as I ate.  I left 3/4 of the roti because I simply could not eat it all. I'm sure for cold weather, this will be a lunch to warm you up and really qualify as rib-sticking food.  I'd love to come back, but, the meals all are extremely carb heavy and just heavy.  I'm sure I'd be comatose now if I'd eaten the entire roti.  I give them props for the huge portions and reasonable prices.  \n\nAnyway, I'm all for new exciting flavors and this was fitting that bill.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Thanks YELPERs,  the food was great.   Still not clear on what makes up S African cuisine, but the Chicken Bunny was delightful as raved (What is this Bunny reference?  maybe bun?)  more like a 1/4 loaf of bread.    the biggest bread bowl I ever had.   My colleague tried the Cape Malay Quinoa....  delicious!  It was hard to find at first all tucked into a corner.  If not for me LOOKING for the place I would have been easily swayed to one of the many other culinary choices.  think Mall food court but much better.", "author": "Thad L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "Had the beef bunny chow today at lunch for the first time, it was delicious! Not to mention filling.  Amaweles is a must try eatery especially if you frequent the financial district.", "author": "Jd D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-01", "description": "A co-worker of mine first tipped me off to Amawele's. She was having their Sweet Potato Curry with Beet Salad, which is super colorful and would attract anyone's eyes.\n\nIn the past week, I have gone twice for lunch. My first time, I ordered their roti Chicken Curry Wrap, which is delicious. Many reviews mention the level of spicy-ness and heat for this dish, but do not fear! It's nothing too crazy and the yumminess makes up for it. I was actually able to add a little of the house hot sauce to my wrap, which definitely took the experience to a whole new level. \n\nI then got the Sweet Potato Curry with Beet Salad. I have to say, the curry is pretty good but could definitely benefit from the house hot sauce. The beet salad is delicious. The beets are pickled which makes them delightfully tangy.\n\nAmawele's has delicious food, awesome and generous servings, and super affordable prices.", "author": "Ana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "The first time I walked by, the lines seemed long and I heard someone looking at he display case say the portions looked small. Not true. I've never waited more than five minutes for my food, and the portions have always been filling.\n\nI'm a vegan, so I just get the Durban Roti Wrap with butter beans or the Cape Malay rice or quinoa with vegetables. The degree of heat is just right, with the Cape Malay being a little spicier. I usually get the wrap because I like the sauce the beans are cooked in. I'm not as used to eating drier dishes like the Cape Malay rice, but the taste is addictive and I always finish it. The food that I have tried is probably about a 3 on the 1-5 heat scale used by some restaurants.\n\nThe staff are all very nice and work very hard to please their customers.", "author": "Brad G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-16", "description": "Had Amawele's delivered into the office from Cater2me, super delicious! Recommend trying the chicken curry with Durban wrap on the side with the mashed potatoes. Nom Nom! Vegetarian co-worker had their Lima bean curry with Duran wrap, said was tasty too. Haven't been in the actual restaurant, definitely plan to check them out.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-28", "description": "I had the chicken bunny chow and it was good.  BUT, Honestly I was disappointed with the bread.   The bunny chow is served inside a square bread bowl and it was basically a bowl of wonderbread.  Really plain, white bread.   Dish is very filling so be hungry if you order this.  Also, give yourself time - lunch time is busy so expect to wait 10 min to order and 10 more for your food.", "author": "R. G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "Went today at 12:30, the line wasn't bad,, took a while to get our order but worth the wait! Different, flavorful, tasty, spicy, yum!", "author": "Teresa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-03", "description": "A refreshing change of pace from the other derivative sheeple-feeders in the Rincon Food Court. Give it a go. But, be prepared for the peri-peri. Got a nice tang to it. Not for the faint-hearted.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "They recommended the Durban Chicken Wrap as a first-timer, which they said was one of their most popular items.   For $7.50, I received a hefty roll with lots of chicken, potatoes, curry, and pickled veggies.  The wrap was delicious and very filling...sweet roti wrapper, spicy curry (good heat, but not overly spicy), and tart pickled veggies.  It's a great balance of flavor.   It's definitely a must-order the next time I'm in the area.", "author": "Ring K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "Amawele's is the best lunch spot that i have found here.. Got here just before noon and had the bunny chow and boy did it hit the spot!! Definitely coming back to clean up the menu", "author": "Nav N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "I always get the Veggie Roti Wrap. It has butter beans, potatoes, carrot slices, and curry. It's delicious and has a good spice kick to it. The meal is very filling! I like my foods spicy so I always ask for extra of their homemade hot sauce. The gentleman who works there is always so polite and does more than just take your order. He makes my visit feel personal, and special by getting to know me. They also have free complimentary juice that they make. It's very good. Reminds me of water infused with fruit, but with more flavor.", "author": "Naomi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "I recently discovered this shop hidden in the corner of Rincon center.  What at first glance appears to be a drink stand, I soon found to be my new favorite lunchtime go-to spot!  Day one was a generous portion of the tasty Rabbit Chow.  Tasty curry in a large chunk of bread.  I followed up the taste adventure the very next day with the Frikadella Slap Chip Roll, a tasty sandwich which seems to be a South African equivalent of an \"all-in-one\".  The dutch style meatballs are well balanced with the vinegary chips, and the orange sauce completes the awesomeness!", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-15", "description": "this place is great, the owners really do their best to make the food and the experience first class.  \n\nthe portions are big but the food is healthy\n\nI go here allot for lunch.", "author": "Patrick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "The duran wraps = life-changing. Everything else is great too, but man... those wraps!", "author": "Eva G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-25", "description": "Grubbed on the chicken wrap the other day. Chicken breast cubes, lettuce and potatoes in a nondescript yellow curry sauce. The whole deal was wrapped up in a roti- not as flaky as the Indian varietals unfortunately. Overall good value in the FiDi for a quick bite but flavors were nothing to bring me back.", "author": "Anthony R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-23", "description": "Hot, spicy and tangy!! We had the Frikadella sandwich (carb heaven) and the paleo peri-peri chicken with steamed vegetables and pickled beets. My only criticism is that the chicken was dry, therefore I'd recommend dark meat or gently stewing the white meat to maintain the tenderness. I loved it all, especially on a rainy cold SF afternoon. Some may find it too tangy and spicy. Seems fairly authentic from my perspective. Inexpensive, huge portions and HOT!!", "author": "R L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "Amazing food!\n\nI attended a friend's birthday party that was catered by Amawele's. They provided burgers and some side dishes. The two sisters were awesome and grilled the best burgers I've ever had. I would recommend them to anyone!", "author": "Steven B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "I love this place so much. I could eat here every day.\n\nThe people are super nice, the hot sauce is hot, and the roti is awesome. Extra points for having vegan roti.\n\nThere can sometimes be quite a line at lunchtime, but that's typical for the area. Go early since sometimes they run out of some things.", "author": "Wade A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "Totally unique - such a hidden surprise in Rincon.  I have had the Frikadella, the Cape Malay Rice, and the Bunny Chow.  All good, but the Cape Malay is my favorite - something about that beef, veggie, and rice combo that has so much flavor.  Reasonably priced and they don't skimp on portions either.  Owners are using serving when I have been there and they are super cool nice girls.", "author": "Brian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "As part of Rincon Center, it can be easily missed for some of the other options.  It's a nice change of pace from the other lunch places.  I had the Bunny chow chicken as well as a Wednesday vegetarian pie special.  The curry in the chicken is quite spicy and tasty.  The bread was quite voluminous and soaked up a good amount of curry and helped out with the spiciness.  You have to take your time as it is quite temperature hot.  The pie crust was quite flaky and the sauce was solid with all of the roasted vegetables.  The food is more like 5 stars.  My main issue is that for being only a lunch place, the portions are a little big.  With the pervading curry scent and taste, it's not the easiest to enjoy at your work desk, and all of your co-workers know you've been here.  I think if they made a lunch portion at a lower price and kept their full size as it is, it would definitely be a step in the right direction.  The staff was nice and it's got a good location off of the Spear street entrance so I'd definitely come back to try additional food.", "author": "Jay N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "I'm multitasking while eating their food and dabbing the sweat from my forehead (its Spicy!!). My colleague recommended this place so we went to try it out. This food is absolutely delicious!!! The spices and flavors explode (literally) in your mouth!! It is how I wish my at-home cooking could be!! I must warn you it is a bit spicy. OK, its VERY spicy. I'm eating it and I have the fan blowing against my face at the same time. Any who, the cashier was very pleasant and helped me pick it a great dish. I'm in love and on fire (mouth still burning). They offer a variety of dishes including a curry chicken dish which I hear is amazing (and spicy). I decided on the Peri Peri Chicken. It looks like it was cooked in hell it it taste like heaven (just have milk, water or a fire extinguisher nearby). Check it out. I'll be making many more stops here and will definitely let my friends ho work nearby about this joint.", "author": "Jermaine J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "Favorite new lunch spot. If you like spicy food this is a place to check out. It's quickly becoming popular and the lines are getting longer but the food is worth the wait. Very filling with lots of vegetables the different dishes are all worth trying.", "author": "Ron B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "This was my first experience with South African food. I absolutely loved it! You get a ton of food for a very reasonable price. Definitely will return.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "Amawele's was my first try at South African food. I got the Vegetarian Frikka Roll and it was amazing. I loved the sauces and the flavors in it. They have small boxes of Hot Sauce, which are good as well. I'd go back here for lunch any day.", "author": "Sabareesh K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-13", "description": "I really want to like this place more because their menu offering is so different.  However, having had the vegetarian roti and the peri peri chicken on different occasions, I can't enthusiastically endorse them as I can barely taste the seasonings and food over the ridicuolous amount of salt they use.  Maybe that is traditional for S. Africa?", "author": "shannone e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-08", "description": "When I want to feel like I'm eating a home cooked meal for lunch I know where to go.  Amaweles. They truly serve home cooking from the South African kitchen.  My favorite is the lemon herb chicken. Fresh and flavorful every time. Portions fill you up and you'll have some leftover for an evening delight.", "author": "Chau N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-23", "description": "Food is delicious and the portions are super filing!  I like the South African hot sauce and I am thinking of buying a bottle.  There are paleo options now, for those interested parties.  Pot pies are also delicious, although I enjoy the vegetarian pot pie more than the chicken pot pie.", "author": "Anna L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-28", "description": "I had the Chicken Roti and it was mediocre at best.  The roti was sweet, the chicken was OK, the potatoes weren't exactly tasty. \n\nMy friend had the Paleo Chicken and it was pretty much chicken, brocolli, cauliflower, and beets (all presteamed) mixed up with hot sauce and then microwaved for 3 minutes.\n\nI've always been disappointed by Rincon 101 and this hasn't changed my opinion.", "author": "Davve B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-03", "description": "Very earnest and sincere, smiley service and interesting, unique food - just be warned it's very spicy and heavy! A nice and different lunch choice from the usual FiDi selection.", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-12", "description": "The smell of this place brought me to its counter and my choice of the paleo chicken curry with pickled beets (which is curry chicken over broccoli, carrots and cauliflower) was tasty.  Would I go again, YES.  I'm looking forward to trying other dishes on the menu that look really tasty as well.", "author": "Beverly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-06", "description": "Tucked in the far left corner of Rincon Kitchen is this delicious place. THe food is a mix of Afrikan, Indian and British cusine. I had hte butter bean roti wrap which was spicy, sweet and tangy all at once. THe food wakes up your taste buds and you can tell a lot of car and love was put into their cooking. Will def be back for lunch again soon!", "author": "Hetal S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "I also missed the Bunny Chow, since they were out. Wondered what rabbit tastes like. ;)\nAnyway, what I did have, the Frikadella Slap Chip Roll, was fantastic. Looked a bit like a gyro (or maybe a gyro looks like a Slap Chip Roll.) But it was great. A bit spicy, but not overly so. Yumm!", "author": "Herbert S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "in a fairly inconspicuous Mail building- good food, though a bit on the spicy side if you are not careful. The pineapple water was a bonus, have to try more items of the menu", "author": "Shantanu V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "Ridiculously good food and great service, plus extremely convenient if you work in the financial district. Very authentic!", "author": "Heather B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "Amazing South Africa dishes. Such nice people and genuine South African owners. I know as I have been to South Africa before and it's like visiting Cape Town again!", "author": "Helen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "Their Chicken Roti wrap is delicious!! I suggest BYOB with your food. :)", "author": "Dee N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-16", "description": "Had the peri peri chicken paleo dish and it is suuuuuper spicy! There was one person ahead of me and the wait was pretty long for being microwaved. I may give them another shot, the rice and wraps look good.", "author": "N. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-28", "description": "Love that they have Paleo options. The Peri Peri chicken is delicious and spicy, served on a bed of vegetables with a yummy beet salad. A large portion (2 meals worth for me) at a reasonable price. Will definitely go back and try other dishes.", "author": "V. R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-30", "description": "I had a chicken roti that was okay. The orange water was a nice touch.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-01", "description": "Salad was great; chicken curry was even better. Frikadillas (sp*?) are def worth trying as well", "author": "Tristan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-12", "description": "Had the chicken masala pie - because, as warned on FB, they were sold out of the bobotie pie.  Delicious and filling.  A steal with the Groupon I had, but still a great value at $6.50/pie.", "author": "B. Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "Delicious, nice to have a paleo option in FiDi that isn't a salad.  Tried the Bobtie today and looking forward to going back and trying others.", "author": "Jeff E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-18", "description": "A few coworkers and I tried Amawele's today for the first time. We meant to get there early but didn't end up getting there until around 12:30 - there was a bit of a line but we managed to get our food in about 20 minutes.  Things are pretty normally priced - about $8-$9. I got to try the Frikadella roll and the LAST bunny chow. Both were really good -  tons of flavor! The girls are also super nice, overall a win for a FiDi lunch. If I worked closer, I would definitely come here very frequently.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-29", "description": "Kinda hard to find - it's inside the one Rincon center. There are a lot of great ethnic food places in here to chose from. I ordered the chicken bunny chow. But everything on the menu looks great. A lot of people ordered the sandwiches, and those orders come out faster. My order took over 15 minutes because they gave it to someone who had ordered after me in error. The owner was very apologetic. The curry is very tasty, spicy and just a tad on the salty side. It had potatoes, onion, chicken and maybe green peppers in it. There is a red hot sauce you can eat with it on the side. I love spicy food and I liked the addition of the red sauce, but there's enough heat in the curry, you don't need it. Portion size is generous. No way I could finish it. I liked it just fine and if I lived here would order it again. Be sure to grab the free water, it's sweet and refreshing against the heat of the curry.", "author": "Shelley C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "Sinus clearing! Wow! The Piri Piri Paleo box did the trick for my cold. Pickles are awesome and help tame the heat. I only wish there were some sweet potatoes in here to temper it a bit more. Vegetables are great, but it gets a little watery at there bottom.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "This place blew my mind!!  Large portions of extremely delicious food at very good prices.  I didn't have any reference for food from South Africa going in, but I fear I am now going to have cravings way to often.  Their Bunny Chow (a chicken and potato curry in a hollowed out loaf of South African bread) is to die for!!  I can't wait to go back and have again.  I also had the Slap Chip Sandwich - a meatball patty with succulent and spicy sauces and South African \"chips\" (french fries) served on a hearty roll that I would recommend to anyone looking for a creative and kickass take on the American burger.  I can't say enough good things about Amaweles - if you like spicy food and work or live near the Embarcadero/Financial District, you have to check this place out!!!", "author": "Terence G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "I ordered the frikadella roll and it was good: spicy, soft bread, lots of flavor. It took about 15 minutes total: waiting in line, ordering and getting food.", "author": "Gee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "I'm South African and it's a little bit of home every time I go there. The owners always have a welcoming smile and keen for a quick SA chat.", "author": "Paul D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "Fantastic! Food from home!! Ten stars. To anyone who writes a bad review or can't handle spicy food. Stick to bland. Pan era and Starbucks will always be there for you.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "I was searching for a new place that serves paleo friendly dishes, and I found Amawele's on Yelp!  I was excited to try the peri-peri chicken being a lover of beets and spicy food, and it did not disappoint.  The chicken is very spicy, even by my standards, and I loved it!  Great flavor, although could be considered slightly tart due to all of the hot sauce.  The beet salad was refreshing and the veggies were a nice addition.  I gave it minus one star because the restaurant was a bit difficult to find, and the menu is not self explanatory (unless you look at the display case which does not have all of the items).  I'm also not sure if I received a 1, 1.5, or 2 sized dish...I think it must have been 2 since it is enough for 2 meals.  I would say, however, just choose anything and it is probably delicious.  I will be back soon for the sweet potato curry or the other paleo beef dish.  Looking forward to it.", "author": "Nick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "Well this was delicious.  I went on a whim and was happy I did so!  I had their slap chip and it was spicy and lovely.  My friend had the sweet potato curry thing, which was also delicious.  I will warn that they mean the spicy, but it's not just heat-actually had spices involved in the spicy!  The food court vibe is not my favorite, but this place is worth going to.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "Delicious! Got the beef and rice because everything else was sold out. It was the best surprise dish I've ever had. Didn't have a clue what it would be and it ended up just being all these new yet familiar blends of tastes and spices in my mouth. Definitely go here!!!!!! At the back left corner of the Rincon 2. Also, the workers are super nice!!", "author": "Alexander M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-09", "description": "Great option if you are on the Paleo diet.  Also good sized portions.  Service is super-slow at lunch as it seems they are understaffed.", "author": "Erik K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "Unique lunch spot with some of the best and most interesting flavors available. The Roti chicken wrap was excellent; the unlimited sauce served alongside it elevated the dish to the next level.", "author": "James H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "Great meat pies! The chicken curry one was delicious and flavorful. I agree that it's the best option in Rincon Center as well. The frikadela roll was recommended by the owner, but I actually thought the meat pie was better. Can't wait to go back!", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-18", "description": "We had company catering from this place the food was excellent . I wish they are open on weekends or a actual restaurant.  will come back for sure", "author": "icee a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "A coworker came back from Amawele's with a little pot of hot sauce that was so delicious (it had the perfect balance of vinegar, heat and spice) that I needed to go and try the food for myself.  I ordered the Frikadella wrap and it has said hot sauce, although it was tempered down into an aioli, and it was good.  In the wrap, you get two meatballs, that were ok although a little gamey, vinegar doused french fries which were delicious, a few lettuce leaves, and a generous dousing of the hot sauce aioli. The wrap itself is dense and a little sweet. First bit was pleasing but halfway through my mouth was on fire (I should let you know that I generally order mild or medium heat when eating out). The cashier was funny as he repeated my name at least half a dozen times to ensure he got the right pronunciation and the portion was decent.  Price was a little on the higher side for what you get but the hot sauce was complimentary (not that you need more of it if you order the Frikadella) as was the sweetened water.", "author": "C L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "My experience with Amawele's South African Kitchen has been one of the best in SF. If you are the type of person who enjoys the experience of an explosion of flavors in your mouth, this is definitely the place for you! They use bold spices and ingredients that honor authentic South African food, so what you are getting is for sure the real deal! If you go crazy about spicy food this is the place to go. Bunny Chow would be the way to go for having an spicy experience. For those who are taking care of their diet, the paleo meals are a great option. I personally like the chicken curry wrap, it has the perfect combination of flavors, it is not spicy and it is filling. I really like the wrap, which is called roti, NOT tortilla. Me being Hispanic, means that I know what a tortilla is and they are both very different. Roti is a traditional flat bread that complements many dishes in South African cuisine. It is usually handmade, rolled and cut into perfect circles. Amawele's roti have a some sweetness that adds an extra special touch to the chicken curry wrap. So, please do yourself a favor and go to Amaweles's South African Kitchen and have a meal experience that you will never forget!", "author": "Liri Q."}
