{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "One of my go to spots when I'm in sf. Located in the japantown plaza, it's in the center. I recommend everything they have! My favorites include their eclairs, and their soup with sandwich combo. The chicken salad is amazing!", "author": "Shaeli Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-24", "description": "For a Friday treat, one of our talent brought us some baked goods. She dropped them off on Friday, September 14th around 11:45am.\n\nLast time she brought me something from Andersen Bakery, I told her I loved the morning bun with berries. It had a nice bruleed top which made it sticky and crunchy. Very indulgent! She remembered that, so got a few similar sticky buns. Unfortunately it was salted caramel (I don't like sweet and savory together), so I didn't care for this. But it did have the same texture which I liked. My coworker who doesn't ever finish anything liked it so much, she ate the whole thing. We also got a few assorted muffins: blueberry, mango, raspberry which were standard.\n\nToo bad the sticky bun this time wasn't really my flavor. I still have fond memories of the berry morning bun from last time. Hopefully, I'll get to sample it again.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-19", "description": "Honestly, this Andersen location dropped the ball. If I could describe my visit here in two words, it'd be BAD SERVICE. \n\nI was in the area on a Saturday afternoon and decided to stop by Andersen for a quick afternoon snack. I was looking at the pastries deciding which one to order when an older lady working there interrupted me, yelled at me to hurry up and choose one since there was a \"line\" behind me. I looked behind and there was only one other customer. First of all, the customer behind me seemed like she wasn't ready to order and wasn't in a rush. Secondly, I HATE feeling rushed to order. I was confused when the worker glared at me and gave me a dirty look after she claimed that I was taking too long. I mean, I only stood there for less than a minute. This hasn't happened to me before in the past at other establishments and I found her attitude to be very rude.\n  \nEven after experiencing the bad service, I ended up ordering an almond croissant, which was wayyy too sweet for my liking. I have a sweet tooth and it was surprisingly too sweet for me. The almond filling inside the croissant was the sweetest part so I had to scrape some of it off. Not only was I was upset with the service, but I was also disappointed in the croissant.  \nAnother concern arose when I spotted a few flies flying around the pastries in the open display case. Ew, I don't want any flies or their dirty legs touching my food because that's just gross. If this establishment had their pastries in a display case, it'd be more sanitary since flies wouldn't be able to touch the food.\n\nI've been to other Andersen locations in the past and was never as disappointed as I am now. This Andersen establishment needs to step up their game and retrain their employees to mitigate the bad service. I know I won't be visiting Andersens again in the future.", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-24", "description": "Stopped her for a quick afternoon fix. Lots of pastries in the case with fresh brewed coffee. This place is tiny not incredibly clean but it did the job if you're on the move. Their stuff always tastes good.", "author": "Sanaa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-23", "description": "We had their coffee - medium roast and their Japanese souffle cheesecake. I thought it was the jiggly stuffs but they weren't. So disappointed. It was quite tough and dense. Also, their coffee was really bitter like it'd been roasted for too long. Overall, I can't believe I stopped at this place.", "author": "Rose F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "Andersen Bakery was a welcome surprise while walking around Kintetsu Mall in Japantown. It was mid-morning and we were starting to get hungry. The bread and pastry display they had looked great.\n\nAll I saw and read on their sign was kouign amann and I was sold. We ordered a blueberry kouign amann and a cream cheese french bread to hold us over until lunch. Andersen is also nice because they have a few tables inside their little sectioned off area by the cash register shielded from the passersby.  That's a plus.\n\nThe kouign amann was tasty. I really liked it. The addition of blueberry was a nice change in flavors from the buttery, sugar goodness the pastry held. I enjoyed that. The french bread with cream cheese in the middle was well liked also. They came in these little french baguettes. \n\nService was fine. Price was inexpensive. Good snack stop while cruising Japantown.", "author": "Chuck D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "I went here an early morning for breakfast. I walked right up and was helped right away! I got a mango tart parfait and an almond croissant from them and they were delicious!! I couldn't stop eating the Mango Tart Parfait! It's rich and full of fresh fruit! The almond croissant was flakey, buttery, and covered in powdered sugar! Really great food, relatively cheap, relaxing environment", "author": "Libby M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-26", "description": "Andersen Bakery is amazing! They have a wide variety of breads, pastries, cakes and sandwiches available; my friend and I were very impressed by the selection.\n\nPrices were reasonable, and the food was great. We ultimately decided on the cream cheese walnut pastry (boat*), and it was wonderful.\n\nWe were stupidly full from Good Belly Crepes, otherwise we would have definitely gotten more. I'll be back!", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "It's a bakery with a small seating area so it's always crowded. Good coffee, though. Danish is decent-- nothing exceptional. \n\nWhat I love are the pork sausage rolls. Remind me of the cheese pretzels I used to get in Germany. It's a pretzel type dough with a sausage baked on top and covered in grated cheese. What's not to love?", "author": "Tim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "I had been to the other Anderson Bakery before. Nice to meet it in Japantowm!\n\nI really like the cream cheese walnut! Everything is just right! \n\nAnd I had the strawberry cake and a coffee there. \nGood also!", "author": "Yantong Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-23", "description": "I personally love eating at Anderson's bakery. This place has an amazing abundance of bakery goods for a smaller version of Anderson's. I ordered the jalapeño cheese bread with the one of the young employees. Usually they ask you if you want the bread to be sliced or toasted. I understand that if it was busy that she didn't have time to ask, but it was just me and this other lady ordering. Which the other lady had the other employee helping her. So I paid for the bread and asked her to toast it and slice it. She looked at me for a while like o had some stain on my face and seemed quite annoyed but I didn't care lol the food needs to taste fresh at least ‍ so she finally processed my order and slammed my change and receipt on the counter. So now I have to grab all my coins one by one ‍ and she's like you can go over there and I'll call you when it's ready. Either she didn't heat up my bread or the toaster is broken because uh... it tasted cold and dry LOL the cheese melted a little bit, but yeah... two stars for the melted cheese.", "author": "Susan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-18", "description": "This bakery opens earlier than today's Yelp posting of 9 AM time.Yay!!! Lucky for us we came early. I ordered my NF chai tea latte and stayed with hubby's selection of a half loaf of cranberry & walnut wheat bread which they slice right there for you. It was quite healthy!  \n\nBy the way if you need napkins ask for it. They keep them behind the counter at the cash register. I believe they hide them back there so it doesn't get messy or for unnecessary clutteredness.\n\nSeveral ladies were there to assist us too which helped to make the line of customers go faster. Little table seating inside yet cramped. Best to sit out in the mall area even though there are no backs for you. Hubby's back was hurting so we stayed inside the tight squeezed bakery.\n\nThe lady in front of me rattled off a long complicated order. I commend the young gals serving her with much patience & kindness despite the rough exterior.\n\nI noticed they sell the Kouign Amann, bacon/sausage pastries, croissants and scones. Plus they have a separate dessert case with more tempting individual sized dessert items like fruit tarts, creme brûlée & more! Check it out for yourself! \n\nIt always packed here bc they happen to be across from Chocolate Chair who are known for their novelty nitro dessert. Because of their convenience right in Japantown West Mall (formerly Kintetsu Mall) hubby loves to get his coffee on & bakery item. \n\nI'm sure we will be back.", "author": "Karen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "Jalapenos cheeseb bread! ..try it if you love spicy. Recommended from my wife. And Im now recommended to you all!", "author": "Hiro L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-08", "description": "Waste of money. We ordered the Japanese souffle cheesecake. It tasted frozen, dry and far off from a souffle texture. We had a creme brulee that tasted like a flan. We got a coffee and after giving us our cup the man disappeared so we didn't get enough cream for our coffee. Poor service, horrible baked goods.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-23", "description": "Super dry cheese danish, not crispy at all. Creamy French is very sweet, you can not feel the milky of the custard. Bad experience.", "author": "Mengrou L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "This place is the bomb!  Go and get some bread -- preferably a sandwich made in the deli. Very fresh! The loaves I bought were delicious-- I did not want to share the \"pull-apart\" at all.  Most people will only want a half sandwich.", "author": "B T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-23", "description": "Words that come to mind? Shit show. Mind numbing. Dumbfounding. All this while just waiting for a damn cheese bread.\n\nYou walk up and order so fast. Then it all goes to hell. The young girl asked me if I wanted it \"warmed\"\n\nI said--sure. OK. \nThen I stood. And stood. And stood. Twenty minutes went by. The various employees took turns helping other customers. They had tons of bread lined up waiting to go into a two inch wide toaster oven suitable for the Two Dwarves--because the other Five couldn't fit their piece of breadcrumb into the damn thing. \n\nIt was unbearable. Just watching these girls fumble between helping customers and try to warm bread while giggling.\n\nThe bread? It was OK. Not worth the ordeal. I won't be back. All that AND you look at the receipt and you just paid an extra 4% for the San Francisco Commie Tax--yeah--I need to help pay for health care. Because that's CA of today. In 10 years look at your receipt and notice the 65% tax for various reasons. You'll complain and then realize you voted for it.", "author": "Black X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-13", "description": "I used to only go to Andersen's for their Creamy French. Today, we randomly decided to get a cake and chose the Cappuccino one. Service seems mediocre here, but pretty friendly. The 6\" is a perfect size and it was actually pretty good. The total was $21~.", "author": "Maggie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-25", "description": "#87/2016\n\nSushi and ramen restaurants and a ...bakery? \n\nOn the west wing of the Japantown Center just past the cluster of restaurants that includes  Benihana, you'll find a food court of sorts where Andersen Bakery's located.\n\nI didn't see any exotic French pastries and some of the items looked over-priced and not super fresh. \n\nI think the majority of the baked goods being in open air on a large countertop and not in vitrines contributed to their looking dry.\n\nThey quickly answered \"they were made today\" but then admitted they weren't made there but off-site. \n\nI asked the young girl what some of the pastries were and she didn't seem to have a clue. She looked over at a colleague for answers and spoke to me with mixture of annoyance and helplessness. \n\nOddly, she queried whether I wanted half or the whole pastry (it was just slightly bigger than average). \n\n(They sell half pastries? Odd.)\n\nThe service was far from welcoming and if I weren't committed to buying something with my little boy's eyes wide with a sugar promise, I would've walked.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "A little pricey but what can you really expect to pay in San Francisco? They are known for their Creamy French so we got one of those, a Jalapeno pesto international cheese bread (since we overheard a girl gushing about them), and a sourdough boule. I can't decide if I liked the Creamy french or Jalapeno pesto more. The CF was soft, chewy, sweet and salty all at once. The JC was more hearty savory, and had a good spicy kick! I wish I had time to try more as all their items looked so delicious.", "author": "Priscilla Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "Let them eat cake!!!! Good cakes and fast service. \n\n1. Cakes\nYou can get good quality, similar to authentic Asian cakes here. As you know they're very different from sugar infused nightmare you find in every grocery store. Not all items are good here, but definitely better than most cakes.\n\n2. Service \nIt's fast and on point. Not necessarily the nicest but not rude at all. \n\n3. Seating \nThis place is usually always packed, and they have only 3 tables inside, so it's hard to find any seat. They provide free cup of water, but make sure you check the glasses before drinking. One time it wasn't clean. \n\nAll in all, pretty good cakes sold here compared to most places.", "author": "Bella J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-15", "description": "If you like RICH and sweet food, definitely your spot. \n\nI had to try the creme brulee. The sugar on top was super thick and the creme was very sweet and rich. Still good but I think too much unless you have a major sweet tooth \n\nGot the blueberry pastry and it was not bad! The croissant sides were perfect. I'm not sure if it was preserved blueberries because it kind of had the consistency.... but still good!", "author": "Jacqui L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-16", "description": "I just had a cup of coffee at Andersen's after walking from the Financial District to Japantown.   A bit of a walk, but manageable. In my 30 minutes at Andersen, I occupied one of the five indoor seating (they have 2-3 outdoor seating). The place is small, but enough to rest up before journeying back to the Financial District (I took the bus).\n\nThey are right across from Chocolate Chair (a trendy korean dessert joint selling their famous Dragon's Breathe ----a tasteless gimmick and a waste of your time if you ask me)\n\nAndersen was selling Organic Coffee for $1.95 with a free refill! NOT BAD RIGGGHT?!?\n\nThey were selling pastries, baked goods and soups. I don't think they have wifi, but I would still drop by if you want a place to read or chat with a friend.\n\nI don't know the parking situation, but public transportation would be a smarter idea.", "author": "Thomas K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "If you're in Japantown, a stop by Andersen Bakery is quite essential - especially if you're a fan of bread and pastries. With all the positive reviews I found on Yelp, I knew that I had to give it a try myself. \n\nAndersen Bakery itself is a small little store inside the West end of Japan Center. There are a few tables and chairs off to one side, but it seems like most people just stop by to pick up some bread before moving on. \n\nThere was a pretty large selection of bread when I came by. All of it was located behind the glass window - and they all looked and smelled heavenly! I'm quite used to the more Asian-styled bakeries where you basically self-serve the bread that you want onto a tray, so I wasn't prepared to tell the worker what I wanted when she saw me hovering over the bread and taking photos. Croissants, Danishes, elephant ears, all sorts of baked breads - I decided to try their popular Creamy French. They're able to help you cut it up into slices, which is nice, and pack it into a waxed bag so the oil doesn't seep out. \n\nI was tempted to try a slice of cake or a dessert item from their refrigerated section, but opted against it. The Creamy French and its many slices was enough to last me until the next day. The baguette is freshly baked and contains a layer of sweet mayonnaise on the inside. I thought it was tasty, but I wasn't expecting the sweetness of the mayonnaise (or whatever was in the middle). I can definitely see why it's popular - the bread is soft on the inside and crackly on the outside. Imagine that scene from Ratatouille when Colette is describing the fresh bread making that crackly sound to let you know its freshness. Yeah, that's pretty much the bread that they have here. \n\nOverall, I thought this was a pretty nice bakery to stop by. It's definitely a change from the bakeries I frequent, and I did enjoy the Creamy French, although I probably wouldn't try it again, just because it was a bit too sweet for my liking. When I eat baguettes, I prefer it to be on the savory side.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "Date: 11/25/2015  Time: 1:20 PM   55°   Cold and clear\n\nNormally I go to the Andersen at 525 Market Street, SF, for their palmier, almond croissant and the tropical flan before I head back across the bay to get home. However, I was in Japan Town to pick up my favorite cake (coffee crunch) from Yasukochi's for tomorrow's Thanksgiving dessert and my birthday.\n\nAs a favor to my oldest sister, I stopped in at this Andersen to get her a palmier. Unfortunately, they were out of almond croissant. Those are the two items that she likes, so I opted instead for an apple cinnamon muffin.\n\nIt really does not matter which Andersen Bakery I go to, as the employees are courteous and helpful. The baked goods that I have tried are fresh and delicious. I can never leave without getting a tropical flan.\n\nThis Andersen Bakery is smaller than the one on Market Street. It's more like an order to go (on the run) with just a few benches nearby. It is also hidden away in a building housed with several storefronts and kiosks. Get in line, order the baked goodies and/or cakes, pastries, etc., pay the cashier and you're on your merry way.\n\nI will only return to this Andersen when I happen to be in the area of Japan Town. Otherwise, it will be the one near the Powell Street BART Station for my tropical flan.", "author": "Carol C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "The creamy French is my forever favorite. Their chicken sandwich is perfect, especially when paired with the vegetable soup. I love this location - there was a little farmers market right outside when we came in. Dine and shop - perfect day", "author": "AR K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "I ordered a cake for our holiday lunch over the phone.  I just told them what I wanted, when, how big etc and they took care of the rest.  I came here because it was close to our lunch spot (Benihana) so it was convenient and I didn't have to transport a cake via bus.  Cake was fresh and very yummy.  We got a lot of compliments from our party.\n\nIf you are having a party in J-town, definitely order your cake here!  No transportation fuss or muss!", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "The fig and walnut bread was amazing. The mango cream cheese muffin, delicious, and the almond saffron twist might be the best thing I've ever eaten. The customer service was fantastic just as everything else. Been here twice, and will be going back soon.", "author": "Big B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-18", "description": "Stopped by Japantown today, and got to try Andersen Bakery's delicious treats!\nGot myself a slice of the cappuccino  cake while my aunt got a slice of the ganache cake!\nAll the pastries looked delicious & the service was great c:", "author": "Gabby O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-21", "description": "The workers are often talking in the back and aren't paying attention to non-customers who are buying ice cream from across the store and sitting at Andersen's tables and leaving a mess of cups without throwing them away.  The customer only signs don't work. They need to keep their eyes on the tables and hide less in the back especially the nonasian workers with no common sense.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "The pastries here looked beautiful--I wish I had tried more! I went with the kouign amann and was sorely unimpressed. However, the only other one I've had was at B. Patisserie, which is so well known for them that I do not want to unfairly compare. My one recommendation is that if you get one of these, eat it there or quickly turn the box upside down. The crunchy, sticky bottom that is the best part got stuck to the bottom of the box so that when I got home, it separated from the pastry and wasn't as crunchy.\n\nThat being said though, I don't want to rate them unfairly. I see that others have tried other things and raved about them. In addition, the staff was SO friendly and nice, I really appreciated that considering most other stores in that mall had staff that didn't even look up or acknowledge us as we walked in. Plus, I only had a credit card on me and they graciously took it without any problem. This surprised me because I typically expect an Asian establishment to have a lot of restrictions around credit card use. Additionally, the atmosphere of the store was clean and there was even some seating.", "author": "Susan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Sure, there are Anderson Bakeries littered all over the Bay Area, but for some reason I always enjoy getting something to go from here. \n\nThe bread is fresh and diverse and they have a lot of options for desserts and food. That's pretty much what you really need when going to a bakery right? \n\nThe service is quick and nice. Not a lot of seating, so you might not have somewhere to eat if you decide that to go is not your flavor of the day. \n\nStill, I enjoy this place and will continue to buy things from them.", "author": "Benny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Great pastries and English bread that they slice for you. Fresh and lasts longer than Trader Joe's bread.", "author": "Kristan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "Nice open bakery in the middle of Japantown\n\nThis place has been here for as long as I can remember. The open cake counter is always a sight to see, with a large array of colorful cakes and pastries. Passer-bys always seem to stop and stare, which goes to show how visually appealing the food is.\n\nThe thing I like about this place is that they use great ingredients (e.g. they serve organic coffee, and put a lot of effort into making the pastries perfect), but they are not in any way hipster or pretentious--they charge very little compared to the quality of food they offer, and you can tell the folks who work there work long hours and have been dedicated to their craft for long time.\n\nHats off to you, Andersen folks.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Andersen Bakery is always on our short list anytime we are in the area. There are several locations and have not been dissatisfied once. Our usual stop is the shop located inside Japan Town. Love their fresh breads, cakes and pastries as well as their smiling service. Writing this review makes me feel like driving into the city just to get some more.", "author": "Bob B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "I really like the pastries here. None of them are too sweet or too overwhelming. They're very European/French in style and really light and delicious. I also love this location inside the Japantown, it's always fun walking through Jtown mall and getting a sweet treat from Andersen!", "author": "Sara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "everything feels so freshly baked and the environment is great. Not the best barkery I have ever been to, but it's high up on the list. Will definitely come back if I come to this neighboor again.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "The loafs and all kinds of pastries are tasty. What I really like is the service. The staffs are very nice and friendly! I always have great experience here.", "author": "Sabrina Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-14", "description": "Tried their cheese danish and taste was good, and you can asked them to cut it into slices too.\nThe place just a small place and you can just sit on the table inside or outside . Price wasn't bad at all", "author": "Claudy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-13", "description": "Probably one of the best creme brulees I've ever had. I won't lie to you, it's super rich. But let me just tell you, the sugar crust on top is PERFECT and the cream below is delicious. It is very syrupy, but that does not take away from it's delectable quality. Get it, guys.", "author": "Bushra H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Stopped here recently and had the best almond croissant ever! This little spot was open before a lot of the other shops in the mall, so we grabbed a table and had a snack. A very pleasant place with friendly staff and a beautiful selection of baked goods.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "I can't leave Japantown without making a stop here for their Anpan (pastry filled with sweetened red beans) to bring home for my mom. \n\nI don't really care for them but my mom swears that the Anpan that's made here are the best around. For her, it reminds her of the Anpan that she grew up with growing up in post-war Okinawa. Having \"sweets,\" like Anpan was a luxury and so it's a \"bittersweet treat\" for her. Sure, we have a Japanese bakery in SacTown but, I think it's the \"An\" (red beans) that definitively stands them apart from the rest. For $1.75 each, it's quite a deal. \n\nWe've been coming here for many years and it's high time I wrote a review.", "author": "Micki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "I had a matcha cruffin and a strawberry tart. My only critique on the tart would be MORE STRAWBERRIES. The cream was very nice, not too sweet and the sprig of lavender added a little hint of flavor.  The matcha cruffin... it took me longer than I'm proud to admit to realize that a cruffin is a croissant/muffin. Once I got past my blonde moment and dove in for a taste, I was greatly satisfied with my order!! Flaky and delicious. The young lady behind the counter was friendly and courteous! The next time I'm in the city, I will be back.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "I got the strawberry shortcake and the chocolate cake I can't remember the special name they had for it.  Both were absolutely amazing.  Both were flavored for the japanese palate as the cakes are not overwhelmingly sweet like american bakeries. I wish they had a place closer that made cakes like these in sacramento.", "author": "Eric K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "Staying at the Hotel Kabuki for the weekend, late Saturday I was planning out what our Sunday breakfast strategy would be. Someplace open early that would have coffee and pastries.  Andersen Bakery fit the bill!\n\nThey open at 8 AM Sundays, which is a good thing, because when I rolled into Japantown on a Sunday at 9 AM it was a ghost town - Andersen was one of the very few places open. I ordered a Double Café Mocha, an Almond Croissant and a Raisin Twist pastry. The pastries were fresh and delicious, and my coffee was tasty and perfectly made.\n\nAndersen Bakery is a great option for coffee and pastries for Japantown visitors.", "author": "David F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-02", "description": "I got a anpan from here over the weekend. Filled with red bean paste, it was flavorful. But I found the bread to be a bit stale in taste. Not bad, but for the quality of the anpan in Jtown, it was not what I would have expected.   Maybe the other sweets are better...but that will require another visit.", "author": "Marck N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-26", "description": "I got a few pastry here. The food looks so good and I was excited... then I bit into it and was greatly disappointed. The pastry was not fresh. It was soggy and cold. The Kouign Amann was glazed and baked upside down because the people working there do not know what that is supposed to look like. I threw some of my food out.", "author": "Clara Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-26", "description": "Review for what they claim to be,  \"Creme Brulee\". \n\nIf anyone is going to Japantown in SF today, please do not get their Creme Brulee! JUST got a Creme Brulee from their store and this is how it turned out as. Just check my pic. I was able to pick up the entire glob with my fork and the consistency is super thick and yucky! Condensation happened and caused the Creme Brulee to be super watery. Tossed it away right after.\n\nIf you didn't know,  Creme Brulee should be creamy with the right Consistency. The burned caramel on top should crack into the nice creamy custard and not like a net where it eats your spoon and water squirts out.", "author": "Elaine N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-19", "description": "Andersen Bakery looked small. not sure where the bread/pastry is made. must be baked premade dough. so skipped.\n\ndrink: honest tea (1.95 or was it 2.15?)\n-price very reasonable.\n-\"organic\" coffee (1.85) also available\ndidn't see labeling\n\ntake outs:\n-good location for cheap eats in pricey J-town\n-fast, friendly service.\n-should be 4 stars for cheapstakes (not me, i'm value oriented).\n-table seating available.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "Awesome bakery and good prices.  I had the walnut cream cheese bread and my son had a peanut butter cookie.  Highly recommend both!", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-17", "description": "There is no universe in which the pressed deli meat they served me can be called \"chicken breast.\" This is the most disgusting sandwich I've ever thrown away.", "author": "Michele H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "Mmm...fresh bread. After having watched the entirety of Yakitate!! Japan recently, I decided that it's important to have fresh bread. The selection here is always great, and the best part is that you can order loaves and get them cut into slices. For those who are interested in portion control, this is an excellent way to do it.\n\nI purchased half a loaf of multigrain English bread, cut thick. I love how they have this option, because it means I don't have to buy the $6 non-fresh-thick-sliced-bread at Nijiya. Half a loaf is $4.50 here and it's just about right for the two-person household I'm in, especially when I'm the only one eating the bread.\n\nBread, sliced and fresh, tastes amazingly different from the bread that is pre-packaged. I could still taste a bit of the crunch from the crust and the softness of the bread was incredible. I never had this experience with regular wheat bread. Since Japantown is so close to me, there's no reason for me to ever buy non-fresh bread again.", "author": "Robbin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "A great spot to go to at Japan town! \n\nI got the flan ($3.50) and it was good. I wish it was a bit more creamy/smooth, but I was surprised to find cake at the bottom of the flan! If you have a sweet tooth, I would suggest this. \n\nMy friend got the ham and cheese croissants and she said it was delicious. Worker told me their most popular was the cream cheese and almond croissants. \n \n+1 for being a great place to study or catch up with a friend. \n\nMusic is a bit dramatic. Dun dun dunnn..", "author": "Anna H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-09", "description": "One of the many Andersen Bakeries in the Bay Area, this particular Japantown location offers similar European style pastries and breads with their signature Japanese twist - rational (small) portion size and less sugary recipes. \n\nI am surprised to find only a limited pasty selection in an early Saturday afternoon. Perhaps they were sold out? I was quite disappointed they did not have any strawberry shortcakes or chocolate cakes. Settled with a slice of their baked cheesecake. It was decent but not very exciting. \n\nThis store is small but there are a handful of tables and chairs around. Doesn't seem to get too busy but do come here early for a better selection of baked goods.", "author": "Mona W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-30", "description": "Haven't even try the bread. I have been in line for 15 minutes just waiting. It is 10 am on a Friday morning. They only have 2 people working.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-01", "description": "Why haven't I been coming here every single weekend??\n\nI stopped by Andersen on a Thursday after work because I was feeling like indulging in something sweet. I chose the espresso cream layer cake ($3) and raced back home so I could eat it slowly and savor every bite. But.... when I took the first bite it took all my willpower to eat it slowly because it was DELICIOUS! It was even a bit hard to offer my boyfriend some because I wanted to hog the entire thing to myself lol The cream was super light and tasty and the cake layers were moist and perfect. It also really tasted like espresso which was awesome! Sometimes you get a cake or a sweet that is supposed to be one flavor but it doesn't really taste like it.. but Andersen totally hit the nail on the head here, this was the real thing =) \n\nI'm so coming back here as soon as possible to eat more cake. It's super delicious, affordable, and if you ask for your cake slice to go they will put it in a cute little box. Yay for Andersen Bakery!! =D", "author": "Sam F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-01", "description": "Where are all the kashi pans?? Andersen's was one of my favorite bread stores in Japan. The bakery here in SF= horrible. Where did all of their amazing breads go? They have zero selection. The breads that I did try did not meet my expectations. If you've had Andersen's in Japan don't expect the breads here to taste like that.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-21", "description": "The cakes and customer service is getting worse.  All the great service workers have left and the replacements do not smile nor say thanks and are robotic in movement lacking common sense as counters are wiped but left quite wet and used wood coffee stirrers are ignored.  Some dumb dumb cut the cakes in tiny slices unlike the ones before, creamy side ends are cut off and discarded on log cakes.  What a waste! Recently, a heavy set European worker was hired and spent most of her time dusting the dust of high shelves onto the pastries.", "author": "Ken K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-18", "description": "The almond croissants were full of air and a thin sliver of almond paste.  The texture was lacking and the best part was the powdered sugar on top.  Other than the appearance, the croissant was a complete disappointment.  My friend complained that his raisin bread was too dry.  Not recommended!", "author": "Lorissa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-03", "description": "Came here and tried their creme brulee. It was alright but I think wholefoods creme brulee tastes a lot better!", "author": "Sui N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-25", "description": "An odd place for a european bakery, in the middle of Japantown, but they have a couple of items I really like, so it works for me.", "author": "David T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-04", "description": "The croissants weren't particularly unique - they weren't terrible, but they weren't memorable either. In the meantime, according to my friend the anpan was stiff, and the bean paste was too sweet. \nI also purchased the raisin scone which I thought was tasty but, yet again, nothing worth commenting on. \nThus, unfortunately, Andersen Bakery in Japantown doesn't bear much semblance to the ones in Japan.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-27", "description": "Below average bakery. I don't understand all the high reviews, have people never been to a good bakery? \n\nWe tried the almond croissant, an pan red bean bun, pesto bread. \nThe pesto bread was very good, nice chewy crust and soft scrumptious middle with pesto. \nThe almond croissant texture was not the flaky buttery goodness you'd expect, it was like dry stale bread with almond filling. The red bean bun was so sad, an embarrassment for an Asian bakery. Dry with barely had any red bean. Skip this place and go to any of bakeries in Chinatown (Eastern) or on Clement (Red Blossom) for far superior buns.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "I love getting the cheesy bread from here. Jalapeño is a hit and pesto is a hit. All the cakes are delicious so you can't really go wrong with anything.", "author": "Dylan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-18", "description": "I stopped by Andersen after shopping at Nijiya Mart this past Sunday evening on a whim because I have been recovering from a cold and needed some comfort.  This place reminds me of Sunday afternoon strolls with my mom in Okinawa when she used to take me to go window shopping in town.   My mother would occasionally reward me for my patience after a long morning/afternoon spent traipsing from store to store with shu-cream (cream puff).   I am considered an American HAPA and culturally I am extremely Americanized, but I do have a few memories of life as a child teetering between two cultures and this is one of them.   My fondest memories of both my mother and of Okinawa are cream puffs on Sunday afternoons before I had to return to school on Monday.     So, this place puts a huge smile on my face when I'm feeling a little under the weather or a little homesick.  \n\nOn a side note, this place has pretty great brewed coffee.  The eclairs are decent.  My favorite slice of cake is the strawberry shortcake.  They also have thick sliced pan (aka bread).\n\nSlices of cake are a bit steep ($7/slice), but great to share with a friend or a date.", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-03", "description": "The reason I give this place one star is do to them giving me a cold ham and cheese in which I got a coffee that wasn't all that good.", "author": "Henry S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-16", "description": "Andersen is a branch but my family regularly visits the bakery so we can get a hold of a couple of loaves of their white bread.\n\nThis time, I went to the Japantown branch in that main mall. I shared a cream puff and a Cream French.\n\nThe cream puff looked cute but pretty weak in my opinion since it was pretty basic. Whipped cream filling not the richer vanilla cream. Cream French is basically a small, skinny loaf (looks like a bread stick) with a cream cheese middle. It's like cheesecake breadstick so it tasted good. I didn't really like the bread part though, I thought it could have been softer or butterier.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-29", "description": "First of all they had Palmiers! Flaky, crunchy delicious ones!\n\nVery pleasant staff behind the corner, quick and simple, what more could I ask for?", "author": "Tones T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "We decided to pick up our 2014 holiday cake here. As far as selections goes, we did not have much choices as we arrived a few hours prior to closing. Our fault. By default, I always tend to buy a cake that is neutral to everyone's liking. Unfortunately their strawberry cakes were gone. However, there was one more chocolate ganache cake left so we took the plunge not knowing what to expect. The chocolate ganache tasted great to our surprise. It wasn't overly sweet or bitter. Perfect! It was a hit at our holiday celebration.", "author": "Gene B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Cream cheese walnut loaf. That's where it's at. Super yummy and very friendly staff one of the few perks of being in JTown for the hubster. Nice and fresh and fast!", "author": "Janet D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "I recently purchased a 6\" Strawberry Shortcake for my boyfriend's Birthday from Anderson and it was delicious! It wasn't overly sweet and the softness was just perfect. The strawberries were fresh too! Everyone complimented how good the cake was! I would definitely say the portion is more for six people than for eight people (best for a small group of party) but, other than that it was an amazing cake and I would definitely repurchase it!", "author": "Helen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "A rare Japanese small bakery in U.S.\nThat is not fancy but a standard local bakery in japan, which is very difficult to find anywhere in U.S.\n\nReasonable pricing impressed me.\n\nIced coffee is under $2.\n16oz and comes with paper cup.\nTastes actually good.\n\nThey have good baked goods and breads as well as some  classic simple cakes.", "author": "Blue G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "Courtesy or manner is a problem.\n\nI order steam milk and get at least 30% up to 40% froth on top.\n\nI order chocolate croissant and get one that tastes not fresh and after half way through, I didn't see chocolate ingredient in there. \n\nI order a lot of food, they don't do the minimal table service at all. I have to carry all food to the table. \n\nI cry for the waitress worked there before. \n\nDon't go there.", "author": "Ken C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "As close as an Asian bakery can get to a European bakery, their items look splendid and are almost as good as French or German cakes and baked goods (I realize this is a matter of preference, Asian items are usually too sweet and fluffy while lacking the substance of European items). That said, the cakes and breads are pretty darn good. Service is efficient if a bit curt, they could use more of the Japanese courtesy.", "author": "Tom B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-22", "description": "It was fair. Not quite iike the elaborate open setups of the eki-mae Andersen Bakerys in Japan, but the apple and cinnamon pastries were solid. \n\nSo for all those who wonder why it's in J-Town and all, it's because this is a chain in Japan. :) Just nowhere near as good. I want my buns with wieners and corn! :P", "author": "samuel a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "Definitely stop by if you're in SF! Fresh, yummy bread and nice friendly service :) I really enjoyed the jalapeño bread!!!", "author": "Joy Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-01", "description": "Absolutely no star. Beware this bakery if you order birthday cake. They took my order about week ago. Just called day before event  !!!they cannot make it cake decorating we wanted. So we want to cancel order. She was trying to charge cancellation fee !!!  DO NOT ORDER CAKE HERE!!!", "author": "Eric E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-27", "description": "I grew up in Northwest Iowa and lived in an area that was significantly represented by ethnic Scandinavians. I know (and hate) Ludefisk and still wonder how those crown of candles are worn on St. Lucy's Day. And when I take a message from someone named Larson, I always ask whether the end is spelled \"on\" or \"en\".\n\nSo in a bit of cultural Schizophrenia, here sits Andersen Bakery in Japantown. I ordered a \"Long John\" for Breakfast and it was OK. The overall selection looked tempting, although it seemed limited. Counter service was friendly enough and I look forward to noshing through the menu a little more in the future. And maybe they could manage a Danish Kringle?", "author": "Eric B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "This place has a good cream cheese danish! However, their ham and cheese croissant was lacking in cheese.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "These Swedish Mazarin mini cakes looked really cool and tasted great. It had an almond liqueur moist cake filling. They adorned the top with halloweeny designs!", "author": "Derek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "My boyfriend and I love Andersen Bakery. He loves it so much that whenever we pass by one, he HAS to buy something even if we're not hungry.\n\nI like the strawberry pastries here, and the apple raisin bread, and the fruit salads..", "author": "Esther Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "Glad to find a bakery. Pastries were light, yummy, and reasonably priced. Located on a busy corner, the small tables afforded a great place to people watch.", "author": "Bobbi D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-10", "description": "Bad Management and horrible young male employee (should be fired). I just live across from this bakery so I buy bread and cake twice a week with them. It is so rude that young male worker give me a dirty look and just stand there in front of cashier doing nothing and redirect me to the busiest young girl working on the croissant side with another cashier side. He is just lazy and I asked for the manager in which I was already upset. He got scared and run into the back pretend he is working with the bread machine. I came every time and leave my number to talk to the manager never got a phone call. Ask to see Manager and got an answer that she only came back at 9 pm to pick up the money. It is a big regret that I seek somewhere else to spend my money now.", "author": "Eugenia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-21", "description": "Sort of ok. Dessert were too sweet but breakfast pastries were pretty good.", "author": "Anchisa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "Stopping in for a light dessert after a large lunch at Mifune Don, my friend and I found ourselves too full for anything more than splitting a single slice of cappuccino cake - though I will admit that I was greedily eyeing the flan, strawberry shortcake, strawberry tart, and... well, just about all their baked pastries as well.\n\nOur slice of cake was delicious though, lightly sweetened, as fluffy as one would expect of Asian cakes, and with good coffee flavor. Perhaps a bit on the pricier side at $2.25 for a small slice of cake, but nothing unreasonable (and we were certainly too full for more than that anyway). \n\nA note to those who want to eat in, seating here is fairly limited, with about three tables inside, another three outside, and many more people than there are chairs  - seeing as how I showed up during the J-Pop Summit Festival though, I can't speak for how crowded it usually is.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-30", "description": "please do not sell pastries that are few days old, even if you are giving 50% off, this is illegal.\n\nI bought few pastries , croissant and walnut bread last night and they tasted like ,not a day old but few days old.\n\nthis is very shameful", "author": "Mason C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-31", "description": "I was so glad to find Andersen Bakery while staying at JapanTown! As a matter of fact I returned two more times just to get Creamy French, which were small soft french bread filled with custard. Yum. \n\nAt one point I got 6 Creamy French. SIX! The lady that helped us at the counter had to go to the back to retrieve 3 more for me because there were only 3  left on display up front. I ate the 6 throughout that day and I was so happy. \n\nMy husband tried a couple different croissants and he liked them. I will probably try some of the other pastries next time I visit, but only if I have any room left after a few Creamy French first.", "author": "Yiching P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-20", "description": "Cakes are light, creamy, and delicious. Coffee is just as good.", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-29", "description": "Wen't here for semlor (Swedish pastry), it was good but the place it self was not so clean.", "author": "Rebecca B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "I loved this place. The ladies in the store were so nice and informative. They have a eclectic collection of pastries. I opted for an almond croissant and it was amazing accompanied with a smooth soy latte. The place is rather large so there was plenty of seating. I would definitely go back.", "author": "Angel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "Got the strawberry tart and a tea. The green tea is really good and the water is nice and hot. The strawberry tart was really good if a bit too tough. It was hard to bite through the crust. I thought it was odd they garnished their tart with rosemary. The staff was a bit slower than desired but they were a tad busy that day. I would choke here again for a nice snack and tea.", "author": "Deanndra C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-27", "description": "To me, Andersen Bakery always looks a bit oddball next to all the other shops and eateries in J-Town. After all, it's a European-style bakery amid the more familiar manju and mochi sweets. But I have come to realize I am the one who is guilty of prejudice when it comes to what my peeps want to satisfy a sweet tooth. Yes, who am I to judge the taste buds of my samurai brethren?\n\nIn a weak moment, I came here on Saturday full of good intention to simply stare at the baked goods on display. When the server in the corporate uniform (it is a retail chain after all) asked me in a most robotic fashion what I wanted, I had to give in to temptation and order the Pan Dolce and a Cheddar Cheese Croissant.\n\nFor Chrissakes, I said it was a weak moment. Don't judge me. Both were $2.95. The Pan Dolce was a very dense piece of sweet dough mixed with cream cheese. Honestly, it was more chewy than tasty and not quite the thrill I was expecting. More predictably, the croissant was nice and flaky, but the mix with cheddar cheese - not my favorite kind, more like high-grade Velveeta if you ask me - was not the best thing for my palate much less my stomach. I'm going back to the Benkyodo peanut butter manju next time.\n\nPASTRIES - 3 stars...looks better than it tastes...dammit\nAMBIANCE - 3 stars...a wee bit of Switzerland in the middle of Tokyo...whatever\nSERVICE - 2.5 stars...robotic would be putting it kindly\nTOTAL - 3 stars...but have you tried the manju lately?", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-26", "description": "7PM on a Sunday and I am in need of a birthday cake. I was searching on Yelp and stumbled across Andersen Bakery after calling several other bakeries in my neighborhood- everything was closed! Safeway was my very last resort but I really didnt wanna go there. I was so happy when a friendly voice picked up and told me they were still opened for another hour. I asked her to save me the 6\" cheesecake and 6\" strawberry shortcake- I was there in 5 minutes and picked up both!\n\nEveryone at dinner enjoyed them both. The shortcake was very moist and the cheesecake wasnt heavy. Definitely a nice treat after dinner.\n\nThank you, Andersen Bakery, for closing at 8PM on a Sunday!", "author": "M W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "I loved Andersen Bakery in Tokyo. It was exciting to find a store here.\n\nI now have a \"cup of coffee + oat nut cookie\" morning at Andersen way too often. I find the organic coffee unusually good.", "author": "Kenneth H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-23", "description": "Looking for a quick snack at Japan Town, I decided to stop by Andersen Bakery for a tomato soup. Unfortunately, the soup was a huge let down - it strangely tasted like flour rather than tomato. In addition, the sour dough bread was plain and dry. The only highlight was the great variety of vegetables in the soup. Yelpers, do not get soup at Andersen Bakery.", "author": "May Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "Food is good, though not spectacular.  People are usually pretty friendly.  Service is exceptionally fast, and not just by Bay Area standards.  I was told this was a Japanese chain - in which case I'd be inclined to chalk up the fast service to that.\n\nThey don't charge sales tax on to-go orders, as well they shouldn't.  Not everyone seems to know to-go food in California isn't taxed, because most restaurants charge it anyway.  I often wonder what these restaurants do with the tax they shouldn't be collecting in the first place...  The cynic in me says they just pocket it themselves as extra profit margin, but I guess that's harder to do on card transactions.  I digress.\n\nI wish they had wifi.", "author": "C L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-27", "description": "[M]ona: 3 Stars\n[W]ayne: 3 Stars\nAverage: 3 Stars\n\n+ Accepts Credit Cards\n+ Not Pricey\n\n- Food looks better than it tastes\n \n[W] I normally come here for the sandwiches and salads which are ok. It just feels like I can make these stuff at home especially the creme brulee haha. Anyways, we got the creme brulee, tropical flan and cappicino cake this time.\n\n[M] The Creme Brulee http://www.yelp.com/biz_photos/FTir7qcSlmO3il2rSi0urQ?select=O_gn_3aYH2Hgk--oE6IBTA here tastes like the one Wayne makes but it's more on the softer and sweeter side. The brulee part was not hard/crunchy so that's a dumbs down for me. The Tropical Flan http://www.yelp.com/biz_photos/FTir7qcSlmO3il2rSi0urQ?select=KI9_D2DY-62Kgn-tDmsgNg was EXTREMELY bland. \n\n[W] I believe that all Andersens are the same. I haven't found one that excels over the rest. Nothing too much to say about this place. It's a great choice if you want to eat healthy and too lazy to make your own sandwiches", "author": "Mona C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-30", "description": "I bought a chocolate cookie and an eclair for my husband and I, as well as a loaf of bread. The snacks were rather bland, my cookie having no hint of chocolatey flavor. I was hoping to get my garage ticket validated here, but I'd have to spend $30, so that was a no. Still the little shop is cute and the person helping us was nice.", "author": "Genevie Lei L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "The strawberry shortcake is my favorite thing in the entire world.  And the bread.  I don't even live in Norcal and I was heavily contemplating that I should buy a loaf of bread to take home... but decided against it because:\n\n1. I already bought too much food to bring home\n\n2. The loaf would've disappeared before I even got home.\n\nI love this place.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Japanese delicately sweet pastries with good organic coffee. Also bought some anpan to go for the kids ;)", "author": "Reiko B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-06", "description": "pros...if you are in jtown and are in desperate need of some snacks or some bready things, this is a great place.  open early and closes late, this is a perfect place to have some breakfast or a little light snack after dinner.  \n\nwe had went here early on friday, and it was open at 9am, which is early for the japantown center.  the service is awesome, as they will get your stuff and even heat it up to the perfect temp.  we had ordered the cheese danish which is the best danish i have ever had.  and if you know me i love danishes.  this one is made with the same type of dough as a croissant.  so it was light and flaky as well.  the cream cheese was light and not too sweat at all.  and the whole thing when warmed was just perfect.  i also had the sunshine bread, which is bread with a very thin sugar cookie dough baked on top.  so good.  \n\nthe coffee here is great, fresh and served with a smile.  and the servers here are very proud of their products and the service they provide.  they are very intent on making things perfectly.  my wife had order her drink and it was the wrong size, and they just didn't add extra to make it the right amount.  they of course threw the old one away and got the correct size cup and then redid the drink again.  the new girl made really good steamed milk.  perfectly light and airy.  \n\ncons...wish we had one here in San Diego.  it's quite a bit aways for us, but when in japantown this is the place to go.", "author": "Joel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-14", "description": "Yum baked goods. I've been to this location a few times in Japantown for tasty goodies and bread. This weekend we grabbed some garlic cheese bread and a cheese & bacon bun. The bread was soft and fresh and oh so awesome. \n\nThey don't only sell baked goods and pastries for immediate eating, you can get buns and rolls in a bag to take home. I should make a point of popping up here every few weeks to get fresh bread products.", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Best bread around JapanTown area. Coffee is not really great, but this place is just worth by its bread.", "author": "Edgar S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-15", "description": "Croissants weren't buttery enough. Eclair tasted bland. French cream bread was tasty and service was good.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-22", "description": "I have a soft spot for this place.  For as long as I can remember, my grandmother used to come here and meet up with her friends every Saturday afternoon.  They would sit in the exact same spot, exchange stories, drink coffee, eat some pastries and then continue on their day.  I used to meet my grandmother here often and we used to laugh and talk, before she got really sick.  I miss those days. \n\nThere's an assortment of goodies but I always ordered the fruit tart and coffee.  She would order coffee ice cream and we would share desserts and then sit and people watch; gander at tourists as they excitedly talked about cherry blossoms, or how fascinating Japanese culture was to them.  She grew up during the time when Japanese imperialism reigned over Korea.  Therefore, she had to embrace the Japanese culture by learning the language and by attending a Japanese school.  But, she never saw this experience as negative (as most Koreans would during that time), but alas, as a positive, learning experience.   I marveled her tenacity and strength.  She loved coming to J-town and Anderson's because to her-- it was a second home.  \n\nI passed by Anderson's a couple of weeks ago, while having dinner in that area, and it was bittersweet.  I would do anything to be able to talk to her again.", "author": "Soo Jin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "Anderson bakery is great place for a snack in the middle of the day. The coffee is good and it's very nice place to hand out for couple of hours. The line is not to bad most of the time. Today is was busy but we had a small event in japan town. So enjoy it", "author": "Magen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-29", "description": "A reasonably priced place in Japan Town. Their sandwiches are great for lunch.\n\nAll of the sandwiches are priced the same so I went with the one which had the most appealing bread and size which was the chicken and provolone sandwich. It was surprisingly very delicious! I loved the pesto mayo and the bread tasted very moist, soft, and fresh! The clam chowder was delicious as well! Just overall a great place for a quick lunch! \n\nThe pastries and other breads looked very alluring as well, but I was only there looking for lunch, and Andersen Bakery saved the day!", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "I came in here on a Thursday afternoon for coffee and cake.  The coffee was slightly above average, and fresh. \n\nI tried a slice of cappuccino cake, which was outstanding.  I'd recommend trying a few of the dessert options here.  \n\nWith so many food options in Japantown, it's usually hit or miss.  However, Andersen Bakery is a hit for me.", "author": "Ravi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "I tried their Kouign-Amann, and it was SOOOO good!  I want to try their everything!  Great job!", "author": "Yasmin T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-25", "description": "Came here around 10am on a Sunday to grab some iced coffee and some breakfast. \n\nUnlike its usual bustling atmosphere, Japantown is relatively deserted around that time. It was a pleasantly quiet ambience sitting outside at Andersens though--and by outside I mean in the indoor plaza (too windy in the real outside).\n\nWe shared a jalapeno cheese bread and a \"sunrise\" (a.k.a. melon-pan).\n\nThey sliced the jalapeno cheese bread for us--it was yummy! Airy and soft, with just a hint of jalapeno with some creamy sauce on top. \n\nIf you  haven't had melon-pan, it's a Japanese bun that reminds me of Cantonese pineapple buns--baked bun with a cookie-like crumble stuck on top. The one here wasn't too flavorful--A said it didn't quite do \"real\" melon-pan justice. \n\nIced coffee did the job. Not much to say there.\n\nWe were going to buy bread, but it was a bit pricey so we passed.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-15", "description": "Only like their creamy french breads. Their cakes aren't good and comes in small slices. \n\nI tried sharing some of the cheesecake with my dog and it was rejected. He loves to eat in general, but didn't eat this after a sniff. Something to think about.", "author": "Alisa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-06", "description": "A pretty standard bakery. Came here while waiting to do \"escape the room\"across the street. The apple muffin was the right level of sweet, I think muffins are too often way too sweet. The apple chunks were tasty, and for two bucks I can't complain. The creme brulee was also good, a bit more expensive (3 bucks). The top layer of melted sugar was incredibly sweet, a little too much, but the custard underneath is on point. It balances the sweetness of the top layer, so as you take a bite the flavors change as you chew them. On the whole, both things were good but were nothing spectacular.", "author": "Amaresh S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "This place is great for picking up some baked goods early in the morning.  I jogged here around 9am when they had just opened and asked for the strawberry tart.  There were none made yet but the lady soon had a fresh batch ready for me.\n\nI also got a half loaf of the cinnamon raisin bread, which was an incredible value for the money I spent on it.  It lasted about 4 meals.  Most amazingly, I left half of it for 10 days when I went on vacation and, upon returning, found that it was as fresh as it was the day I bought it.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-28", "description": "A good place for breakfast, snack or dessert.\nBlueberry cream cheese pastry bun = yum, very good.\nBacon and cheese pastry bun = serious yum with bits of bacon.\nThe coffee was mild but tasted good. \nI was kind of sad the next morning when I wasn't eating pastries from Andersen. They must be very good.", "author": "Evelyn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "I come here for the strawberry shortcake and morning pastries when I miss being in Japan. The cakes here aren't too sweet, maybe not sweet enough by American standards but freshly baked and delicious :)", "author": "Akiko E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-20", "description": "Meh. I was disappointed in the one 'pastry' that I bought. It was some kind of bread with tomato sauce & cheese on it. I asked if she could heat it up for me & it was put in the microwave. I thought it would be toasted atleast. I ate it right away & it was still cold & I swear, it tasted a little moldy. Trust me, I have a pretty good palette, & unfortunately, I know what mold tastes like.", "author": "Alysha K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-07", "description": "Super friendly and efficient staff. Free water as well! Ha!", "author": "Royal B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "The presumption is that if a bakery is in Japantown, even with a name like \"Andersen\" - it's going to be good. It does not disappoint.  Croissants are light and flaky, but the ham and cheese croissant was disappointing...they shouldn't roll up all the ham where it's balled up in one spot - it needs to be spread out over the whole croissant. The oat-nut cookie was delicious as was the soft french baguette filled with custard - yummy.\n\nI enjoyed the strawberry cake but was disappointed in the flan - the flan had no taste even if the texture was as flan should be. You bet I'll be back to try the other items - overall, I would expect it to be way above average.", "author": "Dee Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "We just got walnut chease bread and its awesome and my son told me that is the best bakery in the world", "author": "Zhaleh B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-18", "description": "the service was friendly, the customers were too ^_^ I like that, but the food is... ok. its not horrible, just decent. I must be picky but I wouldn't mind eatin here again if I was in the mood for some coffee or something. I didn't try the \"ultra\" sweet cakes or pies but it does seem a little pricey for it. the morning bun is alright. but I suppose the  highlight of the place is that it accepts ATM and has nice customer service.", "author": "Debby D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-06", "description": "Since they are located conveniently inside San Francisco Japan Town I have bought bread from them multiple times.\nThey are good, but if you have time I recommend you to go and stop by the Daily City location.\nThere are multiple times I felt their breads were a few days old since they do not bake them here.\nYou can order the exact same thing and pay the same price and get much better quality at the Daily City location. (except for sandwiches)\nUnlike the sandwiches at the Daily City location, the sandwiches are pre-made and smaller.\nHowever at the Daily City location, you have to pay a little more(I thing a dollar or two) the they are made to order and a little bigger in size.", "author": "R O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-10", "description": "I like Andersen Bakery.  They have yummy breads, pastries, and desserts.  This last visit, we got an almond croissant, chocolate croissant, strawberry pastry, and blueberry pastry.  They were all super good.\n\nI haven't tried any of their desserts yet, but they look really yummy.  \n\nAndersen Bakery is a good place to stop by in Japantown when you want some snackity-snackums, but don't feel like having Japanese food.", "author": "Kris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-04", "description": "This place is AMAZINGLY DELICIOUS! After doing some shopping during the Cherry Blossom festival, I worked up an appetite for something sweet so I bought a slice of a strawberry shortcake from here. It was like taking a bite of heavenly goodness! It's not overwhelmingly sweet or heavy, like how most places make their cakes. The cake was incredibly light and the strawberries took center stage in the flavor department. It was so good that I ended up buying a whole cake! The only downside is that the baked goods are pricey; however, they are worth every penny! Besides, its good to treat yourself every now and then.", "author": "Paulamertha A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-11", "description": "After leaving Nippon - Ya, we veered toward Andersen Bakery, because my sister loves their custard bread (small loaf of french bread, sliced in half and filled with custard) and several of their cheese loafs (rounds of bread, baked with pieces of pesto cheese on top).\n\nI'm not much of a pastry or cake indulger.  Only because I'm a little finicky with my sweets (I prefer the heavy use of butter and cream, so more inclined toward French cakes and pastries) Japanese cakes lack the heavy use of dairy and butter, so its a mild sugary sensation.  My sister loves their little tarts topped with fresh berries, as well as their mocha chocolate cakes.  These slices are around $3.00 each.  The custard bread was around $2.00, and apparently, prices had gone up.  \n\nIn addition cakes, they also carry pastries ranging from croissants to pinwheels, as well as muffins, danishes, and baked breads.\n\nThere is seating on the inside and the sales staff were helpful, all smiles, and quick.  We were out within a span of 10 minutes.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-05", "description": "While in town a few weeks ago, my sister and I decided to stop by and look at what goodies they had in store after we had lunch. Their Strawberry Shortcake caught our attention, so we ordered a slice to share. Apparently, one slice wasn't enough for the both of us. She ended up buying a whole cake, so we could take it home and indulge on the amazingly delicious, moist, yet light cake. Just thinking about it makes me want another slice!\n\nCustomer service was excellent! The man that helped the both of us was genuinely nice and had a smile on his face as he helped my sister and I. I definitely want to make another trip out to San Francisco to order another shortcake, but I would also like to try their Chocolate Ganache  and Dream Cakes. Anything that has chocolate in it, I'm sold!", "author": "Ardella O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-08", "description": "Their bread is really good. No Seriously. Try it. They have the pesto and cheese bread here but not at their  FIDI location. What is up with that? Eclairs were stellar too. I am addicted.", "author": "Lost B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-12", "description": "When I first saw this famous Japanese bakery in Japantown, I was excited, but I soon was disappointed when the product differed greatly from the stores in Hiroshima and Tokyo.  I used to be hooked on Andersen store in Roppongi.  It was in the same building as my office, so I used to go there twice a day, each day trying a new creation.  They had so many choices and each one was out of this world good.  If you have any plans to visit Tokyo, definitely go to Andersen.  I just don't understand why they decided to drop 90% of the creations when they came to the U.S.", "author": "トモ T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "Really delicious, fresh breads and pastries here. My personal favorites are the pizza bread and the jalapeno bread; both are large and have plenty of toppings, but aren't drowned in them and allow you to still enjoy the crisp bread itself. Their sandwiches are also delicious as well and don't skimp on the meat and fillings. They always have samples for you to try many of their various breads and pastries. Everything here is reasonably priced and I feel you get good quality for what you pay. This particular location always has a line, so just be prepared to wait a while.", "author": "Angela M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "A lot of variety of baked goods.  Everything looked great and was very fresh.  We bought some of the cheese breads To Go.  Had a chocolate croissant that was flaky and soft with a good cup of organic coffee.", "author": "Mary V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "Weak-willed people like me should not be allowed within 1000 feet of this place :(  You'll want to buy everything because it all looks so good.  I've had many items from here before, most notably the bacon and cheese roll, the tropical flan, the strawberry tart, the country sourdough, and the dream cake, and the stuff I get is usually great.  The sweets aren't too sweet - not overly sugared American-style sweets, but more like a subtle, perfect amount of sweetness such as Japanese or European pastries and desserts would taste.  This is a good thing :)  I also love how super friendly and helpful the staff is - always smiling and patient when you're trying to figure out which three of the ten tantalizing things you're considering purchasing you'll actually end up buying.  Not much seating inside, but the stuff is small enough to take with you and eat on the go anyways. \n \nI'd go here every day if I lived nearby :/", "author": "Irene W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-14", "description": "The pastries are decent and decently priced. Not the best I've ever had, but the chocolate croissant was still pretty darn good.", "author": "Mage L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-08", "description": "Stopped by for a ham and cheese croissant. Looked delicious. The trainee puts it on a plate that has a good size piece of wilted lettuce stick to it. Obviously it's a dirty plate. When I pointed it out to him, he pulled it off with the same tongs he's using to grab the pastries. And then puts my croissant back on the plate!!!!  I have to tell him it's unsanitary and to change out the plate, which he does. The tongs get reused. \n\n\nGood food. Questionable sanitary techniques at the front counter.", "author": "Jeffrey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-13", "description": "3.3/5 i love asian bakeries\n\nit's not necessarily a stand-apart from other asian bakeries, but i love them so. after a nice sushi dinner, it's nice to pick up a pastry on your way out of the mall, or stash a few for later when you get the munchies!", "author": "Alvin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-30", "description": "QUINTESSENTIAL JAPANESE BAKERY\n\nIn addition to everything American, the Japanese also have a fascination with everything French.  And they bring it into their culture, mix it up with a pair of chopsticks, roll it up in a bamboo mat and deliver it Japanese-style,\n\nThis bakery is kinda French, but it has definite Japanese sensibilities. Nonetheless, the goods are delicious! My favs are the plain old white bread...it looks like a loaf of Wonder Bread, but the texture is slightly chewy with a nice yeasty aroma when toasted.  Good french breads -- not your crusty Artisian style like a La Brea, but toothsome and flavorful.\n\nTheir pastries are rich yet delicate and not overly sweet.\n\nEat, eat and be merry.", "author": "Rita S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-27", "description": "Five stars for the Creme Brulee. It's far more satisfying than most $9 restaurant versions. Everything else is not valuated in this review.\n\nOrder the Creme Brulee and that will be all that is needed. \n\nThe fruit cup w/ flan/custard is watery and lacks sweetness, caramel flavor, and flan flavor.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-30", "description": "I get the jalapeno cheese roll all the time.  It's the best!  Cheesy, crispy and hot.  It's always cooked to perfection.\n\nI've tried the pesto roll and their chicken salad sandwich.  Both are good.  The chicken salad sandwich was a fresh and tasty surprise.  Nothing is as good as the jalapeno roll though.  I could eat them every day.", "author": "Brian K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-21", "description": "Andersen's farmers chicken salad sandwich on PDC bread is really yummy. Love their creamy frebch too.", "author": "Hazel M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-18", "description": "The jalapeno/cheese bread is good and so is the cream filled bread. Sadly, that's the only thing that I like here. The creme brulee I had before was really gross. And I didn't care for the pesto bread either. If I was just judging the jalapeno and cream bread, the re would be more stars for sure.", "author": "Kay S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-30", "description": "I'm always sad when I'm hungry two hours after I finish my lunch...which is what happened after my lunch at Andersen Bakery.\n\nI ordered the chicken and avocado sandwich - sounded tasty to me!  When I got back to my desk at work, I eagerly unwrapped my sandwich to find a big mound of bread.  I literally had a triple decker...of bread...oh wait, was that a piece of meat in there....oh, and is that a piece of avocado...??  My microscopic portions of sandwich toppings were really disappointing.  I was so puzzled, I showed my sandwich to my co-worker (who ordered the same type of sandwich); he was also puzzled because our sandwiches looked nothing alike.  Needless to say my bread sandwich was very unsatisfying.\n\nThough I didn't get it on this trip, I do love that International Cheese bread.  Delicious...", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "Awesome Japanese pastry with great price.. new product puff pastry is very good...  had cappuccino cake ... and coffee...  all great to my surprise", "author": "Sam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-24", "description": "THE place to get yummy, fatty Japanese breads : D\n\nAndersen Bakery is a famous bakery in Tokyo.  I grew up eating breads and cakes from them.  Asian breads tend to be silky and fluffy, and a simple loaf of sandwich bread would contain more milk/butter/flour/yeast=more calories/fat than a typical sandwich bread you might find at a grocery store here in USA.  But how can we say no to that, it's just too good!  My preference for breads have always been in the order of 1) Japanese breads 2) French breads and artisan bakery breads 3) Make my own 4) American generic breads.\n\nI usually get a half or full loaf of white pullman bread, thick sliced, and a loaf of raisin bread, and store them in my freezer.  They make great toasts, sandwiches, french toasts, and \"honey toast\" (Japanese dessert where you sautee cubes of bread in butter until crispy on all surfaces, then drizzling honey on top).  I also get chocolate croissants for my husband and blueberry pastries for myself.  \n\nI also love that they are a convenient, light snack/brunch dine-in option too.  They serve basic coffee/teas, plus a few bottled drinks, and ready made (but nonetheless quite fresh tasting) sandwiches, cakes, custard flans, eclairs, and recently started offering a couple of kinds of soups too.\n\nMy favorite dine-in option is their soup and sandwich combo.   For $6.50, you get a small cup of your choice of soup (I get their clam chowder), and you get to pick a sandwich from their selections (I love their chicken salad sandwich.  You can usually choose from plain white bread and raisin bread. I prefer the raisin bread, as the sweetness of raisins go well with the chicken salad)   I often get this for a light, quick brunch... portion is not as filling as a typical, heavy American breakfast of eggs, sausage & potatoes with bread, but my stomach usually takes a while to \"wake up\" in the morning so often times this lighter portion suits me better.  It's not going to weigh you down, but it's filling enough to keep you happy for a few hours until lunch or snack time.  \n\nI sometimes get earl grey tea with it too, but because the soup is piping hot, lately I've been just getting self-serve free water that's set up by the sit down area.  \n\nIn a city where there's lots of good food but most of them are pretty pricey, their price point and convenience is a great find! And they're yummy too.  Perfect!", "author": "Sascha O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-25", "description": "Their creamy french is the best.  Love it.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-01", "description": "I bought the creme brullee....I've had better, the custard was good but they failed on the sugar coating.  I also bought some walnut bread with cream cheese, those were very good.", "author": "Josie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-16", "description": "I've never tried their cakes but from the looks of other people's reviews this place might be better for that. I've come by a few times to get their sweetbread, and the texture was just not what I consider as outstanding. Still not sure which part of their baked goods are considered French, but my blueberry cheese bun was a little heavier on the dough with no filling, and lighter on the spread of cream cheese and blueberry on top.  This was similar to my experience with the an pan which I thought was not mind blowing or enough to cause a riot. Since they each cost about $1.75-ish I thought the price was pretty high. Service was friendly and thoughtful as they microwaved my order so I can taste their best. I'm not sure if they would receive a similar high rating if it's not located in Jtown, and by the end of the day their pastries just didn't look good at all. Three stars for my experience.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-06", "description": "Yummy pastries and hot delicious soup!  They had a light sandwich and soup special for $6.50 right now.  I got the turkey sandwich and clam chowder which were delicious.  Their desserts isn't overly sweet like many other places, and they are reasonably priced.  The raspberry cream cheese danish was sooo good!  Its texture was just like a croissant, flaky and delicious!  They would have gotten five stars, but there's no refills on drinks and there was also no condiments available.  I like having some mayo in my sandwiches.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-25", "description": "Turkey pepper jack sandwich: good. Interesting: halves were wrapped individually.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-24", "description": "I still have wonderful memories of my dad bringing home bread and dream cakes from this particular location.  I think the dream cake is completely divine.  Chocolaty, but not heavy, since it uses whipped cream for the frosting.  It uses cocoa powder in the cake itself, vs. chocolate, so less fat is added in.\n\nI am also a tremendous fan of the Japanese bread here. It makes the best grilled cheese sandwiches on the planet.  It's not cheap, but to be honest, the price of wonderbread keeps rising, so at the end of the day, I'd rather have really good bread for a few cents more a slice than the processed stuff.", "author": "Erin O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-18", "description": "consistently decent 3.5 stars\n\ni have tried their strawberry shortcake here, its decent, the cake is light and fluffy but their whipped cream sometimes feels like theirs too much. i love their flan with mixed fruits....its not too sweet and its a nice touch with the fruits with it. \n\nall their cakes look yummy, i want to go back and try more", "author": "Stella J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-25", "description": "Mmmmmmm.\n\nThe price is right for a snack, and everything I had was fabulous.  We went there twice in two days for mid-shopping snacks and got the \"International roll\" (a basic roll with cheese melted on, and pesto I think) some basic rolls, and creme brulee along with coffee.\n\nThe creme brulee was surprisingly yummy, very decadent, and around $3 if I remember correctly.  The coffee was also surprisingly good, as bakeries frequently overlook that.  \n\nService was also prompt and friendly.  When they ran out of coffee, the girl at the counter replaced it immediately!  \n\nI really wish there was one of these where I live!", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-08", "description": "Oh my, creamy French baguette.\n\nBeing an Andersen virgin, I decided to throw it all out the door this morning when my hunger and lack of breakfast items in my cupboard took over and drove itself to Andersen\n\nThree words:  creamy French baguette.  It's a fresh loaf of French baguette filled with a very light, mild vanilla custard.  At first I didn't know that there was custard in the baguette (I just figured that 'creamy' referred to the texture of the bread being very soft) and it took me by surprise at first.  After eating the whole loaf, I decided that it's on my list of favorite things to consume.\n\nI also scarfed down a chocolate European cupcake, which is pretty much like a very almond-y cupcake sans frosting, but with chocolate chips on top.  Light, moist, super delicious as well.\n\nI'm in the process of finishing up my chocolate croissant and raspberry cream cheese strudel, but I can tell you that the 5-star rating still stands.\n\nThis is my new favorite place to go for some guilty breakfast pleasures.  Ooh, I'm cheating on my diet..", "author": "Tori S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "It's not a cheap loaf of bread (the half loaf of white pullman bread goes for $3.50), but it definitely is delicious!  I sometimes make a run over to Jtown specifically to pick up a half loaf.  I'm a crust girl, and so I just love how the crust on this bread is thick but not crunchy-- just the right amount of chewiness and carby goodness.  And the white insides of the bread?  SUPER soft, a little savory, and just perfect for making a great sandwich (or, if you're like me, for chomping on when you have a hankering for filling 200% of your carb quotient of the day :D  I can't help myself-- I love myself some carbs-- esp bread!).  Honestly, a couple slices of avocado and some soy sauce or salt spread generously over a browned slice of this bread?  Good lord, I am salivating now thinking about it . . .  :D\n\nI haven't ordered their other breads and buns specifically, but I've tried the samples, and they're all pretty good, standard Japanese breads (or, at least, the Japanese take on European-style pastries).  Tasty, and worth it if you want a good snack.", "author": "Jeanne Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-16", "description": "Their pastries are pretty good, but seems a bit too thin! Not that pricey, and feels good to treat myself here when I'm in Japantown.", "author": "Soo Jung R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-08", "description": "Awesome quiet little bakery that also made a bomb chai latte. Perfect for waking up in Morro Bay", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-05", "description": "Good bread!  i usually get the ham and cheese croissant, anpan and the iced tea.  bf and i like it here a lot.", "author": "R F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-25", "description": "A great bakery that really takes me back to Japan :)\n\nTheir fluffy fresh-baked thick toast is juuuust how I have it in Japan! I always stop by here to either buy that or the raisin bread. \n\nTheir cakes are very delicious and just how all the patisseries in Japan make 'em :) \nTheir strawberry shortcakes are the best, though I looove the fruit tarts and chocolate cakes as well.", "author": "Saori E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-10", "description": "Mmm, pastries. \n\nIt's another Asian-Euro type of bakery. Cool, whatever. \n\nI love croissants. If they can do something different with a croissant (that I like), even better. \n\nThey put red bean in one. RED BEAN PASTE WITH RED BEAN BITS. \n\nIt was delicious. Soft, fluffy, ethereal croissant with dense, sweet-but-not-too-sweet red bean. YUM. \n\nAnd I didn't know this, but Anderson and Grain D'or are one and the same company? Go figure.", "author": "Ingrid C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-27", "description": "SQUARE WHITE BREAD LOAVES. for your Japanese \"sando\" needs. For $7.\n\nEverything else is shit.", "author": "Y K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-03", "description": "Walks by Andersen Bakery.\n\nMy Stomach:  Grrrr rraarrrarrrrr\n\nMy eyes: (Googles over the cake)\n\nMy mouth: (Drooling)\n\nMy conscience: (Don't do it!)\n\nMy stomach: (Screw that!  Feed me!  Try it!  You're going to work it off later at the gym!)\n\nMe: \"Can I get a slice of the Dream Cake?\"\n\nMy eyes: (Wanders and sees pound cake)\n\nMe: \"And a loaf of pound cake, please.\"\n\nMy eyes: (Sees cinnamon bread up top!)\n\nMe: \"Oh, and a loaf of cinnamon bread.  That will be all.\"\n\nMy butt and thighs: (Oh, great.  We're going to be sore for the next few days from the gym!)\n\nThat should sum up my experience at Andersen Bakery.  This Anderson Bakery located in Japan Town is EVIL.  They make the stuff look good and they taste good too.  The Dream Cake is so light and fluffy that each bite makes you feel like you're slowly floating up in mid-air....as if you're flying in a dream!  The pound cake is equally as yummy.  But the cinnamon bread was okay.  It wasn't as gooey as I thought it would be.", "author": "Winnie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-12", "description": "Creamy French, Salt Stick and soup - yum! Chicken salad on raisin was amazingly yummy, their bread is so soft, sweet service.", "author": "Free L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-07", "description": "The pastries tasted old and weak. Like they've been left out or something.\n\nAnd by golly, who adds pepper into a blueberry cheese bun thing!? Why would u add pepper into a pastry?!?! It doesnt make sense..\n\nI am not coming here no more, I dont want to risk soiling my taste buds on pastry buns that basically suck~ -_-", "author": "phillip w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-20", "description": "I would have given a one star, but the bakery goods aren't bad.  Ordered a turkey sandwich, and was truly amazed how any one would have the nerve selling a pre-made (ala roach coach) with one slice of meat, and then charge $7.  I've had a better sandwiches out of a vending machine.\n\nDo yourself a favor, don't order any sandwiches.  I went to Honey Baked Ham on the following day, and I could have made 10 Andersen's sandwiches with the amount of meat Honey Baked Ham provided.", "author": "Ed D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-26", "description": "Bakery chains aren't my thing...like I can't stand Sheng Kee. I like the real thing where they make everything on site like Ambrosia and Mazzettis. \n\nThat said, Andersen churns out quality baked morsels that are worth ignoring what I just said. Everything looked positively yummy. We only had room for pastries and bread, and both were quite lovely. Sweet and savory...they have it all. There's one at Serramonte too.", "author": "Virg Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-20", "description": "loved their creamy french bread! the cashiers were very patient in answering the questions i had about the food there. i enjoyed my experience at andersen!", "author": "Louis O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-09", "description": "The BEST Apple Raisin Bread I've had.  And it was only $2.25 for a half loaf.  Small raisins throughout, big chunks of apples at the bottom.  The crust was soft and chewy.  And the inside felt like I was eating a pillowy marshmallow!  \n\nToo bad I rarely come to Japantown but dang that was good bread.", "author": "J T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "The uninitiated might find having a good European bakery in the middle of Japantown as incongruous. In actuality, good European bakeries are just about in every Japanese town with Andersen's being one of the most popular chains. When I took my French cousin to one in my Tokyo neighborhood to buy a baguette, he paid the place the highest compliment possible coming from a Frenchman, \"they wouldn't go out of business if they were in Paris.\"\n\nI regularly pick up a loaf of their unique sourdough whole wheat bread whenever I happen to pass by. Their European style danishes are decent. Last but not least, they have the perfect marriage of East meets West, anpan!", "author": "David P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-09", "description": "Sometimes I feel like giving in and getting a treat after a huge bowl of noodles and an hour of wandering around the Japanese bookstore, but rarely.  I've been known to get the cheese danish, but the truth is, it freaks me out that all their pastries are laying out like people on a beach, exposed. So exposed. To oxygen and germs and flies. I saw a couple flies in there once, dancing and frolicking across raisins and glazed over pastries and whatever else was in there. Do you know what flies do??? Exactly.", "author": "Natasha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-11", "description": "I was impressed, happy and wanted more...;) Their crme brule was perfect and the fresh blueberry tart --- yum! It's not easy to get my yum vote, but Andersen Bakery you are on my mind!!!\n\nHighly recommended if you are a mozzarella fan their sandwich with FRESH MOZZARELLA & EGGPLANT...\n\nWhen is next lunch break?!!", "author": "Katja S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-22", "description": "I'm so glad they added a location here as I really love their Pisano and Pesto bread. It's conveniently located near my mom's place and used to be a place I would go for lunch before heading to work. Try the turkey sandwich on sour dough..it's got CUCUMBERS in it. It's not made on site, but gets delivered daily as do their other sandwiches. Come early as the sandwiches usually go by noon. Also try the Cappuccino cake, which my mom had to request that they bring back. It's very similar in taste to a Tiramisu. *Drools* And the breads they have are always very fresh, again get their EARLY! Another note is that the lady who owns it tends to remember you after a few times and usually knows what you want right away. They've also been known to stay open a little past normal hours if their are people still interested.", "author": "Petra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-04", "description": "i must admit i was a teensy disappointed at the variety and quality of what was offered at this Andersen's Bakery in J-Town.  Only bc I've been to the ones in Japan do I know what they're capable of....and those were delightfully delicious. Anyway, even though the variety is not as impressive, the strawberry and raspberry criossants and rolls I've had are both REALLY good.  Their garlic french bread is also very delicious.  I could munch on one all day.\n\nTheir locations in Union City and Great Mall in Milpitas are bigger, and offer a slightly larger inventory of things.  But their cakes look heavenly, and their express sandwiches (I had the chicken salad one) for grab-n-go aren't too shabby either.  \n\nNice place to satiate my carb cravings, but oh how I wish more of what they offer in Japan could also be offered here :'(", "author": "Peggy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-21", "description": "Disregard anything if it is not the square premium white loaf bread that Andersen's perfectly bakes for my belly.\n\nActually, I haven't tried much else, and what else I have had have been quite good, but everything pales in comparison to this ambrosial lump of dough perfectly manipulated into a cube, then sliced to your desired degree of thickness.\n\nAs Korea tries to do everything that the Japanese do, I remember eating sandwiches my mom used to make for me as a child on this kind of bread. It's divine, harnessing a moist, feather-light, spongy, silky, stretchy texture that is inimitable and incomparable. Plus, the crust doesn't have any of that unpleasant cardboardy bitterness that some breads have. Wonder, eat your heart out.\n\nYou'll never go back to plain white bread after you've had this stuff.", "author": "Nuri K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-06", "description": "one of my favorite bakery shop in city.\nlove their creamy french and almond croissant.\nalso cappuccino b-day cake.. love to stop by when I am in japan town.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-11", "description": "I usually visit this bakery inside Kintetsu Mall in J Town when I am in the area.  I like the flakiness of the dough on the fruit pastries or danishes and particularly on the blueberry pastry and strawberry pastry there is a nice amount of fruit topping.  Not so on the dark cherry pastry or the apricot danish where you only get a little fruit.  I like the international cheese bread here also.  On occasion I've purchased the strawberry shortcake slices also.  It's not as good as the ones served up at Junior's in New York City, but it's good.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-12", "description": "An Pan. Say it with me... An... Pan. So simple and so delicious. Bread, mushed up sweet beans. A couple of sesame seeds. Ahhh, harmonious. And the an pan here it top notch.\n\nThe other baked goods look delicious and likely are, if the an pan is any indicator. Maybe some other time.\n\nEDIT 9/30/2007:\nSo I had breakfast at the one in Ueno Station today (or Yesterday) and I have to say the one here does compare favorably. I mean, there was no an pan at the one in Tokyo. Is an pan too low brow?", "author": "neil c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-04", "description": "http://www.andersenbakery.com/index.php\r\nIn the Kintetsu Mall, across from Mikado Kid's corner, http://www.yelp.com/biz/wsUIuY6l4yTICAwrQGlSNA you just park underground of the Japantown  parking lot, use the elevator to go upstairs, turn left when you exit and you will see the Bakery.  It is tiny, a little storefront and there is seating with benches and tables next to it.\r\nFrench pastries, danishes and breads.  The fave Japanese desserts of strawberry shortcake, compote cake and chocolate dream cake.  Cakes are also sold by the slices so you try all different kinds.  They also have that Japanese bread, it is white and square shaped wrapped in cellophane, would always crack me up when I would see it.  The breadpans in Japan must look different their ours!\r\nSo on my way down to the car, I pick up a box of desserts for home.", "author": "Deb N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-31", "description": "The aroma from the bakery will capture your senses when approaching the area....bought the raisin bread roll for $1.80 and it was delicious. I noticed that they sell hot cross buns too, reminds me of childhood story books which feature these buns! Awww.....\n\nJust realized that Yelpers have been raving about the sandwiches too. Hmm, will be back the next time to try them out!", "author": "Yan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-03", "description": "I love all of their items: pesto bread, croissants, filled croissants, shokupan, raisin bread and cheese bread.\n\nWhen I was young (and it was called Grain D'or) My mom used to always buy raisin bread when it was fresh out of the oven so visiting it now brings back some great memories. I wish they still had the chocolate swirl bread though!!!", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-14", "description": "I like the \"French cream\". \nBut last time when I got one, \nthere is only little bit cream. \nThey raised the price and less cream!! \n\nWHY!!!!!? \n\nAnd now they don't have the cheesecake. \nSo I don't go back again!!", "author": "Ken N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-04", "description": "Every time I'm in J-Town, I stop by this place for my cream cheese walnut bread.  My absolute favorite here.  It's hard to resist everything else because they all look so good, but I always end up getting that.", "author": "Lucky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-04", "description": "Ahh Andersen Bakery,  splendid quality oishii european bakery! I am pleased to find this bakery here, since I missed the one back in Japan (& it is a huge hit there!). The goods are delicious, and not too sweet (which I like, because I'm not a fan of the extremely sweet stuff!). They have desserts, breads, muffins, pastries, etc. I recommend the flan, cream puffs, & raisin bread! All mmm mmm good! \n\nAll the items are well crafted and displayed for your overconsumption of baked goods! Great for a midday snack, dessert, or even breakfast (hey there's no law against startin your day off with a cream puff)! \n\nThe people are usually friendly, and prompt in helping you. The prices are reasonable and the location has a tiny place with a few tables. It is usually clean and a good place to scarf down your food!  \n\nThanks Andersen...of course I'm coming back!", "author": "Catherine O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-22", "description": "Quality and selection of baked goods was great here my only gripe is that they're not open early enough for an early riser like me.  Super friendly service as well.", "author": "shawn g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-06", "description": "Andersen Bakery is the perfect stop and go!  \n\nAndersen Bakery looks very simple and sleek.  It's adjacent to the Galleria Plaza Hotel. \n\nI ordered a small coffee and the seasonal pumpkin cookies.  Coffee is fresh.  Prices are reasonable.  Service is friendly.", "author": "Camille K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "I think I've taken this bakery for granted. I almost love everything from here, especially the cream cheese walnut bread. Once in a while I'll buy the thick cut toast from them because I love how tender the bread is and how distinct the butter taste is. They keep really well in the freezer and when it's time to have them, just put it out to thaw naturally for a few hours, and it's good as new. Their dream cake and creme brule are magnificent too. Try to come in as early in the day as possible, as these things get sold out fast!", "author": "Rika P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-24", "description": "If all you want is your standard bakery, no better than Safeway or any other supermarket bakery, then go here especially if you like paying 1 1/2 times as much as you would there, because that is what you are going to walk out with. Bread that is stale by lunch time. Pastries aren't flaky at all - instead they have some type of sour cream cheese with jam on them and are dense. If you are a Dane like me, you will be extra disappointed as I was. Seems the Japanese founder went to Denmark, remembered what he liked and started baking them at Andersen in Japan. That has now expanded here. As a Dane who grew up loving the real flaky pastries with custard on them, the fresh soft french breads and rolls, the poppy seed rolls with a little bit of marcipan inside, on and on, you will leave without buying anything. I felt generous and did. I think the Japanese founder forgot a lot of details on that long trip back to Japan from Denmark. Namely how to really make good danish bakery items.\n\nIf you have time and really want the authentic stuff, go to the burbs... to Burlingame and Copenhagen Bakery. If you don't care and/or are not from Denmark, then feast yourself on the average gore at this place.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-15", "description": "I first tried Anderson's because they were offering free samples as I was walking through Jtown.  I tried the french bread with the cream inside and have been a fan of their pastries ever since.  \n\nMy favorite is the raspberry cream danish.  I crave it about once a week.  Their regular white bread is great for toast, and their sandwiches are pretty good.  I've been back regularly and haven't been disappointed with anything I've tried.", "author": "Ben D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-25", "description": "Came here on the way to some sightseeing, Japantown - husband visited Japan and loves the culture so it seemed appropriate.  He likened the mall to what he would see in Japan and was excited.  Funny to know that one of the busiest bakeries is a European bakery.  Still splendid though.  Cream Cheese croissant and the walnut cheese croissant were delish.  Chocolate croissant, not so much though - a bit hard and had a lump of dark chocolate in the middle.  I didn't eat it and that stuff is my favorite.  Good coffee.\n\nThe blueberry and the strawberry tarts looked heavenly, I wish I tried those too...", "author": "Lily P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-21", "description": "First time tried this bakery store.  I had sunrise bun (similar to chinese pineapple bun),   But sunrise bun its really good. \nNext time,  I'll try some pastries.  BTW taste better than their next door cupcake, its OVERRATED and pricey.", "author": "food lover t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-11", "description": "Tasty cinnamon bread. Not too sweet. Perfect toasted with a little butter. I buy a loaf whenever I'm in the area.\n\nTheir christmas stolen is great, too. I brought a loaf into the office and it dissappeared in minutes.", "author": "Pat T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-15", "description": "Creamy French!! Creamy French!!\n\n(If you go buy the Creamy French loaves, I WILL track you down and steal your newly-purchased bread for my own consumption!)\n\n5 stars for having tasty Creamy French loaves.\n-1 star for ALWAYS running out!!", "author": "Elle Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-19", "description": "A decent sandwich and some fair baked goods, but not Arizmendi.  It's chain bakery food and it's fine for what it is, but I like the unique little bakeries in the neighborhoods that make unique pastries and breads.  This place won't have that.  But if you want a ham sandwich, you'll find a good one here.  \n\nDon't try coming here during lunch hours.  It's packed and the line gets annoying.", "author": "Honey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-29", "description": "Yakitate Japan style, I love this bread!\nA little bit $$, but pretty good bread. \nRaisin Apple Bread, so good.", "author": "Bai Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-21", "description": "The pesto bread, pizza bread, and jalapeno cheese bread are delicious. I think the pesto one is my favorite, just by a little bit. They've very nice and slice and warm the bread for me. The sourdough loaf is pretty good too!", "author": "Annie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-06", "description": "Everything here is so delicious and the ladies who peddle the baked goods are so, so nice.  I've never had anything bad here and believe you me, I've tried a lot of pastries.  I'm relatively thin but the size of my ass always gives me away.\n\nIf they had fancier coffees than just a cup'o'joe, I might just die.  Or at least shit myself.\n\nEDIT:  So, I nearly got hit by a car walking here a couple of weeks ago.  After the initial adrenaline rush, particularly considering that I kicked the fucker's door in, I continued on my way to get a nom nom pastry.  This place is THAT GOOD.", "author": "Frankie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-19", "description": "Very delicious cakes.  I love their Flan and strawberry tart. \nVery tasty pastries as well.  Anpan, croisant and oh, don't forget their creamy french!  \n\nI wish they served better coffee, tho.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-23", "description": "I got: \n\nCoffee: 1.50 self serve\nSaffron Raisin pastry: 1.95\nCranberry Walnut bread: 4.75.\n\nmy favorite: Creme Brulee\n\nI had just come out of eating some really good fried chicken at another restaurant inside the mall, so I just wanted to get a pastry and coffee to sit and read my book for a while. The pastry was ok. I later tried the bread, and it was amazing. I'm going to toast a piece and put some cheese on it for breakfast. \n\nMy roommate got me their creme brulee before, and it was amazing. while I was there people would just walk up and order four of them to go, and make sure to devour one before leaving. Definitely skipping lunch next time for that.", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-05", "description": "I was surprised....\nMe and a friend walked by, and I didn't think a mall bakery would be this good. We got a crem brulee and it turned out to be a very good crem brulee. It was chilled, which was a nice touch, plus it tells me that's sanitary, since its being kept bellow 41 degrees; the thin coating of caramelized sugar was just right, not too thin or thick, nor did it leave a burnt residual taste. The custard was nice and consistent, with a semi sweat taste that didn't need much assistance from the caramelized sugar from the top. \nWe went during the Cherry Blossom festival and had a sample of their english loaf bread; it was fresh and delicuous as well, with good consistancy and it wasn't too light.", "author": "R Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-07", "description": "Unless I missed a secret menu that is not on display or on paper at the register, this location doesn't have nearly as extensive a menu as the one on their website. For lunch there are only a handful of sandwiches. I ordered a turkey and avocado. It was fine, but unspectacular. Since there are lots of other lunch options nearby, I probably won't be back.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-29", "description": "I'd gladly feel fat for a day or two a month just to have their delectable pastry delights. Good thing I don't live near this place--I'd be one fat mofo mama. I especially love the almond croissants. Apparently their breads are really good but I can't get past eating the same things on every visit.", "author": "Barb B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-27", "description": "I have never set foot in this place but my boyfriend always brings me sandwiches from here and they are sooooo good! the bread is soft and the meat is freash carved. The turkey avocado on sourdough with mayo cant be beat.  I think Im drooling on the keyboard as we speak. I wish they would open one near my work!", "author": "M K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-02", "description": "Bought various pastries from this place on my weekend SF trip and was thoroughly happy with all that I got. Take your pick and you should be satisfied as well I think.", "author": "song c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "This place is inside the Kinokinuya shopping center.  I was looking forward to going to Andersen's bakery as I found out they were part of the same company that has Cafe Danmark in Shibuya in Tokyo, Japan.  Unfortunately they don't have the same offerings (like the katsu sandwich on fancy bread), but their stuff was still pretty good.  They mainly only had pasteries, and not so much other types of food.  I got the ham and cheese pastry, an pan (red bean bun), choco croissant, and a sweet bean paste pastry.", "author": "siutou s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-07", "description": "the best is the dream cake, strawberry shortcake, creme brulee, and the creamy french bread. The dream cake is like a dream!!!!! I come to Andersen's Bakery whenever I can and always buy the cake on a famiy member's birthday. It doesn't get 5 stars because I think it's a little expensive, but once you taste it, the flavor is so worth every penny!", "author": "Anne R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-26", "description": "The Cream french bread is fantastic. I will expect a little bit less red bean in those red bean bread, but it is still great, and every Japanese bakery tasting.", "author": "Carol X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-20", "description": "I love this addition to the little Japantown community.  They've got good pastries desserts, but I mainly go for their sandwiches.  They're cheap and yummy.  Turkey and swiss is my favorite.  The bread is usually very good...it's a walnut bread or something...although it's sometimes soggy if you buy at the end of the day.  Their coffee isn't half bad, either.  It's a well known chain, and I was happy to finally see it come to SF.  If you can't get yourself down to Clement Street and Schubert's Bakery, this is a good alternative.", "author": "Kristina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-17", "description": "This is a place to get fresh baked breads that aren't overly sweet.  French breads are decent.  I like the creme brulee, by far the best creme brulee I've had that wasn't in a fancy sit down restaurant.  You can taste a hint of rum and its rich velvety custard melts in your mouth.  While I like the breads, I'm a fan of the creme brulee.", "author": "Peachie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-23", "description": "The staff here went above and beyond. They were not open yet but noticed we were waiting outside and let us in early since we were only looking to buy pastries. To top it off the raspberry cream cheese pastry was awesome! I will make it a point to go here again when I visit San Francisco.Also the pesto bread we bough to take home was also delicious.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-13", "description": "I haven't tried everything here, but based on what I have eaten, I would bet no matter what you order, you're gonna like it. The palmiers are always delicious, as is the pesto cheese bread, both kinds of sandwiches, the anpan, and the cakes. I will usually come here after a meal if I don't have the cash needed for Cafe Hana. Two items will usually come out to just over $5 dollars, which is the minimum amount required to use your debit/credit card. ;)", "author": "M S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-05", "description": "this bakery is surprisingly delightful.\n\neven if you're full of mediocre sushi. nothing to wash the gross taste of eel right out of your mouth like a giant slice of strawberry shortcake & a carton of milk.\n\nmmm, delicious.", "author": "Irene S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-27", "description": "Jonesing for a little dessert after an evening in J-town led us to this chain bakery in the mall. Truth be told, we went to Sophie's Crepes first, but it was a chaotic zoo, so we wandered across the foot bridge to see if Andersen's was even open (which they were). The prices are really reasonable, but I was a little put off when the counter guy came around to ask us to hurry up and finish because they were closing in ten minutes (we were practically done, anyway), but did not ask the same of any of the other dining room patrons. Also, neither of us was very impressed with our selections -- the Bread Pudding was soggy and had a dollop of some unidentifiable fruit compote in its center, whereas the Dream Cake should be renamed Dry Cake. Maybe their many other offerings are better, but I can't see myself rushing back here for second chances after this lackluster demonstration of quality and service.", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-16", "description": "Perfect for a quick stop of snaking!  the bf ordered a cheese and garlic blossom thing and a cheese danish for me! :D  OMG so freaking good!! The danish was flaky and the cheese was perfect, man i want another one now.  The service was friendly and fast!", "author": "Hana .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-05", "description": "I love LOVE the creamy french from here!  They're so bad for you but at the same time they're just soooo goood! You have to get them early or sometimes they might run out later in the afternoon.", "author": "JenJen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-09", "description": "just got back from japan town and ordered 3 loafs of the creamy french bread and i am loving it. This is my favorite from there. yummmmmm. Oh yeah and it's only $2.00 per loaf.", "author": "zoey x."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-30", "description": "The workers here are nice and helpful. They have a variety of pastries and desserts that taste great. They have drinks and great snacks as well. They have some tables to sit and eat at, or you can eat at benches that are in the hall of the mall that are right by the bakery. Some of the pastries have cheese or meat in them.", "author": "DJ Guan Yu M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-06", "description": "The spandorour and danish creams are delicious. They got so many  variety of pastries, it's like breakfast in heaven~ I think that's another store located in the heart of downtown on market and Kearny st. But the one in japantown is cleaner and nicer.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-11", "description": "Bad day at the office? Have a cream puff! Not an overpowering sweetness but enough to mend any aches your daily stress may cause. Points for accepting credit cards and for the fact that the women on staff are always [sincerely] smiling.", "author": "Selina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-22", "description": "Really good chicken & provolone sandwiches!    The basil makes the sandwich!  I really shouldn't say anything because they already run out of them so early everyday.", "author": "K M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-18", "description": "\"Texas Toast\" is so much more appealing when you're at an Andersen's actually in Japan, and it's the closest to sandwich bread you can find. I can't say it doesn't warm my heart to see this little stand, but it does make me nostalgic for the two-story one in the Hiroshima plaza. Stateside, my stomach growls more for Sheng Kee's pork and taro buns than Danish by way of Japan.", "author": "Spratt M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-17", "description": "Friendly service. Small chocolate chip cookies are good. I recommended the cheesecake. Its my favourite cheesecake in SF so far... very light and smooth.", "author": "hime s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-10", "description": "Last Sunday was the first time I've been to this bakery. Its too bad we do not have this in San Diego.  My girlfriend suggested this place and raved about how I have to try the Jalapeno Cheese Bread.  She was totally right!  That is the best Jalapeno bread I've ever tasted.  We also tried the Cream Cheese Schnitten (austrian sweet bread with creamcheese filling) that was amazing.  Before my trip back to San Diego, I made the mistake of only purchasing 2 jalapeno breads and one of every flavor of cheese bread.  The pesto ranks 2nd and the international cheese 3rd.  The next time I'm up there, I'll make it a point to stock up on the Jalapeno Bread.  This place is a must see!", "author": "Kay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-21", "description": "They have different items than ACME or other breadshops. Andersen does loafs, Japanese style breads, and delicious pastries. Their large cheese pastry is humongous and really cheese-y.", "author": "Ryan Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-17", "description": "Good pasteries but it's no La  Farine or Tartine.", "author": "Jen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-05", "description": "This must be what Beard Papa is trying to do with their cream puffs.  If you think a great cream puff should be large, spongy, and generous on the custard, come here.  Skip the chocolate muffins which are dry, dry, tasteless, and dry.", "author": "CAKE E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-28", "description": "I went here by myself during a stroll through Japantown and I decided to give it a shot. I had a strawberry croissant which is basically a croissant with a few strawberries nestled in the middle of it, it rocked my socks. This place is fine to go by yourself or with one other person, but don't go with a group since the tables only have two chairs a piece. It isn't expensive at all, so give it a shot. I payed $3 for my strawberry croissant and a carton of milk. Definitely well worth it.", "author": "Clara M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-11", "description": "I like it!  Their strawberry tart was divine.  Sometimes I wish they would serve more savory things though, to prevent me from making ham and pineapple crepe mistakes around the corner.", "author": "Molasses C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-31", "description": "Ever since this bakery opened up in Jtown, I've been in love. Their pastries are addicting, especially their cream puffs and chocolate eclairs! Carb heaven!!!!!!", "author": "kristin e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-26", "description": "mmm carbs... i love carbs and bakeries...\nthis andersen bakery has some good pastries and breads and desserts", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-18", "description": "oishii!!!\nthe bread is fresh and damn soft. i believe this place is way better then sogo and sheng kee. we bought a fresh loaf of bread. they put the whole thin in a machine to cut their perfectly aligned thick slices.\n\nthe coffee also smelled really good...\n\ni haven't tried anything else here. i also did not know that this was an european bakery. i thought this thing was owned by japanese, but then again the name doesn't make sense. \nbe sure to give this place a try if your in japan town.", "author": "Eric Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-31", "description": "I reserve all my stars for the walnut cream cheese bread. It makes the world go round. Especially when paired with a double iced espresso from  Cafe Hana around the corner. Mmmmmmmmmm", "author": "Antoi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-07", "description": "I love this place..my favorite is the fruit flan..but all the pasteries are delicious!!!! It's worth the calorie and carb intake.", "author": "Chatree T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-17", "description": "Yummy pastries. Value premade sandwiches (4$). I love the white bread. It's so much better buying fresh than from Safeway. Get the thin sliced bread for thick sliced bread is toooooo thick for anything but french toast or fatty croutons.", "author": "Coco K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "you're good i like you, you have good bread. you're awesome. i like the ones with clam chowder though and also some chesse thing i dont recall from memory only recall from taste. i'll check. but you have coffee everything i need to survive this world of monster eatery and shopaholics.", "author": "Carolyn Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-05", "description": "This review applies only to their creamy French - a small baguette with a cream filling - because that's the only thing I ever bought from there. It's delicious. I can eat those things all day. They also have a wide selection of other pastries as well that looks very tempting. I hope this review does not encourage more people to get the creamy French, because they always run out of those things on me.", "author": "Shin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-26", "description": "Very nice pastries! I love their breads! Cakes are good, but I think their breads are superb. Their pastries are not overloaded with sugar like other bakeries do, but just about right! I love this place for fresh rolls and loaf of bread!", "author": "Julie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-25", "description": "mmm... Fresh cream puffs and strong coffee.", "author": "J F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-05", "description": "this place is alright. i had the cupcake with chocolate frosting. but the location is nice and it is the only american place in japan center.", "author": "neil r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-30", "description": "i came here once altho i'd pass by here many times. my girl and i had a little dessert in the noon time, we met up around here and we had some cheesecake, cakes, and breads. i really don't like their cheesecake for some reason, it tasted really weird. the cakes and bread was a bit better. i really like their designs and service was decent. the smell of this place, you can smell it from far away! i like the smell of bakery, because it's so bakery. lol!", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-22", "description": "but what i want to know is do they have the yummy green or red bean buns like they have in japan?", "author": "john f."}
