{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "Great Danish bakery and coffee house!  Was late afternoon so selection was lacking however what we had was super!", "author": "James M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-21", "description": "After eating breakfast at 9AM and missing lunch, I was famished and craving pastries at 3PM.\n\nAnd Andersen Bakery STILL wasn't satisfying or otherwise good at all.\n\nI got:\n-Berry Tart\n-Almond Croissant\n-Blueberry Kouign Amann\n-Cheese Danish\nFor $15\n\nThe berry tart was the best thing, but only because the fresh fruit. The tart filling was super bland and did not have a creamy, full-body texture. The crust was ok; it was thick and crumbly, but didn't have any buttery goodness.\n\nThe almond croissant and cheese danish were both meh. Neither were flaky / airy. Both were dense pastries and the fillings for both were negligible.\n\nThe blueberry kouign amann was the worst thing we got. It had this overly thick, syrupy casing of sugar and nuts on the bottom side of the pastry. I get that kouign amanns are supposed have caramelized sugar but this amber casing of syrup would protect the pastry well into the 22nd century. The pastry was meh and the blueberry part of this was a sad spread of jam in the middle.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-10", "description": "Nothing extraordinary here. Just a run of the mill bakery. I had a croissant and a blue berry muffin. They give it to you all cold and nothing warm.", "author": "Rian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "Lovely bakery with a great selection of sweet and savory goodies. Friendly staff. Space is large with lots of seatings. Got the passion fruit cruffin - a must try for passionfruit lovers! They have a new mango muffin and it's delicious too!", "author": "Weich Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "You can NEVER go wrong with Andersen!  I've convinced at least 3 of my coworkers of the goodness of this place.\n\nSimply put, I'm not a big fan of sandwiches, because I usually just want something plain / simple.  Andersen does this really well!  Their bread is so freshly made everyday, and the pastries are so worth the price.  I will never ever buy another cranberry walnut bread, especially if it's not from Andersen!  This bread, combined with half an avocado - like dang, my tastebuds are on fire!\n\nSecond, for SO SO SO LONG, the SF Andersen locations refused to honor the \"Sandwich/soup/salad combination\" they have at other Andersen locations!  Ridiculous, in my opinion.  But now that they DO honor it, I must say, I am at Andersen on a weekly basis.  Prices are good for a lunch meal in SF!\n\nI also really like this location.  It seems very central and is accessible off of the Montgomery Bart/Muni stop.  Lines do sometimes go out the door, but they move pretty fast. \n\nThe staff is also really friendly!  I'm starting to recognize a few of them just by going in so much. :)\n\nI hope this location continues to produce the quality standards I've been receiving so far!  I'm a fan of this location, the food, and the service.  Enough said.", "author": "Jana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-07", "description": "Place - it is in the 1 st floor of galleria building. Small place and few tables. On 3rd floor there are enough tables to sit and eat.\n\nTaste - always great bread! Most bread are good. My favorite one is cream cheese walut. If you ask to cut it, they will cut it. Drink is also good with bread. Cakes are also great. \n\nService and Price - service is nice and Price is really reasonable!", "author": "Da Won L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-22", "description": "Oh no! I usually love all things Andersen, from their pastries, breads, and even their coffee. Through the years, this brand has been nothing but good to me! \n\nI visited this location today, though, and was completely disappointed by my first bad experience with this chain. To be clear, customer service and cleanliness were completely fine- my only issue was with the quality of the food I ordered. \n\nI bought the matcha cruffin (that's croissant/muffin for you folks not yet on that hype) and thought it was one of the worst pastries I've had to date. It was incredibly dry and just tasted like a stale croissant. While it was labeled as a matcha cruffin, there was only a small teaspoon sized bit of matcha on the top, making it look like this thing was loaded with the stuff. After opening the cruffin, I saw that the other 95% was empty. \n\nNot only did I feel tricked by this dry, misleading matcha cruffin, I felt nauseous after. I have a pretty strong stomach and can isolate it to this darn thing because I didn't munch on anything else for the hours surrounding this visit. All in all, I don't think I'll be stopping by Andersen for a while, unless the Andersen team gives me a very good reason to. Until then, I'll stick to the delicious cruffins at Mr. Holmes instead!", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "I ordered the eggplant & mushroom on Champagne Bread & it was delicious. The clam chowder is also creamy and soft. It gets busy on lunch time but they manage to call your order in a matter of minutes.", "author": "Orlando F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "Affordable and decent sandwiches are hard to find in this part of the city. For under $8 you have a variety of options from mozzarella & eggplant to chicken & avocado sandwiches. Simple and hits the spot. Their bread is baked fresh daily and super delicious. Sometimes I buy a loaf of sourdough to take with me. \n\nSituated just inside the Crocker Galleria on the ground floor, it's conveniently located and easy to grab a sandwich during the Thursday farmers' market from 10am - 2pm. \n\nThe staff is always friendly and the line moves quickly. After you've stocked up on fruits and veggies at the farmers' market, swing by Andersen's on your way out to grab a bite that doesn't break the bank.", "author": "Shira W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "This is a little store front bakery in a somewhat open air mall.  They have a lot of delicious looking items to choose from but I ordered an Apple Danish with Coffee and a Tropical Flan. Everything was good - nothing totally exciting, but just what I wanted for a late breakfast.  I got there at 11:00 and the place was empty but 5-10 minutes later the line started building with most just grabbing something to go. It's very clean with more than a few tables and more out in the mall. the woman at the register was very nice. \nMy ticket total was $8.45.", "author": "Misc M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "This place is great for a quick grab and go!  I ordered a breakfast sandwich with sausage, egg and cheese.  Slipped away to pick up an espresso drink down the way and came back to pick up a nice steaming hot sandwich.  The bun was nice and warm (I like warm buns!) and the cheese was skirting the edges.  Got back to my desk and it was already cut in half to make my breakfast much easier to devour.  Almost went with the delicious looking Bacon Roll... next time!  \nDid I mention they have really good looking sweet pastries?!?", "author": "Aaron H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "The food is great but today I ordered a toasted bagel and cream cheese.  The bagel was very chewy as if they toasted it earlier and then popped it in the microwave to warm up.  I could barely see or taste the cream cheese.  Bagels are a treat I enjoy rarely because of the carbs so I was so disappointed.", "author": "Sharon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Sometimes,  you stumble upon places that surprise you... hopefully in a good way more often than not.  \nOn a recent Saturday afternoon, this center was packed with families and children, mostly looking for lunch options.  After having a $62.00 sushi boat meal, we agreed that it was probably a good idea to \"fill up\" on carbs here since it was just a few steps away.  After a quick study of their baked offerings on the right of the store, I selected two items to bring home. \n\nMy first choice was their ham and cheese croissant (https://www.yelp.com/user_local_photos?select=mQ1y1rbj96keub_h8gJqdA&userid=saJuyv784apZzH--psHZ3Q) which was filling and a generous size; just don't expect this version to be written up in a gourmet foods magazine as there is not as much butter and not a traditional French version.\n \nMy other selection was their blueberry kouign amann (https://www.yelp.com/user_local_photos?select=ItVLJtPVdiqTWNgxLNvPOQ&userid=saJuyv784apZzH--psHZ3Q) which is again generously portioned, easily 1.5 times larger than that California Street place or Starter's versions.  Again, not much finesse here, but you will be full on one of these.\n\nOur salesperson was patient and accommodating especially when we looked in our bag and learned we were given the wrong pastry because of an incorrect sign.\n\nYes, do come here for reasonably priced baked goods but don't expect gourmet magazine touting quality.  \n\nIt works.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "The staff were extremely friendly! Everything available looked amazing. I decided to get the apple caramel muffin- it was so moist and filling! I couldn't even finish it. The middle had apple slices which was delicious. My brother has been her many times and states that he loves everything he has tried. Even better than the muffin was the vanilla pound cake sample that I had. I didn't have room to carry it around but I am definitely going back before leaving the city to get myself a loaf!", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-15", "description": "Pro: girl at the counter was very nice. \n\nCon: pastry wasn't good (new almond raspberry croissant). Meh.", "author": "TheOne L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-22", "description": "Generally rude service: please feel free to ask me more details, came around 1:30 and the food was all that was left over, I do not know anything about how they work but I would think they can handle a late afternoon snake but nothing on the menu for protein  and serving size is not well though out for the price or maybe I'm being too picky for this place let me know. Chicken salad with raise bread.", "author": "J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Like the location, quiet with bunch of empty spaces Friday afternoon. I got cheese walnut cream bread instead of creamy french. It's so good and will definitely come back", "author": "Gue K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-24", "description": "I stumbled upon Anderson bakery while browsing the Farmer's market back in February. I needed to grab something for lunch and the menu looked like it offered solid sandwich options.\n\nI decided to get the Turkey and mozzarella sandwich ($7.25). Turkey breast, fresh mozzarella cheese, tomato, leaf lettuce, basil, mayonnaise on whole grain bread. I love caprese salads so I figured this was a reimagining in sandwich form. Unfortunately, the sandwich was just bland. With a caprese salad you have salt and olive oil to bring it together. This sandwich needed some salt and more mayo! I found it to be flavorless and dry. It was a shame since the ingredients were super fresh! They just needed something to bring them all together.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Their fruit roll cake was delicious-moist, not too sweet, fresh tasting. The server, a Japanese man named Hiro, was super nice and helpful. I recommend this place for cakes for parties and events! Also it was very affordable-the giant cake (7-10 servings) was only $25 and looked beautiful.", "author": "Crystal Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "Called Anderson customer service later in the day after this incident, after my blood pressure went down. Spoke to a very nice guy who was appalled by the non-service I received. He took down details and my contact info and said they'd be in touch.\n\nNext day, got a call from one of their managers. I was told that he had spoken to the person on the phone, and was going to later talk face-to-face about what sort of customer service they expect from their employees. \n\nI am very pleased with their response. As I said, I do like Anderson's products, and I'm glad that corporate is responsive to problems with their customer service.\n\nI'll leave my rating at a non-committal 3* until I see whether things have improved on my next visit to this store (never have had anything but good service with their other locations).", "author": "Bruce C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "Such a beautiful place, and friendly employees.\nMost of the time, I eat my breakfast there. I love their mango coconut pastry, it's really delicious.", "author": "Selamawit B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "$2.75 for a chocolate croissant, which tastes exactly like the one you can get in France in supermarkets for 2 bucks the dozen. \nDon't buy it.", "author": "Hadrien S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "Great place to get birthday cakes. We got a capochino cake for a coworker's birthday, and everyone in the office really enjoyed it. The cake was fresh, moist and simply delicious, oh and for such a reasonable price. We paid $22 for a 6\" round cake, whereas I couldn't find a cake with that quality in SF for less than $38. There were also very nice fruit roll cakes that perhaps will be our to-go option in our next visit.\nCertainly recommend this place!", "author": "Live H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "This is for the kouign amann and service in general. \n\nThe wait is almost nonexistent here, and the service friendly. \n\nThe kouign amann is sweet, delicate and slightly flavored with the scent of almond. There is a slight coating of butter and sugar which congeals into a crunchy, candy-like layer. Sweet but not cloying. \n\nThe bread here has a loose crumb and is not stretchy like tortillas. Not my favorite but decent.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Their pest bread runs out early so grab it if you see it. I always try not to finish the whole loaf in one sitting but always end up doing it anyway. For the sandwiches, I've only tried the chicken avocado and the farmers chicken. I like them so I'm sticking to them. I love the hint of lemon on the chicken avocado. And they pack the farmers chicken with lots of fresh ingredients. I always get it on their whole wheat bread and love it. Their danishes are never too overwhelmingly sweet. It being a Japanese owned bakery, and me being Japanese.. It satisfies MY tastebuds.", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-29", "description": "Incredible croissants, breads with pesto and jalapenos were excellent. Blueberry danish and muffin to die for. My only gripe is that they open at 9 which is late for my schedule.", "author": "Kelly D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "Although my regular white bread has been keeping its excellence for decades, I do not agree with their new 10 cents charge for SF Health Security Ordinance fee. \n\nThey have an eat-in corner, but they do not have a wait person to serve. When I asked why I have been charged 10 cents, a sales clerk couldn't explain to me nor gave me a receipt. I found out it when I got the receipt from other location.", "author": "Vicki S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "Amazing breakfast sandwich. The sausage egg and cheese on a french roll is simple but tasty. The ambiance is okay for it being an outdoor mall but the service is great as well as the pastries and the lunch menu.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-10", "description": "I cant seem to understand why such a wonderful business would allow such poor customer service.  I don't know if the staff are overworked, but the level of service that is being giving is less than perfect.  Coming from a retail background, I understand that fast pace environments can be challenging, but its important to at least acknowledge your customers waiting, sometimes as long as 20 minutes.  \n\nI am also surprised to see how much stuff they run out of by the afternoon.  If you see a trend, you should think about an increase in supply.  \n\nI no longer wish to return until something is done to correct this, and I think the brand is amazing with the selection of food choices.  I feel something should be done to change this location around.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-16", "description": "CARB SESSION\n(4 stars)\n\nI don't know why but I like eating BREAD. \n\n- Bread & Pastries, yum\n- Prices, affordable\n- Service, okay\n- Ambiance, small (no place to sit)\n\nWhen I'm at work and looking for something light because I have no clue what I want to eat and I don't have the appetite for anything around the neighborhood, I find myself here. It aint just a bread store.....\n\nHEFFER-STYLE STATUS.\n\nPISANO ($3.50) - always ask for it sliced. and when you ask for it sliced, ask for extra small slices/pieces otherwise they give you clunky pieces. many yrs ago they use to use the bread slicer but i'm not sure why and now they slice it manually. I always get the Pisano. Even though it looks ugly in its full form, when they slice it up to tiny bite size pieces it's like eating french bread with a hint of pizza. it's my little secret snack. everybody always asks me \"whats that\" and then when they try it they're like \"dang, what is that and where did you get it\". \n\nWill I be back? When i have those \"i'm craving something but i dont know what\" kind of moments.\n\nUntil the next review....", "author": "Jane A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-07", "description": "I stumbled upon Andersen Bakery while iPhone yelping...\nI was looking for something sweet...\nI ordered a single latte and an almond croissant...\n\nThe croissant was:\n-flaky\n-semi-sweet\n-average in terms of the moist-filling content\n\nThe latte was:\n-average\n-drinkable, but lacking in something\n\nThey have other tempting products.\nNice amount of seating outside the store.\nI'll stop by to try them out again.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "Easy to find: on the lower level, closest to Post street.\n\nLot's of pastries and breads here; located in an easy to find corner area.\nAnd they serve handmade sandwiches, starting at $6.75 for turkey breast sando.\n\nI always enjoy a quickie in the morning; and their nosh at a nice price fits the bill.\n\nTip: I know all of the tastey treats and scents are overwhelming and you may miss the little sign : Breakfast Special. \n It's just $3.50, your choice of pastry and a small cup of java. I like the croissants, and my Fav is the Twist with saffron and raisons, drizzled with icing.\n\nThey usually have a few tables outside with working heat lamps.", "author": "Bert K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-16", "description": "I love their tomato caprese sandwiches.  One thing that annoys me though is the tiny piece of pickle they throw in the bag with the sandwich.  It's a half of a quarter wedge...so an eighth of a pickle?  It looks silly!", "author": "Michael S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-30", "description": "I've only been here once, but I feel like I have enough info to post this one. I got a ham and cheese croissant for breakfast, and how I love french pastries! I was sooo excited, when the lady asked if I wanted it warmed up, \"Sure!\" I exclaimed. That is precisely when she threw a cold croissant into a bag and microwaved it. I've seen more empathy is an episode of Dexter. I cannot look at this place without shivering a bit. PLEASE warn your customers what you mean by \"warmed up\". \n\nAnyway the flavor reminded me of when I was a kid and I would microwave week-old Costco croissants on a Saturday morning (which seemed yummy at the time)...so yeah.....1 star.", "author": "Dylan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "Good selection of pastries and breads and the staff is VERY FRIENDLY.  They sell half loaves so you don't have to commit to a full one.  The bread with figs and pecans is fantastic.  I wish the coffee was a little better.", "author": "Heather R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-12", "description": "Super helpful staff, good cake price for area.\n\nAfter doing some neighborhood pricing research, I came in to buy a cake for my mom's birthday. $18 for a 6\" chocolate ganache cake. I was stuck for a bit between that and the dream cake, but the woman behind the counter advised me that while the dream cake is more popular, the ganache cake is tastier. Glad I followed her advice. The cake was like chocolate sponge cake layers with light cream in between, so overall not heavy at all, but A+ on taste. \n\nThe staff even was able to write \"Happy Birthday\" on top for me.", "author": "Ariel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-27", "description": "Andersen Bakery, you eluded me twice but 3rd time was a charm\n\nNo operating hours are posted anywhere so I called & was advised they open at 6am.  I'm thinking score as I'm an earlybird & get to work at an ungodly hour\n\n.....lies\n\n1st visit at 7:15am, all the shelves & counters are empty & the huge cart of breads has just been delivered.....plastic wrapping still enveloping the ginormous cart\n\n2nd visit at 7:30am, very few breads have been unloaded & huge cart still full of breads, blocking the entrance\n\n3rd visit at 11:15am, store completely stocked w/ bready & desserty temptations.....the world mine\n\nCreamy French is the choice & is indeed worth all the hype\n\nSuper sweet cream custard sits lovingly in a mini french baguette.  The plain bread is the perfect pairing to the sweet sweet custard.  Bread is soft & very chewy - hard to tear off bits ( like all good frenchies should be )\n\nThe custard stays in the bread but is not skimpy.....would totally get again\n\nI've had other cheesy breads from other Andersen & Grain 'Or locations so know those to be delish as well.....but will give this location's options a try & update.....as I'll def be needing another of those Creamy French!", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-08", "description": "I take my pastries very seriously. \n\nThat being said, I wasn't expecting much when I wandered in here looking for a mid-morning carb fix. But alas, I was hungry and the pastries looked fluffy...so I decided to go with the butter croissant. \n\nIt's decent, but nothing to write home about: A step above Costco. Perhaps the other pastries are better?\n\nOh tasty pastries, where art thou in the SF financial district?", "author": "Lauren W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "I've been going to Andersen Bakery since I was little. I used to always get the strawberry pastry until I graduated to eating the sandwich soup combo. I always order the turkey with fresh mozzarella. IT'S SO TASTY. Their tomato raviolini is also amazing! It's the perfect soup for a sick day or hot day... or any day. \n\nI'm a little sad that this specific location doesn't do the half soup/half sandwich combination deal so lunch can get a little pricey.  I don't mind so much through because it's that good. \n\nSometimes the service is super quick and sometimes it's ridiculously slow. You should plan accordingly when coming here.", "author": "Julia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "I was searching for a bakery in San Francisco during our family vacation. I desperately needed to find a birthday cake for my daughter's first birthday. I found Andersen Bakery and called to place the order. The woman was so helpful and pleasant. They were able to accommodate delivering the cake to my hotel with short notice. Their prices are reasonable and the cake was light, delicious, and adorable. They were even thoughtful enough to leave us utensils and cake plates with the delivery. Thank you so much for making my child's birthday so special.", "author": "Corinna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "CARBO LOAD!\n\nThis restaurant/bakery offers a wider variety of baked and bread goods at decent prices. The restaurant also offers lunch items such as a wide variety of signature sandwiches, salads, and soups. Perfect spot for a quick inexpensive lunch!\n\nFOOD:\nCalifornia Avocado Sandwich: 4 Stars- Well made sandwich on quality meat. It comes with basil which gives the sandwich an unique flavor- Above all else there's avocado! \n\nVegetable Soup: 3 Stars - Flavorful but it was a bit heavy for a vegetable soup. The soup comes with the usual vegetables such as cauliflower, carrots, peas, onions etc. \n\nShall be back for lunch and the DESSERTS of course!", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "It's a decent, chain kinda place...  Located inside the galleria, it's clean, has seating inside and the menu is straightforward.  \n\nSoups, sandwiches and salads here.  I had a seasonal salad with chicken, and my coworker had the turkey/mozz sando and tomato soup.  The salad was pretty big, overall fresh and tasty.  Coworker swears by the sando/soups there - didn't look like anything special.\n\nAnnoying thing is that their drink selection isn't visible - so I was like, \"do you have this?  or this?\"....which got lame fast.\n\nIt's a chain bakery spot, so I'm grading it as such.  Would it be a 4 compared to other awesome sandwich spots??  No....but for what it is, it's fine.  Not crazy overpriced but not cheap, clean inside, quick service and decent food.  \n\nI'll be back, but I wouldn't meet someone there for lunch or anything like that.", "author": "Arthur Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-10", "description": "Pastries are pretty good.  I usually get the almond croissant.\n\n1 star off: It's best that you come here early in the day to grab their fresh breads.  By the afternoon, there is usually only white bread left.  The bread loaves are pretty small.\n\n1 star off: Cakes need improvement.  They taste like they are from an instant mix.  When you dig in, you realize that the \"large\" cake slice is all but an illusion from the mounds of whip cream they piled on.  Tricky!", "author": "Ally W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-24", "description": "This is my new favorite place to grab breakfast :) everything is fresh. You should try oatmeal and almond cookie- it's delicious and very fresh . The place is super clean- I guess it's new. Hopefully they can maintain the cleanliness;) their croissant is really good too. I recommend this place for anyone who hasn't tried it.", "author": "Loraine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-22", "description": "Solid. This \"creamy French\" thing is not bad, despite sounding like something I would get in a dive bar bathroom in the Castro. Coffee is not amazing, but not awful, and better than in my hotel. Prices are within usual for this kind of place, and they actually have a reasonable AM special of $4 for your choice of pastry and coffee. It's a three and not a five because ultimately, this is a chain and it shows. It just doesn't have the ambiance of an independent bakery.", "author": "Alik W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-03", "description": "The attendants are quick and friendly. The food is not good at all and the background music is loud.", "author": "Carmencita S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-13", "description": "I used to love the chicken salad sandwich on a soft french bun, and I would frequent the Andersen's on Market at 1st.  This Andersen's is a disaster.  I am often waiting way too long for my sandwich, sometimes it's practically bread only, and today was the last straw.  The bread is so stale, I can't even bite into it.  Basically, it's inedible as a sandwich.  After at least 10 or more bad visits, I won't be returning.", "author": "Sue K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-08", "description": "I've been going to Grain D'Or (Andersen's previous incarnation)/Andersen on and off for years.  My first experience was the strawberry spandour (I think now it's called a strawberry pastry) at Serramonte.\n\nAnyhoo, so glad they opened this at the mall.  They still sell the same pastries but you gotta try their raisin bread.  It is so much better than the Sunmaid raisin/cinnamon ones you get at Safeway.  Kid like, Mom approved!", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-27", "description": "Not sure what standards people are judging these croissants by, but it's a highly delusional one. The almond croissants are WAY too bready. Like something you'd find at virtually any chain in the airport. This doesn't even make my top 20.\n\nIn fact, I don't even live in a major city and my local bakery makes an almond croissant that would make Andersen himself cry. Granted, it's also one of the best croissants I've ever had, period. And yes, that includes Paris and New York. But enough about better places that are too far away to do you any good.\n\nMy recommendation, walk around the corner to Bread & Cocoa. It's the real deal.", "author": "Ari H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-07", "description": "Decent sandwiches if you are looking for a quick lunch near union square/fidi. Recommend the turkey and avocado on sourdough.", "author": "Yasi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-26", "description": "I'm usually just grabbing a latte once a week or so (work across the street) so this review is for the coffee and the service.\n\nI'm not a coffee-snob but there latte's always hit the spot for me.  \n\nFriendly team, without exception.  I particularly like Michelle, I think it is, who is genuinely just a nice person.  Nice way to start the workday...", "author": "David P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-12", "description": "Things look great in the display case, then they warm up it up for you and it looks like it was stuck at the bottom of your backpack all day. Unappetizing.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-21", "description": "Their HQ in Hiroshima offers excellent bread and pastries and so does this US branch.  I like their Eclair with a hint of brandy in the cream.  It's not too sweet and is a bargain for $1.95.  If you have a chance to visit Hiroshima, try everything, particularly their Danish; certainly one of the best in the world.", "author": "Chris K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-03", "description": "This little bakery has delicious fig & pecan bread. I would definitely come back for the foccacia and cranberry & walnut bread since they were out of it when we arrived. The cinnamon raisin also looked amazing. They slice the bread if you ask and they also sell by half loaves which is nice. I think I will try their other location nearby in order to ensure they have what I want when I arrive. We were too late at 2:30pm on Tuesday for most of their selection. \n\nExcellent service!", "author": "Ali B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-05", "description": "I had the turkey avocado Swiss with their vegetable soup. \nI liked the sourdough bread on my sandwich. \nThe cheese was stale.\nThe service was rude and impatient.\nThey mixed up my order and gave me an attitude when 8 verified it.\nThen when I asked if they had condiments or salt/ pepper, my server just looked at me and asked me, \" what I meant?\" I think that is a pretty clear question. I would probably go back for the bread because this placed is a bakery. I will never dine here again.", "author": "Gin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "Good special...1/2 soup, salad or sandwich for $7.50. It was a nice, quiet place to have lunch away from the bustle of the financial district. Next time, I'd just get the salad as the combo was too much food...or I'd split it with someone.\n\nGreat value, calm surroundings. Great for a quick mental break.", "author": "Rosie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-23", "description": "Four stars is a little misleading.  I'm not necessarily a fan, but nonetheless, I found above average baked goods, pastries, and bread at  Andersen.  I think it's a better place to go for pastries than lunch (or pastries for lunch!).  The chicken salad croissant sandwich, though not memorable, was adequately satisfying.  Good clam chowder too, very creamy and served very hot, but the chunks had far more potatoes than clams.  Service was too slow and inefficient for a cafeteria style lunch.  A mild four for me.", "author": "Angel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "Love their hot chocolates on a cold SF day! Their pastries are BOMB.COM and very reasonable too.", "author": "Isadora Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-02", "description": "Ok, back to the 5 star experience. \nTried the creamy French today ..Perfection!!", "author": "P D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-27", "description": "The white loaf tastes just like bread in Japan.  \nStrawberry shortcake (not like US shortcake) taste just like cake in Japan too, just not as superb.\n\nPlease, don't charge me .11 cents for one little square of butter when I've just purchased 2 loaves of bread.  Company policy needs to change!", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-23", "description": "cake review only\n\nwe purchased a 6 inch ganache cake - essentially a chocolate moose cake that isn't too sweet or too chocolatey. OMG it was so good. i had a second slice and that never happens. i think this is the best chocolate cake i've had. as im writing this, i want another! \n\ni came in during the morning and they had 4 cakes - 2 ganache and 2 strawberry shortcake.. by the time i came in on a friday after lunch, only the 2 ganaches were left. so if you want more selection come earlier in the morning. it is also less busy then as well. they can hold the cake for you if you dont want to bring it in then \n\nonly thing is that they dont write anything on the cake for you :( oh well.. more room for candles!", "author": "Jen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-10", "description": "I ordered a sandwich and a mocha here.  Both were bad.  The sandwich was small and overpriced.  There was absolutely nothing special about the Turkey Swiss & Avocado at all --why $6.75?! The mocha tasted weird, which I couldn't really place my finger on why.  I had asked for non fat milk.  I'm not sure if it's because the barista made it with whole milk or she simply did not know how to make one.  In any case, I would never go back there for those items.  I would, however, go back for the sweet treats --they fantastic!", "author": "Anne S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-09", "description": "I like this place!\nIt's on my route from the bus stop to work.\nI usually get there sesame bagel with cream cheese to go.\nBagels there not as heavy as in any bagel place. And they don't spread cream cheese for you, i prefer when I can do it myself - I want to know how many calories I consume instead of just consuming it. :)\n$1.40 for my breakfast - not too bad :)\nI tried their brekfast panini as well - pretty good. And if you compare they are 15-20% cheaper than any other place in this area...\n\nThey also have breakfast special: cup of coffee and any pastry for $3.00", "author": "Anelya S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-13", "description": "If I could..  I would give no star for this place. Ive worked in the customer service field for nine years and knowing how situations should be handled this was a bit ridiculous. As I got to the counter I asked for the pastry I came there for and to my surprise the worker says to me \" oh I'm sorry... That's reserved for someone.. Its the last one\". The fck?  Okay I understand that it's the last one but to RESERVE it? I did not even know that was an option. How inconsiderate are you to not have common sense to put it aside in a bag or a box instead of in plane site for other customers to see and ask for over and over again?", "author": "Liz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-04", "description": "For some reason I've never been drawn to this place.  I cannot even remember what made me decide to give it a try, but I got hooked! The bagels look dense and dry, but they are light, buttery and soooo good!  It reminds me of a croissant shaped like a bagel. I always get mine toasted with butter.  It is only $1 for a bagel, where downtown can you get a bagel for $1 these days?! I also bought a cake for a coworkers birthday...it was a chocolate cake with whipped cream frosting..Dream Cake I think it was called, it is light, chocolatey but not too rich or sweet and fairly priced $18! They have samples out often, I've tried their garlic bread, walnut cheese danish and cinnamin bread everything there tastes way better than it looks.", "author": "Charla M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-08", "description": "Definitely make it over to Andersen Bakery for some fresh morning bagels.  At $.95 per bagel, it's hard to go wrong with any of their options but my favorite was the cheddar onion which doesn't have a hole in the middle so it feel a bit more moist throughout.  I guess you get more bread for your money with that one.", "author": "Albie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-26", "description": "Andersen Bakery brings the heat (unless it's a cold-serve product!). The pastries are fantastic and the morning special is a great deal -- $3.25 buys you an excellent pastry + small coffee. Not only are their breakfast items good, but their sandwiches are incredible too! Sure, the selection could be wider, but gotta hand it to them for really excelling where they focus. Chicken salad sandwich and turkey/avocado/Swiss both rock. \n\nDefinitely a gem in the Crocker Galleria and easy to miss since it's on the first level.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-31", "description": "This is for the new Andersen's in the Embarcadero Center. I imagine the menu is the same everywhere.  Their sandwiches and pastries are good, the staff is friendly and helpful and the place is nice and clean.  The reason for the 3 stars is the salads. I just got and paid for a large salad, and it's basically a huge bowl of lettuce with a few other things on top. That's my pet peeve in salads. When a description lists all sorts of ingredients, I want to see all those ingredients, in plenty, in my salad. If I wanted a bowl of lettuce, i would have brought a bowl of lettuce with me to work.  Very annoyed.", "author": "Leah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-14", "description": "Andersen,\n\nIm so glad I met you! I hope this relationship last's as I must admit you are a bit of a rebound from Boudin for me...  but so far I real like the things I see in you :) I love your croissants- your walnut cream cheese pastries- the garlic cheese breads... MMMmmm I could keep going. I think you and I are beginning a blossoming relationship. \n\nXo\nMaria", "author": "maria K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-26", "description": "If it is 9 AM and I haven't eaten, something is wrong with the world.  Thankfully, Andersen Bakery made me a happy camper.  Had the saffron raisin twist.  You can't really taste the saffron since it is overpowered by the sweet icing and cinnamon.  It was subtle and it made for a nice mini-meal.  Wish that we got the strawberry shortcake topped with flan ($24!).  Someone clearly has me in mind, except that I'm too cheap to spring for that.  Props to the nice cashier from the P.I. who thoughtfully gave us samples of the french cream and offered to give us even more!  She thought that hubby and I were Chinese.  Nice.\n\n3.75 stars really, since their tea selection is limited to Tetley (5 varieties, including green tea) and they did not have honey.  For a coffe & a tea, plus the pastry we paid less than $8.", "author": "Laura P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-13", "description": "The place has nice looking interiors and it has a place to eat inside. There seems to be quite a bit of pastries and bread sold here.\n\nI ordered the calm chowder in a bread bowl. The soup was creamy, but had very little clam taste or clams. It tasted like potato cream soup rather than calm chowder. The bread bowl's interesting since it's a soft french bread as oppose to the sour dough bread bowls that you'll usually find. The bread bowl was soft and a decent size. The french bread tasted really good.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "Always has breakfast breads in stock, unlike other places (*cough* Specialty's) and cheaper.\n\nGreat place for a carb fix.", "author": "MakeUp M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-14", "description": "I love how when Im hungrily walking to the office at 6:45am I can stop by to get a blueberry/cream pastry and toasted sesame bagel w/ cream cheese. My grumbly stomach quiets down to a happy lull until lunch time.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-20", "description": "Bacon Cheese Roll, why must you tempt me? I was strong this morning and did not buy your breakfasty goodness, but I've been thinking about you all day...\n\nThe staff selling you were very friendly and saved my bacon (!) by letting me squeeze in right at the 3pm cut-off to order cakes for the next morning. The chocolate birthday cake was moist and delicious, and the not-overly-sweet whipped cream filling and frosting were a big hit with the guest of honor. At $22 for a 7\" round, it felt like a good value to me.\n\nBut now I'm full of sweetness, and that savory bacon roll is calling my name from 4 blocks away!", "author": "Bill B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-31", "description": "This place is OKAY. Whenever I go here they always appear to be out of Cheese bread (my favorite), but perhaps it's the time of day that I go. When they do have cheese bread available though, I savor each and every bite.\n\nThey also have a meal special, half sandwich served with a salad or soup. Good price for what you get, but I have to admit it's just your typical sandwich and less than appetizing salad. Nothing extraordinary, but good enough to fill your appetite.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-18", "description": "Wow Cinnamon Raisin Bagel and 1/2 loaf for only $3.00. Pastry heaven around the corner beckoning me to spend under $1 on yummy breads and morning treats. Its like no matter where I go, I find my kryptonite. \n\nI miss that skinny picky eater girl I once was. Okay not really, curves came with living in California and I love places that are inexpensive and fill my belly. Andersen .... I shall see you ... REAL soon.", "author": "Jamie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-11", "description": "Andersen has some really good baked goods. They are also extremely convenient: they are close to MUNI/BART and they sell half loaves of bread. As a single girl, I feel I can never buy bread and eat it before it goes bad, so Andersen has provided me with a really great solution.\n\nThis bakery also serves simple sandwiches. They are quick and easy, but nothing special.\n\nMy favorite things here: Sea Salt Bread and a Palmier", "author": "Caitlin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-26", "description": "Creamy French, mmmm...\n\nI won't lie, it's the only thing I've tried here and it's so delicious. I'll make it a goal to try something else off the menu the next time I'm in the area.\n\nThis location in particular is kept pretty clean and the woman that helped me was so friendly!", "author": "Connie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "It seems the quality here has gone way up since expanding.  It did taste like Costco pastries warmed up before - now it seems very fresh and light.  The soups are good but also wish they had a soup and sandwich combo.  Service is a little inconsistent but generally good.", "author": "Molly P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-03", "description": "I ABSOLUTELY ADORE Andersen Bakery!!!\n\nI have been to the Serramonte location, but I must say that this one is my favorite. It was very conveniently located close to my former workplace so I frequented the bakery quite often; the only times I ever found it crowded was on Thursdays (as that's the day for Farmer's Market in Crocker Galleria).\n\nTHINGS YOU MUST TRY:\n1) Creamy French Rolls: My numero uno FAVORITE will forever be their CREAMY FRENCH ROLLS!  It's a 12\" crispy french baguette roll sliced lengthwise & filled with a custard filling!  They are SO addicting! You can ask them to cut them into small slices and -- voila -- the perfect party/company snack!  At about $2/a roll, just THINKING about them make my mouth water!\n\n2) Milk France: At just $1, this will keep your sweet tooth in check.  It's about the size of a small muffin and even resembles it a little, but under its crisp fluff top, there is a small dollop of condensed milk.\n\nMoving on... Those are the two things I would say you HAVE to try!  Their cheese danishes are decent.  The jalapeno cheese bread is all right, but it is a bit on the greasy side.  I've also tried their blackberry pastry and the raspberry cream cheese danish -- both were flaky and yummy!  Lastly, their coffee is pretty good and their cafe au lait is fantastic!\n\nThis Andersen Bakery location is ideal for an on-the-go pick me up. And if you want a nice breakfast alone or with company, you can always grab your food/coffee and take it to the roof top garden at the top of Crocker Galleria.\n\nService is fairly consistent.  Workers try their best to not make you wait long -- even if it's busy.  Great pastries, great location, overall greatness!", "author": "J. Nalani K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-05", "description": "I'm not a big fan in eating lunch at the FiDi. If I eat there,it better be at least a 4-star review and worth the time in typing this review. I sound like a spoiled-brat,huh?\r\n\r\nAgainst my optimism,this bakery,which is located inside the Crocker Galleria, is nice,clean and surprisingly not too busy. The cute and experience staffs make the \"Signature\" sandwich in front of you. They also carry the \"Express\" sandwich at $4.50 for people in a rush to get back to the office. Screw the \"Express-Sandwiches\",I want a fresh sandwich made in front of your face,even if I pay more. I had the Ham and Brie on a toasted French Roll,which contained lettuce, arrugula, ham and Brie. Wifey had the Turkey,avocado and swiss on a toasted Artesian sourdough bread. The two sandwiches were delish! There were also free-samples of cut-up Almond-Croissants,and wifey did an unsanitary thing and grabbed a large-handful and stuff it in her mouth. \r\n\r\nThe bakery also sell baked breads by the loaves,fresh-pastries,cakes and desserts. Wifey bought a Pan Dolce,which is a Cream-cheese filled snail. I had a small bite and it was tasty. My wife stared at the cakes and desserts, drooling on her next sweet bite. She ordered a slice of Caramel Torte for her later snack. She continued to salivating the dessert-case so I detained and dragged her out,before I become broke.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-06", "description": "Please stop getting turkey on my vegetarian feast! I love the sandwiches here, but it's so disgusting when I am about to take a bite and see a nasty piece of meat stuck on the outside of my sandwich. This has happened way too many times for me to ever want to come back, which is sad since I love their sandwiches. Last time the veggies tasted like they were frozen too. So lame!", "author": "Andrea N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-09", "description": "Best dang chicken salad sandwich I've had. Get it on the pan de (something) bread. It comes with sprouts, apples/grapes?, celery...the works!\n\nIt's like a party in the mouth. Que terrif!", "author": "Jackie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-28", "description": "Some of the best sourdough I have had anywhere. Try the turkey and avocado. Huge and for about $6 quite a deal. Have one of these and you will never be able to do Subway or Quizno's again.\n\nAll pastries are well worth the price. Bread pudding is for someone who loves a great egg custard with light flakey pastry, more than good.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-05", "description": "I usually adore Anderson's yet stopped by yesterday for some of their yummy walnut bread and a turkey cheese and avocado sandwich which when I got home were both less than impressive. The whole grain sandwich was very fresh ie the turkey and the cheese yet what completely ruined it was the black rotten avocado, I won't be buying another sandwich Ever from here. The walnut bread had rock hard pieces of walnut throughout it, the type that if bitten on hard would break your tooth, luckily I was the one who ate it first and not our 2 year old son who loves it toasted, he could have choked or indeed cracked his lovely little teeth. Not impressed:(((", "author": "Ali C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-16", "description": "The creme brulee is top notch! It is the most delicious I've ever tasted. The mini eclair was quite good too and I'm not crazy about eclairs. Definitely give this place a try! It's inside the mall, by the way, I had a hard time finding it.", "author": "Alyssa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "Ordered my boss' birthday cake from here.  It was white cake with strawberry and whippedcream filling. Everyone loved it. The best part is that they delivered. Great communication and on time for delivery. Next time I am in the city and need a cake, I will definitely use them again.", "author": "Ashlee M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "Mmm, delicious sandwiches and breakfast sandwiches and terrific VERY strong coffee!  I tried the turkey and avocado on sourdough and it really hit the spot.  The bf tried the sausage, egg, and cheese and said it was mmm mmm good!  Quick service and lots of seating. We did not try the baked goods but i'd definitely come back for another sandwich!", "author": "Kathleen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-20", "description": "Saturday morning, early client meeting, a whopper of hang over from Friday's activities. I shuffle from the garage underground, eyes half closed, I smell COFFEE! I look up and it's like seeing the holy grail of hangover cures.\n\nWhen I walk in there is a very chipper girl who greats me with a big smile. I felt like a pick ax is impaling me, so it's nice to see a friendly face. She's was quick with the coffee & sandwich. Coffee was hot and just what I needed to set the day off to a better start. \n\nAfter my meeting, I inhaled the most amazing Turkey Avocado & Swiss sandwich. Bread was so soft, everything was fresh & well put together. \n\nThank you to the chipper angle who saved me for an early morning meeting.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-18", "description": "Had the cheese and ham croissant for breakfast. The croissant was fluffy and flaky but they were stingy on the cheese and ham filling. Coffee was delicious. For under $5, I would go back but I would stick to the pastry without fillings. They also have a great AM special for under $4 which includes a coffee and a breakfast pastry. I would do that for sure!", "author": "Rüsh A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "Based on experience, I can tell you that it can be awfully hard to get what you want out of a bakery. I am not one to take disappointment well and hence, there have been many birthdays (my own and other people's) stained with tears of frustration upon opening that big pink box and not getting what I wanted. I like to get what I want and Andersen delivered. They are not as fancy as Miette and not as edgy as The Cake Gallery, but they produced the perfect cake for my birthday. \n\nThe Vanilla cake was oh-so-light and fluffy. The custard filling was smooth and creamy and not too sweet. The buttercream icing was very light and a beautiful shade of off-white. The pink flowers and ribboning were lovely and not overdone. Half a sheet cake will feed 40 people easily and their prices are incredibly reasonable.\n\nTheir convenient location in Crocker Galleria makes this a great place to pick up office cakes or special occasion cakes if you work in the area. A word of advise: If you're buying a sheet cake or half sheet cake, make sure to get a cab. We learned cakes of this size don't make the rush-hour trip on the 38 Geary well.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-03", "description": "I will never ever buy a loaf of bread from you again.  Ever.  Eating half a loaf of their luscious, soft, heavenly fragrant, addictive cinnamon bread for dinner is not a good thing.  Doing it again the night after still doesn't make it right.\n\nThey give free samples.  And the J-town branch has red bean pastries, too!  Really helpful, friendly service.", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-20", "description": "I stopped by here because I had a good dentist visit and felt that I deserved a little something since I was hungry before heading back to work.  But I was sadly disappointed by the bad service I received from the woman at the counter who was very rude to me and the customer after me.  I had asked if they had a chocolate croissant that is in the crescent shape of the plain croissant, and the lady looked at me as if I was crazy and then told me that they have the square one and that's it and that I really wanted a muffin.  I said that I remember having chocolate croissants when I was in Japan.  She told me flat out that I was wrong and had an attitude.  I was kind of startled because I had assumed that it would be the same level of niceness as I experienced in Japan.  \n\nI did order a bread roll that was split in the middle with pesto and asked for it to be heated in a toaster oven.  It was microwaved and then handed to me.  I walked away and then had to come back and ask for a napkin because there was none in the bag.  Also, I wanted to let her know that the bread tasted chewy.  She said, \"Yeah, I know, it doesn't taste good when you microwave it!\"  \n\nThat really was the last straw for me that I had to come back and write a review about it.  If she knew that it was going to taste bad, why did she microwave it?", "author": "Mindy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-12", "description": "Creamy French Bread.  Softest roll of french bread ever with a custard all the way down the middle. TO DIE FOR.\n\nAlso good chocolate chip cookie, not the soft kind but the good flavor, and lots of chocolate chips.\n\nCakes looked good too.  \nBut right now I'm just focusing on this delicious custard in this french roll.  Great, two of my favorite things in one serving: custard and french bread.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-11", "description": "two words: CREAMY FRENCH!!!\n\nIf you've never tried a creamy french, I suggest you do so ASAP! (its a mini-baguette filled with pastry custard) I think creamy frenches are one of the single most under-appreciated delights on the bakery circuit! I don't know if this is simply because a lot of bakeries don't offer them, or just because people don't know how freaking amazing they are. In any case, all hail Anderson Bakery, because they certainly DO serve creamy frenches, and all the other sweets look fantastic too!", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "I had the combo of a 1/2 turkey mozzarella on whole grain & clam chowder. It actually came out as a full sandwich on really small pieces of bread. The chowder was bland. The sandwich was pretty good.  Fresh bread really makes the sandwich.  The moz was fresh and the turkey was awesome.  The girl at the counter was really nice and gave me good suggestions, and the pastries looked great. I can see this being a good spot to pick up a bite before you hit the BART (Montgomery St. spot).", "author": "K G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "Great Danish bakery. Very friendly staff. Perfect sweet treat when on the go.", "author": "Christopher D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-08", "description": "I come in every once in a while to grab a cookie (which are pretty good) and decided to buy a sandwich today. \n\nEwww, gross. \nIt was a mayonnaise sandwich with a slice or two of turkey and a teeny bit of avocado. Never going there for a sandwich again. I couldn't even scrape the mayo off because it had already seeped into the bread. \n\nI may go back for another cookie, but no thanks to the sandwiches!", "author": "Suzy Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "This is where I go when i get a sweet tooth craving at work.  Their pastries are to die for!  \n\nTheir breads are soooo delicious!  Nice and sweet, crusty on the outside and soft in the inside.  This is the prime example of the perfect loaf.  They also have good rolls.  Their pisano roll is yummy and kills my pizza craving, and the international cheese roll is as good cheesy goodness as it gets.  Try the cheddar jalapeno, it's very tasty but be prepared for a messy snack.\n\nI would come here everyday, but fear of carbs keeps my visits to once every few weeks.  Especially because I just can't help myself and I eat the whole damn loaf during the course of one workday!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-23", "description": "My official supplier of \"double croissants, no foam\" (ie no cheese) every morning.  Just don't come and steal my croissants, ok?\n\nCroissants as good as they get, I grew up on them and these are so yummy!", "author": "Regis H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "I'm a fan! I love bread a lot!! I love the way bread is baked here. And the turkey sammich (add avocado) is so yummy! Hmmmmmmm . . .", "author": "Y. Abigail H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-19", "description": "Very yummy turkey/mozzarella/tomato sandwich (among other kinds) on freshly baked bread.  I've also had their cheese danish at the Japantown Mall location and it was delish.  When I've had too much of the underwhelming soup company, burritos and salads upstairs, I come down to Andersen for a breath of fresh air and - literally - fresher food.  The sandwiches are a tad expensive but for real mozzarella cheese on fresh bread, I can't complain.  I recommend!", "author": "Molly P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-28", "description": "I'm not sure why, but this location seems to have only a fraction of the sandwiches that I can buy from the Market location near Civic Center.  Nevertheless, the bread here is super tasty because it is so fresh and springy with a good flavor.  Andersen's is one of my favorites and can definitely give Boudin a run for its money.  I haven't tried their pastries yet but they look appetizing and I plan to do so soon!", "author": "Marika A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-13", "description": "This review is only for the frenchy bread. Their frenchy bread was pretty good. I need to try more of their pastries, as well as bread, baked goods, and sandwiches.", "author": "Vera W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-28", "description": "Hi All...starting Monday, May 1st...you can get their breads even closer...no need to go all the way to Japantown or Pacific Heights...they are opening one in the Crocker Galleria....and it's great if you go on Thursdays for the Farmers Market cuz you can make your own sandwich for half the price they charge outside!!!  Just write down a shopping list:  \n\nThings to Buy:\n1)  Stop by Andersen Bread\n2)  Stop by the Farmers Market for lettuce, tomato, cucumber,\n3)  and for dessert, get some fresh grown fruits\n\nand if you want some meat, just bring some from home! hehe!", "author": "Mee-stique K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-13", "description": "Stars for their almond croissant alone. They have a wide selection of pastries and breads, and they are all great quality. They also have coffee and bagels for the breakfast folks, and lunch specials!", "author": "Trish P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-27", "description": "I went to the opening of their new store on California Street. -- ordered the Cobb salad and it was terrible.  The dressing was like vinegar.  It was all lettuce and nothing else!  Will not go back.", "author": "Rita T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-12", "description": "One of my gfs had pastries from this bakery in Japan and found out they had one in SF so she had to pick one up for my bday.  She got something similar to angel food cake with strawberries.\n\nThe presentation of the cake, very pretty and definitely tasted very good.  Disclaimer, I don't have a sweet tooth so I'm not a huge dessert person, so this wasn't to die for, for me but I think for others out there who love desserts, it's a must try.", "author": "Winnie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-16", "description": "We just started getting pastries every Friday from Andersen Bakery, after years of getting them from Boudin's. What a refreshing change! Everything is fresh and delicate. The fruit is wonderful, too.\n\nGave it five stars because Andersen's is a cut above the rest of the FiDi bakeries.", "author": "Jamila L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-21", "description": "This is one bakery where the pastries are nearly as good as the ones you'd get in Europe. The prices are also very very decent. The popular items on the menu are usually sold out by mid morning/afternoon. The staff are really helpful and friendly and don't mind explaining what rolls/bread are what.", "author": "Kc H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-13", "description": "I worked at 120 Kearny for 6 months.  Almost every day, I went downstairs to Crocker Galleria to get a latte and pastry from the people at Anderson.  This is a true European Bakery.  You have long waits sometime, but it is totally worth it.  The staff is SUPER FRIENDLY.  Many times, they gave me free treats.  I also came here for lunch often, and got either the chicken salad sandwich, or turkey and avocado.  I LOVE THIS PLACE!", "author": "Ashley E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-25", "description": "Sandwiches are just ok. Coffee is just ok. \n\nBread pudding is really yum. Made from croissants rather than bread. May b that is their secret to great bread pudding. \nShould and must try their 'melt in your mouth' cream puffs. OMG! I could die with a few of those in my hand! nuff said!", "author": "MrsNIFTY G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-31", "description": "fast, cheap, delicious pastries. I'd recommend a pastry with a raspberry jam and or sweet cream topping.", "author": "Tushar K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-27", "description": "I had a vegetarian sandwich, and it was mediocre and basically all bread.  I know this is a bakery, but the bread wasn't even good.  It tasted like a store-bought loaf.\n\nWorse than the food was the service.  On my second visit there were only 2 people working and it was one guy's first day.  The other woman there didn't seem interested in helping him, and kept leaving him alone in the front to go do who knows what in the back.  There was a line of customers, and he didn't know how to use the register yet.  Poor guy!  He had to keep running back to find her, and when she finally came she just glared at him and told him to go slice some bread.  It took her forever to take all the orders and make everyone's sandwich herself.\n\nThe first time I came to this place the service wasn't that bad, but it wasn't good either, and neither was the soup I got.  It tasted salty, and like it was from a can.  Too bad, this place is so close to my office and would be really convenient!", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "Most of us probably know Andersen bakery as a place to get a pastry in the morning or on your lunch break. They make an excellent birthday cake as well; the custard filling is real custard, the cake itself is fluffy and light, and the decorations will look great! They may seem a little uncomfortable transcribing the message 'Happy Birthday, Bitches' onto the cake but they'll do it, their commitment to customer satisfaction is such that they'll abandon their moral comfort zones to make sure that you and your favorite bitches are happy on their birthdays.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-02", "description": "The veggie sandwich contains excessive amounts of mayonnaise, which does not compensate for its lack of flavor.  Baguette was fine, not stellar.  Service was suboptimal.  Sandwich was $6.", "author": "Sierra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-10", "description": "Hands down to almond croissants. Their almond croissants are so addictive and god-damn delicious. The croissants come in light almond paste fillings(not heavy at all), soft and puffy, with sprinkle of almonds, icing sugar and cocoa powder to finish the top. Every bite you taste, it blows you away. Then, I went there almost every breakfast and lunch. At one point, I felt as if my good karma has finally reincarnated. Just that said, my enlightment has finally ended today. Buddha has officially put a halt at me from entering my stage of nirvana. Buddha said, \"dear fatso, you need to shed a few pounds to polish my karma in the mirror. No fat-buddhas in the buddha-land.\" boohooo~", "author": "Michael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-13", "description": "Simply excellent.  You can't get pastries as fresh as this anywhere in the city (well, you CAN, actually... but the only other place would be Specialty's, and they categorically SUCK).  And you're certainly not going to find anything of THIS quality.  Come here when you want an almond croissant fresh out of the oven (STILL WARM, they're so fresh!).  And their craft is truly inspiring: light, flaky crusts, fruit fillings that don't hit you over the head with their acute sweetness.  Subtlety seems to be the name of the game here, and it's a good thing.  Easily my favorite source for baked goods in the city.\n\nUPDATE, 08/29/2012 (though maintaining the 5-star rating): I've been away from the Financial District for a few years, but I recently have been back, and went to re-visit Andersen Bakery.  I'm happy to say that they're still making their beautiful pastries.  But I need to make a PARTICULAR shout-out about their Almond Croissant: This is, quite possibly, THE BEST Almond Croissant I have had in the city (and I have had quite a few).  It is certainly my personal favorite.  The one they do at La Boulange (the running favorite, it seems) is, to me, a bit heavy-handed: heavy on the almond paste (I never thought I'd hear myself say something like that, but their almond croissant demonstrates to me that you CAN, in fact, get too much of a good thing), plus even more ON TOP of the croissant, thus making it VERY heavy.  It's just kinda OVERKILL, if you ask me.  I WOULD still like to be able to WALK after eating their croissant!  By contrast, the one at Andersen Bakery has all the delicacy that the one at La Boulange & other places lack: It's light, flaky, airy, with just the right amount of almond paste (and that almond paste is not too sweet, either).  It is simply Delightful.  And you don't have to feel bad about yourself after eating it, either!  They are baked on-premises, and are frequently warm from the oven.  If I had to offer one criticism, it would be that they sometimes overdo the powdered sugar on top of the croissant.  It doesn't really detract from what's underneath, though.  It's still a lovely experience.  Add to this the unassuming, \"Hidden Gem\" nature of the place (It's rarely crowded), and I chalk it up to a Win-Win.  Am happy to see that they're still cranking out their pastries with the same quality that they were years ago.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "Stopped in to get a little afternoon treat, I ended up getting the almond cupcake, super delish. It was nice and moist and had a very strong almond flavor, I could have easily eaten three of them!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-30", "description": "The service is always really good when I go in here and I've only tried the cookies so I'm sticking with three stars. I like cookies to be soft and easily breakable without a huge mess...Although their cookies are good, they are a little on the hard side, but definitely worth the $.80 price tag attached. Part of the problem may be that they are not made at the location so they are not 100% fresh. Next time I'll try a croissant...", "author": "Kristin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-07", "description": "Friday morning was my first time here. I don't know for sure what it was I got (still hungover @ 7:00 am), but it was good. It wasn't a bagel, but similar to one. It had cheese on it and the lady cut it into small pieces. The ladies there were really nice.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-18", "description": "I often take classes at the San Francisco campus of Berkeley Extension or attend lectures at the Commonwealth Club; when I do, I stop here for lunch. The service is good, if a little impersonal. The bread is delicious. I like the extra counter space for whichever book I have my nose in.", "author": "Marcus M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-02", "description": "andersen boulangerie, j'adore votre pain au chocolat avec du cafe chaud. vous me rendez heureuse. merci! merci!", "author": "May T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-08", "description": "The pastries are ok and I go there once in a while when I am in a rush to get something to eat, however, I must say that the service is horrible.  The woman that works there often, and her name starts with \"D\", does not know the first thing about customer service and she is pretty rude to all customers.  I was so upset walking out of there today that I decided to write this review.  I also, tried to look for their management information on-line, but could not find anything on the internet.  This is such a shame that I go in the store for something enjoyable and come out wishing I never stepped in there.  She needs to not be working in a customer oriented job.", "author": "nina i."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-13", "description": "sucks... no oven... they micowave ur bread.. does not taste the same as oven... bread gets hard when it is coldl... the best one is in tanforan and great maLL... will not go there ever again", "author": "Lily T."}
