{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "Very good deal both in moderate pricing and large chunks of fairly freshly fish- except for the salmon. Maybe it was a day old, who knows, but I eat a lot of salmon sashimi and this batch was noticeably mealy. The other varieties of fish in my sashimi were good! Oh, the shrimp (ebi) was incredibly, almost unbelievably small, and marinated in too much \"sweet\".\n\nOverall I think it's a great deal and I'll order again! (Next time sit-down with my shiny new Groupon coupon!)\n\nBòñ Æppeťi!", "author": "Grizzle J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Phenomenal place to grab fresh sashimi! We got the Romeo & Juliet roll topped with the best scallop sashimi. Would definitely get this roll over and over again!\n\nWe also got nigiri amaebi with the fried head included, uni, tuna, and sea bass special. \n\nPretty reasonably priced, especially for San Francisco.", "author": "Miranda N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-17", "description": "Wanted to try this place for 2 reasons. Groupon and they had no rice sushi rolls. Husband and I came here on a weeknight and place wasn't busy at all. \nWe ordered sashimi, sushi rolls and chicken karaage. It was pretty good. \nOur only concern was that night, hubby and I both had stomachache and ended up in the bathroom. It wasn't a really bad food poisoning but it was still uncomfortable.", "author": "Claire J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "I just ordered delivery from here for the first time today and I was happily surprised at the quality and portion size. The fish was so incredibly fresh. I ordered sashimi and two rolls (yes I eat a lot and used the $30 delivery minimum as an excuse).\n\nConsidering my sushi addiction, I can imagine this becoming a weekly habit. I told my coworkers about how good it was and we're likely to combine financial resources and try one of their platters next time.", "author": "Tanya W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "I loved the fish! Super fresh! It melts in your mouth! We got rainbow roll, very good size for just $11! Sushi dinner plate and a couple of normal rolls that are on the small size but delicious! Especially with Groupon the value was Amazing!! Service was also good!", "author": "Greta V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Fantastic sushi! Very pleased, I plan on coming again \nGlad that Groupon had the $30 voucher for only $17.50!", "author": "Nancy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "Annie and Lee, sitting next to us frequently here said to get fish tacos, fab on crispy seaweed, also went for crunchy lobster roll and dragon roll, all is good here, can't rave enough, wonderful staff, tonight we had Andy, so gracious, warm and explained real well.  This is our 3rd time here and will definitely return. Freshest fish and inviting ambience. Not noisy and always meet best neighbors.", "author": "Ellen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "Fresh fish in large slices. That's more than half of what I'm looking for when I check out a new sushi spot. The flavor profiles weren't quite there (as in, the salmon wasn't super salmony) but you felt like you were getting your money's worth in terms of size. \n\nSlices were about 2 inches long and a 1/2 inch thick. The chirashi came with 2 slices of 5 types of fish-- the selection that day was salmon, tuna (perfect red color, not fishy at all), the hamachi fell apart a bit, another pink type of fish (not sure which) was also tasty and held together more firmly, and the escolar was pretty standard. They topped the bowl with a sprinkling of ikura (the salty kind, though not quite seawater level).\n\nMainstream complaints of the wasabi and ginger being too close to the fish, but that's every sushi takeout ever. I'll be back!", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "A Richmond district staple, been here too many times to count. The owner and waitress always takes care of us, $28 omakase is hard to beat. Great variety as long as you know what to order. Whether you come by yourself or a big party, this is the Richmond spot", "author": "Panchali S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "You know that donut shop I just reviewed on Geary? Well this is the sushi spot that we found on Groupon that was amazing that I referenced in that review. Geary is really a great street, tons of good bars and restaurants on that long strip of road. The golden donut was all right, but they stay open until midnight which is pretty sweet. The hogshead dive bar, one of the better in the city that we have found so far, also on Geary. But back to sushi:) This sushi spot is close quarters, not a lot of breathing room but the quality of the fish was excellent. I'd like to fancy myself somewhat of a sushi snob so I would highly recommend hitting this place, hopefully with a Groupon if they're still running their promotion, and giving them a try. And what made it even more exciting was that we sat next to an older gentleman that had multiple large bottles of sake all around his seating area that decided to tell me how good-looking and voluptuous I was when my husband went to the bathroom. Told me he's been living in San Francisco since the 70s, since the sexual revolution he said. San Francisco is literally a city all made up of every type of person you can imagine, you have a different neighborhood on every block, the most unique city I've ever been in hands down. You just never know what's gonna happen when visiting good old city by the bay..lol", "author": "Prescila B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-02", "description": "Forgot I had ordered from here before and was disappointed so very upset at myself for making that mistake again. This time, I ordered the curry udon. There were no indications of it being vegetarian but also none of it having meat. I hoped for the latter as it is the curry udon that I am accustomed to but unfortunately not. I also ordered 3 rolls; the spicy scallop, the salmon skin and the spicy tuna. The spicy scallop was best and the spicy tuna was worst. Spicy tuna was old fish covered in sauce but it was obvious fish was old; it was brown instead of reddish and it didn't hold together. The salmon skin roll was alright. \n\nNever order from here again. Must remember.", "author": "Hello E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "Consistently delicious & generous portions of crafted sushi: Crunchy Lobster Rolls & Fish Tacos are not to be missed!! Just terrific!", "author": "Marc L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "This place gets pretty busy on weekends so when it does make sure you are ready to wait because there seems to be only one waitress taking orders and another helping with bringing out the food. The food is really good and fresh! My mom always gets the seafood udon and she loves it! Their sushi taste great and the presentation is on point!", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "We came here to use our groupon that was about to expire and I have to say we made the right decision. On the outside it doesn't look like much, almost like it was closed, but when you get inside it's really nice with the wood paneling and the lighting. Once seated, we saw that they had a variety of different rolls that could be ordered which included what we ended up getting which was the Romeo and Juliet ( a roll that was wrapped in soy paper and had salmon and avocado), the volcano and also the yakitori pork belly and the miso soup. I highly recommend to try the volcano roll which with presentation alone is deserves to be ordered and the yakitori was pretty good as well. The miso and the Romeo and Juliet was just ok, in my opinion, but my partner really seemed to like it. I would definitely recommend this place.", "author": "Desiree C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "Features:\n-We came here yesterday because we bought a Groupon deal, $16 for $30 worth of sushi.  We made reservations for 6pm and were seated right away.  \n-Our waitress was very efficient and took our orders.  We had four orders: salmon with scallops roll, jalapeno Hamachi roll, salmon belly sashimi (4 pieces) and the lobster roll.  I really loved the salmon belly sashimi, I ate my pieces so fast that I forgot to initially take pictures of them.  They were fresh and slid off my tongue type of delicious.  The lobster roll was my second favorite because it was very flavorful.  My mouth was in shock with so many different flavors--from sweet to spicy.  I especially liked the crunchy stuff atop.  The salmon with scallops was good but more on the plain side for me despite the fact that they added some flavor on top (Sriracha I believe).  The jalapeno Hamachi was my least favorite, it had way too much rice rolled up on the sides and very less fish.  It had so much rice that I barely tasted any fish.  What stood out more was the jalapeno as the main taste.  \n\nImprovement:\n-The jalapeno Hamachi roll came out last and very late.  We finished all our food and maybe waited about a good ten minutes before this came out.  I would recommend this roll come out with the others.\n\nTips:\n-I would come here again with the Groupon deal.  \n-I looked at the omakase orders and they looked reasonably price.  The next time I come, I would love to try the omakase!\n-Cash and credit cards accepted.\n-Very fast service.\n-There were several TVs so you won't miss any sports games, FYI.", "author": "Kristy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "I appreciate this sushi spot on what it offers as their theme!  \n\nTesting the waters at this semi-casual place and let's just say that the dining experience passed splendidly.  (I think it was the sake shots, maybe.)\n\nOff menu, do order their daily special whole fish sashimi.  It's a wonder to the eyes and awesome for the sashimi lovers!\n\nOne must get their spoonful of Midnight oyster with quail egg, uni and ikura in ponzu sauce.  It's a great opening appetizer.\n\nThey have creative and delectable dishes here. Taco salmon was yum and different.  Rolls were of nice variety.  Hamachi tataki was delicious.  \n\nSake was pleasantly milky-like and smooth.\n\nService was attentive and they even gave us a complimentary dish near the end. \n\nWill return!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Thank Groupon for the first time visit. Service staff is friendly and we were seated immediately on a Sat evening. Waitresses were quick to meet needs and the orders were fulfilled without much of a wait. A bar and seated table area is present. Towards the back, tables are available for larger groups. Menu is diverse with appetizers, sushi, rice, and noodle dishes. Prices are reasonable relative to portion size and taste. Overall, the food is tasty, good portion and the end result is a satisfying meal in a nice casual place with good service. Grab a coupon or not and try this spot.", "author": "David H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-18", "description": "Last minute decision brought us here for sushi. We ended up with Oyako Donburi and mixed Tempura appetizer and the Temptation roll. The husband enjoyed the donburi, but nothing outstanding about it. The mixed Tempura was a stingy portion (only 2 previously cooked prawns) and cooked slightly not hot enough - it came out greasy. The ponzu sauce tasted more like beef broth, and mostly tasteless. The Temptation roll had all of my favorite elements: crab, unagi, avocado, etc. but it was rolled too loosely and too large. It fell apart as soon as I tried to pick it up. Our server was very sweet and a little overworked. The bill was $40 with the tip.\n\nAll in all, not a wow. It was good on a Saturday afternoon in a pinch.", "author": "Marty R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Found Arashi thanks to Groupon. I love sushi, & not only was everything delicious, I've never had such large slices of high quality fish.\nI ordered the blue fin tuna, as it's not usually available. Lots of grilled items, I had skewers of eggplant & shrimp. The menu had plenty vegetarian items. They appear to have a large take-out business.The interior is a great combo of casual & class. The tables are good for 1-4 people. And there's always the bar. Along the back is a tv showing sports, thankfully high up with the sound off.", "author": "Lynn F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-10", "description": "I'm not 100 percent certain this place is truly Japanese. First of all, the ebi tempura rolls had tough soggy cold tempura inside.  Granted it's a roll, but usually it's more warm or fresh.  Secondly, the nigiri wasn't made with actual sushi rice.  Wrong texture and taste.  Third was the agedashi tofu. I have never in my life seen the grainy hard tofu used instead of the silky tofu.  I thought it had curdled or gone bad.  When I inquired about this with the waitress, she didn't know what kind of tofu was actually used and had to ask st the kitchen.  It was actually gross.  The clincher of the whole evening was that she didn't offer to refund or exchange this weird tofu for something else.  I feel like an authentic restaurant would have been upset or embarrassed about the gross tofu and made it right.  I know the culture - I've been to Japan.\n\nOn the way out, my friend commented that maybe the restaurant was part of the motel next door, because it tasted like bad hotel food", "author": "Max G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-26", "description": "Came here for lunch because my boyfriend and I had an expiring Groupon to use. The service was decent but the food here was pretty average. We ordered the chicken karage that had a good batter, but was a little salty. We ordered the Giants Roll and the Wagyu Roll that oddly came out looking very similar (with a bunch of raw onions), which was not indicated on the menu descriptions. The regular sized sashimi was okay in terms of freshness, but the cuts were really thick.\n\nMaybe we went on an off day but I wasn't very impressed.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Highly recommend this place! A gf recommended it; it's a place she goes often. So we came here together one night, and she was right - I loved it!\n\nEverything I had was delish - salmon maki, hamachi maki, tuna maki, and the midnight oyster shooters (uni, quail egg, oyster, and ikura - I think this was a special. It was a giant spoonful of heaven). The rolls had the perfect ratio of fish to rice, and the fish was fresh. \n\nAlmost as importantly, the prices were completely reasonable, and the service was fast! So fast that I was skeptical - but I was wrong.\n\nCan't wait to go back!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "From the outside, Arashi doesn't look promising; it's not exactly on a \"hoppin'\" part of San Francisco's Richmond District. But your impressions may change once you're past the threshold.\n\nArashi looks spanking new, with sharp wooden tables and textured floors. The light is moody but never dark. There's Japanese pop music in the background - like ELT, but higher pitched. The inevitable flat-screen TV played silently in the background, subtitled in English.\n\nThe food is as good as I hoped. The obligatory miso soup (shiro miso) was sweet and flavorful, and it paired nicely with the genmaicha tea. Generous mounds of wasabi and sliced ginger.\n\n1. Vegetable Tempura was a real surprise. Arashi avoids oily dishes; that arrived as a warm vegetable tempura wrapped in inari skin. Tasty and unexpected.\n\n2. Nigiri. I tried eel and saba nigiri, and both were tender and tasty. The size was a little smaller than I hoped, given the price, but the flavor was on target.\n\n3. Spider Roll was also well-seasoned, with not a hint of oiliness. The roll fell apart, during eating - not a problem for me.\n\nI tried a Groupon discount, which made this meal a real bargain. Even without a discount, Arashi is a stylish family restaurant and a solid pick.", "author": "Thirsty C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-06", "description": "The sushi is alright but their customer service is near non-existent. I have eaten in the restaurant and the server we had was flippant at best. We have ordered delivery from here twice on two separate occasions with a 60-70 minute delivery window. Here we are at two hours and we still have no food. When I call to follow up, the phone rings until it disconnects.  Last time we waited 45 minutes past the later delivery time... this time we're an hour past and there is still no sign of food. Do yourself a favor and take your business elsewhere.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Great sushi, good portions, good prices.  Brought a group of five 6-yr-olds, and we all ate for around $60.  Not bad.", "author": "Kathy K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-14", "description": "I ordered Omakase and some other stuff. Omakase is a total rip off. Total amount of sushi you get is less than what you would get from individual orders, so you would end up paying more money for the same stuff?!? Nonsense!  I wasn't expecting to get more stuff but less? Come on people..", "author": "Jisun L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Honestly was pleasantly surprised by the sushi! I had a Groupon and was expecting something more mediocre based on some of the reviews, but I would say the sushi was above average for me. I felt the fish was really fresh compared to other spots I've been to. I loved the hot lady roll and Romeo and Juliet roll, and I appreciated the tea for the cold weather. Generous portions of fish, and the flavors worked really well together. I also had the real crab roll which was a little more bland and would skip on that. I definitely plan to be back!", "author": "Chelsea T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "My gal pals introduced me to some of the best sushi I've had in the city this past week and I can't srop thinking about it!\n\n\nArashi Sushi is a small spot on Geary Street, serving up an array of Japanese cuisine but our eyes were set on having a table full of sushi. And for a picky sushi eater like myself, it didn't disappoint. The service was absolutely wonderful, explaining everything without making me feel guilty for not knowing my sushi.\n\n\nI ate so much sushi, I had to switch from chopsticks to a fork just to keep up! \n\n\nDo give yourself time to find parking, or better yet, hope the 38 MUNI bus and walk right into the door. Large groups better RSVP in advance and ask for the front bench area in the front corner if you're as loud as my gal pals and I!", "author": "Hala A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "LOVE this place!!! Sushi chefs are friendly and the waitress is really great!!  She's super friendly and attentive. This has become our go to sushi spot since they almost always have really fresh fish. Happy hour is also a good deal, but we normally do dinner. It really is nice to go in after work and have friendly faces greeting you. \nIt has a really chill atmosphere which is nice to wind down, also they have a tv in the back that normally plays baskletball/baseball games ;)", "author": "karol c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-24", "description": "I am in search of a good Japanese restaurant.  Since we got a Groupon deal, we decided to try out this place on a weeknight.  We ordered a bunch of small plates and some drinks.\n\nFood: Small plates were just okay.  We didn't order sushi much.  Sushi may have been better.\n\nService:  One of the servers was so loud and blunt, almost rude.  Not sure if she was just unhappy or upset with something.\n\nOverall, 2.5 stars.  I could come back to try out their sushi but at this point, I will keep trying other Japanese restaurants.", "author": "M Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-31", "description": "I wish I can give them 5 stars, but there is couple things the need to work on.\nedamame which they brought was old and cold, then we order couple rolls even though there was only two tables except  of us it took them like 30 minutes to bring our order.\nStuff is trying to do everything in same time , take your order, take phone calls , host new people and all it likely happens in the middle of our order.\nQuality of food is average, oh and their wasabi is horrible .\nWorst I ever had so far .\nReally want to go back sometime next year !", "author": "Askhat E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "First time here on heart day and got a groupon which they vouched for. Everything was great and they were super nice. Little whole in the whole out of effin no where.... im coming back foe sho!!! Lol i need to try everything else. Had the hamachi carpaccio lil salty cuz the sauce but still yum. Had oysters and midnight oysters... yum!!!", "author": "Theresa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Came here on a Saturday around 3 PM and we were seated immediately. The restaurant was very clean and had nice decor. For the most part, I think everything was reasonably priced and we got almost all of our order within about 10 minutes of ordering. We had the house salad (HIGHLY recommend), miso soup, a Firecracker roll, a deep fried California roll, a Lion King roll, and a Hot Lady roll. Everything tasted great, and customer service was decent. Would definitely become a regular if we lived in town.", "author": "Ethan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "This place is a little whole in the wall .. the cherry blossom was amazing, my son had the chicken ramen and we both agree we would come back again :)", "author": "Bonnie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-27", "description": "I liked this place a lot! Normally, i go to Sanraku, which is closer to my apartment in Nob Hill, but this place has equally fresh fish. The service is not as great as Sanraku, the teenage girl who waited on us seemed in a rush-- she didn't really care about what we wanted to order, or if we had any questions, and she didn't show up at our table until after we had sat for awhile (and after we had give our drink order to one of the other servers). We did have a question about what was in one of the rolls, which seemed to annoy her, and then she pretty much just ignored us as soon as we got our food. \n\nFood itself was pretty good! The sushi deluxe was about the same as Sanraku (~$30) but the sashimi pieces were MUCH larger. Delicious!", "author": "Lai-Nin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-03", "description": "Bring your reading glasses. This places a massive list of sushi rolls. I felt like I was reading a book when I was looking through their menu.\n\nKudos to Groupon for helping me maintain my ballin on a budget status. My boyfriend and I came in and was initially bombarded with the amount of rolls they have. We decided to go with the giant roll and september 3rd. Plus, our added go-to orders of salmon sashimi, salmon belly nigiri, and tuna nigiri. Their fish quality is okay. The salmon sashimi was cut into 4 sad square pieces and the tuna had no taste. The giant roll was drenched in sauce and the whole sushi roll was essentially... lost in the sauce. The september 3rd roll was okay as well. Usually we get full off of 2 rolls, but these rolls were super small. I guess it a good thing because they weren't rolled with mounds of rice. \n\nMaybe we just tried the wrong things. My advice: Choose wisely.", "author": "Rachelle Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Love Arashi!! My favorite sushi  spot in the city. Fresh fish delivered daily!! Newly remodeled too", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-11", "description": "Copped a $30 Groupon for $15 and came here with my friend on a Wednesday night at 6:30pm. I called in for a reservation but the place was pretty much empty cept two tables and one bar individual. \n\nWe sat for a bit and looked at the menu and at other Yelp reviews on some popular dishes. The waitress was really nice and brought us tea and gave us time to check out the menu as well. \n\nWe finally decided on:\n\n- SASHIMI OMAKASE: Great portion for two people. Consists of two pieces of 6 different fish and shrimp head. I'm allergic to crustaceans so I didn't try the amaebi and the shrimp heads but my friend said they were ok. I liked the hamachi the most. It was very fresh. The toro was fatty and stringy when I tried to bite it in half. What we both didn't like was the ankimo... VERY dry and pasty in my mouth... My friend and I took one bite and we looked at each other with the same wide-eyed, scrunched forehead, wtf expression. Def canned (3 stars) \n\n- SCALLOP NIGIRI: usually my favorite nigiri but it was just okay here. Topped with tobiko and green onions. (3 stars)\n\n- Whole AJI fish: for $28 bucks I think, we got the AJI fish made in two different ways; sashimi and poke style. The sashimi slices were cut very thin which I liked and the fish was very fresh! Nicely done. The poke had a lot of flavor. They also included fresh wasabi (4 stars) \n\nFor drinks we had a hot sake and two glass of white wine. In total with the $30 off from the groupon, we paid $40 each if I recall. Def buy the groupon tho! Overall, service was good and the waitress checked in on is regularly but food was just ok.", "author": "Anissa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Great food and nice environment. Amazing customer service would definitely recommend and come back", "author": "Anthony V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "I had a Groupon deal that I bought which got me $30 worth of food. Absolutely worth the price for the Groupon deal! Decent pricing for Japanese cuisine even without purchasing the deal. No need to make a reservation or to tell them about the Groupon deal ahead of time. \n\nMy friend and I ordered the chicken karage, beef skewers, dragon roll, and salmon shioyaki. Everything was flavorful and fresh! My favorite were the chicken karage and salmon. Both were perfectly tender and juicy. I greatly enjoyed that the chicken karage wasn't too heavy in batter and that they used dark meat. \n\nService was pretty attentive. We parked a street away during prime dinner hour. Make sure to tip on the entire total if you are using a Groupon deal. I'd be back in a heartbeat when I crave Japanese cuisine!", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-02", "description": "We ordered takeout and were unpleasantly surprised to find the Maguro Toro had gone rancid. It was completely inedible. We were so disappointed because the Sake Toro was delicious. We called to complain and did receive a refund.", "author": "Lindsey B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-13", "description": "I ordered for delivery and it showed up an hour late and cold! The food is so-so. Not worth it to be so late. Do not recommend", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-27", "description": "This is my 2nd review on Arashi.  We went to Arashi Sushi for dinner on 5/23/18 (Wed). It was delicious and passed my tests of fresh green tea, crispy tempura, and flavorful miso soup. On Wed, the food was so wonderful, we raved about it. The staff was attentive and cordial. We had Tempura Udon, Beef Teriyaki, and a Spider Roll. The tempura was very generous and crispy. The soup broth was delicious although just slightly salty. The quality of the beef for the teriyaki was very good and sliced nicely with a bowl of sauce in the middle of the plate instead of slathered all over the beef. The spider sushi was beautiful and delicious. The miso soup was red and white miso and perfect.\n\nWe decided to come back with a party of 6 for my birthday on 5/27/18 (Sun.).  When we arrived at 4:25 pm, the woman looked upset that we came without reservations. I told her that we were told on Wed night that we wouldn't need reservations if we came around that time. She said who told you that? I told her a man had. The restaurant wasn't full and we were seated. So, I don't know what her problem was.  Interesting thing was my boyfriend & I decided to order the same items.  \"When the food came, it was INCONSISTENT WITH PRESENTATION AND TASTE.\" The beef teriyaki came with too much sauce poured all over it instead of a bowl of sauce in the middle of the plate. The chicken teriyaki also came with too much sauce poured on and swimming in it. The soup for the udon noodles was tasteless and almost like just water with a little bit of soy sauce in it.   The spider sushi was a lot smaller!  The miso soup shocked me as it was only white miso and less robust because there was no red miso in it.   \n\nWait staff was rough and she even addressed as \"Hey guys.\" and the rest of the conversation was similar. She poured the tea so fast that I was afraid that it was going to fly out of the cups and spill on us. \n\nOne last thing that 3 people at our table complained about and found difficult to deal with was the very strong perfume smell in the area we were sitting.  It made one get a headache and another a sore throat. It may have been permeating from the restrooms. \n\nAll in all, our 2nd visit to Arashi on the weekend was a huge disappointment. The food and customer service is inconsistent and there doesn't appear to be a standard for either.", "author": "Cynthia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-15", "description": "Did Arashi take us by storm? \nAs one of the newer sushi restaurants in the neighborhood, we were curious to give it a try. The restaurant had the typical sushi bar and also a separate dining room separated by a curtain.\nWe ordered...\n\nChirashi - with tuna, salmon, salmon roe, shrimp tail, tamago, etc. over rice:\nMost of the fish tasted pretty fresh and sweet, but the tamago wasn't very sweet. The serving seemed to be on the small side too.\n\nFish Tacos - 2 Pcs w/ Albacore, salmon, avocado, salsa on fried nori:\nMost variations come on a fried tortilla chip or wonton crisp, so fried nori was an interesting rendition. It was crunchy and somewhat puffed up. It came together nicely with creamy avocado, strips of fish, and tart salsa.\n\nCha-Shu Ramen - cha-shu, fish cake, mushroom, bamboo shoots, egg, bean sprouts, corn, green onion, fried garlic, dry seaweed:\nMr. Joy was curious to try the ramen, but as usual, I'm skeptical of ramen from restaurants that do not specialize in ramen. The broth was a little bland. The pork was rather dry and the egg was slightly overcooked. The noodles and various toppings like corn and seaweed strips were okay though. \n\nPerhaps it is best to stick to the sushi and the rolls. The fish tacos were the most enjoyable of the bunch. I'd give Arashi another try if I were in the neighborhood with a sushi craving.", "author": "Joy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-22", "description": "One of the beautiful things about San Francisco is the amazing variety of sushi.  So even though I have clear favorites, I'm always down to try something new.  Today that was Arashi Sushi.\n\nThough it is slightly more expensive than Wild Sushi (my benchmark for price/quality), the fish was divine.  And they had shiro maguro toro sashimi!  Seriously, you should get some of that.\n\nLooks like my rotation just got a new entry, between Wild and Kabuto...", "author": "Joey Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "The beef tongue is soooooo good!!!  It's very juicy and I really like the BBQ taste!!  Also, their tea rice is very special!! You put tea into the rice with wasabi!!  I have never though of eating rice this way!!  It's really good!!!  I'll definitely come back again!!!", "author": "Winnie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "This is my favorite Japanese restaurant in the Bay Area. I really like the decoration after they remodeled. We ordered special Sashimi, Sushi rolls, and some BBQs. I am so surprised that the sashimi was sooo fresh! The waitress told me that the fish was from JP  For BBQ, I really like the beef, shrimp and pork sausages. They are very juicy and yummy! Must try! Highly recommend this place !", "author": "Jasmine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Came across this place during a hangry adventure after the gym, and it was a very pleasant experience. Service was good - food came out fast and the waitress was super attentive. Granted the restaurant wasn't full when we came (er, we were the only ones there since they were closing soon) but I'm always super appreciative of great customer service. \n\nFood was so good! We had the chicken kaarage, Halloween roll, unagi don, and the chicken katsu dinner plate. Lots of food - all very good! First time I've ordered an unagi don...and it didn't disappoint! Would definitely come back!", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "The sashimi is awesome in taste especially after dipping the fresh wasabi. IT's incredibly delicious. The beef tongue skewers are so dope. Juicy and Tasty!! I'm sure I will go back in the coming future.", "author": "Ares Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-01", "description": "The hunt for the go-to neighborhood sushi joint continues.. this time we gave Arashi a try.\n\nFirst things first, right after the waitress gave us the menus, she told us they were out of salmon that day. I know Sundays aren't great days to get sushi, but how do you run out of salmon when you are an average sushi restaurant?! Was the salmon in the back not defrosting fast enough? Mind blown. Anyway, we had a Groupon and were pretty hungry so we decided to stay.   \n\n+ Chirashi - decently sized portions. The albacore was definitely the highlight of this dish as it was extremely fatty and melted in my mouth, definitely a pleasant surprise. Everything else was pretty average, though.\n\nSidenote: I'm usually cautious of restaurants that serve 'white tuna,' since it could be walu/escolar (which may cause digestive problems), so I opted for no white tuna. I later found out that they have walu/escolar on their menu, so I should have said no escolar instead -___-. I'm pretty sure it was included in the chirashi, but when we asked what a particular opaque white cut of fish was, our server said 'butterfish' aka escolar, upon Googling what a 'butterfish' was. We didn't end up getting the shits that night cause we each only ate one piece so I guess we dodged that bullet.. although I think you have to eat a lot of it to actually experience some discomfort.\n\n+ Hamachi toro nigiri - decided to order this because it seemed interesting, but the texture wasn't as buttery as I imagined. Never had this anywhere, so maybe it's supposed to be like this.\n\n+ X and Spider rolls - haven't ordered rolls in dayssss, but once in a while I don't mind some carbs, fish covered in sauce and whatever else they pile and stuff into those things lol. We asked the waiter what they would substitute the salmon with in the rolls, and he replied that they actually do have salmon but just enough for rolls. I'm guessing they only had scraps left which could be thrown on the rolls. Size of the rolls were a bit small for the price.\n\nOverall, not terrible but I'd probably want to try other spots around the area before coming back here again.", "author": "Laverne N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "I love food, but I love discounted food even more. So of course, I get super excited when I'm on Groupon and come across a restaurant that has four stars on yelp! Purchased the Groupon and came here with my boyfriend on date night. Our server was super friendly and kindly charged my phone for me using their charger (I needed my phone alive so I could redeem the Groupon). The food was great! We ordered three rolls: the foxy, the crunchy monkey, and the volcano. The crunchy monkey was interesting because it was wrapped in soy paper rather than seaweed. Visually, the one that stood out was the volcano roll. It was lit! Literally.", "author": "Lexi R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "Ordered through Eat24. The sushi arrived on time. The tempura roll was still hot, and everything else tasted as hoped. \n\nThe pricing was great for the amount we received. We also got a free dynamite roll for spending 35. \n\nOverall, would absolutely order takeout again. I'm sure going in would also be better.", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-05", "description": "My mind is kind of blown that this place has four stars, where more legit sushi places (especially in San Mateo which is a sushi hot spot) have the same rating. The four stars here is a bit deceptive to me, and not all four star places are created equal! We came here because we saw a Groupon for this place but we actually intended to go to Ariake Sushi and I mistakenly read the name of the restaurant the Groupon was for (which is nearby and better if you're searching for a sushi spot in this area). We came here on a Friday, and it was very easy to get a seat. Also, I will say one thing about this place: the service is very good and the servers are all very friendly. \n\nSushi places are broken up into different types for me. You have your super high end sushi spot, where I often opt for the omakase menu for about $100 and only go for a special occasion. Then you have your middle of the road quality sushi places, where I judge them by the following: (1) quality of sushi; and (2) price. This is like the weekly Friday date night type of sushi restaurant. And then you have your all you can eat sushi restaurants, where a whole different set of criteria apply. I would classify this place as a middle of the road sushi place. So how does it rate? \n\n(1) Quality of Sushi: The quality was not bad. I would say it's on par with other middle of the road sushi places I've been to. The rolls are decent, though a bit small which I talk about below. Their uni is a little weird, because it was cut up into a lot of little pieces when they served it to us. As a result, it looked a little unappetizing. \n\n(2) Price of Sushi: I was not a fan of the size of our rolls. As a point of comparison, other places, like Fuji Sukiyaki or Joy Sushi in San Mateo, have much bigger rolls for the price. I think we ordered three rolls. Normally, this would fill us up at those two places in San Mateo. However, I was still hungry afterward. Even with the Groupon discount, this dinner ran us about $70 which is fine for a middle of the road quality sushi place but not justified by the food we got.\n\nUltimately, knowing that I could get heftier, good quality rolls at the same price made me feel like I wouldn't come back to this place. I think like Jared says in Silicon Valley, this place needs to pivot if it's going to stay in business and to get people to come back.", "author": "Lin Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "Went here for dinner on a weeknight.  The restaurant itself is unimpressive but the first thing I noticed was a large row of delivery and pick-up orders being processed which told me the food would be good.  \n\nWe ordered tonkatsu, tempura, veggie roll, and a crunchy California roll.  The crunchy California roll was a slam dunk as it was a nice variation on the traditional and sometimes boring California roll. The tonkatsu was decent and had a huge portion of meat with rice and salad that left me happily full. \n\nStaff was very nice and gracious.  Would def go here again for Japanese food.", "author": "Dan O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "Hella good! Came here last night after a foot massage(next door). Ten minutes after arrival, the whole place packed up. Many servers, two sashimi chefs. Service and food is straight to the point. Four plus a baby and he was making loud noises. Yet, the servers were still friendly. \n\nFood: 2 orders omakase sushi. 2 sashimi deluxe platters. Uni/oysters shooters. Grilled hamachi. Baby lobster. Gyoza. They were out of ankimo and gave us the hamachi salad for free. Very pretty presentations. 68 bucks per head. Not bad for that much super fresh seafood.", "author": "Vee V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Today, my friends and i went to Akashi Sushi...the server had a great smile and excellent service. I will go back next time. Ambience is very relaxing. I will come back next time......", "author": "Carlo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "Made a late stop as I was too starved to last the ride to Tracy. Even though they had all the fish put away they were happy to serve me. Best serving of Ankimo I have ever tasted and each of the other items were quite excellent also. Don't get into the City often but this will be a go-to stop.", "author": "Derrol H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "On a week night, it's not crowded, it has TV that plays sports, wide range of sushi selection, expedited services, free edamame, lightly salted. Very reasonable prices for sake and beer, which he promptly ordered upon sitting down. I attributed it to him being of a certain type of men, the type who apparently thinks that it's a good idea to chase a cold beer down with a shot of hot sake, I am not into that combo, but I would take a small sip of hot sake from time to time.\n\nI'm beginning to appreciate portion appropriate sushi. You see, sushi should be a one bite food, you pick up with your hands or chopsticks, you gracefully put it in your mouth, close your mouth and then chew. That's the gauge I'd have for a good portion, too small it feels that you've been cheated, too large it feels that you are committing gluttony, you don't need to be religious to feel overindulgent.  \n\nI find Arashi has good portion control. In addition, its white tuna was quite delicious. It makes a distinction between hamachi and hamachi belly, that's interesting enough for me to order the belly just to see if I could tell the difference, sadly I couldn't but I suspect belly meat generally is fattier, and to some, fishier. Like when you get your lutefisk fix in Norway after mid October. They often serve two portions, the regular piece of meat, and then onto the \"back of the fish\", as the Norwegians would call it. It's fishier, and therefore, to some, yummier. I liked the belly a lot. We did another order of it.\n\nThere are many advantages to eating here, perhaps the unexpected one is that it's a fairly inexpensive expedition, if you sticks to their nigiri selections.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "I've ordered from here before and they NEVER seem to fail! The food is delicious! The price is good! the delivery is quick and easy! I just got my delivery and I couldn't be more happy with my order. I've gotten delivery from other sushi spots and they sometimes forget condiments (or barley add any), or forget something from my order. BUT NOT THIS PLACE :)\nrecommend, recommend, recommend!", "author": "Mireya H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "The taco sushi is BOMB. Highly recommend to anyone. Great price, delicious food and even better service.", "author": "Jacky R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-25", "description": "Ordered takeaway - which was actually decent food, but ordered through Grubhub and it took almost an HOUR longer than originally guaranteed.  Will not order again.", "author": "Sarah Louise H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "5 staring for the service! And the fish! Joey, our server, was absolutely amazing! Valentine's Day and the place was slammed with couples. She killed it. The sushi was melt in your mouth and delicious", "author": "Patrick H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-14", "description": "What freaking horrible place to order for delivery. I have them so many chances and they mess it up everything. Always more than hour to get any food.  Today has been the worst!!! Ordered my food at 514pm and delivery time say 60-70mins. I checked the status at 620pm and it said the food will leave the restaurant soon.  At 640pm I called and they said they can't find my order. Then the manager said oh the driver will come back and pick up your order.  No apologies and nothing. So I waited for 1.5hrs and the driver is out without my food. They can't tell me when I'll be able to get my food. Isn't that nice?  I guess this is normal way of doing business.  I gave this place more chances than they deserve.  I soooo want to say out some bad words in here.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-18", "description": "Got it delivered. I was not impressed either by the quantity, the quality and the fact it arrived cold. Also last health inspection scores were 86, 83, 83 for the last three years. Not impressed.", "author": "Matthew C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-02", "description": "Got this as a Groupon deal and wanted to check it out. Unfortunately, we tried the restaurant twice and found both times to be unsatisfying.\n\nThe fish didn't taste super fresh and some of the food was quite bland. The baked mussels were ok and had some good flavor, the vegetable ramen was tasteless, some of the sushi rolls we tried were basic and uninteresting. I wouldn't recommend this spot.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "I have to admit that, before coming to Arashi, they hardly made a blip on my Yelp radar.  Not that I didn't think they'd be worth trying; there just wasn't anything to prioritize them over any of the other Japanese restaurants that the Richmond has to offer.  At least, until my buddy offered to split his Amazon Local deal with me.  Woohoo for eating on the cheap!\n\nTaking over the spot where Rockin' Crawfish used to be, it's hard to imagine this is the same space (Arashi is much more open and brighter).  As for the menu, it's pretty typical for the most part (starters, sashimi, a lot of rolls, udon/ramen, and dinner entrees over bento boxes), except with the addition of robata grill and house specialty items.\n\n**NOTE: Prices are off the menu, but our portions may have been different because of our Amazon Local deal - the starters mentioned below plus 2 Miso Soup's ($1.95 each), Garlic Edamame ($4.95), and any two sushi rolls (the soup and edamame were pretty standard).\n\n-- AGEDASHI TOFU - Fried Tofu with Bonito Flakes and Tempura Sauce...$4.50\n(http://www.yelp.com/biz_photos/arashi-sushi-house-san-francisco?select=tCMSi8YaKXhsr9tu3e5k0w)\nMaybe it's because I haven't had this in a while, but the dish was pretty good.  Although the skin was a little gummy, the tofu was pretty big and silky smooth.  The sauce was nice as well, though bonito flakes would have been much better than the shavings we got.\n\n-- MIXED TEMPURA (6 Pcs)...$5.95\n(http://www.yelp.com/biz_photos/arashi-sushi-house-san-francisco?select=uvQ6_BsnwDiw31t8zp9VOQ)\nI've had some bad luck with tempura dishes lately, but this one was surprisingly decent.  Not only was the batter mostly crispy, but it didn't have that \"fried in old oil\" look/taste to it.  Plus, the veggies and shrimp weren't torched, which can't be said for others I've had recently...\n\n-- PLUM SAKE SASHIMI...Unlisted (though we estimated about $10.95\n(http://www.yelp.com/biz_photos/arashi-sushi-house-san-francisco?select=v7z1YrjZ0mm0n9dE-sNKXw)\nIt's a shame this isn't on the regular menu, as it was the best dish of the night.  There was a slight tartness from the plum sauce, but I thought the taste of the dish as a whole was good.  The cuts of salmon were relatively fresh and I liked the slight kick of the jalapeno.\n\n-- X ROLL - Hamachi & Avocado topped with Salmon, Tuna, Tobiko, and Spicy Mayo...$10.95\n(http://www.yelp.com/biz_photos/arashi-sushi-house-san-francisco?select=RULzPzTYWTaBO8-Ax4X9jg)\nSimilar to a Rainbow Roll, but better (no shrimp or crab salad).  That being said, I'd be hard pressed to say this was exceptional.  All three cuts seemed fresh enough, but as much as I like all three types individually, the overall taste didn't come together like I would have hoped.\n\n-- BAY SCALLOP - Spicy Tuna topped with Seared Scallop, Green Onions, and Spicy Mayo...$11.95\n(http://www.yelp.com/biz_photos/arashi-sushi-house-san-francisco?select=dBdvDQNHZG_fII6UD-sqHw)\nI generally like rolls with (bay) scallops, but this one missed the mark.  While the spicy tuna wasn't bad (not a big fan in general), the scallops were rather \"meh\".  Rather than adding a nice crust/texture, the sear served more to numb the natural flavor/sweetness of the scallop.\n\n-- CRUNCHY LOBSTER - Lobster Salad and Cucumber topped with Salmon, Avocado, Crunchy Flake, Tobiko, Green Onion, and Special Sauce...$12.95\n(http://www.yelp.com/biz_photos/arashi-sushi-house-san-francisco?select=zE6ayzjJ58szdg65g_gs2w)\nA typical \"jive ass roll\", though different than what I had imagined.  High school Mike might have liked the mayo, sauce, and \"flakes\", but current Mike thought they only overwhelmed the lobster and salmon, which should be featured instead of (literally) buried.  Skip.\n\nIn the case of most sushi joints, I usually find that the hot/cooked dishes end up holding back the rest of the food.  However, in this case, the rolls (ha!) were reversed.  For that reason, and the fact that most people probably come here for the sushi, I'm rounding down from THREE AND A HALF STARS.  Although, that's not to say Arashi can't be better; from what I've seen on Yelp, there's some potential with their sashimi and specialty dishes!", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "One of the best happy hour deals in San Francisco.  Pretty much half price for a variety of Japanese foods.  The sushi chefs are pretty creative too, from what I have seen.\n\nI swing by here on my way back to Marin once a week between 4:30 and 6pm.  Less than 10 minutes from the Golden Gate Bridge right on my way home.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "I came here with a friend using the Groupon special. usually, I hate using Groupons on food since a few of the Groupons that I used for restaurants, they were not good. However, this is an exception!\n\nThe waygu roll is a must try. It's quite strange since the flavor is so confusing, but in a good way! My tastebuds were going crazy! The first piece I tried tasted like hot pot. After a few seconds after I chewed a little more into it, it was like tataki because of the ponzu sauce. Finally, as I was about to swallow it, the avacado taste was finally existing. It' liek changing 3 flavors at once!\n\nAll the other rolls I tried were pretty decent for the price I paid for. I will definitely come back!", "author": "Allie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "My favorite sushi place in town! I love raw fish and their X and Warriors roll have a lot of raw fish. Their beef and chicken teriyaki are always excellent. The meat is very juicy and tender. There's also a sunset roll which is a cucumber wrap sushi-no rice. Delicious. Ive also had hamachi and sake kama. Both are very good. I definitely recommend this place for Japanese.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-21", "description": "Don't order delivery from these guys. We ordered through Yelp Eat24 at 8:15pm and expected he food on 45min-1 hour as stated in website. At the one hour mark, we messaged Eat24, they stated the driver was on the way-ETA is 10-15 minutes. Mind you, this restaurant is a 17 minute  drive from us. Half an hour later, still no food\nSo we message Eat24 again-told the same thing-food is 10-15min away. It's 9:52 at this point and we requested cancellation of order.  Can't imagine they're that busy. This is extremely poor customer service as well as dishonest.", "author": "Maria T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-23", "description": "I was craving sushi. Finally decided to try Arashi and ordered delivery on Monday, May 11th around 6pm thru Eat24. Delivery took the average amount of time, about an hour, and was packaged well.\n\n*Midnight oyster (2 pcs): oyster, uni, ikura, quail egg, scallions, ponzu ($7.95)\nBeautiful and delicious. I love the combination of oyster, uni and quail egg. I did wish the oysters had more of a sweet briny flavor to them, but this was still a very enjoyable dish. It was hard to take everything in one bite due to all the different components, but I didn't care since I loved the flavors.\n\n*Butterfish carpaccio: butter fish, jalapeno, sweet onion, ikura, ponzu sauce\nThis was okay. The ponzu sauce was a little too much when I poured the whole container onto the dish. I wished this had a little more heat to counteract the fattiness and citrus flavors.\n\n*Sake toro nigiri: salmon belly ($4.95)\n*Hamachi toro nigiri: yellowtail belly ($5.50)\n*Ankimo nigiri: monkfish liver ($4.50)\n*Uni nigiri: sea urchin ($9.50) +Quail egg (+$1)\n\nAll the nigiri was pretty good. I enjoyed the yellowtail and salmon belly the most. The ankimo and uni were okay. I wanted the ankimo to have a creamier rich flavor and the uni didn't quite have that sweet ocean taste.\n\nOne of the main reasons I decided to order from Arashi was because they offered a Clam soup. Unfortunately, I guess this item is no longer on the menu? A little disappointing since I really wanted some soup. Tried to replace it with the chashu ramen, but I guess it was too late.\n\nVery average delivery experience. Probably not my favorite place to order sushi, but I like that they deliver their midnight oysters. That may be the only reason I'll order from them again.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-08", "description": "If you're hungry, this may not be the place for you.\n\nAfter several rolls and several appetizers, we're still hungry. But given the quality of the sushi here, we'd rather walk around Geary and pick up more food somewhere else.\n\nCame here because my friend had to try this place, but we should have known that it was a bit dodgy being that we're the only ones here on a Wednesday night at 6pm.\n\nThe garlic edamame was okay. The fried tofu was awful and plain. The mixed tempura was small, and didn't have the sweet potato that I usually like, or the fried carrot.\n\nThe miso soup was watery.\n\nThe gyoza was too deep fried. Did they forget about it in the fryer?\n\nThe spider roll was super small and on the cold side. I would prefer the soft-shell crab to be hot. \n\nExtra charge of $1 for real crab meat, that just tasted like fake crab mixed with mayonnaise.\n\nThe sake sashimi platter tasted a bit stale, and I really didn't like the plum sauce or the bitter lemon.\n\nThe shrimp tempura roll was also on the cold side.\n\nReally not worth the $60 plus bill.\n\nI could have had some fine quality prime rib at the House of Prime Rib, sides, and a salad for that price.\n\nFor reals!\n\nThe service was okay, they were pretty good on refilling the tea and clearing plates, though in-between they seem to be chatting with each other pretty loudly.\n\nAt least one of us is having a good time.\n\nBecause it sure isn't me.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Arashi is my go to sushi place in the city. The sushi is always so fresh and delicious.", "author": "Sofia B. C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-12", "description": "Delivery through Eat24 is so so so so bad. Delivery in general is bad. Every time I order from Arashi my food arrives ICE cold. Not even warm. I thought it was a fluke and so I would still order from them but no. This time, I decided to order mostly cold dishes. So at least I know my food will arrive at the temperature expected. Except, of course, the Gyoza. My order is now over 30 minutes late, I already tipped the driver on a $45 order through the app. I am super annoyed and really hungry. This is ridiculous. I would suggest that the restaurant train their delivery staff to use delivery apps properly and to PLEASE update the customer through the app if you are delayed. I'm done with Arashi delivery. Pretty sure I just gave someone a tip for delivering food 30 minutes late. So total from order to delivery 1 hour 20 minutes.", "author": "Patricia E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "I forgot to review this place last week while I was in town. I ended up eating here after the restaurant my friend and I were gonna eat at closed early for some reason. \nThis was an excellent choice! \nFirst of all, cheap, delicious sushi in SF is about as difficult to find as a smart Trump supporter. So hallelujah to that!\nSecond, our food was done super quick and was literally some of the best Japanese fare I've had in my life. The waitress was very attentive despite being the only one working at the time (I know the feels, girl) and I left her a generous tip because I really appreciated her accuracy and composure doing her job. Waitressing was the worst job I ever had, so someone like her deserves good tips. \nI definitely plan to return when I'm back in the area, and I'll even spend five whole minutes trying to parallel park just to do so. \nGreat meal.", "author": "Kaylee H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-09", "description": "Sushi was small rolls compared to Kyoto restaurant for the $$. But it was good. Waitress didn't have any customers service skills, she acted like she hates her job, n provide poor service.", "author": "Ms R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "TL;DR The sushi is average but slightly expensive. We were forgotten and forced to wait 40 minutes for our food without any acknowledgement or apology. \n\nIf it wasn't for the Groupon deal, I wouldn't have come here. Arashi serves average, somewhat pricey sushi compared to other local sushi restaurants and is definitely not a bad place, but nothing particularly special. My boyfriend and I have eaten here twice now and have minimal complaints about our first visit; however, our second visit was sadly very disappointing. We waited a whopping 40 minutes for our order of three rolls. The waitress and/or chefs must have forgotten to prepare our food, since the table next to us ordered at the same time but already finished and paid before we even got our first roll. The waitress never even checked in on us or apologized for the absurdly long wait. We ordered the Rainbow roll, 49er roll, and the Lion King. To us, the 49er roll was a bit plain and the Lion King was too saucy. The reason why I'm giving this place three stars instead of two is because the waiter who started his shift and served us towards the end of our meal was friendly and nice.", "author": "Jacqueline L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "A good array of unique rolls! Anything that has butterfish is soooo good. \nLove:\nRomeo and Juliet roll\nGiants roll\nSake Kama (worth the wait)\nHamachi carpaccio\n\nThe Kobe no rice roll was meh but everything else I've had is bomb.\n\nReasonable prices also - its in a lot of delivery apps too which is convenient. If you eat in be sure to finish your food or they'll give you a hard time", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Chicken Katsu like no other! Best ever! Great service as well! No lines, no waiting, nothing but the best! Come to this place and eat!", "author": "Gerald P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "Whenever I go for sushi, quantity is just as important as quality and this place definitely does a good job with both for the price-point. They've also got a great selection of rolls and all the raw fish we had was really fresh!\n\nWe ordered:\nAge Dashi Tofu: This was super flavorful\n5 PC sushi set: These 5 pieces of sashimi were soooooooo good. Definitely had the melt in your mouth feel when you eat good quality fish. \nTuna Lover Roll: Tuna topped with seared tuna, this was probably our favorite roll. The fish was so fresh it melted in my mouth. Definitely recommend!\nSakura Roll: Unagi and avocado topped with salmon and ikura (big orange fish eggs). Presentation was great and the salmon on top was so good I just ate it separately from the rest of the roll haha.\nX Roll: Hamachi, avocado, topped with salmon, tuna and spicy mayo; I loved the fish in this roll but the spicy mayo was a little much. It tasted a lot better without\n\nLike many people, came here with a groupon, which definitely saved us a bit of money. For everything above, after applying the groupon, was around $30, and we were both so stuffed afterwards. Definitely a solid sushi experience, mostly because the Groupon helped soften the blow to our wallets. Happy eating!", "author": "Jingxi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "Enjoy watching T.V while u eat your food! Sounds like a great deal to me!\n\nI came here on a Groupon Deal on December 28th and our Groupon deal was: $26 for $53 worth of food. \n\nI came here on a date and was quite surprised that we got seated so quickly. Once you walk in their are a couple tables on the right and in the back they have more of a private setting with 3 tables. I decided to be seated in the back so we can have some privacy.\n\nWe sat down and immediately after we were given a menu. We were told that the menu was the Groupon deal and it was already made out for us. This is what we got:\n$26 for a sushi dinner for two (up to $53 value)\n\n    2 miso soups\n    Bowl of garlic edamame\n    4 pieces of hiyashi tofu\n    4 pieces of mix tempura\n    6 pieces of plum sake sashimi\n    One roll of choice per person\n\nEverything was good. I don't like Tofu so I didn't eat it neither did my date. But we tried the Sashimi and OMG!! Its a must try! You have to eat it all in one bite for you to really get the full experience of how good it is!\n\nThe garlic Edamame were amazing and the best I have tried. Once you eat one trust me your hand will be reaching for more!\n\nI felt that the food was just enough for both of us and we walked out pretty pleased and full!\n\nThe server and workers here were really nice and as we both are water lovers the server we had made sure that our glasses were fully stocked (at all times)\n\nI would definitely go back again and I wouldn't mind ordering the Groupon Deal again as well.", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-30", "description": "The sushi rolls are good. The only complaint is how thin the fish slices are on the nigiri-you get a lot of rice with really thin fish slices on top.", "author": "Secira N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "I really love the sushi here and it's my go to for take out.\n\nSome of my favorites include the hamachi & salmon nigiri, salmon avocado roll, X roll, spicy scallop roll, and baked mussels. They usually deliver in less than the time estimated and the food is always fresh!", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-01", "description": "This placed failed my test.  Would not take Groupon order to go; eat in only and because I was buying dinner for family I was served a lot of food which I had to repack after being told I had to eat part of it to use Groupon.  Server curt, non-smiling and not friendly...which only incensed me more.  Who knows why people would come here in the first place.  Food was average.", "author": "Padme J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-22", "description": "1 star because I used to like coming here and grabbing sashimi but my last experience was just TERRIBLE. \n\nCame in during happy hour and ordered tried some off the stuff from their menu. The spicy tuna roll was $6 I believe and was the most basic cheap roll I've ever had. I could've made it myself at home. \n\nAlso we also tried their $1 oysters and soon as I tasted it I felt like throwing up. The oysters were BAD!!!!! When I told the waitress to take the oysters away from or table she came back and told us that she would take the 6 oysters off our bill because she ADMITTED THAT THEY WERE SPOILED. She didn't even bother to offer us at least a complimentary ice cream scoop or anything, we weren't expecting it but it's the LEAST she could've done after serving us spoiled oysters. Ugh the oyster was SO FRIGGIN DISGUSTING. \n\nI used to like this place but the past few times the service and quality has just completely gone down. Their sashimi isn't as fresh as it used to be. After that oyster incident I don't plan on returning.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-26", "description": "Bye Bye Rockin' Crawfish\nHi Arashi Sushi House\n\nArashi Sushi House took over the location of where Rockin' Crawfish use to be. Like many sushi restaurants in the Richmond district, this is another addition to the neighborhood.\n\nArashi has an extensive menu. Lunch specials. Cold and hot appetizers. Salad. Sushi rolls. Entrees and even ramen! Dessert and sake. Happy Hour - Monday thru Friday 5pm-8pm.\n\nHamachi Kama (yellowtail collar) was delicious and perfectly cooked. The sashimi was simply fresh. The rice on the sushi rolls were a bit too soft and soggy. \n\nThe Whole Fish Sashimi (Black Sea Bream) was the best of it all! The fish was cut thinly and beautifully presented and plated. The fish not only looked picture worthy, but tasted fresh too! It came with fresh wasabi and 3 dipping sauces. I didn't know that fresh wasabi didn't taste as spicy as regular wasabi. \n\nThe service was superb! Our waters and tea was refilled constantly. Since we ordered a lot of dishes, they were nice enough to move the small table next to us to combine it into one long table so we would have more space. \n\nI'll be back to try the other items on their menu!", "author": "Kathleen U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-28", "description": "I wish I could give this a good review but I can't!  \nOrdered vegetable tempura, and they didn't even deliver the dipping sauce (who does that?) they gave me about 5 small veggies that were deep fried, and one of them was a jalapeno.  Who deep fries jalapeno????\nnot to mention the rolls were packed loosely and seaweed was chewy.  \n\n:( So sad!\n\nUpdate:\nTheir inari and tamago smelled and tasted SPOILED!!\nInari is supposed to be sweet and it was sour.  \nMy dog smelled it and didn't even try to eat it.\nI'm so disgusted.", "author": "Sonya A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-06", "description": "Sorry must have had high expectations coming in. Was not impressed at all. I miss Rockin' Crawfish which once occupied the same space. \n\nSkip the ramen! Lots of noodles but doesn't taste good. Broth is lacking. \nSome of the rolls were ok. Again nothing special. DON'T do the monk fish liver. No flavor. And very weird looking. I eat just about anything under the sun so if I think it's weird...", "author": "Stephen Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-21", "description": "Decided to give this place a try since there was a Groupon deal...\n\nMy bf and I each ordered the 8 pc Omakase, which is what we usually order at good looking sushi restaurants. I told the waitress that I liked salmon but when our Omakase arrived, I didn't get any salmon pieces.\n\nWe were both very disappointed because the pieces were all very stiff in texture and some of the fish were gamey/briny. None of the pieces melted in our mouths and I couldn't even swallow some of the pieces because they were just too gamey...\nWe also had a piece of fish that was salty with blood in it....uhhh... is that even edible? yuck face. yuck face. \n\nBleh.... I'm still giving the yuck face thinking about it...", "author": "Leilani Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "The service was great. The lady that was serving us was very nice and she was really keeping us happy. You could tell that they wanted you to get the most out of your meal and money. The sashimi was very fresh. The tempera was warm and overall, the food was great. The server was always making sure we were happy with our food. I had a great experience with my family. We all really enjoyed the food and service.", "author": "Kaitlyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Found out about Arashi Sushi on Yelp and wanted to give it a shot. I should start by saying \"Great staff and great service!\". I am not a sushi expert, and they took their time to explain and give suggestions.\n\nOn the other hand, amazing sushi! Temptation is my favorite! Definitely would come back again.", "author": "Ugur O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-16", "description": "Battery died 2 photos in. #smh #firstphoneproblems\nSo I got all pre-Internet and drew my food.\n\nWalu (http://www.yelp.com/biz_photos/arashi-sushi-house-san-francisco?select=MXG_MaRJ69xP-7_bij83Pg)\nUni (http://www.yelp.com/biz_photos/arashi-sushi-house-san-francisco?select=MXG_MaRJ69xP-7_bij83Pg)\nCucumber Summer Madness Roll (http://www.yelp.com/biz_photos/arashi-sushi-house-san-francisco?select=uAC0KvCtJxYJH5MvZe6kfw)\nWagyu Roll (http://www.yelp.com/biz_photos/arashi-sushi-house-san-francisco?select=uAC0KvCtJxYJH5MvZe6kfw)\nMenu (http://www.yelp.com/biz_photos/arashi-sushi-house-san-francisco?select=mP0uApPmKRRkFcUnHsuuDw)\n\nResto has \"everything\" Japanese,\nPlus some custom in-house items.\nCool set-your-own-price omakase.\n\nDude all-black outfit x navy shoes?\n#datfashionfauxpasdoe #justsayin", "author": "Dan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-25", "description": "The food itself was OK. But our waitress didn't speak English, she didn't understand what we were saying and simply said yes to every question we asked. My dish still didn't come after waiting for 39 mins, we asked her about it and she just said yes over and over again. Eventually we asked another waiter and finally got our food, but my friend's dish was already cold by the time my dish finally arrived(it took almost an hour)", "author": "Wenqian G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-09", "description": "If you want mediocre, chewy sushi, order from them. \n\nIf you want to be treated like shit by a delivery driver, order from them! \n\nLet me explain....\n\nI received a phone call not asking me to come down to pick up my delivery but demanded me to when he could push my buzzer like every single other person does! The rudest delivery driver ever!  He shoved the bag in my hand and said your food! What the fuck?! \n\nThe food: I ordered two items which were fried.  Both were so soggy and wet, we ate half and threw it away. Such a waste.  \n\nThe portion of their veggie/shrimp tempura was the smallest amount I've ever been given for the price!  Ridiculous. \n\nI have not been into this restaurant physically but if that's how they treat their customers, period, I'm never going in there!", "author": "Maddy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-21", "description": "Bought the $30 groupon and felt like we received $1 service. We were seated immediately and given menus + water. However we sat at the table for 30min+, waiting for the 1 and only server to take our order. Honestly, if you have 1 server, don't bite off more than you can chew. \n\nI'm not sure whether to blame management, or the 1 server who was working his butt off, trying to take care of 8+ tables and bussing them himself. Maybe it's no wonder that this place is getting to desperate point of offering a groupon, to try to increase their business.\n\nFingers crossed, hoping for a free dessert after this bad experience.\n\nWhat's worse, is that I already bought 2 of these groupons from this place", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-19", "description": "I don't know how or why they got 4 stars... don't order from here. Especially delivery. Gross. I don't understand how they could send me food with that low of quality.", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Great food, nice environment and really nice service. They gave some really good recommendations that were delicious!! 10/10 RECOMMEND", "author": "Fiona H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-15", "description": "Some people really love this place but I thought it was mediocre at best. I got the chirashi, which comes with miso soup (which was pretty good) and free edamame. The fish was decently fresh, but the chirashi only comes with tuna, white tuna, salmon, hamachi, shrimp, and tamago. So nothing to write home about.", "author": "Sherry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-07", "description": "I really like their music in there, easy to sing along.  Everything is really fresh, especially the appetizers.  I posted the pics.  The cucumber sushi was refreshing.  Thecgrilled salmon kama was fresh. You just want to see this restaurant survive, since there has been five restaurant turnoves in the very spot..  It is a good solid restaurant.  If you check-in, you get free sake,  who doesn't want free sake.  I wouldn't say you will be stuffed after your meal, but you have to save room for dessert in the neighborhood.  Service was very attentive.  You can actually have a conversation in there.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-07", "description": "They really need a new delivery person. Delivery came a full hour late. We had ordered both hot items and cold items, and the delivery driver stacked the items so that the cold items were on top of the hot items. When our order FINALLY arrived, the driver called me rather than use the apartment buzzer then yelled in the phone for me to come get my food. He then shoved it in my hands as I was opening the door and walked off. So now I've got both room temperature sushi, and room temperature beef. Definitely room for improvement.", "author": "Patrick Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-29", "description": "To be honest, the reason I ate at Arashi Sushi House because I got a groupon deal $30 credit for $15. After I checked the restaurant rating on Yelp,I decided to give it a try. \n\nWe got to the restaurant around 6:30pm and we got seated immediately. The restaurant was clean and big. I think this restaurant used to be old Crawstation restaurant. We ordered Sake Toro nigiri, Hamachi Toro nigiri, tuna nigiri, Omakase sushi  ( 8 pcs) and Omaskase sashimi.\n\nOverall, the presentation for the omaskase sashimi was the only one that I'm impressed about. The quality of the sushi was average nothing impressive, but they really need to work on their knife skill and skill on making sushi. For example,  the tuna nigiri we got, it looked like they just placed the tuna on top of the tiny rice ball. when i picked up the sushi with my chopsticks, the sushi immediately felling apart. The sashimi were small and thin. It wasn't worth of $32. Also, the fresh wasabi they served, it reminds me of hot dog relish. \n\nAlso, Arashi gave out a free bowl of edamame for each table. However, I saw the waiter just use his hand and grab a hand full of edamame and placed on the bowl. It was the same waiter who took our orders and after grab the edamame without washing his hand. The employees need to be more sanitary, specially when it's restaurant.", "author": "Stacy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "My friend and I ordered some vegetable tempura, the '49ers' roll (salmon, lemon, tobiko) and a 'Halloween ' roll (seaweed roll).\n\nThey had very reasonable prices for a small or large sake too.\n\nFood was really tasty, we will definitely come back to try some other rolls next time we're in the city.\n\nRestaurant is clean and simple. We were seated at the counter and could see they had just had a mix up with an order which the waitress and chefs handled professionally and quickly.", "author": "Wany X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-25", "description": "Presentation looks good! \nCame here after learning about the restaurant on Groupon. Groupon is a good way to try new and old restaurants we otherwise wouldn't even know about. \n\nThey get pretty busy at dinner! Make reservations. \n\nSat at the bar. The food didn't wow me really, but the sushi chefs were friendly and courteous.", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "Like a lot of people who have reviewed this place I had a Groupon for the fixed dinner for two.  The deal itself was of great value but what really surprised me was the terrific service and quality of the fish.  The garlic edamame was some of the best I've had and the plum sake dish with shiso and jalapeno was amazing.  It was great to get to choose any two rolls you would like and not be limited to a reduced menu.  The crunchy lobster roll was totally bananas and had that saucy crunchy composure that many sushi rolls have.  Also got the Foxy roll, which was good, but missed the mark a bit on the mango it was supposed to deliver on.\n\nAdditionally, they have a Yelp check in deal for a free hot sake that they let us use in addition to the Groupon.  The service was quick, attentive, and helpful, and the ambiance was welcoming, clean, and modern.  Highly recommend grabbing this coupon and giving Arashi a shot, or, just stopping in for good sushi when you're in the area.  \n\nMore sushi places should consider putting together a Groupon that involves an affordable fixed menu/sampling with a little bit of customization so that the customer can leave experiencing an array of flavors on a sensible budget.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "I've had an undeniable desire for some good sushi for the past few weeks; it is suffice to say that I am sated. You might see some poor reviews complaining about their tempura or some other cooked dish. Begone with them, for an appetite for grease is not one served here. The real stars of the menu come in Arashi's creative, appetizers and fresh sashimi. Their Fish Tacos are an absolute must for any opener. They offer a changing menu of special catches, and great sashimi platters. \n\nThis is one of my favourite sushi restaurants in San Francisco, mainly for their fresh sashimi and shellfish. Some of the best tasting sushi and shellfish I've ever eaten was from Arashi. They also have a pretty extensive variety of rolls, from rich and creamy to crispy, crunchy and savoury, even baked and vegetarian. They're great at accommodating groups of four or more; after all, the larger your group the more sushi you can try! \n\nYou can expect some typical Japanese kitchen fare, if you're not in the mood for fish. Katsus, udon, ramen, teriyaki and tempura, it's all available. Their entrees are quite large though and most of them come with salad or rice, so you may not want a roll to accompany them. \n\nThe atmosphere is casual and relaxed, televisions playing whatever sports game is on. They have a private room available with room for eight (but obviously call in advance). You can expect exceptional food and service; the owner's commitment to quality shines through and through. \n\nFor the love of food, eat some raw fish!", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "This is a good sushi place to eat..the price is not bad...\nThey also closed late at night..Try it out...", "author": "Alex T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-24", "description": "I really, really wanted this to be a 5-star sushi place because it's in a convenient location and because of the friendly staff.\n\nI ordered a few items off of their extensive menu, and everything was good. Nothing stood out, but everything tasted good. I don't remember exactly what I ordered, as I went off of the waiter's recommendations. The fish tasted fresh and was plated with style. The service was great - my water was refilled, a hot miso soup and warm edamame were brought out while I waited for my order, and someone kept checking up on me.\n\nHowever, the portions were tiny for the price. I'm all for quality, so initially, I was OK with the little bit of food I received, and I ordered more.  However, I felt quite sick an hour or two after my dinner, so I'm not so sure about the freshness of the ingredients used. I'm not sure if I'll be back or whether I'd recommend this place to friends.", "author": "Nelya T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-26", "description": "They use the imitation crab, and the crunchy lobster roll definitely did not taste like lobster. The crunchy lobster left a lot to be desired. \n\nThe lion king was decent- a bit too cheesy tasting for my taste. I'm not even sure what's on top of the baked salmon, but whatever kind of sauce it was, it was a little too much. \n\nWhen we first arrived, we were seated in an empty restaurant at a table that smelled strongly of cleaning supplies. My seat was wet so I had to switch my own chair with one at an adjacent table(because we didn't have napkins).", "author": "Julie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-08", "description": "How on Earth does this place have four stars? For the entire dinner I thought I was going to be the only one eating here. I did notice they had numerous delivery orders during my visit. Arashi has a cute private room up front for maybe eight people with a window view of the street. They have bar seating for six and an extended looking dining room with may be 12 tables total and the walls have three TVs on a sports channel.\n.\nThe servers were great, prompt and attentive. I wished they would just put a teapot on the table; I was always on empty needing a refill. They do try so hard and even brought out the serving of white wine in a chilled glass.\n.\nThe Garlic edamame was a new twist for me, okay, and may be just a bit oily. The dinner salad was really lacking and had only one half of one cherry tomato on it =(\n.\nA friend ordered the Hot Lady roll and had no comment...I ordered the Dragon roll and found it quite mediocre. The eel was too thin and small may be a half portion. The avocado also seemed skimpy but it did have quite a bit of roe. \n.\nNothing was bad just everything seemed so lacking and there is just so much better available in SF I hope I dont have to eat here again.", "author": "Caesar A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-22", "description": "I hate to post a negative review, but this sushi was incredibly fishy. I ordered take out from Arashi and had 4 rolls to try, all of which were unpalatable. I had to throw the entire order out after a few bites, which was such a complete waste of food and the fish who died in the process :( very disappointed with this experience.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-28", "description": "The food doesn't worth the price. The restaurant doesn't worth 4 stars. The sushi is super oily, taste is not that good jus soso, sushi is all cold even I order the baked sushi, and some of the sashimi is not as fresh. Take forever for the food to come even the sashimi dish. The cup have lipstick and still serve for customer. Show the server and the server was thinking we need napkin so she return with some napkin. So funny and then need to tell them to get another cup of tea and then she was like oh I thought you want some napkin. Lol. So stupid. Why would I want some napkin if the cup have lipstick on it. Order 3 rolls and 4 pieces scallop sashimi for two ppl and that's $90 something including tip. Super not worth it. Will not return again and will not recommend friends to go for sure.", "author": "Melinda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "This is a delivery review.\n\nMy ramen delivery order arrived in 16min! Crazy! It was also really good although I didn't expect quite so much garlic in the Chashu Ramen. Next time I'll ask them to tone it down a bit. That said, there will definitely be a next time.", "author": "Mariko F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-01", "description": "Ordered for delivery tonight.\n\nThey forgot the green tea cheese cake :( not only was i excited for it, but it was also $5+... \n\nThe driver also didnt \"deliver\" as he made me go to his car to get the food. Not a big deal but it was just kinda weird. Anyway, i probably wont be returning or ordering after a $28+ meal with missing stuff.", "author": "Shira S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-20", "description": "First timer, bought a groupon. \n\nI was really excited to come here on a date with my boyfriend. \n\nUpon entering the restaurant on a Saturday night it was pretty empty. We thought it was strange when it's rated 4 stars on Yelp. Hm, maybe we beat the crowd. Lots of Togo orders and only one waitress. \n\nFood:\n\nDo not order the salmon sashimi! \nThe salmon sashimi was disgusting. It was very chewy. I wanted to throw up. Nothing was really good here. My favorite thing was the complimentary salted edamame. This place is expensive and has bad quality fish. \n\nThe tea cups are really small, so we had to refill our tea a lot. I wish they gave us a pot, so we didn't have to keep asking for refills. \n\nInterior:\n\nReally plain walls with a few shelves behind the sushi chefs with empty alcohol bottles on display. \n\nI really wanted to like this place but I'll stick with buying the groupon for sakesan on clement instead. The rolls there are delicious! For the same price you pay here you can't better quality food at sakesan.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-28", "description": "Food was mediocre. The best part of the meal was the California roll. Everything else was small portioned and tasted kind of funky. Maybe we came at a bad time but definitely would not be coming back anytime soon.", "author": "Ada H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-18", "description": "I ordered delivery from this restaurant. The food they sent me made my quite ill. Shortly after eating my food, I could feel my stomach turning. I spent the rest of my afternoon in excruciating stomach pain thereby ruining the rest of my afternoon and evening. Eventually, the pain was so bad I vomited it all back up. When I reached out for a refund, they were adamant that the food was \"prepared correctly.\" If this is what the restaurant considers prepared correctly, I would STRONGLY advise that you spend your money somewhere else. If I could rate this restaurant lower than 1 star, I totally would. 0/5 (unless you like vomiting your guts out after eating).", "author": "Nick D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "We ordered delivery from this place and all the rolls we ordered were really good and fresh tasting! Just placed my second order this week!\n\nWe ordered the spider roll, the 49er, and philly roll. The spider is really good and unique from others because it includes shiso leaf. The other rolls were solid, standard, and simple in the best way. Sometimes other places try so hard with the rolls and add too much sauce or they lack flavor but Arashi just does it right - fresh and solid.", "author": "Julie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-13", "description": "I ordered delivery from here and fell in love with the garlic edamame, teriyaki salmon dinner, tempura fried lobster roll, shrimp tempura, miso soup and philly rolls! Yes...that's right, I fell in love with it all! I actually ordered this sushi twice in a row it was so good and the best part is the prices are reasonable while the quality remains exceptional! \n\nThe sushi was made pro style and the rice was perfectly firm! It had the right dryness and stickiness to keep the rolls right and tight. \n\nNothing tastes fishy at ALL, just clean pure notes of freshness on the palate. As a super picky eater with somewhat ridiculous textural standards when it comes to sushi, I noticed that if I really like what I'm able to find in a good sushi house...most others appreciate it as well.", "author": "Love L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Loved the variety of options and presentation. Also easy to get a table and Groupon made it so affordable. Thank you!", "author": "Eve H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-19", "description": "I cannot believe this restaurant has 4 stars... I came here because I bought a groupon for this place. Even with the groupon for our party of 2 it was still quite expensive for the amount of food they give you.\n\nWe order 3 different rolls, which were quite small considering how they each costed over 10$. The first roll that arrived was the bay scallop roll, which was pretty good so we had high hopes for the other 2 rolls. Our 2nd roll was the volcano roll, which was very bland and the worst part was that the salmon was disgustingly chewy to the point that we did not even want to eat it. The volcano roll was also very poorly constructed to the point where the rolls were falling apart and they also gave us extremely tiny pieces of unagi in it. Our last roll was the halloween roll, which also had the same disgusting chewy salmon in it. \n\nIn addition to the bad food, our server was also very slow with service when there were hardly any other people there. They also gave us wrong food that belonged to another table twice. After eating such nasty rolls, we never want to come back here again.", "author": "Andy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Freshly made sushi, with portions of good size. There is a smell inside of the place, but that's the only draw back.", "author": "Alena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "The Ankimo was so good~~~ i would go back just for that. a good place to hang out with friends", "author": "Xinwei C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-20", "description": "S.f sushi seriously sucks. The rice is God awful and it does not taste fresh. There may be plenty of Japanese folk portraying *sushi* goers, but no way. Bleh. Good for Mexican, and rare spots only.", "author": "Victoria V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "If you arrive early, ASK FOR THE HAPPY HOUR MENU!\n\nThis is one of my go to sushi places in SF.  The fish is always super fresh. Their Albacore (white tuna) is amazing. Its like butter! Oh yeah, the butter fish is pretty good too! Try the FISH TACOS! Better here than anywhere else I've tried. Better than the one at Skool! They also offer real snow crab as an option.  It makes a HUGE difference with any roll that has imitation crab.   They have too many rolls I like to list right now.  Their shitake yakitori skewers are delicious too.", "author": "Rob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "We first time here,food is fresh and delicious,service is excellent,prices are reasonable,lots of choices on the menu and seating is comfortable. Love this restaurant and enjoy introducing friends to here too.", "author": "Ka Ming L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "I been here twice and both times we had a groupon deal.  The people who work here are friendly and attentive.  They were always making sure our teacups were filled. We had the Sakura Roll, Romeo & Juliet, and the Spider Crab Roll.  All were delicious and fresh-tasting.  It appears to me the business survives through apps such as Groupon or Eat24 and other delivery apps.  Each time I came here it was always empty.  I do like this place and I will definitely come back!", "author": "Emi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "I thinkni order here every other week sense i move to the area... My guilty pleasure.... The other think i like to point out... Is i havent even walk in here yet. I alway uss eat24 app and always vet what i ask for. And my wait time is with in reason sense i live with in 2 miles . \n\nAgain i get food from here pretty much every other week.", "author": "Seaera T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "Good, affordable sushi in a cute restaurant\n\nWent to Arashi on a Friday night with two friends. It was very busy, but they honored our reservation right away. Service was friendly and efficient all night. We shared a delicious seaweed salad and each ordered our own dinners ). All of the food was good. Not EXCELLENT, but good. Definitely great for the price. I look forward to returning to Arashi in the near future.", "author": "Zipeng C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-02", "description": "1 star for the nice delivery man.\n\nThis food is so awful.  I had to throw my $50 order away because it was such crap.  The seafood upon consisted of dry, mysterious meats.  The rolls (tekka, spicy tuna, romeo & juliet) have some nasty ass basil or mint in there?  Wtf?  Way to ruin your rolls...& my evening.  \n\nAfter a few bites of everything, I couldn't stomach the thought of eating such shit.", "author": "BizzyLizzy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "Decent service. She gave me a good sake suggestion based on my preference. Sushi was good. I like that they have garlic edamame, that's not that common. It's unfortunate they aren't open at lunch anymore, I'd be there more often if they were.", "author": "Kris F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-30", "description": "Looking for good sushi on a Monday night during the holiday season? Don't bother haha. I found it near impossible and I learned this the hard way. I knew I should have stopped trying after the fifth sushi restaurant on Yelp that was closed. \n\nAfter driving through the Richmond, we finally just settled for Arashi and it was just what I expected...overpriced mediocre sushi. :( I ordered the 8 piece sake toro sashimi for $14.95 (only $1 more than regular sake sashimi) and it was actually really fresh, but pieces were cut pretty small. I'm so glad I ordered the toro because I traded one piece for my bf's regular sake from his Chirashi and it was so much better. We also shared Tamago nigiri and the Sunset roll (cucumber instead of rice, avocado, tuna, salmon, and another fish I can't remember). The Sunset roll only came with 5 pieces at $8.95. The ends of the rolls had a decent amount of fish, but the three pieces in the middle, not so much. Avocado was also lacking. There wasn't much flavor to the roll either. \n\nThe service was on the slow side even though the restaurant was almost empty. Mostly disappointing meal, but I did like their sake toro. Just wish there was more of it! I probably won't be back.", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "Every item on the menu that I tried is very good. The fish tacos is amazing. He servers are friendly and very nice. I definitely recomend this place.", "author": "Ron A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-23", "description": "Took a gamble on this new place and came up short unfortunately. \n\nApparently the night before was a busy one for them so upon arrival, they informed us they were out of all special fishes and only had the basics. There were nice lunch specials but overall wasn't impressed with the fish. \n\nMy friend got the omakase (ended up getting a shipment in after we ordered) and I got the chirashi, spicy scallop hand roll and white out roll. My fam had the table right next to me and we were 2 out of 4 tables seated in the restaurant. \n\nService was slow given the few number of patrons.. Both of our tables didn't get food until 45 mins after being seated. Their omakase tasted fishy and didn't seem to be cleaned well. My friend had to force the food down and was pretty disappointed he ordered it. My chirashi was good (basic fish) but the rice was soggy. \n\nOverall it's decent but there's much better out there.", "author": "Lauren Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-02", "description": "This is a new restaurant and the food was nicely prepared. The staff is friendly enough and the rolls were yummy enough to take the leftovers home for later tonight. But they dropped a star for how they handled the misleading deals they were offering on the internet.\n\nUnfortunately, since they offered what they thought was the same deal on Groupon, Living Social and Amazon Local, they were surprised to discover Amazon Local's deal (for the same price) was completely different and they just didn't honor it and told us Amazon got it wrong. They just gave us the Groupon deal. I would have rather had the Amazon deal but oh well.\n\nSo they handed us a special Groupon sampler menu of five appetizers and one small sample roll per person from a special paper menu they give to people with deals. Hard to figure out what it's worth since this menu didn't have prices and was a sampler meal so not for regular customers but they claim it's $53 worth of food. (They also make the customer pay for sales tax on the full value of the meal (the $53) on top of whatever else you order, and then even charge sales tax on that sales tax which I'm pretty sure is wrong.)\n\nWe live a couple blocks away and are always trying the new places so when I noticed this new restaurant where the cajun place was (too bad 'cause they were good) I wanted to try it. We liked the food and may come back but not with a \"deal.\" Having lived in Japan for many years I can say this is not as good as other Japanese restaurants in our neighborhood like Daigo, Minami, or even Joo Mak a block away.", "author": "Kira B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-15", "description": "Business closed during Yelp showing \"open\" hours on Saturday and Sunday. No one picked up phone calls. Not sure what's going on.", "author": "Runner L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "I came here using a Groupon Deal to eat a meal that was supposedly worth around $100 of sushi, but it definitely seemed like they were ripping us off. Under different circumstances, the meal would have been more worth my money than this Groupon deal but luckily it was a Groupon Deal so it was not too absurd.  \n\nStill, I thought the service was great and the food was not bad. We had a set of appetizers come with our meal and we had the option of choosing four sushi rolls. The appetizers included garlic edamame, which was unique and pretty good. There was also tempura, miso soup, and salmon sashimi. The miso soup was too salty for my taste. We ordered the Temptation, Spider, Super Dynamite, and Sunset. The Sunset tasted fresh and unique because it was a roll without rice.", "author": "Regina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "I've dined at this place three times since it opened. First time I time was on its third day if business, and most recently last night. This has established itself as another one of my favorite sushi places, one that I'll likely come quite regularly. I love their omakase, especially their eight piece nigiri version where you get eight different kinds of fish for  I think $23.95 (this is in contrast to the 12 piece sashimi version where you get only six kinds but two pieces each). You get \"non-regular\" sushi items shipped from Japan. According to the main chef every week they get a shipment of assorted kinds. Weekend selection are likely to be better than weekdays for now, also according to the chef.\n\nLast night I ordered the clam soup and that was great also, very different from other sushi places I ordered that from. That will likely be another must order whenever I come.\n\nThis place is worthy of five stars for the food. The reason I am giving only four stars for now is that the service still seems a little challenged, even when the restaurant is only a little more than half full. They left the clam soup on the counter for a long time and didn't bring it until I asked about it, therefore allowing it too much time to cool. I also ordered a hot sake, though not with the original order, and the young lady staffperson totally forgot and I had to ask a different guy later on. It seems the fact they do delivery and takeout may be taking away too much focus.  Hope it's just growing pains and they overcome it.", "author": "H K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-19", "description": "Friends ordered here and I remembered my previous experiences, so I only ordered veggie rolls and tempura shrimp. Things just aren't prepared well but if you're desperate for sushi you can order here for grocery store quality sushi and I don't recommend getting the fish.", "author": "Emma M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "Went here for a friends birthday last night and happy hour today. The house sake is a little harsh, and the firecracker roll was made with canned tuna. \n\nDespite this, the roll was delicious and both times the service was great.", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "I rarely leave reviews, but this deserves a review . I ordered from the lunch special a Chirashi , deluxe sashimi combo ,salmon sashimi. \nChirashi - 12.95 , include thin slice of white tuna, red tuna, shrimp , salmon, tamago and rice . Nice and fresh \n8piece salmon-13.95 . Again soo fresh, and the slices are pretty generous. \nDeluxe sashimi/sushi - 8 piece sashimi , 2 of each , chef choice.  Each piece was fresh. Plus choice of Cali or spicy tuna roll (6 pieces)", "author": "Joyce C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "Everything is great here. Last night I tried the midnight oysters for the first time - amazing, rich, and super tasty. My faves usually revolve around their house special rolls (forest roll!? Elf roll!!?) and anything fried - but in particular, and the veggie Dragon roll!", "author": "Mable L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-14", "description": "My wife wanted to try this place out so we went with a few others for a party of 8.  Usually, I''m the cursed sushi person in any group and often don't get my food until the rest of the party is done.  This time was vastly different.  The food was ok and standard for any sushi restaurant.  I really wanted to give them a 4 for service and 3 for food.  I'm not sure it its because we went on a Monday night but the sushi rice seemed past its prime and was a bit dry. \n\nWe started with the raw tofu, which you really can't mess up, and also had the Chicken Kara-age and Gyoza.  Standard stuff with the chicken with a siracha mayo dipping sauce.  The Gyoza was packaged standard fare, but cooked well with a nicely seared wrapper.  One of the stars was garlic edamame which we quickly consumed.  \n\nOur table had the salmon sashimi which came beautifully plated on shisho leaves and thickly sliced Jalapenos in the center.  While tasty, we would have preferred more thinly sliced peppers.\n\nWe ordered an assortment of rolls and my wife had the deep fried tuna roll.  This was fried to within an inch of its life.  The technique plus the rice left most of this roll uneaten.  \n\nI'll go back, but probably on a busier night.", "author": "Dude D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-03", "description": "Dropped in for lunch and were blown away. Super fresh sushi- great portions- superb service.\nEasy street parking at noon - bring quarters.\nThey were gracious enough to accept our Groupon  coupon ( we didn't see dinner only addendum) \nCant wait to return. Hands down, the best sushi ( huge menu) we have had in ages.", "author": "Miami S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Great sushi!! We tried because of the Groupon & we like exploring different sushi spots. We always order nigiri, sashimi, some rolls & sake & we definitely enjoyed it all here!! Everything also was a great price as we normally spend more on sushi in the area! Great sake oyoko don & the volcano roll was fire (literally & figuratively)! Tuna Lovers roll, Warriors roll & 49er roll were also perfect. (:", "author": "Lindsey D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "We got this via Zesty. Loved the vegan platter!\nAvo Maki, Veggie Dragon, Sweet Potato Maki, Kappa Maki, Futo Maki", "author": "Sagar J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "This is my favorite sushi place in the Richmond. I mainly stick to the sushi items, but I have also tried the teriyaki plates and udon. Overall the menu is extremely varied, fresh, and delicious. \n\nThe customer service is excellent. All of the wait staff I've encountered are friendly, efficient, and accommodating. \n\nAlso their happy hour prices are a steal! But the normal hour prices are very reasonable as well. \n\nPro tip: get the garlic edamame.", "author": "Heidi Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "My first time eating here and I am very happy. The sashimi was fresh and service was great. The staff are friendly and knowledgable about the food. The place is cozy and nice too.\n\nFish taco and beef tattaki was my favorite! Love their specials too. Overall I give this place 5 thumbs up!", "author": "BiBiamn V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-15", "description": "I like this place! Just randomly walked by, after enjoying some adult beverages outside on a beautiful day... and I was pleasantly surprised. Oh, and I also found a really good deal. $17 for 4 sushi rolls or something crazy like that.\n\nAffordable sushi for the quality and lots of fantastic deals currently going on for everyone's budget to give it a shot. \n\nSushi tasted fresh and expansive choice of rolls and other Japanese delicacies. Conveniently located a few blocks from me, so when I am switching it up from Sushi Bistro or don't feel like waiting long, I will head here :)", "author": "Katie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Good Sushi, Good Service\n\nWe had a misunderstanding ordering but the staff took care of it and was very nice about it. The sushi was very good, this is a great neighborhood find that I would recommend you try.", "author": "Melody H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "I went here with my mom for lunch.  For my mom she has a California roll while I had a Veggie Dragon and Garden Roll for both of us to share.  I can only comment on the Veggie Dragon and Garden Roll as I'm a vegan which both are really good!  The garden roll taste great.  Nothing exciting but gets the job done in filling you up.  \n\nThe Veggie Dragon was actually amazing!  It was a nice combination of flavor from the grilled thin sliced eggplant and avocado plus the crunchiness of the tempura sweet potato.  I think everyone even if you're a meat eater should give this roll a try!\n\nAlso overall service from the server was attentive and great!", "author": "Green C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "Very good and fresh sushi! Love it!! Will go all the times!! Good service and all giving smell !", "author": "jian le l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-29", "description": "Stopped in for a dinner yesterday and it was fantastic!\n\nWe had 5 different  sashimi, sushi and 2 rolls !very reasonably priced for great tastig freshlu sushi.\n\nGreat friendly service also!", "author": "Grace P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "Our favorite,go-to sushi place.\nBy habit,we star with the miso soup,edamame,and we'll order the salmon skin hand roll,some special fish (I can't remember the name) and three others.The fish is fresh and tasty! If you looking for great Japanese food and great sushi you can't go wrong here!", "author": "Bri G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "The service is great, they're attentive but not overbearing. Hands down the best beef teriyaki bento I've ever had! My boyfriend and I usually order that along with the beef tataki, chicken karage, a roll or two, and whatever else peaks our fancy (obviously too much for two). There's nothing that we've been disappointed by so far, and we eat here quite often!", "author": "K Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-07", "description": "Despite my bias towards Chinese-owned sushi restaurant, I think there are some basic things that could have done better at Arashi (based on my experience and observing other guests): tea/water is served slow, soy sauce on the sushi bar was not ready, same for wasabi. The guests next to me didn't get wasabi until the sushi was on the table and they asked for it; I got a ready-to-use fork with food on it (although I could tell it had been rinsed and dried in the machine)\n\nAside from these, fish is good and overall price is reasonable. I like the chef called Wilson or Vincent because he interacted with guests during my dinner. Also the waitress was very active and she checked with other guests about how they were doing.", "author": "Grizabella L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-11", "description": "I used to do take out here a lot. But they fell off hard.  They gave me some \"tuna tataki\" it was hard as rubber they refused to give me my money back. It smelled like three day old fish. I told them it 1) was not maguro 2) it's not fresh. They responded with the attached video as if I didn't know my fish. This restaurant has terrible service and terrible fish. Avoid at all cost.", "author": "Jesse J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "We go to this place because of this one reason:\n-great service. They know how to take care of you especially Ray who is the owner. He takes care of us and knows us now since we come there every week.\n\nFood is good but SERVICE is always awesome and this place is now our go to.", "author": "Rick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "After hearing about this place from friends, and reading all the reviews here, I decided to give this place a try. I was not disappointed. Everything I ordered was delicious. I had the omakase sushi (chef choice sushi) and my friend had the cha-shu ramen. The sushi taste great and fresh and the cha-shu ramen was delicious. Especially the rich flavor broth with fried garlic. There's a great vibe to this place and the service was great. Definitely plan on becoming a regular here!", "author": "Grace S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-14", "description": "We ordered two rolls: Forest and Dragon. On top of that we tried their salmon tacos since it was something different. The food was okay tasting but we were shocked by how small the rolls were. I'm glad we came using a $15 for $30 groupon because I felt we didn't get much for $30 worth of food. Unfortunately, because of this we won't come back.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "First time here, wait staff are curteous, friendly and attentive.  Food was fresh and made to order and served promptly.", "author": "Harry T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-12", "description": "I ordered a dragon roll which was decent.\nThe california roll I ordered with real crab seemed to have fake crab in it.\nThe escolar/butter fish sashimi was horrible.  I couldn't even eat one piece.  It was maybe the wrong cut for sushi?  This is usually a very tender melt in your mouth fish.  This was tough and my teeth couldn't cut through the fish!\nSo weird.\n\nAlso, the ginger had weird white goo inside it.", "author": "r t."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-25", "description": "we live in the neighborhood. and when I say neighborhood... 1blk away.  really wanted to like this place, I'm born & raised in the Richmond district & love supporting local businesses... But this place SUCKS.  \n\nHere's why:\n1. Food Poisoning: First time we tried, it was week #1 & got food poisoning. Tried to stay open minded & chalked it up to restaurant needing to get settled.\n2. Obliterated Nigiri & Uni Don: Tonite we ordered delivery, being that we are literally 1blk away.  Yes lazy, but also have small children so it was a necessary luxury.  The order came 1.5hrs later AND the ENTIRE NIGIRI order came in shambles; as if someone shook the the box.  Think pile of fish & rice mixed up.  The Uni Don we ordered also showed up sideways. \n3. Terrible Customer Service: I called & spoke to the mgr, he said he would talk to his delivery guy but all he could do was offer me 20% off for my $100+ order (of which we ordered 10+ orders of nigiri).  When I asked for a refund on the items that came destroyed; the mgr response was 20% or nothing. \n\nI will not be going back.", "author": "Joelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "The X and the lobster crunchy rolls were SO GOOD. Free sake with yelp check-in and $17 for $30 Groupon deal. Ended up being a really cheap meal with great quality food.", "author": "Faye C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-27", "description": "This review is for the Groupon deal (prix fixe menu). I was not impressed by anything we ordered there. My white soy sauce dish had a baby silverfish desperately trying to crawl out. Google search silverfish if you don't know what they look like... no, just no.\n\n2 miso soups - mediocre, nothing special\n\nBowl of garlic edamame - tasty, but greasy\n\n4 pieces of hiyashi tofu - not very flavorful/crispy\n\n4 pieces of mix tempura - mediocre, nothing special\n\n6 pieces of plum sake sashimi - some people like this dish, but I thought the sashimi was too fatty and I'm really not a big fan of plum sauce and the leaves on the bottom of the sashimi\n\nOne roll of choice per person - limited selection of sushi rolls from the Groupon menu\n\nItems listed above definitely did not worth the $53 advertised on Groupon. One star for the food, another star for the service. No good reason to come back when there are so many great sushi places in the neighborhood (unless this is the only restaurant that opens in the midst of a zombie apocalypse).", "author": "Yummytummy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "Service was great.  We had four different rolls.  Each one was delicious, especially the lobster roll.", "author": "Zhaobin Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Stopped by this place in the way to my hotel. It was good sushi and beer for a good price, happy hour prices till 6pm was nice. Decent service. No complaints. Small and quaint atmosphere.", "author": "M W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "Everything was ordinary, but it was delivery...so, no minus points for that. I'm thinking it would be 3x better in restaurant. For delivery though, this was top notch.  \n\nAll I'm going to talk about is the curry dish, because everything else was good/okay, unremarkable. The katsu was crispy outside and moist inside. The flavor of the curry was complex, I even got the bay leaf (Good luck in my family haha). There was substance and I could tell it wasn't just thrown together. Honestly, it's better than the curry I make, and I make great curry. It's not as good as like two other places I've been to, but that's personal preference. Plus, deliiiiiiiivery ~ ありがとう、嵐。", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-05", "description": "I bought a $26 living social deal for $53 worth of food  and decided to use it today. Although the food wasn't bad and the fish could of been more fresh I thought the service was pretty good. This review is more to inform people of this living social/groupon deal because after eating there I was a bit curious to know if my meal was really worth $53 so I did some calculation. Also, I wanted to say that these prices are taken from the menu prices taken from the yelp pictures that was listed 5 months ago so I'm not exactly sure if they change the prices to meet the $53. \nHere's what I order\n\nSunset roll- 8.95\nTemptation roll- 8.95\nAge dashi tofu- 4.50\nMix tempura- 5.95 (menu offers 8 piece, pre fix is only 6)\nGarlic edamame -4.95\nMiso soup- 1.95 x2\nPlum salmon sashimi- not listed on the menu, but if you compare it to the other similar dish it will probably be 9.95 -10.95 tops.\n\nSo now let's add it up with out the plum salmon- the total is 37.20, let's say the plum salmon is 9.95 it would be 47.15. This is still not close to $53. I also want to mention I order the 2 most expensive roll at $8.95 each, image if you picked the one that are only 5.95 -6.50, you are even further away from the $53. \n\nSo although the deal is not by any means ripping us off, it is very misleading considering it is really not worth $53 worth of food. At this point, I rather have you let me order up to $53, than create a menu that is actually not worth that much. \n\nTo end this review. I give this place 2 and a half stars and have to think twice about coming back mainly cause it bothers me about the deal they are advertising.", "author": "Angela T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "1 star off for service (worst I have ever had in a restaurant, she barely spoke English and forgot or messed up half our orders) but the food is definitely A+ especially for the price, I recommend the omakase or the fish tacos", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "The quality of the food here is amazing. Not to mention the staff is very friendly. \nThey have good hours, clean location, and delivery. I used to go here when it was the rockin crawfish, but was happy they filled the spot with even better seafood.", "author": "Nicholas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "I looked for a Japanese restaurant close to where I was staying and found this awesome restaurant. I had two rolls that were amazing: volcano and dragon. I would absolutely come back.", "author": "Ines Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-27", "description": "This review is for delivery through GrubHub.\nOrdered at 9:10PM, estimated delivery between 10:15PM and 10:25PM. Nothing at 10:35PM and impossible to reach GrubHub customer service. \nThe delivery guy finally arrives at 10:50 and the first things he says is: tip!\nWhen I ask what took so long he replies \"English no good\". Sure...\nWell his tip was certainly no good as well.\nFood was OK though.", "author": "Adrien P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "The food was delicious and fresh! Great presentation and attentive staff. We had various sashimi which all tasted wonderful. Fish tacos were also great and crunchy. I especially loved the grilled steak we had also ordered. I would most definitely return again!", "author": "Juliana H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-23", "description": "The fish didn't taste all that fresh, but the lion king roll was pretty good. Definitely average for the neighborhood. Worth trying the groupon deal for sure. Edamame on the house which was a nice touch. Probably not worth getting the garlic edamame which wasn't that special.", "author": "Ann Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-07", "description": "I didn't think it was fresh, and felt the flavors were unremarkable. That said - it was delivery and often the food changes flavor and texture when sitting in the to-go boxes for a while. I'd try it again in the restaurant.", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-03", "description": "Tried this spot out because there was a good Groupon deal for a prix fixe dinner for 2 (set appetizers and you pick 2 rolls). But sadly, I was pretty disappointed with Arashi. \n\nThe appetizers were just okay. The best thing I had was the garlic edamame, but even those I kind of wished they served were warm not cold. The set came with this plum salmon sashimi that I really did not care for. It had this green leaf or lettuce with a lemon slice and a drip of this strange sour red sauce on top of really thin sliced salmon. I really wished it was just some salmon by itself. Their agedashi tofu wasn't bad, but I've had better. Shrimp and veggie tempura was pretty on par and the dipping sauce was good.\n\nNow for the sushi rolls. They tasted good, but had way too much rice. The rice should just be able to wrap around the filling inside, but the rice rolled over that and overlapped. (Imagine like the rice kind of made a spiral.) \n\nDon't believe I'll be coming back here.", "author": "Sharon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-25", "description": "Wanted to give this place a try since I saw they delivered and there was a groupon deal going on to get me in their door and try the food. Little did I know until I sat down, the deal was for a prix fix menu. If you ask me half off for a prix fix menu with VERY minimal selection is NOT a deal! I would of much rather just got the $ back and used it to order whatever I wanted. This menu had nothing I would normally order... maybe the miso soup. It just left me kicking myself I failed to read fine print. Nonetheless I gave it a fair shot since I had the groupon and was sitting in their restaurant. \n\nTo start off service was not good. No utensils or plates. I ordered sake and didn't get until I had to remind them in the middle of my meal. They also forgot to give me my sashimi from my prix fix menu but because the meal was so disappointing I didn't even notice until left and was like \"hey.... they never gave us our picked sashimi\" (whatever that is...). I also had ordered some additional things since the prix fix was crappy but let me just say I should've stopped right there.\n\nI ordered two additional things: the Butterfish Carpaccio; one word - UNDERWHELMING. But what really was the nail in the coffin was the server bringing us out grey uni. I stared at it for a bit wondering why it was that color? I should of eaten it but I did. Grey uni = decomposing uni. \n\nAll in all... a frustrating experience with no fresh fish. Why would I go here when there are 1,001 better places in the outer richmond. Thanks but no thanks.", "author": "Crystal S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-04", "description": "We ordered yam tempura roll, California roll, miso soup, and Chicken udon. According to the menu, the chicken udon was made from deep fried chicken and vegetables. The chicken was boiled, not deep fried, and the only vegetable was cabbage! No broccoli, carrots, nothing else but cabbage! \n\nThe rice for the sushi rolls tasted a bit sour. Probably too much vinegar. The yam tempura tasted like it had been made earlier today. Not fresh at all.\n\nThe miso soup was just OK\n\nI would not recommend this restaurant.", "author": "Teresa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "First time here, wait staff courteous, friendly and attentive.  Food was fresh, made to order and promptly served.", "author": "Mia Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "I have ordered sushi to go a few times from this spot and am never disappointed. The beef teriyaki is amazing and so are the Philadelphia and California rolls. Delivery time usually takes a little over an hour but it is worth the wait.", "author": "Corinne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "Check out groupon, they have had a groupon deal for quite some time now. After my first dining experience, I went to order another deal. Came here on a Monday night and it was pretty busy. Didn't have to wait long for a table but the space got filled up pretty quickly. The groupon deal was a prie fix although you get to select 2 rolls of your choice from the special prie fix menu. Service was quick. Food came out quick. The sushi was very fresh. We ordered the butterfish cappacio on the side and we would order again. We also had the miso soup, assorted tempura with shrimp and veggies and tofu agashi.A great deal and great food!", "author": "Vinkin Ken T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-22", "description": "This evening, we were one of three tables. We received:\nPoor service\nDo not attend to their guest \nUnclean table\nFood on chairs\nDirty place settings \nSmaller portions if you use Groupon", "author": "Arlene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "The only thing I gotta say about this place is the omakase was so good! And the best part of it wS the blue fin tuna!!! OHHH man if only had just that I would order it haha!", "author": "Herman L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "Nice place great food . The service was wonderful very attentive. We had a mixed tempura a beef terriaki dinner miso soup and sushi. A sweet place good portions and very quite\n The gave us edamame on the house . Nice people will be back", "author": "Stef M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "I came in on a Tuesday about 6 pm with a Groupon ($30). The place is very casual with a sports bar in front and lots of small tables all around. I ordered  a Chirachi Don (assorted sashimi with rice and dacon radish noodles), $16.95; a salmon and avocado hand roll, $3.95; and a large hot saki,  $6.75. Everything was very fresh. The churachi had good chunks of salmon, tuna, albacore, yellow fin and egg. Yummy :) With the Groupon, it was a great deal.", "author": "Me Like Good Food S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-05", "description": "3.5 stars. \n\nFrom reading the reviews on the groupon deal, I was REALLY hesitant to come in to redeem and all the \"awesome\" reviews were done by people who don't really have a consistent or trustworthy (more than a handful of reviews) yelp account. \n\nThe groupon deal is (still running as of 1.05.15) $26 for $53 dollars worth of food and includes the following: \n\n2 miso soups\nBowl of garlic edamame\n4 pieces of hiyashi tofu (which is now agedashi tofu)\n4 pieces of mix tempura\n6 pieces of plum sake sashimi\nOne roll of choice per person\n\nThey were pretty specific on what you get for your meal. The roll of your choice is of course, rolls from the cheaper end of the menu ($9 and under). They have additional rolls for $9+, which is pretty typical of sushi places around the area. We decided on the Bay Scallop in addition to our meal, which ran for $11.95. \n\nThe service was good, mainly because we were the only ones here on a Sunday night. The other table left before we ordered our food. It was a tad awkward that the staff outnumbered us. This is a Chinese run, Japanese restaurant... pretty sure because they were all chattering away in Chinese during our entire meal. \n\nMiso soup: average, not super piping hot but nothing special from any other restaurant\nBowl of garlic edamame: super garlicky, and pretty tasty unless you hate garlic\n4 pieces of hiyashi tofu (which is now agedashi tofu): it's not normal agedashi tofu, it's delicate on flavor (or bland, depending how strong you typically expect the broth to be. I've definitely had better elsewhere)\n4 pieces of mix tempura: there were more than \"four\" pieces: 2 ebi tempura, 2 zucchini, 1 yam, 1 broccoli. It wasn't super crispy like I like, and the sauce was whatever. \n6 pieces of plum sake sashimi: This was the star of the groupon, it was really good. The waiter also suggests that you don't add soy sauce, and I agree. It was delicious. I would come back for this alone (but I didn't see it on their normal menu)\nSpider Roll: over sauced, not super pretty but still good. \nTemptation: oversauced as well, pretty decent. \n\nI got this groupon for a steal since there was an additional 20% code on top of the already discounted price so I'm not going to complain. All in all, the place isn't bad and that plum sake sashimi was great. I should come back for just the sashimi. They advertise that its flown in from Japan (I'm highly skeptical but we shall see!).", "author": "Jeannie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-25", "description": "We got found this place on groupon. The deal was alright but service was so so bad. The waitress kept taking the plates when we weren't done. She also reached over us and got her hair in the food. \n\nThey also charged tax on groupon value and not on the value you actually pay. \n\nBottom line is there are so many good Japanese restaurants in the Richmond. Stay away from this place.", "author": "Lily J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-25", "description": "It's a decent neighborhood joint.  Nothing special, but decent enough if you're too lazy to drive elsewhere.  Seems to have lots of Eat24 orders.  Please note this is a non Japanese owned spot.", "author": "Joel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "You gotta check this spot. Freshest sushi in the Richmond. Really friendly staff. Great Happy hour. Solid choice", "author": "Greg D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-31", "description": "3.5 star. Only because of there Ankimo with ponzu sauce. Others? : bleh!!! \nService? Okay.\nPrice? Expensive!!! for the quality of the fish especially the sashimi. Not so fresh. We ordered 1 chefs choice sashimi, 1 chicken teriyaki, 2 oysters and 1 ankimo for LUNch and the bill was 47$ / plus tip so over 50$ \n I dont think Im going to come back here again.", "author": "Diem M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-02", "description": "Ordered for delivery and the food took 2+ hours to arrive. The sushi rice was mushy and over cooked. Prices are relatively cheap but fish cuts were also small. I probably won't be back.\n\nIf you are going to be more than double the expected delivery time, you should call the customer to let them know of the delay.", "author": "Lester W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-02", "description": "This place has great groupon/living social deals if you can find them. Way out in the Inner Richmond unfortunately.", "author": "Jane H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "I live very close by the new Japanese restaurant Arashi sushi house...so I give it a try... It definitely did not disappointed me !!! the sushi chef recommend me to try the omakase sashimi. I had haven't try any of it from other places before!!! It just taste so fresh!! And not fishy at all!!! And I ordered couple appetizer and special rolls!! They were very delicious too!!! Decent food .good decoration. Great service! I will come back to arashi for sure!!!", "author": "Hibby T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-31", "description": "I love the price point and the sushis I have experienced here (especially the toros, stay away from the rolls...someone doesn't know how to roll and way too much rice) , but whenever I order delivery, all of my hot foods arrive ICE COLD. I'm not talking warm, or slightly cool, it's like they have been in a cooler for the ride from the Inner Sunset to the Outer Sunset. I think I'm going to take a break from ordering here, until they can fix that issue.", "author": "emma g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-05", "description": "Got delivery from here through Eat24 and it took over TWO HOURS.  Hangry doesn't come close to describing the hunger and frustration I felt at 9:15 on a Wednesday with no dinner.  When it did finally arrive, all the sushi was warm - not like slightly chilled, just straight up WARM.  I was actually afraid to eat it since everything I ordered was raw but I was too hungry not too.  Well, I didn't even finish it because everything tasted so bad.  Even if it was the right temperature I'm not sure it would be anything out of the ordinary.  Sushi lovers beware...", "author": "Lindsey G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-17", "description": "Ok so the lower rating is only for the groupon and service.  \n\n3* The groupon for 4 is not worth it. As mentioned in other reviews, the sushi menu is limited with the groupon. I also agree that these rolls seemed a bit smaller that the regular roll.  So if you get 4 different rolls there's no way that you get to the amount of the groupon said price.  The food was good.  But they charge sales tax on the full amount of the groupon, with a confusing explanation of how they lower that amount when they tax it again with the full bill. We ordered 1 more roll as it was not on the limited list of sushi. Total bill including groupon, tax and tip came out to $75...Which is just ok for what we got. Could have gone to another restaurant w better quality and gotten the same amount.\n\n3* Service was also really rushed. They kept bringing out dish after dish and forced us to hurry up and finish plates so they could add more to the table. The first 6 dishes were pushed on us within 17 min. I mean who eats that fast.  The waitress was standing at our table trying to get us to hurry or move stuff over to another plate. It was half empty and seemed unnecessary. \n\n4* the food was decent...nothing mind blowing BUT I might go back for the buttery fresh sashimi we tried as well as the regular rolls.", "author": "Sharra C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Totally would order from here again!!!!  LOOOOOVED IT!  The Gyoza were a little small but so tasty!  We'll be ordering from here again.  :-)", "author": "Lissette T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "Ordered for delivery through Eat24 and the order came earlier than expected. We had ordered quite a few rolls, hand rolls, and appetizers, and everything tasted fresh and flavorful. The portion sizes were great, as a few other sushi joints we've dined at tend to make very small rolls. We had some leftovers for the next day and the rolls still tasted as great as the day before. Would definitely order again and even dine in store.", "author": "Alison L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "Came for the groupon ($17 for $30 worth of food), left full and happy. \n\nStarted off with garlic edamame and vegetable tempura, both are highly recommended if you like garlic and/or tempura. The tempura included a jalapeño which as a spicy food lover, was amazing. If you don't like spicy food, there were still a plethora of other veggies to enjoy.\n\nWe also got the crazy monkey (added jalapeño because of commentary above) and crispy CA roll. Bomb.com -- highly recommend both.\n\nService was very prompt and polite as one would expect from a Japanese restaurant.\n\nDefinitely would go back -- with or without the groupon.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "A night hot as hell. A political debate adding to the hot air in the room. No way we wanted to cook. It's Monday so our favorite Chinese place is closed, and one of my children will only eat Chinese food from there. It's complicated. So we look at Japanese food. Arashi Sushi. Arashi means storm or tempest - usually with dark overtones. I had always been leery of it. It's like Tsunami Sushi - I don't care how good it is you don't name a place after a disaster.\n\nBut we needed to eat so I went to eat24 to order food. Menu looked good so we figured out what to get and placed our order, only to be told that it's CLOSED. Say what?\n\nSo I called. No, there were just busy and were only taking orders for themselves. I placed the order and before I had said ten words they said \"delivery will be 60-90 minutes\". Well you know what? I'm invested in this now so I said that I would come pick it up. I was willing to give up the parking space. \"30 minutes\"\n\nI got there in 20. The food was ready. Same price. 3 bags. We got the food home and dug in.\n\nI can't speak to the sushi. We didn't have any. My oldest had the Chicken Teriyaki. My youngest had the Chicken Don. My wife had the Katsu Don. I had the Ton Katsu. Yes, there was a pattern but so what. This is my review damn it.\n\nThe portions were generous. The taste was spot on - we eat a lot of Japanese food and this was solid stuff. We all cleaned our plates and had food left over. The Teriyaki sauce was the right balance of sweet and spicy, and the Katsu sauce was as good as any you could find in a Japanese market.\n\nWe fed 4 large people for just a hair over $50.00. We ate well, we enjoyed the experience, and we will order from them again. What else could you ask for?\n\nOh, and my parking space was still there we I got back home. A good night all in all.\n\n美味しかったですよ。また食べて行くよ。ありがとう！", "author": "James R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "I came here a few times. The food was better than I expected. Ambiance was warm and welcoming. I sat by the bar the chef was knowledgeable and friendly. Great staff and not to mention their food was fresh reasonable priced. Will definitely visit again to try specialty and Sushi on the meal. Overall great experience would recommend", "author": "Alan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "Delicious Sushi and Rolls.\nThey have deep fried which I just love.They deliver too. I have had them twice and both times were deliveries.\n\n#1 choice for delivery Sushi.  Not sure of the actual location and ambiance but the food is amazing :)", "author": "Kimia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "It's rare that a restaurant meets all my expectations. This place has it all!\n\nFood is Amazing!\nFree Edamame!\nFree unlimited tea! Oh and by the way, it's delicious.\nPrice is low.\nCustomer service is lightning fast!\nDesert is to dream for! We had the green tea ice cream! We were fighting over it! And I'm lactose intolerant! \nPlace has a good energy to it.\nBest sushi rolls in San Francisco! The fiesta roll was phenomenal!\n\nThey have a lifetime customer! Thank you!", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Great food..!!we really enjoyed our meal here,the sushi and sashimi were outstanding and the servers were spot on. We will definitely be back.", "author": "Angel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "This restaurant was... Truly surprising!!  And by that, I mean it was excellent.  Even at 7pm, the quality of the sushi was excellent.  It seemed like they only used the good parts of the fish just for me...which is awesome!!\n\nThe garlic edamame...very good.  I had two full bowls of that alone!  It was gone very quickly.\n\nAlso, the volcano roll was HUGE!  A lot more than I expected.\n\nOverall, this restaurant was a VERY pleasant surprise.", "author": "Antonio A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "This place has on my bookmark list since it opened and I recently bought a dinner deal for two from livingsocial! It had an awesome prix fix menu-miso soup, appetizers, 2 rolls of your choice, and plum sake sashami!\n\n I LOVED the garlic edamame that it came with! I never knew how delicious a little addition of garlic can be to the already delicious edamame. My next favorite was definitely the plum sake sashami!! It was more on the lemon-y side of things so if you're not a fan of sour things, this may not be your favorite item. But I absolutely love anything lemon flavored and I thought it was a wonderful addition to the salmon. I don't exactly remember what I got for the rolls itself but the fish was fresh and the sauces they used complemented well with the fish. They weren't very consistent about the amount of rice in each of the rolls though so some pieces came out to be almost the size of my palm! Great price for the dinner though!", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "We were in the area the other night and decided to give this restaurant a try. The sashimi was fresh and had came in large portions. The waitress was super nice and made small talk with us all night.\n\nif you're a fan of sashimi, you have to order the sashimi deluxe. also ordered the 49er roll , hamachi carpachio, and blue fin toro and each was delicious. I'm coming back next week!", "author": "Wilson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-24", "description": "had this place bookmarked to try and it was pretty good. the whole set up and ambiance is nice. clean and cozy. there is bar seating too but not sure if you will see much there.  there is also a opening in the middle as well of the bar section. they also have room for a couple of big groups. I also liked the menu too which is organized by common rolls, rolls without rice, deep fried, and special. You can also make your own roll as well for $15. \n\nNow onto food. it was pretty good and price isn't bad fro the value that you get. Rolls and nigiri aren't tons of rice with little fish. It's actually just the opposite. We got \n\nMaster Oyster - 2 oysters with uni, fish roe, ponzu sauce, and some green onions. $8 for 2 which isn't too bad. presentation was nice too on the 2 spoons\n\nPoki Salad - this is a mix of tuna, octopus, cucumber, and seaweed salad with the poki sauce. i thought this was a bit small for the price but it was nicely flavored. not too oily and not too bland. \n\nSushi Deluxe - For $26, you get a choice of a row between rainbow or red and white, nigiri, AND sashimi. The roll came out smaller than expected but it was rolled with a small amount of rice so not bad. you get a pretty good amount of fish\n\nChirashi - $16, it comes with salmon, tuna, octopus, egg, white tuna, walu, and fish roe. not bad for the price but the cuts are smaller. I got it with a side salad instead of rice. \n\nno miso soups with the entrees which should be standard. otherwise not bad. will be back.", "author": "Tao Tao W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "That place is really awesome! Fishes very fresh, nice decoration,and good Service too!", "author": "Jason H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Got this delivered and it was all delicious. Great flavors. We had some vegetarian rolls, edamame, seaweed salad, and miso soup. The price was reasonable and the food was great. We'd order takeout from here again.", "author": "Britt C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-12", "description": "My fiance and I had high hopes for Arashi, given so many near 5-star reviews on Yelp. It was just okay.\n\nThere are a lot of items on the menu. We ended up getting the chef's special tacos, tuna sashimi, and a couple of rolls since we were trying to eat light. The flavors are pretty good, and the fish tasted fresh. I don't know, we've just had better I guess so nothing wow'd us. The best thing we tasted were probably the tacos.\n\nThe decor is drastically different from its predecessor - Rockin' Crawfish. The vibrant graffiti wall is gone, replaced by very zen decor. \n\nThe staff is very friendly and helpful though.", "author": "Jing D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "It's a really good Japanese restaurant the food is great and Service is really good!!", "author": "Jim K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-18", "description": "There is NO Teriyaki sauce on the salmon TERIYAKI. I called and some snooty guy explains that way it's prepared like i'm an idiot. The salmon (which was cold!) is cook in Teriyaki, but they don't no include any sauce. You lost a customer over 10 cents of Teriyaki sauce and a bad attitude.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-20", "description": "The sashimi and sushi there are SO FRESH! you will know what i mean when you try it! I had the chef's special twice and they didn't let me down. highly recommended the  real wasabi dipping they come with the sashimi!", "author": "Abby X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "I remember the last we ate at this spot was when Rockin Crawfish was here! So i was really sad when I found out that they had moved to Oakland instead. Anyways my BF bought a Groupon for this place so we decided to eat here for dinner on a Saturday night and brought my mom too since she loves sushi. Keep in mind that parking in this area can be pretty difficult especially on the weekends so you just have to get lucky, which we did but only after circling around a few times. We got seated right away. The menu has a good amount of items on there to choose from and everything sounded pretty tasty. \n\nWe ordered 4 rolls and got complimentary edamame and miso soup. Our rolls came out shortly after we finished our soup. Portions of the rolls was pretty generous and each piece fit nicely into your mouth. Both my BF and I really enjoyed the Giant Roll, which we agreed was both of our favorite roll of the night. The Crunchy Lobster and the Sept Third Roll was just as good also and each roll was very flavorful and distinct in taste. We also got the Wagyu Roll, which doesn't contain any rice but was a little on the plain side for us. The sliced onions was a good compliment with the wagyu beef though. It was great that most of the rolls come with green onion and the orange fish eggs because they really give the rolls texture and flavor! Overall, we were pretty satisfied and was full after 4 rolls. My bf wants to come back again next time to order their real wasabi and some fresh sashimi. So we will be back! :)", "author": "Mary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "We found different combinations of fishes than you normally see on sushi menus which was fun. The fish was fresh and we enjoyed our first time here.", "author": "Chi Wai M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "The food is fantastic and there is a great variety of sushi. Ingredients are absolutely fresh and everything blends perfectly together. Highly recommend this place for sushi at a reasonable price. Atmosphere was fine, a little noise but I go places for food quality. I will return here!", "author": "King Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "I like their tempura: crispy but not very oily.  Their non sea weed rolls are fine as well.", "author": "Edison T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Went here multiple times on weekdays and weeknights. The servers are polite and efficient. The food is also very delicious. I highly recommend the hand rolls such as the traditional Dragon and Spider Rolls. They also know how to make a really good bowl of Udon. The broth and the noodles are delicious. I also recommend to try their sashimi plate. They have a variety to choose from on the menu and the overall environment of this restaurant is relaxing and enjoyable!", "author": "Angela W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "Sashimi that is fresh, amazingly delicious, and presented beautifully. Very friendly staff. We had fresh tako, whole flying fish (first time for everything!), kampachi, ocean trout (soooo good), and the creamiest most flavorful uni! Left very satisfied and already looking forward to returning!", "author": "Maxine C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-17", "description": "The sushi was decent.  I find that the quality of the saba is usually reflective of how good the sushi is overall and it was not as fresh as I would have liked.  It was decent, just not great.  I found that the mixed tempura was a little soggy too.  One tip to the restaurant - put the hot and cold (sushi/sashimi) dishes in separate to-go bags.  I only live a few blocks away and by the time I got home the sushi plate had been heated to at least room temperature by the miso soup that you stacked on top of it.", "author": "Charles W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "Gotta start with the \"Beware\" first. Got this as delivery via Eat24. Instead of 1 hour delivery, it was over 1.5 hours. Ergo, mushy udon and tempura limper than overcooked spaghetti. That said, the Saka Kama was delicious -- buttery, rich, wonderful. And the fish tacos were banging. So, yeah. I'll be careful about ordering next time. But I will order again.", "author": "Nini M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "Good selection and used Groupon so pricing was cheaper than even the menu.  I went here while my friend let me stow my pug at his house.  Parking was difficult close by, but if you don't mind walking you should be able to get a spot on a side street.  Even though crowded, the waiter was kind and gentle and placed me in a room of my own, window gave view of the street.  Food was consistent with other reviews, had the Tako and Miso soup.  Served hot tea for free and it was good flavor.  Fast service, decent prices so if you are on this side of the peninsula, good place to go if you are in a spot.", "author": "Leonard P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "last night i went to this Japanese restaurant. the decoration and environment are great feel relax.also the food is very special that i have never seen .i can feel the chef make them very seriously. i will go second time for sure", "author": "Kyle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "When I go to a sushi place, I just eat their raw fish instead off Americanized rolls. So when I get to arashi, I just tried their fresh fish directly. Do you know how much parasites ankimo(monkfish liver) contains before served? Black worms just coming out from those livers. Scary right? But tasty! Good Japanese restaurants serve ankimo because they don't care to pay the labor, but just for good food and good outcome. So arashi pass the first test. My favorites from them are also the salmon belly, hamachi belly and at last the walu(butterfish), they are all just amazing! Melts in you mouth with just a few bites. Love the UNI and they occasionally serve UNI from japan(Hokkaido). Large variety of sake selections and the most important thing, I just live a few blocks from them. Thanks for arashi making my life craving fresh fish easier these days. Love you always!", "author": "Mandy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "Yummy sushi and ramen ^_^ \nGreat customer service \nI highly recommend Arashi Sushi House", "author": "G W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "This is probably the best sushi place I have ever eaten. It's delicious and the ONLY place that can make me eat salad. Their sushi and udon are so good! My go to sushi place!", "author": "Kaylie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "New to the neighborhood and a great addition.\nIf thet keep doing what they have done on my two visits, they will do well.", "author": "Joe H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "review number 400!!! whoot whoot!\n\nThank you groupon! had a great deal for a prix fix menu... miso soup, appetizers (had tempura-not greasy! :)), 2 rolls (of your choosing)! yummy goodness. fresh fish. it's very chill and clean. two things i love about any place.\n\nif you get here early enough on a weekday (4-6) you also get happy hour sushi and sake!\n\nmodern decor and helpful staff. good find and would definitely return.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "Group of 8 ppl came to this new japanese restaurant tonight, very fresh fish and great service here!  Love the fish taco and lived scallops!  All my friends had a great time here!  Will come back more often", "author": "Mable L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-09", "description": "Sushi was not good .  The uni is totally not fresh and must be the lowest grade uni.  It tasted like burned tires.  I had much better uni.  Fish was smelly and not fresh. I don't know who would give then high reviews", "author": "Shawn J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-06", "description": "Cartilage in chicken and bone in beef. I would've been very disappointed if i didn't have a coupon. Out of our meals of teriyaki and sushi, the only thing that was pretty good was my crunchy california roll.", "author": "Alyssa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-03", "description": "I'm so excited that I've found another favorite sushi spot. Tonight is the first time we stopped by this place, it was packed with a lot of people. We were sitting at the bar, we started off with the plum salmon sashimi, after the first bite of the salmon, I fell in love with this dish that I had to order another one. It's just so yummy. We also ordered the sunset roll , and the beef tataki. They all taste very good. Open sashimi order  was fresh off the boat.  \nThis place isn't too big, but very decent, they also have private room for party up to 14 ppl. I'm definitely  coming back to this place soon!", "author": "Daiz Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "We came, we ordered, we loved it. Six of us had a marvelous meal- the sashimi was to die for. \nBefore the meal was over we are making plans to return.\nBest waiter, great prices.", "author": "Red J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-28", "description": "We ate at their restaurant yesterday. We have ordered 10-11 kinds of nigiri and 6 kinds are from the happy hour menu. We have also order one spicy salmon roll and some of their happy hour oysters. Our waitress is really nice and attentive. When we try their sushi it doesn't taste really fresh. Me and my boyfriend went home both suffering from stomachache and diarrhea for the whole night. I think we got food poisoning. I have to take a day off from work and now deciding if I should go to an ER. 2 stars are only for the attentive waitress.", "author": "Shelly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "Edamame, rolls, gyoza and tea all amazing! We will be back - delicious and affordable sushi!!!", "author": "Caroline R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-31", "description": "I ordered a Philly, a The Rock, a bowl of miso and a green tea. the Philly was done incorrectly; a correct Philly is SMOKED salmon, cream cheese & avocado. their salmon was not smoked and there was no avocado. the fish on both rolls had a mealy texture and didn't taste fresh but were okay enough to eat (I understand some days are better than others). not enough miso in my bowl. the cup of green tea felt microwaved. these things can't be counterbalanced by having a friendly ultra sexy waitress, but that was nice anyway", "author": "Loren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "I came here with my boyfriend for dinner, and we bought the Groupon deal. We were amazed by how fresh the Sashimi was. We ordered a soft shell crab for appetizer, 10pcs Sashimi, a Crunchy Lobster roll, and a Wagyu roll. They were so yummy. We especially liked the Wagyu roll. The beef is very tender. Minus the Groupon, we paid another $35 out of pocket. It's not bad at all for a sushi dinner. This is a place to try. If you have Groupon deal, it would be even better. Definitely come back for sushi.", "author": "May N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-06", "description": "Came back after I got a really good Groupon deal and I had really liked the restaurant the first time. \n\nHowever the second time, left me very underwhelmed.\n\nMy biggest gripe is the sushi rice and uni. \n\nThe sushi rice did not have enough vinegar flavor and sweetness. All in all it tasted like dull plain white jasmine rice rather than a glossy grained tangy rice.\n\nThe uni did not taste fresh. Don't get it. \n\nThe other sashimi pieces were very good but underwhelming compared to my first experience. \n\nA+ to the service though! The young lady was very courteous and always refilled our tea.", "author": "Lianna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Went here on a Friday night. Easy to get a table. Used my Groupon and ordered 4 rolls, garlic edamame and gyoza for around 50 bucks. There was a lot of food between two people! Great service! Would definitely go again!", "author": "Jenn Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "The restaurant has unassuming entrance but the interior is clean and has a couple of large screen televisions on the walls. The sushi was fresh and menu was diverse. They even have Ramen! The bathrooms were very clean and the service was GREAT! I will be back for sure!!", "author": "Marisa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Fresh!!!  And grilled food is good too. Must try. Perfect location to eat, not to hard to looking for parking on Geary.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Wow!\n\nMy family of four loved the experience of eating here.  The garlic edamame was amazing.  Yum!!!  We enjoyed the taste adventure as we tried the different dishes. The presentation of the courses were thoughtfully arranged with lovely small details that enhanced our experience. \n\nThe staff was down to earth and welcoming.", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "I've only ever gotten delivery from these guys, but talk about being rock solid. Who else can you possibly trust to deliver an amazing omakase meal to your front door? The quality is so much better than your average joint. Also, I asked them, if they had time to give me a list of the fish in the omakase so that I could order in person at some point. I thought it was just going to be a short list, but they totally bowled me over when I received my sushi with little labels taped over each piece on the plastic container. Such an awesome gesture and a testament to the love and detail they have in prepping your food, and it is exactly what makes me order from them all the time.", "author": "Clarissa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "Very good, fresh sushi place! Their salmon plum sashimi were to die for!  I ll recommend this place!", "author": "Latefa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "This spot is delicious :) it was a super cold day in SF so the miso soup was a great start. The garlic edamame is a perfect balance without too much garlic. Had the salmon sashimi, rainbow roll and san francisco roll. Great service too! It's a little out of the way for me but it's nice to venture out. Definitely coming back.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "The place was clean and pleasant. Food was decent and prices were reasonable. Groupon deal was a steal. \nGarlic edamame, plum sake sashimi, tempura were all good. The rice-less rolls wrapped in cucumber are refreshing, like sushi salad, but don't think I'll get that in the future. \nI don't know why there were not more people there on a weekend night, but that's a plus on my book since I hate long lines for food. Could it be because it is operated by Chinese? I don't mind since I'm no purist and I eat pizza from non-Italian operated businesses.", "author": "Meimei M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-28", "description": "The quality of their fish is questionable; I received a hamachi nigiri that looked jaundice and smelled really weird. I avoided it, but continued to eat around it. After my meal I immediately began feeling the usual symptoms of food poisoning. It's been 4 days and I'm still feverish. My doc said I have an infection in my digestive system. Boo", "author": "Sarra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-10", "description": "I tried this place three times now & it kept getting worse. Unfortunately the this last time will be just that - last. The eel was good (but very small portions) & the other fish I ordered didn't taste fresh at all. I didn't finish it as I am scared of what my stomach is going to do later. It is cheaper and it was fast delivery but I'd much rather spend a little more and get fresh fish anyday!", "author": "S. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "I was here on a cold evening when I was just craving for some hot Ramen and since I am vegetarian, I was glad to know they had many options for us as well (not just for Ramen though). We ordered some garlic edamame, asparagus sushi roll, a bowl of rice and veggie tempura, all vegetarian. Everything comes in good quantity and it all costed just $30 (tax/tip exclusive)! and how can I forget that free sake I got with my yelp check in! You can easily find parking around, may be a block down on clement. I am definitely coming back to place!", "author": "Pratibha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Came here tonight for my husband's birthday dinner party. Very clean, super friendly, great service &very attentive!!! Food was amazing. We had a party of 6 and used groupon. They honored it and said we can order anything from the menu and they took $30 off a 200 dollar bill. Yay we will be back that's for sure. The mochi ice cream was very chewy tastes really weird wouldn't order it but besides that everything was amazing especially the green tea cheesecake! Can't really complain for the complimentary cheesecake and assorted mochi ice cream simply because it was complimentary for the  birthday boy.", "author": "Michele T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "I love the super dynamite roll, free edamame.big portion of teriyaki salmon,but portion of Raman.overall,my friend and I like this place and will come back!", "author": "Andy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "The Ramen is delicious. The mochi ice cream wasn't too great. But overall the food is great", "author": "Mitali G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "I really liked the butterfish carpaccio and the salmon sashimi. I used the groupon deal for the restaurant and got a ton of food. There's a set menu for the groupon where you get two soups, two appetizers, and two rolls. The servers we had were very nice and they even taught us how we should eat certain dishes. It was a fun time!", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-24", "description": "It's ok, I've had better.   although delivery is pretty quick through eat24 .  Sushi quality is far from best as someone stated in previous review .  Don't get me wrong  it's ok for a quick bite and for delivery   It's just not ....what I expected", "author": "Damien F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-19", "description": "Good price. Generous portion. They know where to get really fresh fish too! Love Ankimo and Uni. It was super fresh and sweet! \n\nThe only problem we had was with the maki rolls we got. The quality is about the same with those 'sushi' you can get in Walgreen and 7-11. The rice was overcooked and soggy. the roll was falling apart before anyone touch it. \n\nNice and quick service.", "author": "Bobo V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-13", "description": "Mediocre quality of food. Waiter was on phone texting instead of checking on customers. Beware of their LivingSocial deals for this restaurant. They limit  rolls to the cheaper rolls so it wasn't really a deal any more.", "author": "Hieu P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-11", "description": "Best ramen in the Richmond, no question. The sushi is on point too. the new hawt spot. if there was anything better than the orgasm in my mouth, it was the service! I mean the visual, timely, and amazing service almost made me forget about how this food nearly made me scream out in pure passion! ooooooooh! my gosh leg shaking food. an experience in your mouth that level you wanting more.", "author": "Harry B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "I was looking for Japanese food on yelp and \"arashi\"showed up.then me and my friend decide to try this new restaurant . after I looked at the pictures shows in their business page. I ordered the Omakese sashimi and couple rolls. the sashimi looks pretty fresh and yummy.. and the sever also explain what kind of fish did I get..very friendly service .. and I really like the white out and crunchy lobster roll ..and I heard about their ramen is very famous too..i would back to try their ramen for sure next time .", "author": "俊伟"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "this sushi place was really good. We went on Friday night. Make a reservation cause this place gets busy. The food was amazing, presentation beautiful, and the staff was super nice. I will go back。", "author": "Fanny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "Their ramen are the best! I enjoy the chef choice a lot , they just made my day!", "author": "Kenny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-14", "description": "I'm a visitor from out of town. The menu looked good so I did the take out. The rice was starchy. Too much rice in the rolls. Every plate and bowl brought to me was dirty or sticky before I even used it. For dessert don't bother with the mochi. It was terrible. The coating tasted freezer burned. So much for convenience.  I will never return.", "author": "Irma G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Excellent service and food. The service was friendly and attentive, but not obtrusive. The sushi was very good. My seafood udon was excellent. My friend's Saba dish was excellent. My best Groupon experience!", "author": "Julia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Our go-to for sushi delivery. Consistently good, fresh food. We love the hamachi kama and salmon teriyaki. The rolls are decent, too. Delivery is quick and prices are reasonable. At the rate we order in from Arashi, I'm bound to give their other dishes a try soon...", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-06", "description": "Solid Japanese/Chinese food.  The beef teriyaki was plentiful and flavorful.  Not a fan of the spider roll--a bit overcooked.", "author": "C L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "The raw fish is good. I always enjoy the sashimi!!!\nThe fish taco is my favorite. Hamachikama is delicious too. It is good place for friends and family dining.", "author": "Connie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Love the lobster roll!!! My kids love the California rolls and Tempora udon. The Groupon for $30.00 is a great deal too.", "author": "cal t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-01", "description": "My GF purchased a Groupon deal:\n\"$26 for a sushi dinner for two (up to $53 value)\n\n    2 miso soups\n    Bowl of garlic edamame\n    4 pieces of hiyashi tofu\n    4 pieces of mix tempura\n    6 pieces of plum sake sashimi\n    One roll of choice per person.\"\n\nWhat's disappointing about this deal is that you don't get to select rolls from the entire menu list. They give you a restricted Groupon menu with a smaller list of rolls that doesn't include the more expensive rolls as an option. WEAK! They should really just list the Groupon restricted menu on the Groupon page, so buyers can know what they are really purchasing. I took photos and will try to post later. \n\nIn terms of the food, the taste and quality was average. Nothing special as I wished from reading other reviews. The hiyashi tofu dish was cold, bland tasting cubes of tofu that fell apart easily. The tempura was good with the right about of crunchiness, but portion is a lot smaller than other places. The rolls that came with the order were also on the smaller side and the taste was okay. The spider roll could've been better and the Temptation roll wasn't very tempting. We also ordered a sashimi regular dish to go along with the rest of the meal. The sashimi was fresh and tasted about the same as any other place. Menu prices for items are higher than other places of equal or better quality. In the end...I'm left wanting more from this place and my stomach is disappointed.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Went it today and had a sushi deluxe as well as some sashimi. Fish were amazing and fresh. The server who helped us was very nice and helpful. Overall a great experience.", "author": "Mark K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-12", "description": "this is more of a 3.5 review.\n\nchecked it out due to a groupon deal. it was a prix fix menu that was barely enough food for us (2). \n\nthere's a lot of rice on the rolls and it was mediocre.\nthe agadashi was pretty good.\nthe tempura was good (you can't really mess that up unless it comes out soggy)\n\nso it was a mediocre experience. unfortunately for this place, there are many other japanese restaurants in the same area so i'll be going to the other places.\n\nbut i'm glad i got the group to check it out.", "author": "Vanae W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-20", "description": "We stopped by for dinner because of their groupon deal that was $26 and suppose to be worth around  $53 worth of food. The deal was very misleading because it was a set menu SHARED between two people when i thought we each would get our own. Our dinner came with miso soup, a bowl of edamame, cold tofu (tasted like they just took a carton of tofu out of the fridge and poured some soy sauce on it), tempura that came with two broccolis, shrimp, and two green beans, two sushi rolls, and six pieces of sake sashimi. We chose a spider roll and one of their specialty rolls and they both only came with 4-5 pieces... The only good part was the sashimi (which they were not going to serve us until I showed her the groupon deal on my phone which listed all the item included).  The sake sashimi was served with some kind of sauce, sriracha, and a jalapeño. It wasn't like anything we've ever tried before.  Items on the menu were pretty pricey for the amount of food you get... And yes we left hungry. I guess for $26 it was ok, definitely not worth $53 tho.", "author": "Linz C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-25", "description": "Mediocre salmon teriyaki ,mediocre sashimi sake. Service was a mediocre at best after getting the salmon teriyaki order wrong followed by a 20 minute delay to get the order corrected. Prices are reasonable.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-27", "description": "this place is okay. their service was good, but i ordered a couple of different rolls and got a stomachache afterwards. i think if i'm in the area, i'd to give it another try, but there are so many other choices, so we'll see.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-22", "description": "Took an hour and a half to be delivered the wrong items, which were soggy and inedible. Staff wouldn't do anything about it and said manager would call me back but that hasn't happened.", "author": "Erica R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-29", "description": "Came here on the $26 for $53 Groupon dinner.\n\nWe didn't finish most of the appetizers, which includes edamame(too buttery), hiyashi tofu(bland), tempura, and miso soup.  The sashimi was all right, and the sushi rolls we ordered (spicy tuna, temptations) were good.  Their hot tea tasted like plain hot water.\n\nThe value of the Groupon offer is lacking, but as it's close to us, we may come back just to try out more sushi options and see if it's a better deal.", "author": "daphne w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "Found this place on Yelp while looking for Sushi places in the area. Menu prices looked reasonable and the pics looked good. I was looking for a place that offered a Sashimi sampler for $20 or less. Price for a 10pc Sashimi Sampler was only $16.95. Also ordered the Sushi Regular (5pc with CA roll. Very reasonable price. Relatively large pieces of fish which were really fresh tasting. Surrounding area looked a little dodgy because of the motel and massage place next door. Interior was nice and clean looking. More modern than Japanese looking. Service was quick and efficient. Will have to return to try other things on the menu.", "author": "Ronald C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "Nice place, good atmosphere,Fresh!\nI have come back there three times,it means i like it:)", "author": "Armand A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "I love this sushi place. It is really nice and they usually have a groupon so it's a really great deal. He service is nice and the rolls are HUGE ! Considering how the big the rolls are they are really well priced. So worth it. Also, I order delivery from them regularly and it's good. That's saying a lot because finding a good sushi delivery is almost impossible.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "Consistently delicious rolls. Great appetizers (the salmon with jalapeño is our favorite). Servers are incredibly attentive and very helpful! Great little hidden gem :)", "author": "Tori M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "I love this place , affordable and awesome service ^^! The interior is quite small but provided a really warm atmosphere also the music  they play there is nice too. I went in yesterday with my boyfriend we had some beer to start off with. The service was amazing, our waitress kept checking in on us and quick to punch in our order, most importantly she was smiley and didn't rush us when it past their closing time. Anyways we ordered some uni nigiri, which was really fresh no bitter taste to it it was sweet. We also ordered the regular oysters and oyster shooters. Im an oyster fanatic and i just wanna say they have like the most perfect size oysters ever (cause i like them tiny) even my boyfriend who doesn't eat oysters much ate a lot that day. We ordered the plum salmon sashimi, tasted really unique cant describe it but its pretty amazing. Btw the food came out pretty fast so im glad. We decided to order some sake midway of our dinner, even though theyre almost about to close they still let me which is a double plus plus ! Anyways ordered two rolls and also the hamachi carpaccio. The rolls has a nice presentation tasted fine no rice or the filling falling out. Aside from the oysters the hamachi carpaccio is my favorite! It was so fresh, flavorful, and melty , absolutely my favorite. I am definitely coming back here next time with pictures taken!", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "My new favorite sushi restaurant. Amazing tuna 'tacos' that you'll want more than one order FOR sure. Love the Hollywood roll. Blue tuna toro is insanely fresh and buttery. Sashimi and nigiri won't disappoint. Loveeee this place and the service is always great and very accommodating", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Sushi for days and it was heaven!! We had a group of four and had a group dinner and split everything, they have a half off saki for yelp check in, and took groupons! It was ammmaaazing!!!", "author": "Kylie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "Excellent food, service and prices.  Complementary Edamame as soon as we got a table. We ate around 5:30pm and took advantage of some happy hour prices.  $3  California rolls, gyosa, skewered chicken and a whole bunch more.  Our table also ordered  salmon and chicken teriyaki that came with rice, a salad and a bowl of miso soup for just over $9 each.  I ordered a tuna/avocado roll and the tuna was excellent.  The dining room is clean and is a comfortable place to enjoy dinner.", "author": "Toni M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "I am a big fan of Japanese food,  and I like to bring my family to different style of Japanese restaurant all over the San Francisco Bay Area. Arashi Sushi is, by far, the great place to go. \nI have only been here twice at lunch, and both of the lunch service are exceptional. The server is very sweet and caring. The pork of their Tonkotsu Ramen is superb, very tender & flavorful. I also like their sushi,  fish are all super fresh and yummy, and their sushi presentation is artistic! \nI'll definitely come back here again with my family if I'm in the area.", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-03", "description": "Le bf and I come with the Groupon deal like everyone else. Long story short, the rolls have way too much sauce, and the sashimi was ... Interesting. We also order the ankimo in addition to our set meal, and it was not bad. Would we come back again? Probably not.", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-30", "description": "if i can give them a 0, i would.  but you know how yelp is. we decided to try this place, ordered simple roll, 2 nigiri.  we are maybe 10 mins away from them, took almost an hour for delivery.  the guys came and the box was all tilted. when we opened it, the roll and nigiri was all over the place, there's sauce on the roll.  AND the nigiri wasn't what we ordered. called the restaurant right away, the women on the phone is speaking chinese to the delivery, to the manager and when i said, don't make another one, just cancel and refund.  we've already waited an hour, not going to wait for another 30 min to get food.  she first tells me, they can't do that.  then she's talking to the manager saying not sure if i'm lying about the wrong order.  \n\nhello!  do you not know what you made and didn't make?  thank god i took pictures.  when i said i'll send the picture back, she immediately said no no, we'll refund.  \n\njust to make sure, called grub hub and told them as well to make sure i get refunded.  crazy way to do business and terrible customer service.  tons of sushi places in this area, never try this again.", "author": "Silver C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "So freaking amazing!!!!!!love it so much...the freshness & quality of sashimi is top notch. Every dish is carefully thought out and  beautifully presented...anyway. Juz one word that I can say... ((((Amazing)))......", "author": "Jenicababy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "This is the second time I come here and the fish selection is more than the first time, and I think I over ordered a little bit but no regret. I cannot remember all the fish I ordered but they are all fresh, I think that's good enough.", "author": "Edmond W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "Had the best fish dish at Arashi Sushi House. Really fresh fish, loved the red snapper, てんぷら、and ウニ. Definitely  need to go there with friends again. Good for party and group. めっちゃ美味しかった。", "author": "Jing F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "First rate experience from the time we were seated to the time we left. We were served green tea with roasted rice as soon as we were seated...very good tea. We ordered shrimp tempura and gyoza to start. The tempura was light and delicate and the gyoza was very tasty. We were served edamame and miso soup as part of the meal, we were not expecting that...it was a pleasant surprise. For our main meal, we had Tonkatsu with curry and Chad ramen. The servings were generous and the taste was authentic and delicious. A very good value. Would go back again for sure and would highly recommend it to anybody. BTW....never given a restaurant review before...felt I had to for this place.", "author": "Lilibeth A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-12", "description": "An hour late with delivery. The tofu in the miso was microscopic. The ramen was very bland. The only thing that was just ok was the sushi roll and that was by far way too small for $12. I will not be ordering from them again.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Dining in was pretty good. The sushi was better than expected, and I am now a returning customer if I crave sushi around the area!", "author": "Eric H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "I walk in here with my girlfriend last saturday. We got seated right away in a timely manner!! We ordered the omakase with special that we never heard of. If you love sushi this is a must have! Service is fast and great!! We will definitely repeat.", "author": "Yogotti J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "Coming from dusty old Butte county in Northern California, I don't get to enjoy such delicious ramen and sushi often. This place was fantastic both times I went. Friendly and helpful staff. Lost one star for timing, had to wait a while while for my wife's food to eat. Go to this restraint, it's great.", "author": "Arnold D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "This might be my new favorite sushi place in the neighborhood. We had a delicious sashimi plate and a couple great rolls.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "This place is amazing! The kar-age ramen is great and also the night roll. The staff was friendly helped with any questions. A must check if you're in the area. 2 thumbs up!", "author": "Ted H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "Just pass by and noticed this is a new sushi restaurant here, walked in with my girl friend to see how is this place.\n\nWe ordered \nOmakaze sushi--came with 6 pcs sushi with $17.95, I asked what kind of fish on that, the chef told me all the name but I could not remember any1 of them because I have never seen or heard of them, the chef said he will have a box of fish delivered from japan every week and weekly different! That is soooo cool at that point . Also the flavor was yumyum!\n\nSeptember 3rd-- shrimp tempura and avocado inside top with seared scallop, hummm I felt like okay with this roll, not thing special. \n\nChashu ramen-- recommended! I mean I like the soup, they told me that was home made ramen soup, strong flavor! I like the soup more then the noodle lolz. They told me the chashu is home made as well, taste okay.\n\nMix tempura-- 2 shrimps and 6 pcs of vegetable, not thing different from other restaurant. The shrimp was a bit over fried I think. \n\nThe serve here was good , friendly even tho they have Chinese accent, but that was totally cool. \n\nThe construction is ordinary but the place is clean. \n\nI will give this place 4 starts. Will come back next time;):)", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-01", "description": "The tasting menu was incredible. The staff were kind, helpful, nd knowlwdgable. Would def come again and again. There are few places with better prices. With several nice tv's it's currently a wonderful place to watch a Sunday or Monday night game.", "author": "Ashur B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "Came here the other night with bunch of friends. We all lived close by and just decided to try this new place out. \n\nAnd it was surprisingly good, excellent service. All their staff greeted us with a big smile right when we walked in. Fish was fresh and portion was good too compared to prices\n\nHighly recommended and will definitely be my usual sushi spot from now on", "author": "Ivan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "Ordered through Grubhub and it took about an hour to arrive. We got Unagi Don &  Katsu. We actually thought they were the best Japanese delivery food we've had so far in SF.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-22", "description": "Incredibly fresh fish.  My chirashi order wasn't huge but best quality I've had, and I've had a lot of sushi.", "author": "Julia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "The omakase sashimi is amazing, it comes with all the fresh daily special fishes, and the blue fin tuna toro is best of the best, i will be back for sure!", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "Another 5 stars for this place. Came with a larger group this time and looks like they upped their game with complimentary salad and edamame now. Food is also on different plates and even better presented than last time when I came. These simple things make for some great customer experience. Keep it up guys!", "author": "Kyle Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "Amazing food ... Fresh and authentic. ! Friendly staff- good service / \"I'll be back \"", "author": "Lee A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-14", "description": "Poor service, unprofessional attitude treating a groupon voucher customer, lack of knowledge, charged tax on groupon and charged sales tax on top of groupon tax. Food wasn't the best, just simple fried food with grocery store sauce. Nothing unique, lots of restrictions on the selections of the rolls you can select from, it's the lowest grade and value from the menu and does not add up to the actual retail value they declared for party of two or four. There's much more better options else where in that neighborhood.  Service wasn't attentive, you have to ask for it, and the server who was the host was constantly doing personal things, eg. Starring at the smart phones...", "author": "M W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-28", "description": "If I can give it a 0, I would and they deserve it.\nWent there for a quiet Friday night dinner with two kids and my wife. Had Groupon deal like everyone else.\nGroupon deal I super misleading and confusing. Good luck understanding what to order from the menu. \n\nSince we didn't quite understand...\n\nWaitress was rude to my wife when ordering.\n\nThe edamame with garlic was super soggy. Tofu was decent, tempura was good. The sushi took FOREVER to come out. They clearly forgot about my nigiri I ordered as well as the salmon sashimi. 35 minutes into the appetizer, we're like 'where the hell is the real food?'\n\nManager comes in to apologize, I ask for our food. He comes back later and says 'sorry, out of the frozen Saba, would you like a fresh one?' I say ok, that takes another 10 minutes to serve? Why didn't they tell me ahead of time? One piece had wasabi underneath the Saba, the other did not..how odd. It was not good.\n\nThe waiter/manager even said he'll charge me normal price for fresh Saba nigiri..nope..10 Bucks my wife said afterwards..\n\nThey knew we were getting mad, so the waitress said 'dessert is free, I'll be right back' 15 minutes later, I had enough and walked out with my son while my wife stayed with the younger one. Horrific service.\n\nJust asked her (a day later) 'how was the free dessert?' She scoffed at me and said 'they never gave it to us!'\n\nShe had to walk out of the room to just ask for the check. Sad.\n\nOnly thing good was that we had a semi-private room facing Geary street. It was peaceful since both kids are so loud.\n\nOverall, HORRIBLE service, mediocre food. Would not recommend, even if the groupon deal looks appealing. I'd rather eat mall sushi.", "author": "G L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "it's so nice to find a dining experience with deliciou food,best omakase sashimi.we ordered soup,a few appetizers and omakase sashimi plate all to share and it was plenty and satisfying.we will definitely be back again!", "author": "Fion T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-10", "description": "A group of friends and I decided to celebrate a birthday and it was the best decision! The food was fantastic with good portions and the service was phenomenal!! I highly recommend trying them out, definitely one of my new favorite sushi spots!", "author": "Meghan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-18", "description": "Amazing spot and very reasonably priced! I've had sushi all over the world, and this was hands down some of the best I've ever had. Had the spicy tuna and sake avo roll.", "author": "Blake S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "I have been wanting to come in and try the sushi since Arashi opened up less than 4 mos ago.  The former place, a crawfish restaurant, did not last very long. You know, there are a lot of sushi restaurants in the inner Richmond. I ordered the Foxy roll off their \"Rolls with us\" section. Amazing. eel, avo, mango, topped with tuna, white tuna, white tuna, and tobiko. You have the salty, sour, sweet combo. The tiny little Flying Fish eggs added a delicious crunchiness to each bite. Yowza! And affordable too.", "author": "Jewli J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "The food was tasty and fresh, the restaurant was clean with nice ambiance, the service was pleasant, and the prices were a good value.\n\nThe food exceeded my expectations for the price point and everything was very fresh.  I went with my mother, who generally hates to try different kinds of food, and she enjoyed it as well.\n\nI tried the three item lunch special with two nigiri rolls and the vegetable tempura, all of which were great.  Some other reviewers have commented on the service being slow and it wasn't for me and my family, but I could definitely see that the one waiter working that day was on the inexperienced side, so experiences with the service may vary as the wait staff become more seasoned.", "author": "Johnson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "Been here once. Recent discovery. Food and service were great. Servers were really polite and attentive. Will definitely come back again. Love this place.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-16", "description": "i'm  here again at arashi i sushi hause...with there best sushi...best food  and costumer  service....5 stars from me...try it and you will love it..", "author": "Dennis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "The living social deal is a total steal!! For $25, you get garlic edamame, miso soup, a tofu appetizer, shrimp/veggie tempura, salmon sashimi and 2 rolls of your choice. This is the first time we left sushi super stuffed! The waiter was also really friendly and attentive. My only complaint was that the sushi was pretty salty.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "Prefix meal from Living Social. Service was good. Roll has large selection. All white roll was very good. Lobster roll and Salmon sashimi were good too but the flavor was too strong to me. Free hot sake with yelp check in. Would come back.", "author": "Mason Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-26", "description": "Ordered delivery.  They were an hour late and didn't get the order right.  The fish was tough.  I ordered a mushroom skewer that was supposed to come with daikon and ponzu sauce. They gave me four very sad, very soggy, and very naked looking mushrooms.", "author": "Hanah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "Sushi is easily my favorite food; one might call me a sushi connoisseur. I've eaten here twice and absolutely love the service, quality of the fish, and variety of rolls. HIGHLY RECOMMEND EATING HERE.", "author": "Brooke L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "Hippy is great!  The food was awesome and we really had a great meal. We highly recommend you to check it out!!  See you there!", "author": "Bob J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-07", "description": "It's not very professional for sushi making and I order the uni. It taste not very fresh. The food is  expensive  but I did Not get a very good quality of the food.", "author": "Linruo Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-19", "description": "Reading some of the other reviews of this restaurant makes me wonder whether those diners visited the same restaurant I did.  I have eaten at literally hundreds of sushi restaurants across the world and this place is in my top three.  I ordered the Chef's Omakase and got eight incredible nigiri (including salmon belly, blue shrimp and baby lobster) for $24.  In NY, that same selection would have cost me at least $40 -- in Tokyo, $60 -- and I would have had trouble even finding the blue shrimp.  This is not your run of the mill Cal. roll kind of place, but if you want gourmet sushi at a reasonable price, this is the real deal.", "author": "James R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-21", "description": "Age dashi was a 3. Spicy tuna and spicy salmon rolls average. Ika nigiri average. Hotate sashimi was a 4.", "author": "LT B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "A really delightful gem in the Richmond! The staff is super polite and efficient. I stop in here after work for udon and maki and I've been consistently happy with the quality of the food and you can't beat the price. I highly recommend this place!", "author": "Kate S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "so amazing！i like it 。。next time i will bring my gf to there agian！all food are good，almost drunk at the day", "author": "Jiedong L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "We visited it today with a Groupon ($15 for $30 dinner). We ordered white out roll, fish tacos and two ramen (char-shu with pork flavor and chicken kara-age with pork flavor). Everything tasted awesome and fresh. Great deal with groupon!", "author": "Quan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-15", "description": "I really enjoy Japanese food and found that this place had taken the spot from Rockin Crawfish, so I decided to check the place out. First off I had an ankimo appetizer and it was above par. I asked and found out that they actually taken fresh out of the fish and prepared instead of the packaged ones that people serve elsewhere. Would highly recommend. Then I came around to the sashimi and one really cannot go wrong here, and as expected it did not go wrong and went great. At the end of the day this is a great place to add to my list of places to return to.", "author": "Raymond Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "I went with friends for dinning at this sushi place. All i can say is their food is incredibly fresh! That is all it needs for a sushi place! Highly recommended.", "author": "Arvin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "I came in with a livingsocial deal to try out this new place and it was a great experience. I came in time for happy hour and they have a good amount of items to choose from for happy hour. The $1 oysters were better than usual from other places. The quality of the nigiri is good for price point. The only drawback really was the tea which tasted like hot water only. Overall I think I would come again since service was great and prices were good.", "author": "Catherine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "Very friendly staff, excellent quality and generous portions. Great value for the money. A must try for casual dining.", "author": "Gralen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "Excellent service, great atmosphere, excellent, fresh fish. They have the staple rolls that you'll find anywhere but also really inventful, thought-filled rolls as well. Try the fiesta roll. It's a great combination of flavor.", "author": "Robin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-09", "description": "Pretty low quality sushi. Ordered delivery. Miso soup arrived cold. But the major bummer was no soy sauce! Come on now!", "author": "Ali M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "So I love this place.  Got a deal of living social and figured \"ehh, typical sushi dive with same old, same old.\" I was pleasantly surprised by their new twist on traditional food. Starting with the garlic edamame, nice change up.  The sushi was fresh and bursting with flavor. The spice tuna was not spicy enough but hey that is what Siracha sauce is for.  They had the best tempura ever.  Given my mother is from Japan and it is a household staple in my family, all tempura is common at best.  But theirs was magical.  Their ingredients fresh and cooked just right. Bravo.  5 stars is for perfection so I took it down 1.  Attentiveness was great, always filling water and taking dirty dishes away quickly.  But the table they seated us at needed to be cleaned when we sat down and food bits flew everywhere with the towel they used.  We asked for Sirach but they forgot so we had to go get it ourselves. But these would be my only complaint.  The no carb sushi choices were interesting and even tasty.....but me thinks me likes my rice.", "author": "Marcia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "Very Good Sushi~ Very Reasonable Price. Got to try the Tempura Mushroom and the Fish Taco. All the fish are fresh. The Omakase have All the special fish in it. Uni is also very good. 5 Stars no questions.", "author": "Evan P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-27", "description": "holy crap! this is the worst trained staff I have ever dealt with.  my app of oysters came  when I was through my main course. the soup came same time as the main course and had waitress standing 3 feet away with crossed arms waiting for us to finish.please don't even try the groupon deal.  really really really!!!  its not worth it! then the bill says you should tip 25 bucks!! sorry.    BAD DEAL!", "author": "Fritz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-18", "description": "This newly opened restaurant in Geary st is really amazing. One of the best service and great food. Good location. Interior is really nice. I loved their sushi combo.", "author": "Yu S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-16", "description": "Another horrible wannabe japanese sushi restaurant in the richmond district. I dont understand why people think anyone can just open up a shitty sushi restaurant and expect people to pay a high price for horrible food. Arashi sushi house is another horrible addition to the cluster-fuck of bad restaurants in the richmond. The Gf and i ordered 5 dishes and each one were complete let down.  First off, the tako sunomono was just plain disgusting, it literally tasted like the frozen octopus you get at the asian super market ( im pretty sure it is from a shitty asian market ). The octopus was still frozen in the middle and the cucumbers we butchered in all different sizes which made it unpleasant to eat. There was almost no dressing so it just tasted like a frozen bland bowl of crap. The hamachi carpaccio was fishy and hard to stomach. The spider and hollywood was boring and plain. The sushi rice was mushy and tasteless. The mixed tempura's batter was hard and dense. i really dont know how and why this place has four and half stars on yelp, but im pretty sure as time goes on this place's rating will drop. And like the business that was previously there before, i wouldn't be surprised if this place closes its door for good within a year or two. I will never come back here and i advise anyone else thinking about trying this place not to come here.", "author": "R S."}
