{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "Tips:\n\n$30 for 2 pizza's (12 inch)\nFull Harvest (vegetarian)\nChicken Alfredo (mushroom, bacon, chicken, cream sauce)\n\n----------------------------------------------------------------\n\nI would agree that the pizza here is a bit messy because the crust under the pizza can get a bit soft and the toppings fall right off. I would suggest being careful when eating it or just eating it with a fork and knife!", "author": "Alice H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-04", "description": "I got a shrimp salad sandwich through Mealpal. They had it ready when I arrived. The sandwich tasted great, but I wouldn't want to pay the normal $13.35 price for it.\nI've been here for happy hour before. $1 off draught beer! \nHere's a tip: Happy Hour here ends at 5:00. Leave work a few minutes early and get your order in right away to get the $1 off deal.", "author": "Marvin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "My team booked a reservation here the day before for a work lunch through Yelp. Since we had limited time it was really nice to be able to walk in and leave within an hour. Also with multiple dietary considerations there were plenty of options. Service was friendly and for a decent option near the office (when they are paying) I would recommend this place. Although based on other reviews sounds like happy hour is the better time to visit. \n\nWith rent as high as it is I can understand why they would try to cram as many diners in here as possible. But it was a bit awkward to be seated so close to the table next to us and to have to squeeze in and out.\n\nI ordered the Sutro pizza, while big enough for two meals for me, I felt like $18 for a pizza that was just okay was a bit much. The potatoes added nothing to the flavor, I actually preferred it without them and I would have liked more pesto sauce on the pizza. Mine also came out with a ton of flour on the plate so it was a really messy and a bit bland.", "author": "Tarah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Archive is an amazing spot for HH in the city. I came on a Friday around 5pm, and we got seated immediately!\n\nTheir drinks are SO affordable - I got the Rose Sangria for $6, since all drinks were $2 off during HH. Really great pricing for the Financial District. \n\nFor food, my friend and I ordered the truffle orzo mac n' cheese (because we deserve it) and the Lucas pizza. Both were totally delicious!\n\nI highly recommend coming to Archive for happy hour. Cool interior, good food, and good service!", "author": "Monica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "Came here for a birthday dinner last night and was very impressed with both the service and the food. The restaurant decor and ambience is perfect for a few drinks after work with colleagues or a dinner date. The space is a little tight, so probably not preferable for big groups, but for the 4 of us it was perfect. I had the beet salad which I added chicken to. The portion was perfect for a main or a shared starter. The pricing is not too bad especially for being in downtown SF, the bill came to roughly $100 for the 4 of us and we all left with full happy bellies.", "author": "Sarah-Jade S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "In a world full of mediocre fast casual restaurants, Archive is a welcome blast to the past when people actually gave a damn about lunch. No Chipotle analogues that rip you through and hand you a $15 grain bowl, just a good, old fashioned sit down lunch with lots of options for all levels of dieters. From gluten free to vegan to caveman-like carnivorous diners, there's something for all on the list.\n\nI've been here several times at this point, and their salads are generally what I gravitate towards. The chef's and cobb salads pack a punch, and you'll legitimately walk away full after a plate of leafy greens and chunks of meat. Their pizzas and sandwiches are also quality, and depending on the type of place you work, it's always nice to have an option for a glass of vino.\n\nReservations are recommended as they do get pretty packed around noon.", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Such a fun place for a happy hour! Amazing wings and gorgeous cheese plate rounded out with a cold beer has made for a great start to the evening.", "author": "Karen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "One of my go-to places when meeting friends for lunch - nice ambience, fast service and great pizzas. As a meat lover, my favorite is the Coit - andouille sausage, applewood smoked bacon and roasted chicken!", "author": "Tak K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "The staff was friendly, replaced an order that was incorrectly made promptly without complaint, and the food was very good.  There were 9 people in my party, and we were in and out in 75 minutes.  The ghost chili sausage pizza was amazing, not TOO hot and with top notch flavor.  Great place for small to medium size groups, I don't think they'd be able to sit a party much larger than ours very comfortably.", "author": "Matt U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "Made a reservation prior and was seated right away for a party of 5, had a great overall experience. Ordered the turkey club with bacon and was very pleased with how filling it was, also it comes on delicious sourdough bread. The mint lemonade wasn't as sweet as I would have liked but the staff was friendly and attentive so I would definitely go back.", "author": "LeVar H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "Cool decor with the open brick walls and high ceilings on the smallish side. I remember going here when they first opened a few years. They have stayed consistently good.\n\nGood service...nice to see good teamwork in action. The truffle mushroom garlic pizza is great and so is the pulled pork sandwich.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "I probably had half a pizza, Archive is so good. We did carry out and the pizzas were just as good if you dined in. I'm a deep dish pizza lover but I can't say enough good things about this thin crust pizza. Flavorful, filling and so delicious. I love the layout and design off the pizza with each slice getting just enough of the toppings. I even ate the crust! Superb job Archive, well done. For lunch and dinner, you have to stop by anytime you're in San Francisco. This little treasure is a nice surprise and great representation of what good Cali pizza tastes like.", "author": "Liz B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-28", "description": "Pizza is bland despite the truffle oil and goat cheese. Host failed to advise us about the area in which we were seated would be overrun by happy hour. Had to chase down bartender for check. Wish I liked it because it is convenient to work, but will not go again.", "author": "Shelby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "BYOR...bring your own ranch sauce to dip. If you're like me, and you must dip your pizza in ranch then be prepared to bring your own because they do not have ranch here. I repeat, they do not have ranch here. But they do have a house Gorgonzola cream dressing. It will do, but not quite the same.\n\nHad the Coit and the 1906. I liked the Coit better since I'm partial to BBQ sauce. Crust is thin and crispy", "author": "Kat D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "My favorite pizza place in the city! Their margarita pizza is my favorite guilty pleasure. A little pricey, but well worth the money. It gets packed during peak lunch hours, so if you can go a little before or after you'll save yourself some time.", "author": "M K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Impressed by place and menu.\n\nGreat atmosphere for date night and for a little corporate party. Food and drinks are totally like in the menu. Fully recommend this place!\n\nTasty pizza with great variety of fillings, large selection of drinks, especially beers. \n\nGreat music and cozy chairs. So, I would definitely recomend this place for alomst any ocastion!", "author": "Anna K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "This place always looks packed from the outside, and sure enough, when I actually ate here, it was full. My SO and I got bar seats, but it didn't feel terribly cramped despite the crowded atmosphere. They have a decent beer selection - I got a fruity gose. For dinner I had the beet salad and my SO had the Hearst pizza. The salad was a lovely combination of beets, quinoa, arugula, and goat cheese with the surprisingly lovely addition of grapes. And it was the perfect size too. My SO thoroughly endorsed the pizza. The service was so-so: I consistently had to yell over the dull roar of chatter in the tiny space to get the bartender's attention. But even so, that seemed to be a result of the crowd in the restaurant, not the actual quality of service. Overall, this is a solid spot for a casual dinner and drinks.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "In town for business and dropped in here for lunch with my kids. The decor was nice, there was a great vibe, and our server super friendly. In fact, the friendly server is what enticed us to come in and sit down.\n\nWe ordered a simple half cheese, half pepperoni pizza, a couple of salads, and a sandwich. The salads were superb (highly recommend both the beet/frisee and the Caesar), the turkey club was very good, and the pizza was good as well. There was, however, a misunderstanding in the kitchen, and instead of delivering what we ordered: a pizza that was half cheese only and half pepperoni and cheese, the cook made a full pepperoni, with half with cheese on it and half without. Seems like a small thing, but a pizza without cheese on it is a hard sell to most people, especially to a tweenager. The server immediately recognized the mistake and offered to correct it but we ultimately decided it was less of a hassle for everyone to just eat what we had and leave the part of the pizza that was incorrectly made. \n\nWhen I got the bill, I realized we'd been charged full price for what was essentially a mistake. I asked our server to modify the bill and maybe only charge us half price for the incorrectly made pizza. He was totally amenable to that (and should have thought of/offered that himself). He came back and said \"This is all he would do\" referring to the owner, who was on site that day. The owner apparently approved discounting the pizza by something like $5, which is better than nothing, but from a service standpoint, kind of odd. When your kitchen goofs and a guest is nice enough to not make you go through the trouble of remaking something and wasting incorrectly prepared food, perhaps the least you can do is charge them half price as a thank you. \n\nAll in all, the food was good, our server was great, and the ambiance here was great. The service, in the form of that extended by the owner, could be a better. And to be clear, it's not at all about the money -- it's about good business practices and a customer-centric mindset.", "author": "Shelly K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Love, love, LOVE this place. My friend and I usually come here to celebrate a special occasion after work (happy hour!) but it's typically packed. However, the staff are super accommodating and even if a table says reserved, it could be that they were reserving for walk-ins. I've gotten lucky the last 3 times, for sure!\nMust-gets: Their happy hour sangrias are ~25 and so worth. My friend and I usually have 3 glasses each. \n- Cheese Board & Local Charcuterie are bomb if you don't want to stuff yourself too much. \n- For Pizzas, the Coit and Hearst are my faves - just enough if you want to try this place out but also gives you insight to some great tastes the restaurant has to offer. \n- If you'd like to lighten it up, their caesar salad is good n' light!", "author": "Julia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "Good spot for happy hour weekdays between 3-6 pm but it gets crowded so come early. \n\nThe menu is built for sharing with items like sliders, cheese plates, and pizza. We ordered the Moscone pizza pie which has salami, sausage, and olives as the main toppings. Great choice if you're looking for a meaty tasting slice. We also paired the pizza with the beet salad which brings a nice brightness and sweetness as a counterpoint. A mix of gold and red beets paired with grapes and goat cheese dressed with a sherry vinaigrette make for a nicely composed salad. \n\nService is friendly but they get slammed. Still, Archive Bar & Kitchen is worth considering if you can find a spot after work.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-13", "description": "I'd had this spot scoped out for a while. The pizza was so hyped here, but it was sort of bland to me. I loved how everything came out piping hot though!\n\nI shared the Hearst pizza (bacon, goat cheese, mushroom, and truffle oil) and the orzo truffle mac.\n\nWhile I loved the large bacon pieces on the Hearst, the ingredients didn't really seem to meld together and the crust could have used a bit more salt (I rarely say this) and oil (also rarely say this) to pull everything together. The crust lacked crunch (also rarely say this) but wasn't quite doughy either. I'm sorry, I'm being like Goldilocks today. (Just checked reviews, looks like I'm not the only one with this opinion. Phew!)\n\nI love orzo as a salad pasta, but I'm not sure it has the surface area to carry the cheese in a way that makes mac and cheese so delightful. I really loved that this was way too hot when it came out, though that did interfere with texture initially since the pasta was almost melted too and the cheese wasn't gooey as much as liquid. Good truffle flavor on this though.\n\nFor such a small restaurant, it was extremely loud, and I definitely had to project my voice at my dining companion seated one foot across from me. Actually, the table next to me was closer to me, and conversation was hard. Some elements to dampen the sound would be helpful! Good ambiance otherwise. I actually enjoyed Atlas Tap Room and their flatbread a bit more.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-03", "description": "This is Nice little Bar and Restaurant. Was quite busy even on a Wednesday evening. They had a good list of wine and beers, though I didnt have any. \nHad the Bolinas pizza. This is a vegetarian pizza. It has cauliflower, romanesco, tomatoes, onions, eggplant puree and goat cheese. Though the ingredients sounded interesting, the pizza was pretty bland and I could mostly just tasted cheese. I dont think it was great value for money. The pizza cost almost $17.\nI really liked their crust though. Might go back to try some other pizzas and some of the veg starters.", "author": "Umang D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-01", "description": "Disappointed. I ordered several things in advance for pick up to take to a lunch meeting. The menu online had a chef's salad, which was one of the items I ordered. When I showed up shortly before my meeting to pick up the food, I was told they did not have the chef's salad anymore. So I ordered something I thought was similar and added chicken (I was charged extra for the chicken). I was almost late for my meeting because I had to wait for them. Opened up the food at the meeting. Lo and behold, no chicken in the salad that I was charged extra for.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "This is a great spot to come by after work for a Happy Hour drink and light bite. They have quite a few signature cocktails that are discounted from 3-6pm as well as their house wines and beers. I'm a fan of their champagne options, though beware if you order the Blood & Roses note it is pretty sweet.\n\nIf memory serves me right, Happy Hour doesn't apply to their food menu but it's reasonably priced and not bad if you split with others. The few times I've been here the food hasn't disappointed and seems like it's intended to share: Margherita pizza, truffle Mac n Cheese, warm pretzel with honey mustard, dates, jalapeño and artichoke dip with chips. \n\nThe inside can get pretty loud so if the weather is nice I'd recommend sitting outside and enjoy some fresh air and people watching! There's always a nice buzz on Mission Street during Happy Hour.", "author": "Mina T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-27", "description": "Typical SoMa/FiDi bar with an array of shareable bites as well as pizzas. Not sure if they're worth the price tag, average around $17-$20 for a medium 6-slicer that could easily be devoured by a single hungry person. A beet salad will run you about $13, and be anything spectacular in flare, portion size, or taste. Maybe add an egg on top like the French do, and it'll be worth the $13. \n\nFunny cocktail names, think \"Alternative Facts\" and they serve them up in antique-shaped glassware. It's a little noisy during peak hours since the venue is slender and acoustics are a bit rustic, but good for a happy hour beer or drink if you're in the area.", "author": "Alison A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "Great place for after work in FiDi. Good food and drinks, and indoor and outdoor seating. Service was decent considering they were hosting a large work group in addition to the several other small parties seated. If there was a happy hour there wasn't a mention of it but items were still reasonably priced.", "author": "Maia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Truffle Mac n' cheese. \n\nWITH BACON. \n\nI DIE!\n\nI should end my review right here since all opinions are moot on whether or not this is the BEST dish at Archive. Well, there's the pizza, but nothing comes close to the unique orzo based, carb heavy, all American delectable treat highlighted with unctuous cheese sauce. DUDE! this is the stuff cheese addicts dream about their whole life. \n\nSwear it on my grandma's dead puppy's grave. \n\nAnyway, about those pizzas, they are fantastic. They are not in anyway, the absolute best in SF, but guess what? Archive isn't aiming for that. The love for pizza is evident in the careful, well thought out flavor combos such as the Cardona (artichoke hearts, sundried tomatoes, swiss chard, goat cheese in an alfredo sauce) or the Hearst (white truffle oil, lardon bacon, wild mushrooms, roasted garlic) If you're feeling basic, their pizza margherita is as basic as you can get, although I disagree with putting fresh tomatoes on this one. I prefer mine with a simple sauce, basil and melty mozz combo. Either way, the pizzas here are hand pulled and the thin crust serves well to soak up the alcohol after you've come from Novela two doors down.  \n\nI didn't imbibe here, but saw a happy hour that can't be beat. With the busy foot traffic on the corner of 2nd and Mission, Archive lures in the Fidi crowd into it's cozy space with warm interiors. This building miraculously survived the 1906 earthquake and kept its original brick walls and steel beams. I'm a sucker for a bit of history and any vintage industrial spot. I'll definitely return soon!\n\nIf only for the truffle mac n cheese.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Although this place can get loud, it's one of the best pizzas in SoMa. Sandwiches are not bad either, but definitely go for the pizza if you can. The Hearst pizza is simply amazing, it has huge chunks of bacon that are often cooked to perfection.\n\nOne thing that is sort of annoying about Archive is the fact that they're not open on weekends. It'd be a perfect spot for people living in SoMa since between 3rd and 1st on Mission there are not that many places open.", "author": "Antonio H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-21", "description": "It's not super easy to find quality lunch options in this area, imo, but Archive should definitely be on your \"solid\" list. The staff have always been sound and I like the interior; it's not too packed in and the little outside seating is p pleasant in the lunchtime sun. \n\nNow: The pizza. If you're gf, the non-gluten crust is really well made. It's more thin-crust style, with a bit of crunch, and tastes great. I personally prefer normal, but I've colleagues who always go gf (fo taste and health reasons.) I've got awful teeth so sometimes the crust is a bit tough for me.\n\nDimaggio and beet salad are my go-to for sharing. You can't really go wrong with any of the pizzas, though!", "author": "Rowena H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "I tried their PASTRAMI & PEPPERS sandwich once through mealpal. It's unbelievably tasty. The pastrami is very juicy, and the picked pepper added into it made the sandwich very addictive. I wish I can order from them every day!", "author": "Wenjing Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "Oh Archive. I literally can't say enough good things about this place and the people who work there that make it great. I literally fell in love with this place and at this place. It's become like a second home. \n\nThe lunch menu is absolutely perfect with crazy huge and changing salads, creative sandwiches that are big enough to split (but totally crushable) and their scrumptious pizzas. \n\nTheir happy hour menu is noteworthy for the drinks but also those small bites... except there is nothing small about their sliders (except they are technically small burgers...). \n\nDinner is just delicious. More appetizers and pizza and less salads and sandwiches and literally just everything is great. \n\nThe ambience is cozy and murmured loud with warmth and the attention to detail is shown throughout the interior and with the beer selection and creative non liquor license cocktails and the fill your tummy wine. \n\nThere is no bad place to sit in this small place because you'll kind of feel like you're sitting with everyone in there in the best way no matter where you are. \n\nI'm hooked.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "Visited for a late lunch. Lunch crowd was just starting to thin. I sat at the (empty) bar and ordered a soda water with lime and a Margherita pizza with pepperoni from the bartender.\n\nThe pizza toppings and sauce were of excellent taste and quality. The crust was a good texture but *really* could have used a bit of salt to unlock the flavor. It was *thisclose* to being great.\n\nService from the bartender was just eh. I was dining by myself at an empty bar and he didn't attempt to make any conversation. At first he was making sangria, so I get that he was busy, but after that he was just trying to get one of the other servers to switch shifts with him and using his phone. \n\nBut my bigger issue was that I ordered a soda water with lime, which he never refilled. I wasn't paying attention when he first gave me the glass of soda water, so I didn't see where it came from. When I got the bill I saw that he charged me $4 for a bottle of Pellegrino. I looked over to the side of his work area and saw a half-full bottle of Pellegrino and had to ask him, at that point, to please let me have the rest of my bottle of water. Kind of rubbed me the wrong way to end my meal.", "author": "Andie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "Finishing out our evening we were still a bit hungry and wanted to find a cool place near our hotel. I searched Yelp and decided on Archive. It was a comfortable little place with a nice bar area and seating along the walls. We had a nice server and she got our beers and took our pizza order soon after we sat down. Thin crust, wood fired pizza is my favourite and Archive delivered!\nWe ordered a \"DiMaggio\" and it was quite good. The base of the pie was a garden pesto spread and topped with Italian sausage, paquillo pepper, mushrooms, ricotta, and topped off with mozzarella goodness. Excellent job, Archive. \nIf you're in San Fran, y'all should stop by and get your pizza fix.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "Me and 2 friends were gonna go try Takoba but there was a party goin on over there so we walked over. It was superrrr busy and it was Thursday at like 6pm. The space is also really small and dark so definitely come early or def have a back up plan! \n\nI had pretty low expectations for this place but I was utterly surprised!! We shared some brussel sprouts and I got the Mozarrella Pizza & got 2 Sangria Rose's ;) The pizza was honestly nothing special but still pretty good. The dough was MHMM SCRUMPTIOUS and the cheese was damn good. The brussel sprouts were kinda weird and seem kinda undercooked and way too salty. The drinks seemed WEAKK at first but it's one of those things where it comes to hit you later. I would def come back to try some drinks!!", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-18", "description": "Updated review-- I went back a few weeks later because I had a good experience there the first time, but this time it was the complete opposite. There were only 3 customers and about 5-6 employees. It took them about 50-55 minutes to bring us our food. I believe he was the boss but he told us that he burned the pizza and had to put a new one in. At this point, it was already frustrating because we had to wait even longer for the new pizza to cook. Yet, when we got our pizza it was still burnt. The tomatoes were still raw and uncooked. Took about 15-20 minutes to get our drinks while we waited for our pizza. We paid for the pizza. The owner should have taken the pizza off our bill or gave us a discounted price out of common courtesy and customer satisfaction. One of the worst experiences I've had in the city. This place is a hit or miss. Some days are better than others, but it's not worth the risk. We will not be returning. \n\n\nFirst review-- This place is so good! The pizza and salad was BOMB! I am definitely going back! I the bartender was friendly and sweet! Great place for lunch!", "author": "Cecile .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-15", "description": "Came in late to grab some pizza on the way back to my hotel. Delicious thin pizza with a nice crust. The pepperoni and sausage are really nice. I appreciated the quick service as well!", "author": "Christin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "For lunch or dinner, Archive never seems to disappoint. \n\nRight around the corner from work, my co-workers and I usually share a salad and a pizza. The salads are simple and satisfying, but the real menu winners are the pizzas. The Hearst pizza, with gluten-free crust and arugula added on top, will have you coming back every week. Just note that it includes whole garlic cloves, so make sure to bring gum if you're running to a meeting right afterwards!\n\nThe waiters are always accommodating to your preferences and truly understand the Bay Area habit of customizing everything on the menu. The seating can be limited, but if you go a little early, you can snag a seat and enjoy prompt and friendly service. For dinner, the wine list is great, making Archive a fun, casual spot to unwind after work as well.", "author": "Shira W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "I stopped by with a group of 7 people on a Friday evening because every other place in SoMa was packed as expected. Surprisingly, they happened to have a table open with no wait. \n\nService was friendly and reasonably attentive for a full house. They also have a pretty good beer/wine menu with average prices ($7-9/pint of beer). Nothing exceptionally impressive but wasn't underwhelming by any means. I would go back for happy hour next time most likely. \n\nI can't speak for the food since I didn't sample any while I was there, but it looked and smelled really good. The space also wasn't too loud, so if you are in a larger group not wanting to shout over the entire restaurant, this could be a good alternative to a bar situation. The restaurant itself is fairly small so I would say either get there during non-dinner time or opt for sitting at the window bar. This is your local let's-grab-a-drink-and-artisan-pizza spot that doesn't compromise ambience and service.", "author": "Catherine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "Got a pulled pork sandwich with fried onion and slaw, blown away by the attention to detail in the sandwich, loved the browned bun.\n\nEverything around looked just as good\n\nWalked in, helped within 5 minutes, quick turn around on food, a boon to financial district work lunches", "author": "Robin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "Great location with limited indoor seating and a couple tables outside. Coming on a Friday night the place was packed! \n\nDennis the host was really friendly and accommodating. My friend got there earlier and was able to snag seats by the bar as we waited for a table. Their HH sadly was from 3-6pm, but lucky for me my friend got there early enough to order a few items. \n\nWe ordered:\n- Sangria Rose $25/pitcher HH price: my favorite of the two with light floral and fruity nuances. Very nice! Lauren was a great barista who knew how to make a good drink.\n- Sangria Rioja $25/ pitcher HH price, this was more of a deep red wine taste. It tasted stronger.\n- Orzo Mac and cheese $7 HH price. This was so good! Seriously whoever thought to use orzo instead of macaroni is a genius! It was delicious and the perfect mix of cheese to pasta. Must try\n- HH sliders $4/ slider- nothing special I'd probably pass on this one next time\n- Hearst Pizza $18- it was overly mushroommy, but if that is your thingy then great! \n- Coit pizza $17.50- my favorite if the two. Well made crust with fresh toppings. \n\nOverall, great place to hang out with friends with well made drinks and amazing orzo mac and cheese. The pizzas were good, but not amazing though for the ambiance and location this is a great place to meet up.", "author": "Melissa N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-08", "description": "Warning: Severe food poisoning risk here. \n\nI had a lunch here because it is really close to my office. It turns out to be a disastrous decision. The pizza is expensive but no better than fast food delivery. Well, that is fine, at least not a big issue. The disaster started right after I finished my slices, even before I left the table. Pain started in my stomach, but I thought it was no big deal and managed to walk back to my office. Then it got from bad to worse. Vomiting and diarrhea, lying in bed for three days so far, I am still feeling sick. It is a clear symptom of food poisoning. It might not be the routine but just a bad luck, but I strongly recommend anybody to try their luck somewhere else. You can find many better and safer options on Mission. Don't make my mistake.", "author": "Zhiyuan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Nice albeit crowded space for drinks and a bite to eat after work. Great selection of artisan pizzas and salads. Gets a little loud due to the small space and everyone trying to talk over each other, but it fuels the intimate atmosphere.", "author": "Sheridan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Archive has the best pizza in FiDi hands down! My favorite is the Lucas pizza. Definitely recommend coming here for lunch or laid back dinner. They have beer and wine but the drinks aren't very strong. Check it out", "author": "Clare O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "Stumbled upon this place by accident since another restaurant close by we wanted to try out was too busy.  Too hungry to wait, we decided to give this one a try!  It was pretty good! \n\nOn a cold sf night, it's hard to want to sit outside but the waiter convinced us saying the pizza oven heat will warm us...didn't really believe him at first but it was true...as long as you sit on right side of patio as you walk in. \n\nWhat we ordered:\n-Debated between a few pizzas but settled on the spicy one...I forget the name but 1906 or something like that. It was good and definitely a meat lover's dream although it disappointed on the spicy factor like the description suggested. \n-truffle mac and cheese orzo was different but delicious. Felt healthier than the typical mac and cheese but I'm sure they're equally as fatty, but so worth it. We also added bacon to ours! \n-drinks were pretty good and strong, we tried a few of the whisky and tart drinks...I forget the names but you can't really go wrong. Also shown in pics.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "Narrow and simple brick layout bar with a couple of seatings outside for the outdoor preferred people, like me, when weather permits!\n\nIt's a convenient, above-the-notch place to grab bar bites and drinks, after working hours! \n\nTheir white wine with a mint leaf, is the way to go for a refreshing drink. The sangria is a guaranteed win as well. They have draft beers for the beer lovers and it's great when a sport's game is on! \n\nTheir prosciutto pizza that is topped with arugula, was complementing with drinks ordered up.  It is a good pizza entree to share.  Their mini sliders of pork and meatball, is doable for happy hour munching. \n\nStaff was nice and made sure we were taken care of.  \n\nLimited seating when happy hour starts because it is a small place too!  However, a spot on bar to gather over drinks and bites!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-30", "description": "Definitely a big fan of Archive. I come here every once in a while. Their pizza and salads are good for lunch. Their sandwiches are good for it you don't want to share. \n\nThey don't do appetizers at lunch, only for dinner.\nThey also don't have any hot drinks (coffee / tea).\n\nFor dinner and happy hour, they have a good selection of appetizers to try, along with of course, their pizza and salads. \n\nThey have a decent beer and wine selection to choose from.\n\nPretty standard pricing for the area.", "author": "Kaje Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-17", "description": "I was excited to try this place since it's down the street from my office, but I was pretty disappointed when I went. \n\nDiMaggio pizza- My friend and I agreed, the pizza was quite bland. I had to sprinkle crusted peppers and cheese to give it a kick. The pizza is definitely shareable. Between two gals, we still had 3 slices leftover.\n\nCheese Board- a must order! Everything on the board was great. The jam was amazing and I loved all three cheeses. \n\nThey serve happy hour from 4-6pm. They offer $1 off draft beer, $2 off cocktails, and $7 for their house wine. The house wine wasn't the greatest. My friend couldn't even finish her glass. \n\n3 stars for the cheese board and service.", "author": "Annie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "I love this place! I've been here 3 few times now over the past 3 years, and it's consistently wonderful. It's a surprisingly small space, warm and welcoming with a few tables outside on the front patio. Simple menu filled with really beautiful salads and pizzas, all generous portions and really decent prices. And with gluten free crust available, of course. \n\nMy favorite pizza is the \"Hearst\" which comes with goat cheese, mozzarella, bacon, truffle oil, roasted garlic cloves, and toooons of gorgeous earthy mushrooms. So amazing! I've also had the Lucas which boasts plenty of prosciutto, arugula, and thinly sliced apples -- a little sweet and savory perfection.\n\nThe wine and cocktail list is fantastic (and you're paying for quality here). Drinks are between $9 and\n$15ish, so not too bad. Service is really kind and speedy as well. We let our waiter know we'd need to leave in sort of a rush, and they did a great job taking care of us and creating a really lovely experience despite our short  visit. Can't wait to come back for a longer, lounge-t visit.", "author": "Kendall S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-16", "description": "Came to this place during lunch rush with a group of coworkers and was still able to get a seat. We made it right at noon though so we ended up grabbing a table outside. The place itself is quite small  but they have tons of bar and window stools if you're in a smaller group. \n\nRight from when we turned the corner we smelled the place. IT SMELLED SO GOOD. \n\nI ended up getting the Hearst Pizza ($18) with an egg (+$2) that I split with my coworker. At first I thought it was pretty small especially since I was sharing it but half was definitely enough. They don't skimp on the ingredients so the pizza was topped with loads of mushrooms and chunks of thick bacon pieces (YUM). The crust was thin and crispy, but still held up with all the toppings and egg. \n\nOther people ordered the Caesar Salad, Meatball Sub, and Chicken Sandwich and they all looked so tasty! The sandwiches came with a side of ruffle chips. All looked enough for two people as well. My friend said the sandwich bread pieces held up really well with all the sauces too. \n\nService was decent - they always made sure my water cup was full, but sitting outside waiters were less accessible. They did make an effort to adjust the tables so that we had more table room.", "author": "Keizzel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Great pizza- super flavorful and unique. Also loved their salads and drink options. Friendly and fast service for lunch.", "author": "Lindsay L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "Archive is one of my favorite spots in the city. They offer different kinds of pizzas, salads, and drinks.\n\nIf you're craving for something light and filling at the same time, try the Lucas pizza. Made with prosciutto, ricotta, fresh mozzarella, gorgonzola, pink lady apple, garlic oil, onion, and arugula. The size of the pizza is the perfect amount for two people, it's about 4 slices each. My favorite part of the pizza is the pink lady apple. Not sure about you but this is the first pizza I've had with fruit. Also, try one of their house libations. I love the Mrs. Doubtfire - agave wine, lillet, fresh grapefruit, and grapefruit shrub. It's very fresh and it's a creeper. You'll start feeling a little tipsy half way through. Haha.\n\nAnd if you're still hungry, order one of their salads or the truffle orzo Mac and cheese. Before 3pm, it's $9 but during happy hour it's $7!", "author": "Tina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "After walking around the SFMoMA for 2 hours, my friend and I were STARVING and looking for somewhere to grab a quick lunch. It was around 3pm, so a couple of the restaurants that we checked out first were already closed to set up for dinner. I browsed Yelp for a few mins and came across Archive. As soon as we saw \"Wine Bar\" in their description, we said \"Yep!\" and headed over. \n\nTheir menu was PERFECT for what we were going for, plus they had happy hour going on at the time. We ordered mac & cheese off of the happy hour menu, as well as a couple of sangrias. The sangrias were yummy (and strong- or maybe that's just because we hadn't eaten since breakfast around 8am) and the mac & cheese was amazing! It was piping hot and had truffle oil on it- perfect for the cold and windy day!\n\nWe both ordered pizzas (the Hearst and I think Fall Harvest). I LOVED the Hearst, my friend preferred her fall harvest. The Hearst had goat cheese, more truffle oil, bacon, mushrooms, garlic, and I'm sure other goodies that I can't remember right now. The Fall Harvest had squash, pine nuts, basil and pomegranate seeds. Both had thin crusts and weren't too heavy, but still hit the spot.\n\nIt's the perfect way to top off a museum trip and I would definitely go back!", "author": "Katie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "TLDR: Good pizza and drinks, not super pricey despite being in the heart of downtown. Good location for American bar fare. \n\n- Great pizza options, and good for sharing as a meal between 2 people, so not as pricey as you might think \n- Good location \n- Slow service, even when it's not super crowded \n- Loved the strawberry mixed drinks, super refreshing.", "author": "Salim Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Making plans to leave the office for lunch when need to be back in an hour somewhat stresses me out. Not when Archive is around though! For 2 consecutive years, I've walked into to Archive, found a groovy  seating, and immediately helped. The atmosphere is cool yet cozy with big windows letting in the sunshine toward the street. Sitting at the bar isn't cramped at all and I actually prefer it! Okokokok... the menu makes you want to order at least the whole left side of it. The portion sizes make it easy to split a pie between 2 (mmmmmmaybe 3.) I'm not usually a pizza crust partaker but this pie is bomb.com from the nucleus onward. Everything tastes notably fresh and an afternoon beer is cute to boot to pair... Cheers to a 5 star lunch!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "I'm a vegetarian so I got the Bolinas Pizza which felt pretty normal when I ate it, but I found myself thinking about it in the days following. I would definitely recommend the Bolinas. It was yum. Keep in mind that this restaurant is on the pricier side. I think I spent around $20 and the portion size can be eaten by one person, or two if people are eating small portions. I will likely return for more.", "author": "Karishma M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Love the ambience of this place. We came for dinner, but I think it's more of a happy hour or drinks spot.\n\nThey serve some appetizers, but mostly pizza. We ordered a pizza based on Yelp reviews and it was tasty. If you compare it to other happy hour pizzas, it's fine, but if you are a real pizza connoisseur, then the crust and cheese are both lacking. 3 stars for the pizza.\n\nWhat we loved though was the beet salad! That was really amazing! Sweet beets, green grapes, arugula and goat cheese gives just the right balance of sweet and tangy with a punch. 5 stars!!", "author": "Cynthia X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "Usually a bit busy for happy hour so I have to go next door to Atlas but I was able to snag a table today. Great service and good food! I wish they offered more food options for happy hour though-- even a few bucks off the full sized pizzas would be appreciated. \n\nMy cocktail--blood and roses-- looked good but had way too much aperol in it so it tasted like cough medicine. Also learned a fun tidbit from the bartender about what fermented whiskey and fermented vodka are. Pizza--DiMaggio-- was above average. Gets loud but there is outside seating as well as seating for larger groups. I saw some signs that said \"reserved\" on tables but not sure if they take reservations. \n\nOverall, it's a popular spot for happy hour in this area and I would recommend it!", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "LOVE this restaurant. The concept, the food, the service. Perfect spot to grab dinner with friends, co-workers, significant other, etc. It is an old school library themed place, with high brick walls, vintage shelves of books behind the bar. \n\nBest of all they're known for their thin crust pizza.  \n\nHearst: mushrooms, mozzarella, truffle oil, and THICK slices of bacon... YUM! Seriously, you can't go wrong with this combo.\n\nLucas: prosciutto, arugula, gorgonzola, garlic oil, and slices of apples. Who knew apples would be so delicious on a pizza. It was like eating a salad in pizza form, so I felt less guilty eating 4 slices (: \n\nCan't for get about the pork belly sliders. A thick slice of pork belly, with fig jam and a slice of apply all between a black sesame bun. This isn't your average slider. It's sweet and savory on a whole different level. Plus, it's on the happy hour menu!", "author": "Rachelle Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-25", "description": "I was just in there twice today. The waiter probably recognizes me and hopefully the owner isn't gonna claim that my review is from a competitor and that it's a fake one. \n\nI ordered the Mission chicken sandwich from MealPal. First time it was bloody (ewww!) I went back and requested a new one. Waiter was apologetic. I didn't think it was a big deal. We all deserve a second chance and it wasn't his fault. Grabbed the new sandwich and back in the office. Guess what? 2nd one was also pink and hard to chew on. Seriously, MealPal is cheap, we know. But for most ppl, it's great cuz it saves a lot of time. My lunch break only has 40 mins. And thanks to Archive I had to be starving while attending a meeting. You'd assume businesses should hold their food to a high standard even if it's for MealPal. After all, it's a gateway to get more first time customers and hope they'll convert to frequent customers. But no, not this stinky restaurant. I cook often so I know the issue. They probably cook straight from when the chicken breasts are still frozen. So naturally outside is cooked, inside is inedible. For all I know, they probably sell these to MealPal customers cuz the chicken were about to expired (hence deeply hidden in freezer and hard to cook) Invest in a freaking thermometer now, will you?? Do you know how disgusting it is to have accidentally eaten raw chicken??", "author": "Britta C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-30", "description": "I came here with a friend after work for happy hour. We arrived around 4:30pm so it was totally empty, and we were seated right away. The tables in the back are tiny, especially for the drinks and pizza that you could potentially order, but this gives Archive an intimate feel. Even when this place is packed, we could still have an audible conversation.\n\nMy friend and I ordered drinks, and we could not resist the selection of pizzas on the menu. The Lucas seemed most popular, so we got that. It sounded delicious, with prosciutto, apples, garlic oil, onion, arugula, and a variety of cheeses. The waiters in this place are also hilarious. They are friendly and love to joke around.\n\nThe pizza eventually arrived, but I was a little disappointed by its flavors. It seemed to have so many ingredients but no distinct taste. The cheese and prosciutto were overpowering, though I'm not sure what else I would have expected. I was full by the end, impressed that I ate so much pizza, but I was not totally satisfied.\n\nBecause this is conveniently located on 2nd & Mission, I would come here again for drinks and social plates, but I'll pass on the pizza.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-21", "description": "As a general rule, I don't eat a lot of pizza outside NYC because [insert snobbery about living in the land of great pizza].\n\nThat said, Archive's pies are not bad at all. We shared the DiMaggio, the Hearst, and the Sullivan (in order of best to worst in opinion) and they tasted good because of sausage, bacon, and goat cheese, respectively. \n\nI did leave the majority of the crust on the plate, because [insert more snobbery about pizza]. However, the toppings were of superb quality, and it is evident in the taste. The sauce in particular was nice, which I think is the major reason the red pie outshone the two whites. \n\nThe fact that the mixed Archive Mixed Greens salad (Cucumber, Baby Heirloom Tomato, Pear, Feta, Spiced Nuts & House Vinaigrette) was wonderful (if a bit overdressed) leads me to believe their non-pizza offerings are worth a shot as well.\n\nIf I might offer one warning:\n\nBeware the toilet, as it wasn't flushing when I used it, which would've been far more embarrassing if I had been experiencing explosive diarrhea at the time. Luckily for me and everyone in the restaurant, it was just regular, non-eruptive diarrhea (in no way related to Archive), which is no cause for concern. \n\n(Now that I'm reflecting on it, I actually don't feel good about having made a poop joke in a restaurant review. However, I think I will leave it here because there exists a person who will be at Archive at some point in the future feeling under the weather, and this information could potentially save them a lot of embarrassment. If that person is you, I don't need any sort of reward. I would prefer that you just pay it forward by offering up pertinent toilet information in all your subsequent Yelp reviews.)", "author": "Peter D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "My friend and I came here for dinner on a Friday.\n\nThe chocolate malt shake is only $5 and so delicious. Tastes like liquid ice cream, but not as thick and sweet. A must try! The shake might be a bit much for 1 person, but it was perfect for 2. \n\nWe also ordered two pizzas to split.\ncoit -  Andouille Sausage, Applewood Smoked Bacon, Roasted Chicken, Smoked Mozzarella, Onions & BBQ Sauce\nmoscone - Seasoned Sausage, Pepperoni Black Olives, Mozzarella & Organic Tomato Sauce\nThe coit pizza was my favorite with the three kinds of meat and it had so much flavor.\n\nService was quick even though the place was completely packed.", "author": "Edward W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "Great little place in the Financial District. Decor is nice, Service at the bar was great (ask for Esteban) . Caesar salad was delicious , pizza was good too.\nWe'll come back !", "author": "Amalia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-06", "description": "Came here because I was 1. Craving pizza and 2. They have Gluten free crust. Pizza came out and I was surprised with the crust--so light, so fluffy, so...wait a minute. Is this gluten-free? No. It was definitely a gluten-FULL crust. The server immediately took it away. I would've been completely horrified if I had a severe intolerance or allergy to gluten. Luckily for me, I'm on a gluten-free diet by choice. They gave us our gluten-free pizza and gladly did not charge us for it. 3 stars for a good pizza and rectification of mistake. Hearst pizza is amazing, btw. Minus 2 stars for complete carelessness. If you have a severe gluten allergy- please double check that the pizza is gluten free before taking a bite.", "author": "Carmela A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-17", "description": "Good location and service, decent beer list. Though their limited-editions were so limited, they were out of all of them, and one of the bottles I wanted had just been put in the frig so wasn't yet cold enough to serve.\nHappy hour specials were meh. $13 sliders for $12! They were tasty. The pizza was bad. Like, not really pizza.\nIt's loud. Was hard to hear other people at a table for six.", "author": "Carl B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "I used to pass by everyday and wonder what is that amazing smell? I knew I had to try this place out. It looks like a nice place to go for happy hour. There's a long bar area along an exposed brick wall. The tables on the opposite side are a little cramped though. \nI came here with a friend for lunch and we split a pizza. The size of the pizza would be enough for one very hungry person. It's not a bad price for lunch in this neighborhood.\n\nHearst ($17) - white truffle oil, goat cheese, fresh mozzarella, wild mushrooms & bacon:\nThe pizza has a nice thin crust loaded with toppings. The amount of mushrooms, truffle oil, and cheese made it pretty floppy. I'm not a fan of mushrooms, but I liked them on this pizza. The bacon is plentiful and comes in big chunks. It almost killed me a little watching my dining companion pick the bacon off of her slices. This is an excellent mushroom and cheese pizza.\nIt's not quite as wonderful as whatever the aroma is that floats out of this place in the afternoon. Maybe it's the smell of dough baking in the afternoon.", "author": "Joy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Awesome place for drinks and wine. \nOne thing you'll want to order for sure is their cheese platter with various nuts and cheeses. \nIt's an excellent appetizer that will go along with a glass of wine. \n\nAll of their appetizers are delicious. It can get crowded so make sure you go before the rush hour to grab a seat since this place isn't meant for a fast turn over rate.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "I tried the Moscone pizza. It was good, as was the service. Price was fair.\n\nThere's really not much more to say about this place -- it's an unpretentious, comfortable after-work hangout. I wouldn't go out of my way to come here, but the location is convenient to a huge chunk of SOMA offices.", "author": "Barack O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-12", "description": "Great service, great cocktails, we had a pretty good appetizer... Only giving for stars because they don't have a full bar. ;)", "author": "Ashleigh V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "Came in for lunch and had the Cuban.  It was $14 with a side, pretty standard price for the area and was worth it.  Good sandwich overall but could use some extra mustard.  Sat at the bar and got really good service plus I could watch the open kitchen staff make the food.  The place was clean and the cooks moved quickly. \n\nI really liked the vibe there.  Cool decorations and kind of on the darker side but didn't seem that dark inside. They had a handful of tables outside the front door which were crowded and the inside was about half full.  The beer list was kind of small but had some interesting beers.  Looked like a standard cocktail list and liquor selections.\n\nSolid four star place and would return for sure.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Wow. This might just be my new favorite place to get lunch in the area! I'd love to return for dinner sometime, too, so I can order bubbly cocktails and wine and take my time.\n\nMy group arrived a little after 11 and were the first to arrive for lunch. It was packed by the time we left, so plan accordingly. If you're on a tight lunch schedule, let the server know and they will make sure to get that spread out to you all spiffy-like. \n\nWhen I first glimpsed the menu, I have to admit to feeling that typical vegan defeat. That \"here I am all hungry, and I'm going to have to have a plain salad and pay the same as if I had ordered the salad with bacon and bleu cheese\" kinda feeling. But. They *will* take care of you here if you mention your dietary restrictions. At first I think I just ordered one of the mushroom pizzas without cheese. And then our waiter started asking me awesome stuff like, \"How do you feel about some arugula and olives on it as well?\" Like he read my mind! Yes, yes, I love arugula on pizza and olives are totally my jam! \n\nThe pizza arrived and it was all I could do to contain the joy I was feeling at the sight of it. It was loaded with greens and veggies. To be honest, this is the type of vegan pizza I prefer (to the junkier but still delicious kinds with Daiya). The crust is perfectly thin so you can do the NY fold and eat it like it deserves to be eaten.\n\nLook at reviewer Kendall S' photo of the vegan pizza that I received and you, too, will be all gaga over it. \n\nI truly appreciate the care & attention given to us by our waiter. It's so refreshing when someone actually seems like they care! I mean, it was him who made the suggestions. I tend to demure and take the path of least resistance, but really, it shouldn't be too much trouble to merely leave off cheese and add some vegetables to a pie if someone doesn't eat dairy, should it? They didn't make me feel like it was trouble or annoying at all and on top of that, seemed to be eager to offer up ways to make the pizza into a delicious work of art.\n\nBravo, Archive! You have a new diehard fan.", "author": "Joi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "DiMaggio is my favorite, highly recommended! It's a win because it's baseball. Only communists don't like baseball. Everything else looked amazing too.", "author": "Jose G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Been again a few times, twice on MealPal for the Mission Chicken and Pulled Pork Sandwich and just now for the Pastrami sandwich.  That last one was really outstanding as to the Pastrami quality and also a generous amount. I swapped out sour kraut and Rye for cole slaw and soft roll to my liking.  Good pepper action, roll was excellent as was before on previous visits.  Deserved of the $13.75 price.  Nice chips and pickles came with it; seating available for 3 at prime time so good location if you don't want to wait for a nice mid-week lunch.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "When a bartender who I highly respect told me we were going to get wine Manhattan's after work and swore that it would be one of the best Manhattan's I would ever have, well let's just say I wasn't at all convinced! Now I like wine as much as the next guy however I love whiskey! So here's how this went; he ordered two of these \"wine Manhattan's\", The bartender starts by lighting this little piece of wood on fire and putting the glass upside down over it to smoke the glass. Then using from what I understand to be wines and fermented liquors served me a nice looking cocktail! And then I tasted it!!!  WOW!!! After 3 I felt just as good as I would feel drinking 3 Manhattan's! Although I don't get to come here nearly often enough due to them closing at 10 PM this is now one of my favorite bars! I definitely recommend it for an afternoon date or if you're just walking around in FiDi and want to enjoy a nice lunch paired with a great beverage stop by this place!!! It's small however has a nice rustic decor and chill atmosphere! Plus the owner is a real cool dude! Had a great conversation with him when I stopped in last with a friend and found out that he actually built all the awesome shelves in the bar himself with reclaimed wood!!! Overall great spot, great vibes!!! I love telling people the story of the best Manhattan I've ever had and how it wasn't even made with whiskey! So to anyone who is reading this, check this place out! It's a gem!!!", "author": "Aleisha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Good food, wine and friendly staff. Have come here many times after work and on a weekend and am always pleased.", "author": "Penny B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-20", "description": "I was craving something hearty and the spicy 1906 pizza caught my eyes. The pizza had three kinds of meats: copa, salami, and pepperooni. Also tried the truffle orzo mac and cheese which was tasted good; you can't really go wrong with that cheesy goodness. \n\nThe place itself is a nice small space but it definitely gets packed at dinner time so be prepared to wait and/or be open to sitting on the outside patio.", "author": "Drew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "Three skinny friends walk into a bar...\n\nSo I'm not someone that's into eating a heavy lunch 'cause I will hit that snooze button in my brain post serious dejeuner nosh fest, and check out for the rest of the day. So for a day of serious seminars, I went to lunch with my two buds to Archive since they had a gluten-free pizza crust our friend could enjoy. \n\nWhile service started off a wee bit slow (they were super packed) it was on-point the rest of our lunch. We ordered the Hearst* that is ($16 + $2 for a gluten-free crust) and the Caesar ($10.50). The Caesar isn't Olive Garden big, but we enjoyed sharing it, with our pizza coming out not long after the salad. I really, really enjoyed this pizza. The bacon was chunky bits with perfectly cooked mushrooms, and the slight nutty, rich flavors of the truffle oil. None of the ingredients over-powered the others like you might think they would and the crust was delicious. \n\nI say three skinny friends walk into a bar, because this seemed to be the perfect amount of food for us three, but I can imagine someone with a bigger appetite or who'd like to have a few beverages with their lunch might find the pricing to be a little on the expensive side whereas we were able to enjoy a delicious lunch for $16 each. \n\nI'd definitely try them again as a lunch option when I come back to San Francisco!\n\nCaesar* - Little Gem Lettuce, Parmesan Vinaigrette, Bread Crumbs & Spanish White Anchovy\nHearst* - White Truffle Oil, Goat Cheese, Fresh Mozzarella, Wildi Mushrooms & Bacon", "author": "Morgan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-01", "description": "My friends said SF is not much of a pizza place. Archive does not help refute that statement. The crust was just too thick and doughey. \n\nThe place was relatively empty on a Monday night. The tomato and burrata salad was meh. The Hearst pizza was good, though personally I thought the goat cheese detracted from it. The Lucas pizza was disappointing. You get one sad piece of too thick prosciutto per slice, and the baked apple slices are mealy.\n\nThere is a happy hour, I think from 3-6.", "author": "Eva W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-31", "description": "I want to give 5 stars because Archive has some really great food. It's also so cutely decorated and the staff is really friendly. I've been here a few times and tried a variety of things on the menu, but my favorites are: \n\n- Hearst Pizza: definitely the #1 pizza they have. I was honestly shocked at how good this was.\n- Garcia Pizza: not sure what happened to this because I've never seen it on the menu after that time I tried it, but it was bomb. They use asparagus, garlic oil, arugula and egg on the pizza... do i need to say any more? \n- Pork Belly Sliders: SO GOOD. The apples and jam really put it over the top. \n\nOkay so if I like the food so much, why am I giving it only 4 stars? To be frank, the drinks suck. lol. I've had their sangrias and tried a few cocktails but each one I've tried, I leave feeling like I just wasted money drinking something I didn't like at all. \n\nTLDR: hearst pizza, porkbelly sliders, don't order their cocktails/sangria - stick to the wines and beers imo.", "author": "Estelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-12", "description": "Great ambiance and good date spot.  Their gluten free pizza is pretty good but it's honestly just about the only thing on the menu you can eat if you are allergic.  The drinks are really good and they have good happy hour specials.", "author": "Kati R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "Ended up in the financial district on a Friday later than expected from happy hour and my friend and I was so hungry so popped over to Archive. Right off the bat, everyone we encountered was just overall really pleasant personality. We asked if they could the fan off that was right above us and they didn't even hesitate which was so nice of them. To order, we split the orzo truffle mac and cheese. Not my favorite as I think the orzo leads to a soupy mac cheese but good taste overall just not my favorite. Next week ordered the beet salad and a pizza to split. Being a Friday during lent, I had to nix the meat but didn't want to limit my friend and the waiter was more than willing to do a half and half pizza. The beet salad was really tasty, and came with grapes, arugula and quinoa and was a nice compliment to the salad. As for the pizza... I don't know what it was but the pizza crust might have been some of the chewiest most delicious crust ever. I couldn't get over it. Overall, ended up with an app, a salad, a pizza and 2 glasses of wine for $75 which SF food goggles can deal with that pricing. Highly recommend this place for great food and awesome service!", "author": "Aryn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-29", "description": "I came here on a weekday for lunch.  Disclaimer: It's really crowded and loud so this may not be the best place to have a meeting.  \n\nThe pizza was pretty good.  We had the Lucas pizza.  Apple on pizza is actually really good!  The salads are large and can easily be split between two people.  Overall, it was a satisfying meal with good food portions, but nothing stood out so much that would make me come running back for more.", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-20", "description": "Overpriced & Average but cool Atmosphere!\n\nCame here for lunch just before a visit to the SFMoMA. My friend and I ordered a Mission Chicken Sandwich and a Pizza (forgot the name). The food was very \"just okay\" for what we paid. Had the crust on the pizza been different I could see liking it, the sandwich.... just so bland. I think the chicken just wasn't seasoned or marinated. Maybe the cook forgot a step? I'm not exactly sure. \n\nThe service was quick, and I will admit the atmoshpere of the bar was pretty cool. Would I go back? Probably not.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-08", "description": "So we went there for happy hour with a friend, she had a glass of wine and I had a spring sangria.\nI have to admit that even though the place looks really nice, I have some bad remarks:\n1) Sangria was really bad, tasted just like water only and nothing else ( was supposed to be passion fruit)\n2) the waitress after asking us twice if we wanted food, we said no because going for dinner later, she was very rude trying to rush us to leave and never brought us water when we asked for it, not cool!", "author": "Irina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "I've been on a pizza kick lately. Archive seemed like the perfect place to continue the gluttony.\n\nFood:\n*Prosciutto & burrata: with cornichons, apples & truffle honey ($14)\n*Bacon & feta meatballs: served in tomato sauce with fresh herbs & parmesan ($10.50)\n*Caesar: hearts of romaine, parmesan vinaigrette, bread crumb & spanish white anchovy ($10.50)\n*Orzo mac & cheese ($9)\n*Moscone: seasoned sausage, pepperoni, black olives, shredded mozzarella & organic tomato sauce ($15)\n*Hearst: white truffle oil, goat cheese, fresh mozzarella, wild mushrooms, roasted garlic & bacon ($16)\n\nI adored the caesar salad. I love anchovies so having a salad topped with anchovy?! I'm in heaven! My favorite pizza was the hearst. I have a weakness for truffle oil and mushrooms, so this was definitely delicious. The orzo mac and cheese was a little odd. When served, it kind of looked like french onion soup. A little too oily for me.\n\nDrinks:\n*Tony bennett \"manhattan style\": fermented whiskey, barrel aged vermouth, cherry herring & old fashioned bitters ($12)\n*Fort point, westfalia amber ale, san francisco, abv 4.6% ($7)\n*Mission, doubleipa, san diego ca, abv 9.25% ($8)\n\nI got the manhattan. It was good. Nicely balanced. The rest of our party ordered beers. Can't say anything bad about the combo of beer and pizza.\n\nOut of all my pizza outings lately, Archive has been one of the best. If you're craving pizza, check them out!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Great place\nGreat food\nCool environment\nSolid menu\nPizza was really very good!!\nWe had a great time", "author": "Eat'n O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "Awesome service, deliciously tasty food :), great ambiance, close to my work, good prices! I'll come back!! We had several pizzas including the basic simple but we'll balanced Margherita, 2 amazing salads, both of them super tasty and flavorful. I'm glad we tried this spot for lunch with my colleagues today!!", "author": "Rachida I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "I have been here for lunch and happy hour and love the drinks, food and atmosphere. \n\nIt can get busy so arrive early or be ready to wait a little. \n\nLocated right on Mission and Montgomery there are lots of work peeps here. This can be fun or annoying if you don't want to see coworkers. \n\nOrder lots of pizza, a cheese plate, brussels sprouts and wine. This will cure a lousy day. \n\nTables are close together so avoid bringing older folks here unless you like hearing comments like \"whoa, they pack you in like sardines here!\"  \n\nService is friendly and attentive. I have lots of love for servers that see a nearly empty wine glass and offer a refill - the answer is always, yes!", "author": "Alison C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Things I look for in a great happy hour spot: close to BART, good beer, delicious food, and happy hour deals (duh)! Archive Bar & Kitchen has all of this along with exceptional service.\n\nHAPPY HOUR DEALS (3-6pm)\n- $1 off draught beer\n- $2 off house libations\n- $5 house wine\n- $30 sangria pitchers\n- $2 off any pizza\n- $4 pork belly sliders\n\nBecause they get really busy, they won't seat you unless your whole party is there. Half my party wouldn't be here for another hour, so they let us sit at a two top first. When they came later, they moved us to a four top. Very nice! :)\n\n- Orzo Mac & Cheese ($9): Orzo, Cheddar, Parmesan, Truffle Oil & Breadcrumbs. The dish was creamy and cheesey... that's some delicious gourmet mac n cheese!\n- Pork Belly Sliders ($4 during HH, usually $5.50): Braised Pork Belly, Herb Salad & apple served on a Brioche Bun. The pork belly was so juicy! And it was a nice contrast with the apple.\n- Hearst Pizza ($15): White Truffle Oil, Goat Cheese, Fresh Mozzarella, Wild Mushrooms & Bacon. This pizza was so flavorful, and they give huge pieces of bacon.\n- Lucas Pizza ($16): Prosciutto, Ricotta, Fresh Mozzarella, Gorgonzola, Pink Lady Apple, Garlic Oil, Onion & Arugula. It tasted healthier than the Hearst, but still yummy. \n\nI've been dreaming about all the delicious food I ate here... so I'll be sure to make plans to come back soon! Cheers!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "I love this place! Amazing pizza and sandwiches. Quality beer and drinks, and the staff is the best! Warm friendly welcome and amazing service Everytime. I like to sit behind the bar in front of the flat screen and watch a game.", "author": "Karina E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-28", "description": "The food and services was good but it wasn't anything special. Very cozy bar & kitchen. I find a lot of the places in the FIDI that are similar with food and has similar prices. It's a nice place to catch up, get a drink and quick bite with friends or coworkers.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "Discovered this little gem on accident -- literally walked into the wrong door. Absolutely no regrets! Love the place. The cheese plate is out of this world, and the Prairie Farmhouse Ale they had on tap is one of the best beers I've ever had. Superb!", "author": "Tim P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-15", "description": "I came here to meet a friend after dinner last night, so I did not eat, but she ordered the brussels sprouts and she loved it.  We drank a couple of glasses of red wine at the table.\n\nI really liked the vibe, the place was pretty packed when I got there at 8pm, but by the time we left a couple of hours later it was quite empty. I liked the looks of Archive, long and narrow, with the bar in the back along the right side of the place. The bartenders and waitstaff were super friendly and cool. Although I didn't eat, I took a look at the menu and it looked scrumptious. I must come back to try the cocktails and the pizza everyone talks about.", "author": "Massimo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "I finally know what Katy Perry feels like! Only replace 'kissed' with 'eat' and 'girl' with 'salad.' It's pretty sad but I'm so proud of myself because I ate a salad y'all! And it was real, real good. It was of the regular garden variety but it tasted super fresh like it would be a good home for a gnome if it wasn't in my belly. The dressing was light and lemony which was just the way I like it.\n\nThe pizza isn't bad (and when I say not bad I actually mean it's pretty awesome) either. And as other Yelpers have mentioned the crust is definitely eating crust! Don't let those carbs go to waste. I was really impressed by how fast the kitchen was turning out dishes and how attentive the staff was even though the tiny restaurant was packed like sardines at lunchtime. The table favorite was the Moscone which was fantastic because...hello sausage and pepperoni.\n\nSave your Cup-o-Noodles for another day. This is the perfect place for a quick and satisfying lunch.", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-13", "description": "We got here after the lunch rush so plenty of open tables. (Btw, trying to find parking downtown is a total nightmare!) Service was very friendly and kept our drinks filled. It's a small place, but very cool vibe. \nWe ordered club sandwich and shrimp salad sandwich. Both very large sandwiches that came with chips. Very solid sandwiches! My friend got a beer and I tried their Rosemary lemonade which was actually really good! I wouldn't have thought of that combo for a drink! \n\nWe were both super full, but since the kitchen was switching over to dinner we got to taste the brussle sprouts and the pork belly sliders and they are awesome!!! My friend I went with this time doesn't like pizza (I know, it's blasphemy!) so next time I really want to try one! I can't wait to come back for full on dinner and drinks!", "author": "Amber M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "Good spot for after work drinks or lunch! Pizza is delicious and the cocktails are very good.", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-06", "description": "This is one of my go-to places for for happy hour or to grab dinner with friends/coworkers. Good variety of beers and other drinks, and the pizzas are fantastic. I've tried the Hearst, Moscone, and margherita and all were excellent - the crust is thin, and the toppings are perfectly balanced and tasty. There's also an interesting selection of appetizers and salads as well that are amenable to sharing. \n\nService is efficient and the staff are all friendly and attentive. Cozy feel inside, although it can get pretty busy during peak hours.", "author": "Oliver L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-21", "description": "The same says it all: you enter at this small bar-restaurant and you will find paraphernalia from another one related to libraries, or bookstores. I liked the decor a lot and be able to sit outside (my friend and I found a table, what a miracle, this place is always packed!). I used to work last year very close by Archive and was my place to go for a beer. I was in SF to do some errands and an ex-colleague from the UK was visiting my former company, so this was the chosen place to catch up over refreshing beers under the scarce SF sun! Perfect service, location and decor.", "author": "Carmen V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "There are two types of people in life: Those who eat their pizza crusts, and those who don't... or are at least very choosey about the ones they do allow to slip past their lips.\n\nI happen to be the latter. \n\nNo crust shall pass my person unless something truly magical is going on, but certainly no hard, crusty, burnt end stuff gets past me. For this reason, archive just isn't my thing. It's def a crust-people sort of place. \n\nThe service was outstanding, while even sitting on the patio with a friend and puppy in tow, but I don't know, man... this just isn't my type of pizza.\n\nSpeaking from just my personal tastes, I liked the pizza about a 3, but the rosé by the glass and super friendly service evens the average out to a 4. \n\nFancy pizza with figs and blue cheese is cool and all, but I'm just not a fancy pants like that. I don't like sweet things on my pizza and if you're not a meat-eater, it's hard to navigate the menu without going sweet. I'm weary of pizza with arugula on it because it's basically a salad pizza and while those two things on their own are great, they have different chew rates and I just don't like trying to carefully eat the arugula so I'm not only swallowing the pizza portion and have all the greens still stuck to my teeth, \n\nI kind of wish they let you build your own and throw whatever ingredient options they have on there so I didn't have to choose between a white pizza (no thanks, ever) or the figgy pie, but it was fine. \n\nIf you have a more refined pizza palate, Archive is perfect for you... maybe even perfect for a casual date. But if you're like me and like your sauce red, your cheese salty, your toppings savory, and your crust a little soggy, well... I just moved here so I don't know which direction to point you, but thanks for reading this far... sucker! (jk, you're probably a really nice person. I was just raised by wolves.)", "author": "Candice G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "Most every bar and restaurant in SoMa or the Financial District is packed between 5:30-8 pm. Try getting a glass of wine anywhere within a 3 mile radius around that time on a Friday, I dare you!\n\nArchive is one of those tucked away gems that has space for you at the bar. Sit down, have a glass of wine, order some cheese and have a friendly chat with the bartender. Or watch the vintage streetcar video of SF, taken a few days before the 1906 earthquake. Either way, it's not jam packed with post-work lurkers. I like it.\n\nPizza is pretty good. Both visits, I had the pie with fig and blue cheese. Sweet and savory with a nice puffy crust. Way better than eating questionable bar nuts or salty popcorn. \n\nThe wine? Ooh yeah! Rose by the glass and carafes are the way to go. Cameron behind the bar will make sure you're not empty for long.\n\nPop on in for happy hour and you might not leave until well until the evening.", "author": "Abby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "5-star lunch. \n\nA pal and I met here for a weekday (semi-leisurely) lunch and it was as good as it gets. We scored a seat on the small sidewalk patio to soak up some rare SF rays, ordered 2 glasses of sparkling rose, and were quickly furnished with fresh, flavorful salads. I opted for the black bean and added chicken....a healthy portion and delicious. \n\nService was on point. We were asked no less than 4x if we wanted more wine. That means that 4x I had to really resist the urge to make it a 2-drink lunch, and it was tough. These girls were sweet AND efficient AND apparently wanted me to get sauced. I wish I could've complied but had to run and catch a plane home. \n\nArchive this: Fresh salads, fast, not crazy cramped or busy, nice wine. Done and done. \n\nTotal price: $51.", "author": "Colleen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "Awesome! Came here on a friday night, the place was busy but not so busy that we couldn't find a table at around 9pm. \n\nOrdered a Dimaggio 'Pie' and a mac n cheese- to everyone who comes here, ABSOLUTELY try the Orzo mac n cheese. It was amazingggg.\n\nthe servers are great and the bus boys even nicer, definitely coming back, perhaps next time for happy hour~ heard great things.", "author": "Evelyn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "Been here a handful of times and can't say I've been disappointed, whether it be for lunch or dinner, the pizza is where its at.  The Hearst or Coit selections are the go to for me.  Came here with someone and they were gonna get a salad, but decided against it to get a pizza cause the price would have been a couple dollars more with chicken on the salad.  Haha, value.  The service is good and the waiters keep up with you, but how could they not the place is fairly small.  A few spots on the inside and a couple tables on the outside.  The bar is filled with Wine and beer and a few Libations.  I usually get some Reds, like the Pinot Noir here.  All in all a good spot for the business crowd and for lunch.  I will be back as it is only down the street from work.", "author": "Jeremaine R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "Went here for dinner and drinks the other night and was pleasantly surprised. I walk by this place a lot on my way to work but have never actually gotten around to trying it. This place is pretty small but super trendy and great vibes. \n\nDRINKS:\n- Mission Brewing Shipwrecked Double IPA - great choice\n- Witness Tree Estate Pinot Blanc - delish (similar to Pinot Grigio)\n\nFOOD: (split both items)\n-Truffle Orzo Mac and Cheese - amazing but super heavy and creamy, also got a little mushy because it was orzo but overall really great to share!\n- Moscone Pizza - really yummy pizza with sausage, pepperoni, black olives, mozzarella and tomato sauce \n\nThese two items were more than enough to split. We couldn't even finish the whole pizza! The food was great though, I will definitely be back soon.", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "I came here with tres amgios for the lunch of a lifetime! It was an epic SF afternoon and we were perusing for some trouble. We decided to kick down the doors of Archive and get what we wanted...delicious artisan pizza (& a salad, duh). We didn't even have a wait! \n\nWe split a pizza and salad because we were looking for a light lunch. The salad we got was Caesar and boy was it perfect. It was the perfect precursor to a radical ZA. We opted for the \"Hearst\" pizza. It has bacon, truffle oil, mushrooms, goat+mozzarella cheese and a perfectly made gluten free crust (gluten free for a small extra charge). It was sooooooo good. Literally the perfect ingredients. I need to recreate this masterpiece...\n\nIf I were hungry, I'd probably be able to manhandle my own pizza but I wasn't in the mood. Just needed something to keep the waistline slim and the stummy full. I'd totes go back.", "author": "Aaron B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-08", "description": "Great spot for lunch or dinner!\n\nThe Lucas & DiMaggio pizzas are my favorite - give them a try.", "author": "Ananya M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "Been wanting to check out Archive for so long and finally had the perfect excuse!  A dinner catch up on Thursday night.  We got there a little after 5:30 and it was already starting to get crowded.  The only tables that could fit us had the reserved sign, but they saw me walk in and look around and asked me if I would be ordering food or just drinks, I told them food too, so they let us sit there.  Guess that's their way of saving it for people that want to dine, pretty smart.\n\nOnly thing on their happy hour menu for food was a dollar off the pork belly sliders.  My sangria which I just got a glass of was a few bucks off.  The guys got wine and beer that wasn't a part of happy hour.  We decided to start with the orzo mac n cheese, the fried brussel sprouts, and the Hearst Pizza. The Sangria was rose based and was nice and refreshing.  I wish I had a little more hints of fruit in there though.  The orzo mac n cheese was very different as orzo is a rice shaped pasta, and it was served more like a dip as crostinis were served along side.  It had a hint of truffle and was a nice alternative to traditional Mac n cheese.  Reminded me of a savory rice pudding.  There was a hint of truffle oil.  The two waiters were slammed, and we asked for extra crostini pieces, but never got them.  No biggie, we were resourceful and used our crust to dip it in, and ate it by itself too.  If you love mac n cheese and love rice, then I would suggest you get this.  The brussel sprouts weren't chips per say, but when I got the leaf pieces, it reminded me of Marlowe's chips, but way better then theirs. They were well seasoned and not overly greasy.  We substituted the goat cheese for ricotta on the Hearst.  The Hearst was our favorite.  It had truffle oil, mozzarella, wild mushrooms, pancetta (and originally goat cheese too).  It was a perfect marriage of flavors with the two cheeses, and the woodsiness of the mushrooms and slight saltiness oft he pancetta.  And we love our truffle oil!  I would have just like the crust cooked a little more to get some crisp to it.  \n\nWe were still a little hungry, so we got the Lucas pizza too, which I was honestly eyeing too!  It was topped with apple slices, gorgonzola, proscuitto, arugula, garlic oil, mozzarella, and ricotta.  The pizza was quite rich with the assortment of cheeses and that stanky gorgonzola.  The salty, savory and sweet elements were enjoyable.  I used to love gorgonzola, but now I find it a little too strong for me, I think if it weren't for the gorgonzola I would have loved the pie, although we all enjoyed it, the Hearst was the winner.  Again, I thought the crust could be crispier.  \n\nI'm so glad I finally got to check out Archive.  It's a great place to grab a drink and some dinner or munchies with a couple of friends.  I would really like to see what lunch is like here too.  4 stars.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-11", "description": "WOW, who shoved a stick up your bum miss little cocktail waitress who looks like a heavier version of Hayden Panettiere???\n\nI was meeting 2 girlfriends for cocktails on a MONDAY night. They got their first and took a table for 4 - they said the waitress gave them attitude for sitting at a 4 top, and asked \"where is your friend\" implying they might have to move to a 2 top when I was 5 minutes late. (SIDE note: the place never filled up in the 2 hours we were there, so not sure why she was so concerned)\n\nAnyway I order a $12 cocktail and ask for a \"big glass of very icy water\" she brings my cocktail and a glass of water - no ice, I ask again and she says \" the water is as cold as ice\" -- okay - but can I still have a BIG glass of ice? - she huffs off and brings me a short glass of ice..okay, I'm still happy to see my friends and not too upset. Then more attitude from her. The place is 3/4's empty and we have to flag her down to order food - we order a pizza and brussels sprouts.  When we were halfway through the pizza we asked about the spouts... \"oh I though you were just asking about them, not ordering them\" Seriously what the F?   \n\nThen she tries to take away our dishes when we are clearly still eating. \n\nA group of businessmen come in after we had been there for about 45 minutes, she was at that table for about 10 minutes and kept their drinks filled, so not quite sure what we did to her, but we will not be back.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "More watering hole than eatery judging by the extensive display of libations they offer (photo: http://bit.ly/18L8sp9), this is still an unexpected find at a pretty busy location on Mission right off Second Street in the lower FiDi. This space was where Mondo Caffe operated for a number of years in what looked to be a thriving lunchtime business. I used to have the occasional porchetta panini there, and it was good eatin' albeit pretty greasy for a coldly impersonal colleague lunch. Except for the three thin-crust pizzas on their menu, the Italianate influence has disappeared in favor of new American bar bites. There is now an Old San Francisco feel to the exposed brick and Edison bulbs, but the ambiance is casually contemporary (photo: http://bit.ly/IOYhsZ).\n\nI happened upon Archive on the third day of their operation last week, and the place was only half-full. There were empty seats at the bar, so I parked myself while perusing their brief lunch menu (photo: http://bit.ly/1cw7bDi). I landed upon their $8 Bits & Gems Salad, a most refreshing plate of little gem lettuce with radish slices and freckled with bits of Applewood smoked bacon and pomegranate seeds. It was drizzled with an Asiago cream dressing that lent a bit of tartness to the plate (photo: http://bit.ly/18QaPtO). I enjoyed the salad, and it made me want to come back with a friend to try one of their pizzas and a house drink like the Atlas Apple which features strong cider, chai, walnut bitters and spiced pear foam. Sounds perfect for this time of the year.\n\nFOOD - 4 stars...refreshing salad, simple and tasty\nAMBIANCE - 3.5 stars...turn-of-the-last-century vibe with a contemporary twist\nSERVICE - 4 stars...friendly and jovial\nTOTAL - 4 stars...nice addition to the local bar scene, looking forward to their full food menu", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-15", "description": "We ordered the fall special pizza and it was tasty! I was hesitant about having squash and pomegranate seeds in my pizza, but the flavor came together really well and it was on the lighter side. One order can easily be split for 2 and we were even able to add in a side of Mac n cheese (which I highly recommend). They don't have a full liqueur license so drinks are a little limited. We ordered the sangria rose and it was pretty light and was on the sweeter side. Don't let it fool you though, I definitely felt that drink later", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-03", "description": "Came here on their soft opening week and it was delish!\nThey didn't have their full menu but all the pizzas and the salad we tried were all good. Prices are reasonable for the area.\nService was attentive for our group of 10. I would definitely come back for lunch and happy hour.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-14", "description": "Another Happy Hour place within close proximity to my office by Montgomery BART. I came with a few friends the Friday before Labor Day and it wasn't too crowded around 5:30 PM. \n\nFrom memory, I think their Happy Hour is weekdays 3-6 PM and the specials included $6 Spring Sangria, $4 beers, and $4 house red/white wines. Unfortunately they didn't have a printed Happy Hour menu or sign, despite older pictures on Yelp. And they also didn't have a Happy Hour price on food, which was sad because I enjoyed their Sutro pizza with its whole garlic and fresh ricotta cheese...mmm. I guess I'll just have to get this during regular lunch or dinner!\n\nWe only came for a couple of Spring Sangrias and they were strong! Not a bad deal for $6, but they were on the smaller side. I'd come back again for a quick drink but go elsewhere for Happy Hour food specials.", "author": "Bonnie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "Really liked this place. It was my first stop for something to eat when I arrived in San Fran and after I checked into my hotel. It seems like a bar restaurant that attracts the young, local business folk. I felt like maybe I was the only tourist. Dim mood lighting but still showing sports on the tv, it was a nice balance of trendy artisan pizza spot and place you could go to calmly watch a game. \n\nI enjoyed a seasonal sangria that had apple and cinnamon spices. It was good, but I would have preferred it to be more spiced. It still tasted somewhat summery. All in all pretty good though.\n\nIt was sort of late for lunch so I decided to have a pork belly slider and the cheese plate. The slider was on happy hour special so it was a dollar off. I didn't think it was all that good. The pork wasn't so flavorful and tasted a little like the oil it may have been heated in. I could have done without it. \n\nThe cheese plate was really very good. I believe it came with 3 or 4 cheeses, all cut in thin triangular slices, with a generous 3 or 4 slices each. It came with round toasted bread slices and square crackers as well as honey, a fig jam and some toasted spiced nuts. I don't know what kind of cheeses there were - the waitress thought they were some kind of goat, but I would have expected them to be creamier if that was the case. It would have been nice if the staff knew the cheeses they included, but luckily I like almost all cheeses so I wasn't worried. There was only one I didn't eat because it was just kind of dull in comparison to the others. The fig jam was sweet and thick and sticky and complimented all these cheeses, as did the honey. The nuts were a nice additional snack. The plate was really filling. \n\nFor what it's worth, their pizzas looked pretty delicious. I just didn't want to spoil my dinner, otherwise I would have considered. \n\nI liked the atmosphere, the crowd, the cheese plate and the pizza (in theory). A great spot to check out!", "author": "Samantha M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-12", "description": "If you're coming here for food, you'll be absolutely disappointed. The bar is nice and cozy though but the worst pizza I had in my life. Also it's way overpriced for this quality", "author": "Rana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "Archive Bar & Kitchen is a good addition to the neighborhood.\n\nIn a narrow storefront with dark cut concrete floors and exposed brick walls, Archive Bar & Kitchen is a good place for lunch or happy hour. Looking like it has been in place forever, there are vintage tchotchkes among the bottles behind the bar and period fans on the ceiling.\n\nWith the limited kitchen space, the menu at Archive Bar & Kitchen is surprisingly well-rounded. Lunch consists of an array of sandwiches from the the healthy Archive Club ($14) featuring thin slices of turkey, bacon, avocado, arugula, green tomato, and roasted garlic aioli to the hearty pastrami and peppers ($13) with thin slices of pastrami, sweet and spicy peppers, sauerkraut, Irish cheddar, and Ruasian dressing. All the sandwiches are sizable and delicious.\n\nThe real star of the show is the pizza. With sausage, pepperoni, black olives, mozzarella, and organic tomato sauce, the Moscone ($16) was tasty. The thin-to-medium crust is cooked perfectly to a nice light brown. Light and airy it is more chewy than crispy, but still nicely done. Very flavorful, the Hearst ($15) sports white truffle oil, goat cheese, fresh mozzarella, wild mushrooms huge hunks of bacon.\n\nDinner adds various \"Bites and Boards,\" ranging from the amazingly creamy truffle orzo Mac and cheese ($8) to bacon and feta meatballs ($10.50) served with fresh basil and a hearty tomato sauce. \n\nA few local craft beers are on tap. The well-priced but short wine list features west coast wines with a few offerings from Argentina. Although Archive Bar & Kitchen lacks a full liquor license, it does offer some \"cocktails\" beaded on sake or Ron Copa Rica wine-based \"rum.\"\n\nA warning: it gets crowded at lunch and happy hour, so be prepared.\n\nFor lunch or happy hour, you can't go wrong at Archive Bar & Kitchen.", "author": "CJ G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-08", "description": "I called to make a lunch reservation and they told me they don't take any. Fine. I get there a little early just in case. What do I see?? Two tables with \"Reserved\" signs on them.\n\nI ordered he Hearst pizza w/o garlic sauce. Tasty.\n\nGood service. \n\nSo...Poor ventilation, extremely loud setting, and being lied to on the phone. I don't think  I'll be back.", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "Whoa.\n\nGet yourself here, guys.\n\nStop holding your team lunches at your regular spots because Archive is really, really good. They seriously offer the best pizzas and salads I've had in the area, paired with some really great things on tap.\n\nThe 'Lucas' pizza ($17) was a good combination of light and heavy flavors with prosciutto, ricotta, fresh mozzarella, gorgonzola, apple slices, garlic oil, onion & arugula. Although, the 'Hearst' (also $17) with white truffle oil, goat cheese, fresh mozzarella, wild mushrooms & bacon really stole the show for me. The bacon comes in THICK, freshly cut cubes. Oh my gawd, this pizza is so good. \n\nFYI, the full-size salads are huuuuge and can easily be shared amongst your table.\n\nThe space is intimate and cozy with exposed brick, and century-old footage showing on their TV's of people riding their Model T's down Market Street to the Ferry Building.\n\nI'm all about this place.", "author": "K M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "Solid spot for lunch during the work week. It's close to the office, very tasty, and usually has a good turn around time. It's always busy, but somehow we've never had to wait for table. We can get in and out in under 40 minutes, so I keep coming back.\n\nHave only had their pizza, all of which were great. The Lucas, DiMaggio, and Hearst are the ones that stay on the regular rotation. Service is good, prompt and friendly and they usually don't interrupt during the meal to ask how everything is, which is nice during the lunch rush hour. If the weather is nice, they have a handful of tables outside. The only downside is the inside can get loud. It can be difficult to hear the person across from you if you don't lean in or raise your voice. If there are more than four in the party you probably won't be hearing what everyone says.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Archive is fantastic. It has a snazzy ambience and a good selection of artisan pizzas. My favorite is the Lucas: prosciutto, ricotta, mozzarella, gorgonzola, apple slices, garlic oil, onion, and arugula. It might sound a little crazy, especially with the apple, but the flavors work well together and it's delicious. I've also had the Moscone and Hearst, which were both good but not as good as the Lucas, at least in my opinion. The salads also look good, but I've never had them; the pizza is too good!\n\nThey have a good selection of beers on tap too and a pretty extensive cocktail menu for a dinner place. My favorite used to be the Behind the Green Door, which was a green lychee drink served in a goblet but they didn't have it the last time I went. So it goes. Archive is still worth coming to for the pizza and beer, and I'll definitely be back.", "author": "Nikhil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-11", "description": "Four stars for the food, three stars for the price. I had a om-nommy sando plus a small side salad. Not going to lie--that alcoholic root beer was looking mighty fine, even though it was noon on a weekday.\n\nAt first glance, the side salad looked like a bad move. $3? For the clump of lettuce? But then, friends, I dug in. That side salad had a panoply of things: cheese, tomatoes, almonds, cucumber. It was a delight. And a way better move than the $14 sandwich. She sandwich was good, but damn, was it pricey. $20 lunches aren't generally my thing.\n\nThe people watching was also great--right on Mission Street. Be warned, you'll have to hear the traffic and other such nonsense, but such is SoMa. \n\nThe good: good food.\nThe bad: they want all your dollars.\nPro tip: get there about five minutes to noon and you won't have any problem finding a seat. If you arrive after noon, good luck.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "I loved the food!!!\nThe Hearts pizza was amazing!!!\nDrinks are really good too\nMy favorite is the Tony Bennet", "author": "Monica D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "I'm so happy that this trendy establishment popped up right near where I work! This hidden gem makes for a great lunchtime spot to grab pizza with friends or to enjoy an evening libation after a long day working in the FiDi. \n\nThe pizzas they have are packed with delicious ingredients: I'm talking goat cheese, cloves of garlic, and lots of different veggies. This ain't no dominos here. The seating is very tight, so while I was annoyed at people scooting past me, I also got a good view of pretty much everything else on the menu, ordered by patrons at the neighboring tables 1.5 feet away from me. Everything else looked good, and the staff was friendly and somewhat quick.\n\nOnce you get past the tight spaces and armies of yuppies you need to shove past to get a seat, you'll really enjoy this neat little spot!", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "They are super crowded but the staff is really nice and surprisingly accommodating. They pretty much have a full bar and serve some pretty drinks (like the Watermelon fog which should be called the Gandalf). \n\nTheir main draw is supposed to be their pizza and I think the 'artisanal' ingredients (ie: truffle oil, fat pieces of bacon) are good but the dough is really lacking. I still prefer places like Tony's and even Zero Zero but this is a fun place to hang out.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-24", "description": "Misleading prices on the happy hour. Beer is not included in the Happy Hour menu. Another table complained about the same problem left with $45 bill for 2 drinks and a dish. Our party of 3 left with $75 bill.\n\nFYI: Apparently, $2 off on Libitations means a few dollars of 10 custom cocktails.  The cocktails are weak in alcohol volume. Hmm, try food instead?", "author": "Peter G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-22", "description": "EDIT:  Wow, rude response from the owner.  \n\nThere is nothing false about my review.  My friends and I were all mislead into thinking that the cocktails contained actual liquor.  Also, as I said, I would have been happy to enjoy another type of drink had I known what it was I was buying.  If you want to know about the quality of the cocktail it was (like the food) completely forgettable.  \n\nHere's a hint, Gabriel-- businesses are about your customers, and reviews are about constructive criticism.  Sorry you got your feelings hurt.\n\n**************\n\nThis place gets packed during happy hour, but my friends and I were able to grab a table.  The food was so mediocre I can't even remember exactly what we ordered (some kind of pizza and some appetizers).  \n\nHowever, the worst thing by far about this place is their misleading House Libations cocktail menu, which lists several types of drinks specialty drinks, including drinks containing \"fermented vodka\", \"fermented whiskey\", \"fermented rum\", etc.  The average consumer (myself included) would assume that this list contains cocktails with actual distilled spirits (especially considering the prices of these \"cocktails\", which are on par with those containing liquor), however, apparently \"fermented\" is another way of saying \"not liquor.\"\n\nI get that not every place has a liquor license, and I'm totally fine with beer and wine only, but why masquerade as something you're not?  My friends and I were very disappointed to get our drinks with no liquor in them.  Misleading advertising, in my opinion, and at the very least, it makes for an unhappy customer who was hoping for real whiskey in their glass.  We won't be returning.", "author": "Erin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-23", "description": "Went here for some drinks and apps after work. The cocktails were way too sweet and on the weaker side. They apparently also don't have a full bar, so they weren't able to make other drinks off the cocktail menu. The sliders trio were pretty good, but the orzo mac & cheese wasn't very flavorful and felt too runny. However, this place had efficient and friendly service.", "author": "Critic X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "Found this place thanks to Yelp on my most recent visit to San Francisco.  Went on a Monday night and it was pretty empty.   Our server was super nice/friendly and gave my husband good beer recommendations.  \n\nWe ordered:\n- popcorn prawns:  pretty big portion....was perfectly crispy and juicy.  I liked the Thai chili sauce it came with\n- Margarita Pizza:  Yummy...can't go wrong with tomatoes, basil and mozzarella\n- Caesar Salad: BY FAR, the best caesar salad I've ever had.  The dressing was creamy and the bread crumbs on top perfectly complemented the dish.  YUMMY.  Would highly recommend.\n\nDinner was sweet and simple.  Just the way I wanted it.", "author": "Rina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "Delicious pizza and great service! The waiters went the extra mile by checking in often, providing excellent recommendations, and even going to the back to bring out balsamic vinegar and olive oil for me :)\n\nInside is really nice as well, with a warm and welcoming ambience.", "author": "Anna X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "Stopped by around 9 on a Thursday to a pretty quiet joint. Bartender (and owner?) was manning everything out front, given that there were maybe at most 3 small groups/individuals including us at the time total the whole time we were there. He was very friendly; also mentioned that they ran out of the pulled pork, since he stopped serving it as it was not up to par anymore by that time. I like that he cares about the quality of his food.\n\nPizza is a decent thin crust, but the crust is nothing to rave about. I prefer the edges to be the crusty chewy bulbous kind as seen on a good neopolitan pizza fired in a high-temp oven. They don't serve that style here. The toppings on the squash pizza and the meat one were both tasty though. Wish they were a little more liberal with some of the ingredients. By comparison for example, Casey's Pizza is more generous and more to my liking in general. I'd give this pizza a 3, and something like Delfina a 5 in the thin crust department.\n\nI'm giving them the benefit of the doubt since they're so new that the food will be even better as they get into a good groove. Looks like it'd be a great place for drinks after work, too. Nice vibe here, just needs some more people inside.", "author": "Linus W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "THE BEST MUSHROOM PIZZA I HAVE EVER HAD.  5/5! \n\nMy co-workers and I came here for lunch on a Monday afternoon and the place was packed. However, the owner was really nice and set up tables for us outside. The menu isn't that big but it serves all meat lovers, vegetarians, pescetarians, etc. \n\n(+) HEARST PIZZA. My favorite pizza on the menu! It's even better if you ask for extra arugula on top. Hands down the best mushroom pizza have ever tried. I'm not a big fan of goat cheese but it went really well with the mushrooms. The pizza crust is really thin and the mushroom makes the center really soggy but the overall pizza is so good that I didn't mind. The pizza isn't that big, perfect for one if you're hungry. If you don't finish it, no worries because it still tastes delicious when it's cold later on! \n\nI also really like the diMaggio and the Margarita ! Not a big fan of the Lucas, but that's just me. \n\nThe service was really good. The waiters were constantly refilling our water. The food did take awhile but it's a nice atmosphere for sit down and chat with your friends. I do recommend getting there right when it opens to get a good seat. Can't wait to come back to this place !\n\nHAPPY HOUR: I love the pork belly sliders! Kind of pricey as it's $4 per slider but it's pretty worth trying it. \n\nDRINKS: The GIMLET is AMAZING. Don't pass up on it", "author": "Tram N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "This place is amazing!!! True it's small- but what awesome bar isn't in SF? Does anyone ever say, this place is awesome and huge? Never. It just doesn't happen. It's almost like the smaller the place the better. It's like supply and demand- oh there's a ton of people waiting outside- this place must be bomb. Well this place is not exception. Definitely bomb and the pizza is amazing! I mean for 16 bucks for a pizza I probably could have eaten on my own better have been worth it. The sangria was delicious and I'm very picky with it. They have wine and beer, but no full bar. Womp womp. The pizza we ordered had basil and ricotta and pears. So delicious!! I deducted a star only because they didn't have a full bar and it was fairly pricey for the amount of food you got. But it's SF after all! Still I would come here again - if I'm in the mood to wait that is.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "My boyfriend and I chose to grab lunch here as soon as we arrived in the city during our last visit to SF. The gluten free pizza is amazing!!! The staff is extremely friendly here as well as attentive. We came in just before the lunch rush but noticed that many people came in on their lunch breaks solo - the service was prompt and food served in a timely fashion. Everything we ordered was delicious. The decor/music/atmosphere is fun, relaxed and covers street noise without making it difficult to hold a conversation while dining. We will definitely be back again!", "author": "Madison S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-01", "description": "This place bums me out. Inconsistent service and bartenders who act like they are doing ME a favor (Hence chick in nerd glasses with ruby red lips). Having been a bartender in college, it really fires me up when I am treated like crap...but when it is time to pay, bartenders/servers are nicey-nice. That is what I got...be thankful for the 20% tip you did NOT deserve sweetheart.\n\nI had a jackhat on my left literally sitting his fat behind in my space and the pretentious British Pr@#ck on my right who acted like I had cooties.\nYou British are real Wankers.\nHappy Hour sucks and I hate spending my money at a place where I am made to feel like an inconvenience.\n*Blows*", "author": "LisaLisa F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "i LOVEEEeeeeEe archive. and their $5 house wine during happy hour. and their pizzas. and shishito peppers. \n\nhonestly dont remember what the girls and i did for happy hour drinks before archive existed, but we've been coming foreverrRrr and it's gotten better and better. at first the pizzas were kinda soggy and not delish, but now EVERY SINGLE selection is just fantastic :) MAD PROPS. and the servers, host, AND owner are soo friendly, and definitely hook you up if you're there often enough...\n\nTHE BEST.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Great for lunch and dinner. Archive's pizza is pretty outstanding and maybe the best gluten free crust around! Try it... even if you don't need to eat gluten free... it's that good!\n\nI would skip the cocktails but they have a nice wine list.\n\nSome of the mouth watering pizzas to choose from: \n\nDiMaggio :Mild Italian Sausage, Paquillo Pepper, Wild Mushrooms, Ricotta Cheese, Mozzarella & Garden Pesto - Substituting the Pesto for red sauce is also a good idea. \n\nSullivan: Roasted Butternut Squash, Piquillo Peppers, Goat Cheese, Pine Nuts, Arugula & Organic Tomato Sauce\n\nThe menu gets updated pretty often - and have also had an amazing bbq pork belly pizza and one that had potatoes and lemon - can't remember what either of them were called - but everytime I go to Archive I search the menu in hopes that they have returned. \n\nService is always top notch and typically pretty easy to grab a table for a small party.", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-03", "description": "Came here for dinner with my two other friends. Our water was constantly refilled which was good service, but the pizza was okay. I liked the crispy thin crust but the bottom was a bit burnt on one of our pizzas. We had the Moscone and the Hearst. We replaced goat cheese with regular Parmesan cheese. We also ordered the truffle Mac and cheese, which you can never go wrong with truffle on anything! It was good but didn't have the Mac texture which was weird - it was more like rice with truffle and cheese. Overall good experience with the company I came with. Pizzas could be less burnt at the bottom, but flavor was good! Very loud atmosphere as well, hard for us to hear one another.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "Loved this place!  Great food and atmosphere. Highly recommend!  Great food - we got roasted brussel sprouts, spinach and artichoke dip, bruschetta....  All very tasty....will definitely go back.", "author": "Cathy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-20", "description": "Great cocktails, pizza, and atmosphere. Super friendly staff and a fun place for happy hour! Killer cheese plate too..", "author": "Stephanie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-05", "description": "I was a huge fan of Mondo Caffe, which occupied this space before Archive opened about a year ago, and I was concerned that my go-to spot for a sit-down lunch might no longer be available. I'm glad to say that Archive does a nice job of providing a slightly nicer-than-usual lunch spot with a chance to sit down and actually talk to your lunch date. Unlike Mondo, Archive has table service, so no need to order at the counter. They do offer takeout, though, which you can order in the back.\n\nThe food is good, too. I've had their pizzas, which are tasty and filling, I've had the pastrami sandwich, which comes with chips and is really delicious, and yesterday I had the kale, blue cheese, and nectarine salad, which was a little on the skimpy side, but tasted great. Lunch usually comes out just under $15, which is a little more than I usually spend, but sometimes it's worth paying extra to focus on the conversation.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "This is my go-to spot for happy hour after work!\n\nExcellent service, everyone is attentive and friendly, could not ask for a better experience while I wind down after a long day of work.", "author": "Mario P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-16", "description": "Archive is usually very full since it's not that big of a place inside.  However, when my group of ten people wanted to have some post drinking carbs in the form of pizza, I immediately suggested Archive since it was already 8:30pm and there should be no way that Archive should still be busy.\n\nAs predicted, the tables were free so we squeezed into tables, ordered some more booze, and ordered six pizzas from their pizza list.  I was in front of the vegetarian pizzas and despite the lack of meat, these thin slice pizzas were delicious!  One pizza can feed two people moderately.\n\nI'm definitely hooked on the pizza and most likely will be back from all the local bars that don't offer any food.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-24", "description": "Me and my girlfriend went here to have a few beers and some sangria, and to meet up with a friend of hers. \n\nWe got in and got a table right away. Ice cold glasses of ice cold beer, sangria was amazing and the service was pretty good. We ordered the sliders (which were heavenly) and we ordered two different pizzas (also crazy good). \n\nWe paid up by splitting the tab, but since me and my gf ordered a beer before her friend arrived, we said we'd pay more of the tip.\n\nLong story short, we ended up leaving a $15 tip on a $150 tab. We're from Norway - where you don't tip at all - and thought that was plenty. In retrospect, we should've bumped it up a few bucks, but oh well - we were all kind of tipsy and I didn't feel like math.\n\nSo we leave, but as we are leaving, the waiter comes RUNNING out to us and basically heckles us to give him a bigger tip. \"Are you not FROM here?\" is a quote I'll remember for a while. \n\nThat ruined the entire night for me. So a 5 star place ended up as a 1 star night - all because of 10 dollars and a douchebag waiter. Will not return. Unfortunately.", "author": "Kris S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-24", "description": "The food is good, but it's a tad crowded and be prepared for a very noisy and busy atmosphere.\n\nFor an appetizer, I split the Popcorn Prawns with two other people. They were delicious, and too my surprise, the \"Crispy Lemon\" in the description actually meant deep fried pieces of lemon. The lemon tended to fall apart as you tried to eat it, but the flavour was unique and I'd recommend that appetizer to anyone. For my entree, I had the DiMaggio pizza. Taste wise I would call it pretty average, size wise it was perfect for a big guy like me, but will likely be too much for a lot of people.", "author": "Graham B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-21", "description": "Came by to check out this place since its just around the corner from my office. Loved the prosciutto and buratta appetizer (it came with apple slices and almonds) and the truffle Mac and cheese with orzo was delicious. \n\nThey also have great pizzas, but they can take a while to bake. Lots of beers on tap and the sangria was also great. Would definitely come back for lunch or dinner!", "author": "Jing L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "I pass by this place often and everyone always look so cheerful and satisfied so I decided to stop in. \n\nI enjoyed the outdoor dining on Mission and 2nd. I had the pleasure of being served by Dennis S. From the moment he handed me a menu to the moment I left him a well-deserved tip, I was satisfied. \n\nI truly appreciate him asking me how I was doing. I expressed I has an awful headache. \n\nAs I've never been here before, his menu recommendations were so aligned with my appetite. I enjoyed the Greek olives as well as green olives. I then indulged in two pizzas. Yes, two. We chucked together about my huge appetite, well our huge appetites and how our friends laugh at us about it. \n\nI enjoyed a nice glass of white wine. I cannot recall the exact wine, but it was delicious and went well with my pizza selections. \n\nWhen I was preparing to leave and catch my BART, Dennis checked in and asked about my headache (he remembered). I forgot about it as it completely went away!\n\nFor stellar genuine service, great ambiance, delectable food, and comfy yet exquisite dining, find yourself at Archive. I must go back again. Thanks y'all! My night has been made!", "author": "Renée H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-22", "description": "Welcome to the neighborhood, Archive!\n\nAnd a neighborhood spot it is. Whether I stop by with colleagues for an alfresco lunch or drop in for after-work cocktails, that warm and fuzzy casual feel is always in the air. The manager/owner is usually around and seems super invested in his patrons' experience - what a nice guy!\n\nI've tried their cheese plate and also the pizza. My choice of pie arrived piping hot and topped with bacon, mushrooms, goat cheese, and garlic. I opted for the gluten-free crust and it was phenomenal... I had to stop myself from eating the last three pieces as it was that delicious, yet I was full! Of course, it made for great leftovers.\n\nNot that many people know about Archive yet, and even fewer know about their wonderful cocktails and specialty sodas and lemonades. Throw in a well-curated wine list and some decent craft brews and this is a bar I'll never say 'no' to. Only drawback I can think of? When the pizza ovens are going, this small restaurant gets hot - so hot, that you'll even feel the heat on their outdoor patio. Not a big deal now, but something to think about on one of those rare 80+ degree days!", "author": "Jelena Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-24", "description": "Met up with a buddy of mine here tonight around 630, and was surprised that we were able to get seated as easily as we did, considering the place was packed. After a bit of deliberation, we ended up ordering the Hearst (for the truffle oil) and the Garcia (for that soft egg, mm).\n\nUnfortunately, both of us were a little disappointed with our orders. While prepared and baked well, both our pizzas were a bit lacking in flavor and depth: the Hearst, despite having ingredients that have great flavor on their own, fell short, being overwhelmed by the saltiness of the prosciutto; the Garcia, on the other hand, was much tastier, but was almost completely lacking in truffle flavor. We ended up supplementing our slices heavily with chili flakes to boost the flavor.\n\nTo be fair, their pizza is not terrible, and is better than that of Zero Zero - all things considered, in another city, I'd probably give Archive a solid three stars. But, given the selection of high quality pizza in the city (Little Star, for example), I can't really see myself coming back here.\n\n***Accessibility Info***\n\nVenue - A smallish venue consisting mostly of high-top counter seating, or high-top tables. There are a handful of small two to three seater tables outside, as well as a lower counter for two inside, but that's about it.\n\nBathroom - Didn't check them out.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-02", "description": "I ordered a salad. After eating it for about five minutes, I found a large insect in the leaves. I told my waiter, and then the manager came over and told me he would take it off our bill. He did not apologize. After telling him I was disgusted by my meal, he became rude and arrogant in my face. Still no apology. I asked if he could also take care of my two other guests' salads, because we all had the same lettuce leaves, and he said 'Oh so now you're telling me what to do? Now I do what you say?' I was in disbelief.\n\n He was a jerk and he did not treat me with respect. Finding an insect in your food should definitely warrant an apology. They've lost me, as well as all of my coworkers, as customers.", "author": "Natalie Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-05", "description": "Great place for lunch during the work week! This place gets super packed quick so make sure you make a reservation or arrive before the lunch rush.\n\nI highly recommend the Hearst pizza and the chicory salad! I met up with a friend and we split these two items and we were sooo FULL! The Hearst pizza had truffle oil on it and we also added an egg on it. The pizza was thin crust which made it better since I'm not huge fan of pizza crust. The chicory salad was really refreshing and tasty I think we added chicken to this which made this more filling. \n\nI would love to come back for their happy hour!", "author": "Christine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-10", "description": "I really loved Archive Bar & Kitchen. My first visit was for a group lunch and I enjoyed it so much that I went back for a date with my beau that Friday night. On both visits I enjoyed the Mediterranean-style salad with crunchy pita chips. After tasting the chicken alfredo pizza on my first trip, I knew we had to order it again the second time around. A wise choice. The other pizzas I tried were great as well (especially the one with sausage). \n\nServers and management were all friendly and helpful. I loved the big bottles of flavored iced tea during my lunch stop and I enjoyed the wine selection even more during my evening visit. Solid spot for lunch, happy hour or dinner. Looking forward to returning next time I'm in San Francisco.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "Checked out Archive during peak lunch hour with a group and we shockingly scored a table to fit our entire group. The seating is pretty sparse and most of the tables are set for four and the set up is true SF fashion in being pretty intimate without being too vast and lofty. \n\nTo best serve our whole group, we split most of the pizzas from the menu. Can't say that I had one that I disliked. Each pie would be more than a formidable meal for one person to take down and they were split amongst our group well. I'm a fan of the crust, too. Nice and chewy with some well-done/crunchy/crispy spots, too. Favorites were the varieties with veggies and goat cheese. The few with meats were equally good. \n\nProbably the most minute, yet, still notable item on the menu is the rosemary lemonade. It was fantastic. Not too too sweet, packed with flavor, and rather refreshing. Really loved it. \n\nI'd head back for sure. Great spot for a great meal.", "author": "Benjamin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "The service was excellent here!  Called ahead to come in with our group of 6 and everyone was super nice and attentive.  Delicious food and drinks!", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "Awesome wine, delicious pizza, my favorite olives, and super friendly staff. Great spot to hang out after work.", "author": "Tasha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "Archive is a fabulous addition to the SOMA/FiDi food/drink scene.\n\nMy co-workers and I came here for lunch the other day. This new gastropub is literally right around the corner from our office. I'm glad we arrived early, because this place fills up quickly starting at 12pm.\n\nThe manager/owner was nice enough to greet us/seat us. He also took the time to tell us about the history of the space (it's one of the few buildings to survive the 1906 earthquake and fire) and walk us through the menu.\n\nAs for the food - the kitchen is totally rockin' it. Our party of 5 decided to split a few salads (which are quite large in size) and 3 pizzas. All the pizzas are thin crust and made with seasonal ingredients. Our favorite dish was the chicken pizza, hands down.\n\nSince it was technically a working lunch, we abstained from the booze. But the bar seems like it has a pretty stellar beer and wine selection. And while they don't have a full liquor license, they seem to have some interesting cocktails made with wine and sherry. I'll definitely return soon for happy hour and sampling some of their adult beverages.\n\nAll in all, this was a great discovery. Archive seems like it's off to a strong start. And judging by the busy crowd, the word is catching on!", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-24", "description": "I swung down for Happy Hour just the other day with my girlfriend, and after a beer, I think I kinda dig their groove. They have a pretty sweet happy hour deal -- $2 off pizzas (which are from $13-$15 each), $2 off drafts, $5 house wines, and $6 sangria. They don't have a ton of draft selection, but what they do have is quality. I recommend getting their amber selection. Realllll good. Only complaint with their beers is that it's not quite a pint. I can't imagine paying the normal $7 for a little more than a soda-sized glass beer. Their sangria is a also little lacking - both in size and in flavor. I didn't like it, and the girlfriend definitely didn't like it (she made me drink it). Better stick with their house wine or beer. Their cocktails are reasonably priced and sound great, but I didn't get a chance to try one, so I won't venture out there. \n\nOverall, it's a nice place to hang out if you want to grab some drinks for happy hour and a quick bite to eat. Good location with outdoor seating and a good vibe inside.", "author": "Zi-on C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-01", "description": "Reading all the 4 star reviews we went to archive for dinner. The drinks were good - beer selection is solid and sangria was well made. But the main event -- pizza -- was terribly disappointing.  When I pay $18 for a smallish pizza pie, I expect it to be good. I mean Delfina good (ok there is no such thing, Delfina is the best)ok, La Nebbia good or at least beretta good. Nope. The crust sucked and the rest of the pizza was mediocre. It's not even farina good and that's as far as I'm willing to go when I pay $15+ for a pie. Won't be returning. Do yourself a favor and visit zero zero instead which is a few blocks from there and definitely worth the hike for a better pizza.", "author": "Hema P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "I've stayed in this area a few times when visiting SF, but only on this most recent trip was I privy to the deliciousness being pushed out of Archive just around the corner...\n\nOn a drizzly night, a group of five of us were in need of some comforting carbs after a night of partying, and seeking a calmer environment to enjoy them in. Archive was just the ticket. A friendly man, who I can only assume is the owner/manager, greeted us at the door and immediately accommodated our group in their quaint indoor seating area - no wait on a Wednesday night. Shortly after squeezing us in, they expanded our table to more comfortably seat us and never once rushed us out or gave us any side-eye when we settled in for 2+ hours to chat and catch up. \n\nTheir house pizzas listed on the menu will give your decision making skills a run for their money since they all sound so enticing. Truffle mushrooms? Yes, please. My girl Trish threw some roasted onions on hers like a boss, I suggest doing that. I settled on the house pepperoni, which I only had the self control to stop eating after I looked down at only two slices left (all else eaten by moi.) Que embarrassing. \n\nThe cider they serve on tap out of Portland is really great, the cheese plate was legit and plenty to share among the group. It was served with fig spread, honey, and gluten free crackers for our intolerant friends - something the friendly boss man picked up on without us even asking. \n\nFrom now on, Archive will be on my list of musts when visiting the Bay Area.", "author": "Gloria C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "My favorite's the Hearst pizza: mushrooms, goat cheese, truffle oil, bacon... yum! Service is friendly and efficient. Lucas is great, too. \n\nSometimes the balance of ingredients is inconsistent (I think the pourer must have fallen out of the truffle oil one time, because it was so rich and oily I couldn't eat it), but usually it's awesome. Sized to split with a lunch date-- add a salad if you're hungry or need more variety/texture in your meal, but I usually don't need it. \n\nArchive is new enough that you can still find a table without waiting more than 5-10 mins (or no wait, if you arrive just before the lunch rush at noon), but parties larger than two may have to wait longer for one of the larger tables. \n\nOverall, solid food and service without an over-complicated menu. I'm lucky and cursed this place is so close to my office!\n\nUPDATE: having been back several times since I wrote this review (by myself and with a lunch date), I'd (regretfully) steer clear of pizza IF you are in a time-sensitive situation. Twice in the last month it took about 40 minutes from ordering to reaching the table, leaving not much time to eat and enjoy before your next meeting. But the salads and sandwiches are solid alternatives, so at least there's that. \n\nMy guess is a lot if people are ordering them now so the queue for limited oven space is longer than it used to be. On a relaxing lunch where you have time to linger, not a big deal. But when you only have an hour, it can be stressful to watch the clock and worry if you'll get back on time.", "author": "Krista L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-25", "description": "4 stars for the food (I have previously had lunch here).  -3 stars for the rude hostess I just spoke to (6/25/15, 3:45 pm PDT).  I called to make a reservation at the recommendation of other Yelpers.  I assumed the Yelp information re. no reservations was incorrect (hard to believe, but inaccurate info does show up, from time to time).\n\nFYI, Yelpers - they do not take reservations.  Repeat - they DO NOT TAKE RESERVATIONS.\n\nMe (innocently): \"Oh, really?\"\n... pause ...\nShe (annoyed): \"No.\"\n... silence ...\nMe (feeling dumb): \"Oh, ok.\"\n... click ...\n\nThe end.", "author": "Mari I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "I came in with a group of 7 for a power lunch. We came in at about 1pm and were able to be seated quickly. Since we were all there to chat, bond, hang out, we decided to get multiple things to share.\n\nPizzas:\nAll of the pizzas had a good sauce/topping ratio, crispy crust, and really some unique flavors.\n\nMushroom & Bacon - with a little bit of truffle oil, this might of been my favorite.\n\nPepperoni - I usually don't do pepperoni, but this one was good. Nothing really spectacular about it, but it was good.\n\nVeggie Pizza - had some arugula (I think?) not my favorite.\n\nFour Cheese - blend of local cheeses, not sure exactly what, but there was goat cheese in there. Really liked this one. Really liked the fact that my coworker didn't like goat cheese since that meant I was able to get some extra slices.\n\nWe also shared some sandwiches: A chicken sandwich and a BBQ sandwich. Both were really good!\n\n\nThe decor of the place is best described as upscale Southern. They serve cocktails in mason jars, exposed brick walls, wooden tables, a couple of TVs, all the seats are metal and exposed light bulbs without covers. \n\nGreat spot to come with a group, grab some drinks and grab some bites. Didn't have any cocktails, but a co-worker did and said it was delicious. I could easily see this place packed during happy hour.", "author": "Blue A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "Top! Amazing vibe and great service. Really good cocktails and music in the background is right!", "author": "Rabea A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "Really really impressed with the staff and the service at Archive.\nCame in during lunch without calling ahead with a party of 9. They were able to seat us quickly (and we were't too cramped either - the place is pretty small!). \n\nWe ordered the Hearst pizza to start off with (goat cheese, garlic, etc) and it was absolutely delicious.\n\nFor my dish I split the baby kale salad and drake pizza with a friend. The salad was super tangy and fresh - those peaches were insanely delicious. The drake had a really nice slightly spicy flavor from the pepper flakes. \n\nOverall it was a great experience - the manager even came to talk with us and gave us the recipe to the pizza crust (someone in our party wanted to know!).\n\nSuper friendly, great atmosphere, great food - would definitely go back!", "author": "Suzannah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-20", "description": "One of my new favorite lunch spots in the neighborhood and I'm looking forward to going to trying their happy hour. \n\nPros:\n- I went on a Monday; not sure if it's always like this but it wasn't very crowded so it was easy to get a table. Even at 12:30, there were a number of open seats.\n- Great pizzas. We shared the pepperoni and the mushroom / truffle oil ones - both were delicious. The right order is probably one pizza and one salad but my lunch partner wasn't feeling salad that day. Pizzas are a good size. \n- Service was fast. We were in and out in about 45 minutes (and that included trying to flag someone down for the check for a little bit).\n\nCons:\n- On the pricier side for lunch (~$15 per person)", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-19", "description": "Flash fried piquillo peppers with an aioli dipping sauce - The peppers were a little smaller than I expected and were rather limp versus crispy. Either way, the peppers were delicious with some being extremely spicy to others that were very mild.\n\nThe pizza was a decent size to share among two people. The crust was absolutely delectable - nicely crisp yet still retained a good chew. The menu is rather limited a few apps, salads, and pizza options with a decent cocktail menu.", "author": "Julia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "Came here at 7 on a weeknight (note: closed on weekends!) and was able to find a seat immediately. The waitress and server were very friendly and attentive. We ordered the sangria, bruschetta, and margarita pizza. The sangria was decorated cutely (wish I took a picture) but tasted a little too much like watered down juice. I couldn't really taste the alcohol. The other cocktails on the menu sound very good so I'd definitely come back to try those. The bruschetta and pizza were very good. The bruschetta was crispy and had the right amount of tomatoes. The margarita pizza was comparable to other good pizza places. Personally, I wish the dough was a bit crispier but that's just me. Overall, I really liked this place and would come back again for happy hour.", "author": "Krishna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "I came here for lunch recently and the meal was excellent.  Working downtown in the financial district I found the food, atmosphere and overall service great.  I would recommend the pizza 'Classico' or the chicken salad.  The portions are generous and I believe my associate and I were in and back at work with-in the hour.\nPrice wise I would say the dishes range between $8-$15 dollars.  With the pizza and chicken salad I was out the door around $25 dollars with tip.  Great Place!", "author": "Chris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "A group of co-workers and I came here for drinks and dinner.  Everyone loved how close it was to bart (1 block away) and extremely easy to find.  We were blown away by the ambiance, service, drinks, and food.  The restaurant was full but not overcrowded that we couldn't get a table.  We loved the exposed brick wall, comfortable tables, and clean restroom.  \nOnce seated we decided to order the social board to start, which was plenty to serve our 8 person group.  The array of cheese, meats, olives, pickles, nuts and bread selections were a very nice way to start the evening.  They even make their own pickles in house!  So tasty and amazing.  We then tried a few salads which we shared family style.  They were all extremely fresh and full of flavor.  We then moved on to the pizzas; Hearst and Garcia.  Both pizzas were unique and dynamic in their own ways.  You can truly tell each dish is well thought out and that they utilize fresh ingredients.  \nThroughout the whole meal we had a great time trying the creative house cocktails.  I think the groups favorite was the Watermelon Fog!  \nI will definitely be back with family and friends and will hopefully utilize their happy hour!", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-02", "description": "So wish I had a pair of noise-canceling headphones with me when I dined here.\n\nI shouldn't be surprised. 8pm, Friday night, FiDi / Soma - San Franciscans are ready to let loose for the weekend. So I get it, the noise level was just unbearable though. Forget having a conversation. The two-top tables are smooshed so close together, it was nearly impossible to get out from the table and avoid spilling your neighbor's water glass.\n\nOn to the food. We had the meatballs and Hearst pizza. Meatballs were so-so, I thought they had a funny taste to them and were pretty dry. The pizza was tasty, but pancetta tends to make things better. Service was subpar. They were busy, yes, but it took far longer than it should have to get water, the check, etc. \n\nThis was a miss for me...I'd give it another try, but probably not for dinner. The crowd / noise combo were too much.", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-23", "description": "Nice spot for happy hour.  Two dollars off the tap, which means four bucks for a beer.  When I went there, they had a limited selection, but it was good stuff like Lagunitas and Dechutes among others.\n\nThere's also a great pizza deal during HH.  It wasn't too crowded, which is a good thing as I hate fighting for the bartender's attention up in the front.  There's also a wait staff and they're very nice.\n\nThe inside is dim, but it had a nice divy feel without looking too rundown.  I'll be here again for HH", "author": "Andy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-19", "description": "I walk by this place every single day and I just had to stop in. I loved the ambiance, though it does get a little noisy because of the music. Still..was super cute and fun. They had a good selection of wine and beer..and mostly pizza on the menu.\n\nThe bartender, Kevin, he was an extremely nice man. Very friendly and provided great service. He also seemed to be able to read my mind when I saw a pizza float on by.. hehehe..or maybe my face is just that animated.\n\nIt isn't super large, but I could definitely see it being a nice place to stop in for a quick bite with friends or just a place to meet up and grab a few drinks.\n\nSuper convenient location and will have to drag all my coworkers out here at some point in the near future! :)", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "This is my favorite pizza spot in the city.\n\nNot only are the pizzas tasty (the Hearst is super yummy!) but the cocktails are EXCELLENT. The Imperial Orange, the Archive Buck, and the alcoholic root beer float (I KNOW DREAM COME TRUE) are some favorites.\n\nWaitstaff is super professional and friendly, they seem like a big family. And the twine-wrapped napkins are a nice touch!", "author": "Linda W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "Solid lunch spot - Salad, pizza and sandwiches - if you're in the area.\n\nHappY Dining....", "author": "Nader A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "Great place for happy hour after work! I've been several times and the manager always makes you feel welcome right away. I've never had to wait for a table longer than 8-10 minutes. Sitting outside on a nice day is always refreshing if you've been sitting inside all day at work. And sitting inside is cozy and warm if it's a chilly day. Great atmosphere overall. I recommend getting the Hearst pizza and wine! :) YUM!", "author": "McKenzie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "The food was good, not great, but good.  I loved this place mostly due to its laid-back vibe and motown music.   I would definitely go back.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-27", "description": "First time here I came with my friend after work. It was busy when we got there( always a good sign) but we didn't have to wait long to get a seat. We had the kale salad and the mushroom truffle pizza, both equally delicious. I'm a big fan of kale salads and this one definitely brought pleasure to my tastebuds. Fresh nectarines, amazing cheese, it was an all around win. The pizza was awesome; great crust, and it was just the right size for sharing. Just about all the drinks looked like they would be tasty. Of the 3 I had last night, I truly loved the watermelon fog and the one with fresh cucumber juice( sorry forgot the name). Both drinks were super refreshing and yummy! \n\nLoved the small intimate environment and the service was great. A part of me wishes I worked on SF and could go more often.", "author": "Elizabeth P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-19", "description": "Honestly, the food is good but not something special. The portions are dissent but again not the American standards. The service was very unprofessional though. We were continuously asked if we want to pay the bill. We also requested some tab water twice which never arrived.", "author": "Anastasis A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "What a great little find! We went for happy hour and enjoyed a delicious piping hot pizza and wine. This cozy little place was packed with locals getting off work. We were greeted warmly and while the place is small it was charming and filled up rapidly. The food was fresh, savory, and the service good. We will be back!", "author": "Louise Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "A little more on the expensive side but the food is worth it! Highly recommend one of the pizzas. Drinks are fairly good as well but may not be worth the price.\n\nGreat ambience and the waiters are super friendly, they would check in several times during the course of the meal.", "author": "Ashwin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "Really enjoyed happy hour at Archive! We waited next door at Atlas for a table and when the table was ready the owner came and found us inside Atlas and told us our table was ready (later we found out hes the owner of both restaurants).  We really appreciated him going out of his way to get us our table! \n\nI forget our waiters name but I believe it was Esteban.  He was amazing! Cracking jokes, talking with us, it really made for a fun happy hour.  \n\nThe food was great. We got two pizzas the DiMaggio which was really yummy and the Hearst.  I am not a fan of truffle oil but it was still pretty tasty! The beers were great and had such a great variety of craft beers!\n\nI appreciated the great service from our waiter! I will be back for another happy hour!\n\nPS. Ask to try the hot sauces - Mango Tango is BOMB!", "author": "Brittany N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "Place has great food, servers and bartenders are really good. Great beers as well. Awesome place to go for lunch, only issue is that it is small and could get crowded/packed. A little expensive but where in SF isn't?! Check this place out!", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "Great little gem on the SOMA side of the financial district. I love coming here for lunch with coworkers to get sandwiches, pizza, salads, and of course, wine. The bartenders/servers are all wonderful and make sure you're taken care of. The food is good and generally comes out pretty quickly. It's definitely on the pricer side but so is everything in San Francisco.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-10", "description": "Excellent appetizers. I also suggest the \"Local\" tap ale.", "author": "Doug S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "Came for a birthday lunch with my work team around 11am - wasn't crowded and we were pleased!\n\nPluses - delicious pizza, salads are fresh as well, huge variety of drinks, great service, good price point, good size portions\n\nMinuses - can't think of any?", "author": "Grace Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-19", "description": "Was expecting much much better.  Arrived at 11AM, not a soul in the place, but they still tried to stick us at the smallest possible table.  The service was unremarkable, flat and downright rude.  While the decor was fine, they are trying way to hard to be hipster cool.  Not cool.\n\nWhile the pizza was good, the menu was limited.  Highlight was the Caesar salad.\n\nDefinitely not worth the price.", "author": "Marc R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-03", "description": "#SocietyMomsFavorite * a restaurant frequented by Darling Bonnie's Mom + Fairy God Mother * Go on a weekday during lunch x sit at the bar x order rosé + the shrimp salad sandwich w/ a side of mixed greens x ask for Matthew, he's the cute guy behind the bar w/ the handle bar mustache * if he isn't there.... Leave. Haha just kidding !", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "There's a slightly buttoned-up vibe at Archive but that shouldn't come as any surprise due to the location. If I were a banker/lawyer type looking for a local spot for a good lunch/late day drink.* Since I have left those suits to hang in my guest bedroom closet, I'll just plan on coming here for a good lunch/midday drink.**\n\nSince you're, likely, here with a group o' folks, go for the pizza. The pizza here's really good, easily shared and comes with an interesting variety of toppings. Whilst gorging, I sampled the Hearst (truffle oil, goat cheese, mushrooms, & bacon: delicious; I'd order again), Moscone (sausage, pepperoni and black olives: tasty but nothing too out of the ordinary), Garcia (speck, asparagus, arugula, garlic oil &, an egg: egg on pizza = always good), and the Drake (kale, cherry tomatoes, sauteed onions, Calabrian chili, goat cheese, & cheese cream sauce: fantastic, fancy and delicious). Because I'm a fatty and was eating with other fatties, I also sampled the pulled pork sandwich (bbq sauce and jalapeno-cilantro slaw: a mighty tasty sandwich). To cut all the fatty food, I enjoyed a refreshing hibiscus/hum beverage. Four years after first having hum, I still have zero idea what the h it is -- other than refreshing & sweet... plus, it's made from hibiscus so that means it's totally healthy and will add another 80 years to my life. That's how it works.\n\n*I would say 'after work' but we both know you're not getting out of the office any time before 7/8 if you're big firm'ing it these days.\n**Much better.", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "Seriously the absolute best place around! I highly recommend their cheese board with some red wine. Gluten free friendly too!", "author": "Meghan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "Pork belly slider. So delicious. $4 during HH. Melted soft porky fat vs. crisp apple and sweet jam with parsley are to die for. Almost as good as Ferry Building Farmers Market Roli Roti porchetta sandwich. Evokes similar tastes and sense of indulgence.", "author": "Alias A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-05", "description": "A solid 3.5 stars.  It's good, not amazing.\n\nOur server was really friendly, which almost made me boost this review up to 4 stars, but the more I thought about it, the food was just not THAT good. \n\nWe tried the Baby Kale Salad and the Moscone Pizza (Sausage, Pepperoni, Black Olives, Mozzarella and Tomato Sauce).  I guess I am spoiled by the pizza at Pizzeria Delfina, so my standards are a little high, but the pizza at Archive did not blow me away.  Don't get me wrong, it was definitely good, but it's pretty hard for pizza to be bad.  Even when pizza is bad, it's good (i.e. Round Table).\n\nAll in all, I will definitely give this place another try or two, maybe for their sandwiches, but I'm in no hurry.", "author": "Juliana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "The wine list wasn't great but I found an ok white. I did however notice that the beer options were pretty good and the pizza looked tempting (they have a gf option!). The setting was also decidedly low key for a spot in downtown SF, allowing a friend and I the opportunity to catch up without having to yell over tons of noise at each other.", "author": "Erin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Pizza was very good. Space was cramped. Since they don't take reservations, it's a crapshoot for where you'll be sitting. We ended up at the bar without having to wait too long even though the place was very busy and it was raining.. The space/atmosphere is nice. It's themed well.\n\nThe food was good.", "author": "Courtney W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "The pizza and salad combo we ordered here was really great, so great that I have a feeling no matter what else you order on the menu--it's going to be good! Throughout the night I was seeing apps float by that looked really really good. I also like that this place has outdoor and indoor seating.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-06", "description": "Good pizza, but not great.", "author": "Ada C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "really really good. Went here with my mom last night for happy hour and I was really impressed!\n\nHappy hour (i think) is $3 off draft beers, $5 hour wine, and $2 off pizzas. They also had a rose sangria for happy hour last night that was delicious-- not too sweet. We ordered a delicious pizza with kale, cherry tomatoes, chili flakes, and goat cheese (my fave)-- it was amazing!! The service was great too, not overbearing, not ignoring us-- despite the big crowd for happy hour. I just wish this place was closer to my house or my office-- I would definitely be a regular!\n\nI will definitely be back!", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "I will never think of pizza the same way again. \n\nWent with the Hearst, it was phenomenal. Truffle oil, feta cheese, bacon (not the crappy kind u get at the grocery store, this was like butcher's cut bacon), mushrooms, whole roasted garlic cloves (if you've never had a roasted clove of garlic, you don't know what you're missing). one pizza was enough to get 2 of us full.\n\nalso ordered a drink - \"Bay Lights,\" which was just as amazing. To be honest, it was like an upgraded mojito- but i loveee mojitos. \n\nyou can also ask to upgrade the crust to gluten-free, which we did, and it was still really good.", "author": "Alana V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "I came on a weekday right at noon and sat at the bar. The bartender immediately waited on me. I ordered a Crispin cider and the Archive Club sandwich. The sandwich was great with fresh ingredients. Service is the highlight of this place and I was able to get in and out quickly during the lunch rush.", "author": "Katherine F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Really like this place. Cute / hip vibe, really nice pizza and cocktails. Service was great, even during a busy happy hour. \n\nOnly thing that could be improved is some work on sound proofing / acoustics. Can be reaaaally loud (hard to hear the people next to you) in such a tight space when full.", "author": "A H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "Legit, I eat here about once a week. My co-workers and I walk in and sit down, even at lunch time. The service is fantastic, the place is clean and the decor is cool and comforting. I'm going to wrap this up by saying, The Hearst...Visit and figure it out.", "author": "P F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "My favorite thin crust pizza place to date! I'm not too big of a fan of thin crust but this place has made me second guess that.\n\nI came here with a few coworkers during lunch and were seated immediately. We ordered two pizzas and a salad:\n\nGarcia Pizza ($16) - Arugula, parmesean and mozzarella cheese, garlic oil, asparagus, and FRESH FARM EGG. Can't hate an egg on a pizza. The egg was cooked to perfect medium so it wasn't oozey and gushy all over the pizza that would've made it messy to eat. And I hate arugula but I could barely notice it.\n\nHearst Pizza ($15) - MY FAVE. White truffle oil, mushrooms, bacon, goat and mozzarella cheese. I went crazy over this pizza and it was all I really ate. I love truffle oil because it gives an extra distinguishable flavor to every dish. Did I also mention that I love mushrooms? And who hates bacon? There was a lot of delectable flavors going on in this pizza.\n\nChicories ($11) - Choices, Gorgonzola, apples, toasted almonds with a honey-lemon vinaigrette. I don't eat salad nor do I like it but if I must eat then I will choose the salad that has the most sweets and a vinaigrette dressing to mask the taste of the leaves and this salad did just that. Good but nothing special or out of the ordinary. You can add chicken for $3 extra if you like.\n\nThe pizzas are a bit on the smaller size but when it tastes this good I don't feel like I'm getting jipped. The crust was soft yet crunchy at the same time and that's hard to do. Our server was attentive and was always there to refill our waters without asking and came to check up on us often. This place DEFINITELY beats Zero Zero and I will certainly be back.", "author": "Kristina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-03", "description": "Stumbled upon this place via yelp, kind of new to the area. We arrived in time for HH and ordered a few glasses of wine and the Hearst pizza. The house cab was prettty good and oh my the pizza was yummy. Kind of ruin my diet, but darn well worth it!!! The feta cheese really tied in the flavor well and the size was good enough for 2-3 people. I believe all pizza were $2 off and wine was like $5 or $6 for HH.\n\nMatt was an awesome bartender!", "author": "Nhung T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-21", "description": "Went here for dinner based on yelp reviews. The pizza was okay a little to much garlic also got the spinach and artichoke dip it can with 5 tiny slices of bread we had half the dip left and nothing to dip it in. It was super tasty but there wasn't enough bread! My rating is based on taste so if you are a couple looking for a tiny pizza and some appetizers for 50 bucks or less then this is the place", "author": "Jamie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "Food, drinks, service.. AWESOME! But damn, I can't hear in here!! LOL Pizza's we had, was really good. We had different kinds, I can't really remember, but I can't think of one that I didn't like.  Also their Sliders, was heaven in my mouth. SERIOUSLY!! I love me some pork belly. LOL Heart attack/ Gout city, but worth it! \n\nThe only drink I had all night was the Archive Cocktail, which was the best. I think I got the name wrong, but it was delish, to where I didn't care for the other drinks. Definitely coming back here again and taking other friends for drinks here.", "author": "Joanne D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "Came here for lunch and ordered a small salad.  It was pretty big for a small salad and tasty.  My gf ordered a gluten free pizza, which looked delicious.  The space is clean and the staff is very friendly and check in often.  I'll definitely be back.", "author": "Negar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-17", "description": "This was hands-down one of the best dining experiences I've had in a long time--especially since going wheat-free.\n\nFive of us friends were in town for a big conference, and we desperately needed a low-key evening away where we could catch up and eat our hearts out. Thank Gaga for Archive...\n\nWhen we walked up, the nicest guy was at the door to greet us (I'm pretty sure he was either the owner or the manager). They quickly seated us and sent over a super-friendly server who could not have been lovelier. I explained this wheat-free nonsense to her, and she didn't bat an eyelash. She told me they had wheat-free pizzas! Yippee!\n\nBefore our pizzas came out, we got a cheese board that was filled with some tasty treats--no blue cheese (hooray!) and wheat-free crackers! Oh, it's always the little things. And then our pizzas came out... delicious! I couldn't have been happier with my 5-cheese pizza. For a little while, I completely forgot that I couldn't eat like I used to. \n\nDuring our amazing dinner, we stayed and laughed and gabbed for over two hours, and not once did the staff make us feel rushed. In fact, they pushed another table over so that we'd have more room to spread out! The guy from earlier also came out to let us try a gluten-free beer he was considering for the menu. Talk about hospitality...\n\nI wish we had a place like this back home in Columbus, but I'll just anxiously await my next trip to SF so I can head back over to Archive.", "author": "Bryant M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-13", "description": "Really fun and great location! But left deaf. It was so so loud hence 3 stars vs 5.\n\nWe ordered the burrata, honey, apple, proscuitto appetizer which was really good, champagne, beer, sangria during the happy hour. Menu seemed excellent. I'd go back but sit outside.", "author": "Karen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-13", "description": "The pickles were surprisingly good.  Pizza was okay.  Flavorful toppings, sauce and bread, but the middle of the pizza was a tad soggy.\n\n$5 Happy hour wine and $2 off Pizza before 6pm.  \n\nCan't wait til they expand.", "author": "Mihae T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "Finally got around to trying this place out after walking past it after work for 3 months. The inside is decorated very nicely. Hip and modern, but still comfortable and welcoming. The staff are very friendly and accommodating with my requests (no cheeses except mozzarella please). \n\nThere are only about 10 tables (outside included) plus the bar area so it gets PACKED at lunch. Come before 11:45pm to guarantee a table. \n\nI highly recommend the Fall Harvest pizza (butternut squash, piquillo peppers, pumpkin seeds, arugula, goat cheese, mozzarella, tomato sauce). The combination is perfect with a few shakes of pepper flakes (beware- super spicy!). \n\nIt seems to be crackin' during happy hour too so I'm definitely coming back some time to try their drinks out.", "author": "Sophia V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-09", "description": "Came here around 5pm for Happy Hour.  My friend and I sat at the bar.  The decor was pretty cool and hip.  We ordered two drinks and a pizza to share.  Unfortunately the bartender spilled the whole drink over on me.  My dress, my boots, and bag were all wet...........unbelievable.....\n\nWe supposed to order a veggie pizza but the bartender gave us a pepperroni pizza.  He said the pizza was from the house because of the apology.  Seriously I would rather to have two free drinks better than an extra pizza, because how could two people finish two pizzas?  \n\nAbout 15 minutes later, we saw our veggie pizza at the next table.  The man told the waiter that was not the pizza they ordered......and he gave the pizza back to us.  Now I don't really know the free pizza was just from the house or they just messed up the order.  It seemed like they were not organized back in the kitchen.\n\nWhen we looked at the bill, they forgot to take out $2.00 from the pizza because all pizzas were half off during HH.....\n\nOverall, the pizza was good.  The ingredient was fresh and tasty but the service was not that good.", "author": "Liza T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "So perfect for a quick drink after work in the FiDi or a quiet date night. Super casual, great beer choices and PIZZA! \n\nThe service was also really great and the bartender was really friendly. It got more crowded towards 630/7pm, but a happy medjum (which is hard to find).\n\nWill be back again soon!", "author": "Amanda U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "Archive is a dimly-lit, trendy restaurant-bar hybrid, tucked away right next to downtown SF. I did not expect much going because of the low number of reviews, but I was very impressed. I came on a Friday night with a friend and there were spots open at the bar.\n\n- Prosciutto/Burrata Plate (~$13): I'm not sure what this was called or what the price was, but it was in the appetizer section. It comes on a wooden slab, with freshly cut prosciutto (you can see the prosciutto rolls in the back near the restrooms), burrata, cornichons, toasted almonds, and 4 pieces of toast. The quality of ingredients and flavor combination is on-point.\n\n- Hearst Pizza ($15): The Hearst comes with truffle oil, goat cheese, fresh mozzarella, wild mushrooms, and pancetta. The pizza was a bit smaller than I envisioned, but they load it with toppings and the dough is the perfect fluffiness. The mushrooms, in particular, were very flavorful.\n\n- Spring Sangria ($8/glass): This is a pretty small glass with a lot of ice, but the wine is pretty high quality. The strawberry-passion fruit puree did not overpower the natural flavor of the wine.\n\nIf you're looking for a casual dinner with good drinks, Archive is a good choice!", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "Archive is a great spot close to work. It may seem small and unassuming from the outside when passing by, but they serve some awesome food!\n\nMost recently, I ordered the Hearst pizza which consists of white truffle oil, goat cheese, fresh mozzarella, mushrooms, bacon, and tons of roasted garlic!!! It's definitely a pizza that's all about that umami goodness. Together, all those ingredients taste delicious. Definitely a fan of the conservative use of the white truffle oil. There are way too many places that are too heavy-handed with it and just ruin their dishes.\n\nPreviously, they had a pizza with bacon, radicchio, and figs. Also delicious. You really can't go wrong with any the pizzas. The pizzas are probably a bit larger than individual-sized, but it's not quite enough food for 2 people.\n\nP.S. They also have ginger beer!", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "My boyfriend and I are visiting from out of town and our hotel was close by so we figured why not. We ordered the DiMaggio pizza and the meatball sandwich. The pizza was beyond delicious! The flavors were amazing. The meatball sandwich, although it doesn't look like much, the flavors were also very good. I'm only giving it 4 stars because we went at 2:00pm when we were the only people there, so the service was great. Definitely going back before we head home.", "author": "Erica C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-23", "description": "Today I was calling 3 times and 3 times I was speaking with guy name kiven . He was very rude. I wont  to order pizza with olive. He said that they don't have and hang the phone on my face. \nI am very week ordering the same thing .(  Playing little head .)", "author": "Tuli B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "I'm pretty happy about Archive Bar. My wife and I wandered in here on a busy Friday evening and were shown right to a table; no fuss, no wait. The staff was friendly, the beer selection was good (though a bit limited), and they have an interesting cocktails list.\n\nThe Chicken Alfredo pizza was very tasty, not overly cheesy or dry (the way that sort of topping-heavy pizza sometimes gets). And the jar of proper dill pickles for a side was delicious.\n\nAmbience was fun and lively, happy hour was a good deal, and the decor was pretty interesting. We'll definitely be back.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-23", "description": "There aren't many bar/restaurant that are open for lunch in SOMA. I'm really happy that this cool restaurant is so close to home!\n\nCame here for lunch with a friend and my husband on a week day. It was packed but we got seats at the bar. The menu is pretty simple comprised of pizza or sandwiches. I had to try their pizza and both my husband + friend went for the pulled pork sandwich with cocktails.\n\nThe pizza took a bit longer as they had to make it with each order but it was really good! I couldn't finish it alone because it was quite big. The crust was thin and toppings were flavorful just the way I like it! I didn't try the pulled pork sandwich but it looked good and came with side of potato chips. The prices were not too high (surprisingly for SOMA and so close to FiDi). \n\nCool place for lunch or if you want to have a cocktail in the middle of the day!", "author": "Vickie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "The best Manhattan in the Bay Area, it's called Tone Bennett Manhattan, made by Cameron the bartender.", "author": "Antonio V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-07", "description": "Not a bad place for hh and dinner with the girls before I leave the city. The slider was tasty and i liked the hearst pizza.", "author": "Annie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-18", "description": "I think it's safe to say archive bar is officially in the archives.... Wow... I had such high expectations for this place, now I must find another bar to go to. I'm usually light weight when it comes to my drinks and... Guess what?! The drinks we had today was way watered down... Paying $8 & tips for watered down drinks? No thank you.. I can get that for $5 elsewhere.. However, service was acceptable... But the drinks seriously?!! They tasted like nonalcoholic drinks..", "author": "Ann L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-15", "description": "First time I've eaten here, it was busy so the service was a tad slow but the mixed green salad I had with chicken was pretty amazing. All the flavors together just worked.", "author": "Shelley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-02", "description": "Archive is a great addition to SoMa. They did a fantastic job with the decor. Absolutely love the exposed brick wall and old file cabinets. Went here for beers and a bite after work. It was perfect. Not too loud but not to quiet either. Beers on tap are good. We had a pizza. We tried the truffle one which didn't say on the menu that it had garlic. In my opinion it was too much whole garlic. It overwhelmed the rest of the ingredients. My friend on the other hand was eating my garlic cloves out of my hand. I'll definitely be back here to try another pizza and enjoy the ambiance.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "After an amazing session at Soul Cycle, I met up with a friend to undo all of our hard work. We stumbled upon Archive as we were headed elsewhere and were drawn in by the smell of the pizzas! We had a delicious drink called a Watermelon Fog with Agave Wine, Fresh Watermelon Juice, Fino Sherry & Sea Salt-Lime Air. That's right, sea salt lime air. There was a big pile of flavored foam on top. It was so much fun. We shared a Hearst pizza with goat cheese and truffle oil and an appetizer of brussel sprouts. So delicious!", "author": "Kari G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "We were lucky enough to find a spot at the bar, thanks to the amazing staff. The mac&cheese was fabulous, as was the wine selection. As a plus, the SF chase scene from Bullitt was playing on the TV. Great atmosphere. Awesome staff. :) Thanks for having us!", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-17", "description": "I can't say it was bad but it wasn't anything special. Pizzas were tasty if not a little over priced. The apps were good - liked the beet salad and the orzo mac and cheese was yummy but also over priced ($9 I think).  Service was marginal, walked in at 9pm (1 hour before closing) and kind of got the feeling they were not keen to serve us but we were a group of 6 so I don't know why they'd be like that. There were only seats at the bar left because they had taken up two tables with some napkins and utensils they were rolling together - I thought it was surprising that they didn't offer us the tables so eventually I just got up the courage to ask since it seemed ridiculous that they'd take over tables that could be seating people. \n\nThe drinks were pretty good - I will say that the bar tender seemed pretty skilled. Overall Archive was just OK.", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "A friend and I decided to visit Archive after having a drink at Novela. \n\nThe place was pretty full with almost every patron enjoying the pizza. We found some space at the end of the bar and received attention immediately. The server handed us menus and was right on point to come back and take our drink and food orders.\n\nWe both had a glass of wine - quite generously poured into a stemless glass. For food, we shared the Prosciutto & Burrata appetizer and Moscone pizza. \n\nThe prosciutto was carved right off a leg that sat on their counter - awesome! The burrata was just creamy enough. These items were served alongside 4 small pieces of toasted bread, gherkins, apple slices and rosemary salted almonds - yum.\n\nThe Moscone was great - the crust was delicious and did not suffer from the burnt bottom some pizzas do from a dirty oven. The toppings were aplenty and delicious. \n\nI would absolutely return, just bummed it's a unisex restroom. Practice your squats, ladies!", "author": "Kimmie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "Me and my wife, trying to recover from the jetlag from our flight in from miami needed an early dinner. Close to our hotel we found, thanks to yelp, this great little place. I would not recommend it for large groups due to the size of the establishment, but we sat at the bar and had a great time. Besides for the bartenders tacky looking shirt ( it was like bright neon blue), we had a great time. Happy hour was nice 5$ house wine, drink and beer from 4 to 8$ and the best little pork belly sliders i have ever had for 4$ each. We also split a great pizza that had (like all pies) a 2$ special before 6pm. (Came out to 11$)\nAtmosphere 4/5\nFood 4/5\nPrice 4/5\nGive it a try", "author": "Philippe P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "I walked by Archive at noon on a Tuesday and it was packed, so I figured they must be doing something right! I walked inside and I was immediately greeted by Jessica. I sat at one of the barstools along the front window and I enjoyed watching people walk by outside. The atmosphere was lively and the decor was  warm with exposed brick and wood tabletops. Jessica was my server and I ordered the Mission Chicken Sandwich with a mixed green salad and a glass of Syrah. The restaurant was busy, but my wine was served promptly and my  food was delivered within 10 minutes. Jessica checked back with me right away to make sure everything was okay. The food was fresh and delicious! The sandwich was huge and I especially liked the chipotle aioli and the side of spicy pickles. The staff was friendly and I never felt hurried or neglected. I gladly tipped Jessica more than 20% because she deserved it.", "author": "Dan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "Great spot for happy hour in the financial district. Loved the sangria and even tho the beer selection is quiet small, they have some great beers on tap also.\n\nWe had two pizzas and I do love the creativity and the flavors. The combination of ingredients is great, however, I didn't like the crust, that was disappointed but loved the different ingredients combinations.\n\nLoved the service! Bartenders and servers were súper. Definitely a great place to meet people. While there,  my friend and I got approached various times by super friendly and fun guests.", "author": "Elizabeth D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "Love, love, love this place!!!  Super cool innovative wine based cocktails that baffle even a seasoned bartender.\nI had the chicken salad-lots of textures, fresh and huge for the $-these guys nailed it!", "author": "Michelle J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "Pretty good place for Happy Hour! Delicious pizzas and wines at reasonable prices. The place is small so can get cramped quickly..the server are all super nice.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "The pulled pork Sammy is heaven on a plate! Spent 4 hours sitting at a table outside on a lovely summer Friday.  We had 3 servers during our time there and they were all so attentive and kind.  The pizzas are perfect to split with a group. Their stemware collection is exceptional. . . We wish we could have taken them home with us! Guess this means we have to come back for more drinks! They even offered water for my dog to make sure he was hydrated. We'll be back fo sho! :)\n\nPS the spicy pickles are to die fo!!!!", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-30", "description": "Come here quite often after work for HH.\n\nJust some dam good pizza.\n\nAlso the charcuterie platter is pretty legit, go for the big one if you have enough people.\n\nThe drink prices are too bad either, par for the neighborhood.\n\nThey have a big screen TV up above the bar.\n\n(they had these meat cones when the first opened, but they don't currently have them.... i hope they come back)", "author": "Steven F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-22", "description": "Archive Shmarchive. What crappy pizza.  The crust is really crisp but too light and tasteless.  Very close to how microwave pizzas taste.  Not very happy with it and since I'm not drinking their selection of non alcoholic drinks is pretty abysmal.  The vibe is cool but they need a new chef.", "author": "Mitch A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "I liked this spot. Pizzas were pretty good, and they had a decent selection of booze. Customer service was spot-on; those guys took good care of us.", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "Best mac and cheese I have ever had in my entire life. Amazing cocktails. Super friendly (and attractive) bartender hehe. I usually order the lucas pizza, mac and cheese, Tony Bennett manhattan, and/or the Cabernet - never disappoints.", "author": "Nicole P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "Incredible menu! Simple but delicious. I had the kale salad w/ white nectarines which was so fresh and natural I felt they had a garden out back. My husband had the Caesar salad and he loved it too. Chef Matt and the Owner spent time at our table and let us sample changes they were making on the menu. Good food, good atmosphere, good price! Tops in my book and well worth another visit or two or three...", "author": "Tara G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "Good food.. came in at 2pm .. ate at bar, ordered blt... friendly service, nice atmosphere... would recommend n revisit.", "author": "Vanessa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "Another great find in SFO. Friendly staff. Highly recommend the cast iron shrimp appetizer! Pork sliders were pretty yummy too.", "author": "Lydia T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-21", "description": "Extremely noisy after sundown. Went at 8. People less than a foot from me were screaming into each others ears. And into mine. \n\nWe couldn't take our shake to go at the end of it. :(", "author": "Ryu K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "We live in the area and were looking for a quick bite to eat with our young son.  We weren't sure we could bring him in since it was a bar but I think since they served food we were fine.  Our waitress was super friendly and when we were going to order too much food she told us we should probably scale it back.  We ordered a pizza and salad and both were delicious.  I had a beer and would definitely come back for more drinks (without my son of course).", "author": "Blake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "I like this place a lot! It's a great spot to grab a drink with friends after work. I've been here several times and never been disappointed, and all the times I've been we've been able to find a seat pretty quickly.\n\nMy friends and I definitely enjoyed the selection of drinks, and each time tried something different and new. My favorite thing about this place is the food options. The social board (cheese, meat, crackers, and various nuts/spreads) is fantastic, and they really give you a generous amount. I've found in the past that other places tend to skimp on the cheese and meat, but here, we've always had plenty to go around and we've run out of bread/crackers first. They also have a good variety of cheeses, meats, spreads, nuts, and olives, which I appreciate as well.\n\nWe've tried the pizzas a few times and always enjoyed those as well. They have a good selection of pizzas with interesting and unique combinations of ingredients. In my opinion, this is the perfect place to meet friends for happy hour!", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-28", "description": "Exceptional service but disappointed by the food and drink in comparison with my expectations. Still a solid spot to grab a gourmet pie after work. They close early during the week but I am accustomed to New York hours!", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "Came here to have a little staff meeting with my employees.  The asparagus salad with feta was so delicious! \n\nNot to mention the staff was very on top of things checking on us frequently.\n\nOhhh and the dessert, melted in my mouth!  Thanks Archive, we will be back!", "author": "Christina B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-18", "description": "Came here for HH and boy were we disappointed. The drinks and wine here was all fine, but we also ordered the cheese and charcuterie plates and those were beyond disappointing. These were clearly brought over from safeway - I mean the meat still had the creases from being packed in airtight plastic. The cheese just wasn't good, simple as that. Also doesn't help that our waitress didn't really know which cheese or meat was which and couldn't give us a run down.\n\nI'll probably give this place another shot down the road and try the pizza here, but so far, really not a fan.", "author": "Maria G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "Just had an extremely well crafted Pastrami on Rye for lunch- sans Thousand Island dressing per my request, though they did put another spread that didn't have mayo in it. The pastrami had slightly crunchy borders that added to the entire flavor profile.  I will certainly be back to try some of the other lunch menu items.", "author": "F. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-22", "description": "Awesome place for happy hour! The owner put his heart into this place, including the small details. It's not your typical win bar either. The menu is very approachable and the crowd is fun. It can be loud at times, but it's not overbearing. \n\nOverall, it's a must go for anyone working in SOMA or those looking for a few drinks and snacks with friends.", "author": "Brandon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-03", "description": "We came for a lunch with a group if colleagues. Very nice and welcoming interior , interesting wooden bar and nice service. I was pleased by smiley waitresses. They didn't have a table for us so we ordered to take away.\n\nThat was the problem. I think we overwhelmed them with our offer, but they could have just warned us about the waiting time, which spoiled our overall experience. The sandwiches and salads looked nice. Side salads had a great sauce and an interesting combination of nuts and apples.\n\nMy pizza with mushrooms and white sauce didn't have much goat cheese on it and the crust took about half of the pizza. Tomorrow it will be a different spot!", "author": "Michaela P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "Noisy. Fun. Good California wines by the glass. Waitress was very friendly and took great care of us even on a busy Friday night.", "author": "Nancy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "The wine cocktails are UH-MAZ-ING. Chatted with the guy responsible for crafting them and he is an artisan. Completely worth a trip for just cocktails! \n\nThe space is so great and the service is friendly and very attentive. Nice to get some East Bay vibe in the financial district.\n\nA++, would cocktail again.", "author": "sparkle f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "Fun atmosphere and great staff!! I wish I tried the \"Lucas\"... I sat near the kitchen and I must have seen over a dozen of them ordered! Drinks were great too!! Summer of Love was very refreshing!!", "author": "Serena T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Really good pizza-- had the margherita but would have tried many of their awesome combos. Truffle orzo Mac and cheese was perfect to share with four people. We tried this really smoky drink resembling a campfire mixed with an old fashioned - it was called a Tony Bennett. And the adult root beer was great. Good atmosphere, and the waitstaff are sweet and helpful. We were trying to catch batting practice at a giants game; the food came out fast and everyone was really sensitive to our time needs. Oh and their music selection was awesome!!!! Great classic rock.", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "Went there for the first time Friday night and I had a dream about the pork sliders from this place. Laid back atmosphere. Great place to meet up for a drink and a bite. Shout out to the bartender Cameron, awesome bartender.", "author": "Eve D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-16", "description": "This place is highly over rated. Then again my wife and I are Italian and know food. The pizza was awful. Crust was tasteless and the topping also was tasteless and meek. We also had the Caesar salad and that too was limp and lacked any character. If that wasn't enough the service was slow. You can do much better elsewhere.", "author": "Ralph D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-03", "description": "Great little pizza shop with a reasonable happy hour menu from 3-6PM. Its a very small space, best for casual 1:1s. It gets pretty warm inside so great for a cold day. Servers a friendly and on top of it, my wine glass was never empty. $5 house wines, $1 beers and $2 off cocktails. No Sangria special but that won't keep me from coming back!", "author": "Meredith M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "Came past this gem earlier in the week and was surprised to see something so nice in an area that can appear a bit blah. Decided to try it out for lunch with a coworker today and we were both impressed.\n\nWe each had a pizza, I the truffle and mushroom and she the pepperoni. Both were very good! The sauce on the pepperoni was amazing and the combination of roasted garlic, mushrooms, bacon and truffle on the other were just what I was looking for. The crust was thin and crisp on the edges. Very well cooked - one of the best pizza options in this area.\n\nWe didn't drink, instead opting for the ginger beer and rosemary lemonade. However, they did offer a great selection of wines and the cocktails looked interesting. We decided we would have to make another visit for happy hour ($5 cocktails and $2 off the pizzas)!\n\nOn top of drinks and pizza, they also offer sandwiches and salads - both looked great. Additional, the wait staff were very nice and the atmosphere was really well decorated. It got a little loud when crowded, but no more than you would assume for a space that size.\n\nIf you're in the area, STAY AWAY - I don't want to be greeted by long lines for lunch next time...", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-05", "description": "Drinks and food are good, but the service was horrendous. We brought a group here for a going away party. Strategically planned it in between their lunch and happy hour rush (2-4:30pm). \n\nThe management was rude and glaring at us the whole time. There was nobody else at the restaurant, and he corralled us into a corner because he had to make room for \"regular customers\" - I'm sorry - but WE actually are regular customers who are ordering drinks and food. And there was NOBODY else there. \n\nI asked him if we pretended we didn't know each other if we could all get our own seats rather than people needing to stand around the table. He scoffed at me and continued to force 35 ppl in a space for 20. \n\nAs I'm writing this, the manager just came over to our dwindling group of 10 people to clear off the tables and set them for their evening service. He tried to ask us to move to yet another table that is \"more comfortable.\"  I said that we are quite comfortable and he said, \"No, I'm asking you to move because it'll make it easier to set for the evening service.\"  \n\nI'm not too proud to say that I made a scene - except the only ppl to witness it were my 9 coworkers and the wait staff - because NOBODY else is here!!!!\n\nCurious to see how long this place lasts in downtown as a local hangout.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "This place is amazing. It's like a high classy wine bar in a hole in the wall joint. The place is known for there 5$ happy hour wine specials which are bomb! I used to go here with my co-workers all the time and share fantastic stories about our day. The owner and staff are very friendly and always keep the vibe relaxing and fun. They have one of the best Pizzas I've seen when I'm pairing with it wine. Yea I know wine and pizza don't seem like they could go well but at these place I can proudly say I would recommend this to anyone who is in the area with co-workers, friends, or even families looking for happy hour wine bars.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-02", "description": "Really good gluten free pizza! Gluten free pizza is usually on a spectrum from cardboard to stick of butter and this was a happy medium - crispy, buttery, and really great for gluten free. Was a bit disappointed in their rosemary lemonade, which just tasted like lemonade, but overall was impressed and glad that I went.", "author": "Beth W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-03", "description": "I came here with a group of coworkers wanting to spend some time together outside work. We got here shortly after happy hour started at 3 on Friday because we wanted to beat the after work rush. The place was completely empty but the waitress crowded the 9 of us into a table that seats 6-7, acting annoyed that we showed up at the end of her shift. We ordered some drinks and food and were subjected to some more indifferent if not downright rude service. After an hour, one person in our party left and another person used the empty stool to place their coat. Since we were huddled in a crowded table, there were just not enough hooks underneath. The manager immediately comes over and tells my friend to place his coat on his lap so the stool can be moved back to the bar, where again, no one was seated! We had planned on running up a big tab because the boss was paying but left before any after-work crowds came in, so we can't vouch for how crowded it might get. I don't understand why the management would want to foster such an unwelcoming environment. We were a courteous, professional group of people and were made to feel  like our business was not appreciated there. \n\nOn a side note, the guy busing the table and the waitress who came in toward the end were pleasant but unfortunately the manager and earlier waitress set a bad tone for the establishment.", "author": "Mimi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "Pizza is great! I had the margarita ! The salads are awesome! Cheese board is wonderful and service is great. Happy hour was just very limited choices. Small menu. It can get crowded. Great place for small groups.", "author": "Alison W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-27", "description": "The service was exceptional. A friendly and attentive staff. The food disappointed, though. Over mixed meatballs with no flavor. Flavorless Brussel sprouts with no seasoning. Apparently the best plan is to stick with the pizza.", "author": "Karen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-26", "description": "The Hearst pizza with an egg, the pastrami sandwich, and Italian beef sandwich. Done.", "author": "Vina H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-03", "description": "I wanted to try out Del Popolo, but the wait was too long.  I had walked by this place a number of times and had been curious, so we decided to go there instead.  We ordered the squash pizza and margherita pizza, and a salad (and perhaps another appetizer that I've forgotten).  I think neither of us will be back.  I'm unclear how this place has such high ratings (for the pizza at least).  Neither of the pizzas were particularly good, and the entire meal was pretty forgettable.  Even though it's a pretty casual place, the food ended up being just as expensive as a lot of other places, but not nearly the quality.  It wasn't an awful experience, but I ended up being bummed that I'd come there and slightly guilty for suggesting it to my friend.", "author": "L C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "Nice find! Sat at the bar for lunch and had an amazing lime/mint cocktail (made with wine - no liquor here) and a pizza. Pizza was inventive (speck, asparagus and egg) crust was awesome. Friend had the pastrami; messy but delicious", "author": "Susan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-07", "description": "So incredibly loud inside that I couldn't wait to leave. I recall having a good cheese plate while my eardrums were mutilated. The pizza was so-so.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-08", "description": "Great new find. The sandwiches are truly amazing.  Generous portions, chips and pickles, great salads and creative choice of tap brews.  Tables a bit cozy for private conversations and it gets a little loud during the lunch hour but still highly recommended.", "author": "BigRedsLover H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "This place is incredible. I have been there twice now, and have had a great experience both times. Not only is the food tasty and creative, but the service is above expectation. The best place to sit is at the bar when Matthew is working. You will know who he is immediately when you see his awesome mustache. I recommend this spot for lunch & wine inspired cocktails. It's amazing that they can create \"cocktails\" without actual liquor. Check it out for yourself!", "author": "Alexander C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "Was served  by Esteban, his service was absolutely great! Explained the menu and was very patient with me not being able to make my mind up. Great vibes, good music, and lovely drinks!", "author": "Joe F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "Split a pizza and downed a beer at lunch, great venue, whether after work or during the day a good place to gather with a couple of friends for a drink!", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "I came in (lunch ) for the pulled pork sandwich but they don't have it until after 3pm\n\nSo I asked the bartender what's the next best and was directed to the mission chicken sandwich.   In a word ::: Grub \nIt was a large sandwich and chock full of flavor(s) all of which were complimentary. Unknowingly I added on a side salad for  $2 more --- the salad had its own goodness with cheese pear cuke and tomato. ..\n\nWhile I didn't have the pizza. .two different orders were devoured nearby....\nLooking around,  no one was disappointed including myself!", "author": "Troy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-24", "description": "Cheese plate is a steal. Three of us couldn't finish the plate. Salads are huge too but the star of the show just didn't shine. The pizza crust was thin, but a bit soggy. I'd come back here for a glass of wine but will skip the pizza next time.", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-18", "description": "Solid effort, but they need to do a little more logistical work with their pizzas.  The slice should not buckle under the pressure of too many toppings, but that is just what my Truffle Oil pizza did.  The Chicken Alfredo and Pepperoni my dining companions got seemed to fare a bit better.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "An absolutely awesome environment, great food and very friendly owner and staff! Definitely a place to check out!", "author": "Kamelia I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "I work nearby and I find it's a good spot to grab a beer or glass of wine.  It's a relaxing atmosphere when it's not too crowded (but like all places in the area, it gets crowded at the normal lunch/HH hours).  The pizza is well made, too.  I also have tried the pickles which were tasty.", "author": "Ross I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "I love this place!  I eat here as often as possible.  Their sandwiches and pizzas are excellent, just the right size, and just the right price.  I'm a $10 lunch kinda guy, and getting that with quality in a cozy atmosphere and great drinks is tough to do in the city.  But Archive has achieved it, and with a friendly, knowledgeable staff as well.  The owners have been in the business for years at some very reputable places, so if you're not sure what to order, do hesitate to ask them, or any of the staff for that matter.  And despite not having a full bar, the drink menu never disappoints.  And you can walk to the ball park from there.  Give them a try next time you're in the area.", "author": "Von W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "Quick stop for lunch with a girlfriend; the bartender/server was super friendly and accommodating.  She had the Italian beef. I had the BLT. Mine was amazing. The bacon was cooked perfect and the avocados were superb. It was cooked to order and we were in and out in less than an hour.", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "This is right across from Cal Train station. So if you do not want to deal with parking and you want to go to a really hip place for a drink and nice meal you can hop on the train and just cross the street! The food is good very Farm to Fork and Organic-like. Reservations are HIGHLY recommended because this is a small establishment that gets crowded fast!", "author": "Christine D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "This place was great for their pizza, mixed drinks, and of course, beer!  I'd definitely recommend the Truffle Pizza.  I've never had this type of pizza before, but it was AMAZING!  Also, I'm never one to eat the pizza crusts, but the crusts here were so tasty.  It's quite busy here during happy hour, so it's hard to get a seat of 4.  Keep in mind that they don't have much seating, so come here early (4pm - 4:30pm) for happy hour if you want to seat a group.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "Great atmosphere, good food and drinks. Came here with a few mates after work- we caught the happy hour right before it ended at 6. $2 off regular prices. Had the DiMaggio pizza. Attentive and friendly staff, too.", "author": "Penny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-15", "description": "Quick and good place to enjoy a refreshing and healthy way of having salad and pizza. The drinks are excellent and you can't beat the price. $$. I'm looking forward to trying everything on this delicious menu.", "author": "TJ U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "Went here with a few of my friends the other night, since we noticed it was now open. Very impressed with the ambiance, happy hour specials, and the owner was always present helping. I would recommend this to people looking for a new post-work bar/apps place.", "author": "Nataja L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "Nice little bar great drinks, tasty foods, convenient location for after-work drinks.", "author": "C D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-11", "description": "It's so loud here (despite not being overly crowded) that our waitress could barely hear our orders and it made it impossible to have a conversation across the table. The owners need to invest in some noise reduction paneling. Then we ordered the $12 Manhattan's which were the weakest/worst Manhattan's I've ever had (and I'm not picky about my Manhattan's). When we told the waitress that they weren't very good she didn't offer to replace them, just said ok and walked on to take an order from the next table. The Pizza's were good though!", "author": "Todd H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "The pizza here is great. The ambiance allows you to have engaging conversations.", "author": "Hari B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "Excellent selection of wines---the owner came by and offered up his recommendations to pair with our pizza and charcuterie. Great atmosphere and friendly staff!", "author": "Christina Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-22", "description": "(changed this from 2 to 3 since I've had about 4 good experiences and 1 bad)\n\nI feel bad giving this place a bad review, because I've had some great food from here. \n\nBut, part of being a great go-to place is consistency.\n\nI used to order the Santorini salad w/chicken for lunch. At ~$15 it was a bit pricey, but it was special with the yummy cumin dressing, olives and pita chips. I used to be able to not finish this salad.\n\nThis salad is no longer on the menu, so I went with the mixed greens w/chicken.\n\nIn the past, I got twice the amount of chicken I got today (adding chicken = $4) -- which was really disappointing. The salad was sad. It simply was no way worth the cost - at all. Never, ever order it.\n\n$15 less in my pocket now, and I need to step out to get a supplemental sandwich.", "author": "Kathryn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "Small family business bar so you know they care about their reputation.  Friendly service and amazing pizza.  You can really taste the uniqueness of the tomato sauce that they use.  The Santorini Salad is a must try starter but the pizza is what will keep me coming back.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "This place is legit. Our office's go to spot for lunch. Delicious sandos, seasonal salads with fresh fruit and/or veggies with chicken...mmmm...perfectly cooked thin crust pizzas with amazing flavors. Friendly staff and awesome service. I hit up Archive a minimum of twice a week!", "author": "Blake S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "Awesome ambiance? Check. Delicious freakin' food? Check. Great service? Check. This place is as good as it gets and is one of our go-to spots for lunch and happy hour. Awesome place to go after work for a drink (or two) with a group...always delivers.", "author": "Devon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "Really delicious! Pizza was amazing with some of the best crust I've ever had. The salad was very fresh. They were delayed in bringing out our food so they gave us a 50% discount. Great service, great food.", "author": "Kellyn G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-08", "description": "Great location. Good sandwiches. I wouldn't recommend the pumpkin pizza as I think that the flavors/ingredients mixed together don't go very well. The service is decent.", "author": "Mimi S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-06", "description": "Update:  Went back to Archive today.  Arrived at 11:45 a.m.  Placed to-go order within 1 minute of entering (place was relatively empty).   A guy comes in 5 mins. later, places order and tells the bar tender he would be back in 10 mins.  10-15 go by; guy comes back for his order and he's out.  I sit, i have a glass of water.  i ask the bar tender to check on my order, now the place is getting crowded.  People who have come in far after me are picking up orders and leaving or even worse, being served!  I see in the distance, the person making the pizzas place a box on top of the oven and just leave it there.  Didn't think much of it.  10-15 min's go by, bartender says that my order should be up soon and that they had just put it in the last time he checked.  I wait some more, more people come in, order and leave.  By now, I'm asking REALLY??  Can you check on my order?  I say, \"I saw the guy put a box on top of the oven 20 min's ago\".  Bartender goes over, takes the box off the top of the oven, turns out it was my order.  He slides it across the bar without so much as an apology for the inconvenience and never even looks at me.  UNBELIEVABLE.  Service is as important as food quality.  Neither were good today.  I wish I can say what I'm really thinking but I don't want yelp to delete my post! haha!", "author": "RastaGirl J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "Yum a lum, lum, lum. And service on top of that was excellent. Best new treat I've found in a while.", "author": "S. N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "Really was impressed by this place. Despite it being crowded, the service was excellent. I ordered the chicken sandwich and it was really tasty and filling. Will definitely be coming back to try the pizza!", "author": "Rana B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-27", "description": "Wow. I used to love this place. Awesome salads, pizza, sandwiches etc. Today, I got served raw chicken. All 7 of us had ordered chicken and after 3 of us tasted my chicken, it was unanimous that my chicken was raw (the pink color and fact it was cold in the center did not help...). When we approached the waiter, he said that this is how they serve chicken. We told him that none of the other chicken tasted raw. He then retorted: 'maybe next time don't order the chicken'. Not only was the chicken raw, but they messed up on 60% of our order (adding chicken to a pizza when we asked for it on the side, serving chicken chunked on a salad when we asked them to serve it in strips on the side, not tossing in the dressing on the salad, adding anchovies to a salad we asked to have no anchovies...). And when we complained about our incorrect orders, we got nothing but bad attitude from the servers. So if you want to get food poisoning and awful service with the head waiter/(owner?) talking back to you, this place is for you! As for me, I will not be going back and neither will anyone in my company.", "author": "Izzi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-06", "description": "Come see Kevin and the gang!  Great drinks and small plates.", "author": "Craig S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "Great place all around!\n\nVery cool decor, all around an antique (\"archival\") decor.  Good examples include subtle and cool lights and very cool glass votives that have old school slides of SF attached to them (so that you can see them with the light of the candle).\n\nHad the homemade sangria which was a great mix of spicy and sweet with the right amount of fruit served in a cute glass.  My wife asked the waitress to just pick a nice white wine and her choice was great.\n\nDefinitely recommend the squash and arugula pizza.  Excellent cheese on top and perfect crispiness.  \n\nProbably my favorite part is the owner, Kevin, who is both behind the bar but also checking on everyone to ensure everything is perfect.  Super nice guy who clearly is interested in everyone having a nice time.  \n\nParking on a Saturday night was close and secure nearby.\n\nI'm definitely coming back.", "author": "Todd C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-28", "description": "Had dinner and drinks with a group of friends here last week, and had a wonderful experience!  The food is delicious (had a couple pizzas, and they were both fantastic!), and the fun, creative drinks were excellent (the owner makes speciality drinks). The ambiance was very 1920's antique- LOVED it!  Service was solid, and the owners are very kind and involved in the service- you don't find that too often anymore.  Two thumbs up for this new spot...can't wait to come back!!", "author": "Erika L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "Came here for dinner a few times. Their drinks are awesome and so is their food. The prosciutto and burrata cheese appetizer plate is a must! It's amazing - the best I've had so far. I also recommend their Cezar salad - I'm usually not a fan of this salad but it's great here - totally worth trying and I'm sure you won't regret it.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "great pizza and the tony bennett cocktail was amazing", "author": "Steph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-10", "description": "Great cocktails and pizza. Very reasonably prices. Friendly and attentive staff. Highly recommend for everyone. The winter sangria hit the spot on a cold night. Also really fun music.", "author": "B W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-10", "description": "Had the chicken sandwich and it was one of the best I've had in a long time. The place just recently opened, and they're still adding a few things (e.g. didn't have an espresso machine yet when I visited). The menu is very limited, but if everything is as good as the sandwich I had, they'll be a go-to place for our office.", "author": "Massimo A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-20", "description": "Good pizza.  Nice convenient place to recoup after the work day before commuting home!", "author": "Matt C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-26", "description": "Among the better Pizza places in the city, and offering good value for money. I am surprisingly impressed. For the Margarita, the use of corto oil, the perfect thickness of the crust, and liberal and evenly distributed fresh mozzarella are all much appreciated. SF has a LOT of bad pizza places, but this is not one of them.", "author": "S G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "Great spot for a HH. Mission St in FiDi definitely needed something like this, so it's a great addition to the HH spots. I enjoyed their wine - thought I'm not sure they were actually HH prices.... maybe I came too late. The pizzas were all great to share and made for great snacks. I'll be back!", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "Archive Bar & Kitchen in SF (Mission&2nd) is incredible. The food is original, simple and flavorful as hell. Don't sleep on the Caesar Salad, the anchovies are special with an olive oil and lemon twist. Pizzas are great, drinks plentiful and atmosphere is cozy. We met the chef (Matt), our server Dennis and the owner who made us feel special and really cared how our food and service was. This was our first time here and we'll be back. Great place, don't miss it, joe.", "author": "Joe G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-17", "description": "Great pizzas!! Had lunch at archive today...very busy, not a huge surprise considering it's location. The wait was a bit longer than expected...over 30 minutes from order to being served but well worth the it! I'll definitely be back just not at noon. Had the Classico and the white truffle pizza both amazing! A coworker ordered the mission street chicken sando and said it was great too!", "author": "James P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-09", "description": "My review is based solely on  my take out order.  I ordered the chicken sandwich, which looked good, but lacked flavor.  I understand chicken breast typically can be dry at times, but the chicken in their sandwich was extremely dry.  Dry to the point where if you don't have something to drink with it, you could possibly choke.  Also, the chicken had no seasoning, it tasted like a dry bland piece of nothing.  The bread was decent, and what visibly looked like aioli dressing, did not taste like it.  I was able to eat most of the sandwich and not taste a thing.  The pizza looked good, but I will not try it after eating possibly the worst sandwich Ive had in the financial district.  Definitely will not return for the food.", "author": "Ron R."}
