{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "Quaint little restaurant right before you get to the Golden Gate Bridge. Little confusing to get inside, the signs don't really point you in the right direction, and it's part of another building.  \nWe came here for brunch, first I'd say definitely make reservations, this place is quite busy. I don't know if the face it was buys affected it, but the service was eh at best, nothing stood out. \nThe menu is really small for a brunch menu, as well as heir cocktail list, even though it looks like they have a large bar option. \nThe food, while good, was small and expensive. I got the quesadilla and it was only two small pieces. They took two small tortillas and made a mushroom sandwich pretty much. My girlfriend had the taco plate. Same complaint, good, but small portions.", "author": "John M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-23", "description": "I wanted to like this place.  We walk by every week and it is always busy.  Took a chance this week after a nice day out at Baker Beach. \n\nService: Perfunctory at best.  Unsmiling wait staff, a waitress that disappeared for long stretches of time, and an air of general ambivalence to everything related to the guest experience.  Notables: hostess telling the couple she was seating to ignore the dirty floor because kids had just sat there and made a mess (she eventually swept up) and a \"grunt\" when thanking one of the servers for getting us chips. \n\nFood:. Other than the chips and guac, the food was bland and uninspired.  I was really expecting much, much more from a TdJ restaurant. \n\nNet: The food was not good enough to overcome the deficiencies in service (or vice versa)", "author": "Gautam S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-25", "description": "As a Mexican restaurant, the menu was very limited and no visuals were provided to help a newcomer such as myself see what there is to offer. As a tourist, this should not be considered a \"Mexican\" restaurant since no spices or unique seasonings of the culture were sprinkled into the dishes. \n\nI ordered the burrito and it just tasted like an ordinary Americanized burrito. No side dishes were offered with it especially given the price and the size was unjustified. I really do hope they venture into better understanding what makes Mexican dishes great and integrate it into the menu so they can justify the title of Mexican restaurant.", "author": "JaVon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Arguello was delicious. We loved every second! Alyssa did such a great job serving us!! And we loved the atmosphere.", "author": "Boone W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-19", "description": "Overall, this restaurant is overrated. The raw quality of food ingredients were fine but the output is mediocre. For what we ordered, nothing was outstanding in areas of taste or presentation. The mushroom quesadilla was basic and so were the chicken taquitos. The skirt steak was tender but taste was neither here nor there. The skirt steak came with a cheese enchilada but it wasn't anything special about it. iThe menu also listed CRISPY Brussels sprouts but it came out limp and wet. Ice tea tasted watered down. \n\nService was average. Our particular server executed her duties but wasn't very engaging or provide any real insight to the dishes.  \n\nI'd give 3 stars for service, atmosphere, and there is a full bar. However, most important to me is food which I'd give it 2 stars.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-02", "description": "I didn't have a clue that chef Traci Des Jardins was behind this spot when I happened to be next door at the Presidio Officers' Club to see the moving exhibit, \"Exclusion: The Presidio's Role in World War II Japanese-American Incarceration\". On a recent Friday morning, I had just seen my dad's name among the interned and was feeling somewhere between pensive and peckish when I noticed Arguello opened at 11AM. Oh good, I'll have a bit of lunch, I said to myself, so I waited on the bench and in front of their patio gate. They opened the gate on time, and I asked if they were ready to serve lunch. Indeed they were. They serve a pretty healthy menu for a Mexican restaurant, but keep in mind this is Des Jardins of Jardiniere. That means this is not your typical Mission taqueria.\n\nThey offered alluring plates such as the $12 Quinoa Salad with arugula and pepitas and the $10 Little Gems with avocado, cotija cheese and a serrano vinaigrette. However, what caught my eye was the $12 Pozole Verde, which turned out to be a steaming bowl of goodness on a brisk morning. It had chicken, hominy, cabbage, radish, and oregano in warm chicken stock and topped with a fried corn mini-tortilla drizzled with creme fraiche (photo: http://bit.ly/2oI7Npy). Nice and it satisfied my periodic menudo fix. With a minty $3 Lemonade (photo: http://bit.ly/2tkTyeY), it hit the spot. Not to worry if it sounds too healthy as they offer five different tacos in the $4.50-$5.50 range and three desserts. Nice to be there before the lunch rush if there is one. It's the Presidio after all.\n\nFOOD - 4 stars...lighter Mexican fare and pretty tasty\nAMBIANCE - 4 stars...part of the gorgeous Presidio Officers' Club so very much a Spanish colonial vibe\nSERVICE - 3.5 stars...attentive enough as they seemed to still be preparing the restaurant for business\nTOTAL - 4 stars...Des Jardins leaves her unmistakable mark on the small but impactful menu", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "It was a dark, stormy night. It was abominably cold and windy. My friend of ill-fortune stumbled back into Arguello in a fit of panic and told the staff the tale of how her phone had just ran out of battery. That was her first time in the Presidio. Beautiful as it was there, she was stranded in unknown territory. The helpful staff took her in with open arms, shielded her from the rain, and offered her the usage of their charger. Alas, my poor friend, being one of the few Pixel users left in the world, was not able to use any of their iPhone chargers. One of the staff members then proceeded to dial her a Lyft with her own phone. And my friend was able to return safely home. One cannot ask for a better and more helpful staff than that!\n\nPS. Chicken Taquitos came out fast if you want a quick bite at the bar. And it had good crunchy texture.. Yum!", "author": "Yad L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-04", "description": "I've been to this place several times and each time I've had a different experience. On this visit, I was glad that we were able to be seated rather promptly (although there was a 30 minute wait to sit outside on the patio). I must say, this is a gorgeous place to have brunch, especially on a beautiful day. It gets the right amount of sun and you can catch some great views of the Bay as well. \n\nThe hostess was very nice and accommodating (which is always nice when you're eating with children), bringing us two high chairs and having overall great customer service. For the most part, we were able to order quickly however service seemed to be a little slow. I ordered the agua Fresca of the day (my partner ordered a beer). Both drinks were good and satisfying. The waiter (who also had great customer service) took our orders and our food arrived pretty fast. One thing I did not like about the service was that we ordered chips and guac (chips were made on-site and DELICIOUS!!! The guac was rather bland and needed major seasoning) but that didn't come until after our main courses had arrived. \n\nWe ordered the house tacos and the Mexican omelette. The house tacos were delicious, but I wish they weren't so small for their price (it's about $12-$14? And you get the equivalent of two small street tacos, one with shrimp and one with fish). The Mexican omelette looked good, but lacked a lot of flavor. We also ordered the corn cake, which was delicious however the fresh vanilla bean cream was super bland.\n\nThis place has the potential to be really good, but I feel like they keep running through chefs because the quality of the food isn't consistent (and if they food isn't good, then why pay?) The last time I came I had a great food experience but this time it wasn't the same. I am thankful for great customer service (hence the 3 stars), which goes a long way in my book. \n\nI will say that this is a great place for brunch overall due to its location (bay views), and being very stroller friendly (both inside and out). Parking is also plentiful right out front (but don't forget to feed the meter, as they are active on the weekends as well.", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "3.5 Stars\n\nArguello serves good classic Latin American food but it is more the combination of food, ambiance, and experience that leads me to give them 3.5 stars rather than just a 3 star review.\n\nI think Arguello is best for drinks and appetizers. \n\nDon't get me wrong the dinner plates are okay ( pretty pricey and somewhat meh) but I am more a mission district classic three plate combo. Arugello is a little too fussy with the mains and the execution was flawed. \n\nIf the weather is beautiful sit outside order some Margs, Guac, and their wonderful Queso Fundido.\n\nArugello is even great just to stop by and have a drink at the bar!\n\nCheck them out!", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Great location , fun staff , tasty margaritas, good food . \nWe had a nice time , the atmosphere was pleasant. We had a fun waitress that made us feel at home . A little pricey but is what you would except, you get what you pay for worth every penny. I recommend the restaurant for a fancy Mexican dinner.", "author": "El C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "With so many great Mexican restaurants in San Francisco, there's an insanely high bar.  This place would hold its own in the middle of the country where there are just Mexican-ish chains.  However, it's definitely not a destination Mexican joint in San Francisco.  More like you happen to be nearby in the Presidio and want alcohol and want a little food with that alcohol.\n\nChips w/ Salsa, Guacamole and Refried Beans: If drinking is your game, this snack option will do the trick for the table.  Don't expect someone to hand mix your guacamole table side.  Nothing is particularly amazing, but it's better than store bought.  The chips seem homemade, though some were a bit over fried.\n\nChicken Taquitos: Better than the frozen aisle version.  Kinda of a small portion though, with just three.  Loved that the shell was crunchy all around and the shredded chicken inside was tender.  The dish is a bit skimpy on the salsa, but not a big issue if you have the chips & salsa on the table.\n\nCarne Asada Tacos: A bit disappointing.  Despite the \"asada\" name, it didn't seem very grilled. Kinda like the limp beef option at Chipotle.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Went for dinner while visiting my Uncle Darrell at the Presidio Bowl. Holy gosh dang, the menu and prices throw you off guard at first, but you can taste the care, detail, and freshness in every bite. Thank you Chef. We'll be back next time we're in town.", "author": "Julian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-12", "description": "A Spanish cottage atop the Presidio. Dark wood furniture, leather weaved chairs, mahogany pillars, and sconce-lit background are what give this place personality. We arrived on taco Tuesday. Three tacos for ten dollars. I had the Maleficent beverage. It's similar to a sangria. \nThe staff was nice. The bathrooms are a bit of a hike. Well kept though.\nNext to the Officer's Club. Handsome lobby with a sexy fireplace.\nI have no idea why this place has anything lower than 4 stars.", "author": "Faizah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "I cannot praise this restaurant enough.  We arrived very early but they sat our group of eight at our reserved table anyhow - even though we all hadn't yet arrived.  They were all so patient, bringing us many drinks and chip refills before we could finally order our food.  And the tricky part ... I'm vegan.  Anastasia was immensely knowledgeable and nonjudgemental.  She is simply the best.  The food was outstanding and the atmosphere easy-going and cozy.  I want to go back for brunch and enjoy that gorgeous heated patio.", "author": "Deb Doran D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "Don't understand the 2.5 avg review rating. What are people expecting really? This place screams dog lovers go wild. Yeah if you are on a hiking expedition and your fur daughter needs a place to hang out for an hour and you want to get your hands on a margarita. This is your spot. Brunch is simple. Not a lot of variety but it reminds me of Mexico's resort area, just good food but not a lot of crazy stuff. Suits me just fine. Excellent chips and guac. Abby gets to have her own bowl of water plus some chips that \"accidentally\" fell off the table. \n\nBrunch items are perfectly serviceable. It's not big. Portion was more like appetizers, which could be the reason why people complain. But, and this is strictly coming from a dog lover's point of view, I think San Francisco is not exactly the most dog friendly town, like Carmel is, so to find a place that takes dogs and actually love dogs, this place is far better than most. \n\nAbby enjoyed some chips, some taco, and some water plus her dog biscuits, but what she really loved was all those people coming up to her to pet her and tell her how pretty she is. \n\nAn excellent venue to chill after a hike in the park with your fur baby.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-09", "description": "This place is in the presidio and has a paid parking lot which is super easy. They have a dog friendly patio which is a huge plus for us. I had the huarache and the maza crust was tasty. Unfortunately, the poached eggs on top were over -cooked and overall the dish did not have much flavor. Two members of my party enjoyed the torta. We also had chips and guacamole which was delicious. The service was not great - I asked for water 3x before i was served water. They have a variety of margaritas and you can save a couple $ by getting a pitcher if you have a group.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-25", "description": "Happened to experience Arguello, and to say the least, was not impressed at all. This restaurant may claim it serves \"Mexican\" food,  I would argue that is a stretch. \"Inspired by Mexican cuisine\" is closer to what's real. \n\nThis place has a great ambiance, but the food (quality and quantity) leave a lot to be desired. I had the burrito, and ...It was just a plain burrito - nothing special about it. There's nothing inspiring or different about the food, it didn't even come with an accompanying side for the $11 price!\n\nI wouldn't come back here if I had the opportunity.", "author": "Jerry W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "Excelente! We came and sat on the patio with our perrito and true to presidio weather karl was keeping it chilly. Luckily for us Arguello has heat lamps and a cozy fire pit. We shared everything familia style, and ordered chips & guac, alpastor tacos (x2), totopos, and watermelon salad. For four people I'd definitely say that was enough. Favorite was definitely the al pastor tacos- I probably could have eaten like five more. Can't comment on the drinks because I'm off the sauce temporarily. \n\nService was nice- laid back but not absent.", "author": "Alyssa J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-12", "description": "What a treat to eat in this lovely historic setting and building.  My family decided to try this restaurant for my daughters birthday celebration.  We were seated right away as we had made reservations-we were greeted graciously by our server.  Drinks ordered, apps and all were served together and efficiently.  We loved the guacamole.  Our meals were enjoyed by all.  The snapper was delicious.  The two taco dishes were good.  The ceviche and taquitos  tasty.  My youngest loved the little gem salad and her quesadillas .  The margaritas had unique flavors.  Definitely elevated Mexican fare.  Happy to have tried.", "author": "Nancy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Had a really fun light dinner with one of my true BFF tonight at Arguello. Staff was friendly and responsive. They were taxed with keeping up with 3 or 4 separate dining areas areas, but kept a smile on! The place, food and views are a real SF treasure. \nI will be back!", "author": "Julie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "This place is a real gem for brunch and just about any meal. It is in the old Presidio officers club (a truly amazing space!) and while it is a bit out of the way parking is easy, as is bus transport (with a short walk), and as of April 2018 it was not crazy busy for brunch with easy reservations available online and easy walk in. The food was what I would call \"high\" Mexican/California fare and the drinks were top notch with an emphasis on Tequila  and Mezcal drinks. Staff were talkative and friendly at the bar - something I think makes a big difference! By the time we got up here and had brunch we laughed that we'd still be in line elsewhere in town.", "author": "Marc R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "Yum!!!!\nThis is a great restaurant in a gorgeous setting! I had no idea it was even there. \n\nA few friends and I decided to have brunch while our kids were at a birthday party at House of Air. Everything was delicious! We had cocktails (Pisco Sour, Arguello Margarita, and Secret Garden) - all great. Then the salsas and guac, taquitos, and poke. Then we shared the chilaques and taco plate. We all loved everything.\n\nIt's a hidden gem. And at $100 for all three of us,\nNot too pricey either.", "author": "Karen N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "After attending the one-hour tour of the Presidio Officer's Club, the docent recommended Arguello for lunch.  We were so hungry, so we took the advice. \n\nI wasn't in the mood for any alcohol, so I ordered a cup of coffee.  It was good and satisfying.  The guacamole was the best I ever had in my life!!  \nI don't eat Cal-Mex food enough to really compare, but the chilaquiles I ordered was delicious!!!  It was a very big serving, so I took a half home and enjoyed it again for dinner.  \n\nThis will be my go-to place when I'm at the Presidio :-)", "author": "Takako S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "Lowered expectations after reading yelp reviews, but, located nicely in the presideo after a 6 mile walk .  Lunch has limited option with counter ordering and delivery to tables.  The beer and wine were good.  The chips and guacamole were super tasty. The tacos were good but could be a bit tastier (so I added some guacamole). Well priced and located.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-13", "description": "Be warned that the parking is VERY difficult on Sundays that have Picnic in the Presidio - we had a 1:30pm reservation circled for 30 minutes and only found a spot very far away. During this process, we called Arguello to ask if they had any reserved/dedicated parking for patrons and the person who answered said, \"I don't know.\"\nPlan accordingly!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Not sure why the review is low but we enjoyed it here. Derver was very nice and informative, even went out of her way for us.\n\nStarted out with chips and guac, yummy guac. Chips was freshly made in house.\n\nI had that hancheros? That was delicious. The boyfriend had the tacos. He said it was good but a little too small and not enough food.\n\nCoffee was organic and local, tasted delish. \n\nGreat place. Will be back again tomorrow for lunch.", "author": "Gloria M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-23", "description": "Beautiful interior, very nicely decorated. I especially like the historical artifacts on the wall and the old photos. If its warm enough outside, I think the patio would be quite enjoyable.\nRegarding the dining experience, while the food tasted good, I would stick with just the starter menu as the Mexican poke was absolutely delicious. I was irritated that chips were not provided, chips are a staple at any Mexican restaurant, and to not provide them complementary was annoying. Rather you have the option to get chips, salsa and guac for $9, or just guac for $6?! Secondly we decided to get a pitcher of margaritas because the price on the menu the price was shown as $11 for margarita and $40 for a pitcher. Usually when you show two different prices in the same line, its because there is an incentive to the consumer to select the larger item because there is some type of cost savings. When the \"pitcher\" arrived, the container looked like a wine carafe, which is smaller than a pitcher, and we probably got at the most 3.5 drinks out of it total, which is no cost savings, and at that rate we should have just bought 4 drinks, because at $4 more, I would have preferred a whole second drink instead of splitting the remainder margarita between our two glasses. \nFor entrees/larger plates - there is only one taco option and its pork. I'm was very surprised that there were no steak or chicken taco options, as I don't eat pork, and it seems to be a more common thing in the Bay Area. There were three seafood inspired dishes on the menu, crab enchiladas, snapper, and a shrimp dish, however I was surprised there weren't other classical items, such as street tacos, chile relleno, some type of mexican inspired burrito, or a steak dish.", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "Food good (4 Stars) / service weak (2 stars).  Ordered margaritas before we ordered the meal, never showed up.  Half the table got served, then 15 min later the other half.  Asked for water 4 times, finally came after everyone was done eating.\n\nIt's just not that hard, please hire someone that can train folks and get the kinks out.  If they could get it right, I would go a lot more.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Great service and awesome food! I've been for both brunch and dinner and really enjoyed the mezcal, margaritas, fish tacos, ceviche, and chicken taquitos! Beautiful and rustic atmosphere nestled in the Presidio.", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-30", "description": "This is really 3.5 stars. If it was less expensive or the servings were bigger it would be four. \n\nThe margaritas are great but there's a lot of ice so for the price they seem to go a bit too fast. The food is good but again, I wish there were more of it for the price point. \n\nNice outdoor seating with a fire and close to the view of the water and the GG bridge. \n\n(The Presidio bowling alley is across the street, if you're so inclined...)", "author": "Tanya W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-27", "description": "Indoor/outdoor seating with a fire pit. Pets allowed outside. Server was nice but slow and menu pricey for portions. Guacamole and salsa was good and fresh. Chips are thick and a bit greasy. The ($11) quesadilla was just ok. Very small w/o much filling so you really just tasted the corn tortilla. (They charge for chips and salsa). Maybe a nice place after golf but wouldn't make a special trip there.", "author": "Dawn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Gourmet Mexican cuisine at a reasonable cost. Friendly staff will welcome you and treat you well! \nThe chef creates new and unique takes on traditional Mexican food with unexpected results. My wife and I visited the city and were told by a friend to check out this great almost hidden gem. \n\nExceptional selection of agave drinks and great bar service. We really enjoyed the Argentinian malbec. \n\nLocated at the top of the presidio in a repurposed military building, the management has done a great job creating a relaxing and beautiful high end Mexican atmosphere. \n\nDefinitely worth the drive up the hill and you get a beautiful view of the bay and Bridge. \n\nTry the new York strip steak. It's amazing and probably the best dish I had in SF while on vacation.", "author": "Aloha T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-03", "description": "Went for a Taco Tuesday during lunch hours about a month ago...\n\nThey were mediocre. One shrimp piece for my shrimp taco. Okay al pastor... ok fish taco. Each taco was about 1 or 2 bites. The tortilla... it's as if I microwaved day old tortilla; it was kinda dry and stale.\n\nTo top it all off, $3 was way too much to pay for each taco. But at least they were edible.", "author": "Lilian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "We had brunch here on Saturday. It was quick and servers were very friendly. The burrito was fantastic. It was some of the best pork I have ever had! Great place to stop if touring around the Presidio!", "author": "Maryann E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-01", "description": "I normally like to visit a place more than once before leaving a review but I had to ask for water three times. Being a party of 8, we require somewhat special attention but having to ask for something as basic as water several times was annoying.\n\nBeyond that, service was decent for a slow Friday night. The food was okay. It's nothing to write home about and a tad overpriced for what you get. The churros with the cajeta sauce were pretty good, though. I probably won't be back unless someone I'm with really, really wants to eat there.", "author": "Robyn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "Nice atmosphere fresh made chips and guac!  Good service.  Huevos Rancheros and Huevos Motuelenos were both saticfying and not overly large.", "author": "ChaCha A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "This place needs more photos of their Pozole soup on their yelp page because it is delicious and comes in a larger portion than expected! This restaurant has a good variety of seating, glad they have outdoor seating as well because it was a beautiful day out the day my colleague and I decided to go. I'm frequently in the area and heard it's great for wedding receptions or small private dinners.\nGood flavor, good size, and fast service so I will be back!! (Specifically for more Pozole or their banana pancakes on the weekends during brunch hours!)", "author": "Laura Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "We've lived in SF for four years and finally made our way out to Arguello. The star rating that arguello has nowhere near justifies the meal we just had. We learned that the previous reviews came under an old chef...this new chef and team know what they are doing. We know Arguello will be the next hot spot. \n\nIf you go..order the wagyu steak, it melts in your mouth. Pair it with the Oaxaca bird and youre set to have a great time.", "author": "Priscila M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-10", "description": "Decided to try this place while visiting the Presidio. It was last Friday. From the moment we walked in it wasn't that great. First, the woman that greeted us, actually she very rudely cut us off and told us to wait when we tried to talk to her. Sorry if you're having a bad day but let's be professional shall we? Anyway she continued taking our order with some attitude. The food wasn't that great I've had better. Being that I do not like cilantro (yeah right I don't) everything was put on the side that was fine however the taquitos were very greasy. The quesadilla was unappetizing. The tacos were fine.", "author": "Annette W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-03", "description": "Ambiance and service is good.(the hostess was especially nice and welcoming)\nBut the food is very underwhelming. Way overpriced, disappointed and unsatisfied after an $80 bill for 2 people. Ordered the snapper plate which was very basic with a side of tasteless rice and very bland assortment of chopped zucchini. And the tacos, which I couldn't even finish because the meat was so over salted. I hate to write a bad review, but It's just a shame because the location is awesome. But the price points are just not worth what you get", "author": "Drea L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-28", "description": "probably the worst food I've ever had. \nI had the chorizo con papas and when it came it looked like dog food.. Very unappetizing presentation, the food tasted horrible, I really caution people to come to this restaurant. I don't think they know how bad their food tastes. the portion is also very small so my family and I weren't full at all. I am so disappointed and wasted 50 bucks on the crappiest meal ever in my life", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "I came out here for lunch due to a friend's recommendation and Arguello did not disappoint. The server and bar tender were friendly and it was pretty relaxed ambiance. I ordered a seasonal shandy and it was a very citrusy and refreshing beverage. I'd definitely get it again. I also had a chicken chili verde and a crispy fish taco with cilantro rice. I enjoyed both tacos but if I had to choose the crispy fish was my favorite. I would recommend this place to anyone who's looking for a good Mexican place for lunch.", "author": "Christopher W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Love this place! Chef Jose had really turn this place around! You can see his love and passion for food in every dish! Great drinks service was outstanding great Mexican restaurant in a great location.", "author": "Cisco D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-31", "description": "This restaurant is good, not great. \n\nI came here for brunch with a large group of people. First off, it's more convenient than your average SF brunch stop, albeit a little out of the way in the Presidio, but you can make a reservation and there is plenty of parking in front of and nearby the restaurant. The space itself is beautiful. There is an outdoor seating area with tables and benches that is kept very clean as well as plenty of tables indoors. It's also located within a museum (?) so you kind of have to navigate to the bathrooms, but those are also kept very clean. \n\nI know people gripe about the service here, but I really had no issues. The wait staff was lovely - we were offered seating before the whole party arrived and they were quick to check up on us to offer drinks and some starters. \n\nThe food itself here was the most underwhelming part. For the atmosphere of the restaurant, I found the food to be really meh. Firstly, they say you eat with your eyes. Dishes here are definitely not the most visually appealing. Beyond that, I would say my food was tasty, but nothing that would make me want to return here over any other Mexican restaurant in SF. We ordered:\n\n- Huevos Rancheros: definitely underwhelming. It came with tortilla, cheese, and egg, surrounded by refrained beans and salsa. Visually, no other colors but brown and red. I would have liked maybe some chopped salsa (tomatoes, onions?) or guacamole/aioli of sorts? It was not inedible or anything, but again, one of the most disappointing Huevos rancheros I've ordered.\n\n- The fish tacos were good - reasonably priced, battered and fried very well, and this came with a great sauce and slaw. If I had to come back, I would probably stick to the tacos.\n\nTo summarize: a great beautiful, open space, friendly staff, but just very mediocre food. For that reason, I'm not sure I would make the trek out to return here.", "author": "Sarah N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "This place is awesome!  Such a gem in the Presidio.  I was here with a client planning the details of her wedding (yes, they do weddings!!) and stuck around to miss the bridge traffic back to Walnut Creek.  Such a great decision... literally the best margarita I've had since moving to the Bay Area from San Diego.  Amazing chips and guac.  All around a great atmosphere, food, staff and drinks.  I will be back... and can't wait for the big wedding in 2 weeks!  Vendor meal is tacos... yippie for us!!!", "author": "Erin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "Went for brunch on 12/09/17.  Banana pancakes are amazing!  Server was a bit robotic, but wasn't expecting much.  Parking is free and easy.  Definitely will be back.", "author": "Liane F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "This place is great - no idea why their yelp rating is so mixed. Food is clean, delicious, non-tradish Mexican fare, spiced expertly and in perfect, moderate portions - meaning you usually leave feeling full instead of ready to explode. \n\nGreat for parents. Dog friendly on the patio, though it does get chilly on foggy eves. \n\nBar is excellent - the bartenders killl it with the Arguello margaritas and expansive  Mezcal selection. \n\nI had the chips / guac and cheese enchiladas. Excellent . \n\nCan't wait to return with my wife!", "author": "C O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "After a 6 mile walk we saddled up to the bar for much needed drinks and appetizers. Tried many of the seasonal cocktails but loved the pisco sour the best. Chips, salsa and guacamole were great too. Shout out to our awesome bartender Kudi!", "author": "Kathy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Love this spot. The margaritas and fish tacos are delicious. It's a particularly great place to come after a chilly day hiking in the Presidio! We happened there on a taco Tuesday for lunch over break, and they had a special with 3 mix and match tacos. It's in the Presidio Officers Club area so parking is fairly easy and there was a nice room next door with a beautiful fireplace if you end up walking around the Officers Club.", "author": "L C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "Slow service and not very friendly staff. Our waitress didn't write our order down and she got all of our orders wrong, we had to ask for our drinks 3 times before we received all of what we ordered. I cannot recommend this nor will I ever return. Bummer because I really did want it to be one of our weekend go to places.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Stopped in after Off The Grid for a cocktail and dessert. The hostess sat us in the Anthony Bourdain area...because she repeated twice how we had, \"NO Reservations\"! We also sat staring at each other because we also had NO Service. Some seats opened up at the bar and we moved. Andy the bartender saved the day!!! She was warm and welcoming. Recommended a margarita, the Flan and horchata ice cream. All delicious. We went from being ignored to having a great time. If you go... sit at the bar and ask for Andy...she is a gem!", "author": "PJ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "This is one of my favorite cocktail places in the city. Ask for the seasonal tequila drinks menu--you'll be so thoroughly delighted! The food is just as heavenly as well. Chips and guacamole are made fresh in the house and infinitely flavorful. The portion on the brunch menu varies so order a few things to share and you'll get to taste all the different Mexican/California inspired, modern dishes this place has to offer. Even if you're not hungry, definitely come for the ambience!! You can see the ocean from the patio, watch the afternoon fog rolling into the Bay, rays of sun moving through the trees above, and the flickering flames from the fire pit radiating warmth in a crisp early evening. This place is such a gem in the Presidio!", "author": "Elsie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "Funny place.  The marketing around it is kind of phony and pretentious.  If you call their number, it is impossible to talk with a human being and I don't understand the glorification of Traci Des Jardins.  Having said that,  the food is very good and the service is excellent.  The ambiance is lively and fun.  There is a tall, female bar tender who is great.  We had a variety of dishes, most of which were great and some just OK.  I rarely eat steak but decided to try it.  It was not what I expected but the mushrooms and sauce on it were excellent.  I recommend Arguello as an occasional choice.", "author": "Ralph B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "Sitting at the Presidio Officer's Club on Cinco de Mayo I couldn't help but overhear the live music and vibrant hum of the crowd from their attached-at-the-hip neighbor, Arguello.  When the person beside me mentioned that she'd just come from there I wrinkled my nose and asked \"How was it?\"  \n\nYelp reviews for Arguello had led me to believe that, despite the Traci Des Jardins pedigree, this place wasn't a winner.  With the blessing of this stranger I had reason to see for myself and, $90 worth of food and drink later, I'm in agreement.  Arguello is a fun place serving Mexican fare that goes well with alcohol.  \n\nArguello has a sweet outdoor patio, indoor tables (which could've used quicker bussing), and a friendly bar.  It was at the latter that I enjoyed a mess of margaritas ($8; alcohol content kicked in at #3), chips/2 salsas/excellent guacamole (about $8), and Frijoles Rosas with Queso Fresco topping ($3.50).  On Cinco de Mayo this constitutes a meal.  \n\nI can't vouch for the larger plates of food with the higher prices as I didn't try them.  Nor can I grouse about the service issues some have spoken of as my service at the bar was quite excellent.  \n\nIf I were in the Presidio and someone recommended Arguello for drinks and a little something-something I'd agree without hesitation.  In fact, were I in the Presidio I'd probably be the one making that recommendation.  I'd sit right back down at the bar and order up pretty much the exact same thing (maybe a few less margaritas) and I'm pretty certain I'd leave feeling the same way I felt on this visit.  \n\nArguello is a good place for drinks and a little something more.", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "This is a perfectly pleasant place to have a casual, easy lunch. The low rating is seems to be mostly due to reviews from years ago. \nI like it here for a lot of reasons:   There's parking. They have indoor and outdoor seating.  It's located in the cool \"Officer's Club\" building. You order at the counter and they bring the food to your table, so it's on the casual side, but the value is good and the food is fresh and tasty.  I like their homemade chips with guacamole and salsa.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "Had brunch here this morning. Great little hidden gem in the Presidio. Lots of parking which is a plus. Atmosphere is super cute-Spanish style with a big outside patio with lights and cute furniture. They also provide cozy blankets and have outdoor heaters, which makes sitting outside in SF doable. \n\nWe loved everything we tried. The huevos rancheros, taco plate (shrimp and fish) and omelette. For drinks we enjoyed the sangria and boozy cold brew. \n\nDo note that they don't serve lunch on weekends! \n\nWill definitely be back for taco Tuesday here!", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-29", "description": "I want to like this place.  It has parking. It is reasonably quiet.  It is in a nice building and has an outdoor space.  However, it is just too odd to really recommend.\n\nThe menu is very limited and seasonal, so if you like something, it probably won't be on the menu the next time you go.  \n\nThey make a big deal about Agave and Spanish wine, and the bar, but don't have Sangria.  Now maybe that is not really authentic Mexico, but a Mexican place here without Sangria is just missing something. \n\nThe food all seems really pretentious, but when you taste it, it is just not that flavorful.  I'm talking about the little Gem Salad with horrible Green Goddess dressing, the deconstructed pork belly tacos, and even the chocoflan.  It was a disappointing meal overall.\n\nService was fine.  Just wish the food was better.", "author": "Alan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-04", "description": "1st time I went was for lunch. Had the Shrimp Tacos and the taquitos! The Shrimp tacos were delicious!!! I highly recommend!!! The service was decent nothing special I have seen better. \n\n2nd time was for lunch at 2:00pm and hoping to get Shrimp tacos or taquitos for lunch. When I order some the waiter told me that they do not serve tacos for lunch and I could come back at night and the items they served was the only ones in the menu. Bummer! The menu only had basic simple appetizer nothing that would be consider lunch (Salsa & chips, guac and chips, pepita, chicharon) and a variety of alcoholic drinks. Order guac and chips $6.50. \n\n3rd time went for dinner was craving tacos and went out of my way to show off the place to my boyfriend because is a beautiful location and was just perfect the first time I dined there. WAS NOT WORTH IT!! We left completely disappointed ! No tacos and they had a small menus to choose from. We order food my boyfriends food Mole was bland not much taste to it. I ordered Whole shrimp al ajillo the rice was good the portion was small. We also ordered guac, salsa and chips. Chips were stale and salsa taste like spicy water do not recommend at all. \n\nOver all it was a good experience decided to go again not great gave it another chance DEFINITELY would NOT come again or RECOMMEND this place!!!\n\nCheck out other places SF has better restaurants then this one not worth the time or money!!", "author": "Iveth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "Honestly kind of surprised that the reviews for Arguello are so bad!\n\nBut I guess I didn't really eat much besides chips and guac and drink! My friend and I came here for margaritas and appetizers before eating at Commissary. The weather wasn't that warm, or else I would've loved to sit outside on the patio! There aren't enough spaces in San Francisco with outdoor seating at all.\n\nParking here was so easy because it's the Presidio. If you come early, make sure to check out the Presidio Officer's Club right next door! It's a beautiful lodge-y space that feels cozy. It's a public area where you can bring a book to read. There's even a piano!\n\nIf I have some sort of birthday or social event, I would consider having here on a warm afternoon!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "Service is really warm and friendly, the food is good and I thought the portions were the perfect size! Love coming here.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "Fantastic place!  Great tacos, great service, and great ambiance.  Large restaurant with plenty of outdoor seating.  You can't go wrong here. I'm definitely coming back ... a lot!", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "This review is for brunch, which is insanely good. Last time I was here I had a bite of my friend's sweet potato and carnitas hash -- he got a poached egg on top-- and it was so good that it has compelled me to write my first review on here in years. Overall the brunch is arguably one of the best in SF-- and it's even better because it seems to be a bit of an inside secret, i.e. you can actually get seated quickly. (I detest waiting in line for brunch.) The portions are not huge, but the quality -- both of the raw ingredients and the preparation-- is excellent. \n\nAlso, I'd be remiss if I didn't mention the cocktails. I don't know why this place doesn't get more buzz for its bar program, the drinks are uniformly superb.", "author": "Mary B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-03", "description": "Completely disappointing brunch. They don't have the right item selection and the food was mediocre. They say mexican but it's more like half-a vague elements. The table next time mine had a light fixture above that I saw 3 people smack into during the course of my meal. You'd think that would be something that happened once and the restaurant would immediately fix.\n\nWaste of time at this place.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-10", "description": "I recently reserved the entire patio area for a wedding cocktail hour and was very disappointed with the results. I had conversations with their event coordinator about what I wanted and what to expect but nothing turned out the way it was suppose to. The passed appetizers were slow to come out, at certain times no food at all but their reasoning was that I had too many hungry guests. Guests were also served drinks that I did not order. The food was decent but for the amount I was paying, it was definitely not worth it and I would NOT recommend to large parties due to their service.", "author": "Maxine C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-05", "description": "Don't go here for  your birthday. Recently went with a group of 6 and one of our friends brought us all cupcakes at the end, which she handed us from a box she kept by her side through dinner. The restaurant charged us for the cupcakes that WE handed to OURSELVES - they didn't even have to hold them in the kitchen for us or cut a cake. It is absolutely absurd to charge a fee where no labor or assistance on the restaurants' end was required. This place has horrible birthday spirit.\n\nAll dishes also seem to be missing one ingredient to take them from good to wow.", "author": "Sara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "This review is for their drinks, warm fire pit outside and good overall feel.\n\nWe sat outside with the dog on a sunny Sat afternoon. Service was good and we had some delicious agave type drinks. Dog was happy too !\nWe also had great chips and salsa and some guacamole which was excellent. \n\nHighly recommended:)", "author": "Jonathan Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-06", "description": "Arguello was a huge disappointment.  We were served margaritas on the rocks with   barely enough salt to taste on the rim. APPARENTLY they were saving the salt for later. No matter the margs were weak and slightly flavored. Not bold and  a citrusy as one would hope. I sent mine back and told them what i wanted: lime juice, triplesec and a better tequila and rocks and salt. They assured me they used fresh lime and triple sec. There was no evidence of lime, perhaps they need MORE and a better triple sec as well. The service was confused and inefficient. They returned with something very like the previous margarita. I did not finish that single margarita in the hour and a half that we were there. Normally I would have shared a pitcher or had three.\nWe ordered an appetizer, ceviche, it came w no chips, we waited for a return of the waitress, meanwhile we were asked if we'd care for chips and salsa. I thought these were to be gratis and in lieu of the fact we had nobody to take our order. I finally called someone over to take our order. (Btw the chips were not free). After about an hour from the start our order appeared. My wife liked her carnitas tacos. I had ordered the fish. The fish came attractively prepared on a bed of green coloured rice mixture. Maybe cilantro? I could not taste anything in the rice as it was too salty to distinguish. The fish was nicely browned, broiled BUT It was also too salty and laden with grease, butter i think. As small as the fish and green rice serving was, I could not bear to finish it. I asked for some lemon to try to brighten the flavour but it was too far gone. I don't write reviews or consult yelp but i felt the need to object. The bill was 95 dollars without tip. Two drinks, ceviche, $al$a and ¢hip$, tacos, and fish. I left a tip and i don't know why.\nPretty place, plenty of customers, maybe they don't need to try.", "author": "John H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-26", "description": "Returned for another attempt at receiving good food and service. Failed on both.  The burrito is a joke! The fish tacos were good albeit tiny bits of fish rather than healthy portions. The frijoles con queso came without queso!  Three tiny dollops of cheese and the beans were bland.  (HINT!  HIRE A GREAT LATINO CHEF)\n\nThe wait staff has big time attitude! Perhaps this stems from Jardins' Jardinaire training or lack there of! Who knows. \n\nIMHO I believe Ms Jardins has endeared herself to the Trust who have awarded her three concessions at the Presidio. Her Commissary is exemplary. Her Arquello is not! Neither is her Transit Cafe.", "author": "Tex M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-04", "description": "We stopped in because of the street corn they have on their web site. Only to find out that it is only a seasonal dish. \nThe Cochinita Pibil was bland and tasteless. After adding salt and squeezing lime on it. It still was not good. \nThe second taco was beef Guisado (braised) also did not have flavor. \nThe decor was the only nice thing about this restaurant.", "author": "LeTisha B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "3.5 stars\n\nAlthough I highly recommend visiting Arguello, I don't love it overall. \n\nThe Miami-like weather in the Bay over the weekend warranted an outdoors brunch - my fam and I chose Arguello for that reason. While we enjoyed sitting under the shade in the warm and sunny outdoors, we stuffed ourselves with the delicious guac and chips appetizer. It's a must order. \n\nThe remainder of the food - fish tacos, chicken roll thingies and shrimp tacos were very so-so. In addition, this place ain't cheap - when the bill came, we were surprised how high it was with the little amount of food we ordered. \n\nI recommend Arguello for a drink and gauc and chips on a nice day.", "author": "Irina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Fabulous place to eat. Great service after you place your order at the counter. Started getting busy right after we got there", "author": "Teri S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-18", "description": "This is a fancy Mexican restaurant right next to the Presido Officer's Club in SF. We decided to eat here right after a KQED event.  The food was just okay for fancy Mexican food. Service was a bit slow.", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-03", "description": "I take back my previous reviews for Arguello when they first opened... things have only gone downhill since then. \n\nThis is a beautiful location and restaurant with so. much. potential. that goes to waste with a boring menu and rude staff. I've been back twice since I first visited, and both experiences were awful -- long waits (40+ mins) for food, rude hostess (\"Is it okay to have a dog on the patio\" -- \"I don't know\" / \"Do you guys have wifi?\" -- \"I don't know\" -- uhh, you could find out? You work here?). \n\nTacos are really small and bland, meat quality is only so-so. In a city filled with outstanding latin american cuisine of all genres (Cuban, Mexican, El Salvadorean, etc) Arguello is way below par for a higher end restaurant (service, price vs. value) and way off on the flavors and portions for Mexican food. \n\nI want to spend my money at Arguello, I want to be a regular customer, and I want this to be a great restaurant. Get it together! We're here to support you, but your management/owners have atleast gotta try bringing something to the table other than beautiful decor.", "author": "Laura J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "I love the cocktails and the upscale mexican food. Yes, the food costs more than the local burrito shop but it is fresh delicious ingredients with a bit of a gourmet flair. It is so much tastier than the mexican restaurant that took over Beetlenut on Union. The atmosphere is great and they even have an outdoor patio.", "author": "Ann W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "We hosted my mom's memorial at the Officer's Club and the lunch was catered by Arguello. There were 30 of us and we did the taco bar family style. We had steak, pork, and shrimp tacos along with chips and guacamole. The food was amazing. So flavorful and the staff was attentive and efficient. Randalyn, the young woman coordinating or event, was also amazing. It was a great day and having excellent food made it that much better. I'll definitely be back.", "author": "Chelsea H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-01", "description": "Food - 3\nService - 2\nValue - 2\n\nWe came here because we were in the Presidio and needed a bite to eat before an afternoon of hiking around the area.  We got the pancakes, a fish taco, a shrimp taco and a carnitas taco.  The pancakes were a 4, but the tacos rated a 2.  Service was very inconsistent -- I felt only one of the staff truly cared about our dining experience, one was average and then the rest could have really cared less.  \n\nWhen I mentioned to a couple of people that they should consider getting toothpicks since carnitas will get stuck in people's teeth, there was no acknowledgement really.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "Lots of great things to say about this place, but I would give it five stars just for the passionfruit cheesecake alone. Or five star for the cocktails too, sorry can remember the names but trust the bartender. The cocktails were very tasty, refreshing and different. \nI really enjoyed the ambiance. The building and location are beautiful. Parking is easy and it is peaceful there. Nice to get away from the downtown hustle.", "author": "Trevis C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-03", "description": "It's a bummer that Traci Des Jardins honors her Mexican heritage with such a bland and mediocre restaurant.  i know that she can be a fabulous chef, but this place misses the mark.  Her other Mexican Restaurant, Mijita, is also not very good.  Her French influenced cooking is fabulous.", "author": "mi m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "The service, food and drinks were excellent.  Family friendly.  Attractive and inviting décor.  We'd definitely recommend it.", "author": "Marie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "My mentors and I have started a tradition of going to foodie type places and even though this isn't on par with places like Gary Danko, Kokkari, etc., we definitely had a great time. I was a little worried about coming here for dinner because 1) all the reviews were for brunch, 2) the reviews were super mixed (even though I've heard from others that this place was decent). We got there early and were seated right away. Our waiter, Chris, was super patient with us because we had a lot to catch up on but we ordered the brussel sprouts for an app even though it was a side. OMG- super delicious and with the pomegranent seeds they were even more amazing. \n\nWe all ordered different things: I ordered the chicken enchiladas. This was a risk for me because I'm not a fan of enchiladas but they came out to be really good with green sauce and a bit of kick to them. As an Indian girl, I love any kick to my entree so that was great. My friend/mentor got the squash and she LOVED, LOVED it. She was a little worried about the mushrooms (because she's not a fan) but she basically licked the plate and had all of us taste it (it was good but I'm not a lover of squash so that says something). My other mentor got the Beef cheek which ended up looking like pulled pork and tasted delicious- really soft and just great seasoning. As a table, we also ordered the squash and it was perfect because it came with three slices enough for one for each of us. \n\nWe were full but couldn't pass up dessert... so we had the tres leches cake- super moist, soft, and a good finisher to our meal. \n\nThe only \"gripe\" that I have is that it seems like the chef is a big fan of pomegranates and puts them on a lot of dishes. I'm a big fan of them so i didn't mind but if you don't like them, I can see someone getting annoyed by them. \n\nIt was a great dinner overall and I'm sad that so many people trash this place. My mentors/I had a fantabulous time and it was nice to be in the presidio and explore this area of town!", "author": "Rachana S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "Pros: Ease of parking, ambience, roomy feel inside, service\n\nOk: Drinks\n\nCons: Food.  We ordered 5 dishes for our group.  None of them were good.\n\nI'd probably never go back for food, but maybe for a few drinks.", "author": "Buddha B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-02", "description": "The location is great, and so are the cocktails. The pea empanadas set the bar high. However, they have the worst chilaquiles I have ever had.", "author": "Rebeca R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "We came to Arguello for a company happy hour and had a perfectly lovely time. Pickings are slim in the Presidio, but my Cuba Libre wasn't all ice, the guac was tasty, and our bowls of chips were continuously refilled. What more can you ask for at happy hour?", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Mexican food created with vision and panache in an exquisite historical setting next to the officers club in the Presidio ( the oldest building in San Francisco built in 1776) ~ the menu may be small but the standards in preparation, service & quality are of the highest level. Our server Eric was friendly, knowledgeable and fluent in Espanol ~ and provided us with exceptional service that enhanced our dinning experience. Ambiance, decor, service and delicious food make Arguello a must stop on the San Francisco culinary map.", "author": "Armando C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-15", "description": "My friend who lives part-time in the city had been wanting to try this place, and since we were walking around the Presidio, we chose it for lunch. First of all, I've never been to a Mexican restaurant where you have to pay for chips & salsa! $4.50 for a SMALL bowl of sort of thick, salty chips and 2 underwhelming salsas - 1 red & 1 green which we didn't even touch. We got a \"brunch\" menu even though it was Sat at noon. Sorry, in my world this is \"lunch.\" Their brunch menu was VERY limited and there just wasn't anything that appealed to me. I usually order shrimp fajitas or a cheese enchilada but they did not have either one of those things. What self-respecting Mexican establishment does not know how to make an enchilada? Hello! That is a staple of Mexican food. I ended up ordering a cheese quesadilla which was BLAND as hell. It was plain white cheese in a tortilla on a side plate and that's it folks. Cheddar would have been better and perhaps the chef could throw in a few finely chopped jalapeños or some diced green chiles. Get a little creative, why don't ya? My friend had avocado toast which looked pretty blah. She said the bread was \"nothing\" and the salad that came with it was ehhh. Basically, all she ate was the bacon on the salad. The waiter came over to ask how it was and she explained the above and all he could say was \"Sorry about that.\" You'd think he would have taken hers off the check, but nope. We paid over $50 for a very sub-par meal. Honestly, Taco Hell aka Bell would have been better. These people need to go to Javier's on Newport Coast and find out what a really OUTSTANDING Mexican restaurant is all about. I'd be surprised if this place makes it. Surely, there must be some good Mexican places in the Bay Area, but this ain't it people. Save your money and go elsewhere. Trust me on this one. The only reason I gave it two stars is because I like the wood beams on the ceiling.", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "The brunch here is soo delicious. We had the Chilaquiles topped with an egg. The sauce was a little spicy and the chips were still crisp. Banana pancakes were light and fluffy and whatever they mix with the maple syrup I could not get enough of. \nIf you like tequila this is your spot. Their tequila list is very extensive and the specialty cocktail list will make you want  to try them all. \nAll in all this will defiantly be one of my regular go to brunch spots.", "author": "Jenn E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-09", "description": "For happy hour/drinks this place is fine - but the food is not high quality and the menu is very limited. \n\nThe outdoor patio is nice outside and even better on a warm day - but just get a drink, dont go there for food.", "author": "christina b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-20", "description": "Fantastic ambiance.  Very average \"Mexican\" food and teeny portions.  We actually thought the waiter made a mistake with our order because we were certain there was no way what arrived was truly a lunch.  The place is a good stop if you want to kill some time, but it's nothing to write home about.", "author": "Sara O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-07", "description": "the setting is perfect and the staff friendly but Arguello is not only over priced, it is as Yelp's two star rating denotes: it's meh and i've had better. $23 for a couple of enchiladas that maybe rival the best of the frozen brand on the market is not a meal to die for. San Francisco is expensive but not everything is worth it; that includes the $9 for chips, salsa, and guacamole.", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-22", "description": "I didn't know about the extremely low rating until I had walked out - I was surprised, but looking back, I can understand where a 2.5 star rating comes from.  Small place when the outdoor patio area is closed (as it was), and a bit disorganized.   There's a line that snakes back from the bar where you order food and then sit down.  The signage could be better.  \n\nI was shocked as to how much everything cost, but you're paying a premium for eating Mexican food in the Presidio, and it was pretty tasty.  For ~$5 per taco, you get a good amount of meat (I ordered the carne asada and carnitas tacos, and my friend gave a good review on the fish taco).  We also got chips/salsa/guac, which was $6.50.  I think chips only were $4, and that's a 1 star deduction immediately.  \n\nAside: Restaurants, don't be stingy with the chips.  At a cheap dive, fine, limit the chips because your clientele can't afford that much, and they'll just fill up on chips.  At an expensive place like this, people can already afford the entire menu, so why charge a premium for something so cheap? Bad form. \n\nSo, overall disorganization, small portions and high prices, and good tasting food equals out to a 3 star experience.  I might come back for dinner at some point and revisit this review.", "author": "Ben K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "Delicious brunch, great service, best of class setting and location!\n\nOur group of thirteen arrived at the Arguello after a thrilling six mile glorious hike through the park. We were warmly greeted and seated in the Anza Room, a private dining room.  Service by Erik was prompt and attentive, and we were treated like visiting royalty.  The brunch menu is creative and redolent of old Mexico, and the food was simply delicious.  One favorite were the house made corn chips.  All of us in our party were truly impressed by the Arguello and I know we will be back in the future.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "The bartender named Matt is one of the most knowledgeable bartenders I've ever come across.\n\nVery classy establishment. The revival of The Officers Club is a great success.", "author": "Garrett H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "When it comes to this place, dont order a unique dish you have never heard of and expect some gigantic portion with a true Hispanic flair. This is San Francisco people. Go to the mission if you don't want a modern twist on your taco. \n\nFor a good spot to have some amazing margaritas that are perfectly strong, come to this place. They have a heated patio, good aray of food on the menu , and yes there are some pricy dishes but that's to be expected if you come to a beautiful restaurant like this. Do yourself a favor and order the SHRIMP TACOS! I  repeat....order the SHRIMP TACOS.... Best item on the menu hands down. Literally only come here for margaritas and tacos. Highly suggest you do the same yelpers, deffinatly worth the trip.", "author": "Alexis A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-21", "description": "Nice atmosphere, and that's all. Overpriced tacos were severely lacking in flavor. The bland salsa didn't help, no matter how much I used. To make things worse, they charged me BY THE OUNCE to add one shot of whiskey to my coke. It cost me $16 for a single shot (2 oz) of well whiskey. Worst food I've had in San Francisco.", "author": "Colby W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-30", "description": "I read the Yelp reviews and spoke to a few folks while on our Presidio hike.  Lukewarm reviews both written and verbal.  But we said lets give it a try and see for ourselves.  \n\nPros - located in the historic Presidio Officers Club; Traci des Jardins stellar rep; fast service once you place your order.\n\nCons - small portions; overpriced; no reservations; need to place your order at the bar.\n\nThe three of us ordered lunch - one carne asada taco, one carnitas taco, one mushroom quesadilla, one order of the jicama avocado salad, one order of chips with guacamole.  One ginger beer, one draft beer, and one Coke.  Total inc tax & tip $63.00.  Obviously we didn't order enough food.  Everyone should have two tacos each.  Who knew they were so tiny.  And the mushroom quesadilla was not your typical Mexican style one that can feed 2+.   This one was so small.  Like a teacup saucer.  With sautéed button mushrooms.  The least expensive type.  At $10.50.  Total ripoff.  \n\nThis place is to be avoided.  Felt like a tourist trap.   Was busy though.  Again it must be due to Traci's rep.  She needs to take a closer look and revamp.   I'll never eat here again or suggest to anyone.  \n\nWe felt we only had appetizers.  Not satisfying at all.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-11", "description": "Wow, quite disappointing.  Our server was delightful.   The food not so good.  The guac and chips were tasty.  I had the chicken enchiladas.   They were dry and lacking flavor and lacking cheese!!   The beet salad was also disappointing.   It was plated on some cement-like, flavorless mess.  The dinner menu didn't have the tacos I was hoping for nor did it have the churros.  We had a slice of chocolate cake that was dry.  Honestly a slice of Costco cake would have been much preferred.  I'm sad to write a poor review but this was just lousy and not cheap either.  Coffee was quite good.", "author": "Pauline C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-23", "description": "Ordered chips and taco appetizers - they came out in a few minutes but tasted like they had been previously frozen and thrown in grease to heat them up - very heavy, very little meat and full of grease.   Chips were ok.\n\nWe had been there for an hour and a half before we discovered our main entree had not been started which turns out was a good thing considering the quality of the appetizers.\n\nOur bill was $57.00 for grease taco snacks, a glass of wine and two cocktails.  \n\nDo yourself a favor and go somewhere else. \n\n-going to be hungry.", "author": "Jay W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-28", "description": "Over price, food does not have flavor. Service is slow. Charged me $2 extra for corn tortillas when the menu said it came with tortillas. Menu was small and confusing.", "author": "Robert G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-19", "description": "The hostess silvana was rude and unaccommodating, I would not recommend this place for a big group. They seated others before us that arrived after us, wouldn't put two tables together for us and made us wait a ridiculously long time despite not being full, I am particularly disappointed because we live so close and was hoping we could go here frequently.", "author": "Maria K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-04", "description": "Average food, you'll be paying for location and convenience. Nice location if you're in Presidio and need to eat, stat!  Food is good, but not great and service is good with friendly staff.  Place stays busy on weekends to accommodate tourists in the Presidio.  Nice outdoor seating with fire pit.", "author": "Shariq H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "I like the setting. I like the ambiance. I like the food. \n\nWe came here for weekend brunch and were happy that we could sit outside, enjoy the great weather and the casual vibe -- without the typical SF hassles related to parking and waiting lists. I had the  Papas Fritas ( 3 way cooked potatoes with a spicy sauce, chicharrones and a perfectly cooked egg on top). Delicious. My companion had huevos rancheros which she found to be a bit underwhelming. \n\nWe didn't try the cocktails but the seasonally inspired list looked interesting. Next time.", "author": "LH M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "We went to Arguello for brunch while on our regular walk through the Presidio. We read several reviews that were mixed at best but wanted to try it anyway given it's proximity to our home. We were pleasantly surprised by the great food and great service. We started with the chips and guac which were very good! We both had the taco plate - it came with two per person - one with shrimp and the other with cod. These were very good as well. We ate on the side patio and enjoyed the surrounding ambiance. Overall it was very good and we look forward to coming back to try the rest of the menu.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-30", "description": "Another reason why Yelp needs to create negative star options. Perhaps someone ought to erect a petition on moveon.org or change.org. Writing to Yelp may also get this rolling. \n\nRecently, I learned the Manager abused his authority and prioritized his personal feelings over his professional duties.  He created false accusations that I called him non-profane terms when I informed him his waiter was lagging and incompetent.  He then relayed these false accusations to his boss, Arguello's Owner or CEO.  In so doing, he banned me and a regular small crowd of people from ever making reservations at the restaurant or attending. \n\nEssentially, if you're looking for good food, decent to great service at reasonable (NOT wild) prices, look elsewhere.  If you dare speak up and demand the basic services every diner is entitled, prepare to suffer backlash or muzzle yourself.  I gather their prices reflect these facts.  Instead of rectifying their faulty services, they keep acting like grunts and charge higher prices to compensate for the disgust they render in diners--prospective, first-timers, regulars.", "author": "Honest J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-01", "description": "If you are looking for a pleasant spot for meeting some friends in the city, especially if anyone wants to walk around in a beautiful location first, this may fit the bill.  (Or after taking dogs to Chrissy Field!) The outside fire pit is fantastic to have a cocktail and chat. The margaritas tasted fresh and had a decent tequila for their house blend. Parking on a Saturday evening was effortless and free--which is certainly a rarity. The guacamole was fresh but pretty bland, as were the two salsas that were served. The habañero salsa at least brought some needed heat.  The chips were very good. I had the carnitas sopes appetizer ($12) as my meal, and they were tasty, with nice bits of carmelized meat.  Pretty small portion but not outside of expectation. The taco appetizer was also good, though the salsa it came with was again unexciting though fresh. Our friends all had the pork shoulder, which is clearly what is considered their best dish based on waiter recommendation. The presentation of a chunk of meat on one side of an otherwise empty plate, for $23, did not win me over. \nSo for the pricing I would like to see better presentation and more interesting seasoning. Otherwise I may return for apps and a drink or two, but there are many other restaurants with much better food with Mexican flavors.", "author": "Nancy E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "This place gets a 5-Star review for their bar and 4-star for the food, which is out of this world but expensive.\n\nLet's start with the bar - we tried a drink that was hit chocolate and homemade almond milk with some orange, a chili with a hint of smokiness and mescal. It was perfectly balanced and full of nuances. I have never had anything like it. I had the bar make me a non-alcoholic drink and it was the perfect mocktail. Different from anything I had ever had, not too sweet and utterly refreshing. The rest of their drink menu looked incredible and I highly recommend people come here to at least grab a drink. They are worth their $12 price tag. The bar staff are extremely friendly and I recommend sitting at the bar if for nothing else than for the chance to share a laugh with them. \n\nThe tortilla chips are homemade and thick; we got them with guacamole and salsa. The tomatillo salsa was amazing, the red salsa a bit to sweet for my liking. The amount of guacamole was healthy but I would have liked to have been able to add a bit of salt to it. The soup of the day, oxtail $12, plus the sopes ($14) plus chips were perfect for two people for dinner and all of it was very tasty. We didn't order any mains because $22 was a bit steep for the portion size, although they are trying to go for a more upscale crowd which is hard to with Mexican. The prices are higher than Nopalito, my benchmark for this kind of restaurant. However, we live in the Presidio and this is close to home, so we will certainly come again because taste wise, everything was stunning.", "author": "Kara A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "This review is for the bar as well as food at the bar. While I believe the food is a bit expensive if this were in a hotbed of other restaurants I know rent and locations in the Presidio have to increase their margin to stay afloat. It is a tricky business, this Presidio, for the stream of visitors is challenging to maintain. Without further ado onto the bar!\n\nThe barman was excellent. His knowledge of the booze at his disposal was excellent. He had created a hot alcoholic chocolate with Oaxacan flair and almond milk(for those who prefer their cocktails entirely bespoke they had indeed made the almond milk onsite). It was delicious. The compound whipped topping was astoundingly complex and delicious. I found myself making sure I metered my intake of it to ensure it lasted for the entire drink.\n\nMy fiancée grabbed a mocktail that he whipped up after asking about flavor preferences. It was tasty, only a tiny bit sweetened, and the color was an impressive shade of purple.\n\nWe thought the food was delicious. Their tortilla chips are stout: thick, greasy enough, and the overbearing salt crystallization I have seen at some places was delightfully absent. Their tomatillo salsa is delicious. It is not spicy, it simply showcases the flavor of the tomatillo. A big win. The guacamole is fine. Not a showstopper, but certainly fresh and the presentation was nice. It was easy to extract with the chips, and as a borderline glutton this is a key feature I look for in a serving dish. \n\nWe ordered the carnitas sopes, which were nice and fresh, but did lack a bit of pizazz from the corn sopes upon which the fresh radish, avocado, and beans were served. They were great texturally but were missing something that would have made it an extroardinary dish. The carnitas was lean and delicious.\n\nThe soup of the evening was an oxtail soup. Referred to as gallinas but was not actually chicken which the barman explained was the origin of it coming from working class kitchens where oxtail was a more common ingredient. It was as he had explained: savory, flavorful, but not a rich and overpowering dish. The mix of herbs and cabbage on top made a great addition and added a fair bit of complexity and flavor. The oxtail near was delightful, tender, and served on the bone.\n\nAs a resident of the Presidio and a fan of Mexican cuisine of all sorts Arguello is a welcome addition to the main post area. I understand that it may lack some finer dining features gourmands in the Bay Area may expect but I found that the charm for me was the bar. I found the drinks the staff created to be unique, complex, and satisfying to my palette. If choosing between a two top seating and bar I would choose bar every time. Certainly worth the experience.", "author": "James T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "Absolutely cannot fathom why their rating is so low. The food was AWESOME! Okay, so maybe not cheap but you get what you pay for. Two entrees an appetizer and two margaritas each for around $100 in SF is not bad at all! Randomly went here twice in a week and it did not disappoint. The first time we sat at the bar and ordered; margaritas, plantains, taquitos, ?corn-cheese-salsa?, and homemade guacamole. Everything we ordered was delicious and I can tell you as someone who grew up in California and has eaten killer Mexican food all her life, arguello nailed it! Second time around we sat at a table and ordered mezcal margaritas, nachos, and drunken chicken. Again, they did not disappoint. The food was so fresh and delectable and the service was impeccable. I can't wait to go back and order the snapper and try the chicken enchiladas, all which looked divine. The service we experienced at the bar and in the dining was top notch! I only wish I remembered the names of the the lovely ladies who helped us so I could give them a proper shout out. Perhaps arguello had a rough start in the beginning, hence the low rating, but I promise you won't be disappointed visiting this wonderful establishment.", "author": "stephanie c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-03", "description": "Way overpriced for this quality of food. Actually the food quality might not fit any price point. Over cooked shrimp, greasy rice. The salsas and guacamole came to the table ice cold; they obviously just pulled them from a refrigerator. (read: not fresh!)\n\nSeriously, a coupe of drinks, chips and cold salsa, cold guac, and a shared (meh) entree was over $70.\n\nService was not great. Seemed like a young, untrained staff. They forgot things and didn't bring items in the right sequence.\n\nOn par with prices, service and food quality of an average tourist trap.\n\nThe whole concept was to honor the historical, Mexican connection to the Presidio. Missed by a mile.", "author": "Shane G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "My favorite Mexican restaurant on the bay area hands down. Very professional team, excellent bartender and amazing food", "author": "Paulo F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "We had a thoroughly delightful brunch at Arguello. Our group of 10 tried most of the menu items. All were very good with a few falling into the category of deliciously superb. The sweet potato hash was loaded with a huge pile of perfectly prepared carnitas. The carnitas were surrounded by cubes of sweet potatos and rajas and epazote. As much as I would love to try some of the other offerings, there no question I'll order the hash on my next visit.  Service was professional and prompt.", "author": "M M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-09", "description": "Just went to Arguello and really  I expected more. It has a small menu and it is a small dining area. You order at the counter and they bring your food to you. Shrimp tacos were good, be advised, you get ONE. It is a bit overpriced for that. It was too chilly to sit outside, but on a nice day, quite lovely. Overall, 4 stars for the margaritas, but I would not make a special trip to eat here again.", "author": "Mary D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "My friends and I were originally planning to head over to the Commissary in the Presidio at 4pm but upon arriving they did not open up until 5pm and it was recommended that the Arguello was open for drinks and bar bites. So we headed on over.\n\nWhat an amazing happening place in the Presidio!  The Presidio is in need of venues such as Arguello!  Gorgeous restaurant and patio area!  It certainly was a beautiful day to sit on the patio with good friends and have great drinks!  \n\nWhat made our visit especially special, was Enrique!  He absolutely makes Arguello come to life with his experience and utmost professionalism with a bit of sassiness to boot! With myself being in the hospitality industry for 15 years, it's wonderful to meet good people like Enrique!\n\nWhat makes me come back to places is not necessarily the food these days but the Exceptional Customer Service Experience and Enrique has it all!  I would highly recommend anyone who is visiting the San Fran area and strolling into the Presidio to check out Arguello!  A MUST in my BOOK!", "author": "Alison M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-27", "description": "I should have know we were in trouble when we walked in and the host said \"what's going on?\" When we said we wanted a table for two we were then asked rudely \"are you going to eat?\" Um no I came in here for giggles. \n\nThe food was decent but pricey. The brunch menu did not offer tons of options. They have an extremely limited choice of beverage that are nonalcoholic and no diet soda of any type at all.  The service to the table was adequate but honest the host was so off- putting I will not go back.\n\nThe next time I am in the are and hungry I would have a better experience walking down the street to the Disney museum cafe.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-14", "description": "We returned again to Arguello this month, and we're disappointed to see that there weren't many changes to the flavors and quality. A bit blah. Even the guacamole was still meh. We ordered the watermelon and jicama salad. It was okay but lacked zip.\n\nOn the upside, the margaritas remain a-mazing, the service was great, and the chips were tasty, and the corn on the cob had good toppings. \n\nI would recommend this pace for chips/salsa and margaritas. \n\nSUCH a great space and tons of parking. I'm really rooting for this restaurant. We'll give it another go in another few months. Maybe focus groups would help to suss out what's not working?", "author": "Bing B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-08", "description": "So much potential - location, indoor and outdoor decor - but soo disappointing! Absolutely tasteless and expensive food, and every other item on the menu is fried (including the chips). I had to keep asking for clarification of each appetizer to see if it was fried (and 5 times, the answer was yes).\n\nMy friend and I ordered the chard and corn enchilada plato ($19), thinking we could share it, and what came out were two small, ridiculously bland enchiladas with a side of rice and refried beans.\n\nThe melon arugula salad also had zero taste, and wasn't as much a salad as it was a bowl of fruit with 2-3 sprigs of arugula thrown on top. \n\nOnly redeeming quality: good cocktails.\n\nReally wanted to like this place, but definitely will not be coming back until a new chef comes along.", "author": "Katie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "I'm shocked at the low star rating here; not our experience at all...\n\nWhen Bautista established the Presidio in 1776 he could not have possibly imagined the new Officer's Club let alone the public restaurant tucked on the west side of the building - Arguello.\n\n\"Experience a new restaurant located inside the Presidio Officers' Club offered by the Presidio Trust and award-winning chef Traci Des Jardins. Arguello features Mexican food and drink.\" Their Web Page Quote\n\nWe venture to the City every once in a while to experience some of the best places to eat in the world. Arguello is one of the rare finds tucked away where many would not think to venture, next to the Officer's Club - really? You bet really, Arguello's has an abundance of parking (very rare in the City).\n\nGet out of your car or taxi and smell the ocean air, take a minute and sit in a bench in front of the Club and enjoy a view of the Bay to Angel Island and beyond. Once you have soaked up the ambiance of the Presidio and the Bay head a little bit west and turn right to see large wooden gates leading into a decorative patio with a fire burning, chairs with blankets if it gets cool and a tortilla station where house made treats await you inside.\n\nFor some reason Arguello was not crowded this Saturday evening so we were able to sit at their Tequila Bar. I ordered a soda water with a splash of house made orange bitters. Their selection of craft bitters is very interesting and worth exploring if you aren't into liquor, wine or beer at the moment. The rest of our party ordered beer and Margarita's, reporting they were excellent. The bartenders are engaging and humorous which always makes for an enjoyable experience.\n\nWe were seated promptly with a view of the patio and our server Thomas was right on top of us with reorders of drinks. By the way Thomas, it is a pet peeve of mine when well into our conversation and enjoyment of libations that the server never asks if we would like another round; good job Thomas as you came around several times and asked. Thank you, your service was excellent.\n\nWe began with sides of Frijole Rosas, Salsa, house made chips, a green and red dipping sauce and guacamole - well done and presented in pottery befitting of the restaurant's style. Yummy stuff!\n\nThe Entrees\n\nwhole shrimp al ajillo, cilantro rice: my guest reported this to be excellent.\ncaramelized pork shoulder, orange-serrano 'pico de gallo', cabbage salad: if you want the best-of-the-best on the menu ask the Maître d', this is what I had to order and it was delicious. The meat was cooked to perfection, served floating in a mildly spiced sauce and ceramic bowl giving you the feel of being in San Miguel de Allende feasting on Mama's cooking. The cilantro cabbage slaw was cooling and a much welcomed side to this dish.\n\nchicken taquitos: my wife reported average, would order the pork shoulder or whole shrimp if she had it to do over again\n\nlittle green salads: my guests reported okay, both are watching their waste lines, so...\n\nPresidio Arguello is a hidden gem IMHO, a solid four stars IMHO", "author": "Gary J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-01", "description": "We were excited to try Arguello, mostly because we love Mexican food but also because we imagined that it would be a nice place to walk to on a sunny day.  \n\nWe went for lunch on a Friday (TGIF!).  \n\nLet me just boil it down to this.  With its current state of operations, Arguello will be out of business within a year.   While we were on the property, our comments were the following:\n\n\"Where do we order?  Oh, over there where that big line is.\"\n(....thoughts of how awkward this place would be on a date)\n\n\"Why can't they get their 'order at the counter' operations to be efficient, like they do at the Grove?\" (....thoughts of delicious breakfast burrito at the Grove and that I would be going there next time)\n\n\"The meat in my tacos tastes like it wasn't seasoned.  This salsa is good.  Is your guacamole good?  No?  Oh, its 'just okay'?  Remember those great tacos we had at Mamacita?\" (....thoughts of delicious tacos and guacamole at Mamacita and that I would be going there next time)\n\n\"I think those people just got annoyed by the line and left.\" (....thoughts of the rowdy, fun-loving crowd at Tia Margarita..... and that I would be going there next time)\n\nThe place has a ton of potential but they have multiple problems, including the setup, the service (nice people but all overwhelmed by the problematic setup), and the food wasn't good.  As in, we definitely won't be going back or telling anyone else to go there.  F.", "author": "Holly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-23", "description": "Great place to enjoy beautiful views, good food and pleasant", "author": "Natasha K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "Came here for brunch on Saturday all by my lonesome. Thought it'd end up being a boring brunch but thanks to the great staff, it was one of the best brunches ever!\n\nSat at the bar and received excellent service from Carla, Nate, and Thomas. Ordered up some drinks which were all excellent and made my Saturday so much more pleasurable. For food, ordered the huevos and some chips, salsa, and guacamole which satisfied my tummy :)\n\nOverall - Whole staff was warm and welcoming and made my time there memorable. Food was amazing. Will definitely be coming in again soon!", "author": "Krizia O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-06", "description": "I've eaten here 4 times now.\nThe good is that their chips are crispy and some of the best I've had. And their house margarita is strong and has a smokey sweet flavor. Quite good.\n\nThe bad is that they just don't have their sh*t together. Long waits when more than half the tables are empty- no I asked, most are not reserved.\nInefficient and rude staff. I was here on 4/2 for my bday and they are just not accommodating. To add to this the waiter thought we short changed him which we did not. \nI LOVE Mexican food. All kinds. But this menu is very limited and the portions are very small. \nSorry I won't be coming back. Too many other excellent Mexican food restaurants with better service, and a more appealing menu. In the marina alone which is the closest neighborhood they have 3-4 really quality, fun and friendly full sit down Mexican food restaurants. \nThe owners need to close, fire the chef and staff and reinvent themselves fast!", "author": "Jon D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-12", "description": "Three of us had lunch here today. Big mistake! I will start off by saying that I think Traci des Jardins is spreading herself too thin. A month or so ago, a friend and I had lunch at Commisary which was very disappointing - so-so food and amateur service.  So, bravely, we did lunch at Arguello.  First of all, the young lady taking orders set me off by telling me to  \"stand over there, not here\" to place my order! My response was, \"sorry, but no one gave me an instruction booklet when I walked in\". \n\nAnyway, we ordered and since it was a beautiful day, I spotted a shady table in the patio so could dine outside. We walked out and the table was dirty! It was obvious that it was not cleaned up after the diners who had just been there. The dishes had been cleared but the table had not been wiped down. So we sat inside.\n\nThe orders came -  one.  at.  a.  time. I was  done eating my first taco before the 3rd person at our table was served! The food was very bland and almost tasteless and luke warm. My fish taco was about a 4 inch taco with a piece of battered deep fried fish on it the size of my thumb. We all had the fish taco and we all decided that it cried out for salt, even though non of us are major salt eaters. My carne asada taco had 3 small strips of beef. They were tasty but after 3 bites, it was all gone. \n\nTraci (may I address you by your first name even though we have not met?) get your self over there and start cracking the whip. Get some professionalism imbued in your people there, increase the size of your portions and make the food tasty. $4.50 for a fish taco that is about 3 bites is not a good value. As for flavor, I can think of several Mexican restaurants in the Mission District that have delicious food and reasonably priced. Get with it, Traci !!", "author": "Tom B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-24", "description": "This is my first Yelp review, and I hate the fact that it is negative in nature, because I am not a negative person.  My husband and I were staying at the Inn at the Presidio, so we thought Arguello would be convenient as it is just a short walk down Moraga.  The decor is very nice, but that's about the only positive thing I can say.  We were seated quickly, and ordered a glass of wine, two cocktails, one taco appetizer to share and chips and salsa.  We also ordered our main entree at the same time.  \n\nAppetizers came out pretty quickly, and the chips were just so-so, a little greasy.  The 5 little tacos were tiny, hard fried and greasy, with barely any meat in them.  The bowl of chips was small, and the salsa portions were tiny.  \n\nAfter about an hour and a half, we found out that the kitchen had not even started our entree, and there were only about 5 tables left in the restaurant at that point.  We cancelled the entree order, paid our $57 bill and left.  We definitely felt like the stereotypical \"trapped tourists\".   It's a shame that a location like the historical Presidio Officers Club is not being honored with a good restaurant.  Time to call in Chef Ramsey.", "author": "Mary K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-20", "description": "Great Mexican food can be had elsewhere.  I had the tongue, and when I ordered it I thought \"that's pretty brave to have tongue on your menu\"  They must know how to prepare it well,  It was bland and hard.  Take that tongue off the menu.\n\nPrices are too high for the boring food. Good Mexican food should be complex and interesting with flavor.  This place misses the mark.  I would be willing to pay the price if the food was awesome, but it's not.  Either improve the quality of the food to match the price, or lower the prices to match the quality.", "author": "Naomi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "Stopped in for lunch here and it was delicious! Had the pozole and an order of chips, guac and salsas. One or the other would have been a filling lunch! The pozole was super flavorful and the guacamole was the best I've had at a restaurant in quite a while. Just enough spiciness added in to make it delicious! Am looking forward to trying dinner and brunch here.", "author": "Isla F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-29", "description": "Arguello doesn't take reservations. At all. Alright, fine we'll show up a little early on a Friday night and grab a drink at the bar while we wait.\n\nWe showed up by 6:30, there were a few tables open, lots of people waiting to be seated so we went to the bar. Luckily there was 1 stool available for me to sit, but unfortunately it was located right behind a huge column that is towards the end of the bar, which made it hard for staff to see that I was eager to order a margarita. \n\nI noticed that a long line was forming at the other end of the bar to order drinks, which I found unusual because I've never seen that before. Usually you just flag a bartender down wherever you can. After about 25 min of waiting, we were able to order our drinks.\n\nLong story short, service is very slow and unorganized. We ended up sitting at the bar for dinner, as the seat next to me opened up and the host never called our name to be seated. \n\nOne thing I did appreciate was how fast our food came out once we ordered it. However, please don't roll the tortillas in that paper! Mine stuck to the paper and pieces of it flaked off and stuck to the paper...sigh.\n\nThe food is alright, good but not Nopalito good (sorry but it's true), which means it's overpriced. Nopalito doesn't take reservations either but somehow they have their act together.", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-15", "description": "1-star for being open at 3pm on Sunday. And 1-star for decent chips and guacamole.\n\nAll the rest of the food was pretty much the definition of \"meh.\" And the service was  terrible. We ordered 3 huevos rancheros, with one of them vegetarian. They came out all vegetarian, and the waiter asked one person at the table to \"taste them all\" to figure out if they were the same or different. They were all the same, but when he asked the kitchen, they lied and said that two had meat.\n\nThe pitcher of margaritas was also a bad deal - more like 3.5 than 4 glasses, even with a lot of ice. Also lipstick on glasses and a chipped bowl for the baby. No thanks!", "author": "Jess W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "We celebrated Mother's Day here and it was such a nice treat.  Everyone agreed that the space is beautiful and the food is tasty and clean.  My father in law is from Mexico and requested we come here because the chilaquiles were the best he ever had.  I think the guacamole and chips are enough to make you quite happy.  Beautiful space, yummy food, family friendly.", "author": "L. P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "I have a hard time understanding negative reviews for this place. We came on a REALLY sunny and beautiful Saturday for lunch. There was a wait, but we really enjoyed ourselves with a drink at the bar, and the bartender was so cute and fun.\n\nI wanted to order the shrimp tacos but they were out... but I wasn't really disappointed or surprised because it was really packed there on such a nice day, and they had a lot of other great menu items I wanted to try. I got the taquitos and they were great.\n\nThis is a nice Mexican restaurant with great décor and a friendly staff. Will definitely be coming back!", "author": "Alexandra W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-17", "description": "I never write reviews, but this meal was so incredibly bad I feel the need to warn you all- my husband and I could not think of any worse restaurant experience though we eat out very often. We concluded that it is truly the most disgusting meal we have ever been served. \n\nAfter not being able to get into Commissary, we tried Arguello. Chips, salsa and guacamole were edible, but not great. Then things got really bad- the mushroom quesadillas were cold, salty, and the home made tortillas were dry and flavorless. It is also a very small portion (though so gross we would not have eaten anymore) served on a large plate- presentation on everything is bad- salsa bowls so small you can not dip your tortilla chip (which were greasy and bland). We had a side of beans that were also terribly salty (I tend to like a lot of salt, but across the board everything was too salty and lacking any depth of flavor or balance. ) Next came the little gem salad- how is it possible to screw up such a simple salad? Again salty, needing acid. The radishes were limp. \n\nThe grand finale was the roasted squash plato. Inedible, swampy over cooked squash in a watery base with the worst tortilla I've ever had. One bite was enough to get our check and go. \n\nTraci De Jardins should be horrified to be associated with this place. The team there desperately needs to go to Mexico for some inspiration. Or go to any good taqueria or to Tacolicious", "author": "Louise H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "The tortilla chips are homemade and delicious! As a vegetarian I found so many food options that were amazing! Melon salad and enchiladas were my favorite. The staff was kind and friendly. Offered to make other dishes vegetarian as well. Beautiful atmosphere and vibe!", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "My husband, my son, and I had a truly delicious brunch at Arguello a couple Saturday's ago. We shared the sweet potato & carnitas with a poached egg and the chilaquiles. They were both outstanding and plentiful. Easy enough for  another person. We also had a boozy cold brew cocktail that was so good I'm trying to figure out how to make it myself. The location is really beautiful including the restaurant and the museum within the club. We're definitely coming back.", "author": "Cecilia T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-28", "description": "Arrived with our baby for dinner at 4:57.  The host suggested that we grab a drink at the bar, because they don't start seating until 5... Ok, fine.  We order drinks, turn around, and there is a LINE to sit down, and 80% of the tables are already full!   We then had to wait in line and snagged the last table.  A heads-up by the host would have been helpful, since we would have waited 3 minutes for a table, rather than chance it at the bar, per his suggestion!!  Service was slow, probably because we were seated last...   2 hours later, we finally left with a screaming and tired baby in tow.\n\nMargaritas were served in a tiny glass and weren't even filled to the top (they were 3/4 full)!  Tasty, but tiny.  Food was mediocre at best.  Shrimp dish was served with the shell on, and no discard bowl... A better description on the menu would have been helpful, because I would have avoided the shrimp, had I known that my fingers would smell the entire night.  No kids menu, despite one being advertised on their website.", "author": "Marilee S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-18", "description": "I recently had lunch at Arguello and arrived around 12:30pm.  I thought this was an order from your table restaurant, but instead you get your own seat and then stand in line to order from the side of the bar.\n\nAfter placing my order (for 2 people) which was two tacos, a salad, a quesadilla, coke, and juice, it took the servers 10 minutes to even bring out our drinks. The server fumbled my coke and some of the soda spilled on the floor.  So he left the juice and said he would be back with a new coke.  10 minutes later he came back with the same bottle of coke he dropped (it was just over half full since he spilled it on the floor) and proceeded to tell me it didn't fall on the floor so he was just giving me the bottle back.  I obviously told him to get me a new full bottle, which took him 5 more minutes.\n\nWhile this soda debacle was going on, some of our food arrived.  However, my quesadilla was not delivered. I waited about 10 minutes and asked where the rest of our order was.  The lady at the register said it wasn't her issue, but she would go ask the kitchen.  After 5 minutes of talking to the kitchen and server, she came back and said it's on its way.  About 8 minutes later it arrived at the table, but the person that came with me had already completed their meal since it took forever for my food to arrive.  \n\nIt's important to note that in-between all this time it took to get my soda and food the bartender and server were basically chit chatting behind the bar, cursing, and not really doing much of anything.  It should have literally taken the server 30 seconds to grab me a new bottle of coke, open it, and walk it to my table.\n\nThe quesadilla was very small, maybe 4 inches in diameter, but it costs almost $11!!!!  Definitely not worth the price, but it was good.\n\nI give this place 2 stars entirely based upon the extremely poor service.  The food for lunch is OK, nothing special and definitely nothing that would make me want to go there for lunch again.  I may try dinner, but if I have to stand in line to order food from the bar for dinner I will not stay.", "author": "William B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-15", "description": "Very good food. Very. Good. Food. But restaurant is not only about food.\nThere are a lot of small things that I value and this restaurant do not have them.\n1. They serve only \"coffee\", no latte, espresso of cappuccino. Shame on you!\n2. They have breakfast in the morning but they do not have option of coffee and dessert. They suggested popsicles for us as a dessert. Seriously?\n3. In the dinner time their beautiful outside area is only for guacamole and drinks, not for dinner, very sad.\n4. Long waiting for every meal. We came with toddler and it was tough to sit through dinner.", "author": "Tatiana A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "Surprisingly great brunch!! The reviews here would indicate that if you come for anything other than brunch this spot may not be the best. But for my one and only experience here I was shocked this place didn't have 4.5 or more stars as the food quality was great and the service was fine (and I'm picky with the quality of Mexican / Latin food that I eat).", "author": "Art W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-23", "description": "Came here on Friday night with another couple. No idea that it had opened in the Presidio! Restaurant itself is pretty cute - you walk through the back patio that has a fire pit and plenty of blankets for those that want to dine out back.  We walk into the restaurant and check in with the host to put our name down for about a 30 minute wait.  \n\nWe are finally seated and decide to order the pitcher of margaritas, mushroom quesadilla and chicken taquitos. Of the two appetizers we all really enjoyed the chicken taquitos and thought the mushroom quesadilla was just alright.  For the mains we had the shrimp dish and pork carnitas.  I really enjoyed the shrimp dish (full head and shells on) however it was quite salty. My hubby enjoyed the carnitas as well.  For dessert we all shared the rice pudding type of dish and churros.  \n\nOverall the food was just okay - a few comments that we all had dining. \n- taquitos only come in 3. We asked that a fourth be added so everyone had one and our server just said they are only made in threes.  Huh? \n- chips and salsa - should always be complimentary! I mean how much does it cost to offer chips and salsa to customers!?! \n- such a long wait between the appetizer course and our mains.  I mean a really long time.  We didn't complain as our server let us know and they did comp us dessert.  \n- margarita pitcher was $40! I thought that was a little steep in price.  Our group was not impressed with them either. \n\nOverall our waiter was great but the above points do not make me want to come back anytime soon.", "author": "Julie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "food is excellent-fish tacos, their overall take on fresh, local ingredients with a cal twist on Mexican cuisine.  Service has also been excellent, on my two visits.  Like the space, too-but wish the kitchen stayed open past 9.", "author": "Don T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-11", "description": "One of the worst service experiences of dining out in years. We went for dinner the week after it's grand opening and clearly they had not worked out any of the major kinks in food service. \n\nThe Hostess was probably one of the worst I've ever dealt with. After taking our number to call us when our table was ready, we informed her that we were going to grab a drink and sit on the patio until our table was available. After grabbing a drink, we sat directly outside the door about 10 feet away from her for 45 minutes. After 50 minutes went by, I went up to her and asked how much longer the wait would be. She then proceeded to tell me that they gave our table away because we didn't answer the phone when she called. \"We have a ten minute grace period. Sorry.\" WHAT! ARE YOU KIDDING ME? I was looking at you through the door the entire time. I'm sorry, either that is just ignorant or plain lazy to not walk 10 feet and tell the patron their table is ready after being told. \n\nAnother highly irritating experience I had was with their bartender when we went to order a drink to wait. My friend and I both ordered a glass of wine. Instead of a standard 4 to 5oz pour, he served us nothing more than 2.5oz. I was in disbelief when he gave them to us and charged $24 total. I don't know what kind of establishment they are running over there, but clearly ripping people off is high on their priority list. \n\nAfter the seriously frustrating series of events that transpired, we walked out of the restaurant and went to The Presidio Social Club down the street. Thank God there is one well run Presidio restaurant with great customer service and amazing food. \n\nDon''t waste your time or money on this place. They have A LOT of work to do. \n\nFriends of mine even went last week and told us it was pretty awful.", "author": "Simone L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-20", "description": "Another Traci Des Jardins disappointment! I'm not sure why I keep trying her restaurants. They continue to disappoint. Maybe it is because I loved Rubicon when it was around and had an OK meal at Jardinière. But the food at all of her other restaurants is just plain bland.\n\nI was especially shocked when I went to Arguello. I ordered the chicken taquitos for $10. What came out was 3 taquitos with a bit of bland green sauce and sprinkles of bland white cheese (that's it!). They tasted and looked just like the frozen ones that you can get at Trader Joe's or Costco. I couldn't believe they have the gall to charge $10 for these. To top it off, I asked the waitress for some salsa or hot sauce to give them some flavor (because they were so bland) and she told me there is a surcharge for any hot sauce. I can't believe I just paid $10 for 3 taquitos with no flavor, and now you want to charge me more to finally add some flavor.\n\nI seems that a lot of other people have the same view as the restaurant was only 1/2 full for brunch while all the nearby restaurants had a line out the door at the same time.\n\nNever again - I give up on TDJ restaurants.\n\nAs an aside, it is a beautiful space and location. Hopefully someone else will move in there and start serving some flavorful Mexican food. There is a ton of demand for good Mexican food in the area.", "author": "Mary W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-15", "description": "I'll give them 2 stars instead of 1 in hope that it'll get better.\n\nThe menu is seriously limited, and seriously overpriced. Four entrees? That's it? $3.5 for chips and salsa that's free everywhere else?\n\nThe food was good, I don't care about authenticity, I just want well-prepared food, and the snapper I had was delish. So were the overpriced chips, about which we were told there was only \"one free refill\" on the chips. Not the salsa of course, that was another $1.5 for more. That was the main problem with Arguello: small carefully controlled portions that make it oh-so-obvious that they're about pinching pennies and not about your dining experience.\n\nAnd it was virtually empty yet still really noisy, I can't imagine what it's like on a full night!", "author": "Rob C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-25", "description": "Bland bland bland.  The food here is not seasoned, spiced, or Mexican, Spanish, or adventurous.  One thing it is is overpriced.  \nOur table tried enough to get a spherical view of the menu, and everything needed something- some kind of help.  Did I mention that the food here is bland?  We all left feeling incomplete and ripped off. \n\nWhen we showed up and got a table, we asked for a highchair and were told there were no highchairs available.  We dealt with it and the kid squirmed in my wife's lap. FIVE MINUTES later I see her bringing a highchair in and set it down around the corner.  It wasn't passed to another table with toddlers, it was put away.  I stared at it and wondered why she didn't offer it to anyone of the numerous families with toddlers.  My goodness- In San Francisco you live an alternative lifestyle if you have children.", "author": "Sam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "It's a few days old, so ignore the cranky Yelpers sniping a place that is still dealing with a brand new baby and figuring out operations. The people that go to a brand new place to review it negatively must live miserable, lonely lives.\n\nOne of the most beautiful rooms I've ever been in, inside the San Francisco city limits.  It's immediately one of my favorite places in the entire Bay Area.\n\nThe bar is beautiful and has about 50 tequilas. You can watch them make tortillas.\n\nThe food is so fresh. The tortillas made on the spot. The sauces don't carry too much heat, but therly are some of the most delicious sauces I've ever had my life. Like the new trend, you pay for the servong of chips, but it's a gigantic amount, freshly made (oil dripping), and more than worth it. All the food we sampled was delicious from some of the appetizers to all the tacos, there isn't a complaint to be had.  What's more.... I know I'm going to be back again and again and again and again. It's rare that I know I have a new regular spot within seconds of entering and experiencing the place. But the atmosphere, the history, the art, Andy Goldsworthy art piece out back, it's just amazing. Oh yeah, Tracy's food is unbelievable as well.\n\nAlso, more about the building:\n\nAn unbelievably special building, I encourage everyone anywhere near the Presidio to check it out. They just nailed historic preservation and its presentation to visitors. The Presidio Trust, the historic architects, the general contractor, and everyone involved should be really proud. It's stunning.  The art, on top of the museum displays, is absolutely stunning.  I was absolutely emotional and blown away going through the building.\n\nThe building itself was restored with such loving care it reminds me of a Smithsonian West, really nailing the museum quality, and is deeply relevent to our city's history. It's just stunning addition to the United States, let alone the city of San Francisco, or Presidio. It is bigger than just \"us\".... This is a shining light for the United States to actually get history right, for once. \n\nPeter McIntyre:\n\"I have no doubt that architecture is the highest form of art that we could possibly have. And any architect that manages to build a worthwhile building has my absolute admiration because I know really how much he or she must have gone through to actually design that building.\" \n\nI've really loved the 140 New Montgomery project, and the job they did there was magnificent. \n\nBut, it's true, that I haven't felt so unhinged with emotion in relating to a building as \"experience\" as I have with the Officer's Club. Not in a long time.  It just kept peeling back new moments, with unexpected depth. The new Goldsworthy is stunning. It's just so amazing... we are all ending up immersed, totally steeped, in one of the greatest cultural sites in America at this intersection of history, architecture, art, and interpreting all of that.  The 40 feet of 100's years of history, interpreted in the front museum room, was just spectacular.  Arguello is totally jaw dropping... best room in the city!\n\nNow, for some fun & perspective on people that don't \"get it\".... Here are 1 star Yelp reviews of National Parks over beautiful pictures:\nhttp://imgur.com/gallery/bwsrB", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-13", "description": "There is nothing to be impressed about here, so I have to chime in as any 5-star review is probably left by their friends and family.  \n\nFirst what was great -- patio, ambiance, wine and beer menu.  Greatness ends.\n\nSimply, any cantina in the Mission stomps this place.  Actually, any Mexican restaurant in the city limits will give them a run.  $106 for 3 adults and 2 kids.  And hungry afterwards. \n\nService was horrific.  Yes, they have been opened only a few days, but there's no excuse for tables to go un-bussed for 10-20 minutes with a 45 minute seating wait time.  Eventually I think the Manager bussed the tables -- he wasn't doing much actually, so good thing.  They must have a \"system\" -- wait person takes order, then 2-4 other people serve the dishes.  If they remember what you ordered.  Wrong beer.  No appetizer.  Food comes cold.  Or not at all.  Various people coming to your table with confused instructions and wrong dishes.  Did you order this?  No.  Did you order that?  Nope.  Oh well.\n\nNow a word about quality -- and quantity.  I don't expect gourmet micro-dishes from any Mexican restaurant.  \"Platos\" were tiny, itty-bitty.  Did not come with the corn tortillas as advertised on the menu (they \"forgot\").   Pollo Chile Verde was a leg and a thigh -- disappointing for $15.  The caramelized pork shoulder was terrific -- but cold, and a very small portion for $18.  Kids menu burrito was mostly tortilla -- kid was not happy.  Adults and kids hungry and $100 poorer.", "author": "Enrich S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-05", "description": "OK this place is starting to grow on me. The food is still not spectacular and requires a bit of punching up but I keep going back for the drinks. The bar is excellent. Enrique and Andi are a perfect blend of attentiveness, friendliness, and unintrussive. Can't beat the ambience. This place is still a bit new and working out the kinks, but I look forward to see how it grows.", "author": "Matt A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-24", "description": "We dropped in on a Sunday by chance as we were looking to the Andy Goldsworthy Mudball sculpture( I'm a big Goldsworthy fan) after seeing Tree Fall. \n\nI liked my margarita (the classic, too much lime for my husband's taste but that is the way I prefer them.  I had the fish taco and side of beans, The taco is on the small side but I was happy with the flavor. My husband had the burrito. It was also on the small side. You definitely need to order sides. Also they did not have flan or any other dessert.  For the price I would like a bit more food.  \n\nThe place is beautiful though.", "author": "Cynthia G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "Disappointing based on all of the hype and the amazing location! Went for lunch. Didn't know that there was no table service until getting there. Had to order at the bar and it wasn't clear what you needed to do until we asked. \n\nThe lunch menu is limited. I ordered the mushroom quesadilla and my friend had two different tacos plus we each had the jicama salad. The quesadilla was very small but good. The jicama salad was more generous in size and good. Was surprised that they didn't have Diet Coke which is a staple while eating Mexican food. \n\nThe place was nice but definitely not as nice as I had expected. I really think it's way overpriced for the quantity and the service was mediocre. The location is fantastic and I'm very surprised that this is the type of restaurant that went into this historic San Francisco location. If something doesn't change, I'lll be surprised if it survives.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-03", "description": "Arguello was an interesting experience - cool setting in the Presidio within an indoor national park, great décor, nice outside eating area available for a warm day and quite spacious. Service was attentive, though not terribly warm. We were never offered a dessert menu (I wasn't that excited by the menu when I'd seen it when we ordered entrees, but would have been nice to receive it), though water was refilled regularly, which is something I appreciate. Parking was generally not that easy to find, though it was Off the Grid in the Presidio, so it's probably easier otherwise. \n\nFood and drinks were both delivered promptly. We didn't do a thorough check of the menu beforehand, but vegetarian options were a bit lacking (on their website, I only saw dinner and lunch menus, no brunch, which is what we went for). Generally, dishes were on the smaller side. Prices were not outrageous, and generally matched the size of the dishes, but we left a bit hungry.\n\nWe had:\n\nPassion Fruit Agua Fresca - Delicious - a perfectly sweetened drink without being too syrupy. A fantastic, fresh taste of passion fruit. I wanted more when the drink was done!\n\nCompanions had two grapefruit-based cocktails. Both drinks were almost overwhelming in taste and small, of a mix of alcohol and grapefruit. I didn't enjoy the drink, and my dining companions only felt mediocre about them.\n\nChips and Guacamole/Salsa - The guacamole had some good chunks of avocado and was definitely freshly made. Not a huge serving (similar to the below), but enough to be easily shared between two people. The red salsa had a nice kick to it. Chips were crunchy and well-salted without being greasy.\n\nHuevos Rancheros - Followed the small theme. About two (maybe three) small, round tortillas were laid flat on the plate, with two poached eggs atop them. There was a semi-spicy salsa/sauce on top, which was the highlight of the dish. A small pile of refried beans were on the side of the dish. Flavors were fine though nothing special.\n\nOaxaca squash quesadilla - Two medium-sized quesadillas. There was a fair amount of sautéed squash inside, which I enjoyed, (not too greasy, etc.), but the cheese was a bit stringy and bland. Again, nothing wrong if you dipped it in some salsa, but also not fantastic.\n\nI wouldn't rush back soon.", "author": "Jackie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-19", "description": "Well, we decided to pop into Arguello while perusing around off the grid.  Thought, why not grab a few cocktails and sit on the patio. The restaurant, especially the outdoor space is very chic and comfortable and staff seemed friendly (somewhat).  The menu is limited, but we weren't there necessarily for the food, so didn't pay much attention.\n\nSo, why the 2 stars?  I head to bar to grab two signature cocktails.  For $13, I thought they would be made \"fresh\". Instead, they were pre-made and poured from a bottle.  Himmm....maybe I'm naive and this is done on a regular basis, but something just didn't seem right about seeing them pour this drink.  And for $13, really?  Not to mention the glass they used was tiny.\n\nWon't be going back to Arguello.  If not for the ambiance and based solely on the drinks, giving one star would gracious.\n\nSorry!", "author": "J J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-19", "description": "A beautiful space - comfortable and cozy.\nThe host was very accommodating to our party of six and waiter was great.\nMajor complaint is that the food overall was very greasy... Not the fresh Mexi-Cali I was expecting. \nWould I go back, yes - to see how it develops.", "author": "Tobey N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-20", "description": "Meh. Homemade chips run from burnt to soggy. $10 margarita doesn't come close to the competition. And while I am fine with paying more for haute Mexican cuisine, this place missed the mark. Staff is friendly and professional.\n\nFood: 3 star\nService: 5 star\nSpace/Atmosphere: 5 star\nValue: 1 star", "author": "Saul E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "The food is amazing!! The price point is a great deal for organic and fresh ingredients, and the entrees are big enough to be shared by two. Cocktails are delicious, too, and their arroz con leche dessert tastes even better than my grandmas recipe!\n\nThe service side does need work, but keep in mind this restaurant isn't even a year old, they need time to make changes to get the flow going. I'd also recommend dinner service, lunch service is more tailored to cater to the employees inside of the presidio. A great restaurant in the making, be nice Yelpers, nothing is perfect right off the bat.", "author": "Katie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-08", "description": "Beautiful patio \nDrinks nice\nFood ( chips/guacamole, pork taco, shrimp taco & chicken taquito) all lacked flavor.  Did not feel good after eating here.\nService still in start up mode.  Hostess needs to be replaced (sort of rude).\n\nBottom line:  go for a drink and the patio.  Skip the food.", "author": "David O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "We held our Farewell Brunch the day after our wedding here and the food was delicious, the staff was helpful and the bar was flowing! We had reserved the outside patio for 50 and they arranged the tables and food and had some \"leftover\" heat lamps they put out from another event because the day was so cold and foggy. We could not have been happier with the event and our guests continue to compliment us on it.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-17", "description": "I've eaten here several times. It has been my favorite food place in the Presidio for several months, and up until today everything has been great. Today I had the mushroom quesadilla, and what a disappointment. The flavors were good, mushrooms and cheese had great texture, but the tortillas up top and on the bottom? Could barely be cut by a fork, and because the thing was thick and fluidy, clearly not meant to be eaten by hand. The thing was obviously overcooked and because of the petrified tortillas, almost inedible. Unfortunately I had another destination and didn't have time to talk to anybody about it. Very disappointed. I will go back because it'\ns better than the new menu at the Disney Museum, but now I wonder where I will eat in the Presidio (which is a frequent destination for me).", "author": "Anne S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-04", "description": "Consistently bad. Really want to like it as it is convenient. Service and food all need much improvement. Got a whole pod of jalapeño seeds in our guacamole. Mouth on fire. Couldn't even drink my margarita and they still charged me for it. Done -- will not be back.", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "Good taquitos, excellent guacamole and chips, drinks are good. Fast service and nice ambiance", "author": "Bill A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-24", "description": "The Officers Club is a good concept - similar to mcmenamins in portland.  \nWe had high hopes for Arguello.  The margaritas were good. \nGuacamole was plan and house salsas mediocre. \nService was very slow but understandable for a new restaurant.\nCactus salad was just not good but maybe I dont like cactus. \nWe ordered the fish tacos which was $4 for 1 taco but they were out of fish so they put 2 shrimp in which was not good at all.  The ceviche was a bad idea as it was drenched in red cocktail sauce.  Pork shoulder was ok.  Flan was heavy. \nI think this place has potential with the outdoor patio and great ambiance and location with parking but really wish we had gone to the hipster food trucks on the presidio lawn with the fireplaces and tents and spent $20 instead of $100 at Arguello.", "author": "James M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "Can't figure out why this place doesn't have more stars.  Started with surprisingly  prompt Sunday brunch seating.  Just beat a big crowd by arriving when they opened at 11.   The coffee was excellent (maybe a tiny hint of cinnamon?).  Then we had the huevos rancheros which were great -- very flavorful and you could still taste each ingredient, and the eggs cooked perfectly. And then the amazing banana pancakes.  Wow.", "author": "Mary V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "This place has a lot of potential but isn't quite there yet. The food was good and the portions were generous.  It's also not super expensive, pretty reasonable for the atmosphere/quality.  I have had lunch and dinner here.  \n\nLunch is order at the counter and have it brought to you.  We sat outside and had a good experience with that.  \n\nDinner was where the kinks came out.  No reservations and it gets really, really busy.   You could tell the waitress herself was good but she was seriously overextended and had too many tables.  I am giving it four stars because I hope it was just an off night when they were too lightly staffed.\n\nOtherwise food and drinks were great and the atmosphere is nice and lively.  We'll definitely be back.", "author": "Nicole D H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-17", "description": "Prices are good and ingredients top notch but they always run out of stuff like shrimp tacos.  Hostess was the most clueless I've seen in a while...hired her for looks maybe.  Drinks heavy on Tequila very expensive and bar service slower than molasses.  Manager runs around a lot but does not see things.  They servers seem to try to please but system is almost non-existent. Most discombobulated dining experience I've had in a long while.", "author": "Gregory C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "I am blown away (and really surprised) by the amount of negative reviews on Arguello.  Sure, if you are looking for your typical Mexican or hole in the wall burrito place, this is not your place.  However, if you want an incredible (and pretty authentic) meal that is exquisitely presented and tastes excellent....come here.  We were a party of 6 (2 kids) and tried 5 different entrees between us.  Every single one was absolutely excellent, fresh and delicious.  The chips, salsa and guac are delicious, as are the margaritas (mine had fresh crushed blackberries).  I can't wait to come back for happy hour.  Service was great as well.  Prices are on par for what I'd expect at similar restaurants, but again, not the hole in the wall burrito place.  If you love amazing Mexican food, Arguello should be high on your list.  This is going to be a new staple of ours - I am only sorry we haven't come sooner!", "author": "Coco L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-10", "description": "If the portions were slightly larger, and they included chips and salsa or rice and beans with their finely prepared entrees, I would definitely give Arguello five stars. I went in for a late lunch due to a busy day at work. Being beset by hunger pains, I could have used a hearty meal. The mushroom quesadilla I ordered and the hibiscus tea were excellent. The button mushrooms even had the stems removed! The small corn tortillas were partially filled with feta cheese and a variety of mushrooms. It just was not enough to satisfy me and I left the restaurant still hungry and fifteen dollars poorer.", "author": "Ken R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-07", "description": "Overpriced for what it is and the service is slow. You're better off going to the mission.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "A friend and I needed some sustenance and came here for some snacks before dinner. We sat at the bar and were attended to by the fabulous bartender Andi was affable, friendly, helpful and genuine. We had a GREAT time just sitting, talking, and snacking. The chips and guac were very good, both were fresh and delish. We didn't stay for dinner, but if you need a break after exploring the Presidio, come and rest a bit with Andi, you won't regret it!", "author": "Thalia F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-29", "description": "Please........We try very hard to like this place because you have an amazing location! You have a beautiful deco and outdoor seating. Who closes at 9???????? What kind of bar? Closes at 9!!! Maybe 10 would be reasonable during the week. Seriously!", "author": "Ichi Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-16", "description": "I had high expectations for Arguello but came away sorely disappointed! The food was just not good. The amaranth salad could not have had a more uninviting presentation and was mediocre to taste; guacamole so-so; their glasses of wine are more like half glasses. Service good but cannot make up for poor quality paired with 'healthy' prices. We didn't venture into meat dishes (as vegetarians). I really expected more from a Traci J restaurant.", "author": "susan h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-03", "description": "Overpriced.   I expected, for the price, good food, but now.  I got two tacos, chips and 2 salsa.  The meat was dried out, like it was overcooked and the tortillas were packaged ( not fresh).   For the salsa, they filled up he 1/2 cup size ramekin  1/2 full. For$5 I expect the ramekin to be full, especially since it's so small to begin with.   And it was thin bland sauce - not spicy and didn't have chopped anything like  pico de gallo.  Also ambience is very dark.   If you walk in from outside, it'll take about 10 minutes for your eyes to adjust. \nDon't believe the hype.  Save some money and only go during happy hour.  Or better yet, don't go at all ( try tacolicious on chestnut instead!)", "author": "Katrina V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-31", "description": "What is that really ugly thing on the patio wall?   How can anyone eat anything after seeing that!", "author": "James H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-29", "description": "While walking in the presidio this afternoon I stopped by this restaurant looking for a late lunch, the outside is beautiful and it looked like this restaurant had much potential. From here I was disappointed. I walked into the restaurant to an empty dining room I figured they were just opening for their dinner service so I didn't think much of it. After a few minutes, I was greeted by one of the staff who told me to go to the bar and order there. I ordered a shrimp and carne Asada tacos and a coke, which came to a total of $19. I was excited for the food, but I was not prepared to have paid $20 for two bland  tacos barely the size of my palm.  I really want this restaurant to be great. But right now, the prices, bad food, and crappy service all will lead me to not return to this restaurant again.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-28", "description": "It's just okay if you want a bite in the beautiful and historic Presidio.  I'm surprised though that the Trust awarded two restaurant leases to Tracy when there were so many better choices.  In general, among locals, the Trust has a reputation for ill advised and poor decision making.  This is one of many such examples.", "author": "Andy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-01", "description": "The Presidio is a place to be cherished, not to be underwhelmed by tasteless snacks.  The initial looks are deceiving.  Perched along-side the Golden Gate Bridge, this atrocity barely gets by with ultimate compliment of mere existence.  Boring ambiance, boring service, boring food.  I only have one explanation of why such a view could be so blatantly avoided-The owner must be blind.  Or perhaps they were complete oblivious to their proximity to one of the seven wonders of the world.  Either way, it is inexcusable.  Additionally, the service was in subliminally sorry state of dissolution.  My best guess is that they were under the impression the food & beverages would serve themselves. This is without even mentioning the food itself: some poorly plated Costco microwaveables (not undermine Costco's excellence) of an excuse for Mexican cuisine.  The only shred of hope we have here is statistics.  Statistically speaking, a restaurant in San Francisco is unlike to stay open for more than a few months.  I can only hope the odds work in clear-minded individual's favor.", "author": "Max H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "First sign of a good Mexican restaurant is the freshness and quality of what would seem to be the simplest thing -- tortilla chips. Yet, so many restaurants have stale, tasteless or out-of-a-bag looking chips. These were fresh out of the oil and complimented the guac and two salsas very well.  The guacamole was fresh, but could use a little more kick -- maybe some lemon and habaneros.  \n\nAndrew behind the bar is a genius with the cocktails. I told I liked sweet drinks and my husband liked strong ones.  I don't remember what mine was called (something with 'fog' in the name) but it was fantastic -- with dried hibiscus candied in rock sugar, fresh fruit juice and other delicious flavors. My husband's drink had 4 ingredients -- and for each of these we received their well deserved description and history (e.g. Ancho Reyes and a Tequila from outside of the TDO) from Andrew.  \n\nWe had a chance to briefly say hello to the owner Traci, which was a treat.  \n\nThe food was uniformly excellent.  I loved the Albondigas soup - meatballs were hearty and it was nicely balanced by a simple but flavorful chicken stock.  We also had the jicama salad and the pork which were both delicious.  \n\nWe'll be back!\n\nSheela", "author": "S G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "Okay, so I've seen some not-too-thrilling reviews of Arguello, and my response is \"MEH.\"  It IS a very different sort of Mexican food establishment, but I kinda like it.  Granted, I went there on a weekday at the very end of what is considered the lunch hour, so it wasn't crowded, and we didn't have to wait to order. \nThe first thing that impressed me was the tortilla chips.  They are actually made by frying tortillas!!  This is totally not common, at all, in any Mexican restaurant, or food store.  Whatever happened some years ago, possibly having something to do with health vs fat, every supplier of tortilla chips is using batter extrusion.  If you don't know what I mean, see if youtube has a video about it.\nAnyway, the chips at Arguello are fabulous!! They came to our table warm and crisp, and I could barely stop eating them.  And believe me, I know about tortilla chips; I get my favorite ones at a Mexican grocery store in Los Angeles.\nThe grilled fish taco was excellent; the carnitas were very tasty, if a little lacking in fat, and I would order them again.  The mushroom quesadillla left something to be desired as I didn't detect any seasoning and didn't taste any cheese.\nThe restaurant itself is rather industrial looking, but it's comfortable.  The outdoor seating looked like a great place to eat, and is most likely wonderful on a non-windy evening.\nGive it chance folks.", "author": "janice s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "Good fresca\nBeautiful setting\nBeautiful patio\n\nMushroom quesadilla was pretty good\nThe guacamole was not bad ... small yet fresh\n\n\nRaw review ...\n\n need more tasting ... this is a eat & run review\n\nMore to come", "author": "S.K. Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-20", "description": "We showed up for lunch, waited in reception then people started to show up and pass us. 5 minutes later I ask someone who was not clearly interested by customer how this works.\n\nYou need to grab a menu and get tot the bar.\n\nWe left as it was freezing cold and apparently they were not  excited about having customers that day.\n\nManager seemed awol.", "author": "Alex D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-22", "description": "GREAT guacamole and chips! Somewhat limited veggie options (I usually get a salad sans cheese) but it's a beautiful space to have lunch or happy hour. Friendly servers and bartenders as well. I really wish they didn't use disposable plastic (yech!) cups during the lunch service and hope that they'll switch to reusable soon.", "author": "M M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-27", "description": "Would not recommend Arguello. SKIMPY portions but not priced as such. We ordered shrimp taco -2 small-ish shrimp  a few shredded bland cabbage and a shell for $5.50 per taco. Was not even flavorful. Same with carnitas taco and beef carne asada taco -.....tiny, flavorless AND COLD. We ordered the Albarino wine and it looked like a half glass for $11.  Mind you,  we ordered a glass of wine but it was so small it was like a wine tasting!   The person who took our order was completely unwelcoming and indifferent  after waiting in line at the counter to order. \nIn the end, a total rip -off! If you have to order at the counter at lunch, they should price it accordingly....over-priced, flavorless, mediocre and ridiculously small portions.", "author": "Kathy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-23", "description": "Caution: avoid! \n\nThe decor is lovely and the menu enticing. The food, not bad at all.\n\nBut poor management makes this a must miss.  Where do I begin?\n\nWe recently tried brunch here. The hostess took our name and said she's call us when our table was ready. We had to ask the wait time. We had to ask if we might wait at the bar and order a drink.\n\nWe did wait at the bar, but although we were given menus, no one ever took our drink order (lost revenue).\n\nWe were shown to a group table right in front of the open front door on a cold day. We asked if the door could be closed, since everyone in the place had their coats on, but, \"Well, we'll have to ask the manager, and he's outside.\" After freezing for several minutes, we asked if we could move to a free deuce further away from the door (and why didn't they give us the free deuce to begin with, since it couldn't have been reserved for someone else, because they don't take reservations?). Again with the asking -- they would have to ask our waiter if that was OK (it was). The hostess granted us permission and added, \"you can bring your things with you,\" motioning to our water glasses and silverware. The new table was cleared, but still dirty. Feeling privileged to have a table at all, we did not point this out.\n\nThus began our experience of being in limbo with the servers. The one who took our order (who seemed very competent) never returned or introduced us to our new waiter (if we even had one). The coffees we'd ordered before switching tables took a worrisome amount of time to appear. Our entrees came out shortly thereafter, so we had to ask for the chips and guacamole we'd ordered as an app. The entrees were unexpectedly topped with fresh avocado -- fine, but equally unexpected when later we were charged for the avocado add on. We had to ask for salt, pepper, and hot sauce (also an unexpected surcharge, we later discovered), which took quite some time to appear.\n\nOf course, we did not expect any acknowledgement as we left, so were not disappointed when one was not offered.\n\nWe never did get the agua fresca we ordered (lost revenue). And the door never did get closed. It seemed the comfort of the staff took precedence over the comfort of the guests.\n\nWith all the great restaurants in the Bay Area, and with all the great service these restaurants offer, why would I even consider ever returning to Arguello? Sad.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-21", "description": "Boring! The building, room, staff and tortillas were good. The food was incredibly bland. Nothing labeled spicy was spicy. The food was presented well and wasn't bad it was just. not. tasty. Mexican is supposed to be a fiesta in your mouth. This was a siesta :(", "author": "Sally S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-26", "description": "OK I tried to give them another chance. We are 0 for  2 in getting chips and guacamole delivered on time to the table.  How tough can this be? The food is good, not great, especially for the price. It's too bad because it is a beutiful space with tons of parking. The menu is way too limited. We had such high expectations of this place and they just aren't met. Sorry Tracy, no me gusto.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "We had tacos for lunch (on Tuesday 3 for $10! Can't beat that!). They were good not great. We sat outside on a sunny day in the Presidio (that was priceless!). Staff was ok. No wait.", "author": "C L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-28", "description": "Maybe you need to be an officer to get some respect here.  No service except self service.  If you don't want customers between your late afternoon brunch and the evening service then you should close down.  Otherwise you leave people -- at least all of us sitting on the patio right now talking about how bad it is -- with a really, really negative experience.  And we were thinking it would be good to come back and have dinner.  But based on this afternoon's experience we will not only not come back but will strongly dissuade anyone we know to stay away.  Over priced, mediocre food and no service.  Clearly this is a big tourist trap. Not the place for locals.", "author": "Robert A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "I enjoyed the carne asada tacos. Everything seemed fresh and authentic. The mushroom quesadilla was also good. Great chips and guacamole.", "author": "Carla C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-18", "description": "The food and margaritas are delicious, but a bit overpriced. Zero stars for service. Been here four times and every time have had the worst service of anywhere I have even been. Particularly from the hostess -rude, dismissive and unorganized. This place has potential, but the staff seriously needs to get their act together.", "author": "Ashley L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "Like they open up at 11am. Food offering is limited with short menu but that doesn't detract the great quality ingredients and taste. Location and outside patio a plus.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-02", "description": "how does Tracy des Jardin get so many restaurants in the Presidio and they are all medicore and expensive just like her 2 restraunts at ATT Park..Does she have some inside connection to City Hall or the Presidio Trust.   Arguello serves crappy cheap Mexican food at gourmet prices to clueless patrons at Arguello.  Skimpy on supermarket chips, the portions are tiny and costly but mainly the flavors are more evocative of the forzen foods selection at Safeway than tasy homemade Mescian cuisine.  Skip this place and your money will be better spent elswhere....", "author": "Eugene P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "The snapper was phenomenal.  Grilled served on a bed of rice topped with poco de gallo!  Enough for 2, unless you're really hungry!", "author": "barry w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-22", "description": "Went to check out the newly remodeled Officer's Club in the Presidio (beautiful interior renovation) and stopped into Arguello before heading out. \nLovely space, points for an outdoor area. However, I spent nearly $40 total (including tip) on one delicious drink (El Presidio $12) and two disappointingly overvalued dishes, the mushroom quesadilla ($10.50) and the chicharrones( $7). The quesadilla was miniscule, more like an appetizer rather than a brunch level entree, as the price implied. Barely warm, under seasoned, overcooked mushrooms and barely there melted cheese between two 6\", chewy, flavorless, almost undercooked tasting, corn(?) tortillas with a thin line of tomatillo salsa and cotija cheese. Size and quality did not justify price. \nThe chicharonnes were tasty, like \"pork popcorn,\" as the bartender pointed out, but again, not something that I'd rush back to experience over and over again or even recommend.\nNew concepts in upscale fast-casual dining combining beautiful spaces with simple \"pseudo-authentic\" ethnic food seem to be reaching for diners who think they're getting a great experience without having to dress up, never eat food with their hands and/or have huge credit limits. Unfortunately, they lose sight of the value that motivates discriminating diners on more restricted budgets to return again and again. Arguello was not a satisfying experience.", "author": "Heather K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-02", "description": "The location is nice and parking is no problem, which is great.\n\nWe arrived at the front desk and were told there was a 30 min. wait for a table. We said great, our friend will be here in 30 min.! The hostess suggested we just eat dinner with our friend at a bar table. The bar table is tiny. She reluctantly took our name for a table in 30 minutes. \n\nWe were seated on time and our waitperson was friendly and gave us time to settle in. Once we'd gotten our food, she didn't come back until we'd finished. If she had, my husband would have told her that there were only two shrimp in the three shrimp shells which covered the entire plate, and the shrimp were not not fresh. \n\nI had a carne asado taco which was ok. The fish taco didn't seem like fish and was also bland. I hoped the food would be like Copita in Sausalito. Not even close.\n\nDisappointing experience. Bland and expensive food. We won't be back.", "author": "Leanne S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "Come on. This is not a 2.5 star place. This is a neighborhood gem that is a bit slow to launch, service-wise. That's ok. Because a lot of the food is fantastic. The chips are even better than what they used to serve up at Tortilla Heights, which were lightyears ahead of most the crap they serve at any Taqueria in the Mission, sans La Taqueria. Arguello's pork shoulder is to die for. Tender, moist, well flavored and basically you can't stop eating it. The chicken verde is a plus too. Dark meat, but still fantastic. I'd also suggest both squash dishes, the main and the salad. Don't miss the guacamole, it's a tad pricey, but who cares, it's perfectly seasoned and will be devoured in about 3 minutes. The tequila list is one of the best in the city and features 7 Leguas tequila (in blanco, repasado and anejo) which is the benchmark brand which all other distillers can be compared too. Hopefully the can have more salsa assortments and tad better decoration on the outdoor patio (and a few more heat lamps.)", "author": "Brian J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-20", "description": "I went for brunch on a Sunday around 2pm. There was a long wait for a table, even though there were multiple empty tables. We were told that the KITCHEN was full. We were told that we could go wait at the bar; only problem was that the bar was full. I understand that they were busy...but why couldn't we sit down while we waited? Instead we had to stand in the corner and try to keep out of everyone's way.  While we were waiting, a couple walked in and was seated immediately. We heard one of the couple say to the other \"I'm glad that we called ahead so we didn't have to wait\". WHAT? It clearly says on the website that they don't take reservations. My guess is that they are regulars and favorite customers, but it's disheartening to have spent 20 minutes standing against a wall, trying to stay out of the way of the waiters, and then listen to someone be pleased that they didn't have to wait.\n\nFood! \nWe got chips, salsa and guacamole. The chips and guacamole were excellent! Very generous amount of guacamole. I've read other people complaining about being charged for chips, but I imagine the chips aren't free because they are deep frying actual tortillas rather than just dumping a bunch of chips out of a bag. \nWe ordered huevos rancheros, fish tacos, and banana pancakes. The huevos were on top very dry corn tortillas, with rubbery cheese and a fried egg on top. Beans were on the side. My beans were whole pinto beans but my dining companion's beans were all mushed up and cold. The beans had no flavor, and as the salsas we ordered with the chips were also very, very mild, we had to ask for hot sauce and salt. The fish taco was okay. The fish itself was delicious; crispy on the outside and moist on the inside. Unfortunately, as with the huevos rancheros, it was served on a dried up corn tortilla with some flavorless wet cabbage. I ate the fish and left the rest. The banana pancakes consisted of three pancakes, a lot of banana and caramel syrup. Yum! \nWhen my friend ordered coffee at the end of the meal, she was told \"Sorry, we're closed\". WHAT?? She was able to get a cup of decaf that she said was awful (but we weren't charged for). \n\nOur waiter, Kristina M (name on our receipt) was very nice, checked back in frequently and did a good job. I'd like to eat at a restaurant with better food and Kristina as our waiter.\n\nThere were definitely some yummy things to eat..the chips/guacamole and the pancakes. Everything else was mediocre and bland. I don't understand why. Maybe because the restaurant is in the Presidio they figure that they are catering to a tourist crowd who may not be used to big flavors or spicy food? I have had more flavorful beans dumped straight out of a can. This is San Francisco. This is a Traci Des Jardins restaurant. Very disappointing.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-05", "description": "I would agree with many of the previous posts.\n\nWe went last Sunday and the adults in our party had the pork shoulder and chile verde.  Both were tasty (not as good as Nido or Dona Tomas) but the portions were on the small side and the prices did not reflect that.  And the menu selections were very limited.\n\nWhat really soured our experience was the extremely poor and slow service.  We were there when they opened at 5pm; it took our server 20-25 minutes to come over and take our drink orders (at which time we were ready to order food too); it took another 35-40 minutes for our food to arrive.  By that time, we were starving and grumpy.", "author": "Denisea A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "Andy Goldsworhty in a patio  NOBODY sees!  What is all that about!??????!\n\nSacrilege!!!\n\nGuacamole and chips, excellent!!!Sangria, Declicious! \n\nToday, Thursday, 3/26, prices, service, and food, Excellent!!!  Coffee from Ecuador, Excellent.  \n\nWines - you need to steer away from their cheaper wines. They are Horrible.  The pricier wines are great!!!\n\nCaramelized Pork, curtido and salsa, excellent. and delicious!  Chicken, great!  Tortillas, almost great.  The tortillas need to be more moist or flexible.  \n\n\nNevertheless, we will be back.  Lovely on a beautiful day!  \n\nMonica and Eric are great!  Ronald needs to stay on top of things.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-07", "description": "Agree with many of the service comments from others but Traci is here working hard so my guess is this will improve over time.  Manager is stepping up which I do appreciate.   Give this place a try.  Bottom line:  good quality food though SF might be used to more spiciness, great location and service that's still work in process", "author": "Terence F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-09", "description": "4 stars for food, 2 stars for service (would be 1 star but for a manager who took the reigns when we finally lost our patience)\n\n4 stars: Good location in the Presidio with tons of parking. As well, the food & drinks are pretty good (though not particularly generous portions)\n\n1-2 stars: But the service is deplorable. No reservations, so we put our name in and had some drinks on their lovely patio. The first estimate was an hour. After an hour and 15 minutes, we were told it would be another 15 minutes. After an hour and a half, we were told \"the tables aren't turning. I don't know what to tell you.\" After an hour and 45 minutes, the host pretty much wouldn't help us.  So, we finally tracked down a manager who found us a table and actually took our orders/served us/hooked us up with free dessert.\n\nAs well, the bar situation is a disaster. While the drinks you eventually get are good, they are expensive, and there too few people working and the bartenders are rude.\n\nThe concept is great, but they really need figure out the service situation soon (which they should. This isn't Traci des Jardins first restaurant!)", "author": "Sara S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-25", "description": "I had brunch there recently with friends. While the food was good the waiter gave me attitude when I asked the price of the mimosa. I had had one, and he asked if I wanted another and then I asked the price. He said, \"8 dollars, I think,\" and something like, \"who cares?\" and it turned out to be $10, and I actually care about what I pay for things. I didn't order the second one and I'm really glad I didn't as that would have been about $26 for two tiny orange juices with a splash of champagne including tax and tip!", "author": "Rich M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-04", "description": "We love Traci des Jardins and Mijita, but this was incredibly disappointing. We ordered two of the squash plates, one mushroom quesadilla, a jicama salad, and a remarkably small order of cilantro rice. The squash was extremely bland. It was large amounts of unseasoned squash with small bits of unmelted mild cheese, served on an unsalted tortilla. The mushroom quesadilla was pretty good, but not amazing. There were a few too many of the slightly slimy mushrooms. If you really like mushrooms you would probably be happy with this. The jicama salad was okay, again a little bland and unoriginal. For three very normal- size average eaters, this wasn't enough. We went home and made some more food. The service was good. This whole meal was pretty unremarkable and tiny for $72. After paying that much for three people, we are still very hungry.", "author": "Marcia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-24", "description": "Traci, you can do better!  And you should before this place affects your good reputation.\n\nThe location and decor of Arguello is fantastic.  I love the officer's club with its family and little kid friendly spaces.  The restaurant is set in a beautiful location with a nice back patio and well-done rustic furnishings.  \n\nHowever...the food needs improving.  While the guac and chips are solid, things go downhill from there.  The carnitas taco had bland, flavorless meat.  The eggs divorciado were bland missing salt, pepper and spices.  The chorizo and egg burrito was also really bland with no chorizo flavor and it was the same size as my 2.5 year old's bean burrito--tiny.  I don't mind rustic cuisine, but it shouldn't be boring, which is how I found my two meals here.  \n\nThis place has so much potential, but at this point, Padrecito and Nopalio blow it away.  I hope Arguello improves asap.", "author": "David P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-27", "description": "I see others were disappointed. We were too. We went for dinner on Saturday night to celebrate a birthday. We were excited to be trying a new place. The setting at the Presidio is beautiful and the space is nice, but that is their only saving grace. It is a very, very loud place inside. Difficult to converse. \n\nThe waiter took a long time before we even got our orders in. We only had one drink order, a pale ale. We ordered a guac and chip appetizer, salads to share, and main plates. We then settled into spending a lovely evening in celebration. We waited a long while before our water was refilled. My friend did not like the beer and found it left a very bitter aftertaste. \nWe also waited a long time before we got anything to eat and much to our surprise, the hot plates came first. No apology for them coming, just the question \"Was that ok?\" Really? We just looked at each other and said \"Why not!\" Well, the salads were brought out next and then the guac and chips...all within about two minutes of each other. Our only choice was to eat the hot plates first. \n\nThe waiter gave us one beer to make up for this and remember, the beer was too bitter to finish the first one. The waiter did admit the order of the food was his fault when he keyed it in. Good for him.\n\nThere are only four main dishes on the menu and we got the port shoulder, pollo and squash dish. Each of these dishes were very bland and as a vegetarian, I was extremely disappointed in the squash dish. Only two small pieces of squash in a bowl with all zucchini in a bland luke warm white liquid. I could not finish it. These were served with corn tortillas that fell apart when you unwrapped them. \n\nSo, we ate in reverse order. \n  \nWe ordered desert and they had only one chocolate choice in the four deserts. A churro with chocolate. It is what the birthday girl ordered. The waiter took our order. Returned to the table after about five minutes and let us know they didn't have this on the dessert tray today and they forgot to tell the waitpeople in the line. \n\nHe asked if we still wanted the Mexican cookies we ordered. We all just burst out laughing and said, forget dessert, give us our check, we just want to get out of here! \n\nThis whole process was unenjoyable and over $100.00 later!!!\n\nOh, BTW, he did give us the Mexican cookies on the house. They were also not very good.\n\nReally a huge disappointment, a house of cards experience and probably in my top three of disappointing restaurant experiences.", "author": "Pat O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-27", "description": "So disappointed!  Everything had no flavor. Salsa was blah.  Guacamole was blah.  breakfast burrito was a flour tortilla with eggs that had a little chorizo in them.  nothing else in the tortilla.  I was shocked by how basic and boring the food was.  gorgeous location and reasonable prices -- but you don't get anything for it.", "author": "Genevieve B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-10", "description": "Service here is awful! The food is expensive and PREMADE.... I guess there some super chef here but she should be very disappointed with her work and staff.... We live in the presidio and just thought this would be a good easy place... NOPE.. We had one really great server and one that is totally rude and acted like it's our fault for the food not all coming out at the same time.  Avoid this place... So many good restaurants in SF; go there instead.", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "I don't write reviews much but I think this place is weirdly underrated on Yelp, so I'll chime in. I've gone here twice recently for brunch. Once just me and my SO, and the second time with a party of six. Both times the service was friendly, food was tasty, drinks were delicious, and the historic setting totally charming. I've ordered the chilaquiles and seasonal pancakes and enjoyed them both very much. First time we sat inside, second time on the patio because it was a beautiful warm day. The patio is dog-friendly and our server immediately brought a little glass of water for my brother's dog as soon as we were seated. The bar got backed up during our meal, and one of our drinks came out very late. We were in no rush and didn't complain but our server apologized anyway and comped us the drink. Nicely done, Arguello, keep it up! So glad to have you in the Presidio!", "author": "Nick P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-14", "description": "Had dinner there last night after a music event next door. We had a group of about 10 people. Overall the food was okay, even with stale chips, not fantastic. When our food arrived, the waiters had no idea who got what, so it was a big guessing game. No big deal, and the service overall was quite good and the restaurant accommodating.  We did not sit outdoors, but their patio area looked quite inviting, especially on a warmer night. A huge parking lot across the street with plenty of free and easy parking too.", "author": "Scott F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "Love this place. Bartender knows his shit and is one of the most knowledgeable bartender's I have met.", "author": "Tyler H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-19", "description": "This was my second time here in the last 2.5 months. We arrived early the first time and the line wasn't too bad but we were a group of 5 and there was a lot of getting up and down ordering, then ordering more which made for a not very relaxed lunch with the girls. Food was good, portions small, a bit overpriced, ridiculous price for chips and guac. Margarita was excellent! \n\nToday I took my husband and we arrived at 12:30, our bad, waited in line for about 10 minutes and could see it was not moving and the restaurant was only 1/3 full. Why not have table service?? Give people jobs, earn tips for good service. The reviews are obvious that the stand in line thing is not working. There is only one woman taking orders and people stand there as a  group and ask questions and then try to figure out how to break up the bill as everyone else waits. We shared 4 tacos and one margarita and it was $30, and we were still hungry. Forgot to mention, we left the line and went for a 45 minute hike around the Presidio (lovely!) and then checked back at the restaurant and there was no line so we quickly ordered. \n\nLove the idea, the location but just have full table service. Just don't understand this wait in line concept. Not sure I'll go back.", "author": "Marina K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-11", "description": "Best to avoid..  The whole \"scene\" was disorganized.  Service was bad and slow.  Guacamole - plain and boring.  Carne asada tacos - meat was chewy and tough; shrimp entree - shrimp hadn't been cleaned; tortillas - bad, stale; albondigas soup - reminded me of Spaghetti O's, the kind with meatballs, plus tomato broth.  all around unacceptable.\n+ the cocktail El Presidio and the chips were good.", "author": "Vanessa A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-07", "description": "We had high expectations after enjoying lunch and dinner at the Commissary sister restaurant. But we were disappointed in both lunch and dinner at Arguello. Service is spotty and the servings are somewhat small, not that tasty and too pricey. The chips and the tortillas are stale and tough. The tacos were very small. The lengua appetizer was tough and flavorless, like a piece of leather. The frijoles rosas tasted like they came out of a can but with less flavor! Perhaps they are trying to do too much with the menu and have taken their eyes off of the basics. While we love the atmosphere and location, there are too many other good dining options in town to bother coming back here.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-22", "description": "Completely underwhelmed. Stand in line to get to cramped ordering area, where it's less than obvious you need to pick up your cutlery (the spoons are seriously oversized, the knives missing) and then wait rather a while for the harried staff to bring all the courses you ordered at the same time.\n\nThe staff are just dropping off food, not trying to upsell you anything or check your food is ok. And did I mention the food was remarkably bland and simple?\n\nYou can see the chef and swanky people in suits (investors?) standing a ways off and smiling in a self satisfied way, no wonder as the place is busy and overheads must be minimal. If only the location had more competition then they'd have to up their game and provide a quality experience.", "author": "William R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "This place was great! Unlike the earlier reviewer, there are no burritos here. The food was interesting and delicious. Great drinks. Wonderful atmosphere. Traci herself was there during the opening weekend of Presidio Officers Club. I highly recommend s visit.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-12", "description": "If you are visiting the Presidio area, Arguello is a nice, casual destination for 'nouveau' Mexican food. The menu is limited but the execution is excellent. Pricing is very reasonable. A few entrees done well is better than an oversized menu which is executed mediocre.  The chips have the crunch and density that I prefer. The guacamole was a perfect complement. The drinks were substantial, fresh and flavorful.  The entrees delicious.  Not necessarily worth a special trip but a perfect complement to touring the Presidio area, museums and want to sit down for a really, good, casual and unpretentious meal. The location within the restored and historic Officer's Club make this an especially worthwhile reason when visiting the Presidio.", "author": "Dennis H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-03", "description": "Just got back from this silly place. The location is lovely, but I will never go here for mexican food again.  The lunch menu was about 8 items, and they were out of 4 of them. Portions were appetizer-sized. I'm guessing if you go there alone you get the fist- sized bowl of chips, but I brought 5 people, and still got the same bowl. There are so many great mexican places in SF. Don't waste your time and money here. Now I'm going to fix myself some lunch.", "author": "Wendy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "Eclectic contemporary Mexican food created one of the city's top chefs. Nice sunny patio. If you haven't seen the Officer's Club yet, you'll find a gorgeous great room (cocktails by the fireplace here), small museum, and fun, casual bar/restaurant. Easy easy to get to in the Presidio and tons of parking.", "author": "Karen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-16", "description": "The first time we tried eating here we walked out.    Who wants to eat a meal sitting on a backless stool?    Warning:   this is the area by the bar.\n\nWe thought we'd try again today.    This time we got a table with 2 chairs.    Wow!!!\n\nThe food is expensive and the portions are small.\n\nThe service is amateur and totally unprofessional.    I very clearly ordered a glass of Chilean syrah blend for $9.00.   When we got the bill, I was charged  $12.00 for another red wine instead.   I pointed this out to the waiter but he made no effort to redo the bill.   The customer is wrong and the restaurant is right.    Arguello made a quick $3.00 profit on me.    I'm the fool.   I should have taken it out of the waiter's tip.", "author": "Calvin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-17", "description": "Sunday brunch: wonderful location; amateure service, mediocre food. Hostess does not even say hello, she just grabs a manu and walks off apparently expecting you to follow. Tea is tasteless, it is basically lightly colored water; coffee is served with milk - they do not carry cream or half and half. Other house drinks like lemonade are full of sugar; and so are pancakes - unbearably sweet. Prawn salad was very small, it could do as an appetizer but not a meal.  Though located in a absolutly beautiful spot, the total ambiance is that of a food court.", "author": "Sandra N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-13", "description": "Customer service at Arguello is deserving of a negative star rating.  We didn't have to wait long to sit, but then we were further rushed to order a meal in order to keep our table.  When that didn't happen to their timely liking, we were told to stand and give up a table.  The approach by the manager was not one that was welcoming and definitely not appreciated.  Our server felt so bad that he tried to make it up to us.  \n\nOverall, the food is average...the tequila cocktails are amazing.  But when you have service that makes you feel belittled, we pass and you should too.", "author": "Desiree L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-24", "description": "very mediocre food... we ordered chicken, shrimp & pork. The shrimp looks great but be prepared to peel it, chicken was fatty and lots of bones - same with the pork. Chips and Guacamole were the best thing we ate there. The drinks were ok- wine list was disappointing seeing as we are a stones throw from some of the best wineries. Service was very average at best. Atmosphere was nice, very loud. Will not go back.", "author": "C A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "I am seriously confused by all the bad reviews. I ate here last night and it was delicious (and I am, admittedly, a bit of a foodie).  The quantity of food and the price were both completely reasonable.  The wait staff was super friendly and helpful.  The atmosphere is delightful.  Maybe the low ratings happened when the restaurant was first opening?  Y'all should go back and try again.", "author": "Dorrit G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-02", "description": "Food was very very below average and prices are WAY too high. Restaurants in SF are pricey but this was absurd, and I like expensive food. \n\nDO NOT GO HERE", "author": "L D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-09", "description": "Pricey drinks and okay food. Menu was limited. Killer salsa - that gets 5 stars. Friendly staff. Spent over $100 and left hungry without eating anything that felt substantial.", "author": "Kim W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-24", "description": "Really, really slow service. It took fifteen minuted to get chips and salsa. Food was okay, but nothing special. Cool space, and nice outdoor area.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-04", "description": "I give this place 2 stars just because I like the location.The food is okay, it's whitewash Mexican food. I know it's new but the service there is really bad,our food came but we had asked for are drinks and they came about five minutes after we asked. I blame management for lack of training For their service staff.i don't think I will go back , unless I hear big changes with their wait staff. One thing with the food I found it very under seasoned.", "author": "Pat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "The taquitos & quesadillas at the Aguello Resturant were almost as good as Taco Bell & cost 10 times more! The service was poor.  The Precidio grounds are wonderful with a unique view of the Golden Gate Bridge. Just don't go to the resturant.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-18", "description": "Just like everything the Presidio has done, over priced & mediocre. Small portions of just ok food for hi- prices. Menu was extremely limited. The red salsa was disgusting at best.  Didn't care for the get in line & order style. Could have had a much better meal at Gordo's for a fraction of the price. The drinks were good!", "author": "Paul J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Delicious food, great atmosphere, and good service. Not sure what people are complaining about...if you want free chips and guacamole, go to a cheep taqueria...it is custom to pay for something like this. \n\nThis is a wonderfully thought out experience brought to you by the talented Traci des Jardins. Well worth the wait.", "author": "Traci P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-29", "description": "Arguello is a difficult restaurant to use. I live nearby so maybe I will keep trying. They seem to keep changing their hours, so often when I've gone by, they are either closed or having a private party. When I had the tacos they were tasty but very small. One bartender was friendly but another one definitely was not. All in all, they seem ambivalent about actually wanting to be a restaurant. Maybe they will get it together in the future. Hope so, cause it's an awesome spot.", "author": "Aria J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-23", "description": "We tried Arguello on Saturday night and ended up sitting at the bar.  From our seats we could see Tracy expediting.  The ambiance is very nice... relaxing but still with energy.\n\nThe bartenders were very nice and the service overall was good.  One bartender was very helpful but the one who was supposed to be taking care of us really didn't check in with us enough.  Since it is still fairly new, they are still working out service.\n\nWe tried the sangria which was fine and Mexican mule (?) which was very good.  The chips, salsa and guac were good but nothing special.  The pork shoulder had good flavor, but was kind of dry.  The chicken on the other hand was delish and very moist!\n\nOverall, it was a good experience and we'd go back.  We liked Arguello much more than Commissary.", "author": "Garrett H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-09", "description": "Don't bother going until January at the earliest - the service is just too poor, and maybe by then you can check the reviews and see if it improves. We signed up for a table at 5 on Saturday, and after being immediately seated, after 30 minutes I finally complained to the desk that we would like water and service. 10 minutes later we finally got our order in.  So if you come hungry expect an hour for food, and better get your drinks at the bar - it's slow but much faster than at the table. Food is OK but there are many other places just as good.  Margaritas are good too.  Decor is nice, and it is nice to have something next to the museum.", "author": "Brayton F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-01", "description": "What a huge disappointment. Bland is the overall taste here. Nothing stood out. I realize this is \"Mexican food for white people,\" but come on--a little taste would be welcome!. \n\nPlus, this was really annoying: They CHARGE for salsa if you want some to spice up their bland food. That is simply outrageous.\n\nThis is yet more proof that having a signature restaurant (Jardiniere) doesn't mean that other ventures will work out. My advice? Close your eyes, step into any Mexican restaurant in the Mission, and have an authentic and considerably better meal.", "author": "Fred S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-24", "description": "Disappointing on a number of levels, but nothing was an absolute deal breaker -\nFriday 6:15pm. Good amount of people waiting, yet host stand guy said \"Actually, things are opening up, check back with me in 5 minutes.\" Since we were a group of three, I thought maybe there was some odd table that wouldn't fit two or four that we'd get. Anyway that wasn't the case - we were seated half-hour later as I assumed would happen. No big deal, but odd. And we would have had drinks while we waited if we weren't thinking the wait would be short.\nOnce seated - \nChips, guac, salsa were all flavorful, but not outstanding.\nEntrees -\nPork - seemed to be the best thing to order for flavor and amount of food. Person who ordered it was the most happy.\nSquash/veggie make-your-own-taco thing - arrived a good five minutes after the first entree. They should put the bowl on a plate OR use a bowl with a lip or edge. Instead the meal is served in a cereal size bowl with a brown wrapper of two tortillas placed right on the table. Nowhere to put your taco between bits. A little bowl and a wad of brown paper just looks like a pathetic entree. The person who had this said the dish was \"pretty good\" but not memorable - not enough spice or flavor for her.\nShrimp - came eight minutes after the squash (yep, we were timing it at that point). The waiter noticed I had no food and went to the kitchen. Obviously, the shrimp hadn't even hit the pan at that point (which was LONG after the pork had been served) because it was several minutes before I got it.\nThe shrimp dish was three whole shrimp - you take off the head, peel and in the case of one of my shrimp, even devein it. Kind of messy with the sauce. I was up for it, but it should be mentioned on the menu or by the waiter. Not filling at all. Good I had ordered beans and more chips.\nMargarita - best part of the meal, but tiny. It would take three ($30 worth) to equal the pint glass you get at many other places. \nWater glasses - tiny and constantly empty. Just leave a bottle of water on our table please. \nI work less than 10 minutes away and wish it could be a new go-to place. Instead it seems like one of those places you go on vacation, convince yourselves it was worth the trip, then never return.", "author": "M D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-16", "description": "The drink menu was very good. The food was ok. Liked the mushroom quesadilla and the pork shoulder. The fish tacos were kinda weak. \n\nThe vibe was...really a dud. Half empty and half executed. I felt like I was in the museum cafeteria and not a Traci des Jardin restaurant.  I live 2 blocks away but I won't be back soon. Hoping they can fix this.", "author": "Gary R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-18", "description": "So very disappointed in Arguello. The Presidio deserves a first rate restaurant and this is a pretender. One thing you should be able to count on in this part of the country is authentic, quality Mexican food. This is not happening at Arguello. My summer tomato salad for $13 consisted of two tiny pieces of lettuce and s few cherry tomatoes- it was restaurant robbery. When I told the server I was extremely disappointed, she really didn't care. I will never return until this awful restaurant is replaced.", "author": "N S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Best margaritas I've ever had, and amazing food. The location in the Presidio makes it seem quaint, but it's a huge space with lots of history.", "author": "Crys C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-09", "description": "The menu is very limited, although it does change often. We wanted the shrimp, which was one of four items on the menu; they didn't have them. We had a chicken dish which was very good. Interesting...I see people preferred this to The Commissary. I don't agree. Maybe they need to throw a burger on the menu. Seems like that kind of environment.\n\nThe noise level was outrageous and for that reason we wouldn't go back. The wine pours are tiny, about 5 ounces.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-09", "description": "Went here for lunch on a weekday. I work in the Presidio. What a complete disappointment! Restaurant looks nice, but tiny portions for the price. Ordered the jicama salad. Was so small, bland, uncreative and not filling. Genuinely, the worst salad I ever had at a restaurant. My male colleagues ordered taco roll things. They cost $10 and could not possibly have filled them up. If you are looking for food in the Presidio, Cafe Rx is the same price but the quality and flavours are outstanding, especially compared to this experience. Would not recommend or return!", "author": "JeriAnn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "This is such a great place!! We were just there for a private party and the staff was so attentive to us and the food was SO delicious!! I look forward to going back in the future!!! Thank you for a great experience!", "author": "Kasse P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "The Presidio of San Francisco represents the best of the history of SF, CA,USA, going back to 1776... Prior to that were the various tribes of Ohlone Native Americans... Then, the people from Old Mexico populated Alta California...  Once Yerba Buena became San Francisco, during the Gold Rush of 1849, many new cuisines were merged... Arguello, a fairly new Presidio restaurant, represents the Spanish/ Mexican/ Alta California tradition with an exciting menu, and standard of service...  With house-made chips, and a spicy Guacamole, and green and red salsa, your dining experience is \"...off to the races...\" Next is \"still water or sparkling???\"   \nThen, attentive drinks-order taking, and info on the night's menu...  We split an amazing Jimica/ Citrus/ Avocado salad; then an equally exquisite \"Pollo\" dish, and we were off to heaven...\nArguello was memorable, in many ways...  We will be back, many times, and will recommend this wonderful restaurant to associates, friends, neighbors, and family, for many years to come...", "author": "CDR JAY C. O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-18", "description": "I dined here with my Mom and sister after a free Friday night concert provided by the Officers Club.  The service was rude and very disappointing.  I was given a hard time about requesting a decent pour of wine after I received what looked to be a half glass. I was accused of drinking it and then questioning the size of the pour.  Very poor taste by the server.   The food was decent but the menu is very limited and we were charged for just about everything...chips and salsa (which were extremely salty) and extra tortillas.   It was a fun atmosphere but based on the service alone, will most likely not be returning.", "author": "Mia G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-23", "description": "My friends and I went here twice about a year apart.  The last time was March/2016.  The first time we went, we loved everything about it.  We sat outside, wrapped in their blankets, near a warm fire.  We loved the food!!!  When we returned in 2016, our experience was different.  We sat inside, which was fine, but loud.  A party of about 20 next to us and lots of noisy children.  Also, the rosy glow of my memory from first visit was startled by the menu.  It seemed almost every dish had pork in it, which seemed limiting.  We took a long time time ordering because none of us could really find something that sounded good to us.  The reality of the food was also disappointing.  The dishes as described by our great waiter (who raved about everything) didn't measure up to his description.  The service was wonderful both times we visited.  First visit was a five star and second visit was a two star so we gave it three stars.", "author": "Nancy R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-17", "description": "Disappointing.  We were so looking forward to a Mexican restaurant in the Presidio!  The area needs some really good, down home style of food, and we totally thought, how could it not be if it's Mexican.  But alas it is not.  Small portions of over-priced food.  You don't get your money's worth.  It's too bad because with the bar and patio (which is awesome), this place could have scored!  Just a Mexican, fancy style restaurant that serves small portions at over-inflated prices.", "author": "Josephina F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-05", "description": "Food's decent, but overpriced. Service was too slow given how empty it was. I wouldn't recommend it.", "author": "Eli H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-27", "description": "Just went there for lunch and I have to say I am so disappointed. First, with the service. The woman taking orders not only has no personality but was offended if you asked her a question. Second, the portions were small and cold. $5.50 for one little taco. I ordered a glass of wine and the pour reminded me of a tasting I had in Napa. Lastly, left hungry with a $40 tab. To bad it's a great location, hopefully new management will take over.", "author": "Lorena M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-22", "description": "Traci, if you're reading this, for what you're charging, how about some waiters instead of waiting on a long line and how about WAY bigger portions. My office is just up the block from you and we're all avoiding Arguello now. I give it six months if you don't make some pretty drastic changes quick.", "author": "Rob R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-10", "description": "Mixed experience.  Good - Ceviche was outstanding.  Service was good - ate at the bar. Margaritas also good but expensive.  Bad - Fish entree was INEDIBLE - dry, flavorless, and with a gross dark green cilantro sauce on it not mentioned in the menu description.  Only ate the veggies on the plate, not the fish, and was still charged full price for the dish, with no comment or substitute offered from the chef.   Recommend sticking with the appetizers only.  A bit of a rip off.", "author": "A G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-01", "description": "I was really disappointed - having lived on the Presidio and eaten there often over the years I was looking forward to trying out the new non Army restaurant - went for brunch on a Saturday - the tortilla of the taco I ordered was tiny - there was no way to pick up and eat like a taco - had there been two tiny tortillas I could have made two tacos but as it was I had to eat half the meat with a fork - the lime dressing in the salad was way too tart for me - definitely not going back to eat - maybe for a drink on a nice day", "author": "Mary D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Had a great time at Arguello. Came in early on a Friday evening and had no problem getting a table. Staff was attentive and food was excellent. Had the pulled pork and duck dishes with a churro for desert. Bartender Gabrielle is AWESOME!!", "author": "Richard C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-24", "description": "A very disappointing dining experience!  We ordered chips and guacamole, salads and entrees.  The entrees appeared at our table first, then the appitizers and salad. We had no choice but to eat our entrees as they would get cold along with the chips and guacamole and then the salad.  The guacamole and chips were the best part of the meal.  The other things were ok, but not anything special.  We attempted to order dessert, but they were all out of one of the four deserts at 6pm, the only one with chocolate in it.  As we were the first seating, that says the kitchen didn't make that dessert. The service was extremely sloppy, with the server reaching over a person to clear plates. Traci is spending more time at her other restaurants and this one needs her serious attention.", "author": "Klaudia H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-15", "description": "Restaurant manager was brusk, impatient, rude and unwilling to assist and accommodate me as a disabled patron.  I was left standing at what APPEARED to be the seating podium and had to attempt to seek assistance for attempted seating.  The response I FINALLY received was dismissive and uninterested; likely the accommodation was in violation of the provisions of the ADA.  My guest and I left both feeling highly offended.", "author": "George D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-19", "description": "This review is not for Service - the place is less than 2 weeks old so spotty service is to be expected. This review is for a) value for money b) quality / taste of food c) ambience\n\nValue for Money: 1 star - I have never felt so ripped off in my life. The $10 wine pours are a joke - apart from our table I overheard one other table next to us ask our server the same question \"are the bartenders using some sort of a measuring device to pour these wines\". The server claimed they were std. 5 ounce pours but I have never witnessed such a blatant attempt to rip off customers with such stingy pours. The fish taco for $4.xx and the steak taco for $4.xx are a complete joke - having lived in SF for over 20 years and having eaten at a lot of places, both cheap and expensive, Arguello is one of the worst in recent memory when you look at price and compare it to what is served on the plate as far as quantity is concerned. The $18 pork shoulder and the $6 guacamole were other examples of a gross attempt by this establishment to screw the consumer monetarily when you take portion sizes into account. \n\nQuality / Taste of Food: 2 stars - The best thing served was the habanero salsa - it was creamy, spicy and delicious. Outside of that the overall taste of things was poor. Not only was the guacamole  terrible value for money,  the taste was below average at best - bland and unsatisfying - the fish taco and the steak taco were both \"meh\" - thank god for the pickled onions that come with the steak taco - at least they added a bit of depth of the meat. The tortillas for the tacos were not fresh and extremely hard when they arrived - when you struggle to take a bite of a taco due to the lack of freshness of the tortilla, that is a bad sign. The pork shoulder was the best tasting dish served - it was decently cooked and had the tortillas been edible and had the price / portion been fair,  I would recommend it.\n\nAmbience: 4 stars - the outside patio with fire pit presents a great vibe. When you have decent weather it is pretty sweet having the opportunity to sit and soak it all in. We were definitely happy to have found a seat by the fire pit and chatted with our neighbors for  a bit. The outside dining seats are likely the best place to eat when the weather is decent - they had blankets for people who felt chilly and I did see some cushions on the long benches by the fire pit for patrons to use to get even more comfortable. The inside of the restaurant is nothing special - a bit warm and noisy and par for the course in my opinion. \n\nIf I were to take Service into account, I would give Arguello 1 star overall but based on everything else except Service, it's a 2 star rating at best. I realize this place is extremely new and has a lot of tweaking to do but I'm hopeful folks are taking feedback to heart as I would love to see this place thrive and be successful.", "author": "Anon Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-21", "description": "Not only was the food unimpressive, but the bartender was beyond odd and frankly, downright offensive. To be fair, we were there on a night when they had a band and swing dancing in the Officer's Club so Arguello was slammed. However, the bartender was surly and made, in my opinion, probably the worst Manhattan I've ever had. A woman sitting at the bar commented on how rude the bartender had been to her and her group so aversion to this guy seemed to be pervasive. Later in the evening, my friends decided they wanted to eat so we took a seat at the bar, which was our only option. I usually love sitting at the bar, so this was fine with me. Well, the surly bartender is now our server and he makes the switch from surly to downright creepy. I order the pork. His response was to point at my Manhattan and say \"I can tell. You look like you like to get porked.\" Wtf? My hearing is pretty damn good so I'm sure this is what I heard. I laughed it off, primarily because I think I was so shocked. So that interaction, combined with the mediocre food will keep me from returning to this place. It's a great space and I hope that a decent restaurant is established in Arguello's place.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-05", "description": "The setting is nice, and when we were there it was one of the few spots open at the main post. The portions are very small, and the prices are high.  Overall,  I would find a different option if possible.", "author": "Jeff N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-13", "description": "Went here on Wed night and it was about half full.  The space is beautiful (it was too cold to sit on the patio, but it looked really nice), food was good and service was fine.  The price point is reasonable for the ambiance.  I wish they had a bigger menu, but we had the taquitos, the mushroom quesadilla and the shrimp entree.  The quesadilla was my favorite.  The shrimp dish was good, but it had the shells on and it's too much work for not a lot of reward.", "author": "Rose T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "It's new, so growing pains are expected. The bar service and drinks were awesome though. I'm more writing this, my first Yelp review (I'm a longtime lurker), just because it's infuriating to read the ignorant, racist remarks about a great chef. I don't know Traci des Jardins but I respect her work. And it was easy enough for me to look on Wikipedia and see that she's not a \"gringo\" as one reviewer so eloquently put it, but is Mexican-French. Perhaps the Yelpers that assume they know what Latina and Mexican mean should do their research before spouting off presumptions. Oh, and just as an FYI, Mexican food is far more than cheap tacos. Perhaps you'll enjoy the experience more if you're not expecting the equivalent of Señor Frogs jalapeño poppers from a celebrated chef.", "author": "Joan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-19", "description": "Very disappointed.  Tracy has no IDEA of what real Mexican is. I will challenge her to go to real Mexico and explore the flavors and authentic Mexican food. As Mexican American I have explore the entire country of Mexico getting to know the the real flavors of Mexican food from sea food to tacos to mole, you name it. I love the place and where the restaurant is located. Employees are careless about costumers and seems like they have no idea what are they doing. The Latino Bartender seems to feel a little too important instead of being more friendly and not a stuck up person.I work at the Film center and 100% times still prefer the old now closed Kitchen 39 restaurant and friendliness of the latinos that used to work there. I hope this restaurant get little better with time regrading service, food and prices as it seem too much $ for a taco that I can get get for cheaper a taqueria in the mission.", "author": "Leonardo G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-25", "description": "The restaurant is very noisy, making it difficult to hear. The menu is limited in it's choices. The margaritas were good. The service was very well-timed and attentive. The food is on the pricier side, and was hit and miss. Some of it was good, and some of it was not. Overall, we have experienced better.", "author": "A Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-21", "description": "Great food, however a bit overpriced and the service was average.  We came for brunch and the $5+ tacos (especially the shrimp taco) are great but a bit pricey for what they are. The breakfast burrito was flavorful, but needed salt and something to balance the dryness. At $15, it also needs to be either half the price or twice the size, it's pretty small for the most expensive burrito in SF. If they can better balance their pricing and get the service right, it could easily be a top brunch destination.", "author": "Tom A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-01", "description": "Tried to eat here last night and the place was closed for a private party - this was not posted on the web site, which I checked before going. Not good.", "author": "Diane O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-10", "description": "Very disappointing food and service despite great location and comfortable restaurant decor.  The service was terrible - the host/hostess screwed up our name on the waiting list so we waited nearly 1.5 hours and patio service was awful.  When seated, I had to finally grab a waitress after 15 minutes with zero contact (granted after my complaints, service was very good).  As for the food, the menu was limited and what we ordered - pork, chicken main courses and two appetizers - was lacking in flavor - an Americanized bland version of Mexican food.  Go to Mamacita's for high end Mexican food.  Probably won't go back except for drinks/chips on patio (guac was great but salsa again lacked any flavor and could have come from a bottle).  We also have eaten at her other restaurant in Presidio - Commissary - and had similar experiences.  Disappointing.", "author": "jeff w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-27", "description": "Came here to offer some advice on service to the management, but it seems like they have been getting plenty of suggestions for awhile now. So this too may go ignored: Instead of boring your staff with prep instructions in the doorway to the patio- blocking what little light that trickles in and causing noise population to those nearby - how about you helpful manager sir help the poor patrons you passed five times while they waited 15 minutes to place a drink order in your empty bar?", "author": "Melissa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-09", "description": "Very disappointing.   The environment is beautiful but that's all it's got going for it.   Bad disjointed service.  Mediocre minus food", "author": "nancy r."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-07", "description": "Was told a table for 5 would take 1.5 hours (they don't take reservations). Host suggested we sit on the outside benches where the full menu was available. Sat for 45 minutes without any acknowledgment from the waiter. Eventually got up And left without so much as a drink order. I live around the corner so I was hoping this could be my new spot. Sadly disappointed and will avoid in the future.", "author": "Maxwell M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-01", "description": "I'd like to be able to offer a review but, after plans to dine on Saturday night, we arrived to be told the restaurant was closed for a private event. Had we been allowed to make a reservation (they don't take them) we would have known not to choose Arguello. The hostess could not have cared less - so we were left to find a restaurant that would take us at 7 pm on a Saturday evening without a reservation. We chose Garibaldi's on Presidio - were seated at a table almost immediately and had excellent service and great meal.", "author": "Susan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Took my wife and our two adult daughters here for my wife's birthday dinner. Saturday night. The wait was 15 minutes or so around 6:30 PM.Not bad at all. We took our time and ordered items over time vs. all at once. We tried a variety of menu items and loved all of them. The food is nicely prepared and the portions are of a size that you don't pig out. The service was excellent. They were busy, but we observed that and simply relaxed. The margaritas were very good as well. Our waiter was a student at USF and he was attentive and professional. We'll go back. Plenty of parking as well BTW.", "author": "Average Guy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-03", "description": "We visited Arguello for the first time yesterday for brunch! And although they are still in the process of becoming a smooth running machine,It was an overall great experience. The restaurant was quite packed, however the manager was very attentive,helpful and the service staff, although very busy, were still gracious and polite. We tried a variety of cocktails, which the overall consensus was that they were masterfully crafted and thoughtfully created. The food was good, stand outs were the chilaquiles,guacamole and the banana pancakes. The fish taco, squash blossom and pork belly was also good but slightly under seasoned. Other than the restaurant being hard to spot, it was a happy experience! I look forward to coming back for dinner!", "author": "Elle J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-11", "description": "Very nice decor. Our server was very friendly but clearly pretty overwhelmed (maybe she was new). Took a while to get our drinks. Chips/salsa/gauc were amazing. I got the pork shoulder which was good, not amazing. I didn't anyone else's food but everyone had the same opinion. Good, not great. Probably can get better food for the price.", "author": "Alex D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-26", "description": "Went for brunch.  Great space inside and out.  Service hit and miss (had to ask for silverware, cream for coffee (twice), given no serving spoon or small plates for shared sides (and the plates mains are served on are tiny), and server tended to disappear).  Menu a little limited, but the grilled shrimp taco was very good (lots of interesting flavors); the carne asada taco something of a joke:  it is heaped full of pinto-like beans, with very little meat.  Guacamole was a disappointment, but the chips are great.  I might return if in the area, but probably just for drinks and snacks.", "author": "Keith J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-10", "description": "Unless they change their whole format, we would never go there again.  When you walk in the door even at lunchtime, the noise level is unbelievable!  Then you have to wait in line to order the food.  I thought the food was O.K., but the other 3 people with me didn't like their meals.  At the end, I wanted to get a cappuccino but gave up the idea because it would mean getting back in line!   At the very least, Arguello needs to have table service.", "author": "Patty M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-23", "description": "If you like authentic Mexican food that is delicious and healthy, try Arguello Restaurant in the Presidio Officer's Club. The view is spectacular, the food is local and delicious, the small museum with the history of the Presidio is very interesting and the drinks are good. DON'T stand in line to order, sit at the bar, order a drink and the bar guy will take your order, then you can move to a table. It's great.The food was delicious, beautiful, unique, and reasonable, the ambiance comfortable with both inside and outside seating and the drinks delicious with a knowledgable bartender. I'm going back.", "author": "J. R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-26", "description": "Arguello was reviewed in the Chronicle a few weeks ago. We ate there today and it was undoubtedly the worst meal we have had in a very long time. I have never written a review before on Yelp but this restaurant warrants a bad review. You stand in line to place your order with the cashier behind the bar. We ordered the fish tacos. We sat and waited...and waited and waited. After a half an hour my guest went to the cashier to find out where our food was. She reported that the kitchen printer (where the orders are routed to) was having a problem printing. They had to track down our order and gave the  usual  \"sorry about that\" apology.   Yet, we waited another 20 minutes for the tacos to arrive. This was the worst part. They had been deep fried and the grease just dripped out onto the plates like being poured from a bottle. Really awful food. We will never go back and strongly recommend that you give serious thought before doing so yourself.", "author": "Harvey G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-04", "description": "Went last night (Saturday) and walked in at 7:30 and got a table right away.  A good beginning which unfortunately went downhill from there.  Server was friendly but service was very slow.  We got guac and chips right away, which was the best part of the meal.  Drinks were VERY slow to come from the bar.  My friend ordered a grapefruit /tequila drink which he liked.  I ordered what was purportedly a tequila/cherry brandy cocktail.  It was very small, unbalanced and had no discernible tequila taste.  I had the mushroom quesadilla which wasn't awful, just bland and, again, very small portion for the price.  Friend had crab taquitos which he liked but said they didn't have much crab.  Only 4 entrees to choose from.  I ordered the pork ribs which were unfortunately sold out.  Being sold out of 1 of your four entrees at 8pm on a Saturday night is not OK.  My friend and I each had the duck with pumpkin seed mole.  It was tasty but, once again, an incredibly small portion for $18.  It was one duck leg with sauce, no vegies or rice or anything else.  It was more like a generously sized appetizer.  Would it have killed them to throw a few vegies on the plate?  I left $100 bucks poorer and still kind of hungry.  By the way, it was also ear splittingly loud.  I won't be in a hurry to return.", "author": "Mark R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-27", "description": "skip this restaurant--I wanted to love it and tried Arguello 4x. other than the guacamole, the food all tastes the same. the serving staff are all distracted, and have an attitude  There are much better choices in the  Presidio area--go to The Commissary across the street!", "author": "Lrg G."}
