{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Bright, airy, spirit-lifting place to work. It can get noisy on Saturdays and Sundays with the brunch crowd, but that thins out around noon. I like sitting at the big tables near the back. One of the corners is close to an outlet so I never have an issue with battery.\n\nSalads are roughly $14-17, which I like to call two-dollar-sign price range for Bougie Yelp. They're very delicious. \n\nI have designated this my new weekend work spot.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-28", "description": "The menu is short, sweet, and simple and the restaurant set up/decor is very aesthetically pleasing. I've gone during the week and on weekends and they're never empty. I've also tried to study here a couple times and I personally don't think this is the best study spot. It does get a bit noisy and their seats aren't the most comfortable to sit in for a few hours. However, it is always clean, the seats are crowded next to each other, wifi is included, and the servers are very nice. \n\nI've tried the organic matcha latte ($5), the taco salad ($15), and the organic avocado open face sandwich ($9). I am not the biggest fan of the organic matcha latte. The matcha latte was a bit bitter and didn't really taste like matcha. The avocado open face sandwich was delicious and flavorful, however, their home made gluten free bread seemed to make the meal a little too heavy for me. The avocado \"spread\" included radishes, avocado, chives, mayo, sea salt and crushed red pepper. I would recommend sharing the avocado sandwich as it is very filling. And lastly, the taco salad, which is my favorite. The salad is a very large salad and will fill you up. It comes with romaine lettuce, chicken (white meat), cherry tomatoes, black beans, scallions, cilantro, tortilla strip chips, avocado, and a cumin vinaigrette. I HIGHLY recommend it. It will leave you feeling full but not stuffed. \n\nI used to stop by after work every now and then, at around 5:45PM, and pick up a salad to go but recently, the restaurant has changed it's hours to 7AM to 5PM on the week days and 8AM to 3PM on the weekends, which doesn't really work with my schedule so now I only go when I'm really craving the taco salad. Though I would recommend this spot, as you can see from the prices of the organic matcha tea latte, the taco salad, and the avocado open face sandwich, it's not the cheapest. So if you're looking for a healthy snack or meal that's on the cheaper side in the area, this isn't the spot.", "author": "Victoria H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-20", "description": "Frustrated by this place despite finding the food to be quite good.  I've been here several times and ordered a Caesar Salad JACK'S WAY which includes four extra dollars for chicken and bacon.  The past three times I've been there they have forgotten either the bacon or croutons, and today they even managed to forget the chicken.  \n\nIt's even more irritating that there are always two people at the register and no one is checking that the orders are correct.  Spent $19 on a salad with lettuce and cheese.  PLEASE TRAIN YOUR EMPLOYEES.", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "Every item is top quality.  All gluten free and organic.  The salmon and veg spread were the best.  The avocado openfaced sandwich was also wonderful.  The best in town.\n\nI will go back!", "author": "Emily G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "Easily one of the best Gluten Free Spots on Earth\n\nEverything is gluten free so Celiacs rejoice and relax \n\nLots of healthy and yes not so healthy options\n\nOne of the few places I've had everything on the menu... so good , so hard to decide", "author": "Alan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Updating July 16, 2018 \n\nI'm dense and didn't realize this place is fully gluten free. It's expensive but my daughter with celiacs love the muffins and  he bone broth and I've found the current employees do be great. Friendly, attentive, happy and much faster than they used to be. I go to the Chiropractor next door so I have been going a lot to grab Gluten Free stuff and bone broth. \n\nBeautiful space. Lovely staff. The banana muffins were delicious. I was disappointed as they have a zucchini noodles in place of traditional wheat pasta dish. I have had this on my hot in the past, just like a spaghetti and therefore I was expecting a hot dish. Nope. Cold, Wide, flat zucchini \"noodles\" with some raw, fresh tomatoes. Not what I was expecting. \n\nThe green smoothie was poured from a jar. I asked and they said they make them in the morning. I was expecting a fresh made smoothie. It was freshly made, hours before. Very, very thick. I didn't like that but you might. \n\nThe toasts look delicious. It's a pretty high end crowd in there.  People seemed to love the coffee. The conversations all ranged from houses in Europe to expensive workout clothes and entire summers spent traveling.", "author": "Nettie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Amazing quality of food and drinks, beautiful design and friendly employees. What more to ask for :) we tried several drinks and all of the deserts, my favorite was banana muffin. Btw it's a great location to take cute photos. Will come back.", "author": "Iryna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "You come here even though it is a block away from a Peet's and a Starbucks because it is chill.  People are fun to look at and are not hogging all the seats to sip coffee and use the place as a study room.  Oh and yes it is away from all the homeless people.  Did I mention it is the way that you'd want your kitchen to look?  Clean and simple.\n\nWith outdoor seating and minimal ready to eat or microwave food items, this place allows you a quiet place to simply get a cup of coffee and meet up with someone for a short meeting.  Basically your Pacific/Presidio Heights gossip shop or cool place to run into an old friend and give a kiss and tell about your recent trip to Paris, Vietnam or the Himalayas.  But you can't tell them about it now as you are off to a Spinning class with a hot new instructor.\n\nOh wait.  This is a coffee review, right?  Absolutely the best! Coffee is coffee right?  No!  They do plain and simple espresso drinks amazingly!  As I sat there talking to my friend and listening to her blab and tell me about her trip to Australia I had to stop her mid-sentence. I realized I needed silence so I could take a sip of one of the best lattes I've had in a long time. Smooth, creamy and sweet, it didn't need vanilla or any additions to appease me.\n\nSo why not 5 stars?  Went back the next day to see if I was hallucinating.  I was not. Just as tasty.  Only problem was that it was not that hot.\n\nAnother cool thing.  No dumb hearts with their foam.  My gal gave me a \"q\" and a wink.", "author": "Erik H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Delicious food. Limited breakfast menu during the week, but several thins to choose from. \n\nThe staff is incredibly nice and helpful!", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-14", "description": "This café/restaurant has very minimalistic, cool, and healthy vibes. I've come here multiple times with friends and gotten various things. On my most recent trip I got the Chinese chicken salad which was good and served with a big white \"crouton\" that I believe would be better if broken up into little pieces and tossed with in the salad. This restaurant offers many vegan vegetarian healthy options. It should be noted that parking is very difficult to find around this area.", "author": "Coco D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "I had to update to 4 stars, even if they have mediocre/bad espresso drinks (how do you make Andytown mediocre?) -- the gluten free banana muffin is so good. I mean I don't even like gluten free or care for it or have celiac disease, I just like the taste of the muffin. \n\nThe latte was luke warm and tasteless so I had to go to another cafe to get one, because honestly I couldn't drink it. I had two sips and just dumped whatever was in my travel mug.\n\nThe ambiance is nice and they have pretty good customer service (maybe because I went during a quite/non rush time and I was the only customer there). \n\nBut that muffin. So good. Solely updating to 4 stars for the muffin.", "author": "Soo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Everything was absolutely delicious! From taste to texture, this place is the best!! Everyone was so friendly and no problems getting a lovely table.", "author": "Cj C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "I asked for egg on my sandwich and didn't know it would cost $4 for ONE egg! I didn't see the charge until I'd paid already and the receipt printed out. That's half the price of the whole sandwich. Should've gotten something else instead of the egg add on. Honestly the sandwich is better without the egg. It's kind of weird to get a poached egg on avo toast. I was expecting fried or hard boiled. I should've asked. The mocha with oat milk is good.", "author": "Amela M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-22", "description": "This is how my hot chocolate was served today. And it's not the first time, which is making me write this review. \n\nI WANT TO LOVE THIS CAFE. I want to give 5 stars to them. I want to work on our relationship. But you are making it really hard for me.\n\nThe ambiance is very cool, the menu is good but there are urgent issues they need to take care of.\n \nDear As Quoted, PLEASE:\n\n1. Clean your tables more often.\n\n2. Serve HOT beverages HOT, not lukewarm. Even though I and my friend asked for our hot chocolates to be extra hot (because hot means slightly warm in As Quoted standards), you served us them barely warm...  \n\n3. Bring customers' orders to their table if you give us numbers. Sometimes you bring my tea to my table, other times I wait for 15 - 20 minutes, get up and find it waiting for me on the counter, and it got cold. You don't even explain why it is there waiting for me cold and alone. You don't apologize. \n\nThe service quality is absolutely arbitrary.  If it's my lucky day the service is great, if it's not I feel like your employees will punch me if I ask for a thing. \n\n4. Work on your communication skills with your customers. \n\nThis is the interaction I had with one of your waitress today ( I am writing this because this is the 100th time this kind of thing happened), we asked for extra hot chocolates :), one with almond milk and the other is just regular. The waitress brought them to our table, asked us who ordered the unsweetened hot chocolate. I and my friend looked each other puzzled, then my friend said she ordered the one with almond milk. And the waitress gave that one to her, regular one to me. She left. \n\nSo what's the problem? \n\nYour hot chocolate is already unsweetened. And why am I telling this long story, because this kind of weird moments keep happening at your cafe...\n\nI wait for my order and it never comes, I find it cold on the counter after 20 minutes and your waitresses act like as if I am supposed to come and pick it from them. And I know it is not true. \n\nPLEASE WORK ON YOUR ATTITUDE. A simple sorry, or a clear question would do wonders for you. Your employees seem clueless about what they are during. \n\nThe messy, sloppy service and clumsy social interactions don't match with your elegant cafe & delicious food. \n\nYET, I will keep coming to your cafe because perhaps I am a masochist and I love your hot chocolate when it is hot.", "author": "S M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-07", "description": "So I came in this morning and waited in line like any good customer. The barista had asked the lady in front of me what drink she was going to order, proceeded to skip over me and ask the two ladies behind me. I ordered my drink anyways and saw that the two ladies who had ordered after me received their drinks before mine. I'm a huge believer in first come first serve and I did not experience that here. Whether the women are regulars and are known to come in everyday, you should still serve in an orderly manner. \n\nOther than this the atmosphere in this place is beautiful. A little over priced, but has a nice vibe.", "author": "Eli K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-20", "description": "Cute cafe with limited seating. I will probably never go back again though.\n\nMy friend had been talking about a new espresso drink - Snowy Plover, so I decided to give it a try here. \n\nThe drink consists of carbonated water, espresso and whipped cream. Except the cafe did not have any whipped cream on hand and had to make it from scratch. My issue was that no one told our group that I would have to wait over 20 minutes, while they made the whipped cream. After 10 minutes, I had to check in and also ask that my drink be remade as the espresso and sparkling water had been sitting on the counter the whole time.", "author": "Kristy K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-07", "description": "Over priced pretentious place. Only came here bc i got out of a 4 hour meeting at 2pm in the afternoon on a Thursday and needed some food - it was right across the street from my meeting and it worked. I paid $26.58 for a BLT Sandwich, a too burnt cookie and a glass of chardonnay which was the smallest glass I've ever gotten. The sandwich  was honestly a piece of toasted bread with some mayo on a large leaf of lettuce big pieces of bacon (too salty yet the only good thing about it) tiny tomatoes and sauce. Don't waste your money.", "author": "Rosa L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-25", "description": "Not good food, inattentive staff.\n\nI waited at the cash register for over 5 minutes while employees hung out and did plenty of other activities... none of which were taking my order. Most of the tables were dirty, and it wasn't very busy. \n\nI ordered fries and the zucchini pappardelle, which is supposed to be \"Zucchini ribbons, seasonal sauce.\" They both took quite a long time.\n\nThe fries were dry but thick-cut and nicely seasoned. The Zucchini was just plain zucchini noodles with sliced tomatoes. I am so shocked they would consider sliced tomatoes a sauce. Not even a drizzle of olive oil or salt and pepper. And the zucchini itself was so bitter I couldn't eat it at all. So weird.", "author": "Veronica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-29", "description": "I was strolling on Sacramento Street on my way to Laurel Village when I was immediately enticed by As Quoted's minimalist decor, cheerful ambiance, and delightful lunch varieties. The placed looked packed and lively! As a scoured the menu, I couldn't help but look over the counter to the fresh and colorful salads. They looked tasty and beautiful. It was in that moment that I knew I had to try out their hearty offerings.\n\nAlthough As Quoted's ambiance was the star, the salad didn't live up to its expectations. Don't get me wrong about the meal's freshness; the greens were crunchy, the beans and chicken were fresh, and the chips added a great texture. However, I was also disappointed by the salad dressing or lack thereof. The dressing wasn't memorable and didn't have enough spice and flavor. They do plate large portions, but it isn't worth its price.", "author": "Jessica E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "Gonna be honest -- got the SNOWY PLOVER purely for the whipped cream and it did not disappoint. Thick, creamy, and just the perfect amount of fluffy sweetness. 5/5 for the whipped cream alone. \n\nThe rest of the drink? Not sure how much I enjoy Pellegrino in my coffee. The taste kinda changes in your mouth... sometimes you get a note of the bitter espresso, sometimes you get a gulp of pure carbonated water. Interesting, but not really my thing. I do feel really caffeinated, so the drink has done its job. 3/5 for the drink. Novel concept, execution could use some work. Maybe more harmony between the different elements?", "author": "Patricia Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-15", "description": "Love the looks of this place! \nVery clean, and there was lots of people. I ordered a drink and an open sandwich for brunch, but wow so expensive. It came out roughly $15! \n\nI wish they would reduce the price for the open sandwich. My friend who ordered BLT was sadden by how small it looked. They put a really big lettuce, but little bacon and tomato. \n\nI would come here to have coffee with a friend, but I don't think I would be ordering side dishes unless I really need to.", "author": "Kiyomi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Another pale white modern café similar to Samovar Tea and Chai, this one has a little bigger space with some background Spanish songs.  I thought I wanted to go to that cozy spot after I spent some time window shopping into the sidewalk sales event of Sacramento street.  All I had to do was to keep going straight and I eventually find what I'm looking for my coffee break.  \n\nOnce again, I don't drink coffee.  I'm a heavy tea drinker.  After looking at the drink menu, I chose the beet latte (I would go for the golden milk latte made with turmeric but, oh well).  My latte made with real fresh beets retained its distinctive reddish color.  Aside from almond milk and cinnamon, the beet flavor taste familiar and different from other tea lattes like matcha and chai.  If it's possible, hopefully one day, I would love to see how the female workers brew a \"Blue Chai\" tea latte, made with real butterfly pea flower!  I would love to go back and have a smoothie, salad, or other fancy dishes if I'm in a mood.\n\nOne of the best places to settle down for a drink and unwind.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "Frequented this place many times, usually to grab lunch/coffee with colleagues.  The food is fresh and of good quality. I've enjoyed both their salads and open faced sandwiches. They also have wonderful spritzers that are really refreshing. (They also tend to run out of these).  \n\nThe space is very clean and modern. The tables in the front of the store are a bit close together and I've bumped backs with fellow patrons in the past.  However, there is more space toward the back of the store.  There's also a tiny play area for young children (toddlers).", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-22", "description": "I like As Quoted, but not really. \n\nLocated on posh Sacramento Street across from Spruce, this seems to be the \"it\" lunch spot to watch stylish new moms grab lunch with friends. You may see all the latest fashion trends from As Quoted clientele (designer bags and shoes and cute outfits). \n\nThe downside, it's pricey and not really worth the money. I always get the kale salad which is good but more so-so. I ordered the avocado toast last time I visited - how do you go wrong with avocado toast? No idea, but it was not good - bland on bad bread with too many chili flakes for my liking. I ate it because I was hungry. Turmeric late is good, coffee is always good.", "author": "Irina R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-13", "description": "This is mostly a review of their weekend brunch service.\n\nFor starters none of the tables are bussed or cleaned. We had to bus a dirty table ourselves and ask someone to clean it and they just used a napkin. \n\nOrdering food was slow and inefficient. Was asked 3 times whether I was dining in and had to repeat my order twice (it was just for avocado toast and a coffee).\n\nThe food took about 25 minutes to come out. The food itself was ok but not worth the wait.\n\nThe cafe interior is very nice/modern and their coffee is good.", "author": "J. K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-10", "description": "I met a friend here at her suggestion and parking was a nightmare here on a Friday afternoon. It's not really factoring into my rating but just a warning for those looking to visit and are driving here. \n\nI wanted to order an affogatto but they ran out of ice cream. They should have put up a sign or something to indicate they were out so I didn't have to give my hopes up like that. I settled for a latte, which was not very strong. \n\nI ordered the smoked salmon, which was good but the portion was so small. It was about 4 pieces for $15 or something like that. The spread it came with was excellent and the bread was okay. I didn't expect much since it's vegan but vegan food has really progressed in the last few years so I was hopeful. \n\nThe line/service/machine was really slow to process. I had one lady in front of me and another who picked up some to go food that was allowed to get in front of me. That's great if you're picking up but not so much when you've been waiting and someone gets to 'cut' in front of you. The inside is a bit small as well but they have 2 larger communal tables in the back, which was nice. Not sure it's worth $20+ for what I got.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-19", "description": "Update: I've returned and paid $15 for a box filled only halfway with mainly lettuce and a few pieces of chicken. It sounds incredible so I've included a photo.\n\nThey have reduced their portions drastically and yet charge the same price. I won't be back.", "author": "HipsterChick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "Amazing neighborhood gem. Whether you're looking to camp out with your laptop or to catch up over some bougie toast, this is one of my favorite cafes in the area. It's too bad their weekend hours are so limited :( \n\nIt's veeerry spacious for SF standards. It also gets great natural lighting and has a natural \"glow\" from the white interiors (read: very Instagram worthy). Also never gets too crowded or loud.\n\nThe coffee is also delicious. It is more on the expensive side for sure, but I am okay with paying a slight premium for amazing ambiance.\n\nOnly complaint is inconsistent music. Once it was 90s R&B (yay) at moderate volume, another time was LOUDDD Adele (nay), and another time was no music (yay). They also use free Spotify, so there are ads ever so often, haha.", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-24", "description": "Big on style, short on substance.  My friend and I stopped in at about 2 on a Saturday and waited 28 minutes for one piece of avocado toast ($8) and an open-faced breakfast sandwich ($12).  My sandwich was supposed to come with kale but arrived with romaine.\n\nLeft hungry, had to go elsewhere to complete our lunch.", "author": "Chris O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-23", "description": "Terrible terrible awful service. I waited one hour for avocado toast!! I politely asked the staff how long it would take and they said 10 minutes. Very ridiculous to wait an HOUR for avocado toast. The restaurant was not busy and there were no excuses.", "author": "Jenna C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-24", "description": "As Quoted is adorable. The ambiance is peaceful and airy, and the food is on point. However it's just not living up to its potential. I've been here three times and each time there's been something off:\n\n1) the first time here -- Saturday morning around 10:30 they were out of bread. Half of their menu is toast. \n2) the second time here, Presidents' Day, I ordered the delicious honey brûlée grapefruit which is what I had in place of my toast the first time... when it came out, it was just a grapefruit. I took it back to see whether they'd like to brûlée it and they only then informed me that the torch was broken. \n3) the third time -- which I am living right now-- they informed us that they wouldn't have bread for another 15 minutes (note it is Saturday mid-morning, prime brunch time) they still haven't gotten a torch for the grapefruit and they appear to have forgotten how to make a Cortado... I just burned my tongue on what appears to be an espresso with some froth on top. \n\nHere's hoping they figure out operations, this place has a lot of potential.", "author": "Lisa F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-30", "description": "Totally inconsistent. The best part of this place is the fresh white/marble decor. The coffee ordered this morning had a burnt taste. The muffin had a lump of flour in it. The toast with almond butter didn't arrive until we were done with coffee and bad muffin. Overall, a bad experience and it is surprising how poorly managed the place has become. I've had warm tasty muffins here and today, everything was awful. It is close to my home and I wish it had decent consistent quality but  $24 for 2 small burnt lattes/ muffin with lump of flour and toast that arrives 20 minutes late is really lame.", "author": "Ann W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "AQ is a great neighborhood coffee shop with friendly staff and an adorable atmosphere. While a bit pricey, it's not surprising for the area. Delicious coffee, toasts, salads and baked goods. Lucky to live so close to this awesome cafe!", "author": "Andrea C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-01", "description": "Bougie is the name of the game.  I mean, come on...we're in the Presidio you know :p \nOrganic cane and coconut sugar options for my coffee?  Only serves half and half and almond milk?  Soy milk to high of a risk for causing hormone problems?  Ok, I accept.  By the way...I've never even heard of coconut sugar.\n\nI'm a fan though!  I only came here to drink coffee (in their awesome Bodega cupware...love) and do some work.  Great space to chit chat or work; 2 large wooden tables in the back and several small tables throughout the rest of the space.  They have salad/soup/sandwiches as well.\n\nDefinitely would come back again when I'm in the area!", "author": "Mon T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-23", "description": "This is a beautiful cafe nestled between boutiques on Sacramento street. I was looking forward to treating myself after pilates one day when I walked in and ordered coffee and their kale caesar salad to take away. I guess I should have asked to double check the take away box before leaving but I don't usually expect to be scammed. Thanks for the mixed greens with dressing on the side - $13 well spent (sarcasm).", "author": "Christine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "I love this place. The decor, the ambiance, the food, the coffee. It was early on Sunday morning and my husband and I needed coffee and some light food. I remembered this place from my friend's ig post so we walked in and can't wait to go back next week. Love it.", "author": "rissa m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-22", "description": "Ok so the BLT was delicious. However, the SLOW Frisée salad was inedible. The dressing had so much onion in it (I freaking love onions) that I literally could not eat it and had to throw it away.\nI would have returned it but I was already back at work.", "author": "Irina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "There's so many delicious gluten free options here! It's a pricey place but I'm willing to pay it to have gluten and dairy free lox and a bagel for brunch. The people working there are chill too.", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-01", "description": "I usually tag along with my boyfriend when he runs errands around this area and I try to stop here and grab a coffee and pastry whenever I can. I've had the tumeric latte and it was pretty good and I felt \"healthy\" afterwards, lol. The banana nut muffin is gluten free and was moist inside and tasty. The customers here are stylish and well dressed. It's usually packed with people working or studying on their laptops. The staff is cheery and friendly.", "author": "Raebern B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "Yuuuuummmmmyyyy!\n\nAs Quoted is perfectly muted ambiance with delicious food. Loved the clean lines and minimalist interior. Even the water glasses were nice!\n\nCame for lunch today since it's a Holiday with a friend and fellow yelper/foodie. Ordered two Caesar salads and the open-faced breakfast toast to share. Also got the turmeric latte. Salad is HUGE and was perfectly dressed (option to add chicken). The open faced breakfast sandwich was also really well executed though I would have preferred non-GF bread (yes, you can tell the difference).\n\nWe sat outside and it's a very baby/kid/stroller friendly place! Lots of moms and kids came in and out as we ate and the outside seating was perfect for stroller parking. \n\nOn a quiet tree-lined street right across from Spruce (which we got a cookie from for dessert). Highly recommend!", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "Very yummy gluten free bread. It doesn't taste like cardboard, it tastes like I remember real bread tasting. \nYum. Bread. What else is there to say? \nI'm taking away one star because of the small portions. I was a bit hungry after my open face sandwich.", "author": "Diana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "I'm a sucker for the As Quoted banana nut muffin. You'd be crazy not to try it (I don't have dietary restrictions nor am I vegan so please ask the staff if the muffin fits your needs). I can tell the drinks and food are made from high quality ingredients. The presentation of the food, beverages, and the cafe itself is beautiful. Very minimalist. It's a local spot too if you're into rich fitness moms and their stroller children who occasionally scream. The fallback is the lack of space in the cafe and the staff. They tend to confuse my order and I have to remind them to bring the correct one. Overall, 5/5 food and beverages, 3/5 service, and 4/5 atmosphere.\nP.s. shout out to the red-head barista. You're killing it there.", "author": "Amy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "I really enjoyed the breakfast open faced sandwich I got here! The GF toast is a little bit difficult to get used to if you're not familiar with GF toast but I thought it was really good.", "author": "Bree Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-26", "description": "Aesthetic and posh,\nGluten-free strollers galore.\nMy wallet is sore.\n\nEssentially, As Quoted imitates the Pac Heights ambiance of B. patisserie with fresh flowers and photogenic cafe items, but at exorbitant prices and mediocre quality. I dislike how they only serve gluten-free bread (which has no health benefits unless you are the 0.5-1% of the population with celiac). \n\nToast (dubbed open-face sandwiches) ranges from a hefty $7-$11 and seems to keep getting more expensive. Their specialty is a very ironic \"healthy\" gluten-free toast topped with bacon and \"just mayo\".", "author": "Edna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "I loved this place! I ordered mocha and it was best mocha i've tried in few years. \nMy sister ordered Chinese chicken salad(i forgot the actual name, but something like that) without cilantro, and she loved it too.", "author": "Yunjin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "I wish there were more places like this--a beautiful, bright cafe with a fantastic range of delicious, gluten free options. Perfect for a lunch date with a friend. Great salads and fresh baked goods--the banana muffin is a stand out. Also loved the soup of the day made with bone broth. Helpful, kind and efficient staff. Can't wait to return.", "author": "Dana C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-24", "description": "Just ordered the taco salad using Caviar. The salad came with a long, curly, disgusting piece of hair in it. Called the shop to tell them about it (it is 2:12pm right now). No one picks up. Really poor hygiene. Someone needs to wear a cap and not wearing it. And someone needs to be pick up the phone...", "author": "bora o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-20", "description": "I live in the neighborhood, so I come here fairly often. Until recently it has been top notch. I'm not sure what has happened, but the quality has slowly been going down while prices have increased. \n\nI just got my favorite kale avocado Cesar salad with chicken to go. When I arrived home the box was 95% spinach. There was maybe half an oz of chicken (which I paid extra for) & 1/4 an avocado. The dressing was a bit watery as well. \n\nOn the positive side, all of the ingredients are very fresh and tasty. It also has great ambiance. \n\nI'm really hoping they can get this figured out & back to the amazing quality they once had.", "author": "Margaret S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "Stopped in to grab a salad to go.  They usually keep the cooler (in front of the counter) stocked with the day's salads. The cooler space is limited, so they can easily run out when busy. Not sure how often they restock it throughout the day.\n\nTaco Salad ($12)\nVery good. It's one of the healthiest Taco Salads I've had. Romaine, Chicken, Cabbage, Tomatoes, Black Beans, Avocado, Jicama, Scallions, Cilantro, Tortilla Strips with Cumin Vinaigrette Dressing. \n\nI hesitated to order it because of the Cumin Vinaigrette Dressing. Too much cumin can wreck a good dish. This dressing is very well made and adds the needed fat to the dry chicken breast. The tortilla chips are kept in a bag (on the side) so it doesn't go soggy.\n\nAs others have mentioned...the space looks very nice.", "author": "Zoran L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-25", "description": "Don't bother going here if you expect to be full after your meal. I ordered the BLT and when I picked up the box it felt empty, I opened it up to a couple slices of bacon resting on a leaf of lettuce with some very small tomato slices sprinkled about.\n\nI said this is not what I ordered and the guy said it's a BLT. Then I noticed the small slice of bread under the lettuce. I told him that I had never eaten there and this was not what I expected and could I get a slice of bread for the top? He said that it would be an extra $2. That would be a $12 snack if I went with the extra bread option. I said no thanks.\n\nAnyhow I ate it in about 15 seconds and was still completely hungry after!", "author": "Ryan V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "I have been here a few times now. It is a squeaky clean, cute, hipsterish cafe that serves various baked goods, casual lunch fare (sandwiches, open faced sandwiches, soups), and coffee/tea. It is usually busy to crowded, but I never had too much trouble finding a place to sit. There is nothing on the menu itself that distinguishes itself from the many other similar places in the city, but it is still a nice spot to meet friends for a nice cup of coffee or light lunch. The food is always fresh, well made, albeit overpriced. I always get their pour over coffee. I have tried their breads and open faced smoked salmon avocado sandwich. Delicious. Good for a light lunch or snack. I have not tried  their bone broth, but it is indeed a 'bone broth' kind of place. The service is efficient, but rather standoffish to snobby. I do like their self service station for water and sparkling water. It makes for an easier visit than to have to ask for someone behind the counter.", "author": "和子"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "I LOVE this place! It is so bright and clean feeling in here with the white pattern tiles on the wall and white tables. The staff was super friendly and gives suggestions for what they recommend. We ordered the AB & honey, breakfast, hot latte and iced matcha latte. Everything was delicious and fresh tasting. We went around 9AM on Saturday and didn't have to wait at all. We got our food in reasonable time and of course the lattes came out almost right away. I will definitely be going back soon.", "author": "Susan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-23", "description": "Meh..3 at best. The space is visually appealing done in all white with clean lines. It's super clean and crowded. The menu was the perfect size ranging from salads to sandwiches . We ordered the taco and Chinese chicken salad . Both were underwhelming in taste and lacked seasoning.- however large in portion size. I believe they were both $12. The place has numerous small two sided tables - a wall bar and two large tables for group seating. It was just OK - not sure if I would go again- \nThey sacrificed taste for \"gluten free\" crowd - ugh", "author": "Eva C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "I'm already obsessed with As Quoted and can't wait to return again. Everything from the ambiance to the delicious healthy food selection is amazing. The ambiance is open, white and spacious. I love coming here and ordering a drink/food and then working on my laptop for a good hour. They have plenty of communal seating in the back or multiple small individual tables at the front (parallel to the cashier/bar area).\n\nYes it's pricey, but the quality shows. I personally found the portions to be right - not too big but not too small, either. I always left satisfied.\n\nI have ordered thus far from multiple visits:\n- The bread/banana muffin - fluffy, light, and not too sweet. Just right!\n- Bone Broth - $4- good, tasty and perfect if you're feeling under the weather\n- The Turmeric Latte- $4- it is on the smaller side but the coconut milk makes it VERY filing\n- Avocado Toast - $6 -the Chili flakes & sea salt make a perfect combo!\n- Smoked Salmon Open Face Sandwich - $8 - LOVED the vegan cream cheese and Gluten Free bread - was delish but also healthy!\n- Green Smoothie - $7\n\n\nThey also offer some grab and go cold-brewed coffees and juices incase you're in a rush.\n\nFree Sparkling or Still Water! Free Wifi.", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Perfect for avocado toast, people watching, and coffee that fits the street.\n\nIt is located on a relaxing block.\n\nThe cafe gets packed, but it is surprisingly big.", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-15", "description": "3.75 stars\n\nA friend and I went for a long walk and stumbled upon this place.  I remember bookmarking it so we decided to go inside.  I got the green smoothie since it seemed appropriate for our walk.  \n\nGreen Smoothie - Green, chunky, fresh, healthy.  The first couple of sips was very refreshing.  After drinking half the cup, what was left were chunks of the greens.  I don't mind sucking up the good stuff *wink*, but this was just too thick.  There's a difference between juicing and blending and I guess they use the juicing technique. \n\nThe décor and service reminded me of a fancy schmancy 5 star hotel.  Interior was white and pristine and I was offered water while I waited for my drink.  \n\nAlthough their drinks and other items sold were good, it's a little on the pricey side.  Service was great.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "This place is hit or miss.  My most recent time here was definitely a hit.  I had an open faced avocado sandwich with a side of salmon and a poached egg for $14.  My friend enjoyed the salad and was surprised with the portion size (large, given the price).  I'd definitely come back.\n\nLine can be long, moves somewhat fast, tables for two along the side, and a communal table in the back.  Stay-at-home mom/housewife hangout.", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-27", "description": "This little coffee shop is so cute! I really like the decor and set up. I came in for the first time the other day on a random Tuesday afternoon and this place was packed! They do have seats and tables but it is very limited considering how busy they get. I tried their iced matcha latte and it was not as great as I expected. The flavor was very bland and very iced down. I tried to add more syrup in twice, but the drink was still off. Also got to try their gluten free snickerdoodle and ginger snaps. The snickerdoodle was pretty good but I would pass on the ginger snaps next time. I'll give them another try when in the neighborhood again. \n\nP.S. this is also one of the most expensive cafes I've been to so make sure you are prepared to spend at least $20 (before tip) on two drinks and two cookies lol", "author": "Lushi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Not sure why this places has hit and miss reviews. I'm a big fan, all the food is quality, they have a great selection of salads, sandwiches and teas/coffees on the menu. I just wish there was more outdoor seating for nice days.", "author": "Carlynn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-23", "description": "Super cute coffee shop with some salads and toasts for options. Super white and clean/modern vibes. Feels trendy and casual. Toasts look delicious but contain eggs. Locally made ingredients though!", "author": "Kelsey G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-10", "description": "The place looks very decent. I really love the decors as well as the nice ambiance. Service was outstanding, I was very surprised of the staff who took our order, she was nice and she even repeat our orders to avoid any mistakes. Had a Taco Salad, a muffin and a green smoothie. I was a bit disappointed because the cabbage wasn't fresh.", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "When you order they don't ring you for everything and also won't serve you the stuff that you want. The cashier is always distracted and you have to triple check her. The servers are rude and full of attitude. People think they are in the library and study here and not like restaurant eat. Additionally the prices are way too high. The quality of food is ok but a salad with an egg and two sodas cost $32. This is too much. Overall I think this is a stupid place and the stars previously given do illustrate it. I won't come back or recommend it.\n\n\nUpdate and my response to the manager: \nStop being coy and instead try to train your staff better. These types of issues are easily resolved if the establishment is managed well.", "author": "Kas M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-21", "description": "This café is tastefully decorated and has some delicious things to eat. The salads are great. Soups are also a hit. \n\nThe huge downside is that it is incredibly expensive, on par with a movie theater concession stand. $6+ for a small juice. $8.50 for a small cup of fruit, $3+ for a mediocre cookie, etc. \n\nFilled with moms socializing while their toddlers play on an iPhone in a stroller. You get the idea. \n\nAn excellent thing about this café is that they are very well staffed. There's always a bunch of people that are willing to help you.", "author": "A A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Delicious but exorbitantly expensive! Omg the small cup of watermelon was nearly nine bucks", "author": "Cherry J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Yes we had the avocado toast haha. I am not a believer in ordering thing that are easy to make at home, nevertheless, we like the toast, which would have been over-priced everywhere else, but we were in the SF bubble economy, so we obliged.\n\nThe place celebrates premium simplicity. Go, if that is your cup of tea.", "author": "Y Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "I was recently diagnosed with autoimmune as such much of my food has been removed, I happened upon this wonderful little magic place on vacation. I cannot stress enough how delicious and wonderful the food is it made me feel normal again, it was the best tasting food I've had in along time even before diet restrictions. The staff is helpful, friendly and utterly amazing, the manager and I'm sorry i can't remember how to say your name but it's beautiful and started with an\"A\"she is sweet and kind and wonderful. If I could give your restaurant 100 stars I would , thank you so much, I'll be back :)", "author": "Danica M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-15", "description": "The service has dramatically declined.  Although I have always felt it was overpriced, I was treating myself to a beet latte once a week and sometimes an avocado toast, both yummy.  However, lately they always run out of things (like the beet juice or almond milk) and do not inform you until you have already paid and have waited 5 minutes!  And the staff, one woman in particular, is so rude.  Almost hostile.  I asked for her name after two unpleasant encounters with her and she refused to give it to me. Until they hire more friendly staff, I will no longer go there.  They need new management.", "author": "Beth G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-24", "description": "I've been here a few times, but felt compelled to write. I live down the street and came here for a quick lunch. I waited for someone to come to the counter for 5 minutes, waited for my salad for 30 minutes in a dirty restaurant. No one cleared their plates, and the floor and tables had left over food all over it. I definitely won't be eating in the restaurant again. (Maybe take out)", "author": "Meagan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-24", "description": "As much potential as this place has, I will never return due to extremely rude staff and Managment, over the top prices for very small and \"lame\" portions. The food is good, don't get me wrong, if only you got enough of it, especially for what you pay.\nMy best advice is to travel to another Spot where the staff doesn't treat you like you are bothering them and wrong to ask for what you pay for.\nSorry As quoted...", "author": "Chelsea S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Another dream for lovers of cafes and healthy eats. As Quoted is tucked into the quieter Sacramento street and not very crowded usually. They provide delightful service and offer beautiful, delicious lattes, salads, and open face sandwiches! The interior is incredible and makes me feel creative. \n\nMy favorites are the turmeric latte, frisée salad, and breakfast toast. Have yet to try the bone broth...\n\nI feel that it's a little hidden gem right now as it's newer and further for some people to get to. I almost want to keep it entirely to myself :) It's a lovely walk through the ficus trees and quaint homes to get here from JCC. Hope they stay open forever!", "author": "Kathy Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-01", "description": "As Quoted is such a huge disappointment. I have returned a few times to see if it had improved to no avail. The service is very slow, the salads are nothing great & the employees work in a lackadaisical manner. They could care less if the tables are cleared/cleaned even when asked, they act like this is a huge inconvenience. I mentioned wishing they were open on Sundays & the response was: \"Then it would be even busier than this!?\" It is obvious they do not care about service, quality or even profitability.  Sacramento Street is hungry for new, well run cafes, coffee houses, & restaurants,etc.", "author": "Linda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "I've been a regular since they opened up this cute spot in my neighborhood. \n\nI love how everything seems simple and clean (ambiance and the food) but it feels so artisan that you really appreciate how they present their food/drinks.\n\nIf you're looking for a healthy salad or snacks with good coffee, I highly recommend this place. They have unique bar drinks like beet, tumeric lattes. All of their salads are healthy AND tasty which always doesn't go hand in hand. My favorite are the taco salad along with kale Caesar salad. \n\nRecommendations: \n\nTaco salad\nChinese chicken salad\nKale Caesar \nGreen smoothie (dark and sweet)\nHoney bruleed grapefruit \nAmericano \nAvocado open sandwich \nRegular coffee is also good \n\nThe lines can get long during lunch and parking can be difficult but tends to move along.", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Great little cafe! Probably my favorite in the area. There are so many places to sit, lots of plugs if you're going to study and the food and coffee are great! I really love the decor, it's very clean and elegant. Everyone who works there that I've seen had been very friendly and good at their jobs! Highly recommend!", "author": "Carson B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Great coffee shop in my neighborhood. Amazing toast, muffins and good coffee. Cute and trendy too!", "author": "Alicia M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-13", "description": "I hoped this would be a good experience. The Cobb Salad was so-so for the price. My boyfriend had a very expensive BLT which ended up being bits of bacon and a lot of lettuce on top of a small slice of bread. I was told I could order a latte with nut-only almond milk. When I ordered it in high hopes after the disappointing meal, the server was rude and tried to get me to drink a commercial almond milk. Another server kindly brought out the nut-only milk. However, it was truly the worst latte I have had. It was truly dreadful.", "author": "Kathleen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "I've tried the Cobb Salad and the Taco Salad from As Quoted, and both were delicious. I've eaten both inside and to-go, and both times, my orders were huge! Filling salads, but they are a bit pricier than what I'm used to.", "author": "Alyssa P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-10", "description": "Precious. Staff seemed vague and a tad clueless -- not particularly gracious or welcoming. Which should be the case when you charge $6 for a 8 oz. bowl of soup and a burned piece of toast. And did I mention the $13 salad? Salad was delish but $13? Real? The saving grace is that they're not pumping loud music out so it's actually possible to converse comfortably. For that I'm willing to pay extra.", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "What can I say about As Quoted that hasn't already been stated? Well for starters, I'd like to let them know that I regularly crave their Caesar Salad. Yes that's right, I'm craving Caesars now. But, be forewarned that you will not want to consume this salad 1) on a date or 2) if you plan on sitting in close quarters with anyone. You're gonna end up smelling and tasting like a saucy head of garlic after you're done licking the bowl this salad came in. That's definitely okay with me though. \n\nThis cafe is a gem and other than the aforementioned salad, they also serve up tasty open faced sandwiches, good iced lattes and a sweet interior filled with great natural light. The staff here is friendly and upbeat. No snobbery here, folks! This stretch of Laurel Heights is also quite charming and worth exploring. Do note though, that they close at 3pm. I made a rookie mistake of wandering down here following my salad craving only to come just as they shut the doors. Now I know!", "author": "Caitlin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-07", "description": "Parking is horrible in this area. If you're not walking, using ride share or MUNI, good luck.\n\nVery nice set up and great decor inside. Everything inside is so white, clean, and orderly. \n\nVisited As Quoted for lunch with a friend when all the neighborhood folk were in there. Overall pretty mediocre tasting food, average service and above average prices.\n\nWe order around 12:45, but did not receive our food until 1:00pm. The service was pretty slow and even though we sat directly in front of the cash register the cashier and barista looked at us as if we were visitors from another planet. \n\nMy friend and I ordered the Avocado open face sandwich, Smoked Salmon plate, and bone broth soup. Each item had decent flavor but nothing to rave over.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Love that they have some good vegan options and unique dishes! Try the Kite Hill toast with a turmeric latte!!", "author": "D. B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "The outdoor seating is lovely on a warm day in the city. The blt is delicious, though overpriced, IMO. My mocha wasn't so much for my palette, but I don't think it was poorly made. The decor vibe is mood-driven for me.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-18", "description": "As Quoted? As if! I found this place on Yelp while we were wandering the area, and seeing how cute the decor was in scrolling through some of the Yelp photos, decided to drop in.  One of the pictures showed a menu with sandwiches around ~$6..little did I know that this was 2 days after opening and prices have gone up 50% since in the last 11 months - I've added an updated menu picture for reference.\n\nThis place is perfect for you if:\n1) you have food sensitivities - dairy - gluten - nut - soy - shellfish - MSG\n2) want to pay an extra few bucks to have Instagram-worthy photos\n3) are super basic (in all senses of the word - minimalism is the name of the game here and for the most part, everything is pretty simple)\n4) are on a super diet and want teeny tiny portions - the turmeric latte we ordered was nearly espresso-shot sized and came lukewarm\n5) are on a Tinder date and need natural lighting to see what the other person really looks like\n\nTo provide some context -, I went with my husband and the entire experience was reminiscent of an episode of Curb your Enthusiasm.  He ordered a grapefruit brulee, and at $5+ a pop, knew that it would be a bit overpriced but was curious to try it out.  When they brought out a tiny half-grapefruit on a plate (and no serrated spoon to boot) he simply stated: \"When you are paying through the nose for a grapefruit, you expect a whole grapefruit\".  I pointed out the sprig of greenery on the corner his plate and that it was probably worth at least 50cents.  Seeing his displeasure, I encouraged him to go talk to them and ended up getting the second half after pointing out that the menu said \"grapefruit brulee\" and not \"half grapefruit brulee\".  While the grapefruit and the banana bread muffin we ordered were tasty, neither were extraordinary or worth the $$$.  To their credit, they did bring out the extra grapefruit and while it was just as tasty as the first half, not having a serrated spoon made it a little awkward to eat.", "author": "Mengo Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "Located at the crossroads of Presidio Heights, Laurel Heights, and Pacific Heights, As Quoted is bougie AF -- and it's not surprising. I mean, look where it sits. That said, upon walking in, I felt like I had entered the space of two secret societies of San Francisco: philanthropic, wealthy ladies who lunch AND yoga/pilates/fast-paced power-walking women+men who drink cold-pressed juices in expensive work-out attire. Needless to say, this isn't a \"hipster\" place as some folks have described. To me, this was 100% yuppie. I think the clientele (based on my experience sitting there for a couple hours) comprised mostly of neighborhood folks who feel like strolling for \"something cute\" in the middle of the day. Now, admittedly, I too have an affinity for places like this hence why I dropped by. Plus, as a Pacific Heights resident, I welcome this addition to the 'hood. It's nice to have a high-end coffee shop in a neighborhood saturated with chains. \n\nThe decor: very bright, clean lines, simple and modern but elegant design. The space looks small from the outside but it's surprisingly big with generous seating options. It also appears there is a cozy outdoor area in the back. There's also a few tables and chairs in the front. The menu: it's a cafe with salads, sandwiches, soups, etc. There are juices, coffees, teas, and baked goods as well. I didn't have any of the food upon my first visit so I cannot comment on that. However, I ordered their iced latte and it was great. I also loved the shape of the glass and the way it was presented: white and brown swirls slowly moving inside not quite integrated to make that tan color of a latte. The service: solid. I met some of the staff and management and they were approachable. Lastly, the vibe: (see above) it may be upscale-ish but thankfully not stuffy despite one's perceptions of the crowd. It's also a good spot to do a little work. I read and write a lot so this is an ideal cafe to do just that. \n\nI know I'll be back especially since it's a hop, skip, and a jump away from my place. I hope As Quoted sticks around for a long, long time.", "author": "James Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Reminded us the cafes in London. Friendly staff, amazing service, delicious pastries and healthy drinks. Will be back to try the open face sandwiches.", "author": "Mehmet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "This place is fabulous! I absolutely love their hipster style. The toast can range anywhere from $10 to $14. They are very creative in terms of garnishing the toast. Try their green smoothie too! It's amazing, a little pricey. If I were this restaurant I would at least compensate the size of the smoothie for the price, which is $8.00. Tip: please make the smoothie cup size larger! Besides that this place is great!", "author": "Cupcake 1."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-19", "description": "It's very overpriced. I paid $19.58 for a frisee salad. The poachecd egg was TINY (you pay extra $4). Besides the frisee there wasn't much. I couldn't even taste a salad sauce even though I like it light. Don't go there. You just pay for the location.", "author": "Barbara B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-31", "description": "Had the \"sweet\" open face sandwich, literally just a random slice of bread with Nutella and sea salt for $6. Got an Americano only for me to have to ask ten minutes later where it was and for them to tell me the machine had issues and requested I wait a little bit longer. Finally randomly while eating the sandwich I get a refund and an apology.\nLike why would you sell something when your machine was broken?\nAlso they should rename the place to White Ladies with Babies cause there were a ton. \nAlso the place has a really strong vibe of white privilege, the demographics inside were horrendously one sided. I guess it strongly reflects the neighborhood.\nAs for the modern hipster vibe the place has, I know a ton of better cafes with much better everything\nI.E. The Mill, Home, Trouble Coffee", "author": "Chris H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-11", "description": "The prices recently went up here and the quality has gone down. $15-$17 dollars is outrageous for a mediocre salad! And $4 if you want to add an egg on top ?! You could buy a whole carton of eggs for that price.", "author": "Ana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-29", "description": "Just had the BLT open sandwich. I wish it was bigger but because it is freaking delicious. Simple fresh ingredients taste. Service is from the counter but nice people would take care of you", "author": "Sara V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "The cafe design is very elegant-casual and the staff super friendly. Coffee is good. Food items range from OK to very good though they really should use better quality ice cream for the affogato -- it was like ew, Rainbow from RiteAid kind and ruined the espresso. Really this is the only higher end coffee shop in the area and it is very welcome.", "author": "Kate A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "Super cute cafe, free wi-fi and a big communal table in the back to get some work done. The cafe was full of mom and their infants though so I don't know if this is a place you'd want to work from (they will serve baby food soon too so expect even more infants.) I hope they will expand to include some patio seating!\n\nI had a curry chicken salad, it was more deconstructed than I was expecting. Looking at what else came out of the kitchen, it's all a little creative. But it was tasty and filling. The drip coffee was top notch.", "author": "Tatyana K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-10", "description": "Really deceiving menu items. I ordered a BLT sandwich and it was a miniature slice of toast with just a bing of salad on top. You could not see the bread. The bread had no taste and there was so much dressing on the salad. My friend ordered the breakfast sandwich and same experience no visible toast and just a bunch of salad. She found a LIVE BUG on her salad and had to throw it away. Overpriced and just not even special menu items very basic and flavorless.", "author": "Sergio E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-30", "description": "The owner Andie reached out to me promptly after I wrote this review. She was really great and it's clear she cares about making sure AQ is always putting its best and friendliest foot forward. I look forward to seeing changes in staff and QA over the coming months and hopefully being able to update my rating. Thanks Andie!", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-19", "description": "Rude awful staff. Worse service ever. Been waiting for an hour for an appetizer. They made post mate orders in bulk twice after my order and am still waiting. Three women came after me and got their order. Not even a sign of an apology. I don't even think they know what the concept of smiling is. These people are not even happy to be there. \nI asked for a refund because the food never came! Am still shaking my head. So much potential but nothing can make up for bad service!!", "author": "Khaoula B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Pricey $4.35 banana muffin, BUT it was so so good! The cafe is beautiful, clean, and tastefully furnished.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "One of my favorite brunch spots in the city- and I've been to all of them! Whether you need to be GF, love yummy brunch, want a meal that won't put you in a food coma or value good ingredients in a great atmosphere, this place doesn't disappoint. They have awesome turmeric lattes, their bone broth is legit, salads are super filling and toast are great!", "author": "Kristi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "I live in the neighborhood, so I've been watching the construction and waiting for As Quoted to open so I can figure out what it is. They opened 3/10/2016, and it turns out they're a modern cafe with top notch coffee drinks and a menu of farm-fresh breakfast and lunch items. So far, I've only had a latte here. It was one of the best lattes I've had in San Francisco, and I think that's a bold statement in this era of high end coffee. I had to knock them down a star for not offering low fat or nonfat milk (they only had whole and almond milk), but I'll be back to edit once I return for another latte and one of those open smoked salmon openfaced sandwiches. \n\n**update-- they have nonfat milk now, and I tried their BLT. FIVE STARS!!", "author": "Stephen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-15", "description": "Not very impressed from any of my 4 visits. The green smoothie we had was awful (couldn't drink it) but the Cobb salad is good. Lattes are fine. Wish they had more soups, pastries, more in general. Price is quite steep. And service is not great.", "author": "Elle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "I have been waiting to see what was coming to this location, wow, this cafe is stylin, lots of white, nice space.\n\nThe menu has salads, toasts, smoothies, coffees and teas.  All the salads sound awesome, my friend and I had the salad with the poached egg.  It was so tasty, a sprinkling of bacon, rainbow radish, really fresh greens and the dressing was delicious, just enough.  \n\nI am excited to go back, all the salads looked really good, and the open faced sandwiches look like a must.  Will add pics as I go.  Nice casual spot for Sacramento Street, the prices are decent the atmosphere and service make it.", "author": "Carole W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-04", "description": "The atmosphere is enticing and sets you at ease as you walk in.  The prices are worth the chill vibe and convenience.  Finally a coffee shop offering a turmeric latte.  I had to try it with a bran muffin.  Happy to have antioxidant alternative to caffeine.  The latte was nothing special.  You can easily make this at home.  The bran muffin is worse then a Costco muffin.  It is airy and light mostly because it is over processed.  The saddest part of the muffin is it was undercooked.  The staff was apologetic and quickly gave me a new muffin.  Unfortunate the second muffin was just as undercooked.  I will return to try a salad when I feel like a treat but will walk to divisadero for coffee.", "author": "S. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Very clean, light cafe with tasty coffee (and cookies)  and in a very nice neighborhood, I'll definitely come back!\n\nThere's wifi and power outlets, but I would recommend coming here to just have a good time instead of working.\n\nThe only minus is that it doesn't work on Sundays!", "author": "Olya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "17.01.25     First and very impressed visit\n\nFood ---------------------------- 4.5 (for a café type category)\nService ------------------------- 5\nCleaniness -------------------- 4.5 \nInterior -------------------------- 4.5  minimalist \n\nBreakfast - open faced sandwich\n\nTurmeric Latte\n   Sophisticad drink\n\nSnowy Plover\n   Not as good as Andytown\n   Opt for the Turmeric Latte\n\nAB Honey\n   Almond butter spread\n   Banana slices\n   Honey - drizzled on the top\n\nSalad\n   Super huge portions\n       Yes ... I know salad is one item that have huge amount of airspace\n   Organic \n   Well dressed without a pool of dressing sitting below\n   Strong flavor dressing without being too heavy\n\nMy first visit ...\n   Got an impression that the food is prepared by well trained cook\n        based ;to the prep work and what I see in the kitchen\n        Most café are run by regular staff who sometimes are not cooks.\n        This place gives me an impression food preparation is an priority also.\n\nOffer self serve tap \n   Plain water\n   Carbonated or Seltzer water", "author": "S.K. Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-10", "description": "Cute space, difficult parking.  Friendly service.  The turmeric latte is worth trying.  The breakfast sandwich wasn't my favorite.  In my opinion, the eggs and bacon were overpowered by the salad dressing they use on the greens.  It also was overpriced.\n\nStill, it's worth a visit.", "author": "Lucullus L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-07", "description": "I thought and best it was too loud inside, the soup was good but the food very mediocre.  I will not be back.", "author": "S.C. H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-14", "description": "Took 30 mins to get a latte. Don't come unless you have a lot of time on your hand. Taste was ok by its overpriced", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-30", "description": "This place isn't as good as some say. I've been to tons of coffee shops all around the city and this isn't that good especially for the price. The food is mediocre at best as well as the drinks. This place has so much potential to be great, but they fall short. If you're looking to try this place out I would recommend to pass As Quoted and go to another nearby.", "author": "Shaneel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-12", "description": "The staff are super friendly, it's hard not to feel compelled to tip them - 5 stars for that. Cafe/coffee shop staff are normally too cool to smile, but here, they are humble and sweet!\n\nHere's why I give 3 stars: I tried their $6 avocado \"open face sandwich\" because it looked so yummy in the pictures. But I was so disappointed because folks, it was TINY! Like so small. The bread was delicious, the avocado mash was okay...but The Richfield less than a mile away gives me WAY MORE avocado for the same price.\n\nAlso, the Avocado is listed in the menu under the Open Face Sandwiches heading. When I think open face sandwiches, I think 2 pieces of bread...but nope. You just get 1...1 slice of bread..and...it's so little.\n\nParking: sucks on a weekday lunch hour. If you're desperate, there's a garage 1 block away at 3490 California Street. It's $2.00 every 20 minutes. \n\nAlso, most of their clientele are from the neighborhood...and by neighborhood, I mean Presidio Heights' million million million dollar homes...so, ritzy middle-aged mommas dressed very nicely. Don't worry though, they won't bite. ;)\n\nIf you're into trying new coffee shops with good food, I say stop by here if you're already in the neighborhood just to try it out, but I wouldn't make an effort to come here if you're in search for an amazing avocado toast.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-22", "description": "Missing! I ordered the Taco salad to go. The only good thing I can say about it is that the vegetables were very fresh. But three things were missing: the chicken and the taco strips, both of which were listed on the menu, and flavor.  The salad dressing can best be described as \"meh\".\n\nI also ordered the soup of the day, something like lemon, orzo, chicken. Once again: meh.\n\nFinally, the soup came with one slice of toasted presumably homemade bread. You guessed it - not tasty.", "author": "R. P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-15", "description": "As Quoted has been on my radar for a very long time! The inside was really pretty! We came in this past Saturday morning shortly after they opened and decided to be adventurous that morning. We tried the turmeric latte and the beet latte. I just got back from Australia and those were two drinks that reminded of Oz. I liked the turmeric latte better but my bf didn't like either of them. He said he should've just stuck to what he knows... coffee! I think I'll go for the coffee next time too. The guy at the register/person making our drinks wasn't too friendly :/", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-27", "description": "I got the BLT with avocado and it was good, but the portions were WAY too small for how much it costed. Also I got a matcha latte and it was way too hot to drink for a while, which means that the sugars in the milk were burnt, so I just ended up not drinking it. It's a cute spot, but I wouldn't rush back.", "author": "Brett P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "Went for lunch with a friend to catch up, small menu, but I ordered the Kale Avocado Caesar and added chicken and it was delicious! Menu had some fresh sounding items in it, and they have a seasonal salad and soup they change out often. Cute modern coffee shop vibe, felt clean and fresh inside. \n\nThey were very attentive with refills of still or sparkling water at our table, never had to get up for a refill once. Lots of moms and babies/toddlers there. That was a little noisy and distracting but overall cute place. \n\nSaw lots of people there working/reading/studying, etc. I would go back for sure!", "author": "Amber R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "In my opinion, this is the best place to eat breakfast if you're gluten or dairy free. They make their own bread and the open-faced sandwiches are TO DIE FOR. My husband and I go and order one each and split a second - my favorites are the avocado toast and the almond butter and banana toast. Sooooo yummy!!!!! They also carry MilkmanSF almond milk, so you know it's local and carageenan free! Try the time to lattes as well!", "author": "Laura L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "I love this place. It may be in a ritzy neighborhood, the resturant has all the signs of being super high end and snobby. But, it's really a good ol' fashion Mom & Pop eatery. I have the good forturne of knowing the family who runs this place. I heard some background stories of how they came up with food ideas, food sourcing, and prep. It's all driven by love, just like your mother or grandmother would serve you that special treat. The food just happens to be organic and visually beautiful. Yes, I suppose some of the portions may be on the smaller side. But, this ain't no super-size, all you can eat, 3 for 1 crap. You won't find organic, intentionally crafted food at the place that offers 2 (ridiculouslly large) burgers for $3.99. And, just think about it- what kind of food cost $3.99 for such a large quantity? \nI personally think the portion sizes are perfect, all quality and no waste.\nDid I mention the family that runs this place are awesome? Andie is sweet and genuine as they come. She told me that she was concerned about some scrap wood left over from construction. She turned them into those great, and beautiful table number stands. Hearts on her.", "author": "Susan O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-25", "description": "The coffee was alright if you don't like typical coffee. It was too \"organic\" for me.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "I have a lot of dietary restrictions and I try to eat very healthy. For once I could actually eat everything on this menu. My friend and I ended up ordering a few different dishes to try everything, and it was all amazing! I love this place so much and will be taking many people here. I wish it was open for dinner. I love the zucchini ribbon with pesto!", "author": "Dena G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "SO EXCITED to find a paleo-friendly cafe! Gluten free bread and vegan cream cheese spreads. This is extraordinarily rare. They also have coconut sugar instead of refined sugar, which is super double rare. I'm so glad I found this place, I will definitely be back! I got the salmon spread with capers tomatoes and onions on gf toast with a green smoothie. Super tasty!", "author": "T P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-06", "description": "Came here on thursday during lunch time.\nThe decor of the place was absolutely beautiful. Very clean and modern. Everything is all white and wood.\nThey had some bottled juices they were selling as well in a fridge near the cash register.\nMy boyfriend ordered an espresso and I got the sweet toast.\nWe waited about 15 mins till we got our toast and about another 10 mins an employee comes over and tells us that the espresso will take a while longer due to technical difficulties.\n5 minutes later a different employee comes over and gives us a cash refund for the espresso because the machine was broken.\nThen 10 mins later an employee brings us the espresso.\nThe food was alright but pricey for what you get. I thought the toast would be all fancy but it just tasted like plain old nutella.\nThe espresso was messily made and the cup had splatters all over it.\nOverall I like the decor of the place but would not come here again because the food and drink are just average and pricey.", "author": "Michele G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-14", "description": "I'm pretty disappointed at their hours. Only open until 2pm on Saturdays, closed Sundays? It's seems like they're catering to rich stay-at-home moms.\n\nI tried their bone broth and it was bland and it came in a tiny cup (smaller than the small coffee cup). Really not worth the price.\n\nTheir mocha was way too sweet and their regular coffee was pretty bitter. \n\nI haven't tried their food but I don't like their choice of only having gluten-free bread, \"just mayo\" instead of mayo, vegan cream cheese, etc. I think it's great that they have them for people who have allergies/sensitivities but I wish they weren't the only options. I've never had gluten-free bread that's as good as regular bread and \"just mayo\" and \"vegan cream cheese\" are super processed alternatives and not nearly as good as the real thing. Again, I think they're great to have as options if you can't have gluten/dairy/eggs but as someone who can it just makes their sandwiches inferior and overpriced.", "author": "Sofia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "Just had the pleasure of eating at this new restaurant during their soft opening. From the moment you walk into As Quoted you feel fresh, clean, and inspired! The decor features beautiful marble countertops, white subway tiles, a stunning espresso machine, gorgeous brass pendants...you get the picture. I knew that if  the food tasted as good as the restaurant looked that I would have found my go-to spot while in the city.\nThe food did not disappoint!! We ordered the chicken curry salad. Delicious!!! Felt so good afterwards.. Not overly full but completely satisfied. We also tried the Avacado Caesar and the Vietnamese salad. Wowoowow! So clean tasting and flavorful! Felt very healthy yet delicious! \nVery excited that this restaurant is open. I love that they support local vendors, use organic ingredients, have free wifi, are baby friendly, have communal dining, and are super nice on top of all that!! \nWelcome As Quoted!!! Will be back every chance I get!", "author": "Anastasia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Modern. Bright natural light. Clean. Fresh. \n\nThis new eatery is a total hot spot on trendy Sacramento St. The staff are super informative, warm, friendly, and accommodating. At lunch time this hip eatery buzzes with health-conscious locals who come for a tasty, nourishing meal that is made with the highest quality ingredients. The owner is a Natural Chef and has crafted a perfectly balanced menu. Open faced gluten free sandwiches, nutritious salads with clean protein, a selection of hot drinks and smoothies, as well as some fresh baked goods... something for everyone! I will continue to come back to support this delightful little community eatery.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "Amazing new organic gluten free spot in SF, on the quaint streets of Sacramento. Amazing salads, open faced sandwiches, kombucha, Jacobsen Salt, organic smoothies, Tumeric Lattes all sourced from the best local spots! Love this place, you should come!", "author": "SF Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "I love this cafe! Everything is so yummy and beautiful! Nice staff too", "author": "Makayla S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "Stopped in for coffee when we saw they served Andytown here. Nice place with plenty of seating and friendly staff. The snowy plover wasn't as good as at Andytown, but still pretty good.", "author": "Jim A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-31", "description": "Adorable coffee shop. Clean, bright, friendly. \n\nThe banana muffin was delightful - fresh, flavorful, pretty much the perfect banana muffin. The egg breakfast options looked delightful (didn't try but will be back to check them out). \n\nCoffee and service were also wonderful.", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "The perfect spot for lunch! Great open-faced sandwiches. Everything is gluten free but you would never know...", "author": "Lori R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-21", "description": "Cute place but knocking down 2 star because I ordered the kale ceasar and it did not have anchovies or the gluten free croutons in it.  Maybe that was the joke? Can you even have gluten free croutons? I love love love giant pieces of anchovies in my ceasar so I was definitely disappointed. This ceasar + chicken also cost me $13 so not cheap!\n\nLatte was good. \n\nI'll probably come back. I'm a sucker for overpriced cafes.", "author": "Terry D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-21", "description": "DISCLAIMER:  They JUST opened and I'm happy to go back for another try after they work out some kinks.\n\nCute, clean. and sleek cafe.  The turmeric latte is what intrigued me to go and was hoping to get another breakfast item to go.  They didn't have a very clear menu or presentation of their offerings.  If you have muffins or things that are grab and go, then display them.  The turmeric latte took about 10 minutes (and there was only 1 customer ahead of me) and looked nothing like the other pictures displayed on YELP.  I got no foam, no cute little foam design, no finesse.  The taste was good, but I have had better and it was $4 and TINY.\n\nI do hope to go back and try again, although I live near a Baagan who seems to have a more focused approach in this type of healthy eating food space.  Their prices are higher due to the sourcing of ingredients (as I assume for As Quoted), but you get more appropriate portions for what you pay.", "author": "Karen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "Wow. They get it! A tad over the top with the hipster vibe, but excellent food and atmosphere!", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "I have not had the opportunity to try the food however the service and coffee is fantastic! \n\nInstant warm and friendly greeting once you enter and a very clean menu. The atmosphere is bright and the fresh flowers on the table make all the difference in a room. \n\nThe food options look amazing and I'll be sure to try it next time! \n\nSimple, understated... And wifi. Key elements to a great morning of coffee!", "author": "Diana T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "Excellent ambiance, delicious coffee (personally not a fan of the snowy plover but it definitely is a....new kind of taste) and solid food choices! Hope to be back soon", "author": "Taryn Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "This is the cutest cafe ever! Recently went on a Monday morning....I tried the Snowy Plover and the salmon open faced sandwich. I really enjoyed the Salmon! Everything tasted really fresh. Service was friendly and the cafe itself is so cute and clean. \n\nWill definitely be back!", "author": "Jeannie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "The best and closest thing to Sydney coffee I've found in SF to date! Also, their banana muffins (I think which were also GF) are unreal. Avocado toast is a little scant (as is the salmon but it's very good I'm told). The breakfast toast with frisee, bacon and poached egg is more substantial and yum!", "author": "Alexia B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-30", "description": "This place is really capitalizing on its location. \n\nPROS\nA decent cafe was much needed in this area\nTasty food - the salads have great dressing, quality ingredients\nNice range of options\nClean, trendy decor\n\nCONS\nTiiiiiiiiiny portions - for the cost, you would expect much, much more. Salad containers are light and hardly full. $6 for one small slice of avocado toast? It's SF, but I've had more filling bites elsewhere in the city. \nStaff can be a little tense during peak hours. Things get a bit snippy behind the counter, an order might get lost, etc, which doesn't translate well to customers. \n\nGranted, they're still very new, but hopefully they consider people's feedback and things smooth out as they settle in.", "author": "Ashley K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "I wish places like this would be open everywhere instead of Starbucks or Peets. I crave that Organic Turmeric Latte all day long! The design, the drink, and the ambiance are so clean and modern. A must to try!", "author": "Elena M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-07", "description": "I love the bougie and don't care how much it costs, but we won't come back because the food is gnar.  For brunch, you're ordering an open-faced something.  All the photos look great because you can't see the bread. The bread is on everything and it tasted like a vegan, gluten free stack of wet brown bathroom papertowels.  On the surface, this should be great, but the food doesn't taste good.  Never again", "author": "Gracie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "I really enjoy this quaint little spot. I visit this place once every couple of months when I drive my wife into the city for her check ups. It has a simple but unique menu tailored to more a  healthy lifestyle. I always find a place and sit and just chill, update status or read. Good latte's too. It's kinda pricey but not for its location it's pretty much on point but coming  from the east it's always a wake up call when I travel to and eat in SF. But always totally worth it", "author": "Doug T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "Great when it is not too busy, however during the morning rush between 9am to 11:30 ish you must budget at least 15 minutes to wait for an espresso shot and 30 min to wait for your $15 avocado toast. Service is too slow and inattentive to merit the jacked up prices. But they do have the best coffee in at least a 3 block radius. Verdict: meh, but I'll be back.", "author": "Natalie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "Just ate brunch here. Such a nice, bright, casual place and the food was fantastic. The wait wasn't long and we found seats easily, which was nice on a Saturday morning. \n\nMy wife and I had the special of the day which was deviled eggs over bread and avocado (I elected for no bacon), a taco salad with chicken, a kale green smoothie, and to top it off a chocolate cookie and ginger bread. The deviled eggs dish I give 4 stars, the salad an absolute 5, the smoothie a 4 (I'm not a huge green smoothie guy though and my wife loved it) and the cookie and ginger bread a 5. The staff was also very nice. I'll be coming back for sure.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-08", "description": "Seriously....no Splenda, Sweet n Low, Truvia, Stevia? I forked over $3 for barely passable Americano before finding out this place offers only high carb white sugar or high carb organic date sugar (maybe it was coconut sugar) as sweeteners. Is this some new niche marketing angle?  I asked the barista if she had Splenda or Stevia hiding somewhere and her response  was \" no, we only offer healthy sugars.\"  Seriously? The owners need to watch \"That Sugar Movie\" if they think crappy processed sugar is better than Stevia. I ended up walking to Starbucks for sweetener which is where I'll be getting my next Americano, too.", "author": "Kim W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-22", "description": "Food ok but service confused and very slow. They ran out of bread for a BLT and just brought out a small piece of lettuce, tomato, bacon, with NOTHING ELSE on the plate. Really?", "author": "Olivia M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-30", "description": "Oh, and the menu board is incredibly difficult to read! The spacing of the letters is awkward. Kind of important when a lot of vegetarians/vegans are frequenting.", "author": "Richard R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "I need low carb keto-friendly food right now. Just discovered my local cafe, As Quoted has a great selection of things I can eat for any time of day that keep me on plan.   Just had the SLOW Frisee salad with bacon and poached egg and lemony viniegerette and a cup of bone broth.    It hit the spot!  Thanks for making home made nutritious healthy food available on Sacramento Street!", "author": "Traci T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "Really tasty food in a chic little place and cute area!!  My mom had the BLT toast and LOVED IT. I had the almond butter toast w/ banana (both on gluten free bread!!) super yummy and filling. Definitely worth it for a lunch stop in San Fran.", "author": "Shayna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Ambience, convenience, awesome staff, tasty food, great décor, ideal seating arrangements for small groups and also for individuals trying to get something done, low noise level, well thought out power for laptop users, fresh pressed juices on hand, unusual coffee concoctions, tasty cookies, excellent salads. In a couple words - excellent execution. Good job! If there is any negative at all - it's that I really really really wish they took Apple Pay. Square & Verafone provide easy access to NFC payment. Just something to consider for all of us smartphone users who just want to tap out. :)", "author": "John-Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-31", "description": "Great concept - super modern and cute restaurant but way too pricy for what you end up getting. You pay $12+ for two pieces of toast with lox and the toast is way too small to have two adequate open face sandwiches. Their kitchen is also open so customers can watch and they didn't seem to care texting and then handling the food.", "author": "Molly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "Beautiful coffee house with healthy elegant food options.  All breads and pastries are gluten free, but also taste delicious.  You won't miss the gluten.  Decor is clean, stylish and serene.  You'll want to move in!", "author": "Nan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-10", "description": "Worst service I have ever encountered. I am really baffled how they can stay open. Nothing can make up for bad customer service and very poorly trained and rude personnel. I am not sure whether the owner or manager are aware of how this place is really run. Any stakeholder on this business should look into it.", "author": "Youcef M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-08", "description": "I love their muff-tata and gf banana muffin, both super delicious. I also ordered the snowy plover and it doesn't compare to the ones from Andytown.The barista added way too much seltzer water and not enough coffee. With ice and whipped cream added, it caused my drink to over spilled. It was a mess. I'll stick to the snowy plover at Andytown, but I'll come back for", "author": "Barbara C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-22", "description": "Love the ambiance, but the \"hot\" chocolate was by far the worse hot chocolate I've ever tried. It tastes more like warm (whole) milk with a hint of chocolate than anything else.", "author": "Danna B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-14", "description": "I really wanted to like this place. I only live a block and a half away so it's great to have a neighborhood cafe around. The premise seems like it's on point--slow food, local etc. The place has plenty of seating. It's all set up to be great but it fell short. Maybe because it's new and they're still figuring out the kinks? But really some things should be thought of immediately and remedied. I ordered the kale, avocado Caesar salad. All Caesar salads are pretty basic... They must have lettuce, Parmesan (they're using the cheaper pecorino) and croutons and the dressing. This ones a bit different because of the kale and avocado additions, which I'm totally fine with (I'm all for creativity). When the salad came out, it was a fine portion but to my discovery there were no croutons as listed. Croutons are essential to a Caesar salad. Maybe they just forgot so I asked. Nope. Apparently \"we've never had them. It's listed on the menu, but we haven't had them.\" 1) put a note on the sign! 2) don't call it a Caesar salad 3) if you don't do the rest tell us before we pay\nOk, so here's the funny thing. The barista meant well. She asked if I'd like a cookie or a slice of bread to make up for it. I said I'd take a slice of bread. She said \"normally it's extra for bread on the side\".... Hmm ok cool. Good to know. Minutes later the kitchen guy comes out apologizing with literally a slice of bread that he must've put in the toaster and cut up into little square pieces. What?! These aren't croutons. Don't even try to disguise it. Now I wanted a slice of bread but instead got some soft cubes with burnt edges. \n\nI'd like to try the turmeric latte. When I can justify spending $4 for it maybe I'll drop by again but I'm staying away from the disgrace of a \"Caesar\"", "author": "Stella H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "A little pricey but everything tastes really good. Even the muffins are super fresh and godly . The place is also decorated very nicely ! Great place to work", "author": "Shirley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "A fine postmodern place where a woman alone can enjoy a healthful meal, without waiting for fancier places to open for the evening. Just up the block from The Ribbonerie.", "author": "Dani L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "I've been here a few times since and tried them again, and I really like it now!  The people working at the front are friendly, and everything has been so good.  Whether it's breakfast or lunch.  The chairs aren't really designed for lounging and staying a while, but that's fine with me.", "author": "Geri C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-17", "description": "Mediocre cafe au lait, underwhelming sweet sandwich, too bad $10 down the drain except for the pleasant environment and location.", "author": "Patrik A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "Yes, gluten free, organic, fresh, delicious, high quality, high prices, some poor serving sizes... zuchinni paperdelle.... crazy", "author": "Emilia G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-16", "description": "The avocado toast was quality and the atmosphere was elegant. The help was ever so helpful. The turmeric latte was a bit odd in my opinion.", "author": "Fernilla S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "Banana muffin was killer ! Coffee was great ! Highly recommend. Servers were really excellent (kind and helpful with children )", "author": "Imran M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "The ambiance of this place is super cool--white everywhere, very bright, and they got dope flowers on all of the tables. The coffee is really good and the opened face sandwiches are bomb (especially anything with lox and lemon). It wasn't too crowded when we came here but I could see how it can be during peak hours. Parking also was not too bad to find.", "author": "Song V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "I love their menu: very healthy, totally tasty, best cesar salad, great coffee, and their gluten free bread and muffins are awesome. What I didn't like was that it was noisy and the seating doesn't have backs. (Really uncomfortable seating is just a no-no)", "author": "Pamplemouse L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-18", "description": "Food is fresh, service is good and staff friendly. Fav is the salmon plate and avocado toast. If I'm in the area I will definitely stop by.", "author": "Beverly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "San Francisco's best spot for a deliciously healthy breakfast, lunch, and coffee. Their sandwiches are served on a single slice of gluten free toast and they are exquisite. The Avocado toast is a personal favorite, their GF bread is so soft and absolutely delicious that anyone can appreciate it. Lastly the super chic white decor and friendly staff add to the overall great experience!", "author": "C C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Friendly staff. Delicous food and coffee. The baristas are quite talented and I also had this amazing juice and raw zuchinni pasta. Definitely would recommend.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "Delicious turmeric milk and avocado toast! Very health conscious food with a farm-to-table feel. It's a new restaurant so I feel they're going to be on the up-and-up very soon- the owner even works in the kitchen! Beautiful and minimalistic aesthetics. Can't wait to try more of their goodies!", "author": "Martine M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-04", "description": "The drinks are cheap compare to rest of SF (Castro and SOMA)\nNot sure if it's because of zero sugar or I am sick, the chai latte doesn't have much taste to eat. Feel more like I am drinking steamed milk.", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "Amazing. From atmosphere to coffee to their banana muffin. Everything is spot on. Love the fluffiness of the banana muffin. It's like no other. Almost like 　　馬　拉　糕. Flavor doesn't taste artificial at all and the sweetness is just right. I'll be back again soon.", "author": "G C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Love the coffee here! It's a great place for breakfast and lunch. I had the AB&J open face sandwich and loved it! The restaurant is beautiful too.", "author": "Christine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "Clean, cool and good! Very fresh, tasty and innovative gluten free food. Great ambiance and service. Great drink selection - tough to decide between bone broth, turmeric latte or chai latte. Very fresh salads and open faced sandwiches.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Love this place! I have celiac and a dairy intolerance and had the best meal ever! So excited about this place and will definitely be back.", "author": "Richard G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-23", "description": "Lovely environment for working and great gluten free options. I really enjoyed my salmon open faced sandwich and the salads looked delicious as well. One note is a lot of the dishes have nuts so if that is a allergy as well you should ask before ordering. The gluten free bread is but free though and I enjoyed it.", "author": "Tess B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "I usually don't bother writing reviews unless I think they deserve it. After reading some of these reviews I have to warn you to not be discouraged!! I came here last Friday and loved there menu, beyond my expectations! Although it was extremely busy during lunch (around 12pm), we managed to find a space to sit in the back. We sat down and 5 min later this young lady (I think her name was Alejandra) offered us water/brought our food to the table. They have sparkling or flat by the way. We waited about ten minutes until our food came. We ordered two turmeric Lattes, avocado open face sandwich, a taco salad and a muffin for desert. Food was amazing and didn't disappoint. The proportions are just enough to fill you up! The young lady who brought our food told us that they recently opened, haven't been open for a month yet! I'm definitely coming back!", "author": "Anabell W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-20", "description": "We had high hopes for this very Instagram worthy spot. Unfortunately it disappointed on all fronts. Our meal arrived cold, with a mealy avocado. I tried to customize a latte and juice and was disappointed to realize they are all pre-blended. The staff was unfriendly and unhelpful. Such a great concept but terribly executed. We will not be back.", "author": "J S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "This place is a goddamned Portlandia sketch. A staff of seemingly hundreds doing nothing aside from looking affected, bored, and almost insulted that you dared order a slice of toast for $8. Probably why it takes them almost 30 minutes to lightly heat up a slice of bread and smear skippy on it. But hey, the tech kids who outgrew the Mission when they accidentally raw dogged it one night need some place to feed their kids grapes after yoga.", "author": "Scott B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "Hallelujah - finally good food and coffee in a nice space on Sacramento!", "author": "Susan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Came here to try the turmeric latte, was not disappointed. Staff is courteous and space is open and welcoming.", "author": "Sobia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-20", "description": "The coffee and employees are great as is the ambiance and overall look/feel of the place. It's like the Apple store of cafes. White, clean, and simple yet inviting. The restaurant is only a month old so they're still figuring out their processes of serving guests, which they told me. I've worked at a restaurant before so I totally get it and while my latte took longer than normal, they gave me a credit for a free coffee as I had to wait...however, it was so good and such a nice, clean place to be in, I would have come back anyway. Great new place in the neighborhood and can't wait to try the food - they even have gluten free croutons! Like srsly I haven't had a crouton since that unfortunate celiac test. *Hello lover*", "author": "Stephanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Love this place! ESPECIALLY THE TACO SALAD. Service is great, food is fresh and tasty! Prices are reasonable given the quality! Highly recommend", "author": "H B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-27", "description": "After waiting over a year for the restaurant to open, I must say that I was disappointed in the food selections. the The cafe is very nice , clean and comfortable BUT, today I ordered the BLT to go. When I picked it up, I thought it was a little on the light side and when I opened it, I literally thought they had forgotten to put it in the box. There was one slice of bread, spread with mayo, covered with lettuce , 2 cherry tomatoes cut in half , and one piece of bacon! That was it.....all for $8.00. In no way was it a meal.....a very small appetizer perhaps. If you are hungry, this is not the place to be.....coffee is good, employees very nice, but their portions of food are terrible. I don't think I will be going back for anything except coffee.", "author": "Gail B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-06", "description": "The store is very well designed and the espresso station is very cool. Very hi-tech. Coffee is badly needed in this neighborhood but, unfortunately, As Quoted falls short. I can't really say how good the coffee is, but given the wide availability of great beans locally, I'm going to assume it's good. Unfortunately, the barista did not know how to make coffee drinks. The milk in the cappuccino was way too hot and there was no foam. So the espresso was killed by too much, too hot, steamed milk. Not drinkable without letting it cool for 15 minutes but no point as the coffee was already dead. The best Blue Bottle innovation was not their beans or stores but the requirement that other shops who used their beans had to have their baristas trained.  Obviously not the case for the As Quoted beans provider. I assume that this barista was new, in training. But there is no reason at this point in time to have bad baristas at high end coffee shops in SF.   There's already a Starbucks in the neighborhood if you want bad coffee. And, unfortunately, Peets is better than the coffee I got at As Quoted. Neighborhood is still in need of a good coffee shop.", "author": "Neil B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "So glad to have this cafe in the neighborhood! I work nearby and although Laurel Village has plenty of food options, sometimes I just want something light and healthy for lunch--the kind of food that won't give me indigestion or food coma for the rest of the afternoon. The day I was there, the soup of the day was carrot, ginger and bone broth and it was dee-lish! My only complaint is that the portions are smaller than I expected. But there's plenty of seating and free wifi to make up for it. Can't wait to come here again and try out the rest of the menu.", "author": "Teresa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "The decor is sensational, simple and with great wooden and brass details, all white clean and bright with a back deck.  The coffee is very good and fairly priced as is the food. Tried the grapefruit brûlée and it was delicious! Pretty busy and the service was kind and not stressed out like a lot of coffee spots tend to get.", "author": "Amanda V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Not only is the food unique and delicious it is such high quality and nutritious. The decor is beautiful and calming. The tumeric latte and bone soup are nourishing and are indicative of   the attention to detail and time spent on developing recipes and the menu. A wonderful addition to the neighborhood and the City.", "author": "reggie g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "I met a friend today for lunch and had my first experience at As Quoted and was truly thrilled!  The environment is bright and clean.  The wait staff polite, friendly, and attentive.  I like that they had a community table as well as some small tables for personal chatting.  :)  The menu is small, but quality.  4 salads, 4 open faced sandwiches, teas, bone broth, smoothies.  All healthy, clean food, which is how I like to eat.  The Chinese chicken salad was light, clean, and tasty!  Would definitely have it again.  I can see why my friend is addicted!  Interested in trying the kale caesar as well.  We also shared one of the chocolate chip cookies and I was hooked!  Great texture, creamy chocolate chunks, melt in your mouth goodness, with a touch of salt to bring the whole thing together.  I honestly thought about ordering more to take home, but resisted...this time!  That ensures I have to return soon!  Great location, the businesses in the neighborhood seem happy As Quoted is there.  I am excited to see how the menu evolves.  Thanks again for a great experience!", "author": "Lynda C."}
