{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "One of the best dive bars in my opinion, bartenders are friendly and speedy, prices are reasonable, the atmosphere it's a mix of pos work and locals from the neighborhood, one of the few bars in the area the offers a smoke area indoors without the need to go outside and a pool table in the end that always sparks some friendly and fun vibe to your night", "author": "Rubens T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "Interesting little spot. Couldn't complain about the drinks and service was good! Stopped in on a whim and want disappointed.", "author": "Monique H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "We randomly chose this bar to meet at as a pre-dinner spot - at 8pm on a Friday just missing their happy hour, this spot was busy and it was hard to find a spot to sit right away. I had The Rose, which was a nice summer drink, super light and refreshing, and even for it not being happy hour, very well-priced! I think the total for 3 drinks came to ~$34 before tip. Music playlist was fun and dance worthy, and the pool table in the back was in constant use! They also allow dogs, so we got to meet a few cuties as we hung out there! Great location to be near to some good food places and bars, and such a generous happy hour of 2pm-8pm that I'll know I'll be back!", "author": "Marites S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "We saw this place while walking around earlier in the day and thought it looked pretty cool. So, after dinner we walked around a little more, took uber back to the hotel and decided to come check this place out.\n\nIt has a really cool atmosphere to it from the wood flooring to the fireplace to the red lights behind the bar. Even the bar itself has a really nice patina to the wood. Smoking is only permitted in a small designated area. It did not smell of smoke inside. \n\nThey have a happy hour from 4pm to 8pm every day with $4.50 draft beers, discounts on well drinks and specialty cocktails which are featured on the boards behind the bar. I ordered an Elysian Space Dust IPA on tap and my wife ordered a Pomegranate Margarita. Both of which were very good. The service was very friendly and efficient.\n\nWe sat for a while and reminisced about the days events before heading back to the hotel for the night. \n\nThis is my kind of bar to hang out. Cheers!", "author": "Mike B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-22", "description": "I'm all for a good dive bar but...... the bartender on Monday 5/21/18 at 530p was taking shots with customers and not taking our order. When she finally came by, she didn't know what was on tap. Couldn't identify the beers and when asked \"what is the Faction that you have on tap\", she couldn't identify it and then said \"you wouldn't want it anyway.\" My friend had 2 mixed drinks which he said were so-so / a little weak. Loved the décor, space is cool but the bartender needs to step up her game. If you want to drink on the job, that's ok if you're doing your job!", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Bacchus Kirk has quickly become one of my favorite neighborhood hang outs. \n\nThe drinks are good, and the service is even better. Rebecca is not only a fast and efficient bartender, but really has a special way of making everyone feel welcome and taken care of. I never feel snubbed or like she doesn't have time for me, even when she has a full bar. \n\nYou can bring food in, and there's a pool table. A fun spot to imbibe at.", "author": "Liane V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-05", "description": "Very red inside and a decent place to go after work. \n\nWe ordered the drink specials where you get a shot + beer or a well drink for only 6.50!\n\nThe bartenders were nice but I don't like dive bars too much so I thought the venue was alright.", "author": "Brianne I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "After taking a brief survey of the reviews written about Bacchus Kirk, I can definitely tell you that this will not be the worst review you will read.  Ai yah.  This is a terrific neighborhood bar for this particular neighborhood, which is Nob Hill.  Some would label it Lower Nob Hill, some would even go Tendernob.  People who call this the Tendernob are clueless.  \n\nBacchus Kirk is totally legit from a neighborhood bar standpoint.  Great mix of taps.  Cool local patrons.  Good Happy Hour.  And, I won't lie, I am not a huge cigarette smoker, but I know some people who can't go ten minutes without a smoke in their hand, and this place has the smoking porch.  They have a fireplace and a pool table, and it is always comfortable. \n\nYou will find this a place with a terrific bar that plays a lot of roles.  It's local-oriented, but this is an area where a lot of transplants end up.  The bar opens early and the Happy Hour is deep.  It got a bit more expensive lately, but I will attest to a $4.50 solid Draft Beer list.  \n\nThe people who come here are solid.  It's not fratty/douchy like some places.  It's full of pretty smart folks.  They have good bartenders from my experience.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "My late night spot! But also, my potential daytime spot that feels like late night. This is my local dive bar and I love this place. It is not gimmicky or pretentious (as SF dive bars are want to be sometimes) and the bartenders are the best.", "author": "Lei T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "Great little neighborhood spot! The drinks are strong. The crowd is not too crazy on a weekday night either.", "author": "Leila H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "My Indian American friend was called the N word by a bro tonight. When he confronted the bro about it they were both thrown out of the bar. The staff clearly did not have his back in the matter when they should have. Appalling that they don't seem to have an issue with this kind of behavior. I'm disappointed that this happened in a city like SF! I would not go to this bar period based on their attitude about this kind of behavior. No thanks.", "author": "Marian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "Love this place! If you're from out of town and want a local vibe with great service, selection and prices this is the place.", "author": "Denny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Best bar in the Tender Nob. Had some great times in my early 30's in that joint. Cool fireplace and (may be gone now) a smoking room where we had some memorable conversations.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "-Fireplace\n-Juke Box\n-Cheap Drinks\n-My kinda place! \n\nFound this spot after a show one night while waiting for traffic to die down.  Pleasantly surprised.  The guy at the door was cool and welcoming. Friendly and  informative bartender,  fun lil' dive!  \n\nCheck it out!", "author": "Dee C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-28", "description": "i recently had a bad experience at this place. i live in the area, and park on the street. there was an open spot in front of baacus kirk, as i attempted to park 2 patrons from this bar came out and offered to move the scooter that was parked on the street, to allow more room. they insisted on asking for $20. when i refused to pay, they retreated back into the bar. very soon another person, a lady, came out from this bar and offered the previous 2 guys would reposition the same scooter for 2 beers. I lived on this street for 10 years and have never experienced any hustle like this. This bar clearly is attracting a very a very bad clientele, be careful of this place. if my experience happened outside in the full light of day, god only knows the \"hustle\" that is going inside.", "author": "Cornelious W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Awesome place for a drink. Good tap selection, great ambience, and music is not so loud that you can't have a conversation.", "author": "J W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "Jackie, you the best. Specific drink request, delivery of the drinks on point. .  Only reason i gave it a 4. I had to walk up one more hill.", "author": "K B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Hands down the best marg in town.  Spicy but not mouth on fire.  Friendly bartender, a pool table, and a relaxed vibe.", "author": "Alex E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "My buddies and I were looking for a bar to play pool at before one of them had dinner plans in the area. We initially went to golden gate taproom and immediately regretted this decision. That place seriously sucks..... Searching for other bars in the area we came across Bacchus Kirk. I fell in love with the Scottish? bartender, She is super cute and her accent makes you feel so welcomed and loved.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "Might've been a 3 or a 5 star. Few drinks in so I'm not sure. I left a credit card and they promptly texted me and I was able to pay close it up. Edits they opened. Thanks folks!", "author": "Eric D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "'A very chill bar' as it was recommended to me. Chill bar, indeed. Nice hangout. Laid back. Great beer selection, about 12 taps. Killer tunes. Bartender Kitty the coolest and absolutely as hot and sexy as can be.  Love her and she should ping me when she moves to Bed-Stuy. Oh yeah, and a regulation pool table to boot!", "author": "Charles S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-28", "description": "Still my Favorite Bar in the City after all these years. \n\nGreat Bar Tenders, Music and Local Crowd. \n\nThey have a Pool Table in the back with a Fireplace in the corner. \n\nAwesome Happy Hour and did i mention you can play DICE?!!\n\nYes, Dice... I will take your money though so watch the f@ck out.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "My kind of bar. Great cocktails, good prices, sweet happy hour deals and a pool table! The atmosphere was awesome, definitely on the dive-y side, but that's how I like it. The bartender was very nice and dang could she make a mean cocktail. Played a couple rounds of pool and all of the patrons were really friendly and fun to play with. I'll definitely be coming back the next time I'm in the city.", "author": "Macy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "It's a dive bar! The drinks are simple and decently strong, and the prices are reasonable. There's a pool table in the back, and the place doesn't seem to ever get too crowded.\n\nIf you're looking for a basic dive where you can unwind at the end of a long day, this a good choice.", "author": "Dan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-04", "description": "A bar with the best drinks and happy hour in town. The staff was friendly and people were easy to talk to.", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "This is one of my girlfriend's neighborhood spots, so I've been here a few times after work. It's a dive bar, but I love it! $4 pints during happy hour!\n\nThey have a long bar, a couple tables, a pool table and a smoking room. I typically hang out in the smoking room with my gf gabbing and drinking beers. Many many beers. Over hours at a time! (Yes, we can talk a lot. Especially with alcohol!)\n\nI love the chill atmosphere here. It's never too crowded, which I love since we can always find a seat. When I'm looking for a laid back time and some beers after work, Bacchus kirk is the place to be!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "Juke box, pool table, fire place, cheap drinks. Great place to hang out with friends.\nI've been here twice and neither time was overly crowded.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "Pretty chill locals place, I love the fireplace (unless it's hot out) and it's a good place to hang out for a while. What I don't like is sitting near the smokers cage... it bleeds out.. and although the bar staff is friendly, getting their attention at times is a hassle; however I assume that could be because I don't frequent enough. It is what it is. But good place we will continue to frequent.", "author": "Chuck R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "My favorite place in the world to hang out! Great fireplace, great people, and the bartenders are the best! They also have a pool table and a smoking room!", "author": "Jemma P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "Bar.  Sitting area.  Pool table at the back.\n\nMemorable drink - Spicy Paloma - she sounds like a prostitute, ha!  2 seconds into the sip, you feel the spicy jalapeno take over your mouth.  And then everything calms down.  LIKE!", "author": "Pam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-05", "description": "\"I really shouldn't stay.\"\n\"Baby it's cold outside.\" \n\nBacchus Kirk is such a cozy bar that truly makes you not want to leave especially when the temperatures dip to near freezing in SF. Ok it seldom gets near freezing but I can be a wus. Thank goodness for mulled wine which is a special today. \n\nBartender was super delightful and happy hours till 8 are among the latest in the neighborhood. $3.50 pints and $2 of specialty cocktails. There were even free hotdogs tonight. \n\nFind a place by the fire under the faux ski lodge roof and suddenly it's not that cold out anymore. Well baby, I guess I will stay.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-21", "description": "Came by here with some co-workers for a drink. It's your basic dive bar, not really many interesting folks here. The drinks are reasonably priced and they have lots of tables and seating. It's not the best choice for the area, but it's also not a bad place to get a drink.", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-29", "description": "Pretty legit/chill bar in lower nob. We randomly stumbled upon this place, packed it with 30 co-workers, and began to flow alcohol. There was only one person working at that time, Kirsten, and boy was she hauling major ass. With nearly 50-60 people trying to order drinks, she was running all over the place, and did it with a positive attitude.\n\nShe made great drinks, got us our drinks as quickly as she was able to, and had fun with the crowd.\n\nThis spot is very chill, has TVs to watch sports games, and allows you to bring in pizza from across the street. Wish I found this spot earlier.", "author": "Albert K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-21", "description": "Chill little bar near union square, which is becoming one of my favorite neighborhoods to go out in. The drinks weren't bad, and the atmosphere was awesome!", "author": "Zach H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-03", "description": "Sat at the bar alone for about 10 minutes\n on the end waiting to order a drink. After the bartender came my way a couple times after serving a crowd that had just walked in she finally came over.  But then she checked the ids and served two other people who just walked up next to where I was sitting. It was poor service because obviously I was waiting for a drink with no one else around me.", "author": "Kyle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "This is a great neighborhood bar. Great staff and ambience. A gem with great selections, specialty drinks and attentive staff. The music...killer. Wish the drinks weren't so expensive, but I'm coming back. On payday ;-)", "author": "Bil G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "My husband and I came here with a friend who lives in San Francisco and appreciates this bar.  We were visiting from Seattle because my husband was training in San Fran for work and we needed something to do with a Saturday night.\nTotally a legit place to be!  Dogs to cuddle everywhere and the angry lesbian behind the bar was uninterested in helping us but loved our friend's pretty straight girlfriend.\nWe lounged around here for an hour or so.\n\nBring on the Bacchanalia!\nJust kidding it wasn't that exciting.\nBut it was definitely worth drinking at!", "author": "Sean C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-27", "description": "The bartenders here clearly hate anyone who darkens the doorway. \n\nIf you enjoy passive aggressive bullshit,  then Goddamn, this is the place for you. \n\nIt looks like a nice cozy spot, with the fireplace and the pool table...but it's a lie. A forest fire wouldn't warm you up from the cold shoulder you're going to get. \n\nMaybe you'll need to make it rain as soon as you walk through that door. I have a feeling it would require a lot of bens to make these hens crack a smile. \n\nGo to Edinburgh instead.", "author": "Annie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-14", "description": "Good atmosphere and decent cocktails, though I didn't find it to be a standout considering the wealth of options in the area. The fireplace is nice and they do have a pool table, though. I will probably end up coming back here since it's right across the street.", "author": "Ananya M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-24", "description": "Good bar. Great happy hour specials. Friendly service. \nSuper Dive-Y... not that there's anything wrong with that.\nThe music was way too loud sometimes and almost indistinguashably quiet other times. Bad sound system I guess. Most of the songs contained an abundance of F-Bombs, which is fine as long as they're good songs. In this case... not so much.\nIt was okay, but one drink was enough in this bar.", "author": "Charles S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-10", "description": "Absolute worst bartender. She was at other side of bar drinking & talking to friends while 7  different patrons waited for her. This occurred 2  separate times. 3rd time we all left.", "author": "Evette M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-10", "description": "For a going away party for a girlfriend, she whispered it would be at Bacchus Kirk. I was already downtown, inside Westfield Mall, on my way to Muni - thinking I wouldn't go because of a long day at work. Instead, I walked uphill to Bacchus Kirk to meet the party. I'm very glad I did.\n\nNot a crowded bar. Which I love. Clean. Which is such a plus. Beautiful layout. Walk in to a red lighted bar. Bar to your left, seat booths to your right. A smoking area, which was a patio with lovely iron gate and sliding door. There is a pool table just straight ahead. The place is spacious, friendly bartenders, and the prices are reasonable. \n\nThis bar tops my list. Will definitely be back again and again", "author": "Jacqueline L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-25", "description": "Rudest bouncer in SF. Most unfriendly people I've encountered in the city.", "author": "Rob A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-12", "description": "I'm astounded by the reviews of the poor service here.  Last night we walked in around 8:30 and I asked if there were any specials on for the night and as we'd just missed happy hour, she said \"everyone of you is special\" in her charming Irish accent.  Totally nice, funny and really the kind of bartender you want.  Not chatty, but humorous and takes care of you.  \n\nThe drinks - I had a vodka soda and a well gin martini - both were fine, if not generous, and reasonably priced. \n\nThe pool table was empty and we took it over.  There's room all around the pool table to get your shots in -it took us a while after two or three adult bevs -  and a place to put your drinks (which isn't on the pool table, obvs).  We got ousted after one round by a guy who'd brought his own cue, but that was fine. \n\nTake note: at around 9:30 seemingly every Tuesday, a bar crawl comes through.  Evidently it's a hostel bar crawl and last night I swear the bar went from being a comfortable twenty people to being totally jammed.  The Bacchus Bartenders prepare for it, but us locals skedaddled.  \n\nOverall, when not full of bar crawlers, this place is great. A nice local bar (not fancy, but comfortable and well maintained) with ample space, a smoking room if you so desire, a jukebox, and good atmosphere.", "author": "Paige B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "New favorite bar!! Great happy hour prices and I'm in love with the interior. The bartender was super friendly and there were good tunes playin'. I'm excited to come back!", "author": "Jamie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-10", "description": "Being new to San Francisco, the first couple of days were a bit rough, it was raining more than usual and one day I stopped by this bar because I wanted to get out of the rain and it had a working fireplace...it was the best idea I ever had.\nThe bar was very warm and cozy, the music was great (there was nice mixture of everything from Black Keys to Stevie Wonder to Pink).\nThe locals greeted me with open arms and gave me a lot of great tips on how to find an apartment to places to eat and a month later this has been my little haven whenever I need to unwind. \nAnd to top it all off, they have my favorite beer-Delirium Tremens! If you've never had it, I highly recommend it but be warned the alcohol content is a bit higher than most beers. \nCheers BK for making me feel at home.\n\nDid I mention it has a pool table?", "author": "Alina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-28", "description": "This wonderful neighborhood bar was right down the street from the awesome Petit Auberge, where hubby and I spent a memorable week.\n\nHubby only gives this place four stars, but he didn't have the pineapple-ginger martini-like drink (can't remember the real name) that I did.  It was abso-f'n-lutely delicious, which may explain why I had one more than I should have.\n\nThe bartender here was a doll and all of the patrons we spoke to were interesting and engaging. Well worth a visit!", "author": "Lynn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "I would never know this place existed if my friend didn't live on the same corner. But he introduced me to Bacchus Kirk last Fall, and it was the first stop of the night with some out-of-town friends a couple of weeks ago.\n\nIt's pretty hipster, but they're serving up big draft beers (Anchor Steam, Stella, and a few other good brand names) for $3.50 until 8 PM, even when we went on a Friday. Pool table has been busy both times I've been here by some pretty stereotypical SF hipsters, but there are plenty of TVs to watch a Giants game, or something.\n\nIt's a hike to get there, but BK has a beautiful inside, especially in the cooler months, and will be a go-to for me in the future.", "author": "Conrad B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Cheap drinks, pool table, juke box, fireplace, smoking room, nice and good bartenders.", "author": "Ella R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "Loved it. 70's ski lodge is a great way to describe it. Boddingtons on tap made me happy.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-20", "description": "Not bad if you go alone or with a small group. But this place really can't handle a big group. It gets too hot because they run the fireplace apparently all the time. The beer is fairly well priced but I really didn't see anything worth coming back for--or avoiding. It's just a place that serves booze.", "author": "Cori N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-11", "description": "Treated with utter disdain and disrespect because I ordered something that the bartender felt was not ...  I don't know, not something...  I mean get real...  I did not come in for the staff's attitude, I came in for a drink.  Serve me, take my money and leave me alone.  Let's just be pleasant, I'm not expecting anything else.", "author": "ein bier bitte k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-10", "description": "Saturday night. Pub Crawl. 8 bars total. Memorable ones, good and bad.\n\nStop #1:\nBacchus Kirk is definitely ski lodge like. Dark and cozy. Log-like walls with fireplace. Pool table in the back. A very laidback place. \n\nWill come again!", "author": "Marti L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "Stop #4 for Friday night's happy hour. \n\nI like this place. I don't know exactly why, it's just a nice, chill place to hang out & have a drink (or 2, in our case). Plenty of places to sit, jovial crowd, clean bathrooms, even a smoking room! We all ordered mojitos which were delicious, but after 2 we realized they had almost no alcohol in them. We were all too chicken to go ask for an extra shot of rum. That was my only complaint for this place. I guess that's what you get for the reduced HH price...reduced alcohol!", "author": "Erin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "This might be one of my favorite dive bars in SF! The drinks are good, the bartender is awesome and the jukebox is one of my favorites (Vampire Weekend on a SF jukebox? I love it!). You can bring food in (hellloooo Uncle Vito's!) and chow down while you drink.\n\nMy friends and used to come here waaaaaay back in the day to play trivia on Tuesdays. Those days are long gone, but the bar still has a chill vibe. This is the place you go to drink. Not socialize. Just drink. And, it's awesome.", "author": "Shachi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-19", "description": "1. Dog friendly, but keep your pooch on a leash \n2. Love the dark red ambiance with the roaring fire\n3. Bar staff is attentive and friendly--Mandy is my fav\n4. great HH specials\n5. Mulled Wine during the Christmas season- yum!\n6. Great cocktail combos\n7. Great place during the week, weekends get crowded,but still manageable\n8. Smoker's area in the front that is gated so you can take your Drink-- it's really small though.\n\n It's not a \"pick up\" bar, so you can enjoy a cocktail solo or w friends in a casual, laid-back environment.", "author": "Desiree P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-24", "description": "Bacchus Kirk, our last stop of the night!  I can't believe I even made it this far!  I still hadn't slept yet.  That was something like hour 40 with little to no sleep.  Man, I'm a trooper or was just still reeling from the race!\n\nThis bar is so wonderful!  It's a Scottish pub right near Union Square, so that meant it was super close to our timeshare!  YES!  I was so over any form of exercise at that point, but we had to check this place out.  I'm so happy that we did!  It looks like a complete run down dive from the outside, but as soon as you walk in...TA-DA, it's a hip, lounges type bar complete with pool tables & a great jukebox.\nThe best part of this bar was the 'short' chairs.  They were soooo cute.  They were short because the bar itself doesn't change in height, but the floor does!  We were sitting at the end and we ascended 3 steps, pulled out the chairs & had a seat!  It was so comical to us.  Could have been delirious or a bit tipsy, but this was the best part of the night!\n\nOrdered our drinks, had about a sip, then I was done.  Exhaustion overtook my body.  We paid the friendly & attentive bartender and off we went into the night!\n\nI love SF!  Thanks again Anna for helping me celebrate the race!", "author": "Emily S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "DRINK:\n1.) Moonshine corn whiskey w/ ginger beer = They have ginger beer! But use dark rum instead equals mm delish\n\n*They had another cocktail that looked interesting.. will be willing to try it next time\n\n\nSERVICE:\nGood\n\n\nATMOSPHERE:\nNice divey bar, pool table in the back, a cool tiny smoking room in the front so ppl can puff and drink..", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-23", "description": "I can't pronounce the name of this bar, but I still like it. it has a dark inside, but feels warm at the same time.  they have a pretty good pool table and carry Bass Ale on tap!  its only like a 1/2 block away so i find myself here for most of my \"lets grab a beer\" feelings.\n\nnot sure why i like this place so much...but i DO!", "author": "Tim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-27", "description": "I went here last night for a girl friend's birthday party and I love the \"lodge\" feel you get from this place.  The ceiling has exposed wooden beams and the red lighting gives you the illusion that you're in a cabin with a roaring fire.\n\nThe bar has a pool table, a couple of TVs and a jukebox for entertainment.\n\nI will be getting mojitos here again!", "author": "Eleanor L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-27", "description": "Had a drink or few before going to see Obama speak last week. (I had to do something to calm the nerves before I met the man who's still sending people to die in the Middle East. Just cause he ain't Bush don't mean it still ain't wrong)\n\n What a great place! I highly suggest hitting up their happy hour (goes til 8 I think) and having a pomegranate margarita. I was transported to a sunny summer day at the lake! \n\nThe bar tender was super cool and the decor was posh. \nIt didn't hurt that there were some gorgeous Australian men in the bar as well. Anyhow, check this place out - good happy hour prices, cool people, pretty place.", "author": "Twinstar G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-03", "description": "Following a renovation that included a change in their sign and frontage, Bacchus Kirk has an inviting woodsy feel.  The large front windows allow passersby to see the red-lighted interior that beckons.  Sadly, that's pretty much it.  Despite a fun, handwritten cocktail menu on the wall above the bar, this is a strictly beer and whiskey joint.  If you stay with the tried and true (G&T, Jack & Coke, etc.) you won't be disappointed.  If you stray, watch out.  Even drinks from their own menu seem a bit beyond the bartender.  \n\nKirk seems to have a loyal following and if you're not among them expect a chilly exchange at the bar.  There are a lot of other bars (average and otherwise) in the area that will take your money with more ease.", "author": "QuodE D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-12", "description": "start with the kiwi flower martini deliciousnesssssss!  then, chug on through the rest of their specials : )\n\nplus, excellent mix of music and no crazy crowd to deal with!\n\nLOVE that there is a smoking room so you don't leave the place wreaking of cigs.", "author": "Mimi D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-14", "description": "Two words. A-hole. Usually I give my bars of choice 3 strikes to consider if I'm a huge fan and if it's worth coming in for a drink. \n\nI get it. I don't look like a bitchy slut from snob hill ( ok well minus the slut part hah) doesn't mean it should take you 7 minutes to make a damn cocktail. On a Tuesday night. I'd understand If my friends and I were extemely wasted and loud and obnoxious and the guy would take his time serving us. But it wad 6pm. I wasn't even buzzed and just wanted a drink after work but that was clearly asking too much. What's that you say? Oh Amanda don't get your panties in a twist. Well maybe I wouldn't except the fact there were 4 other people in the place besides me and my friends and the bartender just acted like it was such a hassel to make our drinks. I'm sorry. It's happy hour. Do your job. I'm not paying for your snobby up the ass attitude I'm paying to get drunk and make bad decissions.\n\nLike I said. Usually three strikes and you're out for me. Here, twice is enough. Not impressed. Props to the decorator. Boo to everything else.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-24", "description": "Ultra chill spot that we decided to hit up after Nopa... plus we missed guestlist at Starlight... Someone described it as being like a \"lodge\". That hit it right on the head!\n\nTheres a pool table in the back, with a juke box that plays some random stuff (Nate Dogg passed away last week, so we were getting a lot of old school Snoop and Dr. Dre). Not too much seating room aside from the stools at the bar and a couple of booths, so you could say the place is intimate.\n\nGreat drink prices, even at non-happy  hour times. Convenient too, considering it was about 2 blocks away from my friend's place. \n\nDefinitely down to come back here to try one of their specials.", "author": "Marc T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-02", "description": "Booo!  Why the hell advertise all those creative concoctions when your bartender has no interest in making them?  The first 3 drinks we tried to order couldn't be made because they \"ran out\" of certain ingredients.\n\nAfter ordering 2 drinks listed on the board that could be made, the bartender paused, sighed, then forced her neck to tilt while looking up at the ingredients...figuring out what is in the drinks.  Body language = I really don't wanna make these goddam drinks.\n\nI took a look around the bar and realized that everyone in the place was drinking beer, not cocktails.  I assume the lure of their happy hour is to go and get beer at a discount.\n\nThe drinks were horrible and couldn't be finished.  We left after barely managing to suck down half of each drink.  So back to the question...Why the hell advertise drinks your bartender a) has no interest in making and b) doesn't care to make them right?", "author": "Pete M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-23", "description": "Whenever I am in this neighborhood I try to make a stop at the Bacchus Kirk. It feels like a little ski lodge with the fireplace lit on a cool evening.\n\nThey used to have Pabst on tap but dropped it for some cider. Minus one point ... The jukebox is really good though, and the pool table is fairly level and well lit.\n\nThe owners/bar tenders are Scottish, so expect an accent, and some Euro friends to be sprinkled throughout the joint.", "author": "Wes T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-07", "description": "Went to grab a beer with a friend of mine on a Monday night. It was kind of nice that it wasn't really packed like some other places, but maybe it was because it was Labor Day...\n\nGreat bartender, cool layout, pool table in the back with a big 'ol chalkboard. Didn't care for the choice of tunes on the jukebox, but the smoking room is a real cool touch (even if it is a bit small). I think the room could only fit maybe 6 people comfortably, and it's got a window that opens up to the street.\n\nGood neighborhood bar - I'll probably head back at some point.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-27", "description": "Nice neighborhood dive bar.  Nothing stands out much, I wouldn't go there by planning, but it is comfortable place to stop by on the way home, and usually nice crowd.  I like their happy hour cocktails. Nice staff.", "author": "Bailey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-14", "description": "What I haven't written a review of BK?  Actually I don't know anyone who calls it that, but was too lazy to type out the name but have actually typed way more explaining it.\n\nAnyhow, we took the whole studio here for drinks after our holiday dinner (just added the pix) and I've been there numerous times before.  The bartenders may not be the most attentive all the time, but if you make sure they know you are in need of some booze they'll take care of you.\n\nOh yeah the juke box is not bad either!\n\nThe space itself is nice too - pretty cozy and a warm feel and there's a convenient smoking area for you stinky smokers.", "author": "Gene X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "Absolutely one of my favorite bars in the neighborhood. The bartenders are always friendly, good selection of beers on tap, a fireplace, pool table, and plenty of seating. It's never overly crowded, but always a good variety of people inside. Great music always playing... I can't really ask for more from a local bar. This place is great!", "author": "Ashley D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-30", "description": "This place is streaky.  Good when tourists are staying in nearby hostels (hostel discount at the bar, wink), some good convos to be had with an international crew.  Other times just a chill (warm) spot to have a drink with a friend.  \n\nGood place to start out the night, or come back to for a chill vibe.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "Great \"local bar\" feel where everyone really does know your name. Bartenders take the time to get to know you and the pool table always has great competition (just be sure to put your name on the chalkboard and wait your turn - winner keeps the table!) Indoor smoking area is a plus but don't get confused by the bathroom situation. (One Men's room and one unisex/handicap, sorry ladies).\nWeekends are usually pretty packed but great to grab a taste during the week. If aren't into big crowds, be careful from ~ 9-10 on Thursdays (part of the pub crawl from the local hostels) but it's a great way to meet a bunch of people from around the world!", "author": "Taylen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-30", "description": "Had passed by this place a few times and always wanted to go in, but it always been closed for some reason!  Got out of an event fairly early on Thursday night and headed in to Bacchus Kirk for a drink.  We actually got there too early for happy hour, which is 7 - 9 pm, which ordinarily would be perfect!  \n\nSat right up in the window but there was ample seating at large tables and the bar, as well as a pool table, cute little smoking closet, fireplace, and jukebox.  Bartender was very nice, and the regulars at the bar seemed interesting.  They have jagermeister chilled on tap, if that's your thing.  Cocktail menu seemed decently creative, although can't vouch as I just had a vodka soda. \n\nRestroom was bright pink and covered in graffiti, which seemed out of tough with the rest of the place's vibe (more dark woods, green, and blue.)  I did hear someone say they were renovating the bathrooms this week so maybe that will change soon.", "author": "Jaimie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "While it always seems to have a good share of tourists, there's a consistent local following as well. Great local bar with good selection of beer on tap & creative cocktails. A great place to start -- or end the night. \n\nNonsmokers beware, smokers listen up: There's a super-smoky smoking room that holds about 6 comfortably.  Bonus: this room faces Bush so there's always something crazy to gawk at passing by.\n\nPool table, good selection of tunes in the jukebox box, & red lighting makes this place a home-away-from-home for thirsty Nob Hill residents.", "author": "Kate L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-31", "description": "I came here for the first time the other night and had a genuinely good time. The decor is great, like you're in a cabin somewhere completely different than Nob Hill. The drinks are more expensive than the dives I'm used to, but nothing crazy. The bartender was super nice and was pretty attentive for being the only one working. I love any place that has a pool table and a juke box. And I don't smoke, but I do appreciate places that cater to smokers, so the smoking room is perfect! \n\nThis place is perfect for a relaxed night just chilling with friends!", "author": "Victoria A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-06", "description": "I have to say I wasn't sure I would like this place. I had heard some mixed reviews and really didn't even care if I ever made it here.......\n\nwell, aside from the fact that I have been to nearly every bar in this fine city, and not ever going would possibly ruin my reputation for knowing about every bar in the city, and I feel compelled on some level to visit every bar in the city, so I can be informed and inform you about ...okay I'll stop now, back to my review.........\n\nNice dark decor with lots of wood, a pool table in the back, large tables for big groups, a fireplace, low ceilings and a smoking room with far too little ventilation. When they say second hand smoke is bad this place is the endorsement that will have you running away from the smokers, and that is saying a lot since I am a smoker. However, keep your smoking to the sidewalk and this place is pretty cool.\n\nWe came here on trivia night...all 15 of us, on one team, headed up by yours truly, who may or may not have a competitive streak, and who may or may not have been channeling Emilio Estevezes fathers character in Breakfast Club as we played (and won....I wouldn't have had it any other way). So we got $30 for our efforts. John, one of our key brainiacs,  figured the best way to share the spoils with our large, obviously intelligent, team would be to buy the cheapest bottle of well alcohol they had and pass it around. Classy and innovative. I was in!! \n\nThis bar does not do bottle service, even if you are gold metal winners.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-08", "description": "So I just moved to a apartment which is like 30 seconds from here, so far I have yet to get in any fights or banned  unlike some posters here. \n\nThe place has been pretty quiet and chill on the weekends (the way it should be when your having a beer) and service hasn't been bad, maybe the place has changed or I haven't seen the bad side yet!", "author": "simon r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-01", "description": "Grace:  I am wasted, let's call it a night.\nArchie:  Sounds good.\nGrace:  Hey, let's go.\nArchie:  Wait what?  Where?\nGrace:  We're doing shots at Bacchus.\n\nOf course we should have continued drinking, we had only just finished  two bottles of wine, two cocktails and two Irish coffees.  \n\nSilly me.\n\nNo big deal.\n\nI decided to review this part of the evening first since I am still gloriously hungover.  \n\nI must say though, hangovers are something I enjoy taking part in because of the future culinary payoff.  \n\nAt least in my mind, all the calories I eat the day after drinking don't count.  \n\nIt's only 2:30pm and I am staring at receipts from Starbucks, McDonalds, Krispy Kreme, and that crappy Pho restaurant in Mt View.  \n\nWait until I go to the Mexican restaurant tonight and ask for the steak taco stuffed inside the carne asada burrito served wet.  \n\nBacchus is a cool, casual place with some very nice bartenders who don't judge the two sloppy drunks in front of them.\n\nFeel my face.\n\nInebriated.", "author": "Archie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-17", "description": "Who is this Bacchus Kirk? He likes good, albeit widely-served beers, that's for sure.\n\nI had a variety; Guinness (poured with care), Trumer Pils & Anchor Steam all on draft. The half hipster bartender who seemed a little mismatched for this location even gave me one of my beers for free, when the Trumer Pils keg ran out just short of finishing my beer.\n\nI was actually a little nervous entering the place for trivia night...the world of pub trivia was on my shoulders being the only male in a group of 3 women--two of which I had never met. Something I failed to recognize...my inability to retain useless pop-culture information for purposes of earning free booze or peanuts at a bar. Luckily, the girls took it easy on me. And what was with the music round here!?!? I am a guy who KNOWS my music! I knew only one of the songs during the music round here! It seemed like the MC had plucked a playlist off some modern pop station. Maybe I should listen to commercial radio again and brush up on my skills?\n\nF**k That...\n\nPirate Cat Radio, Folks.\nhttp://www.piratecatradio.com\n\nThis is a cool spot, but not quite my style...\n\nGreat service, friendly bartenders & normal Nob Hill type of clientele. I don't really understand why someone would wear a business suit to trivia night on a Tuesday evening, but maybe it's just because I'm not THAT GUY.\n\nThey had the pink soap in their bathroom dispensers--it's the soap that smells super awesome and reminds me of high school. Yea, we were lucky enough to have awesome smelling hands in high school...that's how us ex-suburbanites used to roll.\n\nSo yea, good soap & a free beer gets this place an extra star. \n\nI'm just a whore like that.", "author": "matt m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-21", "description": "NO MORE PUB QUIZ!!!!  At least according to the bartender tonight.  The guys who run it apparently have stopped.  \n\nBah.  I am annoyed.", "author": "Beau G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-03", "description": "Whoever made the \"ski lodge\" comment is dead-on.  I felt like I was in an upscale version of the Timberline Lodge near Mt. Hood.\n\nGood thing, because it's nice to have an escape from all the San Francisco-ness sometimes :)\n\nWell, they're my neighbors and along with Double Team Coffee, Susan's Hair Salon, Video Zone, Sushi Rika, and Bush Market, I have to give them props for being one of the good bars in the hood.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-06", "description": "A neighborhood bar you can chill out at with friends.\n\nIt gets hot and the music can get loud, but everything can't be perfect.\n\nIt's cool.", "author": "Kitty O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-18", "description": "Basically a ski lodge in the middle of the city. What more could you ask for? It's a cozy bar with plenty of seating, which is a nice change of pace from most SF bars.\n\nThe little smoke room is kinda charming (don't go outside to smoke in front or the bouncer will yell at you) and much nicer than Helmock's smoke room (the only other smoke room I can think of) if you actually smoke.\n\nOverall, a mostly low-key and cozy bar. Just a great vibe.\n\nThe bartenders are nice and friendly too ;-)", "author": "Jarrod B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-24", "description": "This place caught my eye one night as I strolled down Bush.  I'm glad I finally went in.  It reminds me of a ski lodge with red, retro warmth...roomy and cozy with benches and chairs along one side, and a sweet fireplace.  A long bar runs along the other.  \n\nFor those that like to shoot, there is a pool table.\n\nFor those that like to groove, they have a juke box stocked with great tunes.\n\nLaid back friendly mix of international patrons.  I love this place!", "author": "Cathy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-05", "description": "House, house, apartment, house, liqour store, apartment, house... FUCK!!  Where the hell IS this place!\n\nOh wait!!!  SMOKERS!!! Where there are smokers there is a bar!\n\nSure as gold there was Bacchus Kirk.  Tiny and unassuming and waiting to hold us all in a cozy warm embrace of booze and friendship.\n\nI walk in and I litterally can't see damn thing!  The place has a dark red glow which made me feel like I should be whispering dirty things into someone's ear.  Suddenly the song TLC \"Red Light Special\" popped into mind.  That is one sexy dirty song....and one of my favorites song ever.  ;)\n\nHalf and hour later (no joke) my eyes adjust to the light and I can make out the bartender's face and I get a drink.  Yelpers fill the space and a fun time was had by all.  Chill spot folks.  Take a crew of homies and kick it by the fireplace or play a game of pool.\n\nMinus one star for having ONE bartender on a Friday night.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-06", "description": "Let's get it straight, the place is fine--nice atmosphere and such.  \n\nI just get a little annoyed when they don't have a crappy $2-$3 bud or can of PBR for the poor among us that have already sunken into a deep alcohol induced cycle of sadness and depression.\n\nTo be fair, I had a few $6 Jim Beam and Cokes that were totally of the \"splash of coke for color\" variety.\n\nSo three stars I guess.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-02", "description": "He's trying to blame it on me, but really, it was not my fault.\n \nHis version of the events, as they unfolded - - in his skewed mind:  http://www.yelp.com/user_details_review_search?userid=AgzHzIzC6ZHTKgker0egAg&q=bacchus\n \nMy version of the conversation:\n\nHe had just pulled up to the front of my building to drop me off.\n \nGrace:  \"OK, well goodnight, Archie - thanks so much for dinner, it was delicious!!\"\nArchie:  (falls to the ground, kicking and flailing arms) \"I don't wanna go yet!!\"\nGrace:  (staring down at big guy on concrete...) \"Alrighty... how about one more shot right there at Bacchus, and call it a night?\"\nArchie: (gets up, locks car and crosses street before me)\nGrace: .....\n \nI don't know HOW the above is MY fault.\nSure -  the one shot turned into one shot and two beers - - and that was, perhaps, my doing... but I still don't see how it's MY fault.\n \nBut whoever's fault it is, we did end up entering quite drunk, and exiting completely inebriated.  Completely.\n \nThis morning, I get a text asking me to shoot him.\nIf there was even a remote chance of my getting up to go get the gun to put him out of his misery - - I would have except I was so sick that I couldn't move for a few hours.  At least.\n \nGuinness on tap here - and they pour it right.\nSo it that great IPA I love so much but cannot remember the name of... but I never fail to recognize it when I see it.  Fat Guy?  Heavy Dude?  I dunno, something like that.\nWe also had chilled Ketel One shots - -and they were good pours.  \n\nThat was what did us in.\n \nService was very friendly, and though it was my first time here (in spite of it being, quite literally, across the street from me) - they treated us like old friends.  A guy who looked like Lieutenant Dang from Forrest Gump gave me a funky cigarette.  The atmosphere is friendly, homey, and while not hip or classy - - it has a good feel to it.  It feels like a neighborhood bar.... and to me, it actually is.  \n\n \nWell, that is how I remember it anyhow and it sounds good enough to me, so THERE!", "author": "Grace K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-09", "description": "I wish I liked this place more so that I can become a regular. BK is cozy, dimly lit, kinda comfy. I think most patrons come here because of the smoking room. I've watched some sporting events here while sipping a few. They have the fancy cocktails at the fancy price. It's not cheap like a neighborhood bar should be. It's a bit clique. So sitting alone to watch the game will almost guarantee I won't be chatting it up with the patrons. I really wanted to like this place. meh.", "author": "L v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-07", "description": "First of all, I don't care what anyone says, that was Merrill Streep not Glen Close- Hannala will back me up. Okay, now that I have said my piece lets get on with the review... \n\nBar tender checked my ID I am not religious, but bless her little heart! Thank you for telling me that I look under 30 and there for you need to ID me. \n\nThe atmosphere is very ski lodge feel, I dug it! (yes, I said \"dug it\" WHAT!?) Seats at the bar were in plenty, the nice man asking the questions reminded us loud folk that if we continued to yell out the answers to the trivia questions like we were at an auction, then everyone would win, not just us. Thank you nice question man. A bit on the pricey side, but their martini's were 6 bucks and very tasty, so I suppose worth it. \n\nI would have given this place 3 stars because it was okay, BUT the bar tender made Hannala another drink for free because SOMEONE (*cough* Sav *cough*) spilled the drink I just bought her ALL over me. So, +1. \n\nAnd seriously, it was Merrill Streep  not Glen Close. :)", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-11", "description": "Bacchus Kirk is okay...for me, it's got its really good points and its really bad points, and they even out right in the middle.\n\nTuesday night is trivia night, and that's really fun if it's your thing. It's really crowded, though, so you need to get there early (like before 8PM). And good luck getting a drink! Our team missed 3 trivia questions that I magically knew the answers to but didn't want to lose my spot at the bar, and didn't go consult them. Boo!\n\nUnfortunately, this is often the case I've found at Bacchus Kirk. It's so crowded that it takes a really, really long time to get served, and it's also sometimes a million degrees in there, which is kind of accentuated by the red lights maybe.\n\nPros: There's a really good jukebox! And a pool table, which is a plus for some people. I like the fireplace and the kind of rustic look of the place...it reminds me of a lodge a little bit. There's a good selection of beer. I also love the neighborhood. And I do actually really like the lighting - it's just not great when it's already really hot in there.\n\nCons: As mentioned, this place gets PACKED. Sometimes the music is a little too loud - I think they really crank up the volume on the jukebox. And I tried to play a Massive Attack song one night and it came on when I was at the bar. Right in front of me, one of the bartenders said \"Ugh, I hate Massive Attack\" and changed it after only a few seconds of the song! I was really surprised...I guess partially because I didn't know they could do that and partially because I'd paid for the tunes. Also, I've found the drinks to be more expensive than I'd expect.\n\nAnother con: walk by the front door and tell me what the place smells like. It's got that sweet/sour/stale smell of old wooden bars, sort of like a mixture of beer, barf, and old athletic supporters. Once you walk in, you stop smelling it, though.", "author": "Heidi G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-12", "description": "Found this bar during one of my exploratory walks when I arrived in the city a few years ago. Because of the glowy red lamps and dramatically lit and staged liquor bottles, it immediately reminded me of a scene from an early Bond film set at a ski lodge.\n\nBacchus Kirk is a bar best enjoyed when there are only a few customers at the bar or at a table or playing pool. When crowded, the atmosphere can become a bit ugly like some of the drunks. However, during slower periods, the bartenders here are friendly and always concerned that I enjoy my drink (yes, I can order like Sally in \"When Sally Met Harry\"). The music can be way too loud and abrasive, but staff will lower the volume if a regular stops by for drink and to watch an afternoon sporting event.", "author": "Poet D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-18", "description": "I hate staring at bottles of booze. I hate weird half conversations with the person next to you because you almost accidentally set your purse on their foot. I also hate wiggling my feet under a stool as a source of amusement. \n\nYou might think I hate bars --- but I don't. I didn't think that my boyfriend (who considers bottle staring, half conversations and foot wiggling a good time) and I would ever find a bar where we could both be happy. \n\nBut, tah-dah! Bacchus Kirk! About damn time. \n        They have a fun quiz (an absolute standard in my book for a good bar.)\n        They have a fireplace, with fireplace seating (no unnecessary foot wiggling here!)\n        They seem like a mostly local bar, which is nice. I'd frequent this place but I don't actually live close enough to do that and free parking is basically non-existent.\n        They don't do food, but you can bring in food. You should clean it up though, because the bartender and the bar back/bartender's friend are all really nice and don't really have time to be picking up your lost bits of sushi/pizza/spaghetti-o's. \n\nLastly, I owe Bacchus Kirk for introducing me to one of my favorite drinks. Fernet with a Ginger back. Silly me, the first time I tried it I was like oh, yum, dirt. Wonderful. Then the bartender at Baccus suggested I try it with a ginger back and hoo-ray, dirt taste be gone!\n\nSo everyone should go for the next quiz, Tuesdays (9 pm). I'll be on the team that starts out really good, then gets a little bit too silly and winds up blowing it. But maybe we'll win some day...maybe...if no one else shows up?\n\nNote: Next time I go I will try and figure out what the prizes and other pertinent quiz info is and update this review accordingly.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-05", "description": "Bacchus Kirk represents one of the more artful interior designs I've seen in a drinking establishment. It's layout achieves the delicate balancing act of being artsy yet not arrogant, and hip while still feeling homey.  Whoever put  this place together took a dicey mix of decorative elements....ones that often spell disaster when used improperly, and managed to pull everything together in a truly impressive manner.  They tastefully used the ever-so-dicey medium of pecky cedar for most of the interior, but did so in a way that circumvents the almost inevitable pitfall of creating a space that looks like a re-cycled cowboy bar.  It's artfully mixed with several other minor nuances like tasteful lighting, evenly drilled angle-iron, and patches of older stonework left over from the bar's previous decorative schema.  A worn hardwood floor helps round things out with by adding a touch of mustiness to a well-rounded set of walls.  Music is young, hip, and not too loud.\r\n\r\nI got here several hours after France had eliminated Brazil from the World Cup. There was a easy going crowd in place, but seated patrons and place-saving drinks forced me further down the bar near a thirty-something guy with heavy tattoos.  A cute-as-a-button girl with French flag in her hair sat one more seat over from him.  French-flag girl was fairly tipsy, and tattoo guy seemed to be pretty attentive whenever she came around.  I tried striking up chitchat with tattoo guy whenever French-flag-girl drifted away, but to no avail.  He'd answer me in terse, incomplete sentences while doing everything he could to avoid eye contact.  The rest of the crowd was a good ethnic mix with mean age of about 30 years and a standard deviation of 4.\r\n\r\nDespite a somewhat cheery crowd, great decor, and a decent selection of drinkables, I caught an odd vibe from this place.  Maybe it was the soccer crowd, maybe it was just the vibe I got from tattoo guy.  Regardless, I saw my empty glass as reason to move along rather than re-fill.  Bacchus Kirk is a pretty decent bar.  It's a good  place for groups, a good spot to take a date, and a great local hangout if you lived in the hood.  But if you drop in solo, don't expect bubbly chitchat from the regulars right off the bat....and be ready to drink alone.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-14", "description": "My cube mate was arranging a happy hour and since I really wanted to watch the Heat and Mavs play Game 3, he suggested Bacchus Kirk since it has a couple of screens.  Always up for exploring a new place, I trooped over after work with some colleagues to check out this local watering hole.\n\nI didn't feel like ordering any adult beverages so I stuck to water, but I was impressed by the 7pm happy hour start time.  I've never been a fan of rushing to get an early drink special so it was refreshing (ha ha, me so punny) to find a place with a more reasonable schedule.  All of my coworkers liked their drinks and the menu did look interesting, so I'll have to try one of the house drinks next time.\n\nThey don't serve any bar food which was extremely disappointing (those who know me understand how important food is to me!) but they have plenty of menus on hand of nearby places to order food from.  Chicken wings and curly fries were soon delivered and I was able to finally concentrate on the basketball game.  Bacchus Kirk has quite a few TVs spread about the room ranging from small CRTs to a very large showcased flat panel so finding a good view wasn't a problem.\n\nSince it was a Tuesday night, they had bar trivia start around 9pm.  I've heard of bar trivia before, but I had never tried it so of course I had to stay to play.  It was a lot of fun and pretty interesting...they had two random facts rounds, one musical round, and one name-that-celebrity photo round.  According to the surrounding people, it's better than the bar trivia at a lot of other places, so I'm glad I had a positive first experience!\n\nThe decor is unremarkable in a typical neighborhood sports bar kind of way.  Rather dark lighting, lots of wood, slightly sticky tables and chairs, and the requisite pool table in the back.  But the staff is unpretentious, parking isn't bad, and the crowd is a nice eclectic bunch with a mostly chill vibe.  I wouldn't mind returning to this comfy and fun bar...especially on a Tuesday night.  Bar trivia anyone?", "author": "Helen T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-10", "description": "I did a film race yesterday and this was like the base camp so we turned in our film at midnight and stayed for the wrap party. Honestly, I wouldn't come to a bar in nob hill. It's just not my crowd, hence no cute guys for me. \n\nThe service was lame. There were two bartenders but the other one seemed like new and didn't even speak english very well. It was pretty frustrating. The other one seemed to know what she's doing but order took a long time since she had to pick up the newbie's slack. I gotta say the mojito was good though =)", "author": "Perry S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-14", "description": "I dropped by on a Tuesday Trivia night.  Fun! Cash for 1st & 2nd, nuts for 3rd - 5th.  I guess that qualifies as borderline bacchanalian activity?  ...If you count groups of revelers with faces contorted, biting their lips in concentration to culminate in an often simultaneous \"OH!\" an orgy.  So cool are the groups that commandeer a table and sip their 1 water/light beer for the duration of the game and ditch as soon as they pick up their cash.  Real winners here.\r\n\r\nNo domestic beer on tap... only in bottles.  They only pump premium.  I expected to be overcharged, but the drinks were very well priced.\r\n\r\n1 pool table.  Tends to get burning hot in here on busy nights like Trivia Tues.  Good thing the fireplace wasn't on.   I suspect they kept the double doors shut to prevent the orgiastic noise from escaping into the quiet midweek night.  The squares out there really need to get with the squares in here.", "author": "Marjorie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-07", "description": "I wish I had more to tell you about this place. It's nicely decorated, sort of a ski lodge/sauna/korean barbecue motif going on. There's about the right balance of tables and standing room, and a cool semi-enclosed smoking patio in front. The crowd seemed like a pretty cool mix of people as well.\n\nI'd give this place more stars If there was more help behind the bar on busy nights, the drinks were more moderately priced, and I'm not into trivia nights. I shouldn't say this because I enjoyed the spoils of my teams victory without contributing much, but I'd gladly pay for that bottle of budweiser if I get to enjoy the bars natural atmosphere without distraction.  I'll bet this is a pretty cool spot on other evenings.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-30", "description": "Bacchus Kirk is on its way to becoming my favorite neighborhood bar. Because our normal happy hour spot Cantina was closed for a private party on Monday we came here. I've been a few times and never really had a good time. \n\nFour mojitos and a tequila shot later I was attempting to play pool.. and really sucking at it. Their mojitos are wonderful and inexpensive, plus they have $2 draft (I could be wrong on this.. due to my level of intoxication) and good happy hour specials. \n\nThank you for being there for me during my week/month of turmoil Bacchus Kirk and thank you for only being a block from my house (sadly an uphill walk)! I will be back very soon!", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "I never would of thought to come to this place. My friend lives a block away so we went over and it was real big and nice in there. It wasn't overly crowded on a Saturday night, nice crowd and good variety of drinks.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-28", "description": "Great laid-back place.  I love the elevated window seating areas--private and cozy for you and your main squeeze.   The music selection goes with the chill vibe and is at a level where you can have a full conversation without getting hoarse.  Their pours are nice, and they have plenty of great beers on tap.  No drama, no fuss.\r\n\r\nUpdate 3/7/06: Oh BK, what happened?  The service was slow even after taking my drink order. But the most abominable thing happened next. The bartender had accidently poured Grey Goose Orange in the martini.  Fine if the bartender scrapped that one and made a new drink, but instead she stopped mid-pour, retrieved the correct Grey Goose, and finished mixing the drink. Result: orange-tainted martini with vermouth and green olives. This one wins no taste awards.", "author": "M A N I K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-11", "description": "local for me...trivia night with Cash prizes...a little pricey\n\nUPDATE:  apparently the bartenders don't like to be interupted when chatting or when putting away dishes.  what happened to customer service.  i don't mind waiting my turn if it's other people NOT dishes or conversation.  they owe me two apologies\n\nTunnel Top is too close to waste your time here.", "author": "kiki b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-27", "description": "My boyfriend and I were out in San Francisco, on Saturday night. I really wanted to check out this bar. We went in around 9:30 and it was not crowded at all. But when my bf went to the bar, the bartender ignored him. He then came back and asked for his ID. then walked away! Thinking that he would come back, and he did...to ask the guy next to my boyfriend what he wanted to drink! \nRUDE!\nWe had been waiting for about 15 minutes, and the bartender snubs us!\nWhatever, we didnt need you Bacchus Kirk, there is always Tunnel Top.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-07", "description": "Last Friday I met a bunch of OG Yelpers here for a good old fashioned Friday night of debauchery.  Things I liked about the place-happy hour 'til 9pm, friendly bartenders and it's dog friendly.  Now I'm not one of those people who insists on bringing my dog everywhere but it was nice to be able to pop in with Willie for a bit so he could meet some Yelpers.  And since Bacchus is mere blocks from my apt I was able to take him home when it got overwhelming for him and return in no time at all.\n-1 star for taking 20 minutes to get my first beer.  I'll definitely be back on a school night when it's not as crowded and I may even bring a fluffy white dog with me.", "author": "phil h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-01", "description": "Great people. Good times. Better vibe. Tremendous jukebox!", "author": "J M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-12", "description": "Stumbling out of the women's restroom, I learned 3 life-changing things:\n\n\"Date like a man...so you don't get played\"\n\n\"Never make a man your priority when he makes you an option\"\n\nand more importantly, \"This place rocks my anal world\"\n\nThose are just some of the funny quotes written inside the women's restroom.  I honestly think ZAGAT'S wife wrote the last one.  It explains why the place has 3 different ZAGAT stickers posted on the door.  \n\n+4 for the wonderful happy hour until 9.  Did I mention that their happy hour doesn't only consist of beer and vodka-crans?  Yay to $5 cocktails.", "author": "Jacquelynne S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-10", "description": "We visited this nice little neighborhood spot for a friend's birthday. I think  we overwhelmed the bartender with our crew as the service was very slow. \n\nLots of places to sit, and a cozy little fireplace rounded out this bar. It's a great spot for a chill night out if you happen to be in the neighborhood. I could take it or leave it, but I certainly enjoyed visiting here once!", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-24", "description": "Ahhh my neighborhood watering hole.  The place from whence I hear strange noises and folks doing and saying wierd things at all hours of the night.  The place from whence I stumble home after getting sloppy and leaving my heart on the bar.  Yea, that is where I left it.  On the bar next to my r&c.", "author": "Michele O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-18", "description": "Aah, Bacchus Kirk.  Pronounced Back-us Kirk, for those of you not in the know; the sign has that weird u that looks like a v.  So it's hard.  Anywhooo...  For some reason, every time I've been here it has been for marriage-related reasons.  Time #1--reception for City Hall wedding of friends.  Time #2--engagement party.  Time #3--after-wedding reception-party for friends from time #2.  \n\nIt's a cool bar, way down on Bush, so definitely no parking and even catching a taxi at 2 am is difficult.  But...the bar's cool.  Like other reviewers have noted, it def. has the ski lodge vibe--log cabin-y, with a fireplace and nice bartenders.  There's also a pool table, and a floor which can be used for dancing, although I wouldn't go so far as to call it a dance floor.  \n\nCool place, good drinks, fun times, four stars.\n\nEdit--I drove by here today and alas, the sign doesn't have the V=U anymore.  It used to.  I'm pretty sure.  Standing by my man, I mean, review...", "author": "kelly m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-17", "description": "Cute Joint!\nI swung by for Julie's \"Last Happy Hour\" in SF and have NO Complaints... bartenders were seriously great and kept a smile all night despite how busy they were. If you're hungry, grab a slice at Cybelle's (up the block) and have a bev or 2... their happy hour is from 7-9 (LUV that!)", "author": "Anna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-05", "description": "I don't know if Bacchus is one of my favorites, but it is one of the neighborhood bars we frequent the most. It is comfortable and quiet if you go before 10 or 11pm.\nThe jukebox and pool table are small perks, as well as the friendly bartenders. I don't like how they covered the front windows with large, obtrusive plants as I can no longer people watch without looking as though I am creepily hiding behind plants. The small smoking room makes sense since the shmokers outside can get pretty loud, but it took away one of the awesome little elevated-table-and-seat areas.\nCheck it out if you are in the neighborhood.. Or not, and you are in  another neighborhood and just want to go to a small bar on Bush Street... whatever.", "author": "Syd V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-27", "description": "1. A dancer from the \"Nob Hill\" whipped out his \"talents\" in the smoking area upon request here.  Hey, I was just curious as to what sort of resume one has to have to work there. Can ya blame a girl?\n\n2. Bartenders are willing to accompany me in Fernet.\n\n3. Cozy and the jukebox doesn't suck.\n\n'Nuff said.  Love it.", "author": "Jennifer s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-30", "description": "Lose the pretentious name and I would like this place a little more!\n\nTheir happy hour beings at 7pm, a bit later than most bars, and their Tuesday Trivia Nights are always a fun challenge!\n\nA small, overall average, bar with a pool table, smoking room, and sofas.  Decent beer choices on tap, too.", "author": "Scott G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-17", "description": "I love this place! I Never had a bad time over here, I always come on mondays when Pam its working she is a beautiful bartender and before you walk to the bar she already have your drink ready for you.\nI love the idea of a Tahoe cabin, warm, fire place  and they have a SMOKING room (what else can you ask for)!!!!\nThe music is always good and the regulars are very sweet, love love love This bar!", "author": "Jennifer m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-02", "description": "This is not a bar I'd frequent if it weren't for their Trivia Tuesday nights.  On those nights, arrive early and claim some seats, because as you'll see, seating becomes a premium.  And if you think standing throughout all of trivia is going to be OK.  It's not.  No fun, especially in heels.\n\nPrizes are $30 for first place, $20 for 2nd, $10 for 3rd and cans of nuts for 4th/5th place or for the team with the most clever name.  Trivia is actually pretty fun even though we're not that great at it.  And I don't like how uber-competitive some of the teams get, like they'll hog the color version of the photo sheet.  Seriously, it's just a game, people.\n\nParking is hit or miss.  Sometimes you get lucky and find a spot right away, and sometimes you'll circle for 15 minutes.  So good luck on that.\n\nAnother minus, they won't serve cocktails off their happy hour menu after happy hour.  Is that typical?  Just because it's not happy hour, doesn't mean you don't have any watermelon pucker available.  Ridiculous.\n\nBut a plus, the trivia guy recognizes us each week, so that's fun.", "author": "spiff e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-22", "description": "some of the best bartenders in town keep me coming back here - Mike,  Lacy and Mary!\n\nGreat wee bar - wonderful bartenders and cosy vibe.....only problem is that it is hard to leave.   Just a nice casual neighborhood bar - there are so few places like this left......", "author": "Alison M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-11", "description": "Bunch of the group thought Ed was gonna get all excited being the logo kinda resembles Arby's...oh shiznay!  never even noticed this place from the many times of rolling to Sushi Rika which is nearly right across the street.  \n\nAnyhow, from the way the last two spots panned out, anyplace that has a bit of service, some cool heads and a bit of style was gonna get some yelp love from me.  I started things up with a Jameson just to make sure i was on point, Interpol playin on the juke--tiight! friendly peeps i don't know sayin whaddup- yes!!!  \n\nThats the kinda love i was expecting on our Saturday night voyage...bunch of the guys were slammin dice on the tables- i still don't know the game they were playin tho Gabe said it was like bullshit.\n\nUm...place is kinda seedy..a smoking room right near the front entrance--ho-hum on that one.  Like the vibe goin on here with nice staff and a mix of hoodies and locals.  I ended the night with a snake-bite nite cap...how lame is that?  Keane is cool.", "author": "omar b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-01", "description": "Used to love this place b/c of the juke box, crowd & pool table. Went last night after a long time of not going. $9 vodka cran & $8 wine AT happy hour?! And the dullest, most non-attentive bartendress ever. Sorry but this place has lost it's charm and if i'm paying those prices at happy hour, then i better be in spot that doesn't smell like stinky rancid beer and dirty bar rags. Now, if you're only into drinking beer and you don't mind the stench and the bad attitude from bartender, then is is passable. I say go to Ambassador Lounge which has beautiful interior and great folks working there", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-20", "description": "Went here on a quiet Monday night with the hot guy who lives next door.  The drinks and the company were great but I did kind of wish the bartender had been a little more solicitous so that I could have gotten buzzed faster and taken off my clothes sooner.  Ah well, she did humor me by concocting a Russian Prelude for me, a drink most have never heard of.  Just remember Very Bad Kentucky Fried Chicken (vodka,baileys, kahlua, frangelico, cream) and thank me later.\n***updated to add***\nHot guy next door has moved back to the East Coast but this is my new regular watering hole.  LOVE IT!!  The bartenders are the best and the smoking room rocks!  We have successfully instituted the new rule that Wednesday is the new Thursday (and Thursday is the new Friday) so celebrate \"Hump Day\" bitchez!", "author": "Jill D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-23", "description": "Decent place. Gets a little loud on weekends, but otherwise this neighborhood bar is pretty cool! Nice, chill atmosphere, friendly bartenders, and the price is right for the drinks.\nEspecially enjoy the tables by the window, get to people watch...which is always fun!\nGood jukebox: got Stones, Radiohead, Led Zep and other classic rock. Got a pool table for those who care....(not my cup of tea).\n\nWould have given it four stars but on weekend nights sometimes gets so loud that you can't hear any conversation. Which is never the key...", "author": "DJ R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-05", "description": "A decent-enough place. Stands out given it's neighborhood and it's  not obscenely crowded, even on a Friday night. It even has a smoking room for people who still do that. Bacchus has a lot of potential. \n\nHad the bartenders have any clue what they were doing (with drinks or with your cash), or had there actually been a table bussing once in the 4 hours my friends were there, this place would have made 4 stars. An admittedly eclectic jukebox blaring at mind-twisting levels was also a problem (this place does NOT qualify for my famed list of Top 5 Places For Acceptable Hearing Loss).\n\nIt has potential, but it's got its fair share of problems. Let's try it again in one year and see what happens.", "author": "Tolga E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-18", "description": "My new home.  Kidding.  Across the street from my new home, though.  Where to begin.  First of all, I love that no matter WHAT TIME OF DAY you go in there will invariably be a small group of Euros on the left side of the bar who are already kind of drunk.  It seems to me also that the bartenders are usually drunk, and in high spirits.  \n\nPlus, the decor is really cozy I think.  It doesn't feel like a dive bar at all.  It feels very proper, but yet remains a very proper place to get shitty.\n\n**Umm.  Apparently what formerly appeared in this space caused some trouble for the person to which it referred.  Great.  Does this mean I'm 86'ed from yet ANOTHER bar?  And this time for trying to say something nice?  I swear, I just can't get a break in this town.  I really didn't mean any harm.**", "author": "Coco D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-13", "description": "My new found haven for future happy hour activities...  I can't believe I had never come here before despite me and Bacchus both being residents of the same neighborhood.\n\nThis place has EVERYTHING, EVERYTHING I need and look for in a dive: Pool table, jukebox with excellent music, a smoke room, and a quite un-divey decor (cabin-like structure with clean counter/tables).  On my first visit I think it went a little too perfectly that it felt like a dream.\n\nAs the music played in the background (from Killers to Britney, from Dr. Dre to Hendrix), I devoured my Katsu Don bought from across the street (Sushi Rika , which can be my next review) with a cold Bass.  The mood was chill like a summer breeze.\n\nI'm all yours now, Bacchus my love.", "author": "Jiajia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-06", "description": "We didn't stay long because my friends are drunken whores, but Bacchus Kirk is a cozy, well-kept bar. I will definitely go back and give it a fuller try.\n\nAfter all, one of my drunken, whorish friends found a lovely \"lay over.\" That's inspirational!", "author": "Brad C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-10", "description": "This place used to be a great neighborhood bar. A loungy, old school, for lack of a better word, dive, with a fish tank. The bartenders were a little rough around the edges, and knew how to hold a conversation with any customer (striped, button up, collar shirt not required). \n\nNot sure what happened but now its a generic, hipster/GAP kid, dj-type club with zero character. Red lights, formulaic, trite minimalist decor, watered down drinks, and single serving patrons that act like they've been going there for years. You might as well be in North Beach or the Marina.\n\n...and whatever happened to that hallucinogenic poster of the sea creature in the men's room?", "author": "Brian R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "This place gets points for being close to my apartment (though uphill) and having the same last name as me. \n\nI dig the atmosphere and even sometimes the overloud jukebox. The bartenders are usually attentive and quick, though one has either forgotten or refused on multiple occasions to bring me water. Oh, and I got third place in a pubquiz here once while barely trying, so can't complain about that.", "author": "James K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-01", "description": "I like this place alot. The bartenders there rock! Mike is one of a kind fucking funny as all get out, Brit. is a sweetheart, Fiona is always pleasent with a big smile, Sharon tares it up back there and makes drinks fast, but my favorite bartender there by far is Pamella. She was my prodigy, my student. She will kill it behind the bar and for sure make you feel welcome any time she is working. I must say in all the years teaching, she has come full circle of what a bartender should bring to the table. \n\nNow about the place itself, very cozy, good music, and pool table. I love the concept of the the smoking room offset from the inside, (yet inside sorta)  \n\nBehind the bar- Very CLEAN!!  \nYou want a drink, you will find it here, atleast you could, not too long ago. The Signature drinks they have there are worth trying.  \n\nAll in all give this place a shot, I would not just say that about this place but I cant help it.  Way better than the Cellar one block over...", "author": "T S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "I like this place a lot! We came on Sunday night before July 4th, and the place was pretty slow, but while it may be slow, the bartender is super quick and helpful with drinks. It's just got a really good vibe and drinks are about $8 each so good price too. The place is kinda small with a pool table at the end. It's perfect to hangout with friends and grab a drink and relax. AND the music is not too loud, so makes for easy conversation. Awesome =)", "author": "Derek X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-31", "description": "This was as classy as a dive bar gets. Great atmosphere. Loved the Irish bartendress who IDed me. Good drink selection and *gasp* a happy hour. Easy to chill, plenty of seating. I will frequent. Will you?", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-26", "description": "I end up in here every few weeks because this is my friend's usual haunt. It's pretty awesome, very laid back and I've never seen it packed. It draws a calmer crowed so the vibe lends itself to that calm feeling. Not too shabby if you just want to chat with a friend without having to scream over some element.", "author": "Shauna S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-15", "description": "Came here last and it's a nice comfy bar to kick back and catch up with friends. It was pretty busy when we got in but the bartender was still friendly and quick. I like that there's plenty of seating and there's a huge selection of music to choose from on the juke box. I only got beer so I can't say anything about their special mixed drinks. It's cozy, loungy but not TOO loungy, divey but not a total dive... just a fun place to chill, people watch, and enjoy a few drinks.", "author": "Queenie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-05", "description": "A place to have a drink or two (or three) with your favorite pals. It has the ambiance of a ski lodge (complete with fireplace) but has an edge to it. [read: all kinds of people come here -- art students from the art academy, retired couple, occasional tourist, your professionals, etc]\n\nThey just added a smoke room (in the front) so you smokers don't have to go out into the cold. \n\nA great neighborhood bar (Nob Hill) that will hopefully be around for a long time!", "author": "Vanessa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-22", "description": "\"Nice remodeling job. \r\n\r\nBambi went with Bunny and a few guests recently and Bunny was on a mission for a date. So as a good friend would do ... Bambi started casing the Bar for a candidate and got lucky with Mr Radio. (keep reading it gets interesting I hope). \r\n\r\nSo Mr RADIO starts chatting up with Bunny which left Bambi to wonder about in the bar and the other guests to join. So here we are a few drinks and a pool game or two and Mr RADIO decides to invite everyone up the block to his apartment.\r\n\r\nWe finish our drinks and say bye to the lovely Chandra and head off to the Apt. We go inside and we are told to sit and enjoy while Mr Radio has to go get his boom box at which point he also mentions his mother is asleep in the bedroom and has taken enough pills to knock her out to the next millennium. Door opens and we are like where is Mr Radio going?... 20 minutes go by and Mr radio is back but this time thru the bedroom doors... At which point Bunny says...\r\n\r\n\"Bambi I think Mr Radio broke into the neighbors  Apt to get the Boom Box. We better get out of dodge before the police show up...\"\r\n\r\nRun Bambi Run ... with that we are back to Bacchus telling the story and scouting for another date. \r\n\r\nBack to the real deal... the bar has a pool table and a fireplace.. how cute. Drinks are priced well and the girls behind the bar are industry veterans. You know what they say \"the Irish can drink\" and let me tell you these girls can drink anyone under the table.\"", "author": "Teddy d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "Chill, relaxed atmosphere. Drinks can get rather steep, but it's like that in this area.", "author": "Jorge H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-04", "description": "Pooltable, jukebox, fireplace, stiff drinks, solid bartenders, and all wrapped up within a lower nob ski lodge.\n\nOne of my favs in the hood.", "author": "Dpb T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-26", "description": "It's like your upscale alcoholic huntin' shack with a great happy hour. The music is good, the decor is homey, and beer selection is above average. Drinks were average stiffness.\n\nWatch out, Tuesday is Trivia Nite and the organizers are Scientology-pushy about trying to get you play if you linger past happy hour.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-24", "description": "I would give this place 5 stars but I was kicked out once...not my fault (of course) and we have since settled this little misunderstanding. lol\n\nBut seriously, this has been my semi-neighborhood bar for almost 2 years and I love it.  \n\nPros:\nStrong Margs\nFellas with Irish accents\nPool table (huge plus)\nJukebox\nFireplace\nFriendly bartenders\n\nCons:\nPeople erasing names off of the pool-table-chalkboard\nShady happenings in the ladies room (always more than 1 person in that stall for some reason) - yikes\nCougars...they wander in from time to time ;)\n\nSo all in all, it's a pretty fun place.  If you have someone asking \"where is a fun place to go to just hang out, play pool, drink beers all afternoon and perhaps perform a rendition of Michael Flatley's greatest dance moves \"...well here is your answer.", "author": "Carlyna R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-09", "description": "If you're looking for a bar at Bush & Taylor in SF, this one works.\n\nI liked it.  Nice small location, good layout of the bar, tables/chairs, pool table , and jukebox.  Not ridiculously dark, good interior.\n\nThe Cadillac margarita was pretty good, the pomegranate margarita was eh.  Thumbs up to this place for having Guinness and Boddingtons beers.\n\nThe crowd was mostly the 20s/30s bunch.  The bartenders were nice enough and kept things moving quick.   It's a nice little bar.", "author": "Charles R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-08", "description": "Only had one drink in here, so I can't give a full on review.  Bacchus is located within walking distance the the Marriott where I was staying, and the bartender was a super-cool Brit that turned me onto the Mission district.", "author": "Troy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-08", "description": "Is it even possible to have a bad time at the Bacchus? Perhaps it's the people I come here with (BK regulars) but this place gets rowdy in a very UK way. michelle i is right, this place looks like a converted ski lodge on the inside, which helps you forget you're in the city, which is why you're there. Jukebox is good, drinks are generously portioned, pool in the back, smokers now on display in the front in a plexiglas box. Graffiti in the bathroom makes embarrassing claims about various people but I can't verify they're true so no points off.\n\nFiona is a great bartender. Treat her well and she will return the favor.", "author": "andy d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-12", "description": "While it is true that I am biased, I really like the bar and the people.\nThe staff is friendly and mostly Scottish/Irish/British.  There's a fireplace, pool table, cool music, Happy Hour (badly-needed drink discount specials) and they allow DOGS.  One full star just for the dogs.\n\nTrivia Tuesday at 9:00 featuring ME as DJ (thus the bias) but I like the Bacchus vibe and the Bacchus staff even on Wednesdays.\n\nThe locals are a friendly lot too. \nNo food, but you can bring it in.\nAnd did I mention the dogs.", "author": "Chuck B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-05", "description": "I've been to Bacchus Kirk twice now, both times for post-work adult beverages.  I really like the cozy atmosphere, and perhaps since I was there fairly early (6-9pm) it's never been too busy.  This could be why I found the service much faster than some other reviewers, but honestly I wouldn't have minded.  Both of the bartenders were very cool, talkative, and attentive.  In fact, last night we shared a free shot with the bartender -- it tasted exactly like an oatmeal cookie.  Fantastic.\n\nAs for drinks, I'm not that adventurous.  I stick with vodka and cranberry usually, and all the ones I was served here were perfectly fine.  However, my British friend who introduced me to this place loves that they serve Magnus cider (which tastes quite good over ice, really).\n\nLast night I tried the smoking room out, which I hadn't even noticed on my first visit, and it was interesting.  I appreciate its existence, but I don't see how it could be legal.  Oh!  The bathroom was larger than I've seen elsewhere and much, much cleaner.\n\nSo, overall 5 stars because it has everything I need in a bar, and the prices are standard for San Francisco.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-13", "description": "I like the log cabin ambiance here. The drinks are a bit lack luster but all in all it is a good place to hang out with friends. It is not too loud if you want to talk but isn't so quiet you are about to fall asleep. \n\nI have been here a couple times for small gatherings with friends. I would recommend it for a place where you just want to grab a drink and chill. Other than that I wouldn't expect too much.", "author": "Madeline T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-28", "description": "This place has Iggy Pop on the juke box so you know it can't be that bad...\n\nI've been here a few times to shoot pool and it seems the best bet for that in the neighborhood.  The table in back is nicely situated so that you don't have to bump into other drinkers while you're getting your game on.  The regulars also seem pretty cool, even when you beat them like 9 games in a row.  Some of them will even buy you shots, but that could be because they're trying to throw you off your game.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-13", "description": "Bacchus is 1 of 2 watering holes that I've considered to be my \"locals\" since moving to SF (the other being Murio's Trophy Room).  And when I say local, I mean that I went here almost every single day, knew all the bartenders, all the other locals, and spent copious amounts of money here.  Nowadays I only make it there once every couple of months, but it still manages to rock my booty!  The bartenders are always friendly (especially when you're a regular), they make stiff drinks, and the crowd is a good mix of people.  Pretty decent juke box as well!  \nDo I miss Bacchus because it was like a second home (sleet, snow, or rain I was there), or do I hate Bacchus for not being in my current hood?  I miss it...", "author": "Zev K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-06", "description": "Seriously, it's been well over a year.  If time can't mend my anger over this terrible service, this shouldn't be a 2 star place.", "author": "Sam H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-28", "description": "I remember liking this bar quite a bit.  I haven't been back though.  In fact I forgot that it existed.  \n\nMust check up to see if it lives up to the half-remembered revelries of a year ago.   I remember it being chill, dark, divey, with good drinks and bartenders.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-03", "description": "Stop in for a beer but it's nothing special. Typical neighborhood bar. Drinks are a bit pricey and I believe most of the cooler bartenders either moved on or were let go.", "author": "Marc B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-26", "description": "If you want slow service without a hello, come here. If not, don't. We waited at least 10 minutes for even a \"what would you like to drink?\".", "author": "Andy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-11", "description": "We stopped by for after-work drinks and came before the happy hour started! That's a first for me. Happy hour is currently from 7-9pm with a buck off taps and some discount on other drinks. Nothing crazy but a good deal. It was a bit slow to begin with and it could be a little hard to get the bartender's attention as she was busy with a private conversation in the corner of the bar. Didn't bother me too much, but thought I'd mention it as it's the only minus I have.\n\nThe jukebox is amazing. From TuPac to Postal Service, it hit home with our team.\n\nWe thought we wanted to get out of there before the trivia started but ended up getting sucked in and we had a blast. But what's up with the group of 15 \"pro's\" that show up *just* for the trivia and leaves right after? Kind of unfair to us random teams with memories partially blanked by the happy hour...\n\nBut I digress. We had a great night, we didn't play to win and we'll certainly be back again.", "author": "Jesper J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-10", "description": "Comfy, Cool, with a sexy crowd. A great place to go for a quiet pint with a date or to get rat-arsed with the lads. I give it double thumbs up!!", "author": "Johnny N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-10", "description": "What can I say - I practically live here.  I do my Dodgeball friends a favor by not checking in everytime I go to this place (for the last few months, it's been pretty much every day; some days several times a day).\n\nThe BK employees rock.  The bar itself kicks ass (well, they recently re-finished the floors, and they still haven't put the foot-pole back on the bar yet, so that blows.  And I won't even go into the loss I felt when they closed for the 2.5 days it took to re-finish).  They have a tiny little smoking room though I don't use it.  \n\nThe regulars: great group of people.  The non-regulars: for the most part, not too shabby.  \n\nThey have nuts and chips as far as food goes.  If they served real food, I'd REALLY be in trouble.  But there's plenty around if you want to go get some to bring in (or even have it delivered to you there) - and BK is very food friendly.  I usually hit up Cybelle's Pizza just up the street and bring a few slices in with me.\n\nOh, and they're dog friendly, too.  I don't recommend bringing them with you when it's super-busy inside, but otherwise feel free.  My 90lb boy is usually treated to a dog biscuit or two and even some water if it looks like he needs it by the great tenders they have there.\n\nSo stop by and check it out!  Say Hi to me while you're there!  Sometimes I do go home and take a nap from 5:30 to about 7:30, but I eventually make my way back.  And I'm getting better at not closing the place down during the work week...\n\nTwo point five thumbs up and five stars from me!!", "author": "Fluffy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-04", "description": "One of my more preferred pseudo-dive bar establishments in Nob Hill.  The jukebox is good times - mostly British music, which shouldn't surprise anyone since most of the people in the place are from the UK.  \n\nThe place is owned (last I heard) by a woman named Sharon, who also owned O'Farrell St Bar, but I think she sold it.  I may be talking out of my ass there, but that's what I'd heard.\n\nAnyway, they just added a smoking room not too long ago, which is helpful because it seems like most of the people who frequent the place smoke.  \n\nPool table in the back, though only one - so it's tough to get on.  The atmosphere is very red - red lamps and very dark.  Good selection of scotch and plenty of seating.  \n\nDefinitely my favorite neighborhood bar - a little bit dive, a little bit posh, if that's possible.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-25", "description": "Went here for the happy hour.  The bartender wasn't too happy she had to make cocktails instead of pouring beer.  I could TASTE how unhappy she was in every sip of my weak-ass drink.", "author": "stephany m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-25", "description": "Bacchus has a great feel to it.  Dim lighting, a fireplace with cushions around it so you can warm up your personalities, and a little smoking room.  Pool table in the back, decent jukebox.\n\nThere is one glaring problem with this place:  The bartenders are total slackasses.  \n\nSeriously I think that the employee handbook says \"If there is a full bar, and people are standing there waving arms and holding empty glasses and $20 bills, All Bacchus Kirk employees must make sure to stand in the corner and chat with each other whilst doing their very best to ignore everyone else\"  I've been bartending for about 4 years now, and I can safely say that there is absolutely no excuse for this.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-11", "description": "Good drinks, great jukebox, and great decor.\nIndoor smoking, good looking crowd, friendly service.", "author": "Enrique A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-31", "description": "Cozy place with cool wooden floors and a fireplace. I've only been here once and I had a Duvel. It didn't blow me away as being particularly unique, but I would definitely come here again.", "author": "Jade S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-19", "description": "Came here for happy hour with a friend on a Friday evening. Decent crowd but not crazy packed. Bartender was super friendly and she dealt well with a dramatic yelling match that happened between two patrons. My friend had his small dog with us, and she came inside without any problem from the bartender, also. They had a pool table in the back, and happy hour was until 9pm. Can't beat that!", "author": "Anne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-15", "description": "pretty stoked to have this bar right down the street from me.\n\nlooooove the wood cabin vibe, complete with fireplace.  awesome place to relax & warm up in the heart of the city.  annnddd...they even offer free pizza most nights during happy hour! never really packed, it's a great bar to chill out at.\n\ncould do without the boys at the pooltable that stare as you walk to the bathroom, but...they're decidedly harmless.", "author": "Kyle F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-08", "description": "The Kirk is a really comfortable neighborhood bar with exceptional ambiance (read: I, personally, look much better in the dark, so am devilishly handsome here ... especially after you've had a couple). There is always a merry group of low-key revelers to keep the vibe nice, but it's still a pleasant, conversation-conducive spot if that's what you're seeking.", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-06", "description": "My Irish hot mom. Yup. That's the bartender in this place, my hard drinkin', drink slingin' surrogate mother. I've just adopted her now. And she runs a pretty sweet bar: comfy benches along the side, a fireplace, pool table and it's totally dark and comfy. I barely even know what neighborhood this is, otherwise I'd be up here more often throwing back beers with my friends.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-24", "description": "My new favorite bar. I went there on Saturday night and had no trouble finding a table for me and a friend. Pros: unpretentious, comfortable atmosphere, warm fireplace, what looked to be a decent pool table, friendly bartender who gave us an awesome deal on drinks, the best music I've heard in a bar in a long time, no douchebags in sight. Why haven't I been here before?", "author": "Kari B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "I never knew this strip of bars on Sutter street existed before! Went to a friend's farewell work party here and really liked the vibe of the place. Good space, not too crowded and a pool table. Not quite a dive but not pretentious either. Me likey.", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-24", "description": "I have been to this bar before with a friend that lives across the street and it has been \"ok\".  But since then it has definitely taken a turn for the worse.  We were meeting a group of friends there to hang out, play pool, and watch the Giants game on their low def tvs.  Me and my friend were the first there and ordered drinks.  Right off the bat I could tell this bartender had a chip up her ass... with a negative \"what do you want from me\" attitude.  I shrugged it off and put down my credit card to start a tab.  While pouring my drink she asked for our id's.  I showed my CA id and my friend showed her International identity card.  Both of us are over 21.  The bartender didn't take my friend's ID.  So my friend said \"fine I'll just have a water\"  But the bartender said \"no, you have to leave now.\"   Then I said \"fine we are leaving then.\"  I tried to get my credit card back but she wouldn't give it back to me unless I paid for the beer she already poured.   The beer was still sitting on the bar and I never even touched it.   I said \"there was no way I am going to drink a beer while you kick my friend out.  Give me my card back\"  She still refused and threatened to charge the $15 minimum charge on credit cards.  I then said I would call the cops in 2 minutes if she didn't give it back to me.  After more attitude and bitching from her she finally gave it back to me and said \"your 86'd from this bar\"  Haha.... don't worry sweetheart there is no way me or my friends will be giving this bar business again.   BTW if anyone from this bar is reading this.... you lost a lot of business that night from the group of 10 people that were going to go there that night.  Your loss.\n\n If you want a moldy bar to serve you drinks with attitude then this is the place to go.", "author": "Patrick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-19", "description": "I like to stop into this bar on my way home from work, and have always enjoyed it. I like to sit at the bar and have a couple beers while talking to the great bartenders. I've gone in on some weekends nights and didn't care for the crowded atmosphere, but then again I rarely enjoy a full bar. A smoking room is a big plus!!!", "author": "Ken H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-14", "description": "There are times in my life where I have earned a few nicknames-- heartbreaker, vixen, maneater, etc. There are a few places I frequent where I come with a disclaimer. There are also a few places that I feel I can no longer return to do dating blunders, falling outs or just plain \"oopsies\". Sadly this is one of them....\n\nI enjoyed my visits to this bar. I really liked talking to the bartenders. The Irish lady and I had a great time making fun of my drunk Southern accent (drunk I was, Southern, sadly I'm not). She said it was easier to understand to me in my faux hick drawl. I love her already for encouraging my drunken shenanigans!! I had a great time talking to my fellow CalPoly alumni who not only had been friends of friends but also discussed the weird infectous nature of \"Sexyback\" (you don't have to like the song or even really know you're listening to it but you'll find yourself moving to the beat of the music--I'm sure more than one bartender will agree with this). I enjoyed the patrons, the ski lodgy vibe, the beer and some interesting memories that I will hold near and dear to me. Maybe one day I'll have the guts to come back here. No apologies are in order but potential awkwardness may await me. Oh well, that's why they serve alcohol in bars right?", "author": "Veronica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-14", "description": "Neat little late happy hour spot. It's nice that the happy hour is actually 7-9 pm, and the drinks for it are delicious!I had a pomegranate martini and a raspberry drop, both yummy. Jukebox, pool table, etc. Nice neighborhood and a chill crowd.", "author": "Irene F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-24", "description": "This place is so beautiful for a chill bar. The atmosphere is nice, the clientele seems good, the service was decent. Pool table in back wasn't totally packed the whole time on a Monday night, but there was enough traffic to keep it interesting. Looking forward to going back.", "author": "Monika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-25", "description": "saturday  night we dropped into bacchus kirk.  john's mate owns the bar, and invited us to their event that evening.  they were previewing their new cocktails, and all the featured cocktails were complimentary from 8-9pm. \n\nbacchus kirk, located in nob hill, reminds me of a sultry lodge you'd imagine in a ski town of lake tahoe or jackson hole.  the lights are dim with red hues, the interior is wooden, and of course there is the token fire place.  they placed a huge chalkboard in the back so the art students at the nearby college would stop marking up the bathroom walls, and display their work on the board.  there is an enclosed smoking area, which helps brace the cold on those windy san francisco nights.  my favorite are the huge mirrors that are framed by old 2x4 boards, c.1920's or so.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-13", "description": "Yet another pubtrivia review for Tuesdays.  This is your basic pubtrivia with two general trivia rounds, a picture round and the dreaded music round.  The prizes are cash and the crowd is mix.", "author": "Amber L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "Came here for a friend's birthday. Good drinks, reasonable prices for the city. It was awesome that they had a juke box that you could pick songs on ($5 for 18 songs or $1 for 3 songs). My friends had fun playing pool. Got a weeee bit crowded with all of us but we were a large party. Though we weren't there in time for it - the happy hour seemed like a great deal, goes all the way till 8pm every day of the week! Parking was a nightmare but what else can you expect from the city on a Saturday night.", "author": "Dana H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-29", "description": "this place lets my friend Kirk bring his dog Rocky in for beers- that scores a perfect 5 on my list!  They have triva night on Tuesdays that is fun.  Usually a fun laid back crowd a good place to get the night started!", "author": "rachel c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-14", "description": "i LOVE this bar.  my sister lives in the neighborhood and it's always our \"go to\" place whenever I spend the night at her apartment.  The bartenders have been supercool and friendly everytime i've been.\n\nI prefer the offnights going in for a beer, enjoying the fireplace, pool table and their juke box is good too...\n\nAnd by the way, if the rumors about getting rid of trivia tuesdays are true I'm going to be really sad!", "author": "Nicki F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-14", "description": "Bitchy English cnt bartender just bnned me for not putting up with her boyfriend. First he comes on to me, then when I tell him I'm straight and not interested becomes insulting and challenges me to go outside for a fight. He doesn't go outside, but she kicks me out apparently for not being gay and English like he is. She sucks, he sucks, and I'm not going back.", "author": "Pete A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-17", "description": "what can i say about the BK? good prices, good selection (they have guinness - a must), complete with a juke box and pool table - it's like home away from home. \n\nthe dim lighting and ski-lodge meets dive bar feel provides for a comfy place to hang out. i used to live across the place and loved stumbling home afterwards!", "author": "Jill L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-08", "description": "Trivia night. Ski lodge atmosphere with functioning fireplace and trianglular wooden roof. Pool table with nice folks. Great Irish bartenders. Smoking patio up front. Jukebox. Random hipsters jivin' to the Bee Jees, or punks watchin' them in digust. Not too pricey. Cheers!", "author": "Braden B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-23", "description": "THIS was a great Yelp success story. I had to meet my boyfriend and a couple of friends in this hood and I looked up places on Yelp, and this place was a wonderful find. It's walking distance from Market (yes, up hills) but the environment, and even the people seemed pleasant and non-pretentious enough. It has a very cozy feel, and the 'tender was friendly, and efficient. I had Piper Sonoma Sparkling, which is decent stuff and it was $7.  -Don't find that much in other places.  But this was a week day, so who knows on a weekend!", "author": "Cristian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-19", "description": "Good neighborhood bar with decent prices for drinks....although I am not overly impressed with the jukebox selections.  I like the ski lodge atmosphere and will likely come back when its snowing back East.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-22", "description": "Great place to watch Dutch World Cup matches. They were rapidly running out of just about every beer they have on tap, but the nice sized group of oranje supporters made it worth while.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "Pretentious name, not place. Very cozy. Reddish lighting. Fireplace. Has a lodge feel. Perfect for warming up on a nippy day.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-01", "description": "So, I just moved to the city and people have recommended yelp to find great bars in the city.  My co-workers and I came to Bacchus a few weeks ago and I think I've found my new neighborhood bar.  The bar was pretty busy and everyone seemed to be enjoying themselves.  I really enjoyed the fire place and the warm atmosphere.\n\nThe hot Asian bartender was very attentive and by our conversations she seemed to be very intelligent as well.  The smoke room was very convienent because it was freezing outside!!  They also have a pool table and a nice selection of songs on the juke box.\n\nYou can bet I'll be back because I live just down the street... No DUI for me!", "author": "Scott O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-29", "description": "i was in the neighborhood last night and decided to stop in since i had some time to kill.  kind of dark but cozy with tables, a jukebox and a pool table.  i sat at the bar and noticed the fruity but tasty sounding drinks listed on the wall.  i stuck to beer since i had plans but i will be back for happy hour again, especially since it goes until 9, and maybe for trivia night.\n\nin the half hour i was there, i met a half korean guy from georgia with a southern accent who was almost given an unfortunate name and some lady analyzing the definition of slut.  it was fun.  if i lived nearby, i think i would be there all the time.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-20", "description": "So about a year ago, my friends and I were moseying (is that even a word?) ok sashaying (ditto)...ok fine...we were walking down Bush looking for a decent place to shoot some pool and grab a drink that wouldn't include staring at a tranny hooker from across the bar...Lo and behold Bacchus Kirk.  \n\nThe bar itself...eh its a bar.  They do have a fireplace which is nice in winter (it gets Burning Man hot in there at times) and they do have a pool table, which is part of the reason that I have made it my local home.  There is a jukebox with a good collection of music from the-grass-is-so-emo-it-cuts-itself type to your standard I-sing-about-jail-but-never-really-did-time Johnny Cash.  Crowds are always cool; I have never seen any fights.  I did see a couple of tools arguing with each other once, but honestly Asian ladies fighting over the same scarf at Marshall's are more vicious.  Oh by the way, the douche from the earlier review that got 86-ed because he did fight there, STFU.  Grow a dick and find another bar to flex your compensatory muscles at.  I'm glad you aren't at my local.  Anyway, I digress...there is a cool little smoking room just off the doorway which always has entertaining conversation.  As a warning the bar is a pub crawl destination on some nights (and who could blame em?), so crowds get a bit deep somtimes around 9pm, but come on, its San Francisco, get used to it.  \n\nI will say that my favorite nights to go are Wednesdays because of Mike.  Seriously, if Jesus Christ had taken up serving drinks instead of that miracle-thing, well he would have been a helluva bartender.  Mike run's a close second.  I love this guy.  No really, like serious bro-mance.  He always gets my drinks quick, knows what I want and is always in a good mood.  Plus he has cool hair - man is this going to be awkward next Wednesday.  Ok, ok...I also really love George (female, dont worry) and Fiona (she's sweet) and Pamela (she's Brazzilian and hot! My girlfriend is going to kill me...love you babe *meow*) and Siobahn who guest-bartends every now and again and well frankly everyone there...they are all between 3s and 5s on the coolness scale...10 being max.  Just kidding guys...dont spit in my Stella!  Seriously though, if you are looking for a local joint to shoot some pool and grab a cold one, this is your place.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-13", "description": "Bacchus Kirk was cool for the most part and I'll definitely  be stopping here again. The jukebox is pretty solid, unless you get someone, like we did, who plays 3 Rage Against the Machine songs in a row. That was pretty annoying. Anyway, my cocktail was great but I switched to beer to slow down since we were getting up super early the next morning. Most people were pretty friendly, they have a little smoking room in the front so you don't have to brave the windy cold, and it seemed as though you could bring in take out food. Hopefully I'll make it back here this week/end.", "author": "Natalie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-08", "description": "Still kicks A** and I love Camilla, Mike, Pam, Fiona and Louise. In no particular order!!! : ))", "author": "lisa v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-26", "description": "The Kirk, as we affectionately call it in my circle, is home to some and a mail drop for others in the 'hood.  I love the fire place and the wood walls.  Plus, the bartenders are fun.  They finally got a decent juke box now too.  Homey and central.  I love The Kirk.", "author": "Chard M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-26", "description": "Why did I think this was a wine bar??  Came here with some friends for Friday happy hour and I was a bit surprised to walk in and find a dive bar.  Not disappointed, just surprised.  There is a pool table at the back of the bar which I did not partake in during this visit, but good to know for future reference.  The bartender was super nice and actually gave my friend a smoke as she had had a pretty rough day.  They have a well-ventilated, convenient smoking area at the front of the bar for those so inclined.  I'd definitely come back for a post-work drink.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-24", "description": "What a great neighborhood bar! It has a very cozy/lodge feeling. The wine selection wasn't great, but the service was wonderful. A great local neighorhood bar! They have great happy hour prices!", "author": "Suzie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-26", "description": "This is a great neighborhood dive bar. The place has a cozy cabin-like interior with a fireplace, pool table and jukebox in the back. I like that its unpretentious with a good mix of people, all ready to just chill and have a good time. Definitely a great happy hour spot too.", "author": "Leen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-13", "description": "There is nothing wrong with this little place.  I like the seats by the fireplace and the music selection and the decor is nice and the lighting is subdued. And I like the name which I have a hard time remembering.  I'm just bitter because I had way too many beers to be charming and consequently and deservedly struck out this evening.  I think I tried to hit on this girl in Portuguese and she didn't like my translation. My apologies to members of the female race.", "author": "Cassio P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-15", "description": "I know it is going to be a long nite when I start my bar crawl here. This bar is not too much of any one thing. The music on the juke box is well rounded and the bartenders are friendly. The feeling in here is relaxed neighborhood bar that is not divey.", "author": "Charise B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-06", "description": "I don't know if it was the bartender's accent, or just a spur-of-the-moment decision, but I found myself nursing a pint of Guiness, which is a rare choice for me.  The happy hour is a convenient time, 7-9, so it's easy to make it after work.  I got my rear-end handed to me in a couple of games of pool, but that's too be expected.  I like the long bar; it's condusive to socializing and the crowd was solid.  There's a fireplace, which adds some homey flare and they're showing all of the World Cup Soccer games.  Yet another great neighborhood bar to frequent.", "author": "ellyk E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-19", "description": "I loved it! Probably because I prefer less crowded bars that actually give you something to do, like chose music from the jukebox or play (more like suck at)  or watch pool. This is a great place to go and relax. There wasn't much of a crowd, so co-mingling with other bar persons is highly unlikely but I'd definitely be back and I'm putting in my list of favs.", "author": "Cassy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-12", "description": "As this is now practically the only surviving bar within a 2 block walk from my home habitat that has not been taken over by the Academy of Art leeches, I consider it a treasure. The bartenders are great, very friendly and the vibe is more neighborhood like than Nob Hill snoothood like. Good place to have a pint, sit in a corner under a red lightbulb and look mysterious...", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-19", "description": "I really like the ambiance of this place. Its got kinda cabin-y wood lodge feel to it. Very warm and comfortable. I've been twice for their trivia nights on Tuesdays (which is quite fun since I'm a trivia whore). Their happy hour drinks are pretty good too. And parking (on a Tuesday) has been surprisingly easy. I doubt I'd come back for any night besides Trivia Night,  since the crowd is pretty Nob Hill-ish.", "author": "Rocky K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-02", "description": "If you are looking for one of the best filthy martinis in town, go see Mandy. No seriously, she knows how to make a drink, always has a smile on, and is generally just kick ass. Not only do I love this bar for its proximity to my house, but even better they let me bring my dog in, and they rarely have the flat screen tvs blaring sports, or sports center, or some other sports thing at me.  They have a great selection of booze, a damn good selection on the jukebox and seating galore. Its a wonderful place to waste a Sunday afternoon, and I promise if Mandy is behind the bar you won't be disappointed!", "author": "Jenny E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-09", "description": "I am not sure how to review this place as I have no strong feelings one way or the other. I like to stop in for drinks now and then, but I am not really a fan of the music (too loud). If they turned it down a little and added some more comfy seats this place could be an awesome lounge.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-30", "description": "I agree with Sam H.  I used to love this bar but that \"little metro bartender\" ruined for me.  1:45 am rolls around and he's yelling at everybody from behind the bar: \"Let's go, people!  Finish your drinks!  C'mon, time to go people!\"  To Sam H's point, if he would've asked a little nicer, I would've been cool with it.  (Instead, I knocked over my beer and got into a yelling match with him.)\n\nThe problem is, this bar is great.  I love it.  It's chill, never packed, and the music is good. But the bartender sucks.  Not all of them, just that one.\n\nStill, I do recommend this place, but make sure you leave early if he's working, unless you want to be ushered out of the bar like a homeless person on a door step.\n\nWhat a shame. What a waste. As a host, you should treat your guests with respect and you will get respect in return.", "author": "Nicholas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-15", "description": "I have been to Bacchus Kirk several times and have always had a great time.  Great atmosphere, great people, and oh yeah -great drinks.  Try one of their signature drinks on the board the Mellow Mango is delish.  Or if you see Tim the bartender (crazy fun guy behind the bar) ask him suprise you & whip you something up - I have never been let down.  And dont forget quiz night.  They write their own so you dont feel like you are getting the same everyday pubquiz that everyone else is.  Check it out for yourself, you wont be dissapointed.", "author": "Sara Ann S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-03", "description": "Went for a drink here last night before a wedding at the Memorial Club. It's a cool little spot. If you're in the neighborhood definitely worth checking out.  This area is becoming a good area to bar hop - with Cantina, Owl Tree, Sugar Cafe, White Horse Tavern - it's now getting to be a good destination for going out.", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-11", "description": "Tonight, was my first time to Bacchus Kirk, the decor was spot on for this Nob Hill sleeper...The bartender was quite friendly but a bit slow with making a mixed cocktail, but hell it was a Monday night!  The wood and the exposed brick gave me a warm feeling of being home or back on the East Coast, while sipping on my scotch and listening to classic indie track.  I was impressed with the jukebox selection and the fact that the bar has a pool table, \"Perfecto\" if your rolling solo or with a drinking buddy. A hidden Jewel amongst the random bars traversing up snob hill.  I think I found my new watering hole, away from home!!", "author": "jonathan b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-24", "description": "While its definitely not the coolest bar in the city, Bacchus Kirk is very cozy.  It has a large fireplace in the middle of the dark bar which creates an atmosphere perfect for a deep chat with a close friend.  Or get all your friends together and take over the bar.  The jukebox is decent and for those of you who fancy pool, there is a table in the back.  But it seems to be very popular. So expect a wait.", "author": "Alexis M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-24", "description": "While I do not appreciate the clientele here, I must say that for my neighborhood bar it's rather nicely appointed -- good atmosphere, good drinks, and nice staff.", "author": "Darren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-26", "description": "From the outside it looks like a dive and from the inside smells like a dive but the music, lighting and art on the inside make up for it.  This is a great little bar and so close to my house.  Great Music..yes, I too love Oasis.", "author": "Kattya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-05", "description": "this place gets five stars b/c there's a dog, jake, that runs around here.  i'm a total dog person (currently sans-canine), and that's probably more of what influenced my obsession with this place than anything else =).  \n\nseriously though, it's got really cute decor (w/ a fireplace!) and there're pool tables in the back.  cheap happy hour deals on martinis - and happy hour goes pretty late - 8 or 9 i think.", "author": "Alexis W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-18", "description": "Dim and local, pool table in the back, and a smoking glasshouse (with an open window onto the street). It does not, however, feel like a dive bar -- the decor is definitely... upscale rustic (?). The bar selection, prices, and service were all average. Very easy-going, never too crowded or too loud (though there can be a crowd on the busiest nights), and perfect if you're just in the area, need a night-cap, or are in the mood for a casual beer. If you're a local, come be a regular!", "author": "G. J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-28", "description": "Homey bar just keeping its head above Tendernob dive. Friendly bartenders and a nice local feeling make it the best \"spittin' distance from home\" bar for me. If the bar itself didn't look like a linoleum fake wood floor I'd maybe bump up the rating.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-13", "description": "A great little neighborhood bar. Pool table in the back, slowish but friendly service. And a great Tuesday night Trivia Contest. Although I may be biased because we came in second! Ha! Take that, third place bastards!", "author": "Tim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-02", "description": "I went here recently with a bunch of coworkers that ranged in age from mid-20s to late-60s, and we all had a great time.  There really is something for everyone.  The jukebox had a variety of crowd-pleasers (from The Streets to Justin Timberlake).  The cocktails were tasty.  And it was a nice clean place with still a touch of a neighoborhood divey atmosphere.  Will definitely be going back for more Happy Hours.", "author": "Christina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-11", "description": "First, ONE star because I live a block away.  Second, TWO stars because the most awesome bartender, MIKE works there. Third, ONE star because the juke box ROCKS my world.  Finally, LAST, but CERTAINLY not the least star goes to the pool table and all the reindeer games you can play here.", "author": "Rochelle B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-01", "description": "in all fairness, i came here last night when i was pretty tired and not feeling like drinking. i had a couple of friends there who i hadn't seen in awhile, and felt like i should stop by to at least say hi. \n\nit's actually a pretty nice bar for the tenderloin area. i would categorize it as a trendy, local, dive bar. it had a nice chill atmosphere and a pool table in the back. i liked it cause it wasn't overly crowded but there was a good number of people there so that it didn't feel like we were the only ones. \n\nservice was pretty friendly even though it seemed like there was only one girl there taking care of the whole bar, and although it wasn't crazy busy, they maybe could've used one more person, but then they probably wouldn't been bored. they were right on the cusp of needing one more person or having people wait a little, which for the type of place it is, i think it's okay. is seemed like quite a few people there were regulars and familiar with the bartender. \n\ni ordered an amstel light and it wasn't quite cold enough, not sure if it hadn't been in the fridge long, or they just don't have their fridge set to very cold. it was really warm inside, a little too hot for my liking, especially when i'm drinking. the music was fun, i think it's a jukebox, but it was a little loud. for a bar that's really just a mingling type place we had to shout at each other every time the music was playing which when i go to a place like that, i like the music playing but i don't like to have to shout. i just want to be able to chill with my friends, have a beer and chat with some good music in the background.", "author": "Angela W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-31", "description": "Went here for the first time a few days ago and was pleasantly surprised.  Drink are fairly priced, even though I only drank beer, but the Heff was $4.75, pretty average. Atmosphere is cool, and the particular night I went it wasnt too crowded. In addition, the jukebox seemed to offer some pretty good choices as well. One star off because I did try to go here once on the weekend and it was too damn full.", "author": "Vilen G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-31", "description": "I went here on a Monday night.  There were a few people at the bar and a few other playing pool in the back, but otherwise, my friends and I had two huge tables to ourselves.  For some reason, I kept expecting to smell smoke since I am from the east coast and this is the type of dive bar that would be so smoky that you would not be able to see without crying after a while.  Thank you, California's legal system.  There was not a single renegade smoker in the bar and I had a great time here.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-07", "description": "This is the perfect neighborhood pub. Great bartenders, great music, great regulars... plus the added bonus of a very nice happy hour to be throughly enjoyed by the fireplace.", "author": "kristin n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-08", "description": "With a name like Bacchus, you've already got me on the upbeat.  Luckily, BK doesn't disappoint except for--and let's just go ahead and get it out of the way--a crop of take-your-own-sweet-time bartenders.  That aside, the high ski-lodge wooden roof, fireplace, pool table, happy hour (which *begins* at 7pm), and conversation-friendly tables make it a nice little neighborhood staple.", "author": "MScott S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-19", "description": "It's like a bigger Zeki's... Great jute box, pool table, cool people. The bar tender was a complete bitch to my group of friends, but seemed to know and LOVE everyone else. She charged me two dollars for tap water...is that legal? Aside from her I loved the place! It is dark and as someone said has a ski lodge feel. There are a few TV's and a large fireplace. I would like to become more of a regular...then maybe the bar tender will want to be friend too.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-18", "description": "Great choice of music, great choice of drinks, pool table, smoking area for those who need it, nice bartenders, divey, but not too divey.  -1 star for not great toilets.", "author": "Sarah E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "Close to my house. No hipsters. No Marina dudes. Conditions are perfect.", "author": "Serena L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-08", "description": "I went here on a Thursday night fairly early (8ish) to meet some friends. We had a great time until about 9, when the place became completely packed. There was only one bartender. I give her credit, she was busting her ass, but it was impossible to get a drink.", "author": "Dan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-06", "description": "This is a great neighborhood bar to go grab a drink at night during the weekday.  On Wed, there is trivia night and it is usually packed with people ready to have a good time.  Bar tenders are nice and the crowd is laid back.  I agree with the other reviews, it has a very home like feel to this place.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-18", "description": "Was just there for a few beers with friends on a Sunday night but I really love the atmosphere with the fireplace and the pool table.  Nice selection of beers and the bartender was friendly.  It was fairly chill on a cold Sunday night other than the dancing referee outfit drunk girl who was playing some good Michael Jackson tunes at the jukebox.", "author": "K V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-11", "description": "good lord, who cares about this place.  the truth is, the drinks are good, and different, but a bar is a bar is a bar.  Seriously, unless there are swings or free food, the only thing that really matters about a bar is the bartenders, ie how they make the drinks, and how happy they make you.  \n\nI have been to bacchus on several occassions, and I think only once did I have quasi- ok service.  The other times the bartenders seemed drunk or high and really did not care take care of us.  On one occasion (trying to get out of the place because I was sick of waiting), i actually had to wait for the bartender to finish her smoke outside, then talk to some friends by the pool table before she even got to me.  AND, i sure hope multi-tasking is not put down as qualifications on their resume.  Most times I have been there they literally take ONE drink order, take 10 minutes to make the drink then take one more drink order, even if you are ordering in groups, don't expect to order all at once, it's one at a time here.\n\nSo I like the atmosphere and drinks, I just can't handle the feeling that I am ruining the bartenders night when asking for said drink.", "author": "Brigid R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "it's friendly in here!  we were digging the cabin vibe, the pool table and the 90s music and sipping on some $6 mojitos.  the bartender even mixed me up a peach mojito since i can't tolerate too much minty-crap in my drink.  i just wish she would have also put some rum in there!  weakest drinks ever.  stick to a draft beer i think.  i'll be back another time to hang with the locals.", "author": "Holly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-14", "description": "a lovely little bar with a ski-lodge feeling? or maybe i'm way off but that's what it felt like to me for some reason.... i just signed a lease for a new place close by and will be moving over here in just a few weeks. i wanted to stop in and check it out.... yeah, i'm so happy! i loved the energy in here immediately. they also seem to have some very friendly and heavy-handed drink-pouring bartenders. i have this feeling bacchus kirk will be my new neighborhood hangout... will edit later when i have a reeeeally good story.", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-28", "description": "cozy sausage party, good for friends. terrible jukebox. smoking room is fun. bouncers joke like drunk uncles.", "author": "C S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-26", "description": "decent bar. very diverse crowd sometimes. lots of foreign hostel kids, which could be pleasant or annoying. friendly staff - although slow at times. any jukebox that has oasis, stone roses, and primal scream is ok with me! they've got a pool table. recently, they built a little smoking room in the front, but it's fairly tiny and i'd rather go outside to smoke. the bar always has smells of bleach though ... kinda annoying.", "author": "James J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-15", "description": "This is my favorite bar in my neighborhood. They have drink specials from 7-9pm on weeknights. It is chill, they have a pool table, and play good music (they played Oasis and I was sold). The crowd is the normal bar folks with some rockers sprinkled in. The bartender is a nice lady with a cute accent. --Any one who doesn't like Oasis can piss off.", "author": "Trevor D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-18", "description": "Although I've only been there a few times, they have a GREAT mohito and they have 18 year macallan scotch!  On certain nights they have games in the bar to involve all the clientele.", "author": "L M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-22", "description": "i stumbled into this bar during a bachlorette party and it was such a pleasant surprise.  chill crowd with a log cabin interior.  fun pool table in the back and a jukebox stocked with decent tunes.  they also have a fireplace with a cushions surrounding the hearth.  would love to go back in the winter and curl up next to the fire, if it's ever lit.", "author": "Sharlene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-21", "description": "yay bacchus kirk!  this great little bar served as the site of the fabulous bday party we threw for our fave girl, and was the perfect backdrop for all of the amazing things that happened that night.  while i have a feeling the party changed the usual vibe of the place, the crowd was fun and friendly and the drinks hit the spot.  the fireplace was a nice touch, although the bar got a little hot as the evening went on.  but the set-up of the bar was great for chatting with groups, and there was room for dancing for when the mood struck.  and since it is so conveniently located to my friend's apartment, we will most definitely be regulars at this place.", "author": "ali l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-20", "description": "this place has really turned around since the days of doing my laundry and getting a bit tipsy. jukebox is good, just keep 'er spinning. the bartenders are nice and always check id's. you have to appreciate a bar the insists on checking id's.", "author": "carli m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-12", "description": "I live across the street from this place, yet you won't find me here often. The place does look pretty cool, has a cozy atmosphere, a pool table and friendly staff, but these are the only redeeming qualities. What weighs this place down are pricey drinks and, more than anything else, the douchy clientele. Not necessarily referring to the infrequents or the average type of people this place attracts, but the few weirdo regulars that are always there and always annoying to the point where I'd like to take it outside.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-02", "description": "Morrissey? Megadeath? You pick - they have a juke box with music that is so different yet all good.  Dogs - YES.  Strong drinks - YES.  Smoke room for my smoking friends - YES.  Slow service - YES - but for some reason I like it.  Go ahead and take your time. It all just works.", "author": "d l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-21", "description": "i used to go to this place often.  i used to live down the street from this place.  i agree with Patrick M.'s review when it comes to the weirdo regulars.  there are a couple there that are just plain annoying.  i have found it is best to go there on a weekend morning until early afternoon.  i had a really annoying experience there one time.  let me tell you about it.\nso i am there drinking, heavily, and playing pool and so on.  then a serious douchebag tweeker walks in to the bar and wants to play pool.  he's definitely flying high on something.  from the moment he starts playing he is annoying me.  he is lining up all of his shots like he has laser fingers.  he is not lining them up with his cue but with his fingers.  and it is taking him nearly 5 minutes to take any shot.  so i do what any rational human would do i yell at him to hurry the f*ck up.  very pleasantly of course.\nthat was all for a little bit until he followed me outside and started talking jibberish to me.  well badda boom bodda bing there were some punches thrown and they threw me out of the bar.  \ni was livid; here i was had dropped nearly 60 bucks buying drinks for me and my friends.  i didn't throw the first punch, this guy didn't buy anything and they throw me out.  after that i decided i would never go back.  i tried to go back of course and the douche would not let me back in.  that was last year and i have been back a few times since but this bar has kind of lost it's appeal to me.", "author": "Anthony Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-23", "description": "been a loyal patron since '88. ah, the good 'ol days. like so many, the bacchus has changed they have been able to maintain coolness. r.i.p. jerry and the rest of the old timers.", "author": "Jeff B."}
