{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Expensive if you're used to domino's (or similar chain) pizza, but Baiano's is worth it. Truly excellent pizza with fresh ingredients.\n\nLike with anything else, you get what you pay for; especially in the overpriced land of SF where it costs a crazy amount for businesses to operate.\n\nIf you want cheap, average pizza, you can find it elsewhere in the city.\n\nBut if you want truly terrific pizza, this is what you want. Delicious food that doesn't make you feel awful after eating; plus (if you're health conscious or have an intolerance to certain ingredients) it's very easy to customize and get exactly what you like.", "author": "Elizabeth F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-28", "description": "Oh man.  Prob the second worst pizza I've ever had.  I'm not thrilled with any pizza in SF lately and thought I'd give this a try.  Nope. \n\nCheese pizza tasted like sweat and garbage. Literally smelled so bad. Wife got the raviolis, cheese, Alfredo suace- absolutely terrible. Had a bitter taste and the pasta was stale.   \n\nWe had to Throw all of it away and eat ice cream for dinner.  My kid didn't mind that part.  What a waste of $30.", "author": "Amie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-03", "description": "Good pizza, ridiculous prices. \n\nIt's sobering when a pizza that's really a 13.99 item costs you 30 bucks.\n\nC'mon people... it's pizza. Keep it real.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "Got a 12-inch pizza delivered for $26 (including tip). Meat and mushrooms pizza, with pepperoni, spicy sausage and mushrooms. Very yummy toppings - pizza was dough-y on the edges. Great for hassle free delivery and was delivered 10min early. One of my favorite was the saying on the receipt - see photo attached. 7.5/10, will order delivery again.", "author": "Gia P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-28", "description": "Tried this pizzeria out because they were close and also delivered! Went with the popular margherita pizza and chicken croquettes. \n\nThe margherita pizza was decent. It wasn't the best I've had, but definitely wasn't the worst. To me, the crust could have been fluffier and there was a little too much sauce. Otherwise, not bad.\n\nChicken croquettes were good, and they came with a cream dipping sauce. A little too greasy/heavy for my liking though, so can't eat a lot of them along with pizza. \n\nI'd probably order from Baiano again, but not as a first choice.", "author": "Lillian B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-03", "description": "Too expensive, nothing special.\n\nWe ordered one large meat pizza through the phone without asking for the price and during pickup, it came out to nearly $40. $40 for one pizza?! \n\nPizza tasted meh, and it only fed 2-3 adults.  Maybe the salads or calzones are better. I never paid over $25 for a pizza, this is nothing special and not worth the high price.", "author": "J F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "They have a number of vegetarian pizza types and they are all yummy.\nThey also have a nice selection of Italian wines.\nGreat place for Mediterranean food", "author": "Sevda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Better pizza than Florence Italy. Margarita pizza is a must. 5 stars. It's the best. Do it. Stop reading this and just go do it", "author": "Ross W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Went there just 10 minutes before closing (sorry!), but only to get some pizza for take-out. The staff was super friendly and I got three different slices. They all tasted great. Too bad they close at 10, because their pizza makes excellent late-night food.", "author": "Jonas L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "I must say I stumbled upon this place riding my motorcycle and let me tell you. Yummy!!! Definitely marked this place to try out more then pizza. They have a full menu to select from. Will definitely be coming back.", "author": "Cliff D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-26", "description": "Rude! I ordered delivery to my work place. I asked for them to call me when they're in the lobby. The guy calls me and then just left my food on the counter in a public lobby and left. I tried calling the number but it doesn't accept any calls. I looked around and saw the bag of food. \n\nWill update later after I try the food.", "author": "? ?."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-19", "description": "First of all, no one greets or say hello when you walk into this restaurant. \n\nSecondly, the place was extremely dirty with paper and food crumbs everywhere. I did not see napkins to clean the tables so I just kept my elbows in my lap. \n\nLastly, I think they lied about not having Military or Law Enforcement discounts because the dude at the counter was more concern about how nice I was dressed. Nevertheless, I will never give a restaurant more then 2 stars if they don't support out Military and Law Enforcement members that give their life's ever day so America can be safe.", "author": "Tommy Gun Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "This is hidden gem in the Hayes Valley area!! Amazing salads, pastas and pizzas are amazing!! If you are or live in the area check it out!! I highly recommend it", "author": "Erick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "I have ordered pizza from Baiano many times, the delivery was fast and easy and pizza was still warm and consistent in taste and quality. \nI love all the different flavors and combos they have. \nYou can also eat in and the staff is friendly to big groups or kids which is always a plus! \nThe pizza at Baiano Pizzeria is very good quality with fresh ingredients. They also have pastas, salads and you must try the Brazilian chicken croquettes- they are delicious. \nThat's my go to place to order and it is always a crowd-pleaser!", "author": "Sabina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "I've ordered a pizza on a friday night and was a really good surprise! The salsage honey was something else... mix of spicy & sweet and delicious, delivery was super fast and friendly.", "author": "Bruna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "This is the best pizza by the slice I've had in the city! It's a little pricy but far superior to cheaper slices from North Beach. I had a Hawaiian slice and my partner got a slice of cheese. A half cheese half Hawaiian pizza came out of their pizza oven just as we arrived, so our pizza was very fresh. The dough is a perfect juxtaposition of doughy but still crispy. The cheese to sauce ratio was perfect.", "author": "Marianne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "The best pizza place ever try it out it's good fast and ready to go also hot and fresh", "author": "Ansbert A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Love this place! I come here every week, pizza is awesome with that crisp bottom I love. Fast service and friendly staff!", "author": "Annie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-15", "description": "Pretty mediocre pizza at a premium price. Wanted a slice of mushroom pizza and it was almost $6. Pizza wasn't even warmed up properly. Good as a last resort if you're craving pizza but otherwise try to avoid", "author": "Alex T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-11", "description": "I've no idea how the food is at this place. The reviews make it look decent. I'm one-starring because they SLAMMED Duboce Triangle with tri-fold flyers without any attempt to stop them from blowing allover hell. Three were dropped on my porch (not in mail box, not a door hanger, just sitting there.)  So we are inundated with their trash. If they acknowledge this review and agree to clean up after themselves, I'll happily pull this review down.", "author": "hOWARD y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Baiano is our go-to place when we order pizza at work. They can handle large orders, have great delivery and service, and they have really great gluten-free pizza. Highly recommend the sausage and honey (white pie) and the margherita pizza (this one doesn't look like your usual cheese pizza topping but is still really delicious). The baked rigatoni is another office favorite.", "author": "Sarah N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-05", "description": "This is one of the best places for artesian pizza in all of San Francisco. They definitely have amazing pizza as well as things like their calzones and even some of their other unique offerings. I eat here weekly via delivery and can say that they deliver quickly and sooner than they quote you most times. I love their honey and sausage pizza, it's an adventurous thing for one who's never tried it before and it will leave you speechless and full, guaranteed! Try them for lunch or dinner, I've only had them via delivery so can't speak to the dine-in experience, but have to assume it's as amazing as their food!", "author": "J Austyn B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-21", "description": "Terrible. Stopped here for late night pizza. Cheese pizza was a little overpriced ($5) for what it was. The first slice they tried to serve us had a hair on it.  Not sure why there were such positive reviews on Yelp - perhaps for the fresh made pizzas? They need to up their slice game. Would not return.", "author": "Sally C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "Came here to eat lunch with a friend and was not expecting much. The sausage and honey pizza is literally the best pizza I have ever had. If you are hungry, seriously, try this pizza. The staff was great as well.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "After waiting a little longer than expected I immediately decided to contact the restaurant. They were very nice to ensure me that the pizza would be delivered warm. Also, this was during Presidents' Day so was understandable.\n\nOnce it arrived it was by far one of the best pizzas I've had in San Francisco.\n\nDefinitely a hidden gem.", "author": "Glen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "The sausage honey pizza is one of the best pizzas I've ever had. Spicy, salty, sweet. I'm typically a pizza purest and stick to cheese. I'll maybe add garlic or pepperoni, but pizza is more about crust and sauce than toppings to me. However, this pie will make it hard to order anything else. \n\nOnly negative is that the guy working the register was not very friendly either time I've been here.", "author": "Jo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-30", "description": "The pizza is plastic-y, and the crust feels more like a long crouton. I went on a day I was craving some quick pizza, but I was disappointed in the quality of pizza.  As much as I'd love to support small businesses, I unfortunately won't be coming back here.", "author": "Emily N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Awesome pizza, great service, open late...what's not to like?\n\nWe ordered the Baiano Combo. It was delicious!", "author": "Kris Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-09", "description": "Wow.  The difference a day makes!  When I ordered the same pizza a month ago,  it had plenty of toppings and was cooked perfectly. Today my pizza came with only half the amount of toppings and was barely cooked.  Truly disappointed on National Pizza Day!", "author": "Jen Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-24", "description": "we usually order from here when we don't feel like going out and want a solid pizza. crust is chewy and thinner, which is perfect. i'm not looking for a thick doughy crust. they usually mail out coupons and stuff too (they've changed their policy and only accept coupons mon-thu now though, fyi).\n\ni like to get the three topping large with pepperoni, mushrooms and olives. pretty simple. the ingredients are good quality.\n\nonce we get the pizza delivered we always heat it up for more crispiness. honestly, that is what makes this delivery experience so much better. try it!", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "I truly recommend this place! I wish I could give thousand stars... the pizza is amazing! I had the egg pizza for brunch today \"carbonada\" ...  Delicious!!! Those guys are so innovated! Always a good surprise when I go there with my family. Great experience! Thank you Baiano!!!", "author": "Bella S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Sausage and Honey Pizza!!! Enough said.\nI could definitely say more about it but I'll keep it short. I totally crave this pizza and you will too.\nChewy crust, phenomenal flavors and fresh ingredients. You can tell it's a higher quality of ingredients than most pizzerias in this area. \nWe've always had a great experience here as well, staff is friendly, and pizza by the slice is the perfect quick lunch. \nWhile I can't speak to the delivery at this location, the other location is quick, so delicious, and we've never had any issues. \nMy final say is this, if you're not ordering the sausage and honey pizza, you're doing it wrong. The Coxinhas are also delicious. So do yourself a favor and order both. You won't be disappointed!", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "When we first walked in, it was totally deserted and looked very casual. However, the margarita pizza was amazing (great crust, great cheese, decent sauce), and the cheese ravioli was pretty good too.", "author": "Sam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Great legit pizza idea from Brazil, you guys should try it, very well treated at this spot! Love their food! Just had a Carbonada \"bomb\" should try the coxinhas! Hmmmm one of a kind Brazilian dish", "author": "Aline M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "My favorite pizza is Sausage and Honey. Have u ever try that if not I recommend and u will love it. Also Coxinha, it's a brazilian chicken croquettes come with spicy sauce. It's awesome. This place kidda small, but people are warm and nice. They're always busy at night, so I have to order ahead before my time need or before people to order so that I can get order by the time.", "author": "Soda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "Everyone taking about the Honey sausage pizza so I have to try it, and we really loved it We shared large salad with tasty vinegar dressing. Friendly service, cozy small place with nice music..\nI'll come back to here for next pizza craving", "author": "Ishikawa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "One of the best pizza in the area! We usually order online, it has been always fast delivery, hot, and fresh. They have a nice range of salads and pastas as well!", "author": "Ahmed A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-02", "description": "My friend and I got take out from here, and holy cow was there a lot of food. I got the Mac N Cheese and I ate about 1/4-1/3 or it and it didn't look like I made a dent. We got some Coxinha because it was different and I had never heard of it and some Jalapeno Poppers. The Poppers were standard, but still delicious. I was not a huge fan of the Coxinha, not because they made the wrong or anything, but it was just not my style. I can't believe I'm saying this, as an all-things-bread/dough-lover, but it was too much dough for me. Overall it was nothing special, but a pretty decent place for take out when we were too lazy to leave the apartment.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Pizza was fresh and really good.  Staff was very friendly.  I would definitely come back.", "author": "Derrell R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "Being from NY I am constantly looking for good pizza now that I live in SF. This pizzeria is one of the best places I have been outside of where I grew up. It is the most comparable to Brooklyn pizza & the staff is always accommodating & friendly. \n\nThe other food on the menu is good too. Pasta dishes, sides, and they have a Brazilian appetizer that I tried for the first time the other day that was very tasty. 5/5 for me.", "author": "Patrice M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Came here based on Yelp reviews and was still surprised. This is as good or maybe better than what I expected for sure.\n\nThe food was made on the spot. The salad tasted like I would have made it and just as healthy and tasty", "author": "Kate K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "I really enjoy Baiano's pizza, always I am eat in the 9th Ave. but this time I went in Heys Valley and when I saw Baiano Pizzeria I really want to try, tasty the same! My pizza came exactly what I want and I have to get to go also. Every one in there is so friendly and always they small and happy, that's why the pizza is so good! \nThank you Baiano to keeping so good and treat me the way I like !", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "I wasn't altogether thrilled with the classic Italian (Red)  pizza. It was good, but i don't think it was worth the price. I ordered thin crust... it  seemed more like regular crust. It was the price that really left a bad taste in my mouth. $30 for a 14\" 6 slice pizza... and i asked them to leave one item off. With a Caesar salad the bill came to almost $45 not including tip. For that i could've had a nice steak dinner.", "author": "Todd S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "We have ordered from Baiano Pizzeria on at least three occasions, and I decided to post tonight because the quality of the food is superb.   It always comes faster than expected and is always delicious and hot when it arrives. We will happily recommend this place for take-out but mostly for their courteous delivery service. The pizza is fresh, the crust is crunchy, yet has a nice chew to it.", "author": "Charlie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "I usually order a Margherita pizza from Baiano's.. is one of the few places in SF that doesn't mess up the most simple of all pizzas, they do it just perfectly. You can feel the  flavors of the fresh basil leaves, mozarella, fresh tomato sauce and olive oil without any flavor overpowering the others. \n\nTotally recommended.", "author": "Rodrigo M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-09", "description": "I would give this restaurant a negative star rating if I  could.  I ordered food for delivery, never received my food. When I called the restaurant they were apologetic for the delay and said the food was \"on its way and would be there any second.\" After an additional 30 minute wait I called back and another worker answered claiming my order was never in the system.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "I just moved to San Francisco, and I fund the best pizza place ever, they have the best Authentic Italian pizza I ever ate in my life, and if you like Brazilian coxinhas this is the right place for it.", "author": "Anna Carollina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Good prices for the quality food you get and if you do stop by I recommend their sausage and honey white pie its straight fire.", "author": "Trippy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "EXCUSE ME BUT HAVE YOU TRIED THEIR sausage & honey pizza. I ordered delivery from here twice and I swear I don't remember what I ordered the first time because that pizza overrides everything (I didn't pay attention to the delivery time or even how they delivered the pizza)... it may be the most balanced pizza I've had with toppings; spicy, sweet, savory + great textures. Remarkable food makes me forget about ambiance or service or basically anything but the food. I'm giving out this rating solely based off of my newfound pizza bliss.", "author": "Spriha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "This is probably one of the best pizza places I've been to In The City. I was out with friends on my birthday celebrating went to The Smuggler's Cove and decided to go grab a bite to eat by unanimous vote we decided on pizza and stumble into this fine establishment. I ordered an extra large half pepperoni half think it's called the Italian special whatever it was called it was absolutely on my top three pizzas ever to eat. We had three other pizzas as well and they were all excellent if you're looking for a great pizza experience go to Baianos it will not disappoint.", "author": "Omar R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "This is probably my favorite delivery pizza spot! We usually order the sausage honey pizza, but also love the paninis. They are consistent with quality, and don't take too long to arrive.\n\nLove this place!", "author": "Hannah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Really good pizza place in the hayes valley neighborhood. I've been there several times before and have always been satisfied. Also, staff is friendly and have even allowed me to buy pizza dough to make my own pizza. I interacted with Ian and he was very helpful in the process. I've been there several times and will continue to return for as long as i live in SF", "author": "Carl L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-02", "description": "Ordered the Hawaiian pizza. Super bland, no flavor. Disappointing. There is hardly tomato sauce, which was watery in flavor, the ham and cheese had meh flavor and the crust was more thin than traditional, which I ordered. $30 for no flavor pizza, no thanks. Sticking to Patxis!", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Ordered pineapple + chicken cheese 12\" pizza online. Came in 45 minutes. Pizza was fresh, warm and good tasting. The marinara is a little spicy and the dough is really nice and chewy. My wife and I loved it as a lazy Saturday afternoon lunch.\n\nWould order again.", "author": "Basim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "The pizza was amazing. The crust was cooked perfectly ! I would order there again and again. If my diet allows me to.", "author": "Jennie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Pizza was pretty good, little greasy. House salad was worth it. Quiet and fast. Good stop on a long car ride.", "author": "Grant H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-25", "description": "Ordered for delivery. The food arrived in estimated time and was good. Complaint is that for the price you really don't get that much food. We paid $60 for two medium pizzas and It just feels like a lot of money for pizza that is good but not great.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "If you are desiring a great time and pizza, that is the place! Good Menu and everyone is nice! Just make you feel good! Amazing!!!!", "author": "Silvio C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-12", "description": "margarita pizza was ok.  too saucy and not enough cheese.  also the cheese was not as melted as i like.  ithe mozzarella was a little clumpy.  i like when the cheese is melted and a little thinner than the sauce its spread upon. the bread is pretty good.", "author": "Cin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "Was really good pizza, the sausage was good especially. Only thing I'd complain about is that they put way too much cheese on their pizza. Their ranch cups are decent. They taste somewhat like sour crea almost.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-10", "description": "Even the water sucks here. Rancid limes? Terrible meatball sandwich. Old gross sliced up over cooked meatballs? Really? Cold sauce? Like, room temp? Really? The pizza people are eating looks ok but to put something this awful on a menu is unforgivable.", "author": "Sean F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-18", "description": "Absolutely lousy delivery experience.  Would NOT recommend for delivery.  Delivery made to the wrong address.  The manager was NOT helpful, rather defending the delivery person by saying the streets are \"close to one another\" so it happens.  Not a great experience.  Far better places in the city for delivery and customer service.", "author": "Stacy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-07", "description": "order online for extra meatball& cheese for meatball sub. got extra charges on everything which makes sense. But after 40 mins order online...got our food. not worthy of price.. not sure if they just forgot put extra.", "author": "Roxy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-28", "description": "Order never showed up even though app says it was out for delivery, and no one called.", "author": "Paul J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-16", "description": "This place used to be amazing, fresh and delicious until tonight. Ordered their Amazon Veggie which I have enjoyed many times in the past. When I opened the box, it was swimming in grease. Plus, the delivery person forgot my beverage. Won't be wasting my money on their greasy pizza again!", "author": "Debbie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-11", "description": "You would think with only one other party in the place at lunchtime one of the two employees would have at least greeted you in the first few minutes...but no, they're not running that kind of place.", "author": "shane o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-24", "description": "Average. I had such high hopes for this place. Expensive for a frozen style pizza. $25 for a large they charge you an extra $6 to split the same cost pizzas in half. Dining in sucked, no forks for salads. The chicken pesto was dry and the Italian meat had 3 pieces of sausage on it. This place is useless.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "The huge Italian panini and salad were delicious as was the garlic bread with whole cloves of roasted garlic. The Parmesan on the table was super fresh and moist. A sure sign of a great Italian joint.", "author": "Ken F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "My go-to for pizza delivery. Delicious pizza and love their brazilian coxinhas. Highly recommend this place!", "author": "Lucia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "My favorite place to eat in Hayes Valley! This cute spot always has a super-welcoming staff, amazing food, and a great atmosphere. The customer service is always very helpful and courteous. The food tastes delicious and is obviously made with the finest, freshest ingredients. Always such a pleasant time with friendly faces and great energy! Great music, excellent vibe! The perfect place to grab a quick, delicious bite or share some food and drinks with a friend or a date. The manager, Ian, is a super nice guy and is always around assuring each customer is happy. Baiano really is the best pizza!", "author": "Bradley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Great spot in Hayes Valley with unique pizza combinations.\nTry this location or the one in the Sunset!", "author": "Austin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-21", "description": "Super average pizza, had thin crust. I'm not sure what people think is 4-stars or above. Pizza was floppy, barely sauced and with little flavor. Calzone was just weird - a flat pizza-like thing. \n\nAnyway, nothing bad but nothing above average either. So hard to find good pizza in SF.", "author": "Fran M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "Excellent, fresh pizza--fast and courteous delivery.  The sausage/peppers and honey pizza was outstanding and the calzone was perfectly made.  When in SF and need a pizza delivered, this is the place to call.", "author": "Don S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "Excellent, fresh & quick! The only highly rated pizza parlor on yelp and I can see why! Thank you", "author": "Allison M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-20", "description": "We have been here quite a few times because of the sausage and honey pizza but I think this will be our last time.  Service has been awful every time.  Tonight was worse.  No acknowledgement when we came in.  No greeting.  They don't smile.  Pizza still good.  But have to stop trying. Service is too bad every time.", "author": "Cecilia T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "I was very disappointed in the delivery (which took an hour and 15 minutes instead of the 45 mins stated on the website) as well as the quality of the pizza (pretty basic with sparse toppings) without any Parmesan or chili peppers to go with the pizza. The service and quality don't seem to justify the expensive prices. There are plenty of better pizza places in the city to go to for the same price or less.", "author": "L J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "I found this place on the Eat24 app and I must say it was quite worth it. I ordered spaghetti and meatballs with garlic bread. It was very good. The actual meatball had some good flavor and seasoning to it. The spaghetti was well portioned in the sauce. So definitely will be ordering again!", "author": "Mohammad A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-17", "description": "Waited 1.5 hours and pizza never came. No phone call. Wish they could have let me know they couldn't make it for whatever reason.", "author": "Joe P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "$5 slice!! They are not the cheapest but slices are huge are good quality! I live 2 blocks away and i come here once or twice a week.The guys are nice and the struggle is real!!", "author": "Mariana C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-26", "description": "Ordered lasagna. Asked for extra sauce. It had meat sauce. They didn't give extra sauce they gave me cold marinara. Ordered garlic bread it was soggy and no way toasted. 30 dollars after tip. Terrible delivery experience.", "author": "Santiago C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-22", "description": "First, I would like to say the only thing saving my review from a one star was the pizza. Even though it was cold, it still had some flavor...\n\nI ordered a pizza earlier at around 8 or so, and was told that the pizza would take about 50 minutes to be delivered. Great, no problem, sounds like a standard pizza delivery time. What I didn't know was that the pizza wouldn't get to my apartment until well after 50 minutes (more like an hour and a half). While I was waiting I called the pizzeria wondering where my pizza was and they said the pizza left 10 minutes ago and was on the way to my apartment next.... After looking up the drive time on google maps, it says about 10 minutes between my apartment and the restaurant... suspicious.. Lo and behold, an hour and a half later, the pizza was delivered cold and the garlic bread was not much better. Also the tiramisu looked like it had been frozen, defrosted, jostled around in the box, and then frozen again. The date on the tiramisu box even said 2-18-18 (today is 2-22-2018) which means it probably was frozen and made on a different date. Pretty unacceptable if you ask me.  Upon sinking a fork into the tiramisu the middle was still frozen solid... which I'm not surprised.... after all, it said it was probably made or delivered to this restaurant 2-18-18....\n\nThe pizza itself was pretty standard imo.\nAt the end of the day, I would not recommend this pizzeria to anyone for delivery. Avoid their dessert because you never know if you'll get a frozen slice of tiramisu that's 4 days old.... Would not come back again.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Just moved to the area. GREAT and reasonably priced (for the area) pizza, especially their Classic Italian (or something like that; the one with prosciutto). Yum.", "author": "J C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-30", "description": "Stopped here for the first time on my way to SF Jazz, based on the four-star rating.\n\nCalzone was ok, staff was ok. The little side of marinara sauce included came straight out of the fridge which made it unusable.\n\nAt $26 for one person (1calzone and 1 beer), I won't be back. There's plenty of other places in the neighborhood.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "Ordered the sausage honey pizza off of yelp 24 and it was amazing! The honey drizzle on the crust was such a nice touch and added a great flavor in contrast to the sausage and peppers!", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "Unlike the other reviewers, I had a great experience. We came in at 7:00pm, starving, so we ordered pizza by the slice. The pizza crust was crispy. It had just the right amount of cheese and toppings. I ordered the chicken wings and asked for them to be fried instead of baked-- no problem! Good wings that were clearly brined for several hours so the meat was tender (though a tad salty). \n\nThe owner came by, said hi, introduced himself. Nice guy.\n\nIf you're looking for an affordable, quick, yummy bite, this is your place.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-09", "description": "I almost never bother to post negative reviews, but I was really disappointed in my last order. I ordered through GrubHub, and the pizza was estimated to take 50-60 min. At 90 min, I call the restaurant to check on the order and ask whether or not it was still going to be delivered, and the guy basically says they're  busy but will make sure mine is next. In the meantime, GrubHub has also called them. They call me to say that they pleaded with the manager and that he refused any sort of discount despite my order taking 2x the quoted delivery time. \n\nI get that things happen, that people get busy. I would have even let 90 min go and continued to order from them, but 2 hrs and $40 for a pizza that was warm-ish on arrival and limp and greasy, and you don't even offer a discount? In fact, you refuse it when the company you contract pleads with you to do so? A discount would have said \"We're sorry, that was a really long time to wait, but keep ordering from us, we want your business and it will got better next time.\" I would have continued to order from them. I'd ordered once before and it tasted great and was on time. \n\nWith a response like that, however, they've lost my business.", "author": "Mia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "Tasty tasty pizza slices. Nice staff. Limited seating, but we didn't have a hard time finding a place to sit down. And they serve wine! I was surprised, because it looked more like a carry out type of restaurant.", "author": "CJ F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-10", "description": "Food\nPizza is nothing special. I ordered Hawaiian. It was a bit too salty.\n\nService\nIt is not bad but also nothing special \n\nOverall, while it seems like I'm being harsh, in reality, this was a very straightforward pizza joint--not claiming to be anything it's not and therefore squarely meeting expectations. \n\nWould I come back here again? If I was on this street and really wanted pizza again, yes", "author": "Lina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "I order from this place through eat24 and once ordered 3 days straight same exact items bc could not forget how good the food was.", "author": "Hyun B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "They make the best pizza in town! I have visited this place every couple days! Yummmm", "author": "Phuoc N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-04", "description": "So my pizza arrived 1 hours and 36 minutes after i had placed my order. When I called to find about the pizza, I was told twice that it had left the store 15 minutes prior and even that my order had been lumped with other order as it was inconvenient for the driver to drive to south beach, only to have to return to the mission after the fact.  When I finally got fed up I called a third time and was told by the dishwasher that it has left but there was nothing he could do at this point as the restaurant was closed. To make matters worse the manager called me the next day and said he'd \"take my word\" as there was no way he confirm what I was stating other than calling the driver after he had called me.  He also threw some bs about the possibility of the driver getting pulled over by the police.  Regardless I received a cold pizza, shitty \"courtesy call\" and a $5 voucher.   I definitely didn't care for the $5 the manager obviously didn't care to value my business or my word.  I rarely comment on poor service but this was just insulting.  There are way better pizza places in the city...definitely won't be going back ever again.", "author": "Rosey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Big slices, great dough. Fantastic pizza all around. Not too thin or thick this is my go to spot for slices or full pies!", "author": "Zach W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-30", "description": "Horrible customer service. Ordered large pepperoni for delivery. Typical SF not so cheap price. By the time I received the pizza, all the cheese and toppings had slid off the pizza and collected  in the corner of the box. The \"manager\" that spoke to me spoke like a robot and was not nice. Just tried to explain why that would happen rather then actually doing something as if that's something you risk but still have to pay for when you order delivery. Never ordering from here again.", "author": "Joumana J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-11", "description": "V overpriced, $21 for a small 4 cheese calzone. Not sure what 4 cheeses they claim as there was barely any to begin with. Cashier also was on a break and no one else could work the cash register so I couldn't even pay until she came back.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Great margherita pizza, and the sauce and crust are especially nice. The crust is a great texture too; it doesn't tear up the roof of your mouth, which is great. Also tried the sausage honey pizza, which was great! Was worried it would be too sweet, but definitely just had a hint of the honey that brought out the flavors in the sausage. Delivery guy was also really cute and nice!", "author": "Emily I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-08", "description": "Ordered delivery. Wrote in huge letters on every single place you can put input \"BABY IS SLEEPING. DO NOT RING DOORBELL. KNOCK OR CALL\" and left number. Delivery guy showed up, rang doorbell, woke up baby and we got to eat cold pizza after dealing with screaming baby. \n\nPizza was okay.", "author": "Daniel E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Pizza is f'in delicious. Crisp, chewy, lightly buttery crust. Great flavorful sauce. Not heavy with too much shit. Pizza doesn't need hella shit, falling over with toppings and slipping off. I hate that shit.\n\nI do not hate THIS shit.\nThis shit is good.\nF'in good.", "author": "Jay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "I work in the neighborhood and this is THE spot to go to during lunch. My usual is a pepperoni and sausage slice. Sometimes I switch to a salad, but I love their pizza. Haven't been able to find a better pizza joint. Highly recommend it.", "author": "Ricardo J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "First time ordering here. Called in a delivery the guy on the phone was super on it and very quick and so sweet. Its nice when a pizza place doesn't have to ask u the same question over and over again. Called me back twenty minutes after I placed my order to inform me they were out of the cheese I wanted..Bummer but that's ok, it happens. Glad he informed me and was very sorry about it. Pizza came super quick and was fresh and hot! The pizza was good not totally awesome but I'm sure if I got the right cheese it would've been even better. I will forsure call again for another delivery in hopes my cheese is in stock. Haha \nGood customer service can take you far in this uptight, moody world nowadays.", "author": "Haley J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-22", "description": "We have ordered delivery from this place SEVERAL times.  Not once has the order been correct.  Special requests included \"plain\", \"no onions, no mushrooms\", \"no pickle\"....nothing too difficult.  Every time it was wrong.  One time a manager did bring the correct item back, but by that time the rest of the meal was cold.\n\nWe walked in not too long ago and ordered a philly cheesesteak.  When we got it home, it was 2 VERY thin, overcooked, dry slices of meat.\n\nWe tried to support them, but just not worth the money of the frustration.", "author": "Joseph W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Nice casual ambiance & clean shop. I came inside and the employees were all super nice. I just bought a soda and they let me wait there while it was raining. I definitely will be back for pizza :)", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-03", "description": "I was excited to see a new pizza place occupy this space as the previous establishment was lacking to say the least. Not to mention pretty good reviews to boot on the new operation. I went for a mushroom slice and it was quite solid, nothing mind blowing but one of the better no frills New York style slices I've had in the neighborhood. Price is a little high at $4.30 for a plain slice, but the size was decent. My other slight knock was that they charge $.50 for credit card on purchases less than $9. Since grabbing a slice to go is less than that, if you don't have cash on you it's really not a great deal. Still, I'm in the neighborhood pretty frequently and would come back.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "This is a must go if visiting San Fran!! Not only is the pizza amazing, but the atmosphere is so neat. You know the people who work there are hard working and put their heart and soul into the pizza. Extremely friendly and overall nice people. \n\nMy fiancé and I came across this place when exploring around the city. We are not from here and wanted to grab something quick. It was so good, we came back the next day! We were in Glen Park Area near Billy Goat Hill Park and started to get really hungry. Instead of going to the fancy pizza joint near the Bart station, we took the Bart 25 minutes away and walked 15 minutes just to go back again! \n\nThey sell by the slice and its always fresh! Sit down, grab a slice, listen to some music you grew up listening too, and soak it all in! \n\nWill totally recommend this spot to anyone and everyone!", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "This place is amazing!\nBaiano salad is my favorite, not forgetting to mention their Sausage and Honey Pizza.\nGreat stop for booze after work!\nFood is always delivered freshly and early!\nDefinitely recommended!!", "author": "Noureddine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "Baiano Pizzeria is so good, my girl brought me home a pie after a flight and it was delicious. Any pizza lover is guaranteed to find something they love here.\n\nI've walked in a few times and have tried the classic Margherita and the Baiano Special, they're solid choices. If you want something a little different try the BBQ Chicken, the California Veggie is pretty delicious too. Service and friendliness was top notch.\n\nIf you're craving pizza anywhere near the area (and seriously, even if you're not) stop by and indulge. It is so damn good!", "author": "Gustav A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-03", "description": "Extra greasy, soggy & over-priced calzone, with cold tomato sauce on the side.  We ate at the restaurant, and it was served this way.  If delivered, I can only imagine it being even worse.", "author": "John S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-03", "description": "If you want to be treated like garbage, go ahead and order food from this establishment. I placed an order and paid online. Received a confirmation stating that the order would be arriving in 45 minutes.  After waiting over an hour, I called to follow up. I was told there was a glitch in the system and that the order was never received. No problem, I could wait a little while longer to get my food, but then she asked me to place the order again and pay again. I explained I had already paid online and she raised her voice to tell me there was nothing she could do. I asked her to not raise her voice at me and it only got worse. She laughed and said I was giving her attitude. I asked to speak to the manager, apparently no one else was in. So, no food, I'm out $40 and was yelled by a woman with terrible manners. Still waiting for someone to call me about a refund.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "Food is tasty! Delivery guy was polite and food was warm. Pasta plates are good, and the coxinha here is bomb!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "I loved my Baiano pizza, and wild arugula salad, both were fresh and delicious, the pizza was perfectly cooked! I was delighted to find this affordable, friendly, and delicious spot in Hayes valley. It's hard to find spots I this neighborhood that aren't crazy expensive or too cool for school. We'll come back for sure!", "author": "Sequoia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "We had one of the best pizzas I've ever had! It was spicy from the sausage but had a sweet flavor from the mascarpone cheese. Perfect combination. The owner was very hospitable and the other workers there were friendly and served us quickly. Kudos to the owner who had to handle a difficult patron! He took care of the situation calmly and apologized to our family several times although it wasn't necessary. He diffused a potentially dangerous situation that could have turned out much worse. I highly recommend the restaurant for the food and the patronage!", "author": "Tanya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "The BEST pizza in the city! Loved sitting in this quaint pizzeria. John our new friend from Brazil made some great recommendations. Thank you!", "author": "Cheria Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-17", "description": "I'm APPALLED at this place. We ordered 2 pizzas through their website to be delivered and got a confirming email. After 90 minutes, I called Baiano to ask about the status and the girl who answered said they never got the order, even though we had a confirmation number AND were CHARGED for the order. She put us on hold for 10 minutes while she allegedly talked to her manager, and when she came back she said to click \"resend\" somewhere, but she didn't know where. At this point, I was starting to get annoyed and asked to speak to her manager. She told me not to raise my voice at her and her manager wasn't there, she had to call him. I asked his name and she said Ian, but I wouldn't be surprised if she was lying because I then asked to refund my money and she said he would void it. How can he void it if he's not there and they have no evidence of our order?! I was shocked at the ineptitude of this person and the appalling customer service. So now we have to dispute the credit card charge.", "author": "Danielle T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-18", "description": "I just had a Philly Cheesesteak sandwich from here, something I've gotten many times over the years as I live nearby. This was beyond disappointing. It was mostly a bread sandwich with cheese, and a tiny amount of meat that was more like sliced roast beef instead of ground meat, which is what makes a Philly Cheesesteak what it is. I guess the small dressed greens is supposed to justify the price. \n\nThis place used to be good. It no longer is.\n\nUpdate 2/21: In response to the reply from the management, I have no idea what you're talking about. This order was neither delivered nor made twice. And your reply references none of my complaints. Do you get some kind of Yelp-credit if you \"respond\" to criticism?", "author": "Tedd G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "Great Acai bowl, coxinha, pizzas!!!\nGood service and music.\nHighly recommended.\nWill be back for sure", "author": "Leonardo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-20", "description": "Loved the inside, felt warm and welcome by our server. The Margherita pizza was simple but satisfying. Would definitely go again", "author": "Nelo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Best pizza place in Hayes valley, if not the whole city!! \nOrdered large half 4 cheese and the other half classic Italian. Yummy yummy!!\nIt's been a while since I have had a good pizza , such explosion of flavor in my mouth!! \nDefinitely recommend it.", "author": "Ian N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-03", "description": "I don't tend to give a lot of 1 star reviews, so I had to have a really horrible experience at Baianos to give it that kind of review. We made a reservation for this place for 8 people on a Friday evening. We arrived on time and the table was reserved for us (the one good thing that happened that night).\n\nOnce we were all seated, we ordered two bottles of wine and asked for glasses of water for everyone. They brought us our wine and glasses but didn't bring out the water. We asked again and they told us they didn't have enough glasses in the restaurant to serve us water.... We asked if they had extra wine glasses or to go cups to give us the water in but they said nope. They explained that the only option we had was to buy water bottles from them. I mean I think it's customer service 101 to serve your restaurant guests water if they ask for it. We were so frustrated that we asked to talk to the manager and he explained to us once again that they didn't have any water glasses left that they could serve us water in (like we couldn't hear it the first time around?!). Anyways, we asked if they could give us the water bottles complimentary and after much deliberation, they decided to give us THREE water bottles. Once again, we were 8 people and they gave us THREE water bottles with no glasses! I'm not sure how they expected us to drink the water, but we gave up at this point and just waited for our pizza.\n\nNow the pizza is a different story altogether. We ordered 3 large pizzas as soon as we decided because we were starving. About 15 minutes after giving our order, our server came around to us and told us they didn't have ingredients for one of the pizzas we had ordered. Did they only figure that out 15 minutes after we gave our order?! Anyways, we let that go and quickly ordered another pizza. When our pizzas finally came, one of them had chicken on it, even though we had clearly ordered all vegetarian pizzas. We told our server that this wasn't the pizza we ordered and he called over his manager who then proceeded to tell us that this was in fact the pizza we ordered. Another customer service 101, \"the customer is always right\". We were appalled that the manager told us that we didn't know what we ordered and that the pizza they brought out was the right pizza. Well, we ended up telling the manager that most of us were vegetarian so we couldn't eat the pizza and this was actually not the pizza we ordered so they finally took the pizza away and brought out the correct one. No sorry, no apologies, nothing!\n\nWow, what a horrible experience, I hate thinking about it or reliving it. It would've been nice if they took off the incorrect pizza from the bill or anything like that, but that was obviously something we could not expect after the kind of service we had seen. I will not be coming back here unfortunately; I don't know maybe this place is good for takeout or something?", "author": "Malika R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "This place was great. Went in with my boyfriend just expecting something decent to eat, but was pleasantly surprised at how tasty the food was. So happy we stumbled upon it. The place was cute and clean (extra points for having Mean Girls playing on the TV). The pizza was excellent, and the mac and cheese with bacon was some of the best I've ever tasted. Definitely going back.", "author": "Isabel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "I had a great experience with this place. Sausage and Honey pizza was super good! Staff was nice and delivery time was in about 30 minutes.", "author": "Pedro L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Delicious! The best pizza we have had in San Francisco in a long time. We also love that with each pizza they donate to various needs/foundations. Can't wait to order from them again!", "author": "Chelsea P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "Seldom do I write a review; however, feeling the need to prop these guys up a little bit from the pitchforks lower down the page. First off and most importantly, the pizza is really good here--had a supreme pizza equivalent about a week ago and I'd be hard pressed to find fresher/higher quality ingredients for a \"by the slice\" pizza.  The vibe of the place is nice, can get busy in the evenings.  I would highly recommend.", "author": "Sam E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-21", "description": "The pizza is overpriced for its quality. This is the quality of pizza you'd get for $2 a slice in New York. \n\nOur first experience with this place was also pretty poor- we got a coupon in our mail for a 3-topping large pizza, so we thought we'd try it out. When we placed the order we mentioned the coupon first. We ordered a pizza with 2 toppings, and a different third topping on each half. Without telling us, the woman on the phone charged us for 4 toppings and also charged us for the full price of the 3 topping pizza. When the delivery guy came we called and inquired about the price and she just said \"sorry that's 4 toppings\". \n\nMediocre pizza, bad communication. Next time we'll stick with Patxi's or Little Star.", "author": "Isha D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-25", "description": "Went in for a slice of pizza and I got a slice that looked like it was a few hours old. They threw it in the oven to heat it back up, fair enough. When I got the pizza the bread was all hard, there was no cheese, barely any sauce I could taste, and a few slices of pepperoni. One of the worst pizzas I've ever had. I couldn't even eat the crust it was so hard. Spend your money elsewhere.\n\nOn top of that I paid $5, totally not worth it. They also charge 50 cents to use debit/credit card if your order isn't over 9 dollars.", "author": "Fernando F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-05", "description": "Delivery. For the price this was very uninspiring pizza. Did not enjoy the crust.", "author": "Will D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-07", "description": "Some of the slowest service I have ever experienced. Consistently takes 25-30 min to prepare a sandwich. I wish I could like this place better but they are understaffed and have poor service.", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Been to Baiano Pizzaria a few times and ordered on GH another a few. Only have good things to say, slices are large, fresh ingredients, delicious flavors, Sausage and Honey is my favorite! Never had any issues with delivery; great for kids or a large group of friends. Definitely recommend if you are looking for the traditional Italian pizza!", "author": "CLR A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-04", "description": "Italian panini sandwich is almost $10.00.  By caloric volume the bread is well over 50% of the product.  Within you get maybe 1.5 oz sopresseta and perhaps an oz of mozzarella.  Absolutely a craptastic sammy.", "author": "paul a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "The Sausage and Honey pizza is delicious!!! Big thumbs up also for their classic veggie, garlic bread and wings. Relaxed atmosphere, good music, really friendly staff. The owner popped by our table and introduced himself and was great with my kids...this very rarely happens in restaurants in SF! Will definitely go back :)", "author": "Deirdre R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-05", "description": "This place has the slowest service and this time you cannot blame it on a third party vendor.  We walked in and ordered.  We even changed an order because it would take too long.  We told them we were in a rush.  \n\nWe ordered a slice of mushroom pizza.The cashier pointed to the slices sitting in the warmer and said they will put mushrooms on the cheese pizza.  After 20minutes and after we complained we were STILL waiting for our food, the SAME cashier who took our order said they ran out of cheese pizza.  We saw them making our food after we complained and what would have taken 5-10 minutes, took much longer because they simply forgot about our order.  They gave away our cheese pizza to the people behind us.  \n\nRather than owning up to their mistake of forgetting our order, they mumbled some excuse about how it takes awhile to make the food, albeit they did apologize several times.  No discounts were given not any other gestures.", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "After winning the City's AAA softball championship 12 of our team members decided to celebrate with pizza. I had seen the Baiano's on my way to work and suggested it. We called to find out that they have gluten free options. I showed up first, asked if they had room for 12, no problem. They started moving the tables around, while asking me if the setup was OK. Finally, everybody showed up. We requested separate billing for each 'group', not a problem. Pizza was really good, wine was good and affordable. Staff was helpful and didn't once show anything but great customer service with our rather noisy group :) One of the pizzas took a bit longer to be ready, but we were happy from the victory so even that didn't bother us. Very pleasant experience. I'll go again.", "author": "Salla V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "The pizza was delish with a perfect crisp and light thin crust, fresh bright tasting toppings. A very generous salad, lightly dressed. Very Good  would absolutely do this again.", "author": "Valarie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Classic Italian was great! Delivery was fast; I recommend and i'll definitely order with you guys again.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "Stumbled on this place tonight and soo happy we gave it a try! Ordered both the pesto pizza & fettucine alfredo. Both were wonderful and the service was even better. Will definitely stop again next time we're in town!", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "I don't ever write reviews. This is my first. But the sausage and honey pizza - best thing I've ever put in my mouth. The combination of flavors is pure genius.", "author": "Allison B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-05", "description": "Not a stop for foodies but one of those places that you're glad exists when you need a slice and a beer and don't want to spend more than $10. Clean and friendly, decent pizza, great neighborhood.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "Finally my favorite pizza spot in the Inner Sunset got a new location! This is just what Hayes Valley needs among the too-fancy overpriced pre-Opera restaurants. Sometimes after work I just want a slice and some nice people, and Baiano is the best bet in the neighborhood for both!", "author": "Taylor W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-15", "description": "This was a delivery order. While our medium size pepperoni and mushroom pizza was OK, the Fettuccine Ala Vodka was disappointing for $14.95. The plastic \"to-go\" container it came in was full of water. This caused the noodles, bacon, and vegetables to be soft and waterlogged. While they separated the sauce from the noodles as part of delivery, the quantity of sauce was insufficient. Hoping we just experienced a one-off situation. At this point we probably wouldn't place a delivery order with them again.", "author": "Matthew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Happy to give 5 stars after a fun evening enjoying tasty pizza (delicious crust!) and hanging out with a big group that Baiano Pizzeria was willing to accommodate. Not to be overlooked as a quick food option on a block with few (if any) quick food options, and the food tastes good to boot. Grab a slice!", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "Love this place. Originally started as a favorite in the Inner Sunset and love having one when I'm walking around Hayes. I've picked up slices and ordered in. Delicious pizza, fun environment, great people. Try the sausage and honey. So different and so good.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Wow!  What a great tasting pizza and the service is pretty awesome as well.  I most certainly recommend trying the Sausage and Honey pizza.", "author": "Jimmy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Sausage and honey pizza, the best!! I was walking by and I found this spot. The new pizza place in Hayes Valley!!", "author": "Jackie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "Amazing slice. Best I've had since I moved here three months ago and probably the best slice in years. I lucked out. The pepperoni seemed to be right out of the over. The cheese was super gooey, the sauce delicious and the crust was thin. I can't wait to go back.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "This place is incredible! One of my favorite pizza places in the city. Very cool atmosphere and unique pizza options. Plus, ingredients are super fresh", "author": "meghan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Pizza is solid, and it comes out quick! Glad to have this spot open around Hayes Valley. Super affordable, and everyone who was working was really polite and helpful while I tried to decide what I wanted. The only gripes I had were wishing there was a place to refill your own drink, and that there was more space! Can handle a couple parties of 10, but after that there are gonna be people standing outside. Keep up the good work!", "author": "Nate E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "We ordered tomato, basil and fresh mozzarella pizza. Just me tell you, delicious!! Their pizza is always a great experience. We only order from them. I like their sauce and the cheese is amazing!", "author": "Marco M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-09", "description": "We ordered 2 pizzas, one of which was vegetarian. 2 hours later we called to see where the order was and they said they were about to send it out, except with two sausage pizzas. When I told them one person is a vegetarian, they offered a 20% discount. Ridiculous. 2 hours late, don't have the order right, and don't even know how to make it right. No one in tonight's group will be ordering from here again.", "author": "Raymond S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-03", "description": "The pizza was rather tasty, but it was 'on the warmer side' (kind of) and very soggy which is weird since I live 0.3 miles away. Good, but not worth the 40 dollars spent on it.", "author": "Ricardo X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "This place is fantastic! My boyfriend and I were looking for a quick and casual, but still nice, place to eat in the area. The staff is super friendly and accommodating and this pizza was easily one of the best I've ever had. We ordered the sausage and honey pizza with mozzarella and it was incredible. The perfect blend of sweet and spicy. Needless to say, we will definitely be coming back and I've already referred some friends!", "author": "Emma C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "This place was amazing! We were visiting SF from LA and on our way to an ice cream place when we stumbled upon this spot. Corner spot with pizza, pasta, and Calzones. We requested a special item (not on the menu), a Philly Cheesesteak style calzone, and we were not dissapponted! Next time we're in SF we will be coming back.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "Margherita pizza was bomb!!! Owner was really nice. Service was great and super fast. Highly recommend.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Super delicious pizza, the pesto pie and the sausage and honey pizza are my favorites! The service is fast and friendly. My favorite pizza place in Hayes valley!", "author": "Alexis T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Tasty slice of mushroom pizza warmed to order. New York size slices. I had a slice for lunch during a conference and went back for another slice afterward for dinner! Good prices, quick service. Will return if I'm in the area!", "author": "Erin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-30", "description": "for nearly $30 this is one of the most lousy pies ive ever had. \n\npizza was soggy and not good to put it nicely. ordered the \"well done\" option. not well done by any means! \n\nzucchini slices were pre-boiled and tasted like cold pickles. tomato slices were thick and  not cooked at all. both did not help the already soggy dough. \n\nexcellent for a fast delivery. and appreciate the large basil portions. but overall a displeasure and a waste of money and food!", "author": "e p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-21", "description": "They delivered the wrong thing. I ordered a calzone and a pizza arrived. Not only was the delivery guy super rude but so was the guy who answered the phone when I called to explain the wrong item was delivered. He said his name was \"John\". Would never order from here again... Since there are so many pizza places in close proximity it baffles me that they would treat customers so disrespectfully.", "author": "K L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Baiano Pizzeria was very accommodating for a big group we were going to bring in late on a weeknight. Very good pizza (in SF! Who knew?), including a gluten free crust option! A few good dessert options and an appealing Acai Bowl. Plus... the calzones. Man... insane calzones.", "author": "Jamie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-10", "description": "Try to day Baiano pizzeria , bad experience . They don,t no how to make a pizza , taste less , never go back . Plus expensive .", "author": "Zulfiqar H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "Really nice pizza. The honey sausage pizza is a game changer. Never thought I'd enjoy sweet pizza. Oh and it's spicy too. Pretty interesting combination. Speaking of which, I'd say they should continue coming up with new pizza toppings. I think they have a good opportunity in Hayes to be creative. People would dig that in SF. You focus on the food, people will travels hills and valleys to get to you. Once you got the food down, maybe they can come up with a theme for the place. It's a bit blend atm.", "author": "Ali A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "My favorite place for delivery.  Fast, great customer service and DELICIOUS!!! (& I'm from New York so you know it's good pizza.)  Glad to have it in my neighborhood!", "author": "Bridget C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-12", "description": "I've only had there spicy sausage and honey pizza but it was very good. $24 for a 12\". A little pricy. I assume they use quality ingredients.", "author": "Brendan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Two words: Sausage Honey. Great pizza, attentive staff and a authentic pizzerria vibe will always have me coming back for more.", "author": "Drew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Delightful food. We've ordered several meals: pizzas, salads, and a calzone. I can taste more deliciousness with what seem to be very high quality ingredients than from other pizza joints. It's local and for the quality, the price is right.", "author": "N R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Delivery was earlier than expected. We got a medium pepperoni and italian sausage pizza and wings. Great crust and delicious! Wings were crunchy and moist, and full of flavor. We will definitely order from here again!", "author": "Marisa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Great neighborhood pizzeria,  high quality pizza, excellent ingredients, dough & crust.  Clean place, lots of glass because it's on a classic SF corner location.  Owner keeps place real nice.  Have a fresh slice or whole pizza.  I eat here 2 or 3 days a week.  Highly recommend.", "author": "Andy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-04", "description": "Right after placing my order through GH I received a call directly from baiano pizza requesting me to call GH directly to pay for the ranch dressing sides I had requested in the notes section in my order. There was not a button for sides so I told baiano that I would be more than happy to pay for them if they had a way to add it onto my order. He told me that GH would be contacting me about adding it and I let him know that was fine. I then waited hour and a half ( 15 minutes after estimated delivery time) then called to check on my order, and they let me know they never made my order! The customer service told me \"they can cancel my order and to not be upset because it's just pizza\". I had guests in town expecting dinner and it was so frustrating and embarrassing to be expecting an order at a certain time and to be told that their solution to the issue would simply be to cancel and refund and I could order somewhere else. Working in customer service myself for many years I simply told him that is not an viable solution. They offered me a coupon code for future orders and said they will rush my order as quickly as possible. I received my order approx, 30 minutes later, soggy pizza, clearly rushed and was just not good. Just wanted to share my feedback, disappointed in a company that I will NEVER order from again all because of wanting to charge for 3 sides or ranch dressing, which in the end was included in my bill.", "author": "Jessica B."}
