{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "I was not a fan of this bake tart, but I think that's really just my personal preference. It tastes kind of strange to me - not really a cheesecake and not really a tart. I think it would have been better if I took it home and froze it before eating. \n\nI also feel like they are incredible inefficient here (hence the -1 star). They have one long line to order and ring you up. They should really just make space for a second or third register since it takes way too long to get some bake tarts.", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-25", "description": "My brother and his girlfriend took a trip downtown for some much needed Pokémon hunting and came home with half a dozen of these instagram worthy baked cheese tarts. Damn, what a sentence.\n\nMy brother had no idea what he had in his hand. His explanation, \"I saw a line waiting and thought, \"let's go for it.\"\" Well, I'm glad he did because these little babies have been popping up all over my Instagram feed for a while now and I rarely ever venture downtown so... \n\nHe opted for 2 of the regular, 2 matcha, and 2 matcha with honey. My family and I split them into equal pieces so everyone was able to try all 3 flavors. \n\nRegular - super simple, not too sweet. \nMatcha - VERY strong matcha flavor. If you're a lover of matcha then you're a lover of this.\nMatcha Honey - This is their limited time one and I have to say, I'm not as impressed as I thought I would be. I love matcha and I love honey, but I felt like the flavors fell flat a bit for this hype.\n\nOverall, it wasn't me who waited in the line so I can't be too bad. Flavors are pretty good, but for the price of one... I'll stick to regular egg tarts.", "author": "Venus L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-23", "description": "This place often has a crazy long line!  So, one afternoon, we decided to give it a try.  \n\nI feel like they're like a... soft-cheesecake like feeling in a tart shell.  The filling itself is ok -- a little on the plain side.  They have toppings on the side (coco powder, cinnamon powder) that you can add.  I liked it better once I'd topped it with some coco powder.\n\nFor my sweet dessert fix / calories, I'd go with Beard Papa.  Personal pref.", "author": "Kathryn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "Sweet little indulgence in the form of mini cheese tarts.  Creamy and well-balanced in sweetness, the pastries come fresh off the oven at the basement level of Westfield Mall.  The tarts come in two flavors, original cheese and matcha (for those addicted to green tea's bittersweetness).  Aside from eating them warm or at room temperature, they recommend popping them in the freezer for that ice cream like texture.  Line varies in length depending the time of day.  \n\nThe custard like texture had me addicted like squirrels on nuts.  Just kept on going till they were gone.  Damn it... Now I'll have to go back and grab another box...  Save yourself the trouble and buy a dozen!", "author": "Ken L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-11", "description": "The Cheese Tarts here are okay as a nice little treat but they are nothing that special. I definitely wouldn't wait in line to get them. For something that small, it is pretty pricey. The original ones are $3.50 and the limited ones for the day are $3.65 plus tax.\n\nOn my most recent visit, I was walking around the mall and there was no wait so me and my friend decided to get some Cheese Tarts. We got the Original, Matcha, and Matcha with Gold Leaf. I was told that the Matcha with Gold Leaf had honey in it, making it a little sweeter than the regular Matcha. Out of the three, the Original was still my favorite. \n\nI've been here multiple times and have yet to be blown away. The tarts are tasty, but I wouldn't venture out of my way to get them. However, I do think they make for a nice gift. I believe if you order like six or more of them, they give you a nice box to hold them in.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-01", "description": "I missed a great Monday Night Football game to see the hype of the newest bakery and hottest business in the Westfield Shopping Centre. I heard this bakery have a long line.  But when an NFL game is on, every viewer's eyes on the TV. Therefore most businesses are not too busy and the best time to visit.\n\nThe bakery is located in the basement and in the food court area. The bakery specializes in Japanese tarts with the gooey filling. San Francisco is the first American city with the unique bakery. With the success of the first location, more cities are on the way. \n\nMy first visit I had the popular Cheese Tart. For $3.50 + tax, I get a palm-size tart with the gooey cheesecake filling. The treat is cute and tiny that fits the palm of my hand. But taste-wise, I did not find the tiny treat all that stunning. I am not a big fan of small treats for a big price. When I spend big, I expect \"Big\". \n\nI was better off with a Cream Puff from Beard Papa or stayed home and watched the football game. \n\nAssumingly more of the Japanese bakery will expand to other cities. Don't expect me to visit those future locations soon.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-05", "description": "I guess this simply wasn't what I was expecting. \n\nIt's an interesting concept, but I think the execution leaves a lot of be desired. I did only get a lukewarm tart, so maybe these are better when they're fresh out of the oven. But really I wish that the shell was a little more crispy, like others have described it it's texture is more of a crumbly shortbread cookie, and a little softer than a traditional tart shell. There wasn't much flavor to the shell, it was mostly just sugar and butter. The filling was a little more interesting, almost like a custard + cream cheese mousse. I enjoyed the light fluffy texture, but I think it could have been a little more creamy. Again the favor simply wasn't there. There was only a very light cheese flavor that didn't work as well with the already fatty butter texture and flavor. \n\nOverall, I'll probably not come back to this store, they were SMALL for the price (at 3.5 that's the same price as the massive egg tarts at Golden Gate Bakery). And there really wasn't anything special about these, maybe they're better in Japan.", "author": "Sophie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-03", "description": "Whenever I'm shopping at Westfield, I definitely try to get a Bake Cheese Tart. I've had the one in Hong Kong and they taste exactly the same - not too sure about the price though, but I do find these quite pricy ($3.50 per tart - original flavor). \n\nThe cheese tarts taste the best when you eat them immediately after purchasing! The crust has the perfect amount crisp - it's like a shortbread cookie, but not as sweet. The filling very soft and somewhat liquidy once you reach the middle - kind of like a melted cheesecake lol - sounds kind of gross but tastes amazing! I've had some of their other special flavors as well, such as the strawberry one, but I always find myself preferring the original!\n\nThis place does run out of the flavored ones pretty quickly, so I'd recommend getting their early if you're trying to get one of the special flavors! \n\nAlthough I do love these cheese tarts, I definitely wouldn't wait more than 10 minutes for these, especially for the flavored ones.", "author": "Stacey Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "I cannot get enough of these omg. They are so so delicious, and not one person I've introduced them to has not ended up loving them too!\n\nI've tried the original and the matcha, but I'm still a bigger fan of the original because I don't like the slightly bitter taste of matcha as much. I love the crust when it's fresh, but the cheesecake consistency of the cheese is just too good after you refrigerate it so that's what I usually end up doing.\n\nIt is a little pricey at $3.50 (+ tax) per cheese tart, but tbh it's not that much different from other pastries in downtown SF (sadly) so I feel like it's worth it as a treat since it's so good!", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Located in the bottom floor of Westfield is this small little bakery that makes adorable Japanese cheese tarts. I ordered both the Original and Matcha Japanese cheese tarts - they were both delicious! Both had a smooth and creamy texture. The Original had a very clean milky flavour to it while the flavour of the matcha one was very strong. \n\nTip: order both - they're very opposite in the flavours which actually makes them very enjoyable together!", "author": "Allan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-21", "description": "The tarts are OK (they're essentially mini cheesecakes with more crust), but for the price and the wait, I personally don't think they're worth it.\n\nI went a few months back, and there were maybe 10-15 people in line ahead of me. It didn't seem so bad at first since they had plenty of tarts already baked and ready for purchase. However, their process for serving customers is *SO* slow.\n\nWhen you get to the front of the line, they'll ask you how many you want, and once you do, they'll either get a bag out or start assembling a box. If you're ordering multiple, they'll carefully load your tarts in, and once that's done, they'll ask for your approval of the tarts they chose before packing it all up and sealing the box with a sticker.\n\nHopefully they've improved and sped up the process since then.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-16", "description": "I came here one day on a Friday morning, which was nice because there were no lines. I was so excited to try this place out because I had something similar in Japan. I was hoping this place would be comparable but sadly nothing can compare to Japan. The tarts come in two different flavors: green tea and regular cheese. You can also order them warm or cold, except I felt there wasn't much of a difference between the two. I expected the warm to be fresh and...well warm, but it was more like room temperature. I saw the sign where cold can make it taste like \"ice cream\" but I rather eat it warm.\n\nFor the green tea flavor, I could barely taste the green tea. The reg cheese tart is the way to go if I had to choose between the two. The best part is probably the crust. Also, these aren't cheap. Overall, I wasn't super impressed and would honestly eat cheese/egg tarts from 85 degree bakery. At least those are always good and at a cheaper price.", "author": "Ester S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "If you are craving a smaller treat and you enjoy cheesecake this is your place! It's basically a mini cheese cake with a very good crunchy crust.\n\nI really enjoyed it and like how you can enjoy it many ways: at room temp, in the fridge and in the freezer. Amazingly enough the crust is able to stay really nice and crunchy even if it's been in the fridge.\n\nI've tried the regular flavor and the matcha flavor. My favorite is still the regular. The matcha flavor had a very strong matcha making the tart more bitter than sweet. Still good but regular was better in my opinion. \n\nThey do have seasonal flavors so I'm looking to try those out when they're out! \n\nAlso tip to avoid a longer wait time is to go during the day!\n\nTLDR; delicious mini cheesecake! Would recommend trying regular!", "author": "Lulu T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-09", "description": "Bake Cheese Tart is located in the bottom food court of Westfield and right by the Bart entrance. We got there around 2pm on a Saturday and there was a line but it moved pretty fast. I love the display of the cheese tarts and the boxes in the back which spelled out Matcha. \n\nWe got 3 of the original and 3 of the matcha which came out to be around $22. As much as we wanted to eat one right there, we were full from lunch and decided to wait. However, when we got home and opened the box, all the cheese was ruined and fell over to the side. I don't believe we moved the box around that much?? Anyways, they were both very tasty! The matcha one was a little bitter compared to the original one. The original one tasted like a cheesecake. \n\nOverall, they tasted good but a little expensive to come back and keep buying.", "author": "Kristie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "So glad I finally got to try it!!\n\nI was lucky to not encounter a long line on Saturday of Labor Day weekend and only had to wait in line for at most 10 min. The staff was friendly and they had one person take your order first while the cashier processed the order. I first shared a regular cheese tart and a matcha cheese tart on the spot, and then I bought an additional 4 regulars home since they later ran out of matcha. \n\nThe cheese tarts can be a bit soft, gooey, and liquidy, freshly baked. I liked both the regular and matcha! The ones I brought home, I ate straight from the box after they had been chilled in the refrigerator. I like both kinds, chilled and liquidy. The cheese is more solidified and chewier if you refrigerate them. I've heard other people recommend chilling the tarts as well. \n\nThese tarts are definitely not cheap - $3.50 for one, and $3.65 for a matcha one. It just goes to show just how ridiculous rent is in SF that they have to up the price for food :( \n\nI asked the cashier how long their matcha is for and it would run until early October, so y'all still have some time!!", "author": "Valerie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "I'm crying because wow. How did we get so lucky as to have these heavenly cheese tarts brought to Westfield mall! I will literally BART to SF Powell Station just to pick some of these up.\n\nWe visited for the first time on Thursday evening just before closing and they still tasted fresh! One piece is $3.50, but if you want a box of 6 - it's like $20. Seems expensive, only because I'd love to be able to purchase a box of 10 for $20, but I'm sure they are fairly priced. I wouldn't be able to make these at home the same way, that's for sure. \n\nI'm also a cheese fan, so this review may not be for the lactose intolerant! There were contrasts of sweetness and savory for taste, and consistency of the cheese filling vs. the crust. I was very impressed and honestly can't wait to come back!", "author": "Melanie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-12", "description": "I originally saw a video of this place on Facebook and had to make a pit stop to see what the hype is all about. It's located inside the Westfield Centre. The line may look long but it moves pretty quickly. They had the original, matcha, and matcha honey flavors when I went. I ordered a dozen combination of all three flavors. They were similar to cheesecake but lighter and fluffier. Of the three flavors I preferred the original. If you want a more cheesecake texture, place the tart in the fridge. If you want a more ice box cake texture, place the tart in the freezer. The cheese tarts are good as is and best if eaten the same day.", "author": "Lanha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-21", "description": "My mom's first reaction in seeing this:\n\nGolden Gate custard tarts?  (In Chinese)\n\nAfter my eyes slightly widened, I mouthed \"cheese cake\"! (Again in Chinese)\n\nAfter a few minutes and ensuing bites, \"aaaaahhhh\".\n\nThis happened recently, approximately four months after I shared a gift box with my parents in April.  At that time, there was no reaction.\n\nThe difference?  I bought this after having a business lunch.  The line was six deep, relatively short compared to my friend's stories about his visits.  Located in the back of the basement Westfield Mall food court, this stand is low key.  When I ordered, I noticed the patrons ahead of us mostly walked off with three boxes (six per box), the order limit.\n\nAfter walking a few steps, since we skipped dessert, we both open a box and pulled a fresh one out to try.  The flavor of the day was not available (nor was there a sign for it) so I tried the original (https://www.yelp.com/user_local_photos?select=G1aZtgX6PAJRUAswiKc24w&userid=saJuyv784apZzH--psHZ3Q); it was delicious and addicting.  This was a sharp contrast from the one I tried in April which was a day or two later.  I highly recommend reheating the take home ones at low heat to enjoy the flavors and textures.  My friend bought me a chocolate (https://www.yelp.com/user_local_photos?select=LcKorJymXZZvzp76ID6Y9g&userid=saJuyv784apZzH--psHZ3Q) in April too and that wasn't memorable either.  \n\nIf you are a cheesecake fan, you will enjoy this but make sure to have it fresh to optimize your enjoyment.  No wonder my mom said Golden Gate!", "author": "Mike C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Do you like egg tarts? Try the bake cheese tart!\n\nOrdered: \n- 6 in a box for $20.08 (tax not included)\n\nTina's Travels and Tabloid \n- Oh my goodness, melts in your mouth. I would drive to the city just to get these. But also, I would drive anywhere for food.\n- These are a bit pricey, but good for it! \n- Let me tell you, 6 wouldn't have made it to the car if I wasn't on a lightweight diet. Just saying!", "author": "Tina N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-11", "description": "Mmm cheese tarts! Glad I finally got to try this place out. My BF & I had tickets to Candytopia so we decided to stop by before we went. Its located next to Ghiradelli at the food court. There was no line at all when we went as well, so it's best to come on a weekday if you want to check it out. \n\nWe went for 6 of the Matcha and original cheese tart. It was 6 for $22 which is very pricey IMHO. I really liked the plain cheesetart way more than the matcha. I think the Matcha was too overpowering.. the plain cheesetart tho is delicious.. light, buttery, and just the right amount of salty. \n\nWhy am I giving 3 stars? Well, because they're good but overpriced and they're not something I would drive all the way to DT SF for. :)", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-26", "description": "TLDR: pretty good cheese tarts but on the pricey side and kinda sad, off putting service \n\nCheese tart: I tried both the original and the matcha one and they are both super yummy. I personally like the original one more as it has the perfect balance of sweet, salty, and crunchiness. The matcha is also really good but it's a bit on the bitter side and not my cup of tea.\n\nPrice: def on the pricy side and the matcha ones are slightly more expensive than the original. Paid $23.27 for 3 original & 3 matcha \n\nService: the workers there seem kinda sad and honestly done with everything LOL it made it feel a bit unwelcoming after waiting in line for a while", "author": "Dorothy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-27", "description": "Beautiful and delicious cheese tart.\n\nI really love these tart but one problem I had is the fact that the crust is so hard, otherwise it would have been perfect. \n\nThe moment you take a bite out of it, the crust sucks but the cheese melts in your mouth. Fills your mouth with either original cheese or matcha filling. I really like the matcha one but my friends like the original. Regardless they are delicious but expensive :(\n\n$3.5-3.65 for 1 cheese tart.... I can get 3-4 egg tarts almost as good if not better in Chinatown. I would say this place is a one time thing if you on poverty life.", "author": "Christopher G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-06", "description": "The first time I saw many food bloggers hyping this place up on Instagram, I thought \"is it really that good?\" But I still went and tried them anyways.\n\nFirst time around, I went when it was fairly new, and they only had the classic baked cheese tarts. I got half a dozen. My oh My, I loved them! it's like biting into a pie, but inside it was filled with fluffy sweet cheese goodness. Best believe I ate all 6. They stand at $3.50 each for original flavor, $3.75 for matcha. Definitely on the pricier side. and I thought I was being ripped off at 85 degrees for their $2.50 Hokkaido cheese tarts. yeesh. \n\nI went back for a second time to try out the matcha cheese tarts, and unfortunately, these weren't that great. The taste of matcha just overpowers the whole tart. it tastes like you bit into a fluff of strong, bitter, matcha. It wasn't sweet at all. I wouldn't recommend this one. So would I come back again? ehh yeah if there wasn't a line. Would I ever wait 30 minutes for them and take a dent to my wallet? Absolutely not.", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Believe me when I say that Bake Cheese Tarts are NOTHING like the cheese tarts that you've tried. If you're like me and you were wondering what the hype was all about and why people were waiting line for 20 minutes for cheese tarts (??) then trust me when I say that these cheese tarts are well worth the hype and then some.\n\nBake Cheese Tart originates from Japan and it has finally crossed the Pacific Ocean to land right in the Westfield mall food court of SF's Union Square, and I could not be happier. \n\nThe crust of the tart is so buttery and rich but not too hard and not too soft, and the cheese filling is a whipped texture that is not too sweet. Each bite into this cheese tart is a flavor explosion that is sure to leave you feeling like you've just the best thing you've ever tried.\n\nI also tried the strawberry cheese tart which I like even more than the original because the strawberry adds just an extra bit of sweetness and a bit of tartness to the cheese tart that is also so impactful.\n\nFor a limited time, Bake Cheese Tart has released matcha cheese tarts which I've been dying to get my hands on and am planning to make a trip very soon. Bake Cheese Tart is an absolute must for me whenever I'm in Union Square - my trip up there is not complete without it!", "author": "Pooja M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-17", "description": "I saw this shop a couple years ago on a trip in Shanghai and remember the long line outside this shop. Fast forward to today in Westfield, SF - we finally get to try these delicious tarts in the bay! \n\nDon't get confused between a cheese tart and a dan tat. They look the same, but completely different. The hype is real. Thankfully, I didn't have to wait in a ridiculously long line when I came.\n\nImagine a molten lava cheesecake. Sounds like heaven right? Becuase it is. Their tart is soft and has a buttery crunch (not flakey like a dan tats). The inside is fluffy, smooth and has the right amount of sweetness (with the help of the cheese cutting into the sweetness). \n\nThey usually have 2 flavors: the original and another rotation flavor. I've seen chocolate and strawberry. They are offering their matcha flavor soon and I cannot wait! I hope they keep it as a permanent flavor because matcha is everything! \n\nThe only down fall? Their price. It's almost $4 for a tart. You can buy 2-3 dan tats with that.", "author": "Samantha F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "Oh my goodness. It is pure goodness in a small little tart.\nI know it's hyped up but gotdamnit, it is good.\nFirst of all, if you go during long lines then you'll get hangry and it might affect the way the cheese tart taste because of the anger.\nSecond of all, I love cheese so of course I'm biased.\nThird, this s*** is pretty expensive. It's 3-3.5$...trying to rob me but I like it so much that they can take my money. Just give me moreeee.\n\nIf you are from around the area then you can definitely avoid the long lines by going during opening hours, or mid day like around 2-3:30pm. I haven't gone the weekend yet and I don't even wanna know. If I have to wait in a long line then I'll pass.", "author": "Ngoc P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-10", "description": "Whooo what a treat!\n\nI usually don't like to visit places that are known to have shops in Japan because people buy into the \"omg it's from Japan and it's so good\" hype but I caved after seeing all the social media's posts made about this tart! And wow is it good! :) \n\nOn a random weekday afternoon, I decided to pay them a visit. There wasn't much of line because the strawberry flavored tarts sold out (they do restock which took about 10-15 minutes from my experience). NOTE: they will only sell you things on display so you can't preorder the flavors and wait. With that being said, the moment they did restock, a long line formed. \n\nI purchased 12 cheese tarts (6 originals/6 strawberries). They run about $3.50 each (~ $20 for a box of 6). \n\nIf you had to choose between their seasonal flavor or the original, I'd choose the seasonal one since they're only available for a limited time and they're usually really good. I shared my order with coworkers, friends, and family and they all burned through the seasonal ones really fast! \n\nThe flavor and texture of the tart was solid. It wasn't overpoweringly sweet and did not taste artificial. The tart was thick and the crust had a good consistent texture and complimented the tart really well. \n\nBonus: These tarts taste good cold! A lot of my friends told me to freeze them. I gave it a try and wow it sort of taste like ice cream! \n\nOverall, great treat to treat yourself or others during special occasions. Everyone I know gives this place a stamp of approval! Will be back next month for Matcha cheese tarts!", "author": "Ida H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-11", "description": "Nestled in the food court in Westfield mall, Bake Cheese Tart offers something I haven't seen in the states yet: baked cheese tarts and matcha tarts. \n\nCheese tarts are similar to Chinese egg tarts, just with more of a cheese rather than custard taste to them. One of the problems with traveling is that you taste foods at their pinnacle, and unfortunately the cheese tarts I've tasted elsewhere were leagues above these. These weren't bad by any means, just nothing spectacular. The crust is crisp and it's creamy, but just missing some cheesy flare and buttery goodness. The price is definitely on the expensive side @ ~$3.50 for one or ~$20 for 6. \n\nSomething to note is they have a little condiment section far off to the left of the register (I completely missed it when I went). \n\nIt's a novel dessert and you may want to try it if you're wanting to try something new but I don't think I will be back.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-24", "description": "Totally not worth the wait and the money. \nThe cheese tarts taste too sweet and too salty altogether, the texture is too runny.\nDefinitely not coming back!", "author": "Irene X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "So I've seen the videos and heard all the hype and finally got down there on a Saturday afternoon to try these. It's in the bottom level food court of Westfield mall by Cako and Sur La Table and the Powell bart entrance. I waited in line for about 10 minutes, but I didn't mind because I've heard of longer waits on a weekend (I guess the hype died down a bit).  \n\nSo for $3.50/ tart....It was good and I would eat it again, but I wouldn't make it a habit at that price per tart. It seems like it would be a good thing to bring to a party but at around $20 for 6, definitely not worth it for me. My crust was super hard (a little overcooked), so I wasn't a fan of that, but the insides were gooey, delicious, not too cheesy, not overly sweet or salty. Basically, a perfect balance. They weren't selling any speciality flavors such as matcha when I went, but I would be interested in trying another flavor!", "author": "April L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-05", "description": "Okay so maybe if I had to wait in line for these tarts like some other reviewers, they wouldn't be that good. NO THAT'S A LIE THEY'RE SO GOOD!!! Honestly, they're creamy and rich but not too heavy and the crust is flaky and I love the optional additions of cinnamon, chocolate, and caramel. Seriously, these are good and the different levels of the box makes me feel like my tarts live in an apartment building! Can't wait to try the matcha tarts!", "author": "Marissa F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "New flavor.   Matcha and matcha with black honey ( 3.65).  I love their cookie crust.  No lines on sunday since everyone was busy with blue angels.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "I first discovered these tarts cause of a friend of a friend, they look pretty simple and plain but they're amazing little perfect bites, with perfect oomph of sweet/savoury/I don't know why they're so addictive. Not overly cheesy or sickenly sweet, they're perfect alone or with a mild tea.\n\nThen they started popping up on IG, and I found out they released a MATCHA version. Yaaaass. It has slightly less dairy oomph than the original but still really good. Could do with a bit more matcha flavor, maybe a matcha powder dusting?\n\nWent late afternoon on weekend and there wasn't a long line, it moved incredibly quickly. It was kinda pricey, six little tartlets goes for about $20. \n\nFor some reason some of their tarts get overly bruleed/brown, and I've noticed they try to pick those when you're not looking...lol I don't mind too much but thought that was...strange.", "author": "Ethel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "I thought Bake might have been just another fad that had been hyped up by people on the internet. However they lived up to the hype with both their original cheese tart and matcha cheese tart. \n\nBoth have really great flavors but I know that the matcha isn't for every one. It seems like more people prefer the original flavor because the matcha flavor is very strong.\n\nThe store inside a mall and is at the basement level. Very easy access with the BART. There is plenty of seats for you to sit, relax, and eat. \n\nKeep in mind that you are only allowed to purchase 6 at a time. The original is $3.50 each and the matcha $3.65 each.", "author": "Yvonne H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "I've been excited to try BAKE CHEESE TART ever since we got a flyer about it hanging on our apartment door months ago for their grand opening. \n\nThe idea of having to wait in a long ass line deferred me until recently. It only took us 10 minutes to get our tarts on a Saturday afternoon! \n\n$3.50 each, so they are pricey. I thought the tarts were just OK at room temperature (when you purchase them). Once I took them home, that's where all the real magic happens. Chill it in the fridge for something similar to a cheesecake, or bake it in the oven to enjoy the warm crust and melty cheese. I'm a fan of both the original and seasonal strawberry. \n\nSweet (but not too sweet), savory, warm, cold, etc. - it's a universal dessert for everyone!", "author": "Laverne N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "I've heard great things about these tarts and didn't want to wait in a long line when it first opened. However I went recently and I still had it wait in line. The line moved pretty slowly considering the limited selection of tarts on the menu. I tried the original and the matcha. Although the matcha flavor was very strong, I preferred the original. It tasted very similar to a cheesecake.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "I tried the green tea tart and think the cheese tart is the way to go if anyone is deciding between the two.", "author": "Andrea T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-16", "description": "Well you gotta love cheese cake or a nice sugar/shortbread like cookie.....filling is a light/fluffy cream cheese base (options of strawberry and chocolate) in a sweet, cookie tart shell. \n\nTook a quick BART ride from the East Bay to SF ($8 round trip) with some co-workers and fortunately, no line! YAY....just the presentation and openness of the kiosk in the food court definitely makes you want to get a bunch....even their packaging is really colorful and eye-catching...but sadly that's about it for me. \n\nDid it WOW me or any of my co-workers? not really and probably enjoyed the tart shell more (not a good thing) than the filling...was it good? Sure! Am I craving more...meh!\n\nGlad we tried and may try again down the road....not rushing since its about $3.50 for a small tart. Also, I prefer another Japanese dessert ('light, creamy, flaky and delicious') at the other kiosk close by! :) Now that is some major sweet noms!", "author": "Cheryl M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "I drove all the way to the city from Walnut Creek just to pick up a dozen of these! So worth the drive!!\nFluffy cheese cake and crunchy crust on the outer edges, but a little softer in the middle. Sweetness was just the right amount. I don't think I can eat regular cheese cake now. Friday at noon, there were only 3 people in line.", "author": "Angela A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "This is mostly based on the sheer amount of happiness I felt when the first bite melted into my mouth and slid happily into my tummy. \n\nHonestly, I only first noticed this place earlier in the week when I stopped at Westfield to grab a quick bite before the Ed Sheeran concert!!!!! It was hard not to notice the long ass line that wrapped around the corner. {Tuesday evening, around 5:30pm}\n\nFast forward a couple of days. Met my sister for lunch at 11:30AM on a Thursday. There were only four people in line and she was in it. \n\nThe staff was quick and friendly. We tried both the regular cheese tart and the matcha. Holy goodness. I closed my eyes and enjoyed it. It was creamy and sweet, and the crust was just right.", "author": "Lani S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "I did it! You know I had to do it, y 'all! I was peepin' them for a while now. Morning times on the weekdays- forget it! Afternoons (lunchtime), heck NO! But the evenings, like from (6PM-Close), Yup! The lines are shorter, the staff is calm and chill but unfortunately, my cheese tart was not warm-blah! That sure didn't stop me from eating one....\n\nFrom the raving review's, I couldn't help but want to try one. Though honestly, I was waiting for the hype to go down. BAKE is well known in Hong Kong and Singapore! They offer various different flavors depending on the season: Honey Lemon, Chocolate, Original Cheese, and many more!  \n\nSo, how was my first experience trying a Cheese Tart? Well, it was DELICIOUS! The first bite is heaven I tell ya! Buttery and firm but cracks upon sinking your teeth into it!! The filling melts in your mouth, like a fondant, and the crust is crisp and firm, slightly crumbly and best eaten when consumed right on the spot or warmed up slightly in the oven! (Warning: Do Not Microwave). The inside of the cheese tart had been creamy, luscious and surprisingly not too overwhelming like I assumed. I could have easily eaten two of the cheese tarts in one seating. \nThis place is worth a try, but not something to go out of your way to get! Also, the hefty price of $3.50, Whoo! This place would break my pockets if I became addicted! \n\n**I hear there will be more flavors coming soon! I remember seeing a similar place in Hong Kong and Singapore and they had Chocolate Tarts! I wouldn't be surprised if they begin making a Chocolate Tart! HAHA! We'll just have to see it to believe it!**\n \nEnjoy!", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "What's the hype about? This place was always popping when it first opened with lines that wrapped so long that you would have thought they were giving away free tarts. \n\nIt was filling up Instagram feeds and there was quite a buzz. During lunch I saw that the line wasn't too bad so I had to try it. Yes, it is expensive at $3.50. Yes, if you take it home it's not as good. Yes, you should eat it hot. However, I really enjoyed it. The crust was flakey and had a nice subtle sweetness to it. The cheese tart itself was melt in your mouth delicious and really not like anything else I have tried. \n\nWould I go back? Yes! Easy. Now I'm not a baller by any means, but honestly most desserts cost me $3-5/piece easy. So for a cool $3.50 I get a really tasty treat flown in Japan. Hey I just saved myself a plane ticket!", "author": "Melissa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "With a buttery crust and a deliciously light a fluffy cheese mousse, these little tarts exist to please!\n\nBake Cheese Tart has always had a long line whenever I would pass by so when my friends and I noticed that the line wasn't absurdly long last Friday night, we just had to try some of these cheese tarts! Their box size is meant to fit a half dozen, so I just had to buy six so that it looks all pretty and fancy schmany in its little paper six-room dollhouse. Besides the cheese tarts, they also sell Brazillian coffee here which initially seemed out of place, but in retrospect, coffee would have complemented these tarts just perfectly.\n\nSo I brought my half-dozen of cheese tarts on a BART ride home and didn't get to try them until ~2hrs later so they weren't necessarily hot and fresh by that time. I was also going into this experience expecting a level of disappointment due to some previous experiences of overhyped Japanese franchises appearing in the states. As a result, I was quite surprised when I took my first bite into the tart because it's pretty good. Given that they're quite small, I don't know if it was $3.50 good, but it was pretty good. I particularly enjoyed the crust which heavily reminded me of a butter cookie place in Japan's Tokyo Station that lots of people I know loved.\n\nIf I'm ever in the Westfield area and am craving for a light snack with a cup of coffee, I would definitely stop by Bake Cheese Tart if the queue is not long. More commonly, I can find myself coming by to buy a half-dozen box as a gift for others since the packaging and presentation is absolutely wonderful!", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "I'm obsesssssssed with these tarts! I'm a fan of the Japanese style cheesecakes so I knew I would love this one. I kinda  found it by accident when looking for something to eat. It was near the end of the day when my husband and I noticed the long line and wondered what it was. After we finished eating, we came back and they were sold out!\n\nSo of course, I checked online to see what all the fuss was about and went back the next day! And I'm sooooo glad we did! I love them! I had them fresh from the oven with a hot cup of coffee =) the tarts are perfectly cooked! Perfectly golden brown, soft and crispy crust with a creamy and fluffy filling! YUM!! \n\nThey're insanely expensive but I probably won't be in SF for a while (or anyone in Asia) so it was worth a buy for me. I even brought some home to Toronto and everyone loved it too!", "author": "Bernadette B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-25", "description": "I tried the original flavor only. They were out of matcha for the day.\n\nThe tart shell was the best part of the pastry. They don't just use a generic puff pastry - they create a thin shell that's perfectly crispy and sweet. However, it's downhill from there. The custard smelled like milk that was going bad (it was not curdled or anything), tasted like a milky cream cheese, and was foamy/super runny in texture. Bizarre. Usually the tarts I've had at other restaurants/bakeries have a little more structure in the custard, since it's baked. I did eat it right on the spot, so this was not due to melting/shaking a box around.", "author": "Nelya T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "I love cheese and bread. Cheese and bread doesnt love me. Coming from a lactose intolerant, gluten sensitive gal, these Bake cheese tarts are the makers and designers of a ooey gooey dream come true. Yes, it's worth the wait. The original freshly baked cheese tart (hailing from japan) is delicious and will melt away any stress you have for the day on the first bite. \n\nPerfectly gooey, perfect combo of tartness mixed with the savory aftertaste of cheese, these are heaven. I have to mention that if you're anticipating something that is reminicesnt of an eggtart, these aren't it. It is somewhat similar to a portugese egg tart (with the nice glazed burnt top) but instead of egg this is a whole lotta cheese.\n\nI got to try both the original and the matcha--personally, I found the original more to my liking. The Bf enjoyed the matcha as he is not a fan of the tart/sour/sweet combo.\n\nI do have  to mention that the line can get quite long and the prices per tart is not cheap. I believe it's currently $3.50 for an original tart and $3.75 for a special flavor---6 for 20. So if you're planning to splurg, you might as well go all out for these babies.", "author": "Diane T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-16", "description": "I tried a lot of these cheese tarts (of different brands) when I went to Asia.  I had a matcha red bean kind, a blueberry cheese kind, even a durian kind!  Tonight I'm trying a honey matcha kind.  As much as it's good, it's just way overpriced at $4 a piece.  Try once if you're curious, but after that use your money to get actual desserts.", "author": "Kev H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "YUM! The line seemed a little long but I asked the first person how long they waited and they said 10 mins. \n\nFirst time having this and I had no expectations. The signage on this place is terrible too as there really is none, just look for the line of people. \n\nRight now they have the matcha flavor tarts. Those were good if you like matcha but the originals were delicious. I guess I was expecting a chinese egg tart but it's more like a mini fluffy cheese cake. I love that you get so much more crust on this because that's my favorite part of a cheese cake. \n\nI totally recommend this if you're in the area. They are so good! \n\nAlso, remember they sell out too, so don't try to roll up here 30 mins before closing hoping to beat the line but finding out there is no line because they are sold out. #truestory", "author": "Lindsay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "The first time we tried Bake Cheese Tart was in Kyoto during our honeymoon.  I was pleasantly surprised to find that the ones at Westfield were just as I had remembered.\n\nWe just so happened to be passing the Westfield on a Sunday morning around 11am and I wanted to check out Bake to see if there was a long line.  There were only a few people in line, and I was so excited to see that they had matcha cheese tarts!  We ordered a couple of the plain ones and 4 matcha.  \n\nWe loved the strong flavor of the matcha cheese tarts, but as some other reviewers mentioned, you can definitely taste the bitterness of the matcha.  \n\nThe consistency of the tarts is super smooth and creamy, with a soft/nearly liquid center. The tart shells have a similar flavor to shortbread cookies, and are crisp and sweet.  Even after storing our leftovers in our fridge for a couple of days, the tart shell did not get soggy.  Will definitely be returning!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-28", "description": "I was so excited to finally hear that a Japanese cheese tart chain was opening in the Bay! And of course, I had to jump on the bandwagon to see what this hype was about! \n\nAfter a long day of shopping, my friend and I stopped by Bake Cheese Tart on a Saturday afternoon and the line was wrapped around the corner of the store. Even though the line seemed long, it went by pretty fast and we waited for about 15 minutes. While we were in line, we looked through the large glass windows and watched the workers bake endless trays of cheese tarts in the oven. At this point, we were both drooling and couldn't wait for these cheese tarts to get in our belly. \n\nI was watching a video about Bake Vheese Tart and found out that the cheese tarts are made in Japan then shipped all around the world. At the stores, they are baked a second time. They offer a chocolate tart (which is often sold out) and strawberry, which is coming soon! There are self-serve toppings customers can add on the tart, including caramel drizzle and more. \n\nMy friend and I each ordered the original cheese tarts. In my opinion, the cheese tart was average, and it wasn't anything too special compared to the authentic Japanese tarts I have tried in Japan in the past. The cheese filling was sweet and had a fluffy, light texture. The tart itself was buttery, similar to a shortbread cookie. The taste and texture were not bad, but the price is a bit steep for $3.50/per tart.    \n\nIf a cheesecake and an egg tart had a baby, it'd be this cheese tart! A good thing is that it's conveniently located in the basement of Westfield in the food court, and right by the bart entrance/exit. If you've never had Japanese cheese tarts before, it's definitely worth a try!", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "What a Yelp failure... this is the same place in Tokyo Station!\n\nJust amazing, authentic Japanese cheese tarts. Perfectly fluffy, nice texture to the crust, not too sweet, perfectly delicious.\n\nAll these people complaining about the price or the line... PSH! Have you even been to Japan before?\n\nThis is what's amazing about SF. Delicious, genuine food from around the world. \n\nOne of the best dessert spots in the city! Period! So absurdly disappointed in Yelp's 3.5.", "author": "Aakash G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-23", "description": "One bite into the \"hot and new\" trend of cheese tart, I thought I masticate a piece of frozen dough.\n\nComing to SF, I, as an amateur, heard for the first time in my life, \"cheese tart\". These cheese tarts appeared by rumor as touching-hot and when biting into it, provide a stream of melted cheese into your tongue, almost burning it to the third degree. Well, I like that idea of burning food.\n\nAs I sashayed euphorically into the little shop which hung the store's name a bit too far from where the shop is, I got 6 cheese tarts. My first impression was why on Earth are they making tons of cheese tarts when only serving three customers (including me). My gut told me this ain't good. From what I witnessed, the employees had more cheese tart freshly baked from the oven coming out. I thought to myself, maybe they will serve me the hot and not those rocky cold ice chilling behind the glass. In fact, I counted as many as 8 employees chilling there, no wonder they baked multiple more. \n\nI came into my audacity and asked them to give us hot ones and they said they sold these cold like this.  The cheese tarts taste like rubber. I, wholeheartedly with so much human faith, ignored the previous ratings and wanted to try since it was \"hot and new\". I apologize but this shop is tawdry and should be titled \"cold and new\".", "author": "Trinny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-05", "description": "Must try in SF! The lines aren't too bad. They had both the original and matcha tarts available. They're $3+ each which is kinda pricey in my opinion. Be careful when biting into the tart because the cheese will ooze all over. It's sooo good warm and isn't too cheesy. It has a hint of salt. I also took one home to refrigerate which still tasted good (more like a cheesecake) but the tart crust became hard.", "author": "Jennifer Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-25", "description": "Every time I walk by there's a line. I've seen it many times on IG posts. Today, there was a small line at 7pm so I gave it a try.\n\nI was underwhelmed. It's not entirely their fault that their product has been hyped up. I've read many reviews and it seems to be a mixed experience.\n\nThe filling is like sugar + cream cheese. If you've ever made cream cheese frosting, this is exactly the taste and texture of the baked cheese tart filling...maybe the texture is a little more fluffy but pretty much tastes the same.\n\nThe tart itself was a crispy hard cookie...and while their were toppings available I found it did not \"help\" the tart taste better or worse.\n\nWe also ordered a coffee which the hubs gives a . That's why I give it a 3 and not a 2.\n\nDon't think I'll go back to get another. Simply because it wasn't that memorable. The service however was...‍ they probably have some things to work out.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "I have seen the phenom in the mall twice already. I have also seen the tarts on Instagram. We tried the other time but it was sold out. So this time we came early on a Sunday morning - a brisk walk from SoMa to here was a goo enough of a reason to justify why we needed these tarts. Still it's a 20 minute wait.\n\nLong line again. $45 for a dozen including tax. Very expensive if you ask me. I chatted with the cashier. She told me that they are from Hokkaido, I was there a few years ago, and had similar but not the same tarts. This store was established only in 2014. Not too sweet but definitely falls into the dessert category. It's very cheesy, when warm, the cheese melts in your mouth. There are a few ways to eat them. Including freeze them in the fridge. We also topped it with cinnamon, chocolate and caramel sauce. \n\nIt's already in Asia - namely Taiwan, Singapore, Indonesia, Vietnam and Hong Kong and also Shanghai. Turns out it's in my office building in Shanghai. No wonder it looked familiar. I have passed it perhaps a months ago when I was in our Shanghai office. Doh! Missed that one. But it's not Malaysia, which is a bummer as I'm likely headed to Malaysia for work in a month. Though I'll also be in Singapore and Shanghai soon so that could serve as a back up plan should I not plan for another 20 minute wait here in SF.\n\nNow unlike Beard Papa which started its US journey in New York and took years to come to SF, this is the very first USA outpost. So if you want the real thing and not headed to Asia soon, this is your best bet!\n\nI think the reason it costs more here than in Asia it's because it's been flown out here from Japan. I like that it's not made here because you know at some point someone will mess up the recipe, and make it too sweet for Americans. I'm glad that they kept the recipe intact here. \n\nKids like them because it's something different. If you ask me, I still like Beard Papa more. They offer cream puffs with eclaire surface, and you get the fresh cream fillings and it cost also $3.50 each. We will see if the hype will die down. But for now, the kids were happy that they have now a dozen to fill their cheesy cravings with.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-09", "description": "These cheese tarts are imported from Japan, brushed with egg wash, then baked a second time.\n\n1. I was able to skip the line on grand opening day to try these, which I'm so appreciative of because that line can still be a little ridiculous.\n2. Very comparable to cheesecake, but the texture is a lot softer and flufflier. The flavor of the filling has the perfect balance of sweet and tart. My favorite thing about these tarts is that they're good hot or cold. I placed my leftover tarts in the fridge and the next day, they were still yummy. The filling was just as fluffy, but a bit more dense.\n3. The shell of any tart is my favorite. I like that these cheese tart shells aren't flakey. They have a chew and are slightly buttery and eggy.\n4. Would I wait in line for these? No.\n5. Are they worth $3.50 a piece? No. They are waaaay too small.\n6. Would I buy a cheese tart ever again? Yes.\n7. Yes, because I want to try their chocolate cheese tart.", "author": "Tammy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "The short: delicious cheesecake tart worth it if line is short\n\nThe first time I stopped by was around the grand opening and the line was too crazy. On the second time, they had sold out. On the third time, I finally got to try one! Third time's a charm?! \n\nThe line process is fast. Say how many you would like. There are other flavors available too, depending on availability. \n\nAs I bit in, I loved the crunch on the outside with the light fluffiness of goodness on the inside. The tart was at a good level of sweetness for me.\n\nTip: Even though the mall closes at 8:30, head there before 8 to get the last ones before they sell out and close shop when they run out. (Haven't been there earlier in the day so I don't know what the line is like.)\n\nVerdict: get there before they run out! Ready to go back for round two!", "author": "Catherine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "My friend bought some cheese tarts for me and my family for my birthday! We ended up bringing them to the Giants game so my first cheese tart experience was good (not amazing) because they were a bit cold. I liked the cheese tart, but I don't think I would crave it regularly. However, the next day, I had one that was heated with a toaster oven and I fell in love! \n\nThe cheese tarts are the perfect hybrid between a cheesecake and an egg tart. The inside is perfectly fluffy, light, and airy, and the \"crust\" is more like a cookie. I want to eat them all the time!! I wish I could have tried the chocolate, but I heard they're coming out with strawberry soon! The only bad thing is that they are a bit expensive. Recently I went on a Friday around 12:30 pm and waited only 10 mins in line, so the line isn't too bad anymore!", "author": "Tara A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-03", "description": "We went about 2 months ago.\nSo we heard about these tarts. My gf is a big fanatic about japanese food so she wanted to try it. \nFirst off the line was not too long but once we went in line it started to grow. They do move slowly because I think people buy a tons of these.\nWe tried the original and green tea. My gf isnt a fan of the green tea. But we loved the original. Nice creamy and tasty. The crust really makes these tarts. Overal we did like the original. If we are in the area sure but it isnt something we would go out our way to get.", "author": "R. L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "I found this place because I saw that there was a line for some sort of food, and like a good SF citizen, I went ahead and joined the queue without really knowing what it was for. \n\nI ordered a couple of the regular cheese tarts since they were all out of the other flavors. I had one warm and then another a couple days later, cold from the refrigerator. I confess that while I loved the flavor, I didn't really like the super soft texture of the filling--I think I wanted it to be more like Japanese cheesecake, which is fluffy but a little less wet? I know you're thinking \"but aren't things always better when they're WET and moist?\" In this case, though, the filling seemed goopy- like a cross between egg custard and cheesecake. Clearly lots of people love this texture, but it just wasn't for me.", "author": "Jean L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "Deeeelicious fluff of cheese tarts!!\n\nSaw this establishment on a random Facebook video and have been wanting to try this place out for a long time! I was here on a Saturday afternoon and had to wait in line for about 10 minutes; not too bad. Price is a bit steep at $3.50 each. Ended up buying a box for $20 (save a buck). These tarts are definitely something new to Cali. Checked out their IG page and it looks like some locations carry other flavors like chocolate & strawberry. Only the cheese tart option was available at the time of my visit. \n\nWould highly recommend if you're in the area!", "author": "Mei W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "Be still my heart! The FIRST location of Bake in the USA is open!!!\n\nI first tried Bake in Singapore and fell instantly in LOVE w these decadent little cheese tarts! I especially love them when they are warm and just outta the oven. They literally melt in your mouth at first bite. \n\nI cant wait til they expand and come to southern CA so I don't have to come up to SF to get 'em!", "author": "Alma P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Bake Cheese Tart has the fluffiest cheese tart I've ever tasted! This cheese tart was not what I expected. My friends and I thought it was going to be similar to an egg tart but not at all. There is a very crispy exterior shell that is a result of being double baked. As I bit into this tiny morsel, warm, foamy, airy, light cream cheese mousse oozed into my mouth. It was a pleasant surprise, very tasty, and satisfying! If you haven't had it, it's totally worth trying! It was really quick to get. \n\nLuckily there was a short line when we visited because I have passed by when there was a long line that stretched around the corner to the doors that are next to the place. Unfortunately they had sold out of the strawberry flavor! :( They were making more but it would be another 20 minute wait. For $3.50 each, it's a good treat! We got the 6 piece box (which is a dollar off) and an extra single one because we had 7 in our group. We all really liked it, and I would totally come back to try the strawberry flavor!", "author": "Katrine U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "The cheese tart crust - crunchy and sweet like a crispy cookie at room temperature. \n\nOriginal cheese tart- cheesy and creamy. Fluffy at room temperature. When heated for 10 seconds, it becomes a runny, white liquid collapsed onto the softened crust. This is my favorite of the two flavors.\n\nStrawberry cheese tart- mm, creamy strawberry goodness that reminded me of strawberry yogurt. \n\nThese are a little too sweet imo but if you like baked goods, these are worth trying. \n\nA weekday morning is a good time to avoid the lines.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Limited edition Matcha cheese tart is delicious! \n\nIt's a little bitter than the original cheese tart but it leaves pleasant green tea aftertaste in your mouth.", "author": "Es L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "I was downtown for an appointment and was craving dessert. Saw that this place was at the Westfield and knew I had to try it!\n\nIt was Noon and the line was already around the corner almost to the BART entrance! I was in line for about 40 mins. They only had 3 people getting the tarts ready, 1 person packing the tarts, and only 1 cashier. \n\nSince I waited so long I decided to get 2 boxes of 6, which came out to $45.57! I don't think they allow you to get more than that. Anyway, pretty pricey, but I'm not downtown often so it was worth it to me. \n\nThe cheese tart was so smooth and fluffy! The perfect cheesecake texture, but light. The crust was baked perfectly too! I know they're not freshly made on the spot because someone said they're shipped over. But, nonetheless, they were great!\n\nI would definitely come back and wouldn't mind the wait again!", "author": "Fallon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Yes, there is hype for this dessert spot. But I'm a believer and will always be down to grab a box from here when I'm in the Westfield shopping center!\n\nIf you're a fan of light, semi-sweet Japanese desserts then go try out a cheese tart! I've only tasted the ORIGINAL tarts and they're pretty tasty -- like a combo of cheesecake, pudding, and egg tarts. I like to grab a box and stash them in the fridge. For a little more indulgent dessert texture, try freezing them! The custard/cream gets thicker and more cheesecake-like. \n\nI've always visited during late weekday afternoons/early evenings as I typically go after work. I never had to wait more than 10 minutes in line. The staff works pretty fast at boxing up your treats. Unfortunately my late visits mean that I missed out on the seasonal flavors -- I still need to try the matcha! \n\nI love grabbing a box for snacking at home, or bringing one for a party/housewarming!", "author": "Bonnie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Where there's a line, get in it!! I did walk by and said no thanks but ended up walking by later and the line was shorter. I had just finished dinner and needed dessert. Even though I was stuff I had to get my hands on one of the tarts. Oh boy, it was fantastic. It certainly caught me off guard. It was delicious and having one is not right. You'll need more than that. Though it might break the bank to buy multiple but how often do you get these cheese tarts?!! Well I will be back again to get more and even if I'm not in the area I will make it a point to come even just for this tart. Just expect to pay the price of the food because it's in a mall and in San Francisco.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "Finally, SF is slowly catching up with the rest of the world - but at a snails pace.\n\nThe much anticipated Bake had grand opened inside Westfield earlier this month and I heard the lines were insane. So, I gave it a few weeks before even bothering bc this is definitely not worth a crazy ass wait time to me personally.\n\nCame on a Sunday afternoon and of course there was a line. Thankfully, it was literally less than a 10min wait. I seriously wouldn't wait any longer. \n\nThe cheese tarts were good, but nothing orgasmic. The crust just doesn't do it for me. Wish it were actually crisp to the bite. But it's only crispy around the top. At least the cheese filling isn't overly sweet. *sigh* These tarts just don't compare to the ones I've had in Japan and in Hong Kong. Sad, but true. \n\nAs for pricing... yikes. They do cost a pretty penny or two. Lol. One dozen for $40+ though... Seriously?! $40 gets you at least 2 dozen overseas... smh.", "author": "Ann T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "Came here on Sunday evening around 4:30pm. Decent sized line (15 minute wait).\n\nService // friendly front of house staff \nLove that it's open and you can see the tarts being laid out and baked. \n\nSmells wonderful! The tarts are 3.50 each or 6 for 21.00. When I came they only had the original but apparently they do special flavors like chocolate as well. \n\nLove that if you buy a box of 6 it comes in a nicely packaged box and bag. This would make a nice gift! \n\nThe tarts were so yummy! The crust is a shortbread cookie like delight and the inside is some kind of creamy cheese cloud fluff. I will probably come back to either treat myself to another tart or to give it as a gift to someone's", "author": "Emily T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "This store is very popular since it opened. I always see it on IG. We stopped by, for the new item: Matcha Cheese Tart. I am a fan of it!!! They used high-quality matcha to make this dessert, but it still overprices. That's why I gave 4 stars.", "author": "Anny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "Pricey but affordable sweet treat is the way I'd put it. I'd heard about this spot (soo much hype) from friends, and happened to walk by on a Sunday when there wasn't too much of a line.\n\nThe crust was super crunchy and fairly sweet, although not overly so that my sweetness threshold was reached. It was good in a memorable sort of way. The cheese itself was somewhat ricotta-y (not sure where all these comparisons to egg tarts are because it's not similar at all), with a light sweetness. Think of the texture as a very, very fluffy cheesecake. Portion-wise, rather small (though cute), and that's coming from someone who likes small desserts in general.\n\nDisappointingly, even though they were baking the tarts fresh in an oven, they were boxing up the cooled (read: room temperature) ones, which made it less tasty. I would come again only if I was already in the area or looking to pick these up for a friend. 3.5/5 for me, with the caveat that it's pricey.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-06", "description": "Thankfully the hype has died down a bit.  Waited in a short line for less than 5 minutes to give it a try.  It's not as swoon-worthy as the always-on-vacation Golden Gate Bakery, but it's still an indulgent treat.\n\nCheese Tart: It may look like an egg tart, but it's nothing like an egg tart at all.  It's more like someone put a no-bake cheesecake in the oven and it melted and got all gooey.  The crispy shell is a great firm pairing to the molten cheese gushing out.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-17", "description": "Whenever something opens for the first time in San Francisco, I know there will be a line. Luckily for me, Peter L decided to endure the wait. And I was the happy recipient. He brought the tarts to a happy hour on Friday, May 11th around 6:15pm.\n\nI believe he waited in line for about an hour and got the max amount of tarts possible. A dozen of the original tarts and half a dozen of the chocolate ones. Pricing wise, I think they were $3.50 each? Since we got them the day after, I first tried the original at room temp. The tart was kind of a mix between a cheesecake and an egg tart. Cheesy with a slight egginess. I liked how they weren't too sweet, but there was an element that almost made them taste a touch savory. I wasn't a huge fan of that. Later, I tried both the original and chocolate after I heated them up in the toaster oven and they were better. I actually liked the chocolate one more and I'm not even a huge chocolate person. Though I believe they were made with dandelion chocolate and I adore their super dark chocolate. \n\nGlad I was able to try these Japanese cheese tarts. Though I'm happy I didn't have to wait in line for an hour as I don't think they are really worth the wait. Thanks Peteo for saving me some tarts!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-15", "description": "Several weeks ago we attempted to buy some cheese tarts but they sold out around 6:30p.m.  Today hubby was downtown running errands so I requested he make a detour to buy some tarts.\n\nHe swung by around 10:30a.m.  No line.  He bought 1/2 dozen.  Boxed in a two level rectangular shape box.  \n\nWe ate them for afternoon snack.  Light cheese mouse filling in a very snappy tart.\n\nBake Cheese Tart originated in Hokkaido Japan and they've opened outpost stores worldwide.  Seeing that we just returned from Japan two months ago, we still have all things Japanese on the brain.\n\nAt $3.50 each, it's somewhat pricey for a few bites.  A nice change as it's just enough sugar.  Not too sweet.\n\nOn Bake Cheese Tart website, it states you can eat the tart fresh, chilled, frozen, or microwave. \n\nI'm not sure I'll be a frequent patron, but the tart was good for the record.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-16", "description": "Not worth my time in line!  Long line that doesn't move and one person working and one person packing. It's a horrible streamline and doesn't maximize the product and not cost effective.  You have to get a certain number of it too.  It costs about $3.20 (correct me if I'm wrong), each. \n\nCheese tart is aye okay!  It's not heavy like a regular American cheesecake nor is it light like an egg tart.  It's a good equilibrium.  It doesn't make me crave for more. Sizable and notable.  \n\nThey ship it from Japan - how original.  \n\nGood, but not the greatest for me to yearn for more. Overhyped.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Tried their special MATCHA this weekend, and I was in H E A V E N. It was a little more runny compared to the regular, which was a little weird, but it tasted delicious nonetheless. I love you so matcha!!!", "author": "Vickie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-16", "description": "The first time I stopped by, everything was already sold out. Luckily I was back in SF and my friend was craving cheese tarts. We went around 2pm and they still had plenty of cheese tarts left. The taste itself was pretty good BUT I'm not sure if it was worth the price. I've had less expensive cheese tarts from other bakeries before and they taste just as good. I wonder if it's cause this shop is originally from Japan. At $3.50 a piece, they are definitely trying to rob me. LOL but at least I can say I've tried it! I probably won't get it again because it's just way too expensive for a single piece of cheese tart.", "author": "Debby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "I came here the Thursday and Friday before Mother's Day, attempting to purchase cheese tarts for a part of my mom's Mother's Day gift. \n\nThursday's Visit: \nI arrived at 8pm and there was a short line because they were almost sold out. According to one of the employees who was standing at the end of the line, if everyone bought 12, then they would sell out right before the person in front of me. My friend and I still waited regardless in case there would be leftovers for us. Plus, it was a very short wait. Unfortunately, we weren't able to purchase any that night but fine by me. Also, the employee who is a senior at Balboa attending UCB in the f was super friendly! \n\nFriday's Visit: \nI arrived around 6:30pm and the line was out of the Bart entrance. After waiting about 10 minutes, we received a card with how many we would purchase. It guarantee that we would be able to purchase the amount that we requested. It took my friend and I about 30 minutes to finally get to the front. I ordered half a dozen. \n\nThe cheese tart itself is amazing. My mom, who is very picky and not easily impressed LOVES the cheese tarts. It's not overly cheesy or sweet, which she prefers. It's enjoyable both hot and frozen. I love it too! \n\nI came back the Friday of Memorial Day weekend. They didn't give out the vouchers. I was almost to the front of the line after waiting almost 15 minutes when they announced that they were almost sold out. I was one person away from the person who bought the last 3. Surely I was disappointed that they didn't announce earlier that they were close to selling out. There was a lot of people behind me too. It was only 6:50pm. \n\nI advise checking with the front before lining up especially towards the end of closing. Save yourself some time in case they sell out. \n\nIt's quite pricey at $3.50 each, but definitely worth a try.", "author": "Yi Xian R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "I kinda want to leave a bad review so people don't come here and make the line longer...\n\nThe line wrapped to the Bart entrance, and that was after showing up when the mall opened at 11. \n\nThe line also moves really slow. Slow enough that if you're with a small child, or a very hangry boyfriend, they will complain. Alot. \n\nEverything is behind glass so when you're trying to take your arty pics for your Instagram story, you'll always have a slight glare, that always just slightly ruins the photo. \n\nYou'll also get random old people coming up to you asking if you're in line for pastries, and how they're 'very expensive'. Then mumble 'kids' as they walk away taking in the longass line wrapped around the corner. \n\nIf you go with an old person be prepared that they'll tell you how back in their day, they had to walk 15 miles to get to the bakery. In a blizzard.\n\nIt's in the mall. Mall food court to be exact and they sell out of the chocolate tarts very quickly. \n\nAll in all, don't come here and just add to the line, selling out my beloved chocolate tarts. \n\nCan I interest you in a mediocre lobster roll or poke bowl across the way?", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "So happy to see that this place is open! I used to go to the one in Japan and the formula is consistent. Taste just like the ones overseas!\n\nCame here after work a week ago and the line was only a few people long. It didn't take more than 15 mins to grab my tarts and go. They did run out of chocolate tarts though by the end of the day so if you want those you might want to go early. I was okay with only eating the OG flavor. \n\nThese tarts are a little pricey at $3.50/piece, but a nice treat. They're fluffy and creamy and not too sweet. You can also freeze them and eat it that way.", "author": "Junella T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-05", "description": "The first time I tried a Japanese cheese tart was in Canada at Uncle Tetsu and I felt in love with this dessert dish so when I found out that this Japanese cheese tart was opening up in SF, I HAD to try it. I waited until the hype died down a little and went on a weekday to avoid the extremely long line and the shop running out of cheese tart and it paid off. I went in the afternoon (around 3pm) on the Tuesday after Labor Day weekend and the line was not long at all (I only had 3 people in front of me). There was also plenty of cheese tart to go around. What I did notice immediately was that there is currently a limit to how much you can buy per day. They limited each person to 6 pieces per day and a 6 pieces box cost roughly $20-21. \n\nI tried both the Matcha and regular flavor. The Matcha flavor was very rich in Matcha. I think the Matcha was way too rich that I ended up not like it. However, the regular cheese tart was pretty good and very similar to Uncle Tetsu cheese tart. I would definitely recommend the regular cheese tart to people.\n\nNow whether or not it is worth about $3.50 per cheese tart is a different story. In my opinion, I think the price is a bit too high and I think a factor of that is that the shop is in Westfield SF, which potentially have very high rent so they would also have to mark up their price. Now, would I pay $3.50 for it when I want it? Of course I would, but then again, I would spend quite a bit for good food.", "author": "Chenny O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "OhhhhMMMMGEEEE!  They taste so good!  \n\nI came here during my lunch hour and waited 25 minutes in the slowest production line I've ever seen.  1 cashier, 1 person filling the orders but 3 persons baking the goods.  They need to re-evaluate the lines to make them move faster.  It's critical to get to that tart faster!\n\nLet's talk about that tart.  It's a cheesecake.  A little fluffy, creamy cheesecake with a buttery cookie like crust.  It's OMGEEE!  I want more!!!\n\nExpensive!  $3.50 for the regular flavor.  $3.65 for the limited edition chocolate flavor.\n\nI know I will be back for another bite of that tart!", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "Great place for an afternoon snack - coffee and cheesecake tart. I was intrigued by this new place from Japan and had to try it. I went several times for different flavors and every time there was a small line. It goes fast since there are only a few items on the menu. I'm not sure why some cheesecakes come out more pale and some are more toasted on top. The cheesecake filling itself is the stuff. It's very fluffy and not the denseness usually associated w/ cheesecake. Strange for a production that seems so uniform. The strawberry flavor was not that strong and it had a few small pieces of freeze dried strawberries on top. Each tart sets you back about $4.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "How could anyone turn down these fluffy yellow tarts?? There was a pretty long line when I visited but it moves quick. It was around a 10 minute wait, and there were about 20-25 people in line. Currently they only have the original flavor but Strawberry is coming out in July.\nThe filling is very soft, almost like the Chinese egg tarts but instead of egg, it's made with cream cheese. When we bought them, they were room temperature (and delicious) but they do have recommendations for eating it chilled or reheated. I wish I had more self control to save one to have chilled. Oh well, maybe next time!!", "author": "Athena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Stumbled upon the spot when I was heading to the bart through the Westfield Shopping Center and was so intrigued by the line of people and the cute display...made a mental note, got a box the next time I was in the area and was soooo delighted! \n\nThe tarts are a wonderful blend of textures without being too sweet. And the dessert itself is so interesting if you eat it cold versus warmed, etc! I love it straight from the bakery - they have a great crisp shell with a little molten cheesecake filling. I've practically become a brand ambassador - telling everyone of my love for them. They're also perfect for social functions - such a crowd pleaser!", "author": "Annie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-27", "description": "i'm a huge fan of cheese tarts and when i found out that bake cheese tart was opening up shop in california i was ecstatic! then i got sad because it was in nor-cal and not so-cal. luckily on my most recent visit i was able make a pit stop at bake cheese tart. \n\ngot myself 6 cheese tarts. 3 original and 3 match flavor. $20.08 without tax. matcha is more pricey as one is $3.65 and original $3.50. personally, my favorite is the original cheese tart. if you are a fan of cheese tart then you gotta pay them a visit! matcha tart not worth the visit. original cheese tart is definitely worth the visit! two thumbs up my friends! \n\ntips:\n*located in the mall\n*located in the food court\n*cash and credit card accepted\n*two flavors original and matcha", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "I finally bit the bullet and waited in the massive line. It was about a 30 minute wait at 5:30pm. \n\nThe line moved gradually, although I overheard that the chocolate tarts were already sold out. I was slightly disappointed, but ultimately wanted to try the original cheese tart.\n\nThe cheese tarts are $3.50 each, $21 for 6--there is no discount for buying more. They also limit you to a dozen per person.\n\nAs I got to the front of the line, it was obvious why they were taking so long. There were at least 5 employees turned away folding boxes or glazing the tarts and only 2 working at the register. \n\nThey pack it to order, which is nice, but also an inefficient use of time. There should be employees packing customers orders so when they get to the register, all they have to do is pay.\n\nThe employee packing the tarts was really friendly and was happy to pack the tarts that were perfectly golden brown! I don't know why they're selling some that clearly look half burnt.\n\nOnto the cheese tarts - they're pretty tiny. I tried it both room temperature and chilled, and I honestly think they taste SO much better after being chilled in the fridge. The room temp tarts taste like whipped and runny cream cheese, whereas the chilled tarts tasted like a cheesecake with a nice shortbread crust. \n\nOverall - 3.5 stars. Good cheese tarts, just a bit pricey along with a terrible wait time.", "author": "Shirley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "After months of wanting to try this place, my boyfriend and I finally got the chance to after a long day of shopping in the city. The line at that time wasn't bad. Matter fact, we only waited 3-5 minutes.\n\nThe cheese tarts are pretty pricey, in my opinion. $3.50 apiece or $21 for 6pcs. They're pretty good though as they are smooth, gooey, fluffy, and, of course, cheesy. The crust was tasty also.  It was actually my favorite part. I still, however, don't think they are worth $3.50 each since they are small, hence the 4 stars only.", "author": "Celina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-21", "description": "I've never had a cheese tart before this. They're sooo good! The inside is light and fluffy and the flavor is delicious. Definitely eat it hot and fresh. If you take some home, don't make the mistake of microwaving. The crust becomes soft. \n\nWe thought about getting the different flavors but it turns out those are just sauces that you can put on top after you receive your tarts. I personally think they don't think any sauce additions.\n\nCame on a Saturday afternoon and the wait was maybe like 10 minutes at the most. It moves really fast.\n\nThe price of 6 per tart is the same as buying 1. The only difference is that 6 comes in a cardboard box where individual ones come in a paper bag", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "Always a line.\n\nAlways.\n\nBut, hey it's closer then going to Japan for one of these cheese tarts right?\n\nI want to say a huge YUM to the original cheese tart. It tastes like a small cheesecake, and it's always baked fresh.\n\nThe chocolate one tastes like a cross between a chocolate cheesecake and a thick chocolate mousse.\n\nAt $3.50 prepare to shell out some dough (get it LOL) for these treats, but it's worth it.\n\nSolid pie like crust with a smooth cheese filling--be prepared for the wait, and while you're at it buy more than one, because I don't think one is enough. Your friends, co-workers, family, and you just might want a second!", "author": "Jack R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-03", "description": "Delicious but be careful!! The cheese tart melts in your mouth like creamy foam. I didn't expect it to be so soft and accidentally dropped half of it (goodbye $3.50 a pop). Otherwise it was perfectly flavored!\nI also tried the matcha flavor, but cheese is the way to go. The matcha tarts were a little pricier and had a strange salty flavor (along with an astringent and bitter taste but that comes with matcha). \n\nThere is usually a line where you can see them bake the tarts; come before it gets sold out for the day!! It took about 10 minutes to get to the front on a Saturday afternoon :) I would come back only for the cheese tart!", "author": "Leona C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "If you visit the Westfield food court often, I'm pretty sure you've notice the huge line of people forming at a certain dessert spot near the bart entrance. At first glance, it's just a huge wall of yellow boxes and glass windows. When you take a closer look you'll notice trays and trays of deliciously toasty and golden yellow cheese tarts lined up in the window. \n\nI came here on a Friday afternoon and the line peaked my curiosity. I had friends who lived in the city and they recommended this cheese tart place but I was never really sure where it was located. As soon as I saw the baked cheese tarts at the window, I knew I was in the right spot. The line is very intimidating and you can't help but wonder whether the wait is worth it. It stretches around the corner of the restaurant and almost to the bart station. \n\nThe cheese tarts are great, don't get me wrong. The cheese part of the tart was a little tangy and not too sweet. It was very creamy and soft with a nice toast on the top. The crust is my favorite part. It's not flaky like an egg tart usually is, and not crumbly like the traditional cheesecake crust. I can't really describe the texture but it's very good. Although it's delicious, I don't think it's justified to wait 35 minutes or more only to buy 6. They're also quite pricey at $3.50 for one, $21 for 6. \n\nI would love to visit again if the line was more efficient. You wait in line to order from one cashier and the cashier assembles the boxes while you pay. I think that's why it took so long. I did like how he showed me the tarts to ensure I was satisfied with them before he boxed it up.\n\nOverall, cheese tarts 4 Stars. If based on cheese tarts and overall experience including price/wait time, then 3.5 Stars.", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-08", "description": "Egg Tarts, Cheese Tarts, I like em all....if you're a NYC soshi this week you attended the MET ball....the lines to get these things are not short but tall..... you'll find BCT if you hook a quick left once you hit the food court at the Westfield mall....\n\nWait time: For those of you curious, the wait from the glass doors that lead out to Bart/muni is about 1 hour.  I'd say every order takes about two minutes to process (approximately).  I've been twice now so when you have time to kill you think about these seemingly trivial things. \n\nWhy do I do go to places like this? In one word: CURIOSITY\n\nCuriosity killed the cat, The Curious case of Benjamin Button and Curious George have a new member of their club ...curious Rod. \n\nSaw this place on social media and I was intrigued that it was the first location in the United States. When I saw there was long multiple hour long lines, I had to see for myself what the buzz was about. \n\nI snagged and allowed myself to eat one of each flavor of these pint sized bites. $3.50 for 1 and 6 for $21 (if you can't do math they have it on a sign next to the cash register).\n\nThe cheese tarts are shipped frozen from Japan and at the store according to one of the employees they glaze them and place the egg yolk and then bake them? (sounds feasible). \n\nThe consistency of the cheese tart tastes more \"liquidy\" than your standard egg tart. Since the lines are so long you are sure to get a fresh/warm tasting egg tart. To me it tastes like a light cheesecake-ish almost like the famous \"Zanze's \" cheesecake  in the Inner Sunset. \n\nHow was the taste? Solid but I have it in the middle of the pack of my rankings below.  $3.50 as others have noted seems a tad bit expensive and the taste while different isn't knock your socks off good but it's a solid alternative to the conventional egg tart. Would I wait in a long line for this place? No way , but if there was no line I might snag one. \n\nOf the two flavors I think I liked the chocolate one more because it was flavorful but not too \"rich\" for me. The \"regular\" was good as well so I'd encourage you to try both to see for yourself (especially if you wait in that long line). \n\nI recently embarked on a completely pointless quest to rank places in the SF Bay Area that sell Egg Tart...yes Egg Tart. Obviously given the nature of the food most of these places are in SF or Oakland Chinatown. \n\nRanking explained:  #1 (listed at the top)  is my favorite/ #?  (listed at the bottom) is my least favorite. Follow my profile to see my most recent reviews\n\nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. If you're curious, I have rankings for Boba,Tacos, Ice Cream,  Bakeries and Ramen as well (random right?).  I hope I can be helpful since so many Yelpers have helped me discover new places. \n\n1 Mr.Bread\n2 Golden Gate Bakery\n3 Yummy Bakery \n4 New Hollywood Bakery\n5 Bake Cheese Tart - yes I know it's not tech a egg tart \n6 Ruby King Bakery\n7 Napolean Super Bakery\n8 Sheng Kee Bakery \n9 Wonder Food Bakery \n10 Sum Yee Pastry\n11 Grand Mission Donuts and Bakery", "author": "Rod M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Born In Hokkaido and made its way through Asia. I seen it last year when I was in Thailand but failed to go. I roll up at Westfield mall and there is about 60 people in line. \n\nI text my foodie friend if they have Baked in NYC and she said yes. Her first time was in Signapore. I was convinced Yas this has to be good. Opened up on Friday 2 days ago and I heard the line was 2hours. Thank goodness it was at least a 40min wait.\n\nStarring through the window like a little kid wondering how many am I getting. The limit is 12 lol they have the original and chocolate at $3.50 a pop.\n\nMy first bite crust tasted like short bread, inside creamy cheese like a half baked cheesecake and warm in the middle.\nThat bad boy melted in my mouth and wanted seconds lol", "author": "Kathy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "What's different compared to others? They have the FLUFFIEST cheese tarts. The moment you stick your tongue into the custard, you can feel how light yet creamy that tart is. Definitely better than Uncle Tetsu. \n\nGet at least 3 if you're really hungry. You can also buy them fresh or frozen! So awesome!\n\nOriginal cheese tarts are the way to go! I didn't care for the flavored cheese tarts.", "author": "Mandy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-17", "description": "$23 for 6 cheese tarts is definitely a bit rich for my blood but I had to hop in line today to see what the hype was about. Glad to report that they are good but not spectacular and definitely not worth the price for me to want to come back for more. \n\nThis place sells Hokkaido baked cheese tarts which means you can expect a very balanced treat. Not too sweet and not too overpowering in flavor with just the right balance of crunch from the crust with the fluffiness of the soft cheese filling. The big pull for me today versus previous times when I've walked by here was the word MATCHA covering the wall behind the counter. Regular cheese tarts are just interesting but matcha cheese tarts are irresistible! I ordered 6 comprised of 4 matcha and 2 regular. They actually have a sign limiting each customer to only 6 of the matcha tarts so immediately I thought, \"this sh** must be bomb if they gotta cut people off from ordering too many so everyone can get in on the tart action!\" I'm clearly susceptible to suggestive selling and therefore the ideal consumer because I only planned to buy four but walked away with their standard box of six. \n\nLine is usually around the corner and moves really slowly. There is one register so they help one person at a time. Definitely something you shouldn't try to squeeze in on your lunch break unless you plan on possibly skipping lunch and having only tarts. Service is fantastic though once it's your turn. They are very friendly and package your tarts perfectly to go. \n\nNow for the tarts. The filling tastes like a whipped and fluffy cheesecake filling. The regular tart just tastes like a plain New York cheesecake without the heavy weigh you down feeling you get from a cheesecake. The matcha was delicious. Very strong matcha flavor but you could still taste the cream cheese and just as light and fluffy. Almost like a matcha cream cheese mousse is the only way I can describe it. The crust--oh the crust!!! This was the best part. I would come back here just for a bag of crusts! It's a light, buttery crunchy texture that only Japanese pastries get right. Not too sweet and really the perfect counter to the soft filling. I just ate another one before writing this review and I definitely think they taste better cooled off. They come warm with each order and the filling is actually a little runny and unappetizing as a result. If you go, get a box and have a few later so you can see for yourself. \n\nThe biggest scam? The ladies at the counter actually tried to sell me the frozen cheese tart saying how it tastes like ice cream cake and how my son would love it. Please don't try to pawn of yesterday's unsold tarts as today's frozen cheese tart. I would be happy to try one for $1; otherwise, give me the fresh stuff and back away. I'm good to go. \n\nThese are good but not life altering, especially for the price. Worth checking out and probably makes for a great snack after a long day of shopping while you're at the mall.", "author": "Betty R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Came when the mall opened and was second in line, and ordered half a dozen. Beautiful presentation in packaging. \n\nI love all kinds of egg tarts. Chinese ones Portuguese ones. These Japanese egg tarts are definitely like a light cream cheese. Not too sweet and light. Loved the crunchy crust. They can be refrigerated or frozen. But since i was sharing and didn't have access to a frig all day, they were still great at the end of the day. \n\nI happened to go by at the end of the day and there was about 20 people in line and still a lot of tarts to sell.", "author": "Mitzi W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-08", "description": "Tried out KB Bake on the 3rd day it opened in SF.  It's inside the Westfield Mall Downtown, foodcourt Bloomingdale side, by Sur La Table/Cako.\n\nOnly 1 cashier and they take a long time because the box they use it hard to put the tarts in.  I think that's why it takes so long.  The tarts were already made and there's only 2 choices: regular cream cheese tart or chocolate made from Dandelion Chocolate in SF.\n\nI got 3 regular and 3 chocolate.  Regular is $3.50 ea, chocolate I think were $3.65?  not sure, it's not listed on my receipt, I just remember they run up higher.\n\nThey charge tax too so it was a lot more than $21 that I was expecting to pay.\n\nRegular - crust is crispy like a shortbread cookie, creamy and fluffy, a bit tangy.  Chocolate I seemed to like better, same crust, chocolate blended well and not as tangy.  Chocolate should be on the menu for 3 months.\n\nI asked about green tea tart a lady in line said they have in Hong Kong, they don't know if they'll have it.\n\nSuppose to refrigerate any leftovers.  Can be eaten cold, frozen, or warmed up in toaster oven.\n\nI might go back, not in any hurry.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Bake Cheese Tart originates from Japan, and there are stores in Korea, Singapore, Hong Kong, Thailand, Indonesia, Vietnam, and the Philippines. This is the first US store, and it's conveniently located right by the Powell BART station, inside the Westfield mall. \n\nPrice: almost $4 for one, $21 for 6\nFlavors: chocolate and original cheese\n* if you're a chocolate lover, I did like the chocolate more. They're limited edition and made with Dandelion chocolate*\n\nI waited an HOUR for these (I don't usually wait an hour for anything), so of course I left with a box of 6. Tons of people commented on the Bake bag I was carrying around all day. \n\nThe hype is real. I already ate 3 today, and I will be back.", "author": "Corinna T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-05", "description": "5 Star for taste \n1 Star for service and sense of urgency from staff \n\nI loved these tarts in Japan so I came for the grand opening today and waited 3 hours to purchase 12 classic and 6 chocolate tarts which were the maximum allowed per guest. \n\nI lined up at 11:15am, store opened at 12 and the line didn't actually start moving until about 1230. Granted there was a long line that extended into the bart station but the line really should have moved a lot faster than it did. When I got closer to the front and was able to observe the transactions, it really seemed like there was no order and direction. There were plenty of tarts and plenty of staff, but the line moved so incredibly slow!! Honestly the tarts are amazing but due to the lack of urgency from the staff. I would recommend for people to wait until the hype dies down before visiting. I would have been really nice for management to have done something to thank the customer who waited 3+ hours for their tarts.", "author": "Serena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Located conveniently in the Westfield Mall Foodcourt!\n\nWaited in an hour long line and it was worth it! Lol. I've tried these melting cheese tarts in Japan (from mini Pablo) and I can confirm these are just as delicious!\n\nThey're definitely more on the pricier side - about $4 each. They only had two flavors - original cheese & chocolate. They're both SUPER delicious - but the chocolate was really rich and to die for. I'm hoping they'll have more flavors!\n\nP.s currently they have a max purchase of 12 original & 6 chocolate per person.\n\nPro tip: Eat them while they're still hot for the best experience :)", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-06", "description": "I really wanted to like this place, but I ate a bite of disappointment, unfortunately. I've tried premium cheese tarts in Tokyo on my trip to Japan last year and I loved it. I was quite exited to hear that a chain was coming to the Bay Area.\n\nBake Cheese Tart is located inside Westfield Mall, so you would have to pay to parking in the garage for $20-$25 (depending how long you stay) or uber since it's really hard to find free public parking. The line wasn't as bad when I went, since I decided to try this place a lot later after they announced their grand opening.\n\nThe new flavor that came out when the day I came was their matcha, and it just wasn't that great. Or maybe I'm just not a fan of matcha? I tried their original tarts too, but it just tasted too gooey to my liking and the cheese flavor is a little overwhelming.\n\nMaybe their other flavors are better, but I won't be returning anytime soon :(", "author": "Crystal N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "We came around 6pm on a Wednesday. They ran out of chocolate tarts and the line was still wrapping around into the bart station. Wait was only 20 minutes and the line went faster than I thought. \n\nThe cheese tart was so yummy. Perfect amount of sweet to savory ratio complemented with the taste of gooey and soft cheese on the inside.\n\nCost is on the pricier side for what it is, but I'll definitely be back when the hype dies down.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "Love this place. Taste the same as the one in Japan. There is always a line waiting for cheese tart but it moves fast! \nFresh baked cheese tart! They also have seasonal favor and this month is green tea. \nIt is pricy tho. Like $3.50 each", "author": "I C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-09", "description": "Kind of expensive for what it is, but it is flown in from Japan so that's probably the reason for the price. I like trying their special flavors, strawberry and matcha being some of my favorites so far. Their tarts are on the liquid-y side, so don't expect it to be all solid (unless you refrigerate or freeze it and then take a bite into it). I come here often because it's close to where I work, but wouldn't go way out of my way to get it.", "author": "Megan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Some people prefer cheese tarts when cold, others prefer fresh out of the oven. When it comes to Bake, it doesn't really matter. You'll get the same result:  *buys another dozen*\n\nHighly recommend the Matcha Cheese Tart! Keep an eye on the line and don't forget to get napkins!", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "On a Fridays-afternoon, the wait was about 45 minutes for my friends and me!  But I was told that this is a modest wait compared to how long the line can get during peak hours (up to two hours).  \n\nGetting to the cheese tart--they are absolutely divine.  I was a skeptic at first, because I didn't understand what the hype was about (arguably still don't) but the cheese tarts were certainly scrumptious.  \n\nThe texture is very airy, fluffy and light, which is not apparent when you are judging it's overall composition.  \n\nDefinitely has a unique flavor and texture.  But I wouldn't wait for more than 15 minutes to purchase a box full, especially because they are also quite pricey individually (~ $3.00).  This location also offers a chocolate-cheese-tart variation which I have not tried but heard that they are quite popular and sell out quickly.", "author": "An Thien T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "I came here with a friend on a weekday during lunch and thought that the queue would be long but it wasn't. It actually moved quite fast and we managed to get the front in a matter of minutes. While in line I was able to see them make the tarts - they looked so much like Chinese egg custard tart I was excited to try it.\n\nSince we had a hearty bowl of ramen we decided to split one. \n\nI'm not normally a fan of cheesecake but I actually liked this better than regular cheesecake. The tart had a soufflé like texture and the crust was dense like a cookie.\n\nWe finished off the tart in no time and we decided we are coming back to have one each.", "author": "Nette T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "I have never eaten anything like this before, and I typically hate all things cream cheese, but this was SO good.\n\nThey are the perfect picture of sweet and savory and the right ratio of crust to filling.  The original was my favorite, but I also enjoyed the matcha option.\n\nI'm going to try one of them cold and see how it is.  That's my one sadness....that they're served just at room temperature, rather than a little warm or a little chilled.\n\nI would definitely come back here, even if the scale hates me for it.\n\nP.S. More flavors would be great!  The chocolate seems like it was very short-lived :(", "author": "Tay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "BEST EVER.\n\nMy boss bought these last week. She works in SF. She said this place is originally from Japan. Man they know how to make a cheese tart. The crust is so good! Just like a shortbread cookie. There's a little card that comes with your order on how to refrigerate and eat. If you eat it fresh the crust is like a cookie. If you put it in the fridge and eat it the next day, it's like a \"cheesecake bite\" , if you put it in the freezer it's like a ice cake. So I haven't tried it refrigerated, but either way it'll be good! \n\nMy boss said it's located in the mall and there's still long lines. Highly recommended.", "author": "Justine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Quick Summary:\n- Line is still long (took 35 minutes or so)\n- Ordering 6 will get the box, 3 will only get a paper bag\n- Better eaten on the day it was ordered\n\nI've heard of the opening of a Japanese cheesecake tart store in Westfield, but when I visited on the day it opened, the line extended outside of the mall and to the ticket gates of BART. \n\nI finally decided to go after the limited time offer the chocolate cheesecake (collaborated with Dandelion), so I missed it. (There are rumors that they are going to sell strawberry).\n\nCompared to the line I saw on opening day, the line still goes around the store, but it was short enough to wait before your patience thins. I ordered three because there were three of us, but instead of the cute boxes for 6 tarts, they cheesecakes were placed in a large paper bag. Luckily, I had a relative who carefully carried the bag home so the cheesecakes remained intact and still picture perfect. \n\nWe tried two eating methods: eating it within a day and one storing it in the refrigerator. We agreed that eating it on the day it was ordered was best. Otherwise, the cooled down cheesecake tasted how we make at home (translation: nothing too special). \nIf eaten on the same day, the tart is light and crisp, the outer portion of the cheesecake is fluffy, but when one takes a bite at the center the cheesecake is creamier. \n\nThis cheesecake I would line up and order more.", "author": "Mito I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "Good cheese tarts, thankful that I didn't have to wait in line too long. They had the regular cheese tarts and the matcha cheese tarts. The matcha tarts are very green and you can totally taste the matcha. If you are not a matcha fan, then this one may not be for you.  The regular cheese tarts were divine and delicious. It was definitely the favorite at home. Service a bit slow as there were customers contesting to the way the tarts were packaged and rung up. Seriously people... there are two flavors and the prices are posted!! Would definitely come back and try seasonal flavors!", "author": "Alicia A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-05", "description": "First time I walked by on a Friday afternoon one week after they opened, and the line was insane.  I passed.\n\nNext time I walked by maybe a month after they opened on a Saturday morning and boom!  Zero line.  But I couldn't pass up the opportunity.  \n\nEverything is great about these little tarts...  Except the price.  They are expensive.  Its worth a taste, and if you are a good baker, then after trying it you can probably recreate this delicious treat.", "author": "Kim C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "I love bake cheese tart!!! \n\nAs a cheesecake non-fanatic, I gotta say that this place keeps me pretty content. I think my utter dislike for cheesecakes may be due to the compact and heaviness of it. This is why I always opt for Japanese/ Asian style cheesecakes because they tend to be lighter. Bake cheese tart has a good cheesecake flavor that doesn't taste too much like cream cheese, it's nice and soft, and the short bread crust is the breadwinner of it all! This tart complements itself in every way. \n\nCame in around 5pm on a Wednesday night. I was lucky enough to get in line when there were only about 10 people in front of me! (Or is it dying down by now?) \n\nStill.... gotta say that what could've taken 5 minutes, took about triple the time. Not sure if their system is the best. One was a cashier and there was one boxing the tarts. I appreciate that they box as we order and we can see that they are boxing it fresh.... however it takes too long. Possible to have a person keep boxing? We can see them doing it anyway. Just a suggestion. - 1/2 Star for that \n\nOh yeah: you can only buy a dozen each person so bring a friend to get you more! \n\nTook off 1/2 star because these are pricey AF!", "author": "Karen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-05", "description": "First visit and first time trying the internet famous tart. I got the classic baked cheese tart.\nThe presentation of the store and tart itself is clean cut and aesthetic. The cookie crust has nearly perfect edges.The cashier and server tailor to customers who seek those aspects as they ask you if the tart chosen for you is okay before packaging. \nThe cheese filling was arid and creamy, on the denser side much unlike the fluffiness of whipped cream. To best describe the flavor, it is a hybrid of slightly sweet mascarpone and savory cream cheeses. The tart was very neatly filled in a crunchy butter cookie crust (not flaky pastry). Overall, the tart was tasty, but having the whole tart to myself was much too heavy.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "Yes, it's pretty expensive, but I much prefer a cheese tart (or two) to a $5 cupcake.  Definitely recommend trying it at least once.  If you order 6, then you get a whole box; otherwise they'll put it in a paper bag.\n\nApparently you can eat this chilled or room temperature, but I much prefer eating them right away while they're fresh.  I like that it's not too sweet and the filling is delicious.", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "You're more likely to find a line than not, but the line isn't too bad. If it's around the corner pat the glass, you're looking at a 5-15 minute wait probably.\n\nI'm a big fan of the matcha flavor. Wish they still had chocolate. They could stand to add a few more though.\n\nThey could be faster if they pre-packaged some boxes, but I guess it's done this way so you know you're getting them fresh. Doesn't add value to me though. They lose a star for slow service.\n\nI wouldn't get it often, but I do like to get it as a treat if I want to show up with something nice.\n\nDefinitely works out of the fridge of freezer--less likely to fall apart on your hand that way too!", "author": "Paolo V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-07", "description": "This place opened at the Westfield mall and the lines have always been a bit insane. I'm curious about places that are confident enough to offer basically just one product (kinda reminded me of Crispy Kreme donuts when they first opened and, yes, I'm that old) so as soon as I saw a relatively short line one night - I decided to line up. \n\nThey sell one tart for $3.50 or a box for $21 (no discount except you get a nice box).  The tart itself is nice enough - fluffy cheese with nice warm baked crust.  The tart lasts 1 day at room temperature or 4 days when refrigerated.  Is it worth the hype?  Maybe. Is it worth the long line?  No.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-07", "description": "Is it worth the line? Hard to say. \n\nI was impressed by the warmness and patience of the staff working there--only 2 people. \n\nThe cheese tart itself was many things: smooth, cheesy, creamy, fluffy, and still had a slight tang, all contributing to a complex party in my mouth. \n\nThey are pricey, so buy a bunch for later or for others to keep the price down (buying 6 makes each individual price less than just 1, for example.) \n\nThey also give you a small handout explaining when to eat the tart and how long it'll last. \n\nI'll be back to try new flavors if the line/hype dies down.", "author": "Lizzie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "The tart itself is creamy and delicious! It melts in your mouth on the first bite. But probably not worth paying $3.60 for one cheese tart.", "author": "Carrie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-19", "description": "Had to see what the hype was all about with this cheese tarts. Saw photos of these lil' tartlets floating around my instagram feed and was surprised it was located at Westfield SF centre. I'm always down for places that are bartable. I browsed the reviews and did my research before making my way here.\n\nSubject and $$-- Japanese cheese tarts shipped from Japan, 2 current flavaflavs: original Hokkaido $3.50 each (limit 12) and chocolate $3.65 (limit 6, which sells out fast)\n\nLocation--across from Cako and Walgreens, next to the bart entrance. \n\nWait time--15-30+ mins depending on what time of the day you go. Weekdays are the best time it seems like. Weekends I feel like the wait time would be a nightmare. There's only one cashier.\n\nMade my way out here on a Thursday evening around 6:15pm. The line was pretty cray, about 30 people deep. Wrapped around the corner and past the bart sliding doors entrance. Waited about 35+ mins until I reached the front. You can see everybody at work through their glass wall. The oven on the far right, the table of tartlets hot and ready to be delicately places in a box, napkin or paper bag. \n\nIt was apparent that chocolate was already sold out by that time bc all I could see was a sea of pale yellow slightly burnt tarts on the pans. Disappointed but predicted it would happen. Initially I was going to get 2-3 tarts but by the time I moved up order, I changed my mind. Ordered 6 tarts for $21 + tax. #DentInMyWallet I waited in line for 35+ mins after work...I was gonna treat myself dammit! The people in front of me ordered 1 tart and in my head I was like...damn y'all waited half an hour for one tart o__O so wow, much patience.\n\nMy 6 pack was boxed up and bagged, and I was on my way...upstairs to get glamour shots of the tarts and of the dome. I didn't try them until 4 hours later bc I had to commute back to my town and go to the gym. Gotta lose some calories before packing them back on amiright?! I popped one in the microwave for 10 secs and went in for the first bite. Wow. Speechless. The tart was light and subtle cheese flavor with a splash of sweetness. It was creamy and fluffy, too. Definitely something I've never had before. And that crust...DAMN. It really balanced the creamy fluffiness. #GoodTexture I wanted to eat all 6 but I didn't want to be a fatass that night. They were to share amongst fam and friends lol. But yeah, it was pretty darn good. \n\nOverall, it's a good tart-- cheesy, fluffy, slightly crunchy and not to sweet. I agree with the other peeps that they are expensive and the wait time is ridank. They should definitely add in another cashier. Hopefully after things settle down, the work flow will be more efficient and the line will move faster. I'll be back in a few months. Tryna get my hands on a chocolate tart!", "author": "Vicky L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "TASTY...if you survive the wait. Unless you are traveling from afar to get these Tarts, come when the line is less than 15 min.\n\nThe little shop/stand is pretty small, neat, and straightforward. In the food court, you won't miss their wall stacked with the yellow packaging.\n\nThe tarts themselves are delicious. If you want to get the chocolate ones, you have to come earlier in the day (they sell out by noontime, the manager told me). They are strict on quantities that they bake each day (because they are shipped in to be heated). I was relieved to find that the crust wasn't too overwhelming! The light, cheese filling sticks to your teeth then melts in your mouth. It's like you're biting into a cloud.", "author": "Janelle W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-21", "description": "When this place first showed up at the mall, I had no idea what it was. A little research later, I put it on my list to try, but it wasn't top priority because of mixed reviews. After a lazy Sunday spent wandering downtown, I had some time to kill before catching a movie at the Metreon. I wasn't hungry enough for dinner, so a snack seemed like a perfect medium.\n\nThe line was around the corner when I joined, stretching about 20-25 people long. Unfortunately, they have a very inefficient set up (or possibly just strategic on their part?) and they only have one register. They have two flavors: original and their seasonal flavor, which happened to be matcha. After some internal deliberations, I decided on the matcha.\n\nFor $3.91 (incl tax), I was given one matcha cheese tart and a napkin. I'll admit, it was pretty good. People say there's a strong matcha flavor, and I don't think it was especially strong, but strong enough to know it was matcha flavored. The crust was thick, but had a good buttery flavor to it and snapped with each bite, without flaking and falling apart all over the place. The filling was soft inside and oozed out a bit with my initial bite.\n\nLike others said before me, it's good, just not life-altering good. I think trying it once suffices because the $3.91 price tag is a bit pricey for what you get.", "author": "Leana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-17", "description": "Wanted to try these while I was in HK recently but didn't get a chance. Luckily when I came back I found out this store just opened here in the states. \n\nDownstairs in the food court area inside SF Centre\nCame after work and the line was long but waitable. Maybe 15-20min.\n\nPicked up 3 tarts and ate one on the spot. Smell was too enticing. Very yummy but kinda small for $3.50 a pop.", "author": "Linda W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-20", "description": "This concept is really weird. I had the matcha and custard. Custard is the more natural combination. Not sure I like this concept. To be fair, the matcha tasted very matcha so they got that done really well. And the crust was done well too.", "author": "Rose F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "As you may have expected, they sell cheese tarts.  They are $3.65 a piece.  They are a bit pricey because it's their first and only location in the US.  It tastes like cheesecake with a harder crust.  \n\nService: The customer service is TERRIBLE.  You are limited with your purchase and they will tell you to wait in line if you want to buy more.  I know your job sucks, but the least you can say is hello with a smile and end your order with thank you.  \n\nFood: The crust is hard with fluffy cheese on top.  I've tried the original and matcha.  As for the matcha, you don't really taste much of it.  It does taste a little bitter because they burned the top.", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-14", "description": "So yummy - I'm not really sure where you can find a cheese tart like this anywhere else! I tried this on a whim when in Japan so I knew that the quality would be up to par here and (although it's hard to compare/remember), I believe it is! But it is pretty expensive for what you get and I like to treat myself to one every once in a while but can't really get myself to bring a box home. I usually just grab one and eat it immediately.\n\nThe times I've been, I haven't seen any special flavors. One thing is that the browning on top is a bit inconsistent on the tarts. It's definitely worth trying once especially because the line isn't bad anymore.", "author": "Erika N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "I love their cheese tarts! My kids are addicted to these too they would eat a bunch in one sitting. They're a bit pricey but I think it's worth it! The calories are worth it too!", "author": "Ly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "There was a ton of hype for this place over the weekend, so I hoped to jump on the bandwagon since I was in the area.  I arrived to the mall before 10 am and went straight to the food court as the doors opened.  Luckily, a crowd hadn't formed yet and I was the 4th person in line.  A few minutes passed and the next thing I knew, there was another 30 people in line behind me.  I only ordered a couple tarts after seeing the person in front of me shell out $40 just for a dozen.   \n\nTaking my first bite, I was expecting to taste an egg tart.  But, I was very wrong.  The crust was crispy similar to the egg tart, but the filling was a lot softer and creamier. It reminded me of cheese cake.  The chocolate tart was not too sweet and had a slightly salty taste.  I was not as impressed since I am not a huge chocolate person.  \n\nOverall, I was very impressed by the taste and quality of the tarts.  The service was a bit lacking as they could only serve one person at a time and they seem to still be figuring out logistics.  If it wasn't for the steep price, I would come back often.  But for now, I will have to save these for special occasions.", "author": "Mitch T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-29", "description": "This is a Japanese chain that opened its very first store in the US! It's located in the basement of the Westfield mall, right next to the mall exit to BART/Muni.\n\nThe cheese tart itself is delicious-- golden brown on the outside with a rich savory-sweet filling in the center. The filling is some sort of cream cheese, kind of like a softer cheesecake in a tart form.\n\nThe taste was great, but I can't recommend it based on its price alone. $3.50 each is a bit too much for my taste, but it's definitely worth a try once (or maybe twice) as a small dessert.", "author": "Tien L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-17", "description": "Flavor Ranking, if you get a chance to try em:\n\nStrawberry \nOriginal\nGreen tea", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "Great tarts in Westfield! My sister got 6 original tarts for me and my family to try. I decided to try the tarts at room temperature and after I heated them up in a toaster oven. The room temp tarts were great, the filling was creamy and the crust had just enough sweetness to complement the filling. When baked, the filling becomes all gooey and the flavors tasted the same. I wish they had other flavors, but my sister told me all they had were the original flavors. I definitely want to come back and try the different flavors!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "These cheese tarts were AMAZING!!! When we first saw the prices it was pretty steep but we still bought 6 pieces and enjoyed them in all the different ways they provided on a slip of paper. My favorite way of eating them was warm and freshly toasted but eating it refrigerated was delicious in its own way. If you love cheesecake, I recommend eating it cold!\n\nCompared to 85c's cheese tarts, I feel like these ones are fluffier and the pie crust is crunchier and doesn't fall apart. I definitely recommend everyone to try these!", "author": "Joelle P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "I'm a huge fan of Bake but this first US location sure gives the entire company a horrible name.  All the workers always look so miserable working here, no one is ever happy or smiling and after my encounter with their manager, Leah, today...I can see why.  She can care less about her customers, let alone her workers.  That's such a shame since these tarts are always so tasty and reminds me of my vacations in Japan.\n\nI always make sure to get my cheese tart fix whenever I'm in Japan and Bake has definitely created a name for themselves in Asia.  Warm, fluffy cheese tarts oozing with sweetness but what sets them apart is their nice packaging and friendly service but this SF location is anything but that.  :(\n\nCase in point, today is their first day of launching their seasonal strawberry cheese tarts that has also been shipped over from Japan (nothing is made fresh onsite btw...all shipped frozen from Japan and just baked here).  Customers such as myself have waited patiently weeks for its arrival so it's no surprise we were all excited.  I got to Westfield at 1:30pm this afternoon and was told a new batch of strawberry tarts will be coming out at 2pm.  If you have been here, you will know that there is always a line, sometimes fast but sometimes painfully slooooooow.  Since there was already a line, I proceeded to stand in it not knowing how long wait time will be but to my surprise today, I got to the front of the line by 1:45pm.  Trays and trays of their strawberry cheese tarts were all ready to go, cooled enough that the strawberry toppings were already placed on them.  Since I did not expect to get to the front of the line so quick today, I kindly asked the cashier if I can pay for the tarts first, I will gladly wait to 2pm when they bring them out.  I was appalled when she shouted at me and said \"No!  they are not coming out until 2pm.\"  I understand that and I am more than happy to stand aside and not disrupt the flow of their line but to my surprised, she said I needed to stand back in that long line and wait again.  Hopefully, the next time I'm back up to the front, it will be after 2pm already.  WTF?!?  That makes no sense, why couldn't they just make a separate line for those just waiting for the strawberry tarts rather than making people stand back in line over and over again in hopes to \"time\" it right?!? \n\nLeah, the manager walked up and I explained to her nicely that I understand that the tarts won't start selling until 2pm but other customers, along with myself, did not know how long the line was going to take so we all stood here waiting for the strawberry tarts.  She too said no, that we all have to stand back in line and firmly said \"it's first come, first serve....you can get it if you are the first customers in line by 2pm\".  Clearly, that won't happen anymore since by then, I was only 10 minutes shy from 2pm and the line was growing.  I understand rules are rules but man, talk about no customer service at all.  As a manager, she could have taken control of the situation and started a new line or kindly understand that we are literally minutes away from her 2pm batch but yeah, that was not the case.  Leah could have care less if we wait in that line again and not get any strawberry tarts.  Her cold attitude towards her customers is a big reflection of how her employees reacts too which just makes it a nasty vicious cycle.  \n\nSeriously, I was ready to leave for being treated so poorly...I really wished I was not such a big sucker for sweets and that I didn't promise my family that I will bring some to dinner tonight.  Thankfully, I ran into my cousin and since we were chatting, I was encouraged to wait in that line again, blah!  The tarts are without a doubt tasty but the poor service that comes along with the price tag, I will much rather wait until the next time I'm in Japan or Asia to have them again.  Bake SF - shame on you!\n\nKudos to the girls that were a few down the line from me and did not take their BS!!  They created their own strawberry line and firmly stood there, telling customers to go ahead of them who just wanted to buy the original tarts.  You go girls!!", "author": "Janetto L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "This small shop is located in the food court of the Westfield mall in San Francisco. This place only sells Cheese Tarts, so I got a Cheese Tart. It is pretty expensive for one, $3.50. I came at 11am so there was no line.\n\nCheese Tart- Very expected. The texture is amazing. It was like something I have never eaten before. The crust was crunchy and broke off easily as I bit it, but the filling was creamy in a light way. It was sooo good. The taste was kind of like a cheesecake. Besides the price of it, it was something I would definitely eat again. \n\nOverall, I absolutely would eat this again.", "author": "Felicia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-12", "description": "These cheese tarts are tasty, like the filling of a danish, but I wouldn't say they are worth the hefty price of $3.50 each or the long wait. Beard papas are just as tasty and no line.", "author": "Tu-Quyen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "Cheese tarts yumm. $3.50 is a hefty price for one of these small tarts but hey it's a specialty tart so I guess I could hand over my money. I really liked the crust. It was still crunchy even the next day with a simple reheat. The cheese is melty and pretty sweet. It's like a Portuguese tart. I definitely would eat again, but prob won't pay again. \n\nThe line wrapped around to the sliding doors was about a 30 min wait. IDK why it takes so long. You only have ONE THING to choose from. You just tell the person how many and they will grab it before you even reach the register. Seems like such a fast process but geez, it takes a lifetime to get up front. Oh, if you don't want the overly brown ones, you can request it and they will give you the less brown ones.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "Every time I pass by this place, there's always a line so I try to go when I see the line isn't as long. \n\nFirst time I went there, all their other flavors were all sold out so I had to get the original. The original was good. The cheese consistency was so light and fluffy. Since my tart was a little warmish, it tasted better than if it was in room temperature. I gave my mom the tart as a to go when it was room temperature and she was underwhelmed by it.\n\nMy second time coming here I saw they had a limited time matcha flavor tart and me being a huge matcha lover, I had to try it out. The matcha tart tasted better than the original in my opinion. It wasn't overly sweet nor was it too bitter as well. \n\nOverall, I think the prices of the tarts are pretty pricey in my opinion. I wouldn't come here again just for another original or matcha tart but if they had any other interesting or limited time flavors, I would probably try it out.", "author": "Kochamon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "I came on a Saturday morning, at 11am, and there was little to no line. If there were people, the line moved fast. They do have a limit of how many you can purchase per person. I got the original cheese tart and being a cheesecake lover, I loved this cheese tart. I'm actually not a fan of overly rich cheesecake so I think I prefer cheese tarts now, if I need to satisfy a personal cheese craving. The tart is fluffy and caramelized beautifully on the top. The crust is buttery and flaky so it is not overwhelmingly heavy at all. I think i consumed the whole tart in two bites. So good!! A must stop by if you are in the Westfield San Francisco center!", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "A teammate gets these almost every Friday and shares them with the team and I gotta say, they are amazing.\n\nA bit too heavy if you're not hungry, so it's always nice to split them in half.", "author": "Antonio H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-18", "description": "Hopefully by now everyone at the Powell Bart station might or might not have figured out how to get around the huge line out the door from BCT because it is long. but do not let that stop you because it is 100% worth the wait. \nTo keep this short - two flavors - cheese and chocolate and I would go after lunch rush hour or super early in the morning otherwise expect at least a 20-30 min wait line. 1 cash register person who is super friendly as well as the staff. towards the end of the day they do run out so its whatever the production batch is. The tarts themselves melt in your mouth and the taste is pretty awesome. Pricy AF for them because one of them is $3.50 but hey when something like this blows up and 1/2 the SF population is blowing up IG and yelp with reviews you pay the price. All in all this was an awesome addition to the mid-market desert options!", "author": "Ankita C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "If you love cheese cake, you MUST try the cheese tart. There is usually a line and I personally don't like waiting, but I think cheese tarts are worth the wait if you never tried them. The tarts melt in your mouth, and the filling is super fluffy and it's perfect with the crust. Always get more than 1 because they disappear in your mouth. They also various seasonal flavors-- I've tried the green tea tart, and it wasn't as good as the original cheese tart. The green tea tart had super strong green tea flavor, but I definitely prefer cheese better.", "author": "Brenda Jiwon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "Underated! I remember seeing a video on FB, and I wanted to try this. They were sold out of the Seasonal Strawberry Cheese Tart, but the regular one was yummy! The crust tasted like a sugar cookie without all the sugar coating and slightly less sweet. Meanwhile, the middle was like a cloudy, fluffy cheesecake that taste like marshmellow fluff. The crispy crust with the gooey and cheesy contrast made it fun to eat. I prefer this over traditional Chinese Egg Tart. It was just a bit warm right out of the box, and if you get a box of 6 like me, make sure to take home the reheating instructions. It was certainly fun to eat, and I will be returning soon to try the Strawberry one.", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "(Sing in a raspy old man voice)\n\nA one, anda two, anda one, two, three!\nHatcha hatcha hatcha!\nLove your matcha matcha!\nDon't want a line?\nShow up on time.\nLike a little sweet?\nEnough to move your feet?\nHatcha hatcha hatcha!\nThen chomp to the beat!\n\nThese matcha cheesecakes are perfection.  Do you pay for perfection? I did, and will again.  I hadn't read the Yelp reviews so was unaware of the line problem as I sauntered right up to the register on a Monday around noon.  We bought a 6 pack (sure to destroy anyone's 6 pack) and shared it with work colleagues.  I'll definitely stop here any time I'm at Westfield.  Beard Papa, move over.  (Though I still love you dearly too...)\n\nHatcha hatcha hatcha!", "author": "Ravena F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "So happy that bake cheese tart opened a location in SF! It tastes just like the one I had in Japan! The lines are definitely not as long as when it first opened! I went twice so far and only waited maybe 10-15min max. I tried the matcha one recently but honestly like the original one a lot more! Hoping to try more flavors though!", "author": "ashley z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "The reviews are so mixed and I couldn't figure out if it was worth it to get in the line. Being a big foodie I knew if I didn't try it was going to bother me forever. There was about 20-25 people in line but line moves quick. I bought 6 originals which were 6 for $20. I thought they were pretty good. They are like a super fluffy cheese cake. If you love cheese cake you will love these little tarts. I had 4 left over in the fridge from the day before but they weren't as good the next day but still not bad. Soooo if you get them eat them the same day.", "author": "Sam P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Delicious Jap cheese tarts with original flavor and a seasonal flavor. Oh, and NO LINE if you go on weekdays.", "author": "Betty T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "I was so excited when my friend told me about this place and how great their tarts are. Came here twice now, both on weekends and neither time had to wait more than 10 minutes to get my tarts. There is usually a line but it moves forward pretty fast. It's located across from the Walgreen on the corner of the Bart exit on the food court floor. \n\nAs for the taste, I'm a fan. The inside is really cheesy while the crust is crunchy. It is sooo good after a day of walking around in the mall. The downside is I really wish they have more flavors than just the plain cheese tart. I guess they have the strawberry flavors now but seems to run out really fast (didn't have the luck to try them yet). \n\nWould come again next time I'm in town and would recommend to someone with a sweet tooth and who enjoys tarts.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "I came in a little after a month it had opened, I was fairly skeptical walking over because I wasn't sure if the hype had died down or not, thank god it did. \n\nCame in around 1:30 in the afternoon on a Sunday and the line was fairly short, I was hoping they would still have their chocolate tarts but unfortunately not just their original but it looks like they will be coming out with a strawberry one soon. \n\nI was able to purchase a dozen which came out to like $40 something which is a bit crazy for these things. I mean they're good but not THAT mind blowing. Definitely a good little dessert if you were craving something lightly sweetened.\n\nThe crust is definitely flakey and sweet & as for the cheese part is like a fluffy yet creamy cheesecake. \n\nThey have some toppings you can add on over to the side of their register: chocolate powder, caramel & another one which I forgot. I opted out of adding any but I'm sure they would've made just as scrumptious.", "author": "Rheanna V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-04", "description": "It is a very expensive tart - $3.45 for a little tart and they have two flavors - original and green tea. There is a limit of 6 green tea per person, but I don't think that will be a problem at their prices. \n\nWhile I don't think they are worth their prices, the tarts are quite good. The cream cheese is soft and custard-like. The green tea flavor is very strong and I would not recommend it unless you like matcha green tea. The crust is very hard like a cookie - probably to hold up the very creamy cheese - but I prefer my tart crust to be flakier.", "author": "July N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Really something different and special. I say this because no where else sells this (in california), that i know. \n\nIts like eating baked, sweet, cream cheese on a durable, not rock hard, crust. \n\nI must say lines are long as trains on weekends (1-1.5 hours wait), when we first got them when they opened. Hopefully the hype died down for you when you go. On the weekdays its was like 5 mins dude.", "author": "Kun L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "You want a few bites of heaven? Treat yourself here!!! Located inside Westfield, this hidden gem will satisfy a naughty craving and you don't feel guilty afterwards. I got an assorted box of their seasonal strawberry tart and their original. Both amazing! Extremely fluffy and creamy at the same time! They sell out early evening and have long lines around lunch so I would highly suggest going when they open at 10am. Fantastic customer service as well!", "author": "Sahar N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "Glad the hype for this place finally slowed down. The first time I passed by the Powell location the line wrapped around the corner. This time around the line was only 1 person long - needless to say, now's the time to come check out this dessert shop. \n\nHeads up before you come - chocolate is no longer in season. The season's option is strawberry cheese tart.\n\nThey give you a box if you order 6+ ($21). Otherwise, each tart is $3.50 and they put it in a bag that they can seal for you. I do think the price is  a little steep for something you can eat in 3 bites, but it's worth a try. \n\nBake Cheese Tart's filling reminds me of Cheesecake factory options just more creamy/melt in your mouth. The filling pairs well with the crust which is more of a solid vs. flaky texture. I like that they brulee the top of the tart which adds an additional texture to each bite. \n\nOverall, I thought it was tasty and am willing to come back to try their other flavors, but it might not be my first option when I'm craving something sweet because these tarts are not the cheapest go-to option.", "author": "Keizzel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "Friend brought these cheese tarts to book club. They were very attractively packaged in a yellow paper container (so Japanese) and very tasted. They are something between a dim sum egg tart and a cheese cake. I wouldn't say that they blew my mind away, but they are a unique treat.", "author": "Julia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-12", "description": "Cheese tarts are a big hit in Japan, and Bake is one of the well known chains selling these delicious petite tarts. Bake recently opened a branch right in downtown SF, and the hype was real with the long line stretching towards the entrance to the BART station.\n\nAfter a few months when the lines died down, I finally got the chance to purchase a few towards closing time. I ordered a box of 6 to bring home to share with my family, and left it in the fridge until the next day. The cheese tart became quite firm, just like a typical American cheesecake. The flavor was good -- quite creamy and rich, and the pastry itself provided a contrasting texture to the cream. I think I probably would have preferred it eaten before refrigerating, so the cream is more smoother.\n\nFor $3.50 a tart of $20 for 6, it's very expensive for what you get -- almost double the price you would find in Tokyo. Probably won't come back again and just wait until I visit Japan again.", "author": "Alvin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Omg was so excited they opened in the US that we had to come here when we were in town. Surprisingly, the wait was only about 5 min. We ordered three to share and that came in a bag. You get a box with orders of 6!\nIt was almost as good as it was in Japan ! Still delicious and love the Japanese butter cookie crust.", "author": "Audrey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-04", "description": "I had no idea this place existed or was such a big deal! While walking back towards the BART station, I saw pics of what looked like fancy Portuguese Egg Tarts and a small crowd - enough to sucker a lemming like me to also jump in line!\n\nLong story short: these mini Japanese cheesecake tarts are tasty! As with most Asian desserts, they're less sweet and dense compared to American desserts. These also have a nice butter cookie crust.\n\nBut come on, $3.50 each is highway robbery!", "author": "Steve L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Love the original cheese tart! The seasonal flavor is strawberry right now, starting from July 6th. Not a fan of it.", "author": "Claire Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "I came here in the late afternoon a few weeks after their grand opening. There was a line that led out to the Muni/Bart station, but the line went pretty quickly. Looking at the workers putting and bringing out the cheese tarts out of the oven was fascinating. It was a good way to waste time while in line. \nI bought half a dozen to share with my family and baked them again in the oven when I got home cause they got cold. It was sweet, savory, hot and crispy! The cheese tart tasted more like melted cream cheese than a cheesecake to me.", "author": "Christine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "If the line is short, it's worth! The tart is so good. It's like a dan tat but the inside is cheesecake. The crust isn't flakey, but has a nice crunch. The filling is pretty rich, but not to the point that I want to throw up. It's lighter than an actual cheesecake, but not like whipped cream frosting. It's worth $3.50 for cheesecake fans!", "author": "Caitlyn S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-29", "description": "I finally got to try this place which had been opened for a couple months now and the hype has finally died! I was EXTREMELY disappointed in this tart. In no way is it worth what was charged and did not blow my mind. The tart was barely even warm, the texture of the tart was very mushy & kind of liquidy , the taste was super flat, and the crust was pretty firm and hard.", "author": "Chi L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-02", "description": "Why would anyone want to buy a friging double sided cheezy ritz cracker. Like come on I can make this at my house with some chonies as a blindfold. It's ridiculous, I tried taking my youngest son, one in profile picture, to this place and he liked it. So I gave him a spanking every night for a week. If I were you, I would go down to your nearest target and buy some ritz crackers and a fat block of cheddar cheese.\nbecause that is exactly how it tastes. And don't even get me started on the constant bum aches, my bum was aching all morning. That actually might of been from the rental car place, but still. I'm pretty sure I smelt an extra 2 or 3 chromosomes in there. Not a fun place experience. I would rather have 10 people slap me on the tush then eat one of these ritz cracker wannabes.", "author": "Dequavus G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-09", "description": "I was conveniently at the mall around 8pm and came upon this place. I've heard so much hype about this place and how amazingly long the line is usually, so when I saw the line was short, I knew I had to take this chance to try it out! I stood in line for about 10 minutes. They have a system where they would give you small cards to represent how many tarts you will plan to buy. I bought 6 original for $21. They look cute but to be honest, I didn't think it was anything to write home about. The outer is a crunchy buttery cookie dough crust and the inner filling is a slightly fluffier cheese cake. Just imagine both of these together and you get their famous baked cheese tart. When I gave it a try, I was rather disappointed. I thought the cheese would ooze out and be amazing, but turns out it was just okay. Maybe I need to reheat it?", "author": "Hoyan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "As good as I remember from Japan!! \n\nI had this in Tokyo when I went in the summer of 2017. The temperature and the textures were SO good. It doesn't sound positive when I write it, but trust me, it's a good thing. The temperature is almost hot and the texture is almost runny. Not only is the temperature and texture of the custard perfect, the crust is like a crispy short bread. It's the perfect vessel to hold the delicious cheese.\n\nCheese in Asia is completely different compared to European and American. It's is more tart than a New York cheese cake and much more light. If you like any of the creama concepts on drinks, you'll like this. \n\nAnticipate a long wait because there is one. I've seen it wrap all the way around and go into the transit station. There is also a limit you can purchase. \n\nFor all my cheese tart lovers, this one is the best. I bid you patience in line.", "author": "Tina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "I didn't try this cheese tart brand while I was in Japan so I can't compare. I personally think the cheese tarts are good! So did everyone else I gave it to. I bought the 6 pack and it came in a neat box. I had one the same day I bought it and one the next day after leaving it in the fridge.\n\nI got in line on a Wednesday at 3pm and waited for about 5 minutes, not too long of a wait. Personally, I think the people behind the counter could work a little more efficiently. Would the line move faster if some boxes of 6 were pre-packed and ready to go if you're only selling one flavor? ‍", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "They tastes good but it's expensive. $3.5 for single piece is too much given the small size. It's okay for one time taste but definitely not going to buy again. There's a line in weekend but weekdays noon or afternoons are great timings to go.", "author": "Maulik S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-06", "description": "Soft gooey center that was silky smooth and slightly sweet with a tangy tartness. Crust is a cookie crust that was kind of hard and thick. Too much crust to cheese ratio. And as other noted, the finish on the tarts in a single tray are inconsistent and uneven. They should invest in a better oven system to heat up their assembly line of frozen tarts.\n\nPeople line moves quick! Pricey at $3.50 ea.\n\nChocolate flavor sold out for the rest of the season though they have strawberry soon.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-20", "description": "Modern twist on egg tarts!\n\nAlthough pretty pricey ($3.50) the cheese tart was sweet on the outside and savory and creamy on the inside. The crust was hard, (in a good way) unlike the usual flaky egg tart crusts.", "author": "Megan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "What they got right:\n- first US branch\n- good marketing\n- clever packaging\n- tasty cheese tart\n\nAreas for improvement:\n- speed of getting orders ready\n- speed of baking cheese tart\n- more efficiency\n\nThis review was based on opening day, May 4, so there may been be some changes since. \n\nI got there at 9:30am and waited in line for 2.5 hours till they opened at 12 noon. Even after they officially opened at 12 noon, it took another hour for me to put in my order. There were 12-15 people in front of me. If there was one area to order and another area for pick-up, it might have gone faster. There were a lot of staff standing around trying to be \"busy\".\n\nWhen I finally got my tarts, I noticed there were inconsistencies of the tart tops ... some were noticeably burnt.\n\nThe tarts were sweet & sour, like cream cheese. The crust was good and flakey but I've had better. \n\nWere they worth the 3.5 hour wait? No. It was neat to be one of the first to try these famous tarts from Japan. I would buy them for friends but I probably wouldn't buy them for myself.\n\nThe packaging was awesome and deserves its own star rating. The boxes keep the individual tarts safe from crushing the others.", "author": "Kimi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "Luckily we hit this place on a Wednesday afternoon about 2:15 and line was nice and short maybe eight people ahead of us. Was able to pick up a dozen and had a few that that evening and they were delicious. Just put them in the toaster oven and heat them up low and slow and get a nice warm light cheesecake type of tart. Yes it's pricey so it's a treat. \n\nWe've put some in the freezer for later consumption before and heating in toaster oven brings it up to another level. Haven't tried it cold yet. Just don't heat so it's too runny inside.", "author": "Laine G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Unbelievable!\n\nSo incredibly delightful!\n\nThe crust is almost shortbread like - firm, thick and buttery -- it's the perfect vehicle to transport the deliciously gooey cheesecake filling!\n\nAnd the top of this 6 bite tarte is brûléed.\n\nTheir partnership with dandelion for the chocolate tarte is genius and limited so get em while they're available.\n\n$3.75 each and worth every bite!\n#addicted!", "author": "Charlie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "Lines are starting to die down finally. \nWas so excited to try these since I kept seeing people carrying the cute bright yellow bags! \nPrice wise, a bit high for one small lil tart at $3.50 each. And trust me you don't just buy ONE. \nTaste wise, it's delicious. It's not as fluffy as the Japanese jiggly cheesecakes but it's way less dense than your typical slice of NY cheesecake. The texture is perfect as it doesn't feel heavy after you eat it. It's still creamy yet light. \nBe careful and don't be like me and eat quite a few at one sitting!!", "author": "Connie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "Soooooo GOOD!!!! Fluffy & creamy filling it's amazing totally worth the wait :) \n\nAlthough it is kind of pricey", "author": "Apple P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-27", "description": "I remember when I would always pass this bake cheese tart place in a Japan subway station and there was always a line there. One day, I eventually sucked it up and waited in line. They were warm, delicious, and the perfect amount of sweetness. Needless to say, when I brought them back to share with family, by the next morning, the whole entire box was gone.\n\nWhen Bake Cheese Tart announced that they would be opening up a store here in SF, I was super excited. I could finally get my dad a cheese tart.\n\nI went on a Wednesday after work around 5pm allocating myself about 45 minutes to get a box before my dinner reservation. The line wrapped around the corner ending just at the door between the mall and BART. The dinner moved relatively fast and about 25 minutes later, I had purchased a box. They were a bit warm and tasted exactly like the ones I had in Japan, except they were a little more burnt. These aren't super sweet so you can eat many in one seating. You can either eat them fresh or refrigerate them for a firmer texture. Le bf who had never had them before wasn't really sold on them. He would rate them 3 stars. He wasn't a big fan of the crust, which was more like a cookie. My dad, who is a cheesecake fan, enjoyed his warm. But after hearing how much I paid per tart, he enjoyed them a bit less. \n\nWith the lines being so long, the cheese tarts being more expensive than the ones I purchased in Japan and them running out of the chocolate ones (there was a sign saying they sold out), I don't think I'll be back anytime soon. But it is nice to know that there is a cheese tart place should I ever crave them.", "author": "Carolyn Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "Every morning, I see a line coming from this new store that goes out into the Powell BART station. The doors into the mall from the station open at 10am and there's ALREADY a line! It also makes the mall smell really good. So I just had to try one today. There were only about 5 people in line just before noon. It probably took about 5-10 minutes from the end of the window.\n\nHonestly, the line moves pretty slowly when all they have to do is bag the little tarts and ring up the customer. You can't even order more than a certain number of tarts! So I don't really understand why the line moves so slowly. There were 4 workers! One at the cash register, one bagging the tarts, one switching out the trays of tarts, and another who disappeared into the back for a little bit. It could be way faster if one of the employees was outside, taking down orders.\n\nBUT my confusion was melted as soon as I bit into my first cheese tart. It was like the world's softest cheesecake in tart-form, but not tart/sour. The pastry crust was surprisingly firm. It was room temperature. And it was just big enough to get a few bites out of it before it was gone.\n\nI would say it's worth $3.50, especially since it's shipped from Japan, but probably NOT worth an hour wait (like some other Yelpers have mentioned). You can't get more than 12 original cheese tarts, but I don't even think you need 6, unless you're sharing with 3-6 people.\n\nBut I REALLY wanna try the chocolate one now, but one of the employees said they won't be getting anymore chocolate ones until summer 2019! I saw a sign for strawberry flavor, so expect another round of cheese tart hype very soon!\n\nPS - they also have a self-serve toppings corner on the side. They had caramel sauce, cocoa powder, and cinnamon powder.", "author": "Athena C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-25", "description": "I bought a box of 6 to take home. I thought the crust was good. It was flaky and very buttery. The cheese tart filling taste was too cheesy for me.  It was a bit tangy, which I found odd. The texture of the filling was light.\n\nEating the remaining tarts cold is a different story. I found the tart filling taste to be more intensified. Sometimes eating something cold is not the best thing.  I am happy to have tried this, but I don't think I will buy again.", "author": "Marck N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "I really love egg tarts so when the cheese tarts opened up, I was all over it. The location is inside the mall so that makes it a bit awkward but the line is always wrapping around the corner\n\nComposition: egg tarts are firm in the middle and have softer shells, cheese tarts are soft in the middle and have firmer shells. This is the main reason why I like them so much, I'm a firm believer that a crust is just as important as the filling. You can tell that the cream cheese filling was lapped in with egg whites, because of its fluffiness\n\nTaste: the filling of the cheese tart is noticeably cream cheese (similar to a cheesecake) with a sprinkle of salt on top. When you first bite into it, you taste the saltiness but I don't think they mix it into the filling because I personally dissected the filling - it was sweet and creamy. So if you're thrown off by it at first, just know it's meant to compliment, not shock you.\n\nPricing: Would I pay $3.50 for a cheese tart? Yes. Would I pay another $3.50 for a cheese tart? Yes. Let me make the decision easy for you - BUY 6.", "author": "Angella G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "I was so happy to see that first North American Bake Cheese Tart was in SF! I first tried it during my trips back to Hong Kong, so it's definitely a treat to have it more accessible now.\n\nThis branch is located in the SF Westfield Mall food court and is hard to miss. I went around 6:30pm on a Tuesday and only stood in line for about 5 minutes. I ordered 6 original and 6 matcha flavored tarts. \n\nTaste: 5/5 - Lovely taste and texture. Fluffy filling and a crumbled butter crust is the perfect combination! The original is still my favorite, but it was nice to try the matcha one. The matcha flavor really came through without compromising the texture of the cheesecake.\n\nPrice: 3/5 - This is definitely not something you would buy on the regular because it is pricey. I would come here on occasion for a special treat or if I'm craving their cheese tarts. Like others have mentioned, the best deal is to buy 6 original cheese tarts for $20 rather than individually. The matcha ones don't have a special price if you buy 6.", "author": "Lindsay K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "I'm not gonna lie, it's like eating cheesecake in a cupcake form with a crust. It's so fluffy, creamy, and flavorful. But for $3.50 and waiting in line, I'd rather eat an actual cheesecake. Worth a try though.", "author": "Debbie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "it's pretty pricey ($3.50 each or six for $21) but very tasty. think of all the good things about egg tarts and all the good things about cheesecake and combine them together and you get a cheese tart \n\nfrom what i've heard, the line for this place is usually pretty crazy, but when we went on memorial day, it wasn't too bad (10-15 min wait)", "author": "David K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "Came at 6pm tonight and waited for only about 10 minutes! The hype has definitely died down in the last few weeks! \n\nWas happy about that ... but then something totally killed my experience and left a very bitter taste in my mouth. \n\nAbout 5 minutes upon waiting in line, a lady with a clipboard came around and asked us how many tarts we wanted to order. We told her our numbers and she then proceeded to give us a small tag with the designated # of tarts we had said we planned on ordering. Mind you, there's already a limit of tarts each person can purchase. \n\nWhen we get to the front of the line, my friend decides that she wants to add 2 more. The cashier doesn't allow us to saying something like they only baked enough for how many people ordered in line. \n\ni call BULL$hit. Your tarts come frozen in a box. You put them in your Combi-oven and bake them for less than 10 minutes, and you tell me there's limited quantity? We just gave the lady with the clipboard our numbers FIVE minutes ago. You have got to be kidding! Unless you cut the line off already, you're going to be making more egg tarts until you close. I wasn't born yesterday to know that;  you douchebag of a cashier working on a Sunday 5/20 at 6:00pm. Talk about shoddy customer service. It's not like we wanted to add A LOT more cheese tarts. Only 2 more. TWO TARTS to the TWO that we originally ordered making it a grand total of FOUR. You're going to be stingy and make a bunch of lame rules . Where are your signs buddy? Whatever. High prices are one thing, but a blatant lack of respect for your customers is another. I'm never coming back. \n\nOn to the cheese tart. It's just MEH. Instagram worthy with all those tarts sitting on trays gleaming under the storefront lights--But upon biting into one, it reminded me of a sweeter Ritz crackers cheese, with a smooth creamy aftertaste. I put it in the fridge to see if the taste and texture will be better tomorrow. I hope so! For $3.50 a pop, Im definitely not coming back and letting  everyone that I know that they have a bunch of bogus ordering \"rules\" and need to check themselves before they wreck themselves.", "author": "Kay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Got lucky and only lined up for 5-10 minutes today (came around 2pm on a Monday). I got one chocolate and one cheese flavor for $3.50 each. Both were super creamy and the crust had a great texture to it. I'd probably get this again if the line was short.", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-14", "description": "Really not worth the hype, but worth the try for a one-time experience.\n\nI came here right after seeing trending videos of this location on social media. I'm a big foodie and right when I heard that this is the first location opening up in the USA from Japan, I wanted to try the cheese tarts immediately.\n\nCame here after work (Thursday around 5pm) and the line looked pretty long; however, it moved fairly quickly. When we came they had a limited edition flavor: Strawberry Cheese Tart. \n\nWe ordered a box of six with a mix of both the original cheese tart and the strawberry one. We were really surprised by how expensive they came out to be. You're paying $4 for literally two bites. \n\nI honestly prefer regular egg tarts over these cheese tarts. They're much cheaper and tastier!\n\nI also heard from somewhere that this location doesn't make the cheese tarts fresh. They're actually made in Japan and they just heat them up here, so they won't be as great as having them fresh from the original location.", "author": "Pariya N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Wow -- delicious, fluffy, and mouthwatering.\n\nThese Japanese cheese tarts are absolutely heavenly! The crisp cookie shell is light and buttery, filled with a creamy sweet cheese mousse. Almost comparable to a hybrid mini cheese cake and an egg custard. I inhaled four cheese tarts within 5 minutes. Yes, they are really that good!\n\n$26.58 for half a dozen delectable cheese tarts and a small Brazilian coffee. Shall I say, a-m-a-z-i-n-g?", "author": "Viennelyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "TL;DR - good fluffy, runny, crispy cheese tarts when hot. Same as the one sold in Japan. Buy one. \n\nI think the line hype died, which is good. Waited 15 mins or so on Friday night. \n\nIt tastes the same as the one from their Japan stores. Though it costs more here unfortunately, the price of SF ($3.25 each vs less than $2 overseas)\n\nTexture of the cheese tart, if it is hot still, melts and run, but crispy pie crust. If it is cooler, then the cheese is more solidified. I like it a lot when it is still warm. I recommend using a turbo/convection oven to heat it up. \n\nThey even give you authentic Japanese napkins, which is more of a wax paper texture than paper. Would go back at times if it wasn't so far. I hope they bring a branch to LA/SoCal area.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "Came here on a weekday around 6:30pm and only waited for less than 10 minutes.\n\nBy the time I arrived, they already ran out of the chocolate flavor so definitely need to go back and try those. The cheese filling has a super light texture and is almost like liquid or whip cream, but I would recommend chilling in the fridge for a while before eating if you like a more solid texture. It tasted way better after!\n\nA bit expensive (almost ($4 per cheese tart) but pretty good. Just don't expect it to be like an asian egg tart and refrigerate before eating!", "author": "Angela P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "NBA Finals were on so I knew there wouldn't be a crazy line and boy was it worth it. Never had these before so I bought 6 and literally could not get enough. They're like little bites of heaven. Would totally wait in line for them again but wish it moved faster!", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-21", "description": "My friend and I were in the area, and she had heard about this place, especially just coming back from a trip from Japan she wanted to try it. The line was pretty long since it had just opened 2 weeks prior, but moved semi quickly since there was not much to choose from. They ran out of the chocolate tart, so they only had original and they limit you on how much you can buy. I am really not a HUGE fan or cheese pastries, etc but since I stood in line I thought might as well try it and see what the buzz was about. I bought 1/2 a dozen and brought it to a friends house and rebaked it to try. \n\nMy first thoughts... ew I did not like it at all. I am just not a fan of cheese in a tart I'm guessing because my other friends semi liked it. I dont think it was worth the wait in line, its def a HYPE, and if you looking to add more foodie photos by all means go for it. I also think it was not worth my $20 something dollars for 1/2  a dozen of those tarts. I am a bit disappointed an its overrated. I have to say the cashiers were really nice, and helpful, but I def will not be coming back to this stand to stand in line for some cheese tarts.", "author": "Tiffany K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "Get ready for a lot of 3s in the next sentence. I came here today at 3:30pm and waited for about 30 minutes, which was good, because I don't think it's worth a 3 hour wait. \n\nThe cheese tart itself tastes like 10 ritz cheese crackers in your mouth with each bite, so don't expect this to taste like the typical Chinese egg tart. You'll either love this place or think it's mediocre.", "author": "Megan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-11", "description": "This counter is located in the basement of the SF Westfield Mall in their food court between Cako and Sur La Table, next to the Powell St BART entrance. Only food court seating available. Limit of 12 original tarts and 6 seasonal.\n\nSeasonal Flavor: Chocolate Cheese (a collaboration with Dandelion Chocolate)\n\n1 tart: $3.50\n6 tarts: $21\nBrazilian Coffee: $3.50\n\nI came on their second day of opening May 5th, 2018. Even though they have shops in other countries, this is their first US location. Got to the location 30min before they opened and ended up waiting a little over 2.5hours (still ended up getting a tote). What made the line SUPER slow was that they only had ONE cashier (which makes absolutely NO sense). They also didn't try pre-packing boxes to speed along the line. I guess they wanted all the tarts displayed nicely on the trays.\n\nThe tarts are not too sweet and the cheese not too overpowering (even though there are 3 types of cheeses) in the tart. The crust is cookie-like and not the flaky buttery kind. While the tarts are good (the chocolate even better), they are no Pablo and not worth THAT long of a wait.", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "While I'm not a fan of this store being much more expensive than their other locations, the tarts I would say are worth trying at least once (but maybe after the hype wears off).  \n\nI am hoping they add more flavors too over time.  Most of the time it seems they will only have the original flavor and sometimes chocolate unless they run out.  Tarts here cost $3.50 where in Japan, the website lists that they cost about 216 Yen (~$2).  So you're definitely paying a lot more here.  \n\nBut the tarts are unique and not like Chinese Egg Tarts for instance.  The filling is so soft, like a meringue.  Definitely, recommend eating it fresh, but that's not to say you can't.  They hold up quite well refrigerated or frozen as their website recommends.  It becomes more cheesecake-like when served chilled.  \n\nThis place is worth a try if you haven't had something like it.  The tarts are slightly savory, but still more a sweet dessert.  They're not overly sweet or rich which is great, but I could eat a whole box of these if I were hungry.  The location is also super convenient so grab one if you ever pass by (assuming the line isn't too bad).", "author": "Bryson L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "Horrible, unprofessional customer service and rude staff! \n\nThe line was short so I decided to give them a try. As I was approaching the line, I notice that the original cheese tarts were out. When it was finally turn, there were some that came out of the oven. The woman at the cashier said she couldn't not serve me the cheese tarts because they are too hot. Fine. I'll wait. A couple minutes past and a group of employees from the back come out and start yelling \"y'all need to get at the back of the line and not block the front\". What's the point in falling back in line when everyone else wants the cheese tarts??? \n\nPeople in line were asking questions and the two working the cashiers were acting real snarky. They gave brief, rude responses. \n\nThere should be someone out front of the line directing traffic and letting people know of the wait. This places need an upgrade on customer service.", "author": "Marie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "My friend said I had to try the cheese tarts here so I decided to try it. My brother and I came here to try it out. The line stretched around the corner, but we waited only 15 minutes. \n\nWe got to look inside the glass window and see the cheese tarts pop out, all hot and fresh. The boxes also had a cool design so we appreciate the boxing. \n\nThe cheese tart themselves were nice and warm. It reminds me of a chinese egg tart (Dan tat) but with cheese instead. It tasted like sweet cream cheese in a tart.", "author": "Nathan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-15", "description": "Tried the matcha honey tart today. It was okay, wasn't delicious enough to make me want to come back again. It's pricey for its size, as people have mentioned. Didn't find the tart nearly as delicious as the cheese tarts I've had in Japan. Overall, somewhat of a miss for me with the high price per tart.", "author": "Michelle E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "The line was about 10 mins for me so it wasn't that bad. I got in line at 11:30am on a Tuesday. \n\nCost: 3.5 for original, 3.65 for seasonal (chocolate made from Dandelion Chocolates). Note: 12 tarts max for original and 6 max for seasonal, per person.\n\nOverall: I didn't know what to expect. I like cheesecake so, it's not a surprise that I like these cheese tarts. It's like a warm cheesecake (more cheese-y) on a cookie/biscuit. I'm also not a big chocolate person either but the chocolate tarts are quite tasty. Hoping for a matcha flavor next! \n\nAre they worth the price? Yes. Are they worth the wait in line? Nope. Just wait until the hype dies down to get them or go during an off-peak time.", "author": "William V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-31", "description": "It's located down at the Westfield food court close to the Bart entrance. \nI came in on a Friday around 3pm and the wait was about 20 minutes, which wasn't as bad as I expected. By then, they did sell out of the chocolate tart so i opted in for half a dozen. Presentation is EVERYTHING to me lol so i was very intrigued with the box that the tarts are given in. The bottom tarts have a tab you can pull which makes the tarts easily accessible.\n\nThe tarts themselves were good. Tasted kinda like cheesecake to me. I saw them take a fresh batch out of the oven and tried to ask for them but they said no:(. They come room temperature and with a guide on how to enjoy them at different temperatures once you're home. My favorite way to eat them was baked for a few minutes in the oven. The cheese part becomes warm and gooey and the crust gets re-crisped.\n\n It's definitely worth a try, but don't think it's worth the wait to try again.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-03", "description": "Everything is better in japan. I had this specific bake cheese tart with my previous visits to japan and they were terrific!  A. Not disappointed that they don't also have the famous Hokkaido milk soft serve here like they do in japan. That would be awesome!\n\nMy bf and I came here because we love these tarts! Came on a Saturday and we were surprised by how short the line was. We ordered 4 cheese tarts, the crust is still crisp and buttery but the filling was a bit mushy compared to before. I did hear that these tarts are previously frozen then baked. So that might be the cause of the mushy filling. From what I remember the filling is usually stiffer and not mushy. \n \nOverall, this is decent. It should hold us over for cheese tart cravings until we can head back to japan to have more! \n\nTotal for 4: $14", "author": "Stella J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "Decided to brave the line today.  Waited 30 minutes on a Wednesday afternoon.  I wanted to see if these cheese tarts were really authentic. \n\nYES!  Do yourself a favor and try one... Or 6;). I have been to the original Bake in Japan and the flavor and texture is 100% the same!", "author": "Ahmed H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "SERVICE (2/5): 30 min wait on Tuesday afternoon with a line that just wrapped around the corner just past the window. Service is very slow, premade tarts at the register, but takes over a minute (1 min 15 secs) for a 6 order transaction. Workers doesn't seem motivated to work here from first impressions.\n\nTASTE (4/5): Great taste, creamy and smooth with a cookie like crust. These are served at room temp. Can't go wrong with either original and chocolate, the sweetness level is also really good, not too sweet.\n\nALTERNATIVE: Golden Gate Bakery's egg tarts (Chinatown).\nGGB is not as expensive and their egg tarts come out warm. More eggy than cheesy of course, so not as creamy. Their service is faster, but you'll wait longer for these since turnover is slow and people buy large boxes.\n\nConclusion: worth a try, but can wait when the line is shorter.", "author": "Wendy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "Arrived about 10:20 am on a Tuesday and the line had about 20 people but we had our order 15 minutes later.\n\nServers were super nice and hardworking\n\nWe loved the Original more than the chocolate. \n\nAlso, the pricing doesn't exactly match what they post as the chocolate ones rang up as $3.65 each \n\nI definitely will be back. Very good dessert", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "Legit place for your delicious cheese tarts. Cash only. Randomly open. Catch it while you can.", "author": "Liam P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "I saw some tourists at Uniqlo with a bag of tarts from here. I had some time so decided to try it!\n\nThe line took about 45 min. They had a limit of 6 chocolates and 12 normal tarts, but they were out of chocolate. Strawberry is the next flavor which starts in June.\n\nI have had cheese tarts from Pablo and Rikuro in Japan before, and I don't believe there was much difference in the experience. \n\nThat said, I feel operational efficiency can witness a lot of improvement. I believe it might improve as the staff (many of whom just started) get more experienced. There's literally two (more often one since chocolate is sold out so quickly) products so these tarts should already be pre-packaged in boxes and ready to go. Customers literally wait for an employee to set up the box and carefully put 6 tarts in each.\n\nThese tarts are quite expensive, and a dozen cost me $45.57. There's a few ways to enjoy them: hot, chilled, frozen. Remember to eat within a day!", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-06", "description": "I am just not impressed nor really moved by these little cheesecakes. \n\nSeriously, my girl and all her friends RAVES about these things and buys them any chance she gets. I'm sure as I write this there are hidden tarts all over my house.\n\nMaybe it's the marketing, maybe it's the weird exclusivity of how it feels when you get them because they are stupid expensive and their stores seem like feeding lines for soylent green or something. \n\nI have no idea, but I've had better pastries at literally every patisserie in town. \n\nOh they have matcha? Whoopdy freakin' do. \n\nAll hype, this one.", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "I don't get all the complaining comparing these to egg tarts . And that it's not worth the long wait when you can go to Chinatown. Scratching head. Lol First off, these are not egg tarts. These are  Hokkaido cheese tarts that are shipped from Japan.  This is a chain located throughout Asia. I do get that it may be a preference that some may not like the runny consistency if you get it still warm, compared to when they are at room temp  they become more like a cheesecake consistency. \n\nStopped by after work today 5/15 at 4:15p. Easy 15 minute wait. The line was half way from the glass corner of the store to the Bart entrance. Moved pretty quickly. Greeted with friendly staff when I got to the cashier. If you don't want the 30 to an hour wait, then don't come during peak times. Pretty simple. \n\nI ordered 6 of the original. Per the sales rep they usually sell out of the chocolate flavor around 2 or 3p. If you don't intend to eat them the same day, they last up to 4 days in the refrigerator as I was told. $3.50 a pop is expensive. Asked my cousin in the Philippines how much these are there, less than 2 bucks. In Japan these are 216 yen. So were overpaying about a buck fifty. Happy to have it even if overpriced. At least we have the option to get them, and not have to wait til my next trip to Asia! \n\nWaited til I got home to nuke it a few seconds. Cheesy melty delicious. Tastes like cheese in a tart just as the name suggests lol. If cheese is not your thing, then you may not like these. The tart is great too. Like shortbread. \n\n On another note, though this may be the first chain store to arrive in the US, its actually not the first carrier.  85 degree bakery has Hokkaido Cheese Tarts that are worth a try too without the wait!", "author": "Erica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "Melting cheese. Sweet and savoury. Freshly baked. CAN IT BE ANY BETTER THAN THIS? OMG I have such a soft spot for cheese tart and this place is LEGIT. I FELL IN LOVE. Before they opened a store in SF my aunt used to bring them all the way from Japan and keep them in the freezer. They were still very delicious but not as delicious as freshly baked ones with melting cheese inside. They should def branch out to SoCal cuz it would be a great hit. It was oh. so. fine. Watch out for the line cuz sometimes the wait can be up to 1 hr for special cheese tarts like strawberry or matcha but believe me when I say it's so worth it.", "author": "Nha Vy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "SOOOOOOO GOOOOOOOD!!! I've been craving these cheese tarts ever since I first tried them in Japan. I'm so happy that the Bay Area has been blessed with BAKE! It's pricier here, but so worth it. I came around 6:30 PM on grand opening day and waited almost 45 minutes. \n\n1 for $3.50\n6 for $21", "author": "Robinne D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-11", "description": "I typically don't factor in long wait times into my reviews because it's not fair to a business to judge them on how many other people arrive. That is, unless they're handling it poorly. I get that they're just starting and all the workers look like young trainees, but when the wait time could be significantly reduced, that makes me mad.\n\nThere is a single cashier and a person with the cashier who boxes the tarts. They are actually going to be dinged for being too nice because the guy was not only slow to box, he would turn the box of 6 tarts to present it to the customer for some photo opp (man get ready to get pics taken of yoyou by people in and out of line). The workers are really accommodating, but it's not necessary if there's a ton more people relying on speedy service. And only one cashier??\n\nThe cheese tarts were ok. $3.50 a pop? Eh. I say try it once and then you're good. They're a little more on the creamier, cheesy side than cheesecake. Try it out, but don't feel bad if you choose to skip waiting in line. I'm sure it'll die down within some weeks.", "author": "Lilian K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "I've been lucky enough to have been able to try these goodies twice without having to wait in line and both were amazing! I got to try the regular cheese tart and the chocolate. The first bite into the regular tastes like a mini/air-y cheesecake, but it kind of loses the initial cheese-y taste a few bites in. As for the chocolate, it tasted like a hot chocolate in cake form. \n\nI don't think I'd be willing to wait in that line, but overall pretty tasty treats!", "author": "Carrie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "Only complaint is priciness. I enjoyed the tart, but for the price point it just doesn't seem worth it. If it was $1.50 cheaper per unit I would consider this a good deal. \n\nThat being said, this $3.50 (at the time of this post) tart will suffice in quenching your tarty craving. It's expensive but delicious. Also be prepared to wait in line, as it gets quite a bit of traffic. Pop it in the oven for a hot minute just to get it nice and warm if you plan to eat it at home.", "author": "David Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "The cheese tarts in this place are definitely unique and different from other places. I had gone hoping I would be able to try the matcha one and the original one, but the matcha one sold out earlier on. Sadly, it didn't seem like they would be making more during the day. The original one tasted great, it was fluffy and light. Definitely worth trying at least once. It was on the pricer side though, at around $3.50 each. And the lines tend to be long. But, give it a try!", "author": "I K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "It was a freaking miracle. I think it was like some weekday, most likely Friday around 1 or 2 PM when I was at the mall and saw that Bake for once, DID NOT have a line that stretched all the way down to the Bart area. I was like wow, guess I better buy a tart or two. Cuz you know it's never gonna get like this again. So I bought two. $3.50 for 1!! OMG!!! I bought two because I'm not gonna buy a lot just to try. When it's warm, it's good. The crust is a bit harder than I'd like. Much smaller than I thought it would be. Cheese center super creamy and sweet. I've had the Pablo's Cheese Tarts (that I kind of feel has the same concept) and that was much bigger with a softer shell for like $3? It's okay. Has way too much hype.", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "I like baked cheese tarts!! They are so fluffy and tasty! I don't know if they are worth waiting in that massive line for (we were at the entrance of the Bart and it took us 20 minutes to get to the front... like why? They only offer so limited options and just have to put it in the box/bag.) However, it is tasty and I would recommend it if there was not like a massive line. It's also pricy.. $3.50 for a tart!", "author": "Jocelyn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "I've had cheese tarts before, but getting freshly made ones is another story. This just blew my expectations: the crust is this thick, crunchy texture, but as soon as you bite into it, the cheese flows out. It feels like what a lava cake looks like in your mouth. Needless to say, these are very rich and filling. The matcha green tea ones are a bit less sweet than the original, so definitely try that and mix it up.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Delicious cheese tart. Love my new treat. Awesome and yummy. Must try . It's worth the wait. I will be back again.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-09", "description": "It's delicious but not worth the long line or nearly $4 (after tax) price tag. You can get the same things at normal bakeries.", "author": "John L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "$3.50 for three bites of cheese tart. $1.17 per bite. Would you pay $1.17 for a bite of this? (This does NOT include the minimum 30 minute wait in line). \n\nI hate hype. This place isn't necessarily hyped up, but taking consideration of the price and wait, I can see the negative reviews it causes. \n\nIf I can compare this to Zanzie's Cheesecake, I would say it's almost equivalent with Bake Cheese Tart being a bit more dense in flavor and texture. So for my final verdict? You bet I'd pay for these tiny suckers again. I'm just gonna think of it as my little reward.", "author": "Fiona L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "I would've given this place an extra star if they can be more efficient. The line wasn't too long when we came and seeing that they have the tarts ready, I thought it would be fast. But I was wrong. As everyone mentioned, they boxed the tarts as people order them and that is taking forever. We ended up waiting for about 30 mins. The tart is $3.50 each, $21 for a box of 6. We tried to eat 2 of them right away but unfortunately it's not warm. The ones we took home and heated up taste so much better. It's not too sweet and love the crunchy shell with the soft fluffy cheese sponge. I'll be back once the hype dies down and hopefully try out the chocolate version!", "author": "Prisilia P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-20", "description": "Don't see how it can worth this price! $3.65?!!! Are you kidding? I came and did not have to wait at all on a Weds afternoon, after however 15 minutes looking for a parking! \nDessert in the states is really just so overpriced!", "author": "Suzy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "This place is overhyped. The wait is long because there is only one cashier and one boxer fulfilling customer orders. They can literally only serve one customer at a time. \n\nI get there early and only wait about 30 mins, making me feel like a winner. Only to get to the front and learn they limit the quantity each customer can order. This boggles my mind. I should be able to order however much I want. It only helps their business. I was planning to get a couple dozen to share with my coworkers, which would have only spread word of their opening. But I could only order a dozen originals at a time, which meant that I couldn't share with my coworkers since a dozen was enough for my family alone.\n\nThere is no signage about their flavors - original cheese tart and chocolate cheese tart - or about the order limit. These should be disclosed in large so everyone can see it. Instead, everyone had to ask these questions when it was their time to order, making the wait time even longer. \n\nFast forward, I'm back in my office and the whole trip took about an hour. I taste the tarts and they were only okay. A blander and tinier version of cheesecake.", "author": "S. S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "Being the first U.S. store opened in SF, you can totally expect long lines.  I was lucky to get a free tart without waiting in line.  \n\nHaving had Bake when I was in Hokkaido, the U.S. version was slightly disappointing.  You can see from my photo that the top of the tart was barely baked, giving a very bland appearance to the tart.  From some of the yelp photos, you can see the tarts were unevenly baked indicating there might be hot spots in the oven? The cheese tart tasted just about the same as the ones in Japan with the exception of the high price and unappealing look.\n\nIs it worth waiting an hour in line? I'd say no but if you have the crave, it's best to go before it's open as I was told there's no line just before the shop opens at 10am.", "author": "Shirley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "This place has great pastries and decent coffee. Good soups, and salads for lunch. I go here every day and buy stuff. They want a long review so let me tell you what I really think.... I've never actually been here but I'm sure it's very nice.", "author": "Thomas A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "My husband and I noticed this place a while back but we wanted to save our tummies for another dessert. Haha. We happened onto this place around 10am on a Friday and there was no line. We just ate breakfast at a pastry shop 90 minutes earlier so we ordered one to share for ~4 dollars which is pretty hefty for just one. We liked that it was a combination of salty and sweet kinda of like salted cheese. We enjoyed it. Like someone else mentioned, it wasn't too warm when we ordered it. Overall, it is good. I will prob take friends who are visiting to check this place out but I wouldn't go out of my way.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-31", "description": "Came in around 10am, omg, when the mall entry door opened, there was already a huge line formed!!!(not sure how people can get into the mall before 10am) waited for 38 min getting that! When the line moved, finally I understand how this place formed. Actually all of the cheese tarts are previously frozen! And they just added egg wash, then put into the oven! I thought all of the cheese tart are freshly made!\nPrice wise, 3.5 for original flavor, 3.65 for chocolate flavor + tax! I will never wait for 30 min to buy the previously frozen cheese tart again! Will come back once the line the shorter\n\n--update on 5/31/18\nLine moves faster in the afternoon, it took me about 10min to get to buy the tarts. The reason I am giving them 3 stars is I observed that the people might get extra one free cheese tart if you buy 6 depend on how the packaging person like you or not. The lady in front me gets a free one, but I did not even I bought a dozen... please do not do that so obvious. It makes me feel bad!", "author": "Nina H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-07", "description": "Extremely overpriced for basically just a cheese cake! The green one even doesn't taste good at all! So don't get fooled by seeing the long line, I guess people are curious like us.", "author": "Arin G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-04", "description": "Expensive. Not something I would buy often. Size is very mall, I would finish it in two bite. \nIf price is cheaper or size bigger, I don't mind eating it everyday in the morning with coffee or tea.\n\nThey have their seasonal flavor limited quantity in the morning, and limited quantity in the afternoon. (They didn't do a good job on advising this). I went around 11:30am, and they told me seasonal flavor sold out, next badge needs to wait after 12. (Ugh....)\n\nPre order needs to be made 7 day in advance, for at least 34 or 36 pieces.", "author": "X G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "The cheese tart were really yummy. Five star for the cheese tart!\n\nI waited an hour in line yesterday for these. Not worth the hour wait (I love dessert but I hate waiting), but honestly I don't mind getting it once the line isn't so bad.\n\nI had one at room temperature and one after it's been fridged. Different texture, but after it's fridged it tastes like cheesecake more and I quite love it.", "author": "Angel P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "Taste like a soft cheesecake with a harder crust. I'm not a fan of cheesecake so that's probably why I don't really this. \n\nThe work flow is very inefficient when I went and that's probably why the line was moving so slow. I kid you not when I say they take 5 seconds to open a bag and 2 people to put the box in a bag. Why they need 2 people? No idea. This is simply a one person job. The 2nd person should've been on her way boxing the second order, but nope she's assisting with the bagging. Maybe this place is still working out its kinks since they just opened.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "It's sad to say that whilst the cheese tarts are good, the customer service for me F'ed up! \n\nToday was the first day of the strawberry cheese tarts. We got here a little after 2 pm.  And one of the employees came out and said they're 2 o'clock batch of strawberry cheese tarts are selling out and the next batch would be at 3. Ok that fine we'll wait. When we got up the the front it was a little after 2:30. We asked if we can just pay for the strawberry one and just wait on the side. The same chick said we couldn't pay first. And then she said it's a first come first serve. That got me F'ed up! Nah I'm here now and you have them so serve me. If not I'll wait here till 3. \n\nI just didn't understand their logic on selling the limited edition flavors. They need a better system for their lines and a new crew cuz they were GARBAGE! \n\nStill got my strawberry cheese tarts tho!", "author": "Marilyn P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-16", "description": "Have to say this is the most popular​  bake store recently​ in San​ Francisco, comes from Japan, and now, open not enough a month, but every day​ will see a long line waiting in front of the store. Especially​ weekend, at least up to 45mins waiting. Speak as the tasty, I think if it is a regular​ store no need to wait a ​long time, I will say it worth a try, but plus have to wait so long, I don't think it worth ...", "author": "Faye L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "It's basically a soft cheesecake in a buttery tart shell - but what's not to love about that? If you prefer a denser cheesecake, refrigerate the tart for an hour! Still tastes great the next day - be sure to pick up half a dozen because lines are long!", "author": "Weich Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "The cheese tart is yummy! I only had the original flavor since they ran out of chocolate. I had mine stored at room temperature for a few hours before eating.  The texture was light, fluffy, creamy, and not overwhelmingly sweet.\n\nAbout the wait though... it's pretty bad. I started in line about 8ft out the mall entrance and it took 50 min. It's not the length of the line that's bad, the most frustrating part is that it moves slow. I'm told that they purposely do this to have their limited supply last the entire day, which is understandable.\n\nI'm not going to count the line against my rating though. I expect it to die down, and hopefully at that point I can enjoy some really nice cheese tarts without a dreadful wait.", "author": "Posu Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "If you want to taste how heavenly a tart could taste, this is the place to be. Honestly, it is the best dessert you'll have in SF - better than Ghirardelli which is too sweet for my taste. They sometimes have long queues though, so I would recommend going here in non peak hours.", "author": "Sonal B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-16", "description": "Yeah, the cheese tarts are good but the service is horrible. We got in line and saw they had seasonal strawberries ones not in the oven yet. So we order the cheese tarts and monitored when the strawberry tarts were put in the oven. Got in line again to catch the strawberry ones coming out of the oven so we can order it since its first come first serve. \n\nIt was only one small tray and each person can buy a max of 6. So we asked to order the strawberry tarts since we see them... right there... on the counter... all baked and cheesy like their suppose to be. She said they have to cool down. We asked if we can pay for them first, she said no. So we ask how long do they have to cool down for? She said 15 minutes. So we asked should we just wait in line again and when we get to the front it'll should cooled? She said yes. So we got to the end of the line and then literally not even one minute later she puts out the tray and the guy who was behind us got to order 6. \n\nSo we're pissed cause now it will all be gone by the time we get back up to the front. We went up to ask what that was all about. The next customer in line even knew we were waiting and said you guys can cut me since I know you were waiting and the manager there said well we still won't sell it to you. Ridiculous. Either they just did it on purpose or they literally cannot remember they told a customer it will take 15 minutes to cool down and then put the tray out right after. They kept saying that's their policy and that's it. They need to make common sense apart of their policy.", "author": "Thao V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "I enjoyed japanese cheese tarts at another place in SF so I wanted to give Bake a try.\n Its located next to the metro entrance at the mall next to the food court, right next to Cako stand. \nThis was the 2nd day of opening, and I maybe waited in line for 40 min? I arrived around 4 and the limited chocolate cheese tarts were sold out already. \n\nSo what about the tarts? It was pretty good! When I ate one instantly to try, it was warm & gooey. But definitely preferred it cold & refrigerated. Crust was lightly sweet & crispy. \n\nI knocked off 1 star for efficiency. But its a new place so they're probably working out the kinks. I would go back maybe when the hype dies down a little more.", "author": "Kathleen A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-22", "description": "Yay for hype! I happened to be passing through the Westfield Mall and had a little bit of time to burn. A friend mentioned this hot new \"cheese tart\" place last week and so I joined the queue and salivated at row after row of warm tarts.\n\nFeeling generous, I bought one for each of my housemates, as well as one for me. This was more expensive than imagined - there's a slight ($1) discount if you buy 6. I bought 5 and spent $19, although thankfully they came in a box that made it less terrifying to immediately to jump on BART. Overall, I think i waited about 15 minutes, not awful, but not great either.\n\nI waited until I got off BART before gingerly opening the box. The tarts hadn't been crushed, which was a relief. I sat and admired the $3.80 tart for a minute and then took a bite. It was delicious - the \"cheese\" is actually more like custard and the crust was baked to crunchy perfection. I took another delicious bite. One more and the tart was gone.\n\nSummary: tasty tart but most definitely overpriced. I'd feel slightly better if it was close to $3 or about 25% larger. At $3.80 though, this was more expensive than I habitually spend on baked goods, particularly those with a long wait. While the price isn't quite in cronut territory, it's considerably less filling than a cronut.", "author": "Sunil S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-07", "description": "I spend the day in Westfield with my friends and we saw the fresh make cheese tarts. I was never try it before and I purchased 6 of them for $23 dollars. After I try them it was not as good as I thought and also very pricey. Won't be back again.", "author": "Tam K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "Nah!!!\n\nIt is just a cheese tart. They try too hard to make it exclusive. Does not worth your time to wait in line and when you get to the cashier they tell you that you cannot get the flavor you want when it is almost ready and tell u to get back in line if you want one. Won't allow you buy and wait around. Don't like this kind of business model. My body does not need your tart to survive.  Save your time to be in line to do some fun thing.", "author": "Ting O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "I hope the owner read this review.. Holy crap i just got off the line with the most rude employee ever work in this place.\n\nThe tart is awesome, seriously.. This rating is for employing a rude employee with fake smile and straight up say \"NO\" to your face with a super fake ass smile.. She's not even that cute to begin with.. Holy crap and she work in food industry where customer service exist.. With no apology, sorry we can't sell those until it's ready, and straight \"NO\" like it's get store.. We're not in the army girl, and you're just a worker..\n\nSo ever the owner is, read this and hire employee that has manner not attitude.. I just found our her name is ESTHER... Get her training in customer service..", "author": "Junius S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Ive had these for the first time when we went to thailand. When we saw it was coming to sf, we had to get them. First things first, these little things are soo good. They tastes exactly how i remembered in thailand. The outside is crispy. The filling is so creamy and runny. It literally explodes in your mouth. The cheese is not too rich and has the perfect consistency. It is best to eat it fresh out the oven. You can also store it in the fridge and save it for later. The tarts will taste more like a cheesecake though if you refrigerate it. Its way more expensive here compared to thailand. I dont know why i am so shocked. Lol definitely worth the trip out to sf.", "author": "Dynaton T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-07", "description": "After my third time trying it I've finally decided to post a review. Had read from other posts that they can be bought warm, so was disappointed to be told it's sold room temperature. Maybe I can bring a heating element to diy at the mall as warm tarts always beat unearned. The coffee was awful and the choices for cream was fat free watery milk and almond milk. I think they had lattes before if I'm not mistakened. Disappointed! Will have to avoid at those high prices for these tarts and get Portuguese equivalents cheaper at Chinese bakeries or settle for eggtarts. These cheese tarts are from Japan so I'll just have to eat a ton when I visit. I'm pretty sure it's sold warm if not hot there.  I guess if I wasn't so lazy I could bake my own with cream cheese after looking for a premade crust.lol", "author": "Ken K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-09", "description": "I had to kill some time before I bought Century 9 opened, so a quick stroll to the food market showed (for the first time I've ever seen) zero line. \nI was the first in line, and though I'd read many reviews regarding different flavors such as strawberry & chocolate, the flavors are only seasonal.  (Matcha will be a flavor they offer later this month). Otherwise, it's just the original plain flavor. \nAlthough I've been to Japan many, many times, I'd never heard of this chain, so I haven't tried it. \n\nI had read they are best warm, and because I was the very first customer, and watched them programming the oven, I figured I'd better sit down to enjoy the creamy goodness while it was still warm. \nUnfortunately, it was only room temperature. \nI wasn't sure what to expect, so when I took my first bite, I was surprised at the texture. \nAs previous reviewers have said, it's by no means a cheesecake consistency. It very much more like pudding. \nDon't get me wrong, it was good, but I'm glad I didn buy 6.  The crust was sweet, crisp, & delicious. \nI doubt I'd go back there again. Although the employees were friendly & the cake was good, it just wasn't good enough for a repeat visit.", "author": "Reed S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-06", "description": "Finally got to try the hype!  It's crazy how popular this place is.  I've had cheese tarts in Japan and they were really good (soft & creamy) but the price was much more reasonable than here.  Easily can devour this in a bite or two! \nOrdered: strawberry cheese tart  ($3.65 each)", "author": "Mikayla M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "A lot of hype about the cheese tart they had to offer.  There was a fairly long line that was not moving because the majority of the people in line were waiting for the strawberry flavored ones that were still needed to be made.  I was still willing to wait for the original ones I wanted regardless of how overpriced(6 for $21) it was.\n\nSo why one star?\n\nAn employee announced that they were willing to start a second line for customers who wanted the original cheese tarts.  As I moved to this line, another employee suddenly announced that the strawberry tarts were ready to come out and the lady decided to cut off the line starting with myself and tells us that we needed to get back to the other line where the line gained 10+ more customers thus making the line and wait longer for myself and others.\n\nI don't understand her logic of sending us to the back of the line and I made myself clear that I would only purchase the original tarts regardless of the strawberry ones being ready that the majority of the people waited in the long for 1+ hours for.\n\nVery disappointed and inconvenient.  I confronted this spastic employee about the situation and she did not see an issue.\n\nOther than this inconvenience and the overpriced tarts, they are just OK and not worth the wait and the hype that gullible people eat up.  Obviously the ones in Japan and Taiwan are better.", "author": "Jr A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-05", "description": "I would say it's kinda worth it for about $3.50. It was pretty good and I would recommend this to other people. I tried the original one and it had a good filling. The line was long and I didn't like that part. The way that they were selling it was really slow (especially when selling only 1 item? C'mon now). Plus there was only one line/cashier and like dozens people in line. I waited for 45 minutes and barely made it to the line before they closed it. So it was not good.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "My husband loves this place and always comes home carrying a beautifully packaged dessert for us.  The packaging as I've already mentioned is really pretty.  The tarts are a bit expensive and tastes to me like cheesecake.  I wouldn't go out of my way to eat one of these things but if I was in the area would choose it as a dessert.", "author": "Mariam A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "My coworker brought them in and he placed them in the fridge.\nI decided to microwave mine for 10 secs and it actually was quite good!\nI was worried about the cheese flavor being too strong but it was really light and the crust was good.\n\nSurpassed my expectations but would I buy for $4 a piece? EHHHH", "author": "Christine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "HOLY @#*@#(*$*(&@#*(&#@!!!!! Don't listen to what anyone says. It's not overrated; it's worth the wait. It's very good; it's phucking delicious.  I am not a fan of cheesecake but I can certainly get down with these cheese tarts!", "author": "Diana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Finally got to witness the goodness of Bake Cheese Tart at their first ever U.S location in San Fran!! \nLuckily, my cousins & I weren't met with too much of a long wait or long line when we came around 1:30pm on a Thursday. The first time I tried this amazing cheese tart was in April, from a friend who had brought them from his Philippines trip & man, one or two were not enough. \nThese are not your ordinary cheese tarts. The crust is baked to perfection, perfectly crisp & the fluffy cheese filling is made of 3 different kinds of cheese from Japan. Each tart is $3.50 a piece, 6 tarts for $21.00, which in my opinion, is a bit pricey. However, I believe it's worth it!!! Their presentation is so nice too- they place the tarts in a box with separators so the tarts don't get damaged :) They also include a little card that explains the different ways you can enjoy your cheese tarts. \nMy family loved them & will definitely be coming back for more. You have to give these cheese tarts a try & you won't regret it! I loved them so much, that I brought a dozen back home to NY with me (to share one with a friend of course!) Lol. On Friday, I think due to the higher demand/busier day, they did limit one person to 3 boxes. To maintain their freshness, I placed my box of cheese tarts in the freezer. I tried one straight from the freezer & they're delicious!! The texture is still crisp& the filling is like biting into a nice ice cream/cheesecake texture! \n\nAnyway, I can't wait until my next CA trip to come back to Bake Cheese Tart! Also, when will you guys finally share some of the cheese tart love with the East Coast- NY? :) My friends & I will be patiently waiting lol !", "author": "Carla L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-05", "description": "Nothing to write home about here. Is it worth standing in line for an hour pius? NO! However, I will say I liked the regular over the chocolate. I also think it will taste better once refrigerated. Supposedly it will have the texture of cheese cake. I'll try the refrigerated aspect when the lines are down to 2-3 minutes. \n\nAnd put another POS location in.", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Surprising good. We had the original. The strawberry was sold out each time. We got the original and then added caramel and cinnamon. They were slightly warm and tasty. The line is a little long but it moves fast.", "author": "Nancy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "Hokkaido Cheese Tarts that are worth waiting in line for. I would come here again even if I can't eat them all the time. There's a limit per customer, and it's a bit pricey, but it's honestly worth it. They sell for 3.50 each or 21 for a half dozen. I went the hour before they closed, and the wait in line is only about 15 minutes. 12/10 recommend if you've never tried it! It's like the ones at 85 bakery but BETTER. The strawberry tart was delicious as the original cheese tart was too.", "author": "Anne Marie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "I ventured to play Pokemon Go and start my journey to Powell Street in Westfield Shopping Center this year's Labor Day. I was so hungry and had to start my day eating brunch - so I first ate at Koja Kitchen ( I will give this review on another post). Then I need to eat a dessert, so there was Beard Papa's eclairs and cheesecake, and finally saw Bake Cheese Tart opened. It was like in Japan on how this bakery chain specialize their take on a Baked Cheese tart, and this is more of an acquired taste. But I was so excited it opened and willing to try what this Hokkaido Baked Cheese tart is all about. Hmmm... saw the sign - each tart cost $3.50 and if you buy 6 for $20.93. These prices don't include tax and it is better to buy a box of these to share with family and friends.\nHooo... still a short line after 12:26 PM on a Monday afternoon during Labor Day. I know right, this is probably my opportunity to taste these Japanese pastries.\nI liked the packaging which is a box but it separates each tart with care. Very typical of Japanese ingenuity, care of packaging and quality of service and respect of the product has to be well- presented at all times. I am very impressed. Customer service and quality of product and service were all top-notch excellent. I bought the Original and the Matcha flavors.\nThe tarts are made up of a buttery cookie tart shell, and filling is salty, creamy savory cheese. So this pastry offers the best of both worlds - buttery, rich, crispy, slightly sweet butter cookie tart and the cheese filling is creamy, smooth, notes of salty, creamy cheeses. OMG... The original is really good as a snack or dessert. The ratio between the tart shell and cheese filling is right for both. Also, I tasted the Matcha flavor- the Matcha powder was way too bitter - they might have used Grade B Matcha powder not like the tea ceremony grade. So it tends to be bitter, but you get the green tea leaves taste. I didn't like the Matcha. I think the Matcha flavor is targeted for adults who are not into sweet desserts. So they offer these 2 flavors, and it is a matter of preference of taste. Bake Cheese Tarts are great for sharing to families and friends. If you want to give something special for a loved one, or maybe that special friend. Bring home a box of each flavor, and you will never regret it.\nVery few Japanese bakery chains venture overseas especially in Northern California. So this product is so worth trying!", "author": "Jade M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-08", "description": "After a hahaha hour wait in line, I  asked for 3 tarts for a total of about $12. Because the tarts are often runny I asked for a box. I was told that I could not have a box unless I bought another tart for  an additional 3.50 plus tax ($4). So I could have a box for approximately 16 dollars.\nPlease do the math .. a 12 dollar purchase isn't enough to allow for a 20 cent box! And given the frequently inconsistent texture, I could very well  have a bag of sludge by the  time I arrived home!\nIn Japan they sell for 1.25 to 1.50. the profit margin can certainly allow for a box.\n\nTaste worth a wait. Product inconsistent: sometimes it is runny and other times set.  Can be a mess when runny.", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-22", "description": "I tried to come opening weekend. But they sporadically closed the line. Not sure why - maybe they thought they were going to run out or didn't want the line to get insane. But we came back about half an hour later to look at the menu and it was open. We were in a rush so we didn't want to wait again. Fast forward 3 weeks later, I came on a Friday afternoon. Wait was 35 minutes, which isn't so bad or as bad as I was expecting. I first had a cheese tart in Japan. And have tried a few places here in the US but have not found anything close. Until now.... Still not as great as what they have in Japan but pretty good and pretty close. I do wish it was warmer when I got it. They were steadily taking the tarts out of the oven the whole time you're in line. But they serve you the earlier, room temperature ones; not the ones fresh out of the oven. I had one right away and the cheese was melt in your mouth. The crust is twice baked, from what I'm told and it was crispy yet flaky.  I had one the next day after I kept it in the fridge and nuked it for like 12 seconds in the microwave. It was very good still. But prob best when eaten fresh. Worth the wait and price - not really. It's pricey for a small tart - $3.50 each and there's no discount if you buy more. I hope to have it again in the future but hope the hype dies down and I can just walk up when shopping in the mall and grab a tart as a snack.  Oh and I do need to try to get the chocolate cheese tart too.", "author": "Alison W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "I waited for the hype of this place to die down since it opened I believe earlier this spring. I used to pass by on my way to work and see a line completely out the mall that would dip into the BART station which is absolutely insane. With that said, lines are relatively short now with a min wait time of at least 5 min. You're never really waiting for the tarts to come out of the oven as they are already ready to go, but youre mostly waiting for people in line to determine how many they want! Currently there are 3 options, the traditional cheese tart, matcha and gold matcha that has been filled with black honey and garnished with a little gold flake. The regular cheese tart is delicious. Super creamy, not overly sweet and if you luck out, you may receive a super fresh one. The matcha is bleh. It's all matcha and not much else. If you are really into a strong matcha flavor then this is for you. The black matcha though is perfect mix of matcha and sweetness of honey that the plain matcha is truly lacking. Granted, these things are pretty expensive and really only for treat yourself moments. At $3.50 a piece for a relatively small dessert is pretty pricey. It's definitely a try once experience though just to fulfill the hype.", "author": "Kaylin-Marie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-31", "description": "Pretty good, but if the line looks crazy long, I don't think it's something worth the wait. Luckily I only waited ~5-10 mins because I came here on a Wednesday ~2:15pm. I had no regrets about just getting one ($3.50). Maybe it'll taste better after being refrigerated? Also if this place is infamous for long lines, maybe have two registers instead of one?", "author": "Annie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "I love this so much it really tasted good. It my favorite place here in sf. Thank you to bring it here from Japan.", "author": "Chia Yu L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "Tastes super great, like a warm and melty japanese cheesecake. Only thing is at 3.5 a pop, I would be more happy with three fresh hong kong egg tarts from SF chinatown. Would definitely buy again for like, 2.5 each.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "This is the best cream cheese tart you will ever have, Paris included!!!  You will encounter s line, but it goes fast!!! This is their only product for sale.  They have a cute little box that holds a 6 pack, which I highly recommend.  Back to the cheese tarts, slightly warm, light and soft sweet cream cheese filling, crispy crust.  Grab a Peet's coffee or hot ocha, and have a party!!!!!  This is the only store in SF right now.  It originated in Hokkaido, Japan.", "author": "Gerry K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "I am a girl who is serious about her cheese. I wish I had a snapshot of my face when I first bit into one of these cheese tarts because I was genuinely blown away by the experience. This place is kind of pricey, and the line gets long, but the quality of the tarts is undeniable. The crust is firm and contrasts really nicely against the creaminess of the flavorful cheese filling. Would highly recommend getting one of these (but only if the line isn't too long).", "author": "Madeleine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "Got 2 and finished it quick between me, wife, and baby. A bit too sweet for our liking so probably just try it once and never again.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "I REAAAALLY wanted to like this place, bc the cheese cake itself is absolutely delicious! Honestly, guys, the tartlet is not too sweet or dense like 99% of the cheese cakes in America. This little guy is light, but rich enough, and quite refined. BUT $3.50 FOR A MINI TART THAT YOU CAN EAT IN ONE BITE?! REALLY? (Yes, I did eat my second tartlet in one bite just to see if I could--and I did.) I think a creampuff from Beard Papa's would be money better spent if you're on the hunt for dessert.", "author": "Rie U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "If you go midday on a weekday, there's only a small line. Once people start getting off work there's a line that wraps around the corner. The tarts are delish if you heat them up a little, but if I had waited in a long line for them I wouldn't have thought it worth it then.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-22", "description": "100% not worth the 40 minute wait. Bake Cheese Tart is stupidly inefficient in their business operation (maybe it's intentional -- I don't know). Instead of having people take your order in line and having employees continuously boxing tarts in the kitchen to keep the flow of customers going, it's one person, one order at a time. The single point of sale system is really an oversight and demonstrates a huge lack of knowledge on how to run a business. Would I come again? Definitely not.", "author": "Austin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-14", "description": "Pro-tip: Wait at the underground Powell Muni/BART stop 10-15 mins before opening (9:45AM-9:50AM) and you won't be in a longer line.\n\nI tried going on opening day and there were supposedly 3 hour lines that went deep into the BART station. Gave it another shot this morning and once the mall opened at 10AM, I was the 3rd in line and waited an additional 5 minutes or so to get to the front.\n\nQuality wise, you can tell that they put good care into the bake and the packaging, but in the end, is it worth $3.50 per tart and potentially long lines? I'd say no, not really, especially knowing that Chinatown is close by with plenty of good egg tarts.\n\nIt's definitely a thicker consistency and liken it to somewhere between a cheesecake and a Chinese egg tart. Taste wise, it's got a creamy lightly sweet taste and a solid crunch, but still not worth the crazy hype. I think if they lowered the price by $1 and have a guaranteed wait less than 5 minutes, it'd bring me back.", "author": "Jeff N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-13", "description": "I was disappointed upon opening considering 4 of 6 were over cooked, blackened on half of the tart ( beyond that of purpose.)  I say this because uneven color is acceptable, but not when hints of \" burned\" linger in your mouth.", "author": "Kelly F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "Great spot if you want a Japanese bake cheese tart, because that's all they serve here! They do have seasonal specials such as a chocolate tart or strawberry tart for summer, but their standard cheese tarts are delicious on their own. There are toppings available to the side counter - cinnamon, chocolate syrup or caramel. A tart costs $3.50 each, which feels a bit like sticker shot especially if you've had similar cheese tarts at 85C Bakery (which are better IMO). Worth trying if you have a few minutes to spare in line!", "author": "Edwina D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-19", "description": "I had never heard of this place before and didn't know what it was but I just  got in line because I saw a bunch of other people lining up for it. It's basically a small Japanese cheesecake. I liked it because it was less sweet and more tart than a regular cheesecake. They are pretty pricey at $3.50 for a tiny piece. Be aware that there is no seating, it's just a window at the mall where you buy your goods to go. It was good but I don't get why people would line up for this. While in line, I overheard people saying it's the only location in the US, and that they may be introducing new flavors in the future.", "author": "Shilpa Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-30", "description": "Came specifically becoz of the recent hype of how good these tarts are. Waited for half an hour (not too bad, as they have tons of tarts ready to sell). I finally got a dozen of it. After taste them, my honest opinion is the tart is way too small for $3.5 and crust can be a little less sweet, then it would be perfect.  I haven't tried their chocolate tart yet. Heard you have to be there before 2 pm to get them. My question is Why can't they make more of the chocolate flavor too?", "author": "Elly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "Finally got to try the place after a fourth attempt with fellow foodie coworkers. The line scared us away the past few times and it's been kind of a myth that we would ever get to try it. I'm always suspicious of hyped up places but I can't deny that I enjoyed every bite of that tiny little morsel. Really reminds me of Porto's in LA but with a fluffier texture. It's a really good balance of sweet yet savory. Don't recommend more than one if you are trying to work on that summer bod.", "author": "Jeanie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-05", "description": "Ordered:\nMatcha Cheese Tart - Toooooo much matcha; YUCKY\n\nRegular Cheese tart - Meh... nothing special", "author": "Katy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "After having a late lunch at Westfield Mall and heading back to Bart, we ran across this Japanese chain 'Bake Cheese Tart' shop. Not having ever tried before, my friend treated the group to sample the original cheese tart. Wow, the crunchy cookie like crust complemented the fluffy cheese filling, delicious! The chocolate and daily special strawberry tarts were already sold out :(.  Pricy, unique treat, worth trying.", "author": "Jason T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "Hello to every one out here, am here to share the unexpected miracle that happened to me six days ago, my name is shrom nath i live in Dermark, and I`m happily married to a lovely and caring wife,with three kids a very big problem occurred in my family eight months ago,between me and my wife so terrible that she took the case to court for a divorce she said that she never wanted to stay with me again,and that she did not love me anymore So she packed out of my house and made me and my children passed through severe pains. I tried all my possible means to get her back,after much begging,but all to no avail and she confirmed it that she has made her decision,and she never wanted to see me again. So on one evening,as i was coming back from work,i met an old friend of mine who asked of my wife So i explained every thing to her,so she told me that the only way i can get my wife back,is to visit a spell caster,because it has really worked for her too So i never believed in spell,but i had no other choice,than to follow her advice. Then she gave me the email address of the spell caster whom she visited.(drabakaspelltemple@gmail.com}, So the next morning,i sent a mail to the address she gave to me,and the spell caster assured me that i will get my wife back in 24 hours what an amazing statement!! I never believed,so he spoke with me,and told me everything that i need to do. Then the next morning, So surprisingly, my wife who did not call me for the past seven {8}months,gave me a call to inform me that she was coming back So Amazing!! So that was how she came back that same day,with lots of love and joy,and she apologized for her mistake,and for the pains she caused me and my children. Then from that day,our relationship was now stronger than how it were before,by the help of a spell caster . So, i will advice you out there to kindly email this wonderful man {drabakaspelltemple@gmail.com or visit website https://drabakaspelltemple.blogspot.com},if you are in any condition like this,or you have any problem related to \"bringing your ex back. So thanks to Dr abaka for bringing back my wife,and brought great joy to my family once again Thanks...", "author": "Nath S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Definitely worth the wait! We visited from out of state and was recommended to try them out. The line was long tho. Ladies at the counter were very nice. Cheesetart gets a five from me !", "author": "Xee V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Came in just in time before they sold out for the day on grand opening. I ALWAYS bear in mind to have less or no expectations with service on the first day, since there's always room to work out kinks later on. My SO and I waited about 30 minutes while talking to the marketing guy holding a \"sold out\" sign at the back of the line. I can tell service was trying their best after working such a hectic day. \n\nAnyways, to the most important part -- the tart, \"goddamn\" was my first thought. Not gonna lie, I had some kinda Shokugeki foodgasm a little bit not to sound like a hypey foodie. The cheese was light like Zanze's cheesecake (also recommend!), and the tart had a great kinda cookie biscuit like texture that balanced it out. Like many Japanese treats, its not overly sweet but just a good amount. \n\nBeen missing Japan since I visited a couple weeks ago, so this was a nice pick me up.", "author": "Olivia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-15", "description": "Came here on Tuesday afternoon, the line was still very long. It's located in front of the bart entrance, right next to Cako. Been seeing everyone rave about this place. So I decided to get 6 (3 original & 3 chocolate) and it was 23$ with tax included. They do accept card here. The packaging was nice considering it's a sturdy box. When I came home I immediately opened the box and tried one. I honestly don't think it's worth the wait plus the cheese tart didn't impress me. I wouldn't be returning considering it's 3.50 for one. I would just get myself an egg tart instead.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-19", "description": "Wow, the cheese tart was really good!! I guess the hype was pretty worth it. But the price is just a little pricey just for one. I waited in line for about 25 mins on a Thursdays around 6:30pm. I got 4 total and went home and warmed it up in the mini oven. Came out warm and so fluffy. Really good!!\n\nThe customer service was not good at all. The guy with glasses made it really complicated when I ordered for 4. Like he was going to give it to me in napkins and not a box... like I even asked to put them in a box to go and he looked at me confused and was like \"a box?\" Yes a box -__- That lost a star for sure.\n\nBut will be back again to try the chocolate one before they stop serving them!", "author": "Ritney N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "i have super excited to try this out. but it was decent. it reminds me of the egg tarts. They are on the pricey side for its size. \n\ni went to try it out after work and the line was ok, but will not go back unfortunately. \n\nIt like of looks like a big marshmellow with something yellow on top. I would say i prefer the classic egg tarts with and the crust of the egg a little torched. mmmmmmm good!!!", "author": "Bonnie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "These cheese tarts were amazing!!! I'm praying that they open up shop in Southern California soon.", "author": "Kailani B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "This was really good.  I heard that it tasted good in different ways, cold and hot.  So I decided to try it both ways.  First I chilled it, but it didn't really taste good cold.  When I warmed it up in the toaster oven, it tasted really good.  The crust had a good crispiness to it.  Also, the cheese tart just melted in your mouth.  I love hokkaido cheese and this was awesome as tart.  Can't wait to try more from there.", "author": "Arianna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "Waited 30 mins in line on a Saturday afternoon. By that time, they had already sold out of the chocolate flavor. The cashier said they fly in the tarts frozen directly from Hokkaido, Japan. Well, shouldn't they ship more chocolate if it sells out quickly? The baked goods just sit on the rack to be sold, but it's fresh and surprisingly still moderately hot once you get it. The original flavor and tart itself is good and you can definitely taste the Hokkaido milk flavor. The con is if you buy individual tarts, they put it in a paper bag instead of a box so the cheese oozes off the tart if you don't keep the bag straight. It can also be a bit messy to eat, because the cheese is melted. You can put it in the fridge so it will become cheesecake or you can put it in the freezer and it will become an \"ice cake\". I'm not sure what an ice cake is. I tried refrigerating one of the tarts and it did turn into cheesecake form, but it isn't the soft and fluffy type, it is more like an american cheesecake where the texture is dense. You will definitely be thirsty after eating one, so have your beverage of choice ready. The cashier said it goes well with coffee so that is why they sell coffee.", "author": "Donna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "Had the strawberry in Tokyo 3 weeks ago, and had the classic in SF yesterday. It's got the same fluffy taste and perfect crust! I think I actually prefer the classic, but the strawberry is delicious as well. Excited for when the SF location has strawberry later this summer! There was no line since we went around 1030am on a Saturday, so if you just want to try it I highly recommend just coming in the morning.", "author": "Elisa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "Came here on Saturday around 5pm, and waited about 15 minutes in line. We got both the Matcha and cheese tarts. The cheese tarts were like warm fluffy cheesecake with a crispy crust. The matcha was similar, but with a very pronounced matcha taste. I would definitely come back the next time I come to the mall.", "author": "Brandon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-11", "description": "gave into the hype and decided to check this place out with a few coworkers.\n \nwaited about 45 minutes and the line was going out into the bart station so that wasnt too fun. honestly the tarts look hella visually appealing. as long as the cheese tarts tasted good i wouldnt have minded the crap lines but i was quite disappointed in the taste. it honestly tasted a lot like an elevated ritz crackers and cheese whiz combined. i think a lot of people were expecting more of a classic egg tart kinda taste and were greeted with a bit more cheese than they wouldve like. I dont think i wouldve minded it as much (because i love cheese) but man, $3.50 for one of those? that price was a bit too steep. i guess you could say it was NACHO type of cheese youd want for that price. overall i'd say it was aight. biggest turnoffs were the line and the price along with the failed hype tied with it.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-31", "description": "What's not to love if you love cheesecake? A bit fluffier than a cheesecake but mmmm mmmm mmm so good", "author": "Sophia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "The first time I had Bake was in Tokyo and I instantly fell in love. I'm so happy they came to SF. I had the tarts again this week and they were just as good as I remember. Line is long, but if you like sweet cheese desserts, it's worth the wait.", "author": "Moniza M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "Cheese tarts are delicious but the lines are painfully long - especially for what it is. There's definitely room for improvement in the ordering and stuffing of the boxes etc.", "author": "Judy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Casually found this shop over the weekend during our short visit to San Francisco. I wasn't sure what it was at first until I got closer. The smell coming off the bakery was soooo good. The line up wasn't that long so I was able to see them up close. Because we still had a lot of walking around to do, I settled in purchasing one tart. It took me about another 4 hours before I managed to eat it when I got to our Hotel. After one bite, I fully regret not buying more. The cheese tart was DA BOMB! It had the right amount of sweetness, crunch and it basically melts in your mouth. Next time, I will for sure take home more.", "author": "Monica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "I went at noon on a Saturday and there was no line (although last time, I went in the evening and they were sold out for the day). The cheese tarts are very creamy and the crust is delicious. I think some people end up disappointed because they expect a stronger cheese flavour but I liked it this way. It wasn't overpowering and heavy, but creamy and light. I haven't tried them in Asia but I can imagine they'd be much creamier, as the ones in the US were made in japan and just shipped over frozen and reheated :/ They're $3.50 each which is a little pricey for a small tart but I'd get them again! // IG: @london_eatss", "author": "Cathy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "The cheese tarts were yummy. I got them when they were warm and gooey and it tasted really good. I didn't think they were as good as people said they were and definitely don't think it's worth to buy half a dozen or a whole dozen. Every once in awhile is okay.", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "Someone at work was talking about this place. I love desserts that tastes like cheesecake so it was a no-brainer for me to try. There is a line even on a Sunday afternoon but it didn't feel like I was waiting for more than 15 minutes. Ordered one and threw some cocoa powder on it. I was worried it would have a hello, custard consistency but was the complete opposite. It just melted in my mouth. Nothing jelly or custard like. Crust was just right not too crispy. I never had this at their other locations so I can't compare it that way but I'll definitely be back to try out the chocolate and the soon to come out flavor, strawberry cheesecake.", "author": "Gerard Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "I read a lot of reviews on here about this place before I drove an hour to try it. There's a lot of mixed reviews saying it's bland, cold, taste like cream cheese frosting, and others saying it's delicious! \nNow for my personal opinion.... I loved it! I only bought 1 because all of the negative reviews and they're 3.something a pop. There is definitely a line with this place, I think I waited 10 minutes or so. Very much worth the drive and the wait in line. As for many complaining about how they're served cold..... it's still a form of cheesecake, so I don't know why there's such a shock factor that they're served this way. A great sweet snack that's neither too sweet or too bland. I will definitely be stopping by this place again.", "author": "Mandie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "fluffy and not too sweet. the original is my favorite and it reminds me of the asian cheesecakes but it a bitesized tart form. the line isn't too bad on a weekday. their strawberry flavor is available now and reminds me of strawberry yogurt. I love how you can eat them warm, room temp or frozen.", "author": "Heejin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-11", "description": "I predict the initial excitement will die down, pretty quickly. \n\nOf course, I had to try one...because word is out. Stood in line, mid-day for about 5 mins. The tart was essentially a baked gooey cheesecake in a cookie crust. Mass produced, and final baked just before sale. Tasty, yes. But there are way more authentic treats to be had around San Francisco. Bake Cheese Tart is more of a phenomenon than an actual high-quality treat. Try one, so you can say you have.", "author": "Alison M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "We are not a dessert person! But this sweeties are so addicting. The gooey whatever it is in the middle of the tart just assault my mouth. So creamy and yummy. At $3.50 per piece, it is expensive. But, now I can say I tried it", "author": "Merry K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "Closer to 3.5 due to the price & inefficient workflow resulting in ridiculously long waits. There are only two flavors to choose from but the customers in front of us still got confused thinking that they have coffee flavored tarts (the sign reads \"Brazilian organic coffee\"). It took us probably 60-90min of waiting just to be able to place our order. The cheese tart itself is well balanced- creamy, slightly tart, and comforting. It's pretty darn good but again not exquisite. I would recommend taking a drive to 85 degrees in Daly City and getting yourself an egg tart instead.\n\nHonestly they should build automatic kiosks for taking orders. As for the customers, please be ready to tell the staff so you're not holding up the line: \"i want x amount of original and y amount of chocolate, please.\" Please try to make your numbers be multiples of 6, as each box can only carry 6.", "author": "Camie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "4.5 stars. These are bomb if you eat 'em fresh off the press. Just pop them in your mouth on the spot. It still taste good when you bring them home tho. Strawberry is my favorite but it's seasonal so it's gone already. Matcha is good but also seasonal too so it'll be gone Aug 31st.", "author": "Debra N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "My bf went here during his lunch break to get some for me. There wasn't much of a line on a Wednesday during lunch time. Sadly, they didn't have any of the chocolate ones. He got 6 cheese tarts for $21. It came in a cute little yellow box! From reading the reviews, I was expecting it to taste like an Asian cheesecake and not like a Chinese egg tart. I really liked it! The crust was crispy and the cheese was light and fluffy. Not too sweet, which I prefer. I would definitely get some whenever I'm in the area!", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Absolutely amazing!!! Always a line but worth the wait and worth the price. It is a little expensive for how small the tarts are but honestly just get them!! You won't be disappointed!! Can't wait to have them again.", "author": "Rebecca E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-05", "description": "$21 for 6 cheese tarts is really pricey in my opinion. The cheese tart was great but I don't think it's worth paying $3.5 for a frozen cheese tart from Japan. The cheese was oozing out of the tart and the crust was crispy. The tart was great but I'd rather go to a local asian bakery and pay $1 for a regular egg or cheese tart.", "author": "Iris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "The line was a little long but it goes by fairly quickly so I wouldn't let that scare you away! The cheese tart was the perfect combination of flavours with a hint of sweetness, savoury, and tang. The hard shell complemented the creamy, but light filling. The tart was perfectly toasted to melt in your mouth. I'm not sure if this is something I would come back for again (just because of the steep price), but it really was a great buy and I would definitely recommend trying it at least once.", "author": "Charmaine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-24", "description": "I was one of those overly hyped person to try this cheese tart place, only to be slightly disappointed by it. I was expecting some amazing good cheese tarts, reality is, it's kinda just average. This place is over hyped and for $3.50/tart I think I'm going to spend my dessert money elsewhere. In addition, that line out the door??? NOT worth the time. I'm glad I tried it, but I will not be returning.", "author": "Jie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Sent the hubby here since he was already in downtown. He waited in line for 45 mins. Tried it room temperature was good, tried it refrigerated and I thought was way better. I wished I froze some to see if it really tasted like ice cream. Although it was good, I think it was pretty expensive for $21 for 6.\n\nOverall I don't think I would crave for it if I wasn't in the area.", "author": "Pamela T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "Had to see what all the hype was about.  Line wasn't long first thing when they opened but the wait time was really deceiving. It took me 1 hour with maybe 20 people in front of me. They only had 1 person cashiering & 1 person boxing...so it was super slow! \n\nThe chocolate flavor was my fav but I love chocolate & don't really like cheesecake very much. The regular one was like a warm, creamy cheesecake.  I think if you refrigerate them, they have a normal cheesecake type consistency. The crust was really nice too...like a crunchy cookie pie crust.\n\nOverall, they were definitely good but not sure I'd wait an hour again for them & they were pretty expensive (6/$21).", "author": "Kimberly E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "It's very good tart. Is it worth $3.80? Maybe. Probably not worth the long wait tho. If I'm craving for cheesecake type of dessert, I don't mind standing in line for 5min for this.", "author": "Yik W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-09", "description": "I've been here a few times and still can't decide if the treat is worth the price but after trying the green tea tart today, which was so strong (maybe in response to another review earlier that said they could barely taste the tea) I wont be back.  I asked the staff if I could exchange the bad tasting green tea one for a regular (after a tiny bite) and they rudely said \"no\".  Gone are the days of customer service.  One tart to them is nothing but having to throw a disgusting expensive tart away was a treat I don't wish to repeat.  It was nice knowing you Bake!", "author": "Sam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "I found these to be delicious! Perfectly creamy and not too sweet. I waited 2.5 hours in line on the second grand opening day and tried the original and the chocolate cheese tarts. To my surprise, I liked the original better. The chocolate one was almost like a rich chocolate cake batter in the middle. But it couldn't compare to the delicious creamy flavor of the original. It tasted more like creamy milk rather than cheese in my opinion.\nI think this place is worth taking a visit to if you are in the area or if you love sweets like me! I'm hoping to come back after the lines have died down.\n As a side note, this place is grab and go style. I don't understand the high expectations for service that some of these reviewers have. They were pleasant and efficient. The menu is straightforward and requires little explanation. The most important aspect is the food, which I think is on point.", "author": "Summer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "I need this recipe! The tart shell is perfection and the silky cream cheese filling is silky and delicious. Can't wait to try the matcha flavor. I have yet to try this tart cold, if only I can wait king enough to let them cook down. haha", "author": "Janelle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-26", "description": "Well. Can't wait before it opens(it comes all the way from Japan?!) When it's actually opened, there are hella lot of people!! All the way to the homeless in Bart!!!okey, I waited for like 35minutes to get a dozen to try (excuse me, I've been waiting for 35mins already, should buy at least a dozen, right?!) when it's almost my turn, my expectation is this high!!(hands above head, this high) when I actually try the first bite, hmmmmmmm, well...yea, it's good but not worth 35mins wait good, I will say they are 5 mins good wait. It's cheese tart, so it's creamy than the original Chinese egg tart, you almost can't feel the solid egg inside, only creamy feeling. The outside of custard is kinda like biscuit not like egg tart that super crispy tho. So..well...this is the trends in SF now, I'm millennium, I tried.", "author": "Yuliana Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-21", "description": "It is good... But not worth the long line wait. Recommend for people who never tried before. Definetly get the chocolate one if you can.", "author": "Weiyu H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "I love their cheese tarts! So good yet so expensive but it's worth it. I gave it a 4 stars only because they packed it so sloppy the second time. All the cheese tarts were upside down and the creams got stuck to the box (see the pic). Looks gross but still edible. It was the guy who packaged it. Sloppy job!", "author": "Sharon W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-17", "description": "A taste of Japan in SF! Finally had the chance to try @bakecheesetart_usa in SF on Mother's Day! There was a line and the wait was about 30 minutes, not too bad. It was good but not good enough where I'd travel to have it again. The cheese mousse is creamy and fluffy, you can definitely taste the cheese as soon you reach the center of the tart. The texture of the crust is on the crispy side, like a shortbread cookie. I picked up a dozen for $42 + tax (definitely on the pricier side). If you're in the area, stop by for your first bake cheese tart bite but don't have high expectations.", "author": "Linda P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "4 stars for the seasonal strawberry cheese tart. Really yummy. The regular ones are just ok but I would only come again for the seasonal ones. Overhyped? Yes. I wouldn't wait in a long line for these.", "author": "Piper W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "The cheese tart is pretty good here.  The perfect golden appearance together with charming smell.  It melts once you take the first bite, sweet and soft in inside with crispy layer outside.  Anyway, i felt so good after eating three a row.", "author": "Zhifan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "I am not a cheese tart fan, and those little cheese tart are way overpriced. It is kinda sophisticated pastry, definitely fancy but I think there is a lack of flavor in those (even with cocoa powder on top of it).\nDon't be fooled, it is far way from a Pasteis de Nata, and I think that's why I am a bit disappointed..", "author": "Leo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "This cheese tart was Heavenly! The flavor on the inside tastes like these Gorgonzola Honey crackers I picked up in Tokyo. But, don't let that deter you if you're not into strong cheeses! My coworkers hate powerful cheeses, and they all loved these. The consistency of the filling is soft and fluffy, reminiscent of a meringue but with a little more density and then it seems like the tops are flambéd. The crust is crispy and buttery, but not flakey, more like a shortbread cookie. The ratio of crust to filling is perfection! \n\nAll around amazing! \n\nMy waistline is in dire jeopardy with Westfield being so close to where I work.", "author": "Roz M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-28", "description": "At the urging and egging of coworkers I finally caved in and stood in the 15 minute line to see what's good with this place. I was disappointed.\n\nThis place is overrated at best.\n\nAt $3.50 each or $21.00 for a half-dozen, these are not cheap and actually quite overpriced for what you get. These can be easily made in countless numbers from a production line point of view.\n\nTo add insult to injury, I found the tarts rather bland with a clean palette and I could not find any manner of eating them that made them live up to the hype. Fresh off the line, nope. Frozen as suggested by their advertising, nope. With their Brazilian organic coffee, nope.\n\nI think I'll stick to egg tarts from Chinatown instead.", "author": "Gary Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Still yummy, but the ones in Japan are better! The ones in Japan are light and fluffy in the middle, but these tarts are runny :(", "author": "Shawn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "It's overrated . The cheese tart was good , but I don't think the price is worth it . It is pretty pricy for a small cheese tart . The line was long . It's ok", "author": "Isabelle L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "Horrible experience the service is very rude and think there above everyone else. We waited in line 3 times for the seasonal strawberry tarts and after they came out the oven they would not sell them to us even though we waited over a hour in line. They told us we would have to go back in line and wait 15 more mins until they cooled off. Literally 2 mins after walking out of line I see the lady walk over grab the tray and place it in the window and sell the couple behind me the strawberry tarts. I was pissed and walked back and asked her what was up. She simply said I don't make the rules and it's first come first serve. F this place will never go back!", "author": "Chris C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-07", "description": "I ordered half a dozen after waiting for over an  hour! Got home there were only FIVE!!!!!!\n\nThe taste is good but what in the world!", "author": "Vivi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-23", "description": "The tart is like cookie, the cheese is floating but a little bit heavy. Anyway, nothing surprise me. The long line is not worthy", "author": "Mengrou L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-18", "description": "I've been coming to pick up 6+ whenever I passed by the mall to share with friends and family.  Yesterday was the day that they rolled out of new green tea flavor.  I thought of getting new flavor for my dad's birthday.  I am very disappointed with their quality control.  With max 6 of green tea one can purchase, rather than putting aside a tray that was ugly baked, and despite that I told them it would be a gift, they insisted to sell all in that ugly tray for people in line, with a \"take it or leave it\" attitude.  With the price they are charging, I won't be back for a very long time.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "Loved it here! We made a video of our experience in case you're interested: https://youtu.be/S2k5OmZav_I\n\nThe cheese tart was soft and creamy. It was a little bit on the expensive side, but definitely worth it because it was delicious. If you're planning to go make time to stay in line, because it took us about 15 mins just to get to the register.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-08", "description": "I've tried Pablo in Japan and I thought it was okay. And then I tried this place and I thought it was just okay. It is too filling for my taste, too much cheese or mouse with just regular crust on the bottom. Not worth it .", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-11", "description": "I got 6 original tarts for $20. Since they made it sound like I got a big deal by getting 6 for $20 instead of $21, I decided to get 6. They were out of the strawberry and chocolate when I got there. It was a Wednesday early afternoon. I would suggest going early when the mall opens to try all the flavors. I love how the cheese tart tastes when it's fresh. Price? Not so much. I'm going to buy this one time and one time only.", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "Finally got a chance to go here today after months of drooling over advertisements and I was pleasantly surprised! I came around 5 pm on a weekday and the wait was only ~5 mins. The tarts are both beautiful and tasty. The crust offers a crispy contrast to the soft sweet n salty cream cheese. We ate them right after purchasing and they were still warm and fresh from baking  Only downside is the price ($3.50 for one tart, $20 for six), but the tarts are so deliciously rich that I was satisfied after just one! Definitely recommend trying, will be back for the chocolate flavor.", "author": "Harim L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-04", "description": "They are selling cold Tart to customers, the stuff told me I need go home and warm them by myself!! Excuse me?? The cheese tart tastes bad when it is not warm. Bad food quarry and bad service. Very disappointed.", "author": "terranx x."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-09", "description": "My experience at Bake cheese tart may not the typical experience of many other reviewers. I have been dying to try this place since I heard about it a few months ago but its downtown location deterred me from going. I was just not in the mood to pay expensive downtown parking or be in crowds. It just so happens that I HAD to be in downtown for something. Since I was in the area, I figured I might as well as go to Bake. It was a Thursday afternoon and there was no one in line! I lucked out... I have friends who waited for over an hour for these cheese tarts. I got a 6 pack of the original flavor. At $3.50 a pop, it was definitely pricey. It's basically the price of a cupcake. I had the cheese tarts at room temp. They were not too sweet, light, fluffy and decently cheesy. According to the card that came with the box, there are several ways to enjoy these. Hot, room temp, and frozen. Each temperature would give you a different texture. I like the different options to enjoy. So far I have only had this at room temperature. I would imagine the frozen cheese tart would taste like cheese cake.\n\nFinal verdict: It was good but not amazing. It's not worth the hour wait. But if you are able get these without the line then they are a nice treat.   3.5 stars.", "author": "Sunny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "I love trying new places, especially the ones with a lot of hype. I saw a news piece for this lines-down-the-block place and had to try. I was there on a Thurs at 1pm.... surprisingly, no line! I bought 6 for home. The packing was very cute, each tart was separated from each other. The taste.... heavenly creamy but not heavy light a reg cheesecake, delightful cookie like crust. Downside, at $3.50 ea, too small for desert but great for a snack bite!", "author": "Helen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "This place lives up to the hype, I'm yet to try the chocolate flavor tarts but, man this baked cheese tarts are outta this world!! I'm so glad this place expanded all the way out here to the states. Trust me the wait is worth it is go on and try them :)", "author": "Enjoy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Totally worth the hype. These little cheese tarts are absolutely delicious and can be enjoyed several ways chilled, baked, room temperature all with slightly different texture and taste all fantastic!", "author": "Ali R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "I waited 30 minutes the first week it opened, which isn't bad considering people waited 2 hours for this. Crazy!!! You can only buy 12 max. I got 5 cheese and 1 chocolate. The cheese tart is good, especially if you like cream cheese. The chocolate was just ok to me, but I wouldn't wait for more than 10 minutes, 15 minute max.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "It is an \"overall\" good for me. There was no \"wow\" for me after the 1st bite, but also no disappointment either.  The tart is good warm or chill. The filling is a bit more dense after chill, very gooey when its warm. The regular tart has this salty and sweet taste in the filling. I tried strawberry fav as well, not a big deal for me. It had a little bit of tangy in the filling, if you don't ask them, I don't think you can detect that is stawberry. For me, this is hype over taste, $3.50 per tart is a bit pricey. And I understood its at a pricey location. Is it so incredible that I would like to have it all the time? Nope. If I ever happened to be near by and I haven't had it in a while, I might concider to get one. Definitely not craving for it.", "author": "Edy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "I love the little packaging of this gem. A little pricey for the egg tart but I love how it's served warm. Wish I gotta try the chocolate one. The toppings on the side are cool and I loved putting on the Carmel. The crust is so good and I love the the topping is a consistency of a marshmallow. Plus they take card", "author": "Diane S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-30", "description": "Very disappointed as it is a huge difference from the quality when I had it in Japan. Tried the original. Also, I tried the strawberry which I cannot compare as didn't have that when I was in Japan but it tasted like strawberry flavoring... And not like real fruit\n\nAlso, I asked if I can get a warm tart since I was going to eat it right away but was told that they only serve room temperature. However, they do serve it fresh in Japan so maybe that also contributed to the taste.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "A colleague of mine recommended this place since she knew I like to try new things. I happened to be staying in the city for work and decided to make a trip to the mall and get some things. I went with my sister and saw there was a good amount of people waiting in line at this place. We walked over to check it out .... $3.50 for a tiny little thing. We walked around for a little bit thinking what is so special about this dessert. Then I finally convinced myself to spend that $3.50 cause maybe it's really that good. As we were waiting in line, the customer ahead of us asked the staff \" whats so special about this?\" Then the employee says \" its the first one in the US\"..... so what? That doesn't explain why its special & definitely doesn't explain why it's worth that much money. First of all, if they used a smaller bag, that will save them a lot of money especially when the size of the tart is half of my palm while the bag can fit 3-4 chinese take out boxes. Anyways, this tiny tart tasted like warmed extra creamy cheesecake. It wasn't bad BUT it's not something I would  go out of my way to get.  \n\nBottom line, I don't know if it's worth the $3.80 ( tax included) . Being the first one in the US doesn't make it that special to me... it's all about the taste. I think I am better off spending $3-$5 on 2-3 really delicious Egg Custards.", "author": "Reginne B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-27", "description": "Their cheese tarts are good - similar to the ones I've had in Japan, but overpriced and not worth the 45 minute wait. Their line wraps around the store and goes out the door, while they have one cash register/cashier and one person boxing the tarts per order. They really need to work on their efficiency.", "author": "Regina D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-20", "description": "I ask for a fresh one out the oven and they deny to sell me fresh ones.. took my money elsewhere", "author": "Koko B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "Came here on a weekday and the store is located inside a Westfield mall basement level.  The cheese tarts taste exactly like the ones I've had in Tokyo. For $3.50 a piece, it's definitely worth it. Even after freezing the tarts and reheating they still tasted very good.", "author": "Ruby G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Insane. Must try, heavenly little tart. Crust is unreal. I now understand the long lines.", "author": "Christi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Delicious cheese tarts happy to have these in SF. I do think the staff could do a slightly better job keeping the tarts in tip top shape :/ not quite as perfect as what you would get in japan, but over all they taste the same and that's what's most important. As long as BAKE stays around, I'm not going to complain.", "author": "Janice S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-01", "description": "That taste is totally Not worth the wait at all!!! you can give it a try when there is no line! I just got it from my frd", "author": "Ivan Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "It's a decent cheese tart but not for the price and definitely not comparable to the one I had in Japan,", "author": "Aniko N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "If I were to vegetate in bed all day I would  eat this baby all day. Calories?!? What's that? I recommend popping these tarts in the toaster oven for about 7 min at 350 degrees. The crust will gain back that crispiness and gooey cheese.", "author": "Christine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "great stuff. had to go back in the am to bring some back to the oc. great staff too. everyone is super nice. i was lucky both times going. there wasn't much a line. fantastic experience. would i go back just for it? eh, i found another place in the oc.. supposedly better but i've yet to try. i prolly will go back here next time i am in sf.", "author": "Anna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "I first had these when I was in Shinjuku, Tokyo and also had Pablo Cheese Tarts in Osaka. I'm so glad they opened this in SF because they taste just like the ones in Japan! The crust tastes like a crisp cookie and the filling was a rich creamy cheesecake/eggy filling. The only drawback is the price at $3.50 per tart, so it's a bit expensive for what it is, but it was pretty much the same price in Japan as well.\n\nI had both the original flavor and the strawberry one and I say just stick to the original.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Went on a Saturday afternoon, but wait was shorter now, as it took only about 15 mins. It was delicious! I'd definitely wait in line again. \n\nIt had a light crunch to the shell with a smooth, delicate cheesecake like filling. I had it fresh and then reheated (in a toaster oven) so I can't speak to the chilled texture.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-20", "description": "Rude manager/employee who doesn't know how to treat customers or maintain a wait for their items", "author": "Anika N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Super yummy cheese tarts. The crust is great and the filling is so light and creamy, not too rich either! I just wish it wasn't so pricey...$3.50 is a bit much for one tiny tart.", "author": "Nicole T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-17", "description": "Not bad, just very expensive. The filling was flavorful, but the texture was a bit too liquidy for me.", "author": "Kelli-Jean C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-25", "description": "Salty, over baked tart. Tried you once, tried you twice... and Im done. It's fluffy but wasn't my tart... just going to stick to egg tarts... tasty & cheap", "author": "Ann L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-01", "description": "This place isn't anything special. They sell over priced cheese tarts. The only reason the line is long is because the employees are extremely slow and there is only one checkout register. If they add a second register there would hardly be a line. I guess they know only one register will be needed once the hype is gone.", "author": "Scott T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "My coworker bought them for me to try since I am new to SF and we work at the westfield centre. They are delicious and even better colddddd!!!!! They are soft and fluffy and ugh just delicious! Must try", "author": "Zolzaya G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "i was in the line for 40min the Thursday evening.\ni'm in the line again now its been for 20min...\nmaybe abit faster than my first time visit.\ni knew that they 'r born and use high qality milk and directly from Hokkaid,imported and understood takes cost.\nanyway i'm from Tokyo and ok the line its nomal if super yummy shop. hope i can get limited chocolate tart(with dandelion choco)today!\nits 1:30pm Sunday afternoon now...\n\nchocolate was sold out again by 2pm !SAD (T . T)", "author": "Tokibox 6."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Creamy cheese tart. The cream cheese inside of the tart had a bit of tartness at the finish. The crust was crunchy with right amount of sweetness to it. They were small enough so you won't feel guilty indulging it. Highly recommend.", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-10", "description": "I had to try these cheese tarts to see what the hype is all about. The first Bake cheese tart in America? The line is always ridiculously deep so when I saw less than 10 people, I jumped in. They are good, but way too overpriced!! Its worth a try though.", "author": "Samantha D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Big fan of cheese tarts and fell in love with these bad boys!! The crust is baked twice to perfection and the cheese is so soft and light. Haven't yet tried the others but I definitely enjoyed the originals.", "author": "Nara F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Love the cheese Tart and the Brazilian  coffee. I love the cream cheese filling mixed in with custards and how crunchy and fresh the it taste. I would go there again.", "author": "C N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-13", "description": "I was excited to try the first US shop for this Japanese-based chain.  We arrived 10 minutes after they opened and the line still took 45 minutes.  The line was not that long, but the staff are not the most efficient.  Two employees assisted each customer while a number of other employees handled the baking/restocking.  The two young ladies did not have an efficient system going, as one stared at the rest of us while her partner was ringing a customer up.  Why didn't she begin taking another order instead of staring into space? I feel like the line could have moved much more quickly, as it should not take that long to take an order, put tarts in a box and swipe a credit card.  The second employee could begin taking the next person's order as the first employee is finishing processing payment for another customer.  There needs to be better training.  As for the cheese tarts- they are like little pillows of cheesecake clouds nestled in a crispy cookie tart crust.  Both flavors (original and chocolate) are delicious.  They are light and don't make you feel like you just are a ton of sugar and butter afterwards.  I get why these are so popular.", "author": "Bonnie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "I loved trying this! A bit of a wait and the prices are a bit high but overall, pretty good! I would recommend this to anyone visiting downtown San Francisco looking for something new and delicious to try!", "author": "Junkox C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-14", "description": "Thanks for running out an hour before you are supposed to close when you could have baked more and earned more money. You suck bye", "author": "Emily L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-02", "description": "Came here on a Monday night around 8pm debating if I should bust out the $3.50 I could use on a viet sandwich for a single cheese tart that would be consumed in a couple bites. The line was super short, only around 4 people in front of so I figured I should try them so I could move on with my life instead of wondering what I'm missing out on. Tarts were served cold/room temperature, they were yummy, crispy crust, not too sweet and a fluffy, moussey, cheesy filling. But at $3.50 a pop, I don't know if these tarts can justify themselves.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-02", "description": "It's delicious but somehow compares to the ones in Asia (Hong Kong, Tokyo and Osaka), its probably only half as gd. My best cheese tart experience is the Yokohama cheese tart on your way to the noodle museum; a desert to die for. The place here has reasonable short lines, but the tarts are not warm enough and the matcha tastes a little too bitter.", "author": "T G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "It's grand opening today! These cheese tarts are heavenly delicious, and the SF store will be offering a chocolate flavor using chocolates from Dandelion for a limited time only for the SF location.", "author": "Kally C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-27", "description": "Way overhyped!Not worth it for $3.50 a piece bite size cream cheese.Nothing special.So disappointed.I guess this place is a trap.I am not cheap but why so expensive  for an ordinary cream cheese tart? I don't get it.I'd rather have cheese cake from Cheesecake Factory than this one. I think they intentionally understaff so people would get in line and the longer the line,the more people  will get curious and I was one of those who had fallen  prey to this business.", "author": "Garry E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "I was lucky enough to catch this place within an hour of opening when nobody was in line. Their classic tart was so good!!! Everything's already baked so you're not necessarily waiting on the tarts to be made. The cashiers were also super nice and gave tons of napkins!! Overall I'd come back again if there weren't a line. Maybe they'd speed things up if they added a register or two?", "author": "Calvin H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-13", "description": "Not as good as Japan. Extremely guilty hyping these to melanie and she waited 3 hours in line when she could have baked better ones. \n\nSorry Mel :(", "author": "S S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-09", "description": "I stood in line, approx 12 mins., got this fad out my system, and now I remain baffled: Why would anyone pay close to $8 for two tiny (stress on tiny) cheese tarts? They are delicious, no doubt, but not worth the price.  It will be interesting to see if this place lasts beyond the fad.", "author": "Randy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-16", "description": "Poor customer service.  Having been here once before to find the tarts just ok, I decided to stop by again as I was in the mall. I had several full bags and therefore asked if I could have a box and bag for the two tarts I wanted to purchase.  I was told no, that they are only for orders of six.  Fine, I understand.... however, I asked if I could pay for the box and bag, as I literally had nowhere to put the tarts and was planning to take them to share with my husband an hour later.  I was again gruffly told no, so I forewent the tarts without hesitation. A customer offering to pay you extra for accommodation??? Maybe you should allow that???", "author": "Caitlin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "Definitely worth a try. I've came here on several occasions and they were busy each time. The wait isn't that long despite how long it looks but I definitely prefer going on less busier days to avoid a wait. Anyhow, it is on the pricier side, ($3.50 a pop) and although I do think that it's worth a try, I often times become indecisive when it comes to the price. I'm not even a huge fan of cheesecake but these cheese tarts are still pretty good. The inside of it is delicious and so is the crust. The crust looks like it's on the harder side but it's actually pretty good. I'm still waiting on the strawberry flavor!!!", "author": "Cee H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-19", "description": "I first tried this in Taipei, and it was DELICIOUS. The tarts at this new SF location suck. The cheese is barely baked and is super liquid-y and raw -- I even asked them to give me the toasty-looking ones. Seems like they take them out of the oven too early. I definitely won't come back until they're up to par with the ones I had in Taiwan.", "author": "Vicky C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "Went on a Sunday and waited in line for about 10 minutes. I would not have waited in line for an hour like some people did. They are good but not worth waiting that long lol. They only had the regular cheesecake flavor available. The chocolate had sold out earlier. It is pricey, about $3.50 for one or $21 for 6. The crust is crispy and the filling is soft and creamy like a custard. I would come back again when they have other flavors available.", "author": "Aimee E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Very nice, but the line up is too long, about half hour wait.  All the other favour wasn't available at the time I order, only the original", "author": "Kirby L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "I read about this place a while back, but I forgot about it. Till I went downtown shopping, went to get a bite to eat, and saw the line.... oh yeah, I have to try these tarts! \nI got hooked, and went every week now. The line is not so bad during the week, only a few people ahead of me. \nI love the airy fluffy taste, and the crust is crunchy. I like looking at the employees baking the cheese tarts. They are all puffy when they just came out of the oven! So cute! \nI like Japanese sweets, they are not as sweet as the ones here. They are a bit pricey, but they are well worth and less expensive than a plane ticket to Japan!", "author": "lovetoeat a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "Arrived on Monday around 3:30 pm and the line wasn't long like I was expected! Waited 10-15 mins. \n\nPrice: $3.50 for 1 \nQuite pricy imo. (-1 star) \nWould not come back unless I'm taking my family from out of the state on a tour guide.\nDo see myself ordering it in Japan for a cheaper price! \n\nService was quick and friendly. Some workers don't smile. LOL. \n\nIf the line is long, I recommend coming when it's not or when the hype dies down! Not worth waiting more than 15 mins for!", "author": "Michelle E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-24", "description": "This place has a long  line. and has one cashier and the lady whos packing the cheese tart so slow and looks like she hates her job. barely smile. they should hire people like Chipotle people are fast at least! i dont know why people waiting in line for 30mns  when theres nothing really special about the tart! i bought 8pcs and its $30 something and they dont even give you mall discount. anyways i dont think its worth of waiting in line for 30mns for this tart.", "author": "Lara J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "My sissy & friend each picked up a half dozen (less than 16-minute wait @ 11am) today before we met up for a birthday brunch - we had a few for dessert after our lunch and these original cheese tarts did not disappoint  - light & fluffy and not too sweet, with a deliciously crunchy cookie crust - must get myself some next time", "author": "Mia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-22", "description": "I remember seeing this place in Hong Kong with lines that stretched almost a whole city block in an underground mall! I was excited to give this place a tray in their new location! I got there around 2:30p on a Monday afternoon, and waited no longer than 10 minutes to get the goods. The flavor of the tart was excellent...I especially enjoyed the crunchy, buttery crust which was extremely delightful. \n\nHowever, the tart filling was really running and watery though, and unfortunately, not even warm. I got 4 tarts, but only 2 had the signature caramelization or browning of the top. I went back home and put them in the oven for 10 more minutes and then it looked perfect. The size was also a little smaller than expected. I think they need to box much faster to make sure the tarts get out warm. I was a little torn to dock one star off, but if they are charging top dollar for these tarts, I expect a much higher standard. They are still pretty new, so hopefully they find their rhythm and improve over time. I will be back though to satisfy that cheese tart craving!", "author": "V C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-09", "description": "I swear the workers here do not understand the word lighter. Before letting them know how many cheese tart I wanted I ask for the lighter colored cheese tart, I was thinking about reheating them at home I didn't wanted to burn them in the process. Wished they would have just said we have to pick from the tray in front of us, I would understand and wouldn't have brought a dozen an only order what I would have eaten there. Taste wasn't all there but that may have been my frustration.", "author": "Stephen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "So good! The crunchy rich cookie combined with the fluffy sweet cheese cake is so good!! Love this place and I am a major cheesecake snob. LOL . Can't wait to come back again for a seasonal flavor . They ran out of strawberry when I came. Why can't they just make more !!!!???", "author": "Miss Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-16", "description": "First the line was too long. The was price was too pricey. The chocolate was a little rough when I got it. The original tart was okay", "author": "CM A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Absolutely the best cheese tart ever!!!\nSo glad that we finally have them in San Francisco too\nWorth every $$$$", "author": "Jane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "First time been here, after over 40 mins I got the order, I order their one box classic one and one box their special one. Since i personally really like cheese, after I try it taste supper supper yummy. If you guys want try this spot, please get ready for wait, cause they only have 5 ppl in front of the store to work. Highly recommend!!!!", "author": "Yueming G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-03", "description": "Pass by a few times with super long lines didn't get what all the hype was about . I would say to avoid lines don't go on weekends or when there's an convention in town line is super long . Go on a regular week day the lines are shorter . Decided to try the cheese tart . It was ok didn't get why all the hype . It's just a bake cheese tart , would rather have an egg tart instead.", "author": "Hannah M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-30", "description": "Very expensive cheese tarts...they're not worth the money nor the wait in line, in my humble opinion. I take the BART home from the Powell station and walk past this shop everyday and the line seems to be getting smaller and smaller by the day. Hope they can maintain themselves.", "author": "Danny B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-04", "description": "One star based on their management. I've been in line literally 3 hours+ their management suck! Only two cashiers available while there was 200+ people  waiting in line. They work super SLOW like 10mins per one customer this is ridiculous! I kept seeing people who wasn't in line keep coming up in front and just ask for free tote bag or the gift cards without the ticket! (which they give out to first 50people who came at 10am) and the guy just gave it to them like that easy.. he even say to them I'm not supposed to give it to you guys because its for people who've been waiting in line.. but yeah he just gave it out like that. So if you want gift cards or free tote bag just stand in the front and pressure them they will eventually give everything to you don't bother stand in line. RIDICULOUS..like really!?!?", "author": "Shayada L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-10", "description": "Hi. I'm a huge fan of your cheese tarts. I was extremely exited when I heard you had opened here in sf. I'm from San Jose but your cheese tarts are absolutely worth the drive. I came here last week and bought three boxes for friends and family. They all fell in love. I loved them so much that I came back today to purchase 3 more boxes! Although these tarts are amazing, I am really saddened by the poor customer service provided by your employees. Both times during my visit, the female employee had a bad attitude. She did not greet me or smile. She looked so unhappy the whole duration of my visit. She even gave me the meanest look when I asked for a receipt. Both visits were around 7-8:30 pm. I'm sure that my friend and I are not the only ones that have encountered this. I've looked through some of the yelp reviews and there are several customers complaining about the bad attitude and poor customer service. I hope that you'll read this and forward it to your management team. I refuse to support an establishment that does not make me feel welcomed or respected. Thank you so much for your time.", "author": "Kate W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-06", "description": "If you arrive before it opens, don't expect to be served for another 25-30minutes.  Workers do not have any of these tarts ready when they open their store.  Guess the owner doesn't care to have their employees arrive a little earlier to heat up the oven to Bake these tarts.  Our Cheese and Chocolate cheese tart we're not warm.  The flavor itself me tasted good but it would probably taste a lot better heated up then room temperature.  In my opinion, this doesn't have the quality like Pablo in Tokyo, plus Pablo is cheaper.  Owner is Probably passing the shipping charges on to the customers, thus the higher cost for these tarts.  Too much hype.", "author": "Jasper B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-12", "description": "SOOOOOOO not worth the wait or the price. $3.50 a pop is waaayyy too high. The only saving grace of this tart is the tart part because it's actually crispy and not too thick since the texture is dense. The cheese cream can totally be enhanced with a fuller cheese flavor and feels like you're being cheated out of your money because it tastes like goldfish cheese or handi-snacks or some other artificial cheese flavoring. The cheese cream is also way too drippy. I've had a version of this in Malaysia from another Japanese brand and the cheese part was actually more custardy and had a major punch of flavor. Save your time and money, don't be fulled by the line!", "author": "G H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "The wait is super long. I can't complain about the cheese tart other than the store only have two flavors-chocolate and plain.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-12", "description": "The line was about 1 hr wait on the grand opening week. Taste of the tarts are just medicore.", "author": "Ruthie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "The cheese tart are really good although there is always a long line that is about 30-45 min wait! They should have 2 cashier instead of only one which I think the reason for the long wait & two employees to box the tarts", "author": "Tirso D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-11", "description": "Very inefficient workflow. Takes about 1.5-3 mins per customer.  They wait until you order to pack and the cashier also waits for them to pack.  They could have prepack and just hand to customers instead of waiting for the order.", "author": "P L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-18", "description": "Too pricey, Overrated, Overhyped. Yes, the slowest production line ever! Ridiculous!", "author": "Mich G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "Tarts were tasty for sure . Bummed that they seem to run out of the chocolate ones pretty fast. Haven't tried that one yet. $ 3.50 for one seems like a lot but that's the cost these days I guess .", "author": "alex p."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-05", "description": "I thought it was so good when I saw a long line. There was a sign for strawberry and original cheese tarts. I asked for the strawberry tarts but they said sold out and would have them at certain time. So I got the original for $3.50/piece. It was disappointing for me because it was expensive, small, cold, and overly sweet for me. I really wanted to try the strawberry and thought it would taste better so I came back for the second time another day. I saw them taking it out of the oven and I thought I could order them warm. They wouldn't sell it to me warm and told to come back a hour later after it cooled. I don't understand why they order so little of other flavors if there is a demand. If you  can order so many of the original tarts, why can you order more of the other flavors. Instead, they made it difficult for customers to buy the other flavors and created this hype. For the price and the taste, trying once it is ok but It is not worth it to come back frequently to get it as dessert.", "author": "Anonymous B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-18", "description": "And why are these good!!!???  All hype!  Since I was downtown, I decided to try the tarts.  The line was up to the Bart doors, 1/2 hour wait.  Not very efficient service.  One cashier and one person packing the tarts.  Other people:  1 folding boxes, 1 walking around (maybe on break), and 2 getting the tarts ready to bake,  When busy, one of these people could help pack the tarts so the line moves faster.  The tarts aren't made there.  I saw cardboard trays of tarts come out, they brush something on top, put them on cookie trays and bake.  Why do you need 2 people doing this when you only bake 3 trays at a time!!!  The person behind me said eat them fresh, while they are fluffy!!  Got them home and cut one original in half.  The filling oozed out a bit where's the fluffy!!  I texted a friend and asked how was the filling suppose to be because it was more like pudding.  She said that's it.  Again, where's the fluffy!!  Cut open a chocolate tart and it was more firm.  I think the original was not baked long enough!!  My hubby says the filling tastes like the filling in a cheese danish!!!   Not worth the price!!  If you still want to try it... wait until the hype dies down!!", "author": "M. K."}
