{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Conveniently located next to the flower market. Simple selection of breakfast options. I appreciate a menu that isn't overwhelming. Ordered a short stack of pancakes. They were hot and fluffy. Couldn't ask for anything more. Waitress was friendly and attentive.", "author": "Jenn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "San Francisco native here and I have NEVER been here. Shocker. I'm so glad I finally tried this place out. Breakfast was impeccable. Fluffy pancakes, warm syrup, crisp fatty bacon and perfectly cooked over-medium eggs. Toss that in with endless refills of coffee and a server who was super on top of everything, no wonder this place has been where they are all these years.", "author": "Sharon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "I don't even have words for how great Ernesto is!!!! Such great customer service all the time!!!!!! If I could adopt a grown up, I'd adopt Ernesto. Great spirit, great vibe!", "author": "KT D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "Food here is actually pretty amazing and it's nice to have a small diner like location so close to downtown in San Francisco. However, the only thing keeping this place from being a 5 Star place in my opinion is the time you have to spend waiting. Generally for lunch, the speed is pretty fast but when it comes to the early breakfast hours this place runs at a snails pace. Even for a cup coffee expect to wait about 10 minutes. That being said, the food is definitely worth the wait.", "author": "Anthony O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-03", "description": "Coffee is the reason they get 2 stars. Just got done eating a burger which was the most basic thing ever, luckily it we only like $11 but incorrectly layered the burger on top of the veggies which made for a pretty soggy bun. Then the fact that it's just a generic frozen patty resembling something from foods co with no seasoning really was unappetizing. At least i cam way the fries and drink my monster.  On another note staff is very nice and friendly", "author": "Max U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "Great American breakfast's and lunch's in a spacious open classic cafe setting. Even has a counter section overlooking the kitchen area ala Joe's restaurants. \nHard to beat especially for the area and a perfect place to end up after shopping around the flower mart.\nBon Appetite!", "author": "Benfam3 .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "+ It feels like a small neighborhood spot\n+ Fast service\n+ Nice waiters\n+ Goat, spinach omelette was delicious, but mostly because it came with a lot of goat cheese.", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-23", "description": "Service was fast, food was delicious and thefe was plenty of it. We stopped by after leaving the Flower Mart. Would revisit for sure!", "author": "Lindsay J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-24", "description": "My husband and I ordered 2 different foods, but you couldn't tell from looking at our plates. Both had a side of friends and the food hidden inside the 2 same types of bread.\n\nHe got a burger which tasted and looked like it was from a bag of frozen patties. It wasn't even in burger buns.\n\nI got a mushroom & sun dried tomato sandwich and that was a real disappointment. Someone else here left a review explaining how bad the sandwich was and I wish I was it before I ordered it.\n\nThe food was disappointing, but on the bright side, the food came out at a good speed and was hot.  There was a lot of ketchup available. The staff was very friendly and helpful. The restroom was clean too.", "author": "JCano C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-23", "description": "Old school diner on the border of tech land, feels like you're in the burbs! Huge joint, conveniently by ritual and mint for yogi's. Priced just right, about $20/ head all in for brunch. If you're in the area, swing by for the OG atmosphere, don't make a trip for the food.\n\nPro's- Awesomely decorated in old world fashion, think classy but authentic Johnny Rockets. Family owned business feel, one of those multigenerational assets. Opportunity to sit at the bar and eat some eggs Benedict feeling like a chill blue collar dude instead of a douchey yuppie.\n\nCon's- I'm a born and raised diner man from Staten Island, the food and coffee would not cut it where I come from. Eggs Benedict got that trace of vinegar, the coffee was mediocre.", "author": "Roger L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "My favorite spot to get a breakfast sandwich when I'm buying my flowers in the market. Order a few minutes before I'm ready to leave, grab a coffee and I'm set for a day at the flowers shop ( I would recommend even if you don't go to the flower mart).", "author": "Tammy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-12", "description": "I dont know of any place else like this near here so I visit just by default. The food it is all do-able if your expectations are mid-level or lower and the price is good.\n.\nToday the service was awful. The table next to me gave up and just walked out and I was about to join them when I finally received service.\n.\nI visited the restroom after ordering and found urine all over the floor; it was not worth washing my hands before eating. Is it so difficult to properly staff this place?\n.\nAt $11.00 I like the tripple decker Market Club Sandwich. It is inconsistent here as today I have the bacon that was missing last time but the toast was very, very oily. I am however grateful that it arrived hot. Skip the $3.75 OJ its awful juice for mixing bar drinks.", "author": "Caesar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "First class breakfast and I bet lunch is good,too.  Sets a new standard for friendly service.", "author": "Rik B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Good food! Great weekday specials! Nice ambiance. I recommend the Tunamelt , spinach mushrooms , goat cheese omelette , Chicken Piccata, Pene Pasta with Chicken and Mushrooms , Spaghetti with Meatballs French toast, Chinese Chicken Salad, Chicken Caesar Salad and more. Brett is very nice and good looking server :) perfect place for a private party!", "author": "Gigi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Finally had a chance to add a review for the French toast that I had mentioned about seven months ago! I've had them several times since, but paperwork doesn't take precedent over good food ...  I had the full stack (3 slices vs 2 in short stack) and the quality was consistent with previous orders. Toast was hot, with butter and just a bit too much powdered sugar. However, the toast was well seasoned and kept its shape when cut with the table knife. A side of scrambled eggs completed the protein and for under $15 a delicious noon time breakfast was to be had. Service, as always, is prompt and attentive, with friendly staff quick to remember customers quirks and even first names ! Very impressive considering the number of customers, and the number of familiar faces we saw speaks volumes to the quality and value of the meal and entire dining experience. Will return yet again ...", "author": "Mark K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "An excellent place for breakfast at lunch! The service is top notch and food is yummy and filling!", "author": "Moni M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "Really yummy place to have breakfast where they have all kinds of options like pancakes, eggs Benedict, and toast. They also serve you as much coffee as you want and can even take a cup to go if you would like too. The guy who runs it is very nice I just wish he had more people helping him cause he seemed a little stressed having to do most of the waiting himself. Over all very good place for breakfast though. \nI had a cheese omelette and it was so good and gooey just the way you would want it to be. The toast that came on the side with it had a lot of butter but was very good as well!\nDefinitely try it if it's in your area!", "author": "Itzak H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-24", "description": "I've lived across the street from this place for about four\nMonths, but only recently gave it a try. It's only open until 2ish, so sometimes it's hard to get to. The restaurant itself is huge, but kind of has that old, mothball kind of smell. It could definitely be redone, but it could also just be part of its character. We decided to sit outside for fresh air. Pets are welcome outside, which is very cool. I got my all time favorite eggs Benedict, but was pretty disappointed. I agree with the other review on here - there was a very strong vinegar taste that I wasn't used to. It just didn't taste right, and kinda ruined it for me. \n\nGo here if you're looking for some really basic and fast food, but I'd suggest going elsewhere if you're looking for more.", "author": "Gina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "We live across the street and often come for breakfast on Saturday. Perfect hangover food! Always hot coffee and plenty of it. What we really like best are the owner and his son, they always make us feel at home. \n\nThe corn beef hash and eggs is my go-to, and it reminds me of all the East coast diners from when I was a kid. Sometimes I go the healthy fruit, yogurt and eggs route.... They have whatever you need for breakfast or lunch.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Went for a birthday party and had a wonderful time. I had a club sandwich with fresh fruit and my friend had the Philly cheese stake sandwich and ate half and took the rest home for dinner.  Our server was Brett was attentive and very helpful.  The owner Pat is a very hospitable and makes you fill welcome.", "author": "RICHARD M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-23", "description": "I stumbled upon this place when I came here for solo brunch - my girl friend lives nearby and she wasn't planning on eating. I am somehow always hungry. \n\nI got the French Toast w Fresh Strawberries (full stack 3 slices, instead of short stack 2 slices). Honestly, short stack would have been sufficient but it was a dollar difference...\n\nThey have tables, bar and I think also booth seating. Spacious place. Nice staff. Cute waiter. No complaints!\n\nIf I could recommend anything for the business to improve on... Maybe remind your staff to greet people when they come in? I came in, a staff person looked at me and continued on his way. I saw that he was busy and didn't take offense to it but it was weird for a moment because I was about to greet him until he looked and walked away. Awkward... Lol.", "author": "Tammy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "I had a surprisingly good experience at this cafe/breakfast diner. Food was good and the service was excellent. Our server's name was Patrick. His pleasant and infectious demeanor kicked our day off right.", "author": "William A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "I am very impressed, for years we have been looking for a good restaurant for breakfast waiting up to an hour and the service is not good or the food ....this breakfast restaurant it's the best in service and the food they also customise it very well I heard someone order grilled bananas and they were not on the menu and the server was very nice....I have almost tried the whole menu, but customise it my self and they do it for you....I will say no more I think you should try it.....I really like it.", "author": "Elizabeth P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-26", "description": "The location is convenient for the hunger that early morning flower shopping brings, to be honest it should be more on the 2 1/2ish star side, but I'm feeling generous tonight. \n\nThe atmosphere is pleasing, classy dark wood booths, lots of light and comfortable seats (and go figure they always have nice fresh flowers). The food is a good kind of average, reasonable and dependable classics like eggs benedict and pancakes. Nothing to make a lasting memory of but satisfying and filling, bit it is on the pricer side for average. \n\nMy biggest complaint is that the service is on the not-so-cool slow & inefficient side and if you're feeling hangry this is not a good thing.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-20", "description": "Very good menu, not too busy, pleasant and quick service, priced reasonably, fresh food, pretty quick, clean.\n\nI wasn't expecting such a great experience... Its a hidden gem for lunch.", "author": "Lyndsey C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-21", "description": "I paid 7 dollars for a salami sandwich which came with 4 slices of salami. It wasn't even enough to cover the bread.", "author": "Donnie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Bechelli's is the best spot to get breakfast - especially before a Giants game! The staff is extremely friendly and the food is DELICIOUS! Highly recommend the Bechelli omelette! Not a better place to start your day!", "author": "Alex C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-28", "description": "Not quite noon on a Thursday, walked in and straight to the counter to eat alone. Hardly anyone was in the restaurant. Everyone was incredibly friendly. Ordered the South of the Border - corn tortillas with scrambled eggs, onions, guac, sour cream, etc. It was okay....really didn't have much flavor, so I'd like them to work that out. The fresh fruit side that accompanied it was really fresh....strawberries, grapes, cantaloupe and honeydew. I ate it all except the honeydew, and as the server cleared my dishes, commented \"Oh you don't like that melon? Next time I'll remember and not put it in.\" And I bet she would remember!", "author": "Laurie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-12", "description": "Had breakfast here today, while waiting for my motorcycle service at SF BMW a block away. Not many food options in this part of SOMA. Had a Spanish omelette and coffee. Food was good, price was fair and service was fast and friendly. May have helped that it was not crowded. Overall, while I wouldn't call it a \"special\" dining experience, it was good, and next time I'm back at the bike dealership, I'll probably stop back in here.", "author": "Fred E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-06", "description": "I have mixed feelings about this place...\n\nOn one hand it is really gorgeous on the inside. Most of the furniture is made of dark wood, and their settings have rolled-up napkins with some flowers from the market next door. The bar itself is stocked with fine wines and hard liquor, and was oddly busy for a Sunday morning.\n\nOn the other hand the food was really not that great at all. The first time I went I had a stack of strawberry pancakes. The strawberries were oddly soft, and the pancakes were really thick in a bad sort of way. I expected them to be much fluffier, but instead they didn't even absorb the syrup I poured over them. The second time wasn't much better...I had a chicken sandwich that came out burnt and dry, with an orange juice that was way overpriced.\n\nMakes good hangover food. Not a great brunch date.", "author": "Dennis R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-13", "description": "For the rating it is more 2 1/2 stars.  \n\nI walked in and someone seated me after a minute or two and I was given a menu.  They serve breakfast till 2 which is great if you are a breakfast lover like me.  The café was quiet and there were a few other people there at around 12:30pm.  \n\nI ordered an avocado, bacon, and jack cheese omelet that came with choice of bread and potatoes.  It tasted fine but the omelet structure was a bit unsatisfying.  The egg of the omelet was basically cooked flat then wrapped around the filling.  Also the avocado, cheese, and bacon were all in clumps and not very mixed in.  They did give me at least half an avocado though, so that was good.  The ingredients inside my omelet were just too separate and not evenly spread for my liking.  Additionally the egg of the omelet was too overcooked for me.  I tried the potatoes and they were fine, nice chunky wedges of potatoes.  Their service is good, their waiters were very attentive and nice.  Overall not terrible, but I probably wouldn't come back.", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-22", "description": "This place has good service and it's the only restaurant in this particular SOMA dead zone.... What choice do you have? Just don't get their salads. I'm currently eating the Chinese chicken salad with Italian flavored chicken. Rosemary does NOT taste right with sesame oil.", "author": "L. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-18", "description": "I end up here multiple times throughout the school year.  They are conveniently located across the street from the Academy of Art building as  opposed to much of anything else blocks away.  I can get a scrumptious breakfast sandwich with fresh eggs, sausage, American cheese and bacon on a toasted English muffin with a fresh ground coffee beverage in the morning or a juicy chicken pesto sandwich on sourdough for lunch.  Their soups are hearty and savory for a cold brisk day and always come with a sweet roll or slice of sourdough.  Their roast beef sandwich is tasty on a fresh sourdough roll and even better toasted.  So far I'm stuck on eating these three things to try others of their food.  Next time I order I will try to fight these cravings and step outside the box.\n\nI also appreciate the fact that I can call in my order, pick it up in less than 20 minutes and take it back to school to enjoy while I work or mess around on the internet.   I doubt I will stop coming here once the cafe inside the school is open.  Academy of Art couldn't possibly top the quality of food served here.  Besides that, the smiling people at the counter here are most polite and friendly every time I visit!", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "We eat out virtually every Saturday and Sunday mornings -- have for years.  Long time Saturday favorite was Bechelli's on Chestnut, then about ten years ago we switched to Flower Market.  Until July 2014, when we fled from San Francisco, we  had a regular routine.  During berry season, husband drove by farmers market in the Ferry Building, I leaped from car,  bought week's supply of berries from favorite farmer (McGinnis).  Then on to Bechelli's.  They never minded that during raspberry season, I carried in my own box of razzies which I had with their french toast.\n\nVery nice  busboy brought lattes to the table before we were settled in our chairs.  Their flatware is dinner-sized.  I like smaller forks for breakfast.  Without my asking, I  was delivered a smaller fork.  Servers were always pleasant, and bright enough to learn our idiosyncrasies very quickly.\n\nOver the years we tried a wide range of breakfast and lunch items -- not brilliant, but consistently very good food, nicely served.  Flower Market is one of the two or three breakfast restaurants we use to gauge the places we're trying in our new home, and we do miss it.", "author": "Monica E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-30", "description": "We had burgers catered at work from here.  I had a loaded burger with bacon, avocado, onions, mustard, grilled onions, mushrooms and it hit the spot.  I went back for seconds and tried the veggie patty and that was good too.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-11", "description": "This place is so-so, but it has GREAT parking. Large menu, diner-type foods. Ambiance is just okay. But if I need a meal without a lot of hassle, and I don't want to get fast food, this is the next fastest thing...at the right times. Obviously you don't want to go here during flower market morning hours unless you're there anyway for flowers. \n\nI had a Denver omelette with avocado added, which was just okay. At least they weren't stingy with the avocado when I upgraded. The potatoes were chopped and okay, but I would have preferred a hash brown (who wouldn't?)\n\nOverall, this is a place for convenience only. And that's not such a bad thing. Sometimes you just need expedient nourishment. That's it.", "author": "Karen Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-20", "description": "This restaurant is very convenient if you want something to eat after going to the Flower Market. We ate lunch around 12pm and there were plenty of seats.\n\nI ordered the \"South of the Border\" breakfast special. It came with two corn tortillas stuffed with an omelet with cheese and green chile. The tortillas were topped with salsa, guacamole, and salsa. The breakfast came with a bowl of fruit. The corn tortillas with egg wasn't bad but I did not taste the green chile. It seems like I could have made this breakfast at home. In addition, my bowl of fruit had a piece of hair! So gross. We asked for another bowl.\n\nMy fiance had the mushroom with spinach omelet. It also had goat cheese in it. There is a generous portion of spinach and shiitake mushroom. The description had caramelized onions, but the onions were a bit raw still. The potatoes were pretty good.\n\nBreakfast is served until 2pm, so you can definitely eat brunch.\n\nThe bathrooms were really dirty. The toilet bowls looked like they haven't been clean in a LONG LONG time. Yuck. Avoid if possible.", "author": "Jackie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-26", "description": "Ok so while I really appreciate a diner-like atmosphere and food...everything we had was really not good. My eggs were raw and the fruit that came with the fruit bowl was in rough condition. I will most likely not come back. \n\nThe only reason this place is getting 3 stars and not 2 is because our waitress was really nice and they kept refilling our coffee.", "author": "Sasha B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-14", "description": "This is another restaurant that my boss really likes to take us. I'm convinced he thinks there are only two restaurants in the vicinity of the Hall of Justice: Flower Market Cafe and Live Sushi Bistro. While this is clearly not true per Google maps, I've been here at least four times in the last month. It has always been a three-star experience--at least it's consistent in its averageness.\n\nI've had the crab cakes, clam chowder, Market salad, Market burger, and Market cheesesteak sandwich. I keep thinking if it has \"market\" in it, it must be pretty good--this is only true because the rest of the menu isn't very memorable. The best thing I had here was the burger--big, juicy, satisfying (though certainly not a Marlowe burger). The salad was balanced and tasty with its mandarin oranges, avocado, dried cranberries, pecans, goat cheese, and raspberry vinaigrette. I would recommend adhering to burgers and salads--this restaurant does the basics well.\n\nAgain, I'm not crazy about the two places on my boss's radar, but they're decent choices for working lunches. In my final week of work (next week!), I hope to turn my boss's attention to Citizen's Band, SO, or Basil Thai. We will see how persuasive I am after three years of law school. ;)", "author": "Liz T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-23", "description": "Came by for lunch.  Service was slow at first but got better.  Food was good and they had large portions.  Nice place with nice people - I would go back.", "author": "Drew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-25", "description": "Just back from an extended engagement at Bimbo's 365 Club, here is the dulcet duo of Chris Daly and Gavin Newsom...give them a hand, ladies and gentlemen...\n\nGAVIN: \"You don't bring me flowers...You don't sing me love songs.\"\nCHRIS: \"You hardly talk to me anymore...when you come to the Board meetings...after combing your hair.\"\nGAVIN: \"I remember when...you couldn't wait to veto me...used to hate to agree with me...now after stabbing me in the back.\"\nCHRIS: \"When its good for you, Gav...and you're feeling all right...\"\nGAVIN: \"Will you just roll over and shut your fat mouth...and you don't bring me flowers anymore.\"\n\nI don't think they have karaoke at the Flower Market Cafe, but maybe they should. That way, they can ward off the Academy of Art who still wants to take over the space for their sculpture studios. Now I'm all for the artist...but doesn't the Academy have enough property all over the city? Their signs are, like, everywhere. Can't they sculpt in the Tenderloin and leave the pretty flowers alone?\n\nGee, I haven't even tried dinner here yet. I never think about 6th and Brannan as an intersection I want to hang out at in the evening, but ti sounds like they have quite the trattoria set up. Me? I came here for lunch with my friend Mary....and even though I've lived in SoMa for five years, I have to admit this is the first time I've tried this spot. It's quite popular, and today being such a nice day, the patio section was quite a nice treat.\n\nI don't think they have that exciting a lunch menu - sandwiches, burgers, salads and pizzas - but I managed to order a $10.95 Flower Market Salad in a momentary lapse of sound judgment when I actually considered healthful nutrition over my obsession with appetizing fats and carbs. I didn't have to worry because the ingredients were quite fresh-tasting - mixed greens, Mandarin oranges, avocado slices, dried cranberries, candied pecans and big clumps of goat cheese - all of it lightly tossed with a raspberry vinaigrette. Damn tasty for cow food.\n\nI should come back just in case the Academy of Art has its way with the property. That would be a shame because a flower market is just a good thing for a city to have. Besides, I hear Gavin and Chris (the cafe is in his district) are coming back for an encore engagement ...and they need more cowbell.\n\nFOOD - 4 stars...fresh salad does a body good, even mine....but need to come back for a little mambo Italiano\nAMBIANCE - 4 stars...actually pretty nice...not sure why I'm so surprised\nSERVICE - 3.5 stars....a bit slow on the uptake but serviceable\nTOTAL - 4 stars...\"Well, you think I could learn how to tell you goodbye...'cause you don't say you need me...you don't sing me love songs...you don't bring me flowers anymore.\"", "author": "Ed U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-28", "description": "Mushroom, sun-dried tomato, and goat cheese sandwich on a toasted sourdough baguette. \n\nHow bad can you screw up a sandwich? You just pick things that taste good and you put them between bread.\n\nThere is no excuse for what they brought out.  I actually went into shock when it was placed in front of me. \n\nFor those of you who want to sample this horrible sandwich yourself, don't bother going to the Flower Market Cafe, just do this:\n\nGet some dehydrated tomatoes- not to be confused with the yummy sun-dried tomatoes soaked in olive oil (those have flavor, so they must be avoided)\n\nThen get some dehydrated mushrooms- don't bother getting anything fancy like shitakes or criminis, because once again you might add flavor.\n\nNext get yourself some goat cheese. Most goat cheese has flavor but don't worry you will be removing all of the flavor in the next step.\n\nFinally put all of this in a pan you don't care about over a medium-high flame and WALK AWAY.\n\nGo see a movie, do some paperwork, organize your closet, whatever. Just make sure it  takes a good chunk of your day. (4-6 hours)\n\nWhen above activity is complete, come back to the pan. Observe, there is no moisture whatsoever. In fact the goat cheese is now a powder, which means you have successfully removed all the flavor from something that started out delicious.\n\nUsing a butter knife scrape the contents of the pan onto a stale dry sourdough baguette and garnish with rubbery cold fries.\n\nEnjoy!\n\n***I have included a picture of this fabulous creation. Taken only minutes after my extreme disappointment.", "author": "Mia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-18", "description": "I passed this place a bizillion times getting onto 280. Good place to get breakfast and brunch while at the court house nearby, or at the Flower Mart.  I came today with a bunch of friends and we easily sat at a table for five. They have the usual omelets, eggs, pancakes and breakfast food. I had the bacon, avocado and jack cheese omelet. It came with a ton of potatoes which were seasoned very well. The omelet was tasty and in fact so much I couldn't finish it all.\n\nAlthough it was good for breakfast, I wouldn't come all the way over here just to eat at this restaurant. But considering the options around, this was the best place to go.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-27", "description": "On a whim, stopped at Bechelli's because it was convenient to a later morning activity, and so glad we did!  First, the waitstaff could not have been nicer, and the coffee (a morning must have) kept flowing!  With three of us, the buttermilk pancakes (nicely sweet), poached eggs with roasted potatoes (perfect!), and South of the Border tortillas (spiced perfectly for the more adventurous palate) filled the need for nourishment and a place to enjoy conversation.  The restaurant was nearly empty at 9am, but according to the waiter, had been bustling an hour earlier with flower market workers and early shoppers.  There's nothing luxurious about Bechelli's, it's comfort food and caring staff in an almost diner-like setting.  This is a perfect spot to enjoy before or after a visit to the flower market, located just behind the restaurant - that too, is a SF gem!", "author": "Cheryl N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-29", "description": "I had a cheeseburger today. Wow. Totally worth it. I was pleasantly surprised by how awesome it was. You have a choice of side...I say skip the fries, they are horrible and cheap. I do say go for the fruit bowl. I've gotten it a few times and it's so fresh and tasty.\n\nI regretted getting the fries today. My first and last time.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-26", "description": "I love this place! I only got coffee and dry toast while i was waiting for a flower arrangement and trees to loaded into my rental and normally I feel uber guilty ordering almost nothing but the server was so friendly and didn't let it bother her that I left her a $10 tip for not immediately suggesting I sit at the bar or give me attitude like my servers would do at my work.\n\nThe mocha was fantastic and the fake whip cream mountain was a joy to destroy. Very nice staff and a lovely decor. It's a hidden little gem.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-24", "description": "Less than a two block walk from my workplace I've eaten here countless times for breakfast but only recently have I started to buy lunch here as well.\n\nSome of the hot sandwiches are a bit average both in portion size and in taste, but I think their Half Pound Burger is excellent.  Unless you tell them otherwise the burger is grilled up medium rare with pink juices flowing throughout your plate.  Grilled onions and melted jack cheese is piled on top of the oversize burger which is served on a French baguette.  What caught my attention on this particular burger was the good grilled meat flavor of the burger.  It didn't taste like the oily ground beef that can be experienced at so many hamburger eateries.  This was good grilled beef taste like you get at home from your own barbeque.  The sandwich comes with very good shoestring fries.\n\nI did mention breakfast also.  My employer has me working a swing shift these days so I don't get to have breakfast here too often anymore.  The omelets were always among my favorite things to order; big three egg omelets with lots of stuffing, red skinned potatoes and the toast of your choice.  The one breakfast item I've missed the most ... that would have to be the golden Belgian waffle with fresh strawberries, a dusting of powdered sugar and whipped cream.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "Very cute breakfast/lunch spot.  Prices are reasonable and the service was top notch.  I had the grilled marinated chicken breast sandwich with guacamole, tomato, lettuce, pesto, cranberries, and Jack cheese on grilled sliced sourdough bread.  soooo yummy!  The fries seemed very fresh as well.  I highly recommend this place!", "author": "Nancee N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-01", "description": "I've only had their Flower Market salad and it's really good! They have this amazing raspberry vinegarette dressing - it's not too sweet and it's light, unlike Caesar dressing. It has avocados, walnuts and goat cheese, 3 ingredients that I looove in my salad. :) I also ordered an Arnold Palmer, which wasn't as good as some other ones I've had before. That's weird, since it's just half iced-tea, half lemonade. They fresh squeeze their orange juice! \n\nThe restaurant is spacious, and the staff seems very friendly.", "author": "Christine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-15", "description": "I got the benedict and it was great - my gf got a sandwich and enjoyed every bite! All in all the staff was busy but friendly. I thought it was a little pricey but it made me forget about jury duty for 30min and the food kept me going till dinner time! I plan to visit again soon (maybe tomorrow) so if need be, an update will be posted soon! I would go there again and recommend it to friends, so to me, it is more than A-OK!\n\nFYI I did visit today (10/16) and it was just as good if not better (since traffic was light this time around) than the last time - I highly suggest you all try this place out! It was far from dry - in fact it was very moist! If you enjoy the benedict - try it with sundried tomato. It is great!", "author": "Bella B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-10", "description": "12 zendeskians + diner food = a frolicking good time", "author": "Helen Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-11", "description": "I asked for a Reuben. I got wheat bread, corned beef, tomato and lettuce. Only. \n\nFart sound.", "author": "Mike I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-14", "description": "Bachelli's is convenient for me because of the location, and the food is always good. The service can be so-so sometimes and the fact that they close their doors at 2pm can be a disappointment. The prices for the breakfast items are reasonably priced, but the meals from the grill can be a bit higher than expected.\n\nFood Quality - 4 stars\nService - 3 stars\nConvenience - 2 stars", "author": "Jason H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "In all the years I've lived here, never eaten at this place until a brunch this past weekend.  We were there a tad later than the usual breakfast crowd, so it was a real pleasure to have most of this cavernous place to ourselves.  Quiet conversation and a window seat.  \n\nI was expecting really greasy spoon food and it really was not.  Saw linguica on the menu and knew I'd have to have it.  Even over bacon!  Two eggs over medium, potatoes, english muffin and linguica.  It was a fabulous breakfast.  NOT at all greasy, the breakfast was perfectly cooked.  A companion has the chicken apple sausage and waffles and declared them really delicious.\n\nDid I mention filling?  It was a HUGE plate of food. \n\nThen we stopped and got some flowers for the apartment and a couple of plants.  what's not to like?\n\nIf I'm in the area, I'll come back.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-14", "description": "I must really like \"local\" places, which really fits this restaurant.  My buddy was busy getting a new car and we were supposed to meet for dinner.  He was South of Market while I was up near Twin Peaks.  Gee... where can we go where a) it's not far from both of us, b) parking will be easy, and c) the food will be fresh and with a decent selection.  That's how we met here.  I called to make sure they were open as I remembered that they only open for dinner three or four nights a week.  When we entered the restaurant, the owner Mark immediately said, \"I thought that was you on the phone\".  Gee... is my voice that easy to recognize?  We waved to the chef Sal in the kitchen (one of the original cooks/chef of Mama's... yes, that Mama's).  Because my pal is on a special diet, we needed to make sure there was a variety on the menu.  We ordered the following:\n\nHim                                                         Me\n\nHouse salad - standard                     Cup of New England Clam Chowder\ngreens with tomato and light             - decent flavored with plenty of bacon\ndressing                                                bits and clams\n\nCup of Split Pea soup -  I                    Chicken marsala, substitute Rigatoni\nalways think of the Exorcist                (special with NY Steak dinner)\nwhen someone orders                        instead of veggies or potatoes - I'm a\nthis.                                                          sucker for mushrooms which made\n                                                                   this fine with me.\nGrilled Swordfish with red\npotatoes - looked healthy\nalright.\n\nSince I was heading to Alfred's the next night, I passed on the red meat to\ngive my heart a rest.  Since we were on this health kick, we passed on desserts too.\nOverall, it was a nice homey experience.  Mark told us that he was booked the next two Saturdays for private parties... good location for this, given that the entire Flower Market parking lot is FREE to their disposal.  In previous dinners, they would comp us appetizers, but, given the economy and our judicious diet, it was probably better that they did not.  Solid 3.5 stars... extra half for being local.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-05", "description": "Meh. The eggs benedict sauce was sour. I didn't like that plate at all.  The avocado bacon and cheffar omelette was ok. Bacon was a bit dry. For the price this is very mediocre food. I don't plan on coming back here again...", "author": "Genaro R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-19", "description": "A morning treat...with a visiting friend, we returned to eat the FM Cafe after too many years away. Nothing is as it once was...\n\nLovely space, nice waitress, attentive bus guy, fluffy pancakes and a perfectly poached egg. My pal's avocado, bacon omelet was tasty as well, the small bite that I enjoyed.  \n\nThe only minus: coffee! How can you serve mediocre coffee in this town? And especially at a flower market cafe? Please get better coffee.\n\nAs for prices, not outrageous as things go but not cheap (and I mean that in a good way).", "author": "Laura A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "Great place. Perfect for a classic diner breakfast with great service and toast.", "author": "Julie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-18", "description": "Great service, good quality omelettes (not greasy, not overcooked), large portions, all the trimmings (potatoes, toast/English muffin/ baguette choices).  One serving easily serves two average people.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-31", "description": "I imagine this place must get packed during prime flower market time... when is that? The weekend? Early morning? IDK\nThe location is sweet because you can smell all the wonderful flower fragrances before you go in and after you eat you can take some time to walk through the flower markets. \nI will have to go back because I only had the waffle and coffee. They were both fine, service was good and the restaurant was sunny and clean. \nUntil next time...", "author": "Edi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-09", "description": "I've been looking for a killer breakfast place in SOMA for a while, and I think I've found it. Definitely on the pricey side, but the portions are really good and the food is cooked just right.", "author": "Marc H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "This eatery is a culinary gem!!!  I have been coming here for years.  I had lunch here a week ago and the food just continues to get better and better.  I brought a friend who have never eaten here before and he became a believer.  Mark and Pat Bechelli are terrific hosts.  Salvatore De Grande the chef really knows how to make magic happen in the kitchen.  The is a place for tourists, but especially for locals who want a fine meal and a great experience.  The Bechelli's have an excellent catering menu and should be experienced by those who want a party at a private location.  CHEERS to all the staff at Bechelli's Flower Market Cafe!!", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-20", "description": "STOP, this review is not objective.  The first time I went to the Flower Market Cafe I had the Joe's special.  It was the best, most flavorful, Joe's special I've ever had.  Considering that my best man was the grandson of the founder of the Original Joe's concept which invented the Joe's special, this is quite a compliment.  I've been to this restaurant 5 times and ALWAYS HAD THE JOES SPECIAL.  So I can say it's 5 stars for Joe's special but for the rest of the menu you are on your own.  TAKE THE TIME TO WALK THROUGH THE FLOWER MART.  GREAT PLACE TO PURCHASE THE POTS AND FLOWERS YOU WISH YOU COULD FIND AT THE NURSERY; ESPECIALLY INDOOR PLANTS.", "author": "Barry G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-28", "description": "Clean place with nice waitstaff. Lawyers come down from Hall of Justice to eat here in addition to the flower mart crowd.\n\nThey have a huge breakfast/brunch menu. I really enjoyed their green chiles (as a side to my eggs) as well as the flower market salad with cranberries and goat cheese. I will return to try their other salads and their gin fizz!!\n\nParking in the evening is complimentary.", "author": "Marina N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-30", "description": "I've been to FMC at least three times and each visit has just been OK....well OK enough for me to return.  The three times I've been here, I had the bacon and two egg breakfast with home style potatoes, corned beef hash with two eggs, and a cheeseburger. The portions are large and tasted good.  I must say the toast served with my breakfast was on the solid side. \n\nThe only and biggest con about this restaurant is the odor.  It potently smells of raw sewage in the restrooms which lingers into the dining area (a big no-no), which made my stomach turn.  Hopefully this issue is addressed sooner than later.\n\nWould I go back?  Sure, if I'm in the area. The prices are right and the food is good.  But the stench must definitely be addressed.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-15", "description": "So if I'm hungry and buying flowers or at Fantastico's...I guess I'd eat here again.....\nI've had the pizza (eh), the steak sandwich (eh), and the grilled cheese (blah).....When the cheese in a GRILLED cheese isn't melted.....problem......\nI would normally go for 1 star, but the service is good.....", "author": "Bianca L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-03", "description": "Clearly, the kitchen staff of the Flower Market Cafe is an elite unit.  They have been vigorously trained for years in the art of making food taste like nothing.  There is obviously extensive training by Tibetan monks,years of suffering and hard work, because these guys can make anything taste like nothing.\n\nI went there this morning for breakfast with my girlfriend.  They first brought us a plate of fruit that tasted amazingly like nothing.  Then, some orange juice, but again nothing.  Then, our food arrived.  \n\nAt this point, after her eggs florentine tasted like nothing, my girlfriend started to worry that it was us, and not the food.  Perhaps we had picked up some odd disease that destroyed our taste buds.  As lovers of food, this is a horrible curse.  Years and years of blah tasting food.  Like dining on airplane cuisine for the rest of your life.\n\nLuckily, before we tail spun out of control, I realized that my rye toast did indeed taste like rye toast.  It was, in fact, the best part of the meal.  And, we were saved from a slow and horrible life of blandness.\n\nThis was maybe a 2 star meal, but when the check came, and we had just paid $30 to eat a whole lot of nothing, I lost it.  \n\nYou are lucky you get one star", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-16", "description": "Another secret spot. \n\nWhere I go when I need to be by myself for one of those 'special' work day lunches. The best thing about this place is that I can be a by myself, a single girl ordering a bloody mary at 11:45 in the morning and the waitress passes no judgment and brings it to me extra spicy with a smile.\n\nI always get the same thing: scrambled eggs with cheese and caramelized onions... so satisfyingly comforting... and goes so perfect with my strong bloody mary. \n\nI intend to go for my 'special' lunch today. It's 10:37am, according to yelp's Auto-save clock. Only 1 hour and 8 minutes to go.", "author": "Bonnie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-19", "description": "No one appears to have reviewed the dinner menu at this place yet. It's about time someone did.\n\nSomeone should mention that the service here is friendly and efficient, and that the decor is nice and that it's reasonably quiet (though it wasn't all that busy when we were there.) Sal (the chef) may come out and describe the specials to you himself.\n\nIt should also be noted that the appetizers (calamari and crab cakes in our case) were excellent. The calamari was a little saltier than I'd like, but I have deeply held and often unpopular opinions on the degree of saltiness appropriate for calamari. I suspect that most diners will judge the calamari to be ideally seasoned.\n\nAnd people should know that the pepper steak comes with a nice crust the way it should, and is moist and flavorful when ordered medium rare. The rack of lamb is also delicious.\n\nI'll bet that a lot of people would also order the cheesecake or tiramisu for desert if they knew how good it is.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-15", "description": "6th & Brannan is an awfully lonely spot for a restaurant with these prices. The flower market customers must drive a lot of daytime business, and yet...they're open for dinner too (and there's even a little bar in the back).  But no matter.  All I know is it's close to the office and they serve breakfast until 2:30.  Score!  Throw in the lunch menu and you've got your choice of omelettes, griddle fare, salads, sandwiches, burgers, and pizza.  I tried the veggie omelette--solid, big portions, though nothing spectacular.    \n\nAmbience-wise, it's basically a big tile-floored diner inside (complete with stools and counter), only it's been run through the beige-walls and dark-wood-chairs color filter, as befitting a yuppie, post-flower-buying destination.  Not surprisingly, the clientele looks much more relaxed than the harried office workers at many nearby eateries.  Of course, what probably keeps the workers away is the high prices--expect to pay around $10 for just about anything.  If it wasn't for that, this place could easily be a 5-star oasis in the outer SOMA wastelands.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-23", "description": "The portions here are beyond huge.  That is good for the wallet, but not good for the waist-line and super not good for the Asian in me who doesn't want to waste food but can't finish it.  \n\nI've had a burger here (I should have cut it in half but I was so hungry).  It was well cooked, the toppings were fresh and the fries were shoe-string.\n\nAlso had a chicken pesto sandwich.  But it was on sourdough baguette instead of focaccia and did not do well the next day.  The chicken meat was a little flavorless.\n\nI think this might be the most secluded lunch place around here.  It's quite.  Slower paced.  Higher standards.  You know what I mean.  People come here so other people won't look at them.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-26", "description": "Dinner here tonight was almost an erotic experience.  We sat on the lovely warm patio.  The waiter and bus boys seemed like they actually enjoyed being at work.  I ordered the special:  sauteed beef in mushrooms.  Steve got Chicken Toscana. \n\nWhen our waiter brought our plates out, he smirked like little boy with a dirty secret.   Oh my god!  The smell alone was enough to get me salivating.  I bit into it and absolutely melted.  Steve fed me a nibble of his chicken.  No doubt, it was delicious.  But I was truthful when I announced teasingly, \"Mine's Better!\"\n\nI have no idea why Bachelli's Flower Market doesn't have a three hour wait to get a table.  Even though the menu choices are mostly your old favorites, they go so far beyond just Italian food.  The service isn't just impeccable; the staff is conversational.  The chef even personally checks in with each table.\n\nBachelli's knows how to treat their customers and they know how to make food that stimulates your senses.\n\nAnd hell!  They even have a parking lot.\n\nMore Please!", "author": "Amy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-15", "description": "It's not bad!  For the neighborhood, that is.\r\n\r\nI suggest the Strawberry French Toast - but order a half-order for sure!\r\n\r\nMy only gripe is that they only serve home-fries and not hash-browns.  Minus one star for that alone. I know, I'm tough.", "author": "Yelper A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-06", "description": "They serve surprisingly good food in this retro-diner located at the foot of the Flower Market that has apparently been there for like 140 years.  I had the half-pound burger on a french baguette with grilled onions and jack cheese and it was really good.  The server was really friendly too.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-27", "description": "Why is it that other reviewers ate amazing meals here, but the dinner we had did not even rival a Hungry Hunter T.V. dinner?  \n\nThe calamari: some pieces did not even have coating on them, but the ones that did were lightly coated and tasted decent.  \n\nThe main courses, though, were disgusting, and I do wish that we would have stayed home or gone someplace else to eat.  \n\nI took two bites of my chicken parm with a side of mashed potatoes and could not eat anymore.  The chicken was a tough, thin slab of bird, covered with tasteless cheese and a nasty tomato sauce (described on the menu as a cream tomato sauce, but there was no cream and Chef Boyardee is less likely to make me throw up).  The mashed potatoes were extremely salty, likely frozen or reconstituted garbage.  Again, I almost threw up.  The waiter saw that I did not eat the chicken and gave me half off the chicken, but it should have been taken off the bill completely.  I could not eat it.\n\nThe \"specialty\" of the house was also high on gag factor, the butterflied prawns.  Covered in a gelatinous sauce, we could not tell whether they were grilled, fried, or simply sauteed into their mysterious, miserable state. \n\nOn the way out, I loaded up on breath mints at the front to get the horrible taste out of my mouth.  In the morning, my family was happy (and truly surprised) to see that I survived this wretched meal.  Luckily, those two bites did not kill me (but nor did they make me stronger).", "author": "KarenG P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-08", "description": "You walk in, and you get this old-world feeling. Not in the sense that it's stale and outdated, but that it welcomes you like your grandparent's house would. I could somehow tell the place had some history and been around for a while. Maybe it was because the head chef Sal having a friendly chat with the other group that was finishing up their meals. Like how an old, seasoned Italian chef would go up to a regular and have a heart-to-heart. What was surprising was he was as friendly to us as he was to them, even though we clearly walked in fresh, having never been here before and the only reason for choosing the restaurant being very close to my friend's house. But his presence and chatter made us feel like we're at home.\n\nHaving said that, a bit about the food+service: all the food was very well-prepared, and very homey. My pesto pizza with mushroom was excellent with just right amount of everything on it. My friend's veal was cooked well, my other friend's ravioli stuffed with flavor, and so on. At one point, Sal brought out a big dish of pasta, telling us that since the restaurant was closed the next day, he just used it all up and gave us a free dish, on the house. That was very nice of him, I thought.\n\nI will come back here if I want some good Italian food and want to go support a local restaurant with the sweet old man responsible for the food.", "author": "Inbae L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-19", "description": "Worst breakfast I have had in years. Stale toast, hard homefries, flavorless eggs. It looked and tasted like it all came out of a fake-food-generator.", "author": "steve m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-16", "description": "I'm not quite sure what made this lunch better than average. Perhaps the rather unique floral surroundings. Or the always engaging conversation with one of my favorite co-workers. Maybe it was solving our veggie burger or grilled chicken on sourdough dilemma by deciding to split 'em. Then again, it could have just been the friendly, welcoming service.\n\nIt all made for an enjoyable lunch.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-23", "description": "Pretty good:\n- breakfast sandwiches\n- turkey sausage & eggs\n- french toast\n- soups\n\nKinda good but super greasy:\n- all grilled sandwiches, including (inexplicably) the club\n\nShamefully average:\n- french fries (do not f*ck with french fries, FMC - either make them great or don't bother)\n\nDefinitely bad:\n- espresso drinks\n- pastries\n- salads\n\nSurprisingly great:\n- happy hour (except there's nothing but Sinatra sound-a-likes on the 100 disc CD changer behind the bar)\n\nRidiculously high:\n- lunchtime prices\n\nWhy I keep coming here:\n- close to my office\n- they make your food in like 2 minutes", "author": "Dave P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-10", "description": "There are certain things I expect when dining out. Based upon my crab cake order and the burger and fries ordered by Secret Squirrel, here are the things I expect from the Flower Market Cafe: \n\n1. Put crab meat in the crab cakes. If there is crab in them, please don't pulverize it, and please make them thicker, leaving off at least half the bread crumbs so that I don't think I'm eating a fried breadcrumb cake.\n\n2.  When I order a side salad with the crab cake appetizer and the waitress fails to tell me there is already a salad with the crab cakes, it bugs me. All right already, I wanted salad, but I didn't need two entire salads. You could have told me, okay?   \n\n3. Nice mango salsa, but it wasn't necessary to completely drown the crab cakes with it.  That is, unless you intentionally wanted to hide them from view and taste, in which case it's okay. \n\n4. When a burger is ordered medium, that means there is some pink left in the middle. Hockey pucks are out of favor at the moment, at least in the restaurant industry. At least I hope so. \n\n5. French fries really, really shouldn't come out of a bag.  If I order mine extra crispy, that means they get left in the fryer a little longer. Mkay? Okay this is picayune, but it bothered me. \n\n6. It is preferable when serving a lot of burgers to have ketchup and mustard on the tables. If it's not, please don't make me hunt you down to ask for it. If you write burger and fries on your chit, you need to bring the condiments before the food arrives. This is especially true when you have a total of two tables to serve. \n\n7. A grilled vegetable sandwhich should always include more than the following: An overly-thick hoagie roll, one slice of grilled eggplant and a few slices of grilled red pepper. A bit of aioli, anyone? Some fresh tomato and lettuce? A slice of mozzarella cheese? Okay, how about some basil or something? \n\nOn the plus side, the service was friendly and prompt and refills for drinks were readily forthcoming. \n\nThere is a full bar, and drinks were offered, though we declined. It is a spacious and comfortable atrium-like building. I did notice that there were no fresh flowers on the tables, which is strange since it is in the flower market mall.  \n\nIf this place were located on that vast expanse of nothingness on Interstate 5 (A) , it would be mildly acceptable (B), but  A) it's not and B) it's not.", "author": "Heather W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-22", "description": "Very nice people. We stopped quickly for coffee and they were kind enough to give us a fruit cocktail to graze on . We had just had breakfast or we would have had more but the service was great.", "author": "Ty L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-21", "description": "Disclaimer: I've only been to Bechelli's for *dinner*. I can't speak about how it is for breakfast, brunch or lunch, since I've never been there before 5pm. \n\nIt is far less busy for dinner, so it is no surprise that most of the other reviews are for the breakfast/brunch/lunch period. \n\nFirst, the food: it's OK -- not spectacular, but has some decent or even good stuff. The Calamari are especially good, the rest is OK. Not the best Italian restaurant, but definitely several notches above your generic Italian chain restaurant -- and it's not like San Fran is the best place for Italian anyway. \n\nIt is isn't cheap, so I can't say bang for the buck is best, but it is a nice room. \n\nAs to service -- as with a lot of places, it really depends on who you get. For dinner, although I did have a not-so-positive experience before, apparently that person is no longer there and I'm told the new staff is awesome.\n\nThe \"main\" chef, Salvatore, is downright hilarious and possibly the place's main attraction; once I was there with friends and family and he came out and spent most of the dinner chatting with us. He told us about all the famous people he cooked for (can't verify the truth of the story, but it was funny), and he tried to convince one of my friends (unemployed at the time) to actually come and work for him... Very nice!\n\nSo, this is how I'd put it: if you're yearning for Italian and are in the neighborhood (they do have free parking in the evenings, BTW), definitely give it a try.", "author": "Afonso I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-06", "description": "Before today I'd never thought to try the restaurant in the Cafe.  Typically, I would just stop in for a cup of coffee during one of my early morning jaunts to the Flower Mart, but KC was hungry and she needed to get some breakfast in her or else she was gonna be meanie cranky....(scary)...!\r\n\r\nI ordered the \"Sausage Omelette\", and she the \"Linguica Omelette\".  So...honestly: I expected Denny's 'only-good-when-drunk' quality food, but I was pleasantly surprised when it was actually pretty decent!  And, except for the side salad I ordered in place of the hash browns (it looked more like the fixin's for a hamburger - seriously, I think that's what it was - on the real)....I would even go so far as to say the omelettes we had were \"Good\"!  \r\n\r\nI also gave them an extra star for the waiters being super attentive, really very nice!  ...Although, I don't know if it was because we were two of the four people in the place, or if it was because we were women with an all-male staff in attendance....but, I'll give them the benefit of the doubt and simply give them credit for giving such excellent service (you would think it was a Michelin-rated 4-star restaurant!).\r\n\r\nSo, maybe the Flower Market Cafe wouldn't be my first \"Oh, let's go here!\" place for breakfast...but if I happened to be in the neighborhood...or picking up flowers, and hung over from the night before...well, hey - THEN it would be my PREMIER choice...", "author": "Van Ness D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-01", "description": "Not bad, not great.  Now how is THAT for a rousing review?  I have both the French Dip and the Eggs Benedict, both were adequate, but for the price, about 75% worth it.\n\nThe only reason I go there is because i have a friend that lives nearby and there ain't much else on the block.  I would not go there if there were other choices.\n\n3 for mediocre.", "author": "Bruce R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-03", "description": "absolutely so tough to park here.  if you find it hurry up and get it, people will fight you for it..lol.\n\nso its a close by place, kind of, to 850 Bryant which most of you know is court.  You either have a court date, a traffic ticket to pay/fight, or you're visiting an inmate, if you don't work here.  \n\nSo this Cafe, my mother ate here because she was on her 2nd jury duty, and had a criminal case she was working on.  They sequestered and fed her here.  I've been here too.  \n\nThe food is prepared and it looks beautiful.  it tastes like its supposed to taste...its very good.  Lots of choices, american food mostly and the only thing is, it takes a while here.  \n\nIts the ONLY legit Actual Restaurant here in this neighborhood.  Others are really just little stop and shop types...this place you can sit down and relax, but again, you better have the time to relax.  If you got to get back to work or court, you might be late.", "author": "Bing D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-13", "description": "This SoMa spot is a sleeper! We have lived practically next door for the last three years, but didn't think of eating there for other than breakfast and lunch. The newly painted \"Bar\" sign, as well as the added \"Restaurant\" neon, finally lured us in after dark. Several tasty appetizers (and drinks) later, we were ready for the entrees: we hit gold with the Bolognese pasta and the chicken/goat cheese pizza!  Turns out that the Sicilian style food is the creation of head chef Salvatore, who used to be at Mama's. There he reportedly cooked for (and sung with) Pavarotti...\n\nFor those of you not living next door, the gate to the free parking (in the Flower mart lot) is now open at Happy Hour time. That reminds me, it's about that time, and I believe the appetizers are half off...", "author": "Eirik O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-01", "description": "This place is HORRIBLE. There is no excuse for this kind of bland, poorly cooked food in San Francisco.", "author": "Mia M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-16", "description": "Went for lunch with my son at 11:30 to get ahead of lunch crowd.  They appeared to be understaffed, although the place had only a handful of customers when we arrived.  It took 3 reminders to get the organge juice my son ordered.  My bowl of clam chowder arrived with a hard, dry, microwaved roll, no butter, and when I asked for crackers I was told they had none.  My son's eggs were under-cooked.  We had to finally take our check to the front counter to pay as no one came around to get it.  \n\nI've always wanted to try this place, but once will be enough.", "author": "B. M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-29", "description": "Roofie-Colada.\n\nTheir \"special\" was the Penne Pasta with (canned) mushrooms and BOILED chicken, in red sauce. My friends and I came here last night to celebrate a friend's birthday. We would have all left disappointed, but thank goodness for Joey the Bartender\n\nI tried the chicken tortellini with creamy pesto off my friend's plate. Much too doughy, not enough flavor. Very bland. I also took a couple bites of the Clam Linguine...  way too fishy. Almost too fishy - I was questioning if the seafood went bad. (I'll call my friend to see if he destroyed the toilet.)\n\nBut... I'm giving the place 2 stars because of Joey the Bartender. Every shot I ordered was served in a martini glass. Hmm... size of a shot glass. Size of a martini glass. I ordered about 3 or 4 and no, I don't remember the rest of the night - nor do I remember how much my happy-drunk face left for tip! (Tsk... oh that Joey. He's so smart!)\n\nOh, I lied. I do remember ... vaguely ordering Joey's \"special\" drink. My friends and I called it the ROOFIE-COLADA cuz' it was just that strong!\n\nI'd come back for Joey and their Roofie-Coladas.", "author": "Hana N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-17", "description": "My friends and i stumbled upon this place while looking for a specific restaurant for her birthday. As you can see we couldn't find it, so we ended up here, at the Flower Market Cafe. I must say, it's a really cute place!\nWe had a group of about 20 people and they seated us promptly when we came in..probably because the place was empty. The decor was romantic with candles and such. And the waiters were really friendly. I'm surprised it was empty for such a beautiful restaurant. From what i can remember, the food wasn't so bad. It wasn't the bed italian food i've had but it was tasty enough to satisfy my taste buds. We were hoping they'd give us a free slice of cake for the birthday girl...and they did! \nsuper awesome.", "author": "Suzan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-13", "description": "Breakfast review... Solid 3 stars\r\n\r\nI've eaten there about three times for breakfast and been pleased with the eggs, pancakes and french toast each time.  They're open early -- a plus -- and if you do go there early, parking is a piece o'cake.", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "Flower Market Cafe certainly deserves five stars for service! I ordered a catered burger bar from the cafe and I couldn't have asked for nicer service and more attention to detail. The owner personally came to our office to make sure everything was perfect and that we were happy with the set up. As an office manager, I would recommend the burger bar to all other offices for a great meal, and even better personal attention. The Flower Market Cafe has been a staple in the city for a long time, and they deserve to be. I cater with restaurants all over the city and the superb service that the flower market cafe team gave us is above and beyond.", "author": "Alexandra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-11", "description": "This is a comfortable place.\n\nThe food is very consistent.  Been here 3 times, and like all the items.  Salads, burgers, sandwiches are all good for lunch.  Just don't get The Diet.  It was not what we expected.  Didn't say that the burger was going to be bun-less!\n\nThe service is prompt w/o interrupting.  I just wish there was more time to linger.\n\nWill come back for dinner.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-16", "description": "Interesting place, situated adjacent to the flower market.  Generally ok, I always found the food to be about diner quality.  The interior had higher ambitions.  It's been a while, so I would try it again.  Cost always seemed a bit high for the food level.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-04", "description": "Okay, so Sal, the main Chef (who looks like he's 90 years old btw) used to cook for Frank Sinatra. Balla!\n\nThe food is good and the prices are pretty reasonable. I ordered the Seafood Linguine and I have been back to order it...of which I have ordered it maybe 10 times already. Simply put, it's GREAT.\n \nThe only reason I gave it 4 stars is because it's usually very dead there in the evenings so the vibe is pretty dull. I usually order take-out so that I don't have to eat there....in the quiet.  :::chirp chirp:::", "author": "Andy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "I have been ere many time, but had jury duty again, so came for a quick lunch.  I am always happy about their french toast, nice and sweet, and cinnamonny..is that even a word? Their coffee is nice and fresh, not the strongest, but a decent brew.  i have had their burgers before, decent, but i always stick with their breakfast. the omelets are darn good", "author": "ray l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-06", "description": "Date: November 6, 2009 @11:22 AM\n\nOccasion: SF Court dismissed my  \"Red Light Violation!!!\"\n\nGuy-Friend: Super-Nice Married with 6 Kids Friend Ed Who Has Always Been A Girlfriend To Me!  (The Guy Says \"It Is Because I Am In Touch With My Feminine Side.\")\n\nVenue: Probably the only restaurant  surrounded by flowers shops.\n\nAmbiance:   Not Hip and Cool but Mature with A Little Bit of Class Diner.   \n\nDecor: Tasteful immitation paintings you can find at the Z Gallerie.\n\nSocial Scene:  Really Serious Lawyers in Suits. Men and Women in Blue Uniform.\n\nService:  Efficient and Attentive\n\nSalud!:  H20 and Diet Pepsi\n\nTaste:  2 Eggs and Corned Beef Hash ):  $8.95\n             Joe's Special (Same section as hamburgers but sauteed ground\nbeef with spinach and eggs/baguettes/soup of the day) $10.95\n              We did not order this but they also serve breakfast until 2:30 PM, hamburgers, salad and pastas during lunch.\n\nTab:  $28.30 (including tax and tip)\n\nFlowers from Flower Mart:  $6 (Lovely and Luscious!)\n\nParking:  $3.00 for 1 hr and 15 mins.\n\nVerdict:  Flower Mart Cafe serves decent  food but not my kind of food.\n\n(Baguettes were toasted to perfection!! Corned beef with potatoes were actually yummier than my childhood breakfast in the Philippines.)\n\n  It is a classy diner that makes me want to behave whenever I go there.  I guess it was because I was being surrounded by serious and mature \"Law and Order\" and \"Cops\"  looking people.   \n\nIt is a very convenient walk from the  San Francisco Court House.  \n\nUnless I get another traffic ticket that I need to contest again (I hope not!), I probably will not purposely comeback here.  \n(I will definitely come back and smell the flowers--and buy some!)", "author": "Leah E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-06", "description": "If you ever want to host an event at THE place that not only takes care of their customers but has great food - come to BECHELLI'S.  I have hosted a few events over the years and they have never failed to take care of me.  Mark Bechelli, Owner, is fantastic to work with and will not only make suggestions but do everything he can to accomodate your event.  He is quick to respond to your questions or needs and follows through so that you are satisfied.   Sal, the chef, is AWESOME - a great and charismatic man who comes out to say hi to his customers.  For the amount and quality of the food you get, the prices are extremely reasonable.\n\nBechelli's is great and I will high recommend it to all who's looking for great service and great food.  They are also alums of SHCP so don't be too surprised about the legacy of customers who are also alums.  \n\nLove the Bechelli family - great people - you won't be sorry!!!", "author": "Debbie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-24", "description": "Had lunch here yesterday because I'm on jury duty at 850 Bryant.  I've eaten here many times over the years and can't believe I've never reviewed the place.  Anyway, I was craving diner food so I got the bacon, avocado and jack omelette and it was great.  Service was friendly.  I'm sure I'll be back for another visit during the course of the trial I'm on.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-25", "description": "Worst french toast, EVER - and it was listed as one of their specials.  If I wanted stale, soggy,  mushy bread that tasted like cardboard I would have cooked this meal myself.\n\nI went with a friend who spoke highly of this place, and she seemed satisfied with her meal, however the third person eating with us found that even his simple meal of granola was too dry to eat much of.", "author": "Andrew N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-19", "description": "Sad times at the Flower Market Cafe.\nHad such great experiences in the past here as a great brunch spot! \nYet after this past Saturday, not sure if ever going back! \nUnbelievably sad experience, the wait staff were trying their hardest but something was up each order was missing something. \n\nthe spark this place once had is defiantly not around anymore.\nMore of a place to go with a larger croud and childfriendly!", "author": "Danny B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-05", "description": "I came here for lunch last week with a bunch of coworkers.  There were about 15 of us and they put us in the back of the restaurant for a little bit of privacy which was exactly what we requested.\n\nHowever, maybe because we were tucked away from everyone - but it seemed like the service was extremely slow.  We waited for about 30 min between the appetizers and the main entrees.  I ordered the pesto chicken sandwich with fries.   The sandwich was a little dry but the portions were big so I ended up taking half of my sandwich home.   The crab cake was good but all the other appetizers were pretty forgetable.", "author": "glen o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-20", "description": "For the SOMA area this is a nice dependable lunch place. The steak sandwiches, done to order (I ordered medium rare), are quite the deal. Most places will only give you a burger for that price. The portions are large. Decent veggie burger as well. \n\nMy only problem with them is that they say that they have the #1 barista in town, but the coffee was expensive and awful. Espresso \"It's not only bad coffee, but they charge you a dollar more than $tarbucks \" The wait staff  does not warm the cups which are too big for a proper sized espresso, does not grind the bean fresh, does not tamper the coffee, and just presses a button for a 6-8 oz cup of overextracted coffee flavor liquid swill. Sorry to get into should detail, but they do claim to have the best barista in town.", "author": "Kirk W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-19", "description": "Made a random stop there yesterday afternoon for an early dinner, and WOW, was I impressed.  All the quality and amenities of a top notch restaurant without snooty attitude and at a reasonable price.  The menu is all the Italian classics: piccata, marsala, pastas, salads, fish,  steak, etc.  Being of a somewhat sinister bent, my girlfriend and I enjoy eating the flesh of the young.  Hence my savoring a perfectly made veal piccata and her ordering a lamb chop special that was amazing.  The service was very friendly and efficient, and the decor is modern but warm.  I guess I just love that it's a good restaurant that's not trying to serve some psycho future-retro-fusion 'concept' cuisine, and serves the classics, and serves them well.  I think some extras from the Sopranos came in and sat down just as we were leaving, which is usually a good sign when it comes to Italian food.", "author": "Steve G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-09", "description": "We came here after a few dizzying hours of sensory overload from all the flowers and plants and stuff in the Flower Market. Breakfast was good, 2 poached eggs, 3 links of chicken apple sausage, toast and home fries for $8.75. Pretty cheap if you ask me. The best part about the chicken apple sausage, the skin was charred so crisp that it actually \"snapped\" when I cut it with the side of my fork. And then, the inside was really juicy and just slightly sweet from the apples. Yum. Coffee was good too, the kind you would have in a favorite neighborhood diner. Service was pretty good too. One of my companions however ordered a latte and the cup it was in came with a lipstick stain. Needless to say, it wasn't his color. But that was the only downside as my other companions enjoyed their breakfasts as well, especially because all of our eggs were cooked perfectly.", "author": "cora j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-27", "description": "Just helped a friend throw a private 50th birthday party and it was fantastic. This is a great place for a private party to celebrate any special occasion. Mark Bechelli is very easy to work with from beginning to end and his staff ran the whole party smoothly. The food, staff and ambiance could not have been better. Other pluses: free parking, clean bathrooms and outside patio. \n\nWould plan another party here in a heart beat!!!", "author": "S F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-22", "description": "I am a local who frequents this place quite a bit. I highly recommend this place for dinner. Breakfast is fine, but dinner!! The best. Service is wonderful. They treat you like family. Most of the family is there every night as it is. They are all sweet and fun to meet. Every once in a while they have a wine tasting night. That was great fun to do. Their portion sizes are amazing. I can recommend the Butterfly Prawns, Veal Piccata (divine!!) and Pollack. I know I should expand my horizons and try other things, but these are so good. All three dishes give you soooo much food. I have also tried the crab cakes. They are deep fried, but pretty tasty. The homemade soup is a good bet after a giants game. We all know how cold those games can be. If you sit at the bar, Joey will take care of you. Also, always ask what is for dessert. The owner's wife often makes something for dessert. Her gingerbread cake is my favorite. \n\nIf you do go, hang out in the bar. Chances are you will meet me or more likely my roommate.", "author": "Andrea T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-08", "description": "I love this place going on 3 years of eating there.\n\nHere's Why:\n- Hands-on owner (Mark Bechelli)\n- Parking (This is very, very good for those of us in SF who are addicted to our cars and unimpressed with SF's public transportation.  Have you tried to get a taxi on a rainy night?)\n- Chef with a resume (not just a CCA degree in hand)\n- Friendly staff that understand that a restaurant meal is about hospitality as much as the food\n- Good food, reasonable prices\n- Easy access for people from out of SF, as location is at 280 off ramp and has easy freeway access.  \n- Great for groups (as I mentioned, there is parking galore)\n\nWhy Not?:\n- Not exactly a \"hip\" location.  However, it is an historic location at the ages old Flower Market, a place constantly under threat by developers to buy and wreck a piece of SF history.  Bechelli's Flower Market Cafe is less about hip, it's about warm hospitality and a solid menu.", "author": "A R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-20", "description": "Yes, breakfast at noon, that's my kind of place.  The french toast was pretty good.  I was very surprised with how large this cafe is, would never have guessed passing it to the freeway.  Kind of pricey for a regular lunch option but it's a decent option.", "author": "Debbie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-06", "description": "Decent place, and convenient if you're in the area. Service is quite quick. Breakfast is great but lunch remains mediocre. Especially for the price point, I'd rather frequent somewhere else for a sandwich.", "author": "Jon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-12", "description": "Great little dive place with great food and drinks. I moved into the area not too long ago and my girlfriend and I enjoyed a later night meal there. Food is not spectacular, but fast and still tasty. For drinks, go see the very nice and enchanting Myra for a good pur of wine or a stiff whiskey on the rocks! Not open Sunday or Tuesday though??? WTF?", "author": "Jason S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-08", "description": "really cool venue for a private party. my friends family threw him a surprise birthday party here last week, and it was quite enjoyable! parking is easy since there is a parking lot right behind the place. the food was buffet style for the party, and everything was delicious. pasta, lox on bagels, chicken strips, salad, bread, fruit, yum. they have a bar area for those who like to get down with some alcohol beverages while they eat. the place came equipped with the ability to play ones' ipod over the speakers, so we had good music all night. i've never been here for a regular meal so i don't know anything about how the service is, but it seems like a really cool place from what i've seen.", "author": "Justine K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-02", "description": "I've been here a couple times with my girlfriend.  The corned beef hash is always a hit, but I love corned beef hash.  They make the potatoes crispy and delicious.  Service is good, although not consistent.  Overall, this place is a great spot to sit down, order and enjoy lunch with a companion or group.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-13", "description": "Big disappointment. Met a friend for lunch and the first thing we noticed was the food stains all over the menu. The prices were to high for the quality of food which was bland. Fries were boring. A big difference from years past. Won't go back.....", "author": "kathleen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-10", "description": "The dinner was absolutely wonderful and the service was great.  It has become our favourite restaurant.\nTami and Abe, Westlake CA", "author": "Citibroker aol.com G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-07", "description": "My favorite spot for a good old American lunch with just enough healthy hipness to make me feel way less guilty than eating at McDonalds. I particularly like their chicken salad sandwich. As a florist, I've seen this spot evolve from an incredibly seedy dive to its present incarnation while still remaining down to earth.", "author": "Kathleen D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-20", "description": "well, our quest for good italian has been on a bumpy road lately.  the last few places have been duds and unfortunately the streak continues.\n\nit's a nice looking restaurant w/ a spacious dining area and an open kitchen.  the staff is hit or miss too.  i feel bad but for whatever reason, the lady taking my name down for a reservation had a hard time picking up that there was an S in my name.  the first waiter was quite cold too and had a sense of snobbery to him but i have no clue how it was warranted.  we ended up w/ a nice waiter after the first one's shift ended but this guy was slow.  actually the service overall was slow which was surprising since the place was empty.\n\non to the food, we split caprese as a starter and it tasted like a caprese we make at home from time to time, complete w/ mozzarella that tasted like the bricks of mozzarella from trader joe's.  for mains, i got the chicken picatta and my wife got the chicken parmigiana.  my picatta was pretty good w/ the sauce tasting well and the chicken being well cooked.  the side of roasted potatoes weren't bad either.  my complaint here would be that there were too many capers.  my wife's dish however was way too salty and the cheese to chicken ratio was heavily on the cheese side.  she enjoyed the baked potato side though.\n\nwe were disappointed to hear that the dessert menu was pretty scarce so we decided to call it a night.  not sure if we'd give bechelli's another try as we didn't see anything to redeeming here.", "author": "Swarup B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-06", "description": "Seems like primarily a breakfast place--they serve it all day, but I had an \"OK\" turkey sandwich that was served extremely quickly.", "author": "N B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-18", "description": "Pretty good. This is where Bambi and the co-workers head for breakfast after working the night shift. Usually get the basic eggs and bacon (Yum Yum). Service is quick and the portions are great.", "author": "Teddy d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-28", "description": "Best brunch I've had in a long time. Came in here after visitng the flower mart not expecting much but surprisingly had a very satisfying meal. I ordered the \"chicken salad with avocado\" sandwich and it was simply delicious. The bread was toasted just right, and the chicken had a unique texture so that it felt similar to eating a tuna sandwich. Everything tasted very fresh, with quality. The freshly squeezed orange juice was very sweet, just to my liking. The place is decorated with cute flowers and is a nice place to have a quiet breakfast, brunch, or lunch with a friend or two.", "author": "Kat K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-18", "description": "Why do I always have early-morning breakfasts at Mel's on 4th and Mission when the Flower Market Cafe opens so early? Well, I can only claim ignorance! The omelets and orange juice at FMC are much better than Mel's, as is the atmosphere. Of course you can't come here at 2:00AM, and it's a long walk from Market so keep that in mind.", "author": "Will A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-12", "description": "The servers tried to please in earnest, but breakfast was not good.  The poached eggs were not fresh and very watery, the potatoes were crunchy, the toast was not buttered, the tables were not set though it was a seat-yourself situation, our table was missing all sorts of condiments that every other table had.  It was a $3.95 experience to be had for $10.   The conversation over this meal was figuring out what to have for dinner to make up for this experience.", "author": "K W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-30", "description": "Went to Flower Market last night, and was very surprised when arriving for dinner service that we were the only people dining! The place is large, and has an inviting, cozy feel to it, so we were very surprised when we didn't see any other patrons.  The menu is fairly priced and the warm sourdough brought out was a nice treat.  Our food selection was okay, nothing outstanding, but good enough to try it again sometime. The service was friendly, and there is free parking lot at night.", "author": "C R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-26", "description": "My husband and I always enjoy dinner here, whenever we come into the city.  Salvatore always makes it a special occasion by coming by our table and giving his personal greeting.  The food is comfort delight!  Food comes in great portion sizes, it's tasty and the wait staff has always been warm, attentive and friendly to us.  We plan to continue going here whenever we come to San Francisco.\n\nP.S. - We've never come for breakfast or lunch.  Can't comment on those hours of service.", "author": "R N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-05", "description": "I can see how this Restaurant has a pretty large degree of positive and negative reviews. Some of the food was amazing, like the Pepper New York Steak. The Pasta was very good as well, but their signature shrimp dish didn't seem to fare so well in are party. Bar is stocked but bar has very few choices.\n\nThe worst part of the experience was the dumbfounded and confused looks from our server.\n\nThe atmosphere was very nice and the night was perfect for sitting out on the patio. I would eat here again, but perhaps on a livelier night when their servers may be more suited to doing their job.", "author": "Jaron W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-25", "description": "Every time I come here I tell myself to not eat so much and I always do!  This place feels very homey to me.  I think its because the staff and owner are very nice people.  It doesn't really feel like a restaurant to me, more like being at home with my family where I don't realize how loud I am talking or laughing.  The first meal I ever had here I don't really remember as much as how full I was when I left.  That is a good indication that I enjoyed the food.  This most recent time that I went I decided to not order too much food so that I could really enjoy my entree.  I tried the calamari which I thought was tasty.  My mixed drink was especially yummy.  I decided on having the special - the swordfish.  I had it grilled and I thought it was cooked perfectly.  It was divine.  It came with broccoli and potatoes that were also very good.  I would like to try this place for brunch & lunch.  I definitely will come back again.", "author": "Kerry M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-04", "description": "we had an early reservation since we were headed to a play soon after, but no need.  bechelli's has not been serving dinner for very long so not crowded at all, yet!  this place serves excellent food--the seafood especially and locally caught of course.  the entire staff were very nice with lots of personal attention.  it's reasonably priced, highly worthwhile, and a nice, quiet, romantic place for two w/ sinatra playing in the background...", "author": "william s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-01", "description": "Kill two birds with one stone--pick up some beautiful flowers and fill your tank at this great cafe.  Breakfast and lunch items served quickly and for fair prices.  Try the texas-sized strawberry french toast.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-13", "description": "Love this restaurant.  We had a wonderful dinner and great service at a large party this week.  Highly recommend you give this place a try.  If you go say Hi to Sal the chef.", "author": "C. C."}
