{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-04", "description": "Quick pit stop after \nfor a birthday.\n\nCame and went.\n\nThey have billiards here, \npbr for like 2 bucks, \nand a bike rack indoors.", "author": "Lilian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Benders is a great dive bar with friendly staff and delicious food! It's my favorite place to go in the mission, and great for social gatherings. \nTheir Bloody Marys are the best!", "author": "Martie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "The BEST live music dive bar in SF hands down!  The tater tot bar rules!  Awesome beer selection both on tap and in the bottle, and the bartenders can actually make drinks.  Most of the live music is usually heavy rock, metal, or punk.  Shows are always $5.  There's a couple of pool tables and some video games.  Back patio is a fun place to just hang out.\nWill I be back?  Of course!", "author": "Jim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "At first I was annoyed that I had to walk from Giordano Bros to Bender's on South Van Ness, but I had never been to this bar or heard of it. And after I visited the bar for a couple hours, I realized that I really enjoyed this bar. They played heavy metal rock music and there were hipsters. It felt homey and like a nice place to spend time at. You could meet people there if you tried. There's an outdoor patio. I had 2 crispy tacos, which were okay, but not stellar. And it took a million years for them to bring them to me after I ordered. The bartenders are cool. I was with 3 guys. I liked the atmosphere. It was better than the Knockout for sure. I would come back to this bar. It's more than a dive and the experience is fun.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "Found Bender's on Yelp, while me and some buds were looking for a good spot to have a few drinks and catch up and talk about the new Arcade Fire album. We got deep into the drinks then into a deep discussion on wether or not Arcade Fire are playing their fans for a fool or just trying to be super creative and clever with the new songs. Either way their musical melodies get stuck in your head and we all still love them. Much like we all still love a place where you feel at home while getting a drink or two on! \nSuper nice bartender, cool art on the wall, and just like that the drinks fall! \nNot super divey, but not upscale, I'd say it's a casual bar where they make you want to jump, jive, and wail!", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Came in on a Sunday afternoon for some drinks and food. Pretty chill place, lots of regulars sitting at the bar chatting up the bartender. There's a jukebox, but no one was using it, so the bartender was choosing songs from it. He was playing some good Sunday jams. Mostly Motown stuff. My husband had the burger with a side of mac n cheese and said it was really good. I had the totchos and they were good, but there was a taste I wasn't expecting on them. I think it may have been curry? It didn't mention curry on the menu, so I'm not 100% sure that was the seasoning, but there was definitely a flavor that I wasn't anticipating on totchos. They had black beans, sour cream, lettuce, salsa, cheese sauce and jalapenos. Drinks were cold and strong. Cash only.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-18", "description": "This bar is awesome. They have two pool tables, some of those electronic bar games, a photo booth, and a TV that'll show the sports games that are on (even hockey!). There's even bike storage inside the bar. There could be a little more seating, but it's usually pretty good (and also pretty loud).\n\nA bunch of different beers are available inside, and all at pretty reasonable prices. Also inside is Counter Offer where you can grab some food for the evening.", "author": "Rajeev S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "One of the great, LEGIT mission bars. Great beer selection, cool crowd of mostly locals, small outside seating area (often packed), and killer food at Counter Offer inside. Looooove the tacos, mac & cheese, and fried Oreos (good god they are delicious).", "author": "G. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "Six of us started at a Sunday brunch in the 'loin'.  Went for a walk to the new Salesforce Transit Center.  A great new addition to downtown that the City really needed!  Some more walking and an ad hoc bar crawl ended in the evening at Benders.  I hadn't been in awhile.  Was instantly happy on entering to get a fresh Pliny on tap!  Settled in and ordered burgers, tots and tacos.  A one man show at the grill produced some very elevated bar food.  Tasty burgers, crispy tots with homemade ketchup and the tacos, oh lord the tacos!  I know you shouldn't have tacos on the menu in the mission unless their good.  These were bomb!  Crispy fried pockets of flavor.  Beef w/pickles and cheese, chicken with charred salsa verde and a baked egg with chorizo that I'm still salivating thinking of.  My man at the grill!  We salute you!", "author": "Walt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Loved this place! Bar staff are super friendly, and drinks are eagerly poured.\nOh, and my dog gave the dog burger", "author": "Tamryn J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "A fantastic dive bar with lots of room to spread out, complete with pool tables, games, and even bike storage! Drinks are priced quite reasonably here, and the food offerings are quite good. Even though there aren't as many vegan items as there used to be, what they do serve is a step up from typical pub fare, whether a juicy burger, some fried chicken, some tacos, or some smaller bites.\n\nService is also boisterous and friendly. Worth visiting for the whole equation, whether the drinks, the food, or the colorful ambience.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "I used to LIVE for happy hour especially in the FiDi - drinks, cute men in suits, drinks, cute men in suits. \n\nDid I say, cute men in suits? \n\nWell that meant, making sure you looked cute as well...for me, that meant wearing sky high heels. Except I'm a walking calamity. Trying to walk in heels, I looked like a baby giraffe in roller skates and ended up with several sprained ankles.\n\nThese days, comfort is everything (I haven't worn heels in yeeaaars) and happy hours are a rarity. But, some days, you just need to cut lose and just don't GAF about having to impress those cute men in suits. Well, because there are none in Mission dive bars.\n\nI was in The Mission at an appointment when my friend met up with me and said, he was hungry. I had Tater Tot with me and saw Bender's Bar on my nearby bookmarks: full bar, dog-friendly, and grub so we headed there.\n\nBender's is CASH ONLY but they have an ATM inside. As others have mentioned, Bender's is a smaller version of Zeitgeist but without the douchewad employees. The female bartender (blonde with sleeve tats) is super sweet and the guy with the ponytail at the Counter Offer is super friendly (he pet TT and showed us pics of his friend's Pomeranian). \n\nIt's divey and dark which means everyone looks good in dark lighting after a couple of dranks. There's a pool table, juke box, small outdoor patio, and a photobooth ($5): http://bit.ly/2dqAzXS. The crowd was from all walks of life: hipsters, grunge, skaters, millennials, and a handful of techies. \n\nFor dranks, I stuck with my usual Hendrick's Tonic. The bartender made me one stroooonnng one that was only $8! Yah, so very cheap drinks. \n\nTo accompany those strrooooonnnng dranks, you must try the food at the Counter Offer, a food counter at the right side of the bar. On the menu are fried pickles, chicken wings, burgers (including a doggie burger), fried chicken biscuit, mac & cheese, crispy tacos, and fried \"f*ckin'\" oreos. Burger menu: http://bit.ly/2eVim5o. They also have a \"Burger of the Week\" and this week is \"The Elvis\" with peanut butter and bacon. \n\nMy friend ordered the Hand Dipped Corn Dog ($5) which was a special of the day: http://bit.ly/2eKA0sW. It was one loooonng, girthy dog. The polish sausage was juicy, and not overly salty which was perfect with the sweet corn batter. \n\nWe each ordered the Bent Burger w/ bacon, american cheese, preserved jalapeños, louie sauce, L.P.O, tater tots ($14): http://bit.ly/2ea12bj. This is what dive bar burger dreams are made of. It was incredibly juicy (not a frozen patty) and had great layers of flavors from the salty bacon, melty cheese, tangy and spicy jalapenos, and animal spread-type sauce. The burger was cooked to order (medium rare) and the warm, toasted sesame bun held everything together...but not for long because that patty is juicy AF. It's a messy burger and I had beef juices running down the sides of my hands but what great burgers aren't. It's accompanied with perfectly crunchy tater tots. \n\nTater Tot got a Chester Burger ($2): http://bit.ly/2emA6V9 and was a happy camper.\n\nWhen I returned to the bar for another round of drinks, an overly friendly drunk techie walked up to me and said, \"Hey, HR lady!\" He told me how he's making a point to tell people one \"hot\" thing about them. \n\nWhat did I tell you about THAT lighting!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "This is our second time here we like this bar!\n\nDion was our bartender. He pours some sweeeeet drinks! And he's a lover of Thai food. Great recommendations.\nDefinitely head to this bar, and bring your dollar bills for the ceiling. Quarters for the photo booth :-)\n\nThank you Dion!", "author": "Tina M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-02", "description": "I came here one Friday night and a few of the other patrons were incredibly rude to some of us for no reason. One of the regulars (I assume because she basically laid claim to the bar saying that her name is on it and that the owners would back her up in kicking us out) came over to our table, slammed her bag down and demanded that we leave. She proceeded to rant and curse at us very aggressively because she believed us to be tech scum, ruining \"her city\". Honestly if I had been by myself or with less people I would have felt pretty unsafe given her extremely angry attitude. \n\nI understand that this is not really in the control of the owners of the bar but I just want to warn others. I hope this doesn't happen to anyone else but I'm just being honest.\n\nAnyway, there are two pool tables you sign up to play and there is also a pinball machine! \n\nI did try their tots and they were pretty good. The house made ketchup definitely stands out and tasted a little like marinara sauce actually! \n\nThere isn't a ton of seating on account of the whole \"upper\" level part being pretty much occupied by the pool tables. There is some seating over by the food ordering area but that's pretty much it.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-22", "description": "Can someone please educate the bar tender that was working on Friday the 20th at 4:45pm. Dude, you are providing bad service and enabling the hard working guys at counter offer to build their clientele. \n\nThe poor service that you provide and the comments you make will directly affect customers coming to eat with the the guys at counter offer because you are the initial contact. \n\nI say get the stick out of your ass and be nice!\n\nThe guys at counter offer are working hard to bring clientele and you are just driving people out with your poor service and asshole personality. May be you shouldn't be serving people, in stead clean the clean the fucking beer tap", "author": "Davis E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-04", "description": "I've been coming here for years. The bartender on April 4th needs an attitude adjustment, and to keep his hands off of the customers' shit! I won't be back.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "This bar.\n\nGreat beer. Fun bartenders. Tasty popup food most nights. If you have cash, you won't find a better bar in the mission. That is saying a lot.", "author": "Alek C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-16", "description": "Drinks are cheap, they have tater tots for drunk munchies. Dive bar. Good for just that purpose.", "author": "Marie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "When I asked my friends if they'd been to Benders, both responded by saying 'nahhh that's not my scene'. Ohhh okay. Because yeah, I roll up on my vintage purple harley, with chaps on all the time. My bad! \n\nYes, it is a classic biker bar in the city but do not be mislead, this joint is for everyone. If a glitzy gal from L.A. can roll up in some chucks and grab a pint, I'm pretty sure you could too. I don't know about hipsters though. The bar maid might throw you some shade along with your pint. \n\nTwo pool tables, a little space for a small band to play and ample room for drinkers and revelers, make this corner spot a favorite of mine. The beer and liquor selection is sure to satisfy a range of preferences. They pretty much have it all! Not to mention the Counter Offer serves up delicious food! The new Bent Burger was finger licking good. It's a messy one filled with jalapeños, American cheese, onions, some crazy delicious sauce called louie and crispy BACON!!! Tater tots on the side seal the deal. You must try it! Don't worry veganites, they have a really nice selection for you folks too. Be sure to peruse all of the driving licenses screwed into the tables for a good laugh. I am so thankful I was not old enough to partake in the 80's hair trends. Lord! \n\nEveryone here is extremely friendly. The bouncer might look as though he'll eat you if you look at him the wrong way, but hey thats his job. He's really nice. Come check it out for yourself.", "author": "Jaylena P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Best bar ever. Been coming here for over a decade. Trying to make it two! Great prices, great jukebox!", "author": "Jake E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "I would come here everyday just to see the bar tender feeding french fries to the proper bulldog (sitting like a human, paws on the counter).", "author": "Arielle C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-26", "description": "While the bartenders provided excellent service, the system by which people get \"chosen\" to sing is petty af. I spent over $200 in the span of three hours and no one in our party got a chance to sing because of this one girl with a shaved head got mad that one of us unknowingly walked across the stage. She yelled at us about it, I think that could've been sufficient, but maybe blacklisting us from singing was a bit too far. Left with a bad taste in my mouth that wasn't from the alcohol. I really liked this place, but I'm never coming back and I'll be telling my friends not to go back too.", "author": "Shayda H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-13", "description": "Dive bar or just a loud 'n obnoxious Barkeeps & Patrons! Either way not worth another visit. Better options blocks away.", "author": "Madhusudhan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Divey and grimey ...reminds me of the old school city bars that are far and few between with the influx of millenial and hipster establishments taking over.Decent beer selection,back patio,pool tables and live music! There also is food served and the burgers looked bomb..too bad we already ate :( \n\nCheck this spot out before the gentrification get's it", "author": "Carlos G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Good tap list, friendly service, small but charming outdoor space and amazing cheap burgers. What else do you want?\n\nI came here with my friend and we got some $2 cans of PBR and delicious burgers out of the back. The bartender was sweet and awesome, the burger guys made an amazing burger and they were really into it.\n\n\"Do you want a fried egg on that?\"\n\n\"Hell yes I want a friend egg on that\"\n\nI don't have a picture of the burger because I annihilated it in a few minutes. The onions rings were ultra crispy and delicious. This is a must visit in SF.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-13", "description": "Very rude patrons and staff. Last time I visited regulars of the bar were yelling insults at other bar patrons waiting to use the pool table. The regulars stated the pool table is theirs whenever they decide to use it and people should know \"the rules\". Bar staff defended the rude patrons' behavior, which is weird and unacceptable. Two stars since they have alcohol and games. But cash only. Not a fan.", "author": "Michelle E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "These burgers will literally knock you d*ck off. The wings are killer. And shamelessly fried pickles. And tots.\n\nYes, Yelp is full of hyperbole, by my statement stands.\n\nThe grill takes credit, bring cash for the beer because the bar is separate. Great divey joint, pool, music, space, the works.", "author": "Ryan U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "A super divey bar in the mission! I came here with my team, and they had set aside a large portion of the seating area for us to use (on a weekday). They had a wide selection of beers and stickers and fake id's pasted all over - on the tables the walls the floors.\nThey have a food counter that you can order bar food from and they have fried oreos to really good fries and burgers that look like they're worth the 1000 calories. But they also have vegan bar food options! very sf. love it.", "author": "Grace P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "This place is so great! Amazing food, friendly people behind the bar and in the kitchen. Good drinks, music, patio ...its got it all!!! Love! Can't wait to go back!", "author": "Maria F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "Benders is all you could ask for in a dive bar. Cheap(ish) drinks, extreme bar food, chill atmosphere, bike racks(!!). On a Tuesday night the place was perfect for our group of 10+ cyclists to relax and catch up over the holidays. Got a big table no problem. Staff was friendly as were the other patrons. Like I said, very mellow though the music was a little loud.\n\nGot the \"tot-chos\" - nacho toppings poured over tater tots. Couldn't see so well in the dim bar but this was no gourmet stuff. Good but not gourmet. The only downside to this dish was that covering crispy tater tots seemed a waste since they just got soggy.\n\nAlso couldn't pass up the deep-fried oreos. Batter not so great but warm gooey oreos were excellent. I won't be ordering those again any time soon but they were worth trying. Just a little too much to have very often. Probably best after you've had a few more to drink.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Love this spot! The food keeps me coming back! They have some of the best burgers around and a great beer selection (as well as a full bar). The space is pretty spacious too. Gah, now I want a burger from there...", "author": "David F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-03", "description": "Food was great but service (behind the bar) was terrible. Very unpleasant lady, keep clear of her!", "author": "Hayley J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "I like the atmosphere, and they have a great pop-up with amazing burgers. Their tacos and chicken in a biscuit are also amazing. The bar is cash only, but the pop-up has Square. Awesome rock and roll bar.", "author": "Spencer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "You want a dive bar, I'll give you a dive bar... but one with generally friendly folks and a good beer list. This checks all the marks: walls covered with stickers and other randomness, a beat-up pool table, and rockin' music.\n\nSadly, the vegan pub grub has become something decidedly not vegan, but it stays busy so I imagine it's pretty good.", "author": "Damon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "Oh Benders, you are my soul sister (or brother) of a bar... mostly because we share the same name and mostly because you are amazing. The first time I went here the friendly bartender gave me some free Benders swag after seeing my last name was Bender (yay!)\nI found this place when I was looking for a good spot in the mission thats not very \"missioney.\" Bender's is everything you would expect from a great dive bar, its a bit dark, funky decor, pool tables and a great little outdoor patio to relax on a nice day.  Benders always has a great selection of beer on draft (for a great price) with super friendly bartenders and a good crowd. Come Sundays and enjoy the \"free BBQ\" on the patio, from my experience this usually involves some staff member grilling up burgers in between drinking some beers. My only compliant is that I have never been able to eat here (despite hearing some great reviews about the grub) seems like the kitchen has odd hours/another time I went the kitchen was closed for some reason. \nRegardless, Benders is my go-to spot in the mission when I am looking to relax, have great cheap beer and not have to deal with the typical crowd down in the mission. Cheers, Benders.", "author": "Kelsey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "First of all...\nIt's cash only so come correct. \nThe bartenders and door people are all\ntop notch. They will card the FUCK out of you so don't try pulling any funny business. They also don't take any bullcorn so I don't recommend coming in here swinging your white tech dude dick. I've been coming here for about four years. Great place to have a quiet drink on most weeknights and a great place to watch the Warriors game and eat one of SF's finest burgers. Prices are GREAT, so use all that scrill you're saving to tip them well. Bartender Cassie makes and slings great fresh squeezed Greyhounds on Mondays. I even brought a sack of oranges from my back yard tree once and she happily squeezed a drink for me and my friends and any other bar-goers that were interested. They have a photo booth too, which is perfect for taking pictures of yourself with your dog to send to your mom to prove that you love her. Great juke box full of metal and rap, and a back patio that closes at ten. I don't give a lot of perfect scores but I really love this dive.", "author": "Vanessa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "Cash Only. ATM inside. \n\nThis is an awesome place to drink craft beers on a solid patio. The Mission equivalent to Toronado. Be forewarned, this place is full of edgier hipsters - who came here before \nMission gentrification. As long as you don't mention you work for google, you'll be fine.\n\nThey serve Pliny the Elder. Plenty of pool tables. Awesome place to show friends who only dare to visit bars on the beaten path. Even people who live in the Mission don't know its existence.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "What can I say! Pure awesome artsy dive with everything. I could just hang out here all day and night. Comfortable at homey local place with great lady bartender! I luv this place!", "author": "Kimberly P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-23", "description": "Update: ownership has informed me that they reviewed the security video and confirmed my story. They have cancelled Sunday BBQ and now offer Burgers all week. \n\nI appreciate ownership reaching out. It means a lot. \n\nLong story ...\n\nCame 2 days in a row, will never return. \n\nI randomly walked into Benders looking for a beer while I figured out what to have for dinner.  Lo and behold, burgers. The burger was excellent, the beer was cold, and the 5$ cover was reasonable on a Saturday night (I guess?). I was a fan.\n\nI guess I raved enough about the burger to convince 5 people to return to Benders on Sunday. We were informed that the kitchen was closed, but there was a free BBQ to be had. Ok...\n\nThis is when shit got weird. The BBQ was not even lit yet. Some dude that was carrying charcoal to light the grill (I assume an employee) bumped into my friend (97 pounds. Female) and had the nerve to berate her for it. Afterward, he started flipping her off from the patio like some angry 6th grade bully. Luckily, we were halfway down the block when she calmed down enough to share this info, or there may have been a scene. \n\nTL:DR\n\nSounds like this place has at least one liability working for them. If a grown man can push a female customer, fail to apologize, then berate her, this place will be lucky to survive. Handle your shit Benders.", "author": "Nick H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-11", "description": "Called to make a reservation, which Yelp states they take, was told they don't do that there and got hung up on. Extremely rude! Will never ever get my business.", "author": "Madison L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "I have never spilled a drink before today at benders! Most amazing bartender. And today is his birthday. Dog friendly!", "author": "Sheree B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "'Dive' means something different in different parts of the city, it seems like. Anyway. Thinking this is one of the better bars in the mission. Yeah, pretty sure", "author": "Stalag T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Reluctant to even write this because I don't want to it to change.\n\nBender's is the best. A neighborhood watering hole with a small but perfect tap list, great food, and an awesome patio.\n\nWhat else is there to say.", "author": "Sandy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-31", "description": "I've never had problems with dive bars in the city when it comes to not being white. This place is racist as sh!t. I'm not asking for the moon & adoration but I'm a paying customer, treat me like you should. I'll take my $ elsewhere. This business can suck a bag of salty nuts.", "author": "Andy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "hard edge on the outside, super nice folks on the inside :)\n\ni've been intermittently heading to benders for years upon years. i've never had a bad experience. last night was the first time i ordered food, and now i'm even more of a fan. \n\nthe tater tots! (fried to a perfect crunch and just the right amount of spice and saltiness.\nthe chicken in biscuit looked really good, and my fish tacos were delish. and truly, some of the best table service i've had. super friendly...thanks benders! i'll be back", "author": "Wendy X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "Taco Tuesday here was so freaking delicious! Definitely, come check this wonderful place out.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-24", "description": "A classic, spacious dive bar on South Van Ness. Bring cash, as it's cash only and you don't want to waste $3.50 of your HEMs paying the ATM. The bartenders and bouncer are a little rough around the edges, but pretty nice and offer fast service. \n\nSometimes there's live music, there's a photo booth and a pool table to keep you entertained, and a small backyard area, mostly for smokers. The food from the kitchen is actually pretty dank, considering just how divey this place is. Tater Tots and Mac n Cheese always make me happy, and the Bent Burger is a keeper with plenty of jalapeños, bacon, and cheddar.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "Wow - I haven't been back to Bender's in years, but yesterday seemed like an appropriate occasion to enjoy a warm night on Bender's' back patio.\n\nAs soon as we found a corner in their intimate open aired patio - I recognized some folks. Catching up below the darkening sky, as Bender's regulars chimed into the conversation - I sighed happily. Van Morrison crooned out from the juke-box. Oh the bliss of living in San Francisco.\n\nBender's is a big space, but despite it's vast size - it still maintains a casual neighborhood vibe. Everyone I encountered last night was friendly and conversational. I will definitely be sure to enjoy more Mission nights here.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Im from chicago. I came in visiting. Im a beer guy, i love a good beer. The bartender knew his stuff and directed me towards good beer!! Now the food....Amazing! Jake shane and Katie. Do they believe their food! The wings and burgers are the shit!! Im definitely coming thru here when i come back to the bay area.\n\nP.s. try the deep fried oreos!", "author": "Edgar V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "This is a (surprisingly) clean, large dive bar in The Mission. And y'all know I love a good dive bar. I came here on a Sunday evening and everyone from the bartender to the door man was kind and friendly. \n\nThe good:\nStrong drinks poured by quick bartenders.\nFriendly co-patrons.\nLarge open footprint.\nVegan and vegetarian bar food. WHAT?\nAwesome jukebox.\n\nThe bad: \nBathroom maintenance needs to be addressed.", "author": "Tara H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "Great atmosphere and friendly staff. The food is fresh (unexpected in most bars). Had a burger which was handmade, not frozen patty . The garlic tater tots were tasty. Music is offbeat classics by other people and enjoyable. One can hear it very week but not blaring. Happy I tried out this place.", "author": "Corey N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "Only made it in for last call but was a super awesome bar. Bartender was friendly and informative. Wish we coulda made it in earlier to get the full experience.", "author": "Gee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-22", "description": "I tried Pliny the Elder for the first time yesterday. I had been hearing rave reviews about it, and they were right. Me gusta! I would definitely order this beer again. \n\nThe bartender was super nice and actually smiled a lot, which is a rare sight at most dive bars in the Mission. Most of the staff at other establishments seem kind of surly and snobby, especially to folks who don't adhere to the hipster handbook. This girl was really sweet! Bosses of Bender's, give her a raise. \n\nFrom about six until seven, my friend Phil and I sat around, sipping our cold beverages, admiring the strange artwork on the walls and talking about pervy things. It was a great way to cheer me up, seeing as how my Wednesday had been particularly unpleasant. \n\nCheep beers + great tunes + cozy booths + cute dogs + vegan menu options makes me a really happy camper. \n\nI need more Bender's in my life.", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-14", "description": "Worst service. Chef is rude and took a break right after I ordered just because I didn't fit the grungy poser Independent skater/tattoo artist/Victory (not even Harley-Davidson) rider/noir hipster/fixie riding/greasy hair/Converse Chucks wearing/trucker hat wearing gentleman that they serve. My dude was wearing basketball shorts and a tank top like he has a league game at De Lores right after his shift. \n\nNot sure if he was trying to fit the role of \"IDGAF\" new rockability hipster that's overtaken and genetrified the Mission. But he's doing that well. \n\nFood - Sucked. I'm pretty sure the cheese wasn't properly refrigerated because it tasted like how an old freezer from 1981 would smell like.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "This place was pretty much exactly what I expected it to be: a dive bar with good beer and delicious, greasy, vegan food. And I'm completely ok with that. \n\nActually, I'm more than ok with that. Between the fried artichoke hearts and BBQ Chicken Sandwich, I was more than satisfied on the food end. For beers, it would be pretty difficult not to enjoy what's available. Seeing Pliny on tap, I had to stick to that, but there's plenty of other good choices available too.\n\nIf this place had a larger food menu, I would definitely be here on the regular. But seeing this is SF, I'll take what I can get.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-10", "description": "Big space, lots of tables, THREE DOLLAR WELL DRINKS during happy hour, AND they serve all sorts of yummy, veggie friendly fried foods? This is my haven. \n\nI am cheap. I like alcohol and greasy food, despite my vegetarianism. A happy hour of tater tots and margaritas is basically the cheat code to winning me over. And Bender's delivers that. \n\nDefinitely a divey feel. Has a bunch of pool tables/arcade games, but my focus is on food. If I ever get un-cheap enough to spend time at bars more often, this will become my go to without a doubt.", "author": "Claire G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-05", "description": "Let me paint the picture of my first visits to Bender Bar.\n\nThey were playing the movie Rats:  Night Of Terror.  They were offering Jameson and ginger for $4.  They have a rusty old metal sign that says Metal Rules.  They have a pool table and photo booth.\n\nTheir dark ceiling is adorned with dollar bills.  Their food is orgasmic.  Bar food...orgasmic?  Yup.  \n\nMy friend and I scooted up to the grill that serves the food (it is located in the back).  A young guy named Sean was sitting there and offered us chips out of his chip basket.  We decided to order a snack so we ordered the mac and cheese.  And oh how happy we were that we did so.  The mac and cheese is to DIE FOR.  Best part is that they sell a grilled cheese sandwich that they stuff with the mac and cheese.  You need this.  Anywho as we were eating our mac and cheese we started to hear the long, slow whine of a siren.  \"Ohmygawd is that a tsunami warning??\" my friend asked in a panic.  \"Nah\", Sean said, cool as a cucumber, \"that's just the beginning of a Tupac song\".  Come to find out Sean says he is the owner of the grill.  Really??  \n\nI was originally brought to Bender's thanks to the Noise Pop festival who hosted their happy hours here.  And thanks to them I got to see a lot of amazing, FREE bands like the band Kitten I recently started following.  I have a feeling Kitten is going to blow up so I'm glad I could say I first saw them at Bender's.  The stage at Bender's is small so any show you see here will be very, very intimate.  And very, very, very loud.  \n\nOf course this type of place is hipsters central.  On Friday after one of the Noise Pop free shows IFC was standing outside the door handing out free, numbered Portlandia posters and free season one DVD's to the people spilling out.  Regardless if I lived in SF I would find a way to make this my neighborhood bar.", "author": "Heather F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "They always have Pliny the Elder on tap! This is a true California biker/dive bar with heavy metal blasting in the background. They have two pool tables and an outdoor patio where patrons partake in their smoking choices of the day. If you get hungry there are some food options in the kitchen inside.", "author": "Jim G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-24", "description": "Solid little dive bar. Drinks are inexpensive. The back patio is pretty small. Staff and clientele are friendly. They also sell a bunch of fried food so if you want something to go with your adult beverage, you'll find it here.\n\nThey carry Blackberry Pear Cider which is probably my new favourite drink of choice. It was a little rainy when we stopped here, otherwise, we probably would've sat out in the back patio for a little bit longer.\n\nIt wasn't too crowded but it was in the late afternoon on a Saturday.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-15", "description": "Spacious place, which is rare for a bar in San Francisco. Two pool tables. Small patio out back. Lots of booths and varied seating. Good spot for an afternoon beer.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "Pros:\n- beers are $5\n- cool divey/biker vibe\n- funny fake ID's encased in resin covered tables\n- game of pool is $1 (in quarters)\n- good for groups\n\nCons:\n- cash only\n- music is REALLY loud\n- VERY grungy (but keep in mind that this is a dive bar)\n\nBottom line: this is a cool place, but I felt kind of uncomfortable how dirty and sticky everything felt. I wouldn't go out of my way to return, but I've heard good things about the brunch, so maybe I'll be back.", "author": "Jiann M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-07", "description": "I usually hate hipster dive bars, but this one wasn't so bad. Bartenders were on it!\n\nGood margaritas and awesome tater tots. \n\nNothing else to see here except hella city lumberjacks with pointy beanies. :)", "author": "T C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "2 Pool tables, hanging bicycle racks, the menu looks good (I didn't try any food), service was fast and friendly.  Good beer list and selection of liquor. My bourbon & soda was in perfect proportion. A hidden gem in the mission!", "author": "James B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-03", "description": "This bar is a Mission institution. However, much like Zeitgeist, the staff is very unpleasant - I've been going for over 10 years and am always super nice but no one remembers me. The food just *barely* doesn't give you the runs since the new kitchen started. That said, I always go every Wednesday cause the drink combos own and the crowd is remarkably entertaining. Sometimes a bad thing is good no matter what.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-16", "description": "Of course this bar requested to remove my review. Yelp, you want a more detailed explanation of the incident? Here it is. PG-13.\n\nMe: Excuse me, this isn't a Racer 5. Can I please get a replacement?\nBartender: *yelling* Honey, I poured you a Racer 5.\nMe: Please don't call me honey.\nBartender: *grunting and huffing/puffing*\nMe: Can you please take a taste? This is not even an IPA.\nBartender: *yelling* HONEY, I DON'T EVEN DRINK IPAs AND I KNOW THIS IS A RACER 5. \n\nHe takes a taste. Grunts. Pours a taste of Racer 5 from the tap. Slams it down in front of me.\n\nBartender: *yelling* DRINK THIS AND TELL ME IT'S NOT THE SAME BEER.\nMe: *takes sip* It's not the same beer.\n\nAt this point, the bartender SWINGS his arm across the bar at me, knocks another patron's drink into his lap and yells, \"B****, THIS IS WHAT HAPPENS WHEN YOU PISS ME OFF.\"\n\nMe: You just knocked his drink over and you're blaming me? All I did was ask for the beer I ordered.\nBartender: GET THE F*** OUT OF MY BAR.\nMe: F*** you. All I did was ask for the beer I ordered and you flipped out. This is incredible.\nBartender: B**** DO YOU WANT TO TAKE THIS OUTSIDE? \n\nSo, after being threatened with violence - both with a fist coming across the bar and a threat to fight me, a woman, outside - I returned to my table. At my table, there were 2 people who had tried my beer and also confirmed, no. This is not an IPA. Those 2 people also tried to reason with the bartender at which point he said, \"She told me to F off.\" I said, \"You tried to hit me from across the bar. I want my money back.\" Of course, the bartender refused. And the worst part? The middle-aged white men drinking by themselves at the bar said it was 1) my fault he swung at me and 2) told me I would never drink on 19th again and if I did, I should be afraid.\n\nSo, 1 star for the funky ambiance. And 1 email to the ABC of San Francisco to report the bar for violence against patrons.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-25", "description": "The bartender with all the tattoos, wearing the beater and beret was extremely racist. Out of nowhere, he told me to get the F out and said I wasn't welcome there. Not sure if he was just drunk or always racist, but his behavior shocked the rest of my group. If you like white supremacist bars, this is the place for you.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-20", "description": "It is usually very hard to make me disappointed at a place. Someone needs to be extremely rude and play racist card very well to achieve that. People who work at Bender have no idea what they are doing. Very rude and offensive. \nFood is very bad and you will ended up with stomach flu.", "author": "Hamed F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "What an awesome place! I was here last week for my friend's bachelorette party. The bartenders were super awesome. The drinks were cheap and strong. The tater tots and mac & cheese were pretty good, or maybe it's because I was drunk, but they were good! The space is big and they even have a photo booth. (Also, see if you can spot the Merchant's Saloon sticker behind the bar.) I'll keep this place in mind the next time I'm in the neighborhood.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-28", "description": "Fun dive bar. Pretty lively even at 5pm on a Saturday afternoon even though it's kind of far from other places in the Mission. You've got a bar, pool table, and apparently decent tacos/pupusas (they just appeared at our table.. actually in retrospect, I'm not sure if my friends got them somewhere else).\n\nOh, best part? I lost my back blinker light for my bike at some point that night and back tracked through all the bars we went to. Bender's was my last stop and by then I was feeling pretty dejected, but even though it was late and they were packed at that point, the bouncer offered to watch my bike outside if I just laid it against the building, and the bartender looked through the lost and found drawer and found my light!", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-11", "description": "Benders ROCKS on all levels.\n\nMy coworkers and I came here based on the Yelp reviews and you guys didn't let me down. I love everything about this place:\n\n- Friendly bartenders - don't let their tough, burly, tattooed appearance fool you :)\n- Laid back, friendly, fun vibe\n- $1 off beers on tap during happy hour (until 7pm) which makes the beers $3-$4\n- A photobooth and pool tables\n- Small outdoor area in the back\n- Their awesome tables made of confiscated fake IDs\n- A slammin-ass kitchen that throws DOWN some seriously tasty grub for affordable prices (kitchen opens at 6pm)\n\nMy Mac n' Cheese Sandwich nearly brought a tear to my eye. They served it with tater tots! I hadn't had tots since the days since my junior high school cafeteria days. They even carry vegan wings! How San Francisco of them.\n\nBasically, I give them a HELL YES all around.\n\n*cash only*", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "I have absolutely no memory of this place, but I did find some photo-booth photos from here in my backpack the next morning, where I appear to be very happy indeed, so I guess this place was great!", "author": "George B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "I love this place.  Dogs can chill inside if they are on a leash, really nice bartenders, $2 PBR, and free BBQ on Sunday.  People seem to be really laid-back and non-pretentious.  I hit up one of the karaoke nights and it was a fun time,  lots of people in good spirits and I heard an excellent cover of the Patrick Swayze classic \"She's Like The Wind\".  5 stars!", "author": "Judy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-17", "description": "WTF Benders. Why change the menu after YEARS of loyalty from your neighbors?!?? What happened to the fantastic Cockless vegan buffalo sandwiches & Satan's sandwiches? Why change the menu into stupid portobello sandwiches. Yawn. As if you couldn't get that from any Olive Garden. Welcome to Benders that caters to the Suburbs.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "Great dive bar with awesome food. I was told that the burgers were the best in the city, tried one, and can definitely say that it was one of the best burgers I've ever had.  The staff were also very nice.  My girlfriend wanted the gumbo but they ran out, so she ordered something different.  They then realized that they had made a new batch, so they gave her a side of gumbo absolutely free for her to try.  Dog friendly too which is a plus.  I will surely come back.", "author": "Shibin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "The kitchen is closed on Sundays but as a Bender's gift to you, Every Sunday from 3 till 7 pm, they'll treat the public to a free BBQ with burgers, veggie options, or whatever else the bar's in the mood for on the back patio.\n\nInside there are two pool tables to keep you occupied.\n\nTo top it off, Clare's Deli takes over when the BBQ winds down with complimentary sandwiches to fill your belly into the late hours.", "author": "M R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-03", "description": "Three stars mostly because the menu changed and I went there wanting specific items. The atmosphere was cool, but service was kind of slow.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-25", "description": "Nothing special about this place. It's another dive bar in the mission. \n\nCan't go wrong with a pool table and cheap beer. Well, yes, actually you can but I won't go into the details. \n\nIt's really dark inside. A) get drunk enough so that the next greasy haired chick that walks through that door looks hot enough to bang or B) watch a nice game of pool and make awkward small talk about things you don't care to know about the other person. \n\n...you decide.", "author": "Lydia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-03", "description": "Drinks are fine. Sometimes a cover if a band is playing. Pool table + outdoor space. \nHas a 'tough' hip punk/metal attitude going on which is always amusing to observe. Really, it's ok smile.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "MMMMMmmmmm..... delicious Bloody Mary w/ beef jerky garnish. Really divey and fun!", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "Great place, far enough away from Valencia St. to have its own identity, but still a cool spot to have a couple of beers, meet some friends or chat with the friendly bar staff.\nAlso, if you like IPAs this is the place for you!  Actually, whatever kind of drink takes your fancy they either have it or will rustle it up for you.  Not much beats a delicious Bloody Mary on a hungover Sunday afternoon.  Well, actually one thing does.  Enjoying a delicious Bloody Mary on a hungover Sunday afternoon while having a freshly grilled veggie burger in the backyard. Fuck yeah!\n\nThey have a barbecue on Sundays and a poutine evening on certain Sundays too if you're still peckish.  On other days of the week the kitchen will feed you tasty burgers, seitan dishes, tater tots and a whole host of other offerings to accompany your cold beverage.\n\nIf that's not enough there is live music every Saturday with a good range of music from country to rock,  from metal to hilarious Kiss cover bands and incredibly talented original acts.  In fact, many famous musicians have played on Bender's stage and many who play there will go on to be recognized.\n\nFuck, now I'm in the mood to go have a beer and see a band!", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Such a great dive bar. Off Mission, so not crowded with tourists. Plenty of great brews on tap, including Pliny the Elder and some good stouts. Pool, pinball...haven't tried the food, but it looked great and I plan to on my next visit. Good people and good vibes.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "BEST DIVE BAR AND GRILL! Drinks are reasonably priced and the food is so good that it will make you feel terrible about consuming so many calories but have you smiling while doing so. This place has got one of the better veggie burgers I've had in SF. I'm a huge fan of the fried mac n cheese sandwich, the grilled cheese with pulled pork BBQ and tater tots. See what I mean, these are not light bites but nearly the best comfort food I've ever had! Whoa.\n\nDid I mention pool tables and a small outdoor seating area for those few SF warm evenings?", "author": "Sheena A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Bar service was friendly. Good beer selection. The food is really where it's at with this place. The small grill inside the bar serves excellent food. The service at the counter of the grill was friendly as well. I had the fried pickles as a starter, excellent. The cook mentioned that they pickle the pickles themselves. The batter on the fried pickles was light and fluffy. I had the Bender Burger for the main event. I could taste the freshness of the beef patty. It was smothered in a delicious sauce. I have had a lot of burgers in my life, but I can't remember ever having one as good as the Bender Burger. The burger really was that good. The burger was paired with a nice side of heirloom tomato salad. The salad was cool and refreshing, the tomatoes were so ripe and flavorful, excellent pairing. I highly recommend Bender's, the food especially.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "Love Bender's. Been coming here for as long as it's been open. Awesome food, good drink prices, nice patio, good bands and even a loaner motorcycle helmet for when you get lucky. Johnny and the crew always do me right and it's even got an epic jukebox and good pinball machines. Enough said. Cheers!", "author": "Armand C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "I have to admit , the Bay Area is not known for its super nice bartenders. But after reading that bad review. I know why. Patrons that frequent a spot for a year and one at six years, complain about one night and they do not even know the employees name... Lame.\n\nEven worse , if it is a spot u like.. Way to trash it. Good to know this will not be a spot they are returning to. There use to be this shitty mean dirty kick ass bar called the zeitgeist.. But alas still there but no longer a real bar. Sounds like a perfect place for your next yelp", "author": "Alexandra P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-08", "description": "I'm the black sheep in my friend group--I'm not the biggest fan of Bender's. I guess I'm old--it's too loud to be able to talk, and that's what I like to do when out with friends.\n\nWe usually get a table right in front of the bar, but if you can nab one that's further in the back, it's awesome. If you can get the tables with laquered expired drivers licenses, even better.\n\nDrinks are cheap, there's pool, a shit ton of bikes, and dollar bills pinned to the wall. So there's that. \n\nThe good: you know, normal drinks.\nThe bad: the yelling bartender.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "I live a little outside the city... you know, Pennsylvania. I lucked into this place because it had what I was after; cheap eats with good reviews, and decent drink prices. At 5:00p they already had a bouncer outside checking IDs. It's the perfect kind of dive-bar. Super-diverse crowd, good rock music playing but not so loud you can't talk. I had very modest expectations when it came to drink selection, but they had both a Pliny the Elder on tap, and Lagavulin whisky; two of my favorite drinks in the universe. Several other beers and fine whiskies were available. It was love at first drink. The bar is cash only, but the food, a short walk to the other side of the bar, takes cards. I had their signature Bent Burger with grilled asparagus. My taste buds were so happy they high-fived my cheeks. One of the best burgers in memory and the asparagus was delicious. Bartender was friendly. The only bad thing I can say about this place is that it is 2,809 miles away from where I live. I will visit Bender's every time I'm in San Francisco unless I am kidnapped before I get to it.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-09", "description": "Benders is always where I like to start my night. The food is grilled and very vegetarian friendly. Don't pass up on the Mac n Cheese or you'll kick yourself when you do try it for not ordering it before. \n\nThis place is unpretentious and has cool concert posters hung up.\n\nAwesome juke box and a pool table. Get here early for booth seating. \n\nOh and they have a back patio for drinking Tecates!", "author": "Danny G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "I was happy to find a legit dive bar only a block from where we were staying in The Mission. The Bender burger was awesome, and while I'm not normally a fan of tater tots I have to admit they were really tasty and crisp. \n\nThe tables could use a lot more wiping - and that won't even make the place seem yuppie, and my date was understandably upset when the patron at the next table started toking on a pipe, so it's pretty seedy. Still, it's genuine and I'm not sure we can blame the staff for the action of one asshole.", "author": "Avery A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "Benders is a classic, one of my favorites.  It was a regular stop in the tour of dive bars on a Friday evening and always had an edge on the others because of its size and food offerings to appease both vegetarians and carnivores alike.  Bartenders are solid here, quick and efficient and don't waste your time or theirs.   If you are a dive bar connoisseur, then Benders is a must try.", "author": "Saminda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "One word to describe this place: Badass, the  food is badass. YOu can taste the smooth badassness that makes you wanna say hell freakin yeah!! They came at a great timing too. I got a cool lil number to put on my table to get served.  The pool tables are badass, sticks fit perfectly for playing pool and I've found that the pin ball game has given me plenty free games. The liquor combos here are excellent I got buzzed and buzzed yet felt really good while watching the giants game. Some cool ass bartenders and waitstaff here bro! The music is killer too, nice blend of rap/hip hop and some badass rock. \nI didn't hear anything wack. They gotta cool lil patio out back too, pretty small tho, great crowd. Very bike friendly , They've got tons of racks for your bikes to be placed. \nI've been here on the most random days in the week an its always been a cool vibe of badass ness. Great beer selection too, ales upon ales man . great hard liquor selection too so you can rock hard.  I dig all the writing in the bathroom too", "author": "Luke S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-13", "description": "I heart Benders. Very fun, music and live shows are awesome. Most importantly - they make drinks good and strong. Plus the food is good, everything I have had has been awesome.\n\nLove, Love, Love ~ BENDERS!", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-23", "description": "came here last night on a pseudo 1st date last night .\n\nI came with zero expectations and it had everything that a dive bar needs.\n\nCheap booze..... check!\nSmelly.... check!\ninteresting decor.... check!\n\nbonus??\n\ngrilled friend mac and cheese.... (i did not try this because i already ate, but it smelled great!)\n\nlots of space... and did I mention cheap drinks???", "author": "Anne-Mary P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-24", "description": "Bender's sent me a very thoughtful response with an apology and an offer for a few free drinks next time I was in the area. Their apology was sincere; I'm keeping this place on my dive bar go-to list.", "author": "Jesse H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-01", "description": "Been to this bar a few times and was very happy with drinks, food and atmosphere, until the recent episode, when a very rude bartender first didn't accept an European driving licence, then in the end has served the drink, while saying that the customer is ugly enough (?!) I think this kind of behavior is inappropriate even for a very bad dive bar, and definitely not like the fancy one Bender's is trying to be. Don't go there if you don't want to be treated like shit for no reason.", "author": "Kat G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "This place is awesome. Don't come here and ruin it techies.", "author": "Dave C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-20", "description": "Bender's  is the bottom of the barrel with gooey sludgy bacteria; yeah, that bacteria is what makes your beer taste not quite right;  that is what makes their draft beer taste wrong; IT IS THE BACTERIA!  The beer is dirty.  When you order a tap beer, it is warm and yeasty . . . gross :(  I used to go here and order bottle beer because it was close to my apartment and had a pool table, but never again. I wouldn't complain or give a bad review normally because I wouldn't want to hurt the bartender's business and tips, but the batenders were soooooo rude; it was inexcusable.  I'll never go back again.", "author": "Julia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-17", "description": "Funky vibe. Good music. Laid back and friendly bar staff. Small, smoke-friendly patio. \n\nBender's is a great place to see a show (Noise Pop Happy Hour is held here), drink a beer (killer happy hour and Pliny the Elder on tap) or grab a bite to eat (Seitan tacos! Who knew? Like soyrizo, only better. And tater tots to kill for.)\n\nBender's is my go-to local bar until further notice.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "Came here Friday night for a friends birthday. Bars aren't exactly my kinda scene but had to make an appearance . To my surprise this is a pretty laid back, inexpensive fun time. It seems like they have a little something for everyone; 2 pool tables, 1 gaming machine (poker and a few other games), a pin ball machine and karaoke. \n\nSomething we all found a bit strange was after a 2 hour set up time for the equipment to get the karaoke set up all of these 30-40year old women came out of nowhere and pretty much took over the bottom quarter of the food area to dance and prep themselves to sing. There were some pretty entertaining dance moves. By that I mean it was like watching dancing muppets, flailing inflatable tube men and possibly some pantomiming of an electrocution. Yeah! Funny if nothing else.\n\nThe CONS:\n- the \"karaoke\" area is a 5ft wide, 3ft deep top step of a divider between the pool table area and the \"cafe\". It makes it a bit difficult to move when the place is full. It would make more sense to have it in an corner where no one has to bump the singer and their backs are closer to a wall. \n\n- the cushion on the benches are deteriorating and there's giant dips when you go to sit. \n\n- some of the very interesting tables have giant holes where the plastic has been burnt away. \n\nAnywho, beyond some random little interior issues this is a really good spot to meet up with friends and have fun.", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "5 stars for benders!! why you ask? \n\n- the bartenders are fast, whether it's busy or not. \n- great food that includes vegan AND vegetarian options! im neither but this is def important for a lot of people. \n- nice big space which is such a commodity in the city. \n- pool table \n- a place to put bikes\n- and the biggest reason I love them: they have anchor steam liberty ale on tap which is my favorite beer! only $4/pint, a steal :) \n\nwhat's not to love?", "author": "Alyssa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "Not gonna lie, when we first walked into this place I was a bit skeptical. We ordered a pitcher and I had a \"Blast\", which is probably one of the best BLT's I've had at a restaurant. Everyone enjoyed their meal and they have a pretty good sandwich/burger menu. They do a great job catering to vegans/vegetarians. There is a pool table and it's a pretty chill environment.  I would definitely recommend it.", "author": "Leona G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-07", "description": "Oh, this place is such a dive bar. It's dingy. It's dark. It has a bald, burly doorman. You've been to places like this before. Right?\n\nI was here several times for happy hours related to the NoisePop 2013 festival, and it's an okay place -- your typical dive bar. Seating is very limited, so most people had to stand. \n\nThe really great thing about this joint is the little kitchen tucked around the corner. I helped one of the guys working there with his chalkboard menu, and he rewarded me with a helping of their macaroni and cheese. OMG. It's an orgasm in a bowl, one of the best things I've ever eaten. Normally, I avoid carbs, but in this case, I couldn't stop; it was that good. \n\nAnd as if that weren't enough, to have the best mac and cheese I have ever tasted, they also stuff it into a grilled cheese sandwich. Someone gave me a bite, and wow, just wow. I think I almost fell in love with him just because he had the good sense to order well. Wow. So if you go there, you owe it to your taste buds to try the grilled cheese sandwich stuffed with mac and cheese. Your waist will forgive you later. \n\nOkay, so I'm not much of a drinker...Blah, blah, blah...They serve beer and a shot for a special happy hour price, they have lots of beers on tap, a full bar, blah, blah, blah. And all of that pales in comparison to that macaroni and cheese, for which you must make a special pilgrimage to Benders. You won't regret it. Promise!", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "I love this dive bar, l've been here many times, the atmosphere & beer selection are impressive, the backyard patio is great for smoky evening or sunny day and friendly for dogs, the bartenders are nice, friendly & welcoming, on wednesdays a selection of wiskey and pabst for $5. Free barbecue on the patio for sundays, try the grilled cheesus christ with bacon, extremely delicious, the burger has bourbon and bacon ground right into it. On Sundays burgers are different though but free. Get yourself  a favor and get here for a beer and some grub.", "author": "Jorge B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "Great patio. Lots of indoor seating. Decent beer selection. If you are with a group, try to get a pitcher.\n\nEnjoy the people watching!", "author": "Tracy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "Such a great bar, with awesome beer, AND a photo booth. \n\nDrink of the night: West Coast Pale Ale (5 stars)\nBand: T&A (great twang)\n\nInteresting characters here, never got too crowded.", "author": "Abigail W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-05", "description": "I've been here twice- not by choice. Definitely has a die hard local, regulars scene. Pretty much if you don't fit in you're treated like you don't belong. \nSpecials were decent. 3$ wells on Friday for happy hour was a nice come up. Have not tried the food but from the looks of the place I honesty don't think I'd want to.\nIt's your average bike loving rock and roll wannabe dive bar.\nNo minorities what so ever.", "author": "Diana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "Warning--Cash Only!  There is an ATM but pricey fees.  A fun place with a lively crowd and good food (from next door).  The tacos were awesome along with the hush puppies and tater tots.", "author": "Meredith S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-14", "description": "$5 PBR + Shot of Whiskey = Whiskey Wednesdays\n\nI like their photobooth.", "author": "Jessie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-02", "description": "Lots of motorcycle riders, lots of bicycle peeps, killer jukebox and did I mention how much I love the bar tenders? \n\nLittle hint: try the fried dill pickles. \n\n{()}", "author": "Cooter T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-30", "description": "Cheap beer, chill atmosphere, street parking, hipster crowd, lots of people. Pool tables, a photo booth, bring your dog and show off your cellulite. The more celluite you have, the shorter your skirt should be!\n\nOh, and Karaoke on certain Fridays (see their calendar)\n\nSeriously, $4 for a beer! I don't think I've ever paid so little for a beer in SF.\n\nI don't know..the guy at the entrance who was checking ID blew smoke in my face and a lot of people had some pretty serious BO. Hence the 3 stars.  Yeah, I'm pretentious, or umm civilized. Bite me.", "author": "Kathy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-14", "description": "I didn't know it was a grill also.\n\nAt any rate, this is a straight up dive bar.\nSince I'm in a dive bar phase I really enjoyed my experience since I had a good draft drink and had a good conversation without talking over some Top 40 song.\n\nGood location in the Mission area.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "My boyfriend and I popped over to benders last Friday night for what we thought was going to be a short wait for flour and water. Well, that \"1 hour\" wait turned Into a THREE hour wait.. So we spent most of our night at benders, and glad we did!!  What a fun time we had, laid back setting, rad people, unique karaoke, decent beers, and the best part was the bartender named Andy. He was totally awesome, easy to interact with, and really made it a super fun night! \nGood times to be had by all.", "author": "Dayna E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "A list of reasons why I like this place:\n1. Cheap drinks\n2. Lots of space\n3. Great bar food (I highly recommend the bacon mac and cheese)\n4. Pool tables\n\nThe atmosphere is very grungy and rock and roll, but it works. It works awesomeee! The bartenders aren't the friendliest if they don't know you, so that's the only reason why I can't give it 5-stars. \n\nAlso, it is cash only!", "author": "Mirela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-20", "description": "Because sometimes you want to be able to invite a group of friends for  a drink or two......maybe even have a bite of food....this is a reason to visit Bender's Bar and Grill.\n\nA bar and grill? \n\nWhy yes. \n\nHappy hour ends at 7, the grill opens at 6. What a perfect combo!\n\n$3 gin and tonics got me working up an appetite for a pulled pork sandwich with a side of tater tots ($9). Sandwich was super tasty and the tots, perfectly browned and crunchy married well with sriarcha. (veggie friendly menu...will try their fried pickles, next time!)\n\nTons of seating inside and out, to hang out and lounge (there were a few groups in the place while were were there, never felt like we were infringing on each other's fun). Two awesome bartenders, clean bathrooms, rockin' music. what else could you ask for? \n\nDue to location, I would suggest walk/bike/MUNI there, parking can be tricky. Plus the bar is super bike friendly with bike 'parking' inside!", "author": "Hilda Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-17", "description": "Bikers everywhere. the food was pretty good.\n\ni did feel a bit out of place since i wasn't wearing clip-in shoes, my bike helmet, and a backpack that could hold 94% of all my worldly possessions. \n\nbut beers were pretty cheap.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-30", "description": "So why am I reviewing this place, even though it's a bar? \n- It's surly but welcoming\n- the bartenders are cool\n- THERE'S A SMALL KITCHEN THAT MAKES BURGERS!\n- And the Philly Cheese-Fake with seitan instead of beef was pretty damn good, and it's the first time I voluntarily ordered a vegetarian item in a while!", "author": "Navi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "Excellent beers on tap and tots (the fried potato kind, not children). Apparently there are other things on the menu, but this is what happens when this gal's an arm's length away from a basket of potatoey nuggets from heaven.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "Cool little neighborhood bar. Dive-y, but sociable and fun. Good music and pool tables. The food was fantastic. The fried artichoke hearts were tasty, but a little bit too heavy for me. The vegan buffalo chicken sandwich with tater tots on the side blew my mind it was so good and spicy. I will definitely be coming back.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-17", "description": "My partner got drugged there last night and robbed. We only live 1/2 a block away and she woke up outside our house having no idea what happened. Watch your drinks!", "author": "jess s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "Great atmosphere in this place. There is a PHOTOBOOTH people!!!!  Bartenders are very energetic. Pool tables and the best Mac and cheese, jalapeño, hot dog and potato chip sandwich. Definitely coming back!", "author": "Christine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "I'm confused why I don't hang out here everyday. Starting now.", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "I like this bar, but what I love about this bar is the food!! \n\nThe macaroni and cheese sandwich is to die for. I also hear the Blast sandwich is amazing. The tater tots here are crispy and delicious. \n\nI also enjoy whiskey Wednesdays. A shot of whiskey and a PBR for $5, what a deal! They also have a pretty good happy hour. $1 off draft beers and $3 well drinks. \n\nConsidering this bar is a bit on the grungy side, the bathrooms tend to be fairly clean which is a lot more than you could say about a lot of bars in the mission. \n\n4 stars!!!", "author": "Saralee L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-13", "description": "Fun place.  Too bad the grubby little doorman with the stretchy things in his ears was such a jerk two Friday nights ago.  Made a snide comment about not being a \"gentleman\" because I didn't wait for the girl by the door to finish digging through the deep depths of her purse for her ID, while I had my ID ready.  He mumbles almost under his breath as I walk in, \"Usually the gentlemen let the ladies go first\".  I turned around and walked out.  Enjoy your power trip, my friend.  Hope it got you some cred with the lady.  This is as high of a station as you're gonna attain in life.  Rock it like two turntables and a microphone.\n\nI'll come by when you're not at the door and enjoy this otherwise fine establishment.  Burgers look good.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "Classic metal dive bar and Mission archive   - but I'm really bummed that the vegan food is gone. Check out the former chef's new bar Analog in Oakland which has an even better seitan menu.", "author": "Danny T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-11", "description": "Place is pretty gross even for my admittedly low standards. Bartender didn't really know how to pour a guinness so I asked for something else and he told me to f* off LOL", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-18", "description": "OMG, WTF\nI found myself near Bender's (http://www.bendersbar.com/) and they weren't closed finally. Third time was the charm. I saw their menu online and they serve \"Satan's Little Helpers\" which sounded incredible. A sweet name. I sat down at the bar and ordered a beer. Then went to the back and put in the order for Satan's Little Helpers. When they came I thought I was served tater-tots. I think they were ground chicken deep-fried. I have no idea what they were. Just little soggy nasty balls. And the sauce was not even spicy. And the chicken was not even good. I had no clue what I was eating. Geez. Don't get fooled by the name.\n\nitsawingding.blogspot.com", "author": "Christopher R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-29", "description": "I like this bar so much I had my birthday party here last Saturday. The top three reasons why I picked it:\n\n1. MARGARITA MADNESS! It's like drinking a pint glass of tequila with one squirt of lime. And you better believe I double fisted them last weekend.\n2. They allow outside food! My boyfriend surprised me with a birthday cake and some friends ordered a bunch of pizza. We had a regular old picnic on the back patio.\n3. Everyone is nice! When describing Bender's, I say it's like Zeitgeist's younger, prettier sister. \n\nAll in all, a dandy place to spend a birthday.", "author": "Rebecca P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-08", "description": "Photo booth: check. \nPliny the Elder on tap: check\nGrilled cheese, tots, and grilled cheese+tots: check.\n\nHell yeah to all of the above. I'm not hip enough or bike-oriented enough to fit in in this place, but the vibe isn't bad. A good standby for big get-togethers and a good stumbling distance from my casa.", "author": "Tara R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-16", "description": "Yelp. You point me in the right direction once again. Praise you. I was feeling divey one Tuesday and found this little gem off south vanness. One word to describe...AWESOME. Happy Hour specials plus cheap food really does hit the spot. Benders is like a cross breed of El Rio and Broken Record. What makes Benders unique is that they offer clothes swaps inside the bar. I asked one of the ladies how much and she laughed and said it's all free (optional donation). I was overjoyed but the clothes were a bit too big for me to take. They have a pool table, trippy art, vegan wings (YES, vegan wings), cheap drinks and friendly vibes.  I wish it was a bit cleaner but you can't expect that at most hole in the walls.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-14", "description": "This place consists of my very favorite things in the whole wide world (minus my dog, but I should ask if they would let me bring her in)!!!  :)  Those things are Beef Jerkey, Bloody Mary's, an Amazing Beer Selection, a Jukebox full of 90's grunge and Classic Rock (with a lot of punk mixed in there), friends and drunken pool playing!!!!!  \n\nI stumbled into Benders for some day drinking (my fav), and got myself a bloody mary.  When I received my BM I swear a light shining from heaven was spotlighted on the BEEF JERKEY stick that was so exquisitly arranged as a stirrer, joining an abuntant flurry of greenery (pickled veggies and a celery stick).  It might have just been the overhead lighting but I swear, a single tear trickled from my right eye.  I took my first drink, my heart was touched, and I have never felt the same about another Bloody Mary!  \n\nOh and they serve Red Stripe and Trumer!  ;)  Go here, you'll love it, or don't so there's more Jerkey BM's, great beer, and good times for me because you'll prob make it annoying!", "author": "Brandy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-25", "description": "My husband and I happened upon this bar when we were looking for a break from the street food festival.. 2 hours later needless to say needed more food, had a long ride back on Bart but loved the bar it had just opened, the bartender made my Bacardi and coke just right she even shared her kale Cesar salad with me so I could taste the homemade dressing her boyfriend made the night before. Love the decor!", "author": "Monica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-17", "description": "I can dig this place especially because of that greasy kitchen in the corner. Thank heaven for that grilled cheese sandwich with tater tots. It saved me and boosted my happy drunk. \n\nThis place is lively, there's live music, and plenty of space. \n\nGrab a Pliny and enjoy your night.", "author": "Maggie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-26", "description": "Definitely a neighborhood/dive bar.  Great selection of draft beers.  Stiff drinks and a great grill menu, including my favorite mac and cheese grilled cheese.  All your calories for a week in one satisfying sitting.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-26", "description": "I could see this place being a pretty good bar, since they have karaoke and a pool table, but unfortunately, I didn't get  to experience any of that because we waited an hour and fifteen minutes for an overcooked burger. There's only one cook, and it's a small-ass kitchen, so I could understand that it would take some time, but it's the job of the person taking the orders to give you a heads up on how long the food's going to be.\n\nAt least it was entertaining to watch the karaoke.", "author": "Badier V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-23", "description": "This review is gonna be about the food, because we can here after work looking for some quick bar grub. I liked the divey feel inside with decals and stickers everywhere. Two pool tables and a kitchen in the back that opens at 6pm.\nThe beers were very cheap for both draft and bottle, which explains why it was so popular on a rainy evening. My friend ordered the pork sliders, which came with a side of tater tots and looked like alot of food. I got the grilled cheesus christ sandwich, which was a grilled cheese sandwich with sliced tomatoes and also came with tater tots. It was greasy, comfort food that we were looking for and it was very satisfying. \nThere are a lot of hipsters, like most bars in the mission, but if you don't mind them then its a great place to kick with friends after work.", "author": "Alfred L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "Love this bar!!!! Totally awesome place to hangout and have a couple of drinks with friends in SF!", "author": "Kiana O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "Got the Fish Tacos today and they were awesome! Good job dudes. Great bar with a solid draft beer lineup. Got a Pliny.", "author": "Ben S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-12", "description": "Multiple local fucking awesome IPA's for $4-5: YES\nSeitan wings and tacos: YES\nHuge space with tons of seating: YES\nPlenty of bikes/tattoos/dogs to ogle: YES\nBartenders who are both intimidating but super friendly: YES\nNot having to deal with the Marina crowd infiltrating Mission bars: YES\nClean bathrooms with hilarious/awesome graffiti: YES\n\nA++", "author": "Cori W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "The last spot that is ours in the Mission. You guys are so great. Please don't get rid of the awesome jukebox.", "author": "M K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Good food, the BBQ Bent Burger was just awesome, and a nice selection of beers on tap. Bonus points for telling us that a pitcher is as much as the 4 pints we ordered but cheaper. Nice staff all around and a good selection of hard'n heavy music. We had a great time!", "author": "Fabian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "All the badass, beat-up-shit attitude of Toronado (lower haight) but LOVE the grilled cheese and tater tots here. Came here with a group for an improvised birthday party and had a blast! Really GREAT food when you get those kind of greasy salty cravings that are so dirty, you do the diet walk of shame the next day. That's right, it's that kinda good. ;)", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-08", "description": "One of my favorite neighborhood bars I like to visit! Great selection of beers on tap, a couple of pool tables to play with friends, and plenty of good tunes to play on their jukebox! After a few beers, with a buzz going on, I start salivating at their menu: I love their selection of vegetarian/vegan options; they're hella tasty. But hey, if you wanna piss a vegan off, put that bacon and cheese all up in those delicious burgers! ;)", "author": "Maleia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "Great dive bar with live music. Not too crowded and great prices. Food was a little slow but delicious. Perfect divey atmosphere.", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "I loved this place.  Great vegetarian fare, good beers, and a great vibe.  I will definitley be coming back.", "author": "emilie p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "YTDDOC  has given me a new appreciation for the art of the dive bar. Bender's is a good one.\n\nFirst, let me say that the place is *huge*. As in enormous. There were easily 50+ people there and still there was enough room to swing at least three cats.\n\nThe bartender when I went seemed nice enough; not sure what's up with all the people complaining about surly service.\n\nDrinks are cheap and (if you get a mixed drink) generously poured. Tap selection is on par for what you'll find in SF these days, mostly micros with the el cheapo PBR (of course) thrown in.\n\nThe food setup is a bit odd. There's one guy making food and he'll take four or five orders before telling everyone to go away until he's done cooking that round, at which point you have a chance of being one of the next five orders. I lucked out and walked up exactly as he was getting ready for more, so I got food quickly. Others not so much.\n\nOnce I got food it was awesome. Tater tots (yes, tater tots are totally making a comeback, and I love it) were crispy on the outside, moist on the inside, and just the right amount of salty. Burger was cooked well, the cheese was all melty, and the toppings and bun held up and didn't distract.\n\nBottom line: Bender's is a good place to have a burger and some cheap drinks.", "author": "Sam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-23", "description": "I like it when people call me Sweety. As long as it isn't in a sarcastic bitchy way, that is.  To side note that: if you do happen to be brave enough to utter it in my direction (with that tone) I will take you down. \n\nAfter I located my friends and dropped off my various loads of paraphernalia, I made my way back over to the bar to get a drink.  I was enchanted by the hundreds of pieces of origami hanging from the ceiling and side noted it; \"to take a picture of\" for later. \n\nI was then rudely cut off by a guy whose drink order was apparently much more important than my own.  The bartender saw him do it and threw him a bit snark accordingly.  She carded me, called me \"Sweety\" and poured my drink quickly.\n\nIt was interesting because the drink I was handed at that point was nothing like the other two drinks I was handed subsequently afterward.  They got bigger and stronger but the price stayed the same.\n\nMy \"take a picture of the origami\" side note sailed away somewhere in the first few sips of rum/rum/rum/rum/rum & coke #3.\n\nThe tables are really cool; ours was various drivers licenses suspended in epoxy resin.  I befriended the table next to us (full of guys) as the night progressed.  As I pulled out various colors of play doh and then cards & chips - one of them remarked, \"How many games do you have in there?\"  He totally tried to help me cheat by telling me where to put my hand when drawing \"champagne toast\" with my eyes closed. I know it's \"effed up\" to have to draw it without looking Mr. Befriend, but those are the rules.\n\nMy favorite part: I had to charade \"Rags to Riches\".  My partner wasn't getting it, one of the employees was headed into the little kitchen area - stopped, watched me for a minute and said, \"What is this??  Some kind of tribal ritual?\" :P\n\nAfter I got home and the rum & cokes wore off, I logged into yelp with my fingers crossed. Only to find heartbreak, no one else has posted pictures of the beautiful waves of origami. :( I'm not sure when I'll get a chance to get back to Benders but when I do, that will be objective #1 upon re-entry.", "author": "Jenn N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-06", "description": "Came here with a friend recently to meet up with more friends.  Being two tiny girls, we didn't see anything wrong with getting carded at the door.  We walked in with my friend ahead of me, only to get chased down and screamed at by some psycho blond chick.  \n\nPsycho chick grabbed me by the shoulder (yes, she had the friggin' nerve to not only touch, but forcefully grab me), and said, \"You, and her, at the bar, NOW!\".\n\nAt that point, I'm totally confused and asked what for.  She said she wanted to check our IDs.  I told her we got carded at the door, and she said that they didn't have any doormen.  My ID was still in my hand, so I offered it to her, to which she barked at me again, \"AT THE BAR, NOW!\", as if we were little kids who had done something really, really wrong.\n\nSo I grabbed my friend, followed psycho chick to the bar where she glanced at our IDs for a second and that was the end of that.  \n\nMethinks that'll be my first and last time at Bender's.  \n\nDouchebags at the door + psycho chick (I actually have so many choice words besides \"chick\" for her) behind the bar = not my scene", "author": "Debbie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "Rockin joint.  I enjoyed a nice Death & Taxes, followed by many cheap drinks, they had a great Zydeco band that got folks to the dance floor.  It's also a motorcycle enthusiast hang out, what's not to like.", "author": "Jason F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-07", "description": "$1 off already cheap draft during happy hour. Hells yes.\n\nThe perfect dive bar.  The small wafting aroma of stale beer, pool tables, tatted bartenders and dark low-lit corners out in the middle of the Misson just a tad away from the chaos. \n\nEasily accessible from Bart/Muni for when you want to throw back some beers with anyone at all...come here. \n\nThey have tv's so they even have access to 'the game' whichever that may be on any particular day.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-29", "description": "For a place located in this part of town, I expected Bender's to be a lot more open to people from different walks of life.  Maybe I got shit about presenting my ID because I get sarcastic when someone who's in the hospitality/food/service industry tries to give me attitude.\n\nWho knows?  In any case, usually when a patron's been served and comes up for another round with empty glass in hand, you don't ask for an ID because he probably needed an ID to be served in the first place.  Anyways, on with the rest of the review:\n\nCrowd: Pretty uniforms!  It was a sea of lighter black, leather black, kinda black, and darker black.  Combat boots optional, but highly recommended.  If you want to fit in, just buy some shit from Hot Topic and throw on a couple of temporary tattoos.\n\nJukebox: Thank you, to the asshole who put on 45 minutes of Metallica.  (I'm a fan, but I don't need 45 minutes of thrash-era Hetfield screaming into my ears while trying to socialize.)\n\nAtmosphere: Think back to high school where the goth/metal kids hung out (you know, that back set of stairs with the light bulbs removed), and hang some used urinal cakes for ambiance.\n\nStaff: Pretty friendly and helpful (drink selections, etc), sans the ID Nazi.\n\nDrinks: $4 beers, decent pours, and the service is quick.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-12", "description": "Out-of-town Review\n\nI was visiting my brother in SF, and this is one of the bars we stopped at.  Pretty good dive bar feel.  You walk in, and there's a bar on your left, maybe 10 stools or so.  Straight ahead is a pool table, with plenty of room around it, so no need for weird shots or angles.  To the right (behind a wall dividing it from the bar) is a food counter, with maybe another half-dozen seats, and some small tables around it.  In the last quadrant, there's a small stage with some room behind it, include a pinball machine.  There was some stuff out back past the pool table, but I never made it that far . . . \n\nI had a pretty good night here, eating my burrito, having some Tecates, playing some pinballl, and shooting some pool.  Slightly bad experience in that I got skipped on the pool table, but that kind of stuff happens at a bar.  The dive bar experience was definitely punctuated by the fact that when ordering the Tecates, they pop the tab, and also punch it with an old school can punch opposite the opening.  While I'm too old to be chugging Tecates or Pabst, the little triangle hole definitely adds character.\n\nCan't comment on the food, as we brought in burritos for elsewhere.  Still, pretty cool that they serve food, and have no issues with bringing in outside food.", "author": "Ernie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Had the tater tots, vegan buffalo, and pulled pork roll. The portions are actually pretty big so you could split any of the sandwiches and feel pretty full. They had $2 PBR specials which is a really elegant pairing with the tots. I went on karaoke night, which can get really fun, but mostly clears out around 1 am.", "author": "Robert N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-18", "description": "DIVE DIVE DIVE right into some serious debauchery. That's what happens when you go into this place. Luckily for me I came in on a Friday night which turned out to be karaoke night! Fun shit! You got people being loud, rowdy, drunk, and completely enjoying themselves.\n\n* pbr+whiskey w/ gingerale = $5\n* nice art pieces around the entire place including two bender heads (from futurama) with Viking helmets. How fucking awesome is that. Benders like one of the top 3 best cartoon characters on tv. I just wonder if the bar was actually named after him? If you do know, let me know, so I can know and then everyone else will know. \"Do you know what I am saying.\" \n\nThis place gets real packed all the way till last call and even then the crowd lingers around the front wondering \"where the fuck am I gonna get more beer now?\"", "author": "fuck q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "Great place \nWhen we came here the kitchen was closed and we were extremely hungry. The bartender told us that we could run somewhere else to get food and bring it there. So after a quick run to Sanjalisco we were set. Cheap beer flowed fast through our throats only halted by tequila and whiskey shots.\nTake home message: tequila lights up the mood, consciousness requires centralized brain structures and can be partially explained by quantum physics, rugby players do not require helmets, cricket is not a real sport, bonding is a product of hormones, Cristovão Colombo was Indian, apple kicks android's ass, Timothee drinks cheap beer out of shot glasses making it easier to maintain the pinky up, Lance is a whiskey only guy, Ron drinks like a girl. And my male name is Fred.", "author": "Bea L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-13", "description": "*Walks into the door*\n\nYou! Stop right there! Don't move until I check your ID.\n\n*Continues pouring drinks for others* \n\nAhhh, this will forever be known to be as the psycho chick place (see Debbie L's review). \n\nYes, it was 3pm on a Sunday. We know it's not the busiest time of the day. But having one bartender running the place AND be the doorwoman is just inefficient. \n\nIronically, there was apparently a griller in the back grilling completely charred hamburgers for free. I'd take a free burger almost any day, but couldn't you work in the front instead. And as May pointed out, that might have been some not so good meat they used for them to cook it all the way through like that. No thanks on the \"Hershey squirts\" (as my microbio prof would phrase it) after eating it. \n\nPlus on the place is that it's quite big for parties and they have Russian River Pliny the Younge on the tap for $5. \n\nHow come even I don't get unwanted physical contacts with psycho chicks? :( \n\nOh, and happy early birthday, Brenda!", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "Where else can you listen to hipsters singing everything from heavy metal to Backstreet Boys?  Great bar, good tunes :)", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-08", "description": "Hail Seitan!! Good food, hefty portions. A pretty good rock bar, although it has a bit of an \"are you a regular here?\" vibe. The door guy can be a stickler for non-us IDs so bring your passport.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "Good food, good jukebox, and good deals on whiskey.  Yes sir.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-06", "description": "Online this place seems cool. In person, still pretty cool, good selection of beer and supposedly good food. I say supposedly because I never got my food, while 5 other people around me did. They all ordered burgers which came with tater tots. I wanted the mac n' cheese because I heard it was superb. They were out- cool, no problem. The girl taking my order tries to convince me to get the grilled cheese. A $1 more than mac n' cheese for a grilled cheese? What, is the bread baked on the spot? Doubt it. Well I'm a bigger fan of potatoes than grilled cheese, so I order the tater tots. Also, how long could it possibly take to deep fry some tots? Apparently more than 40 minutes. \n\nEveryone around me ate their burgers, WITH TATER TOTS. I asked the chic twice when she came around the table and after my friend asked about them a THIRD time, she only had a snappy comment and gross attitude. Come on now, service is key, people! Get off your greasy hipster pedestal and DO YOUR JOB. \n\nAt that point my $5 was much more important than winning this battle so I asked for my money back and told her to enjoy the $1 tip I had already given her. She waited until I walked away to yell that she was \"busy.\" Yeah, no sh*t. You were too busy being an a$$hole.", "author": "Norma .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-01", "description": "Please note that my review is based entirely on Bender's \"Hail Seitan\" veggie philly cheesesteak. \n\nI am on a mission to try every veggie philly cheesesteak in SF, and have now been to Jay's, Phat Philly's, and Ike's, but Bender's is my #1 pick so far by a long shot. Aside from the great name, they use a tasty variety of seitan, fried up right, with a smooth and delicious cheese sauce. My only complaint was that the roll did not have that crispy-on-the-outside-soft-on-the-inside quality I really appreciate in a cheesesteak. Still, worth trying, and even the fries were top-notch.", "author": "Gaelen X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-25", "description": "Another great dive bar with great food. I love it! \n\nBenders is a cool place--I came here last weekend when the weather was amazing and all I was craving was a juicy burger and some tator tots. This was the right place to go to. This place was recommended by a friend and she suggested the whisky marinated burger. It was a solid burger! Very juicy and moist and the jaleneno added a kick of flavor to it. I also ordered the tator tots and fried pickles. The tator tots were delicious. Very crispy and fresh from the fryer. The fried pickles were ok--they were a little on the oily side and while I'm not the biggest fan of pickles, I was persuaded to try them by my boyfriend. \n\nThe service could have been a little bit better. It looked like the cooks were a little overwhelmed in the beginning. It took them about 5-8 mins for them to even take our order, but I understand that they may have been busy. But still...it is important to wait on your customers as soon as possible. \n\nBenders is worth going to. Good food and good selection in beers.", "author": "Nadia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "Vegetarians, the Philly cheese fake with the house made seitan and tater tots is a must for being a vegetarian in the city.\n\nLove the dive atmosphere, the pool table, the beer selection is good, I could be better but maybe that would make it too crowded.", "author": "Saul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-22", "description": "This place is pretty cool. As a bar it's actually quite spacious especially for the area. There is a place for pool, places to stand and not feel cramped, booths, a bar, a small kitchen, with a huge area in the center. Beer selection wise they are nothing too out of the ordinary, pliney and death and taxes seem to be my standards here. But the food is really interesting. Mac & Cheese sandwich, tater tots, seitan tacos (see vegans you can eat bar food too) and your plane old burgers too. I am a fan.  \n\nEnjoy some of the weird videos and artwork around the place too for a trippy and sometimes scary topic of conversation.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "I usually judge bars based on the Friday night factor, which is as follows\n\nIf you go to the bar on Friday night and you can't...\n1. walk through the bar without being sexually molested\n2. talk without blowing vocal chords (with exception to when a band is playing) due to shitty music or screaming sorority-like girls\n3. order a decent beer (as in 9% Skullf$#k - not Bud F$@king Lite)\n4. eventually find a place to sit and chill \n\n...then this is not a good bar.  I don't care about your arguments of \"yeah, but if it's not crowded into the bathroom stalls it means it's not popular\".  Screw popularity.  I'm not looking for a \"happening scene\" where I can bolster my hopes of getting laid and check out all of the supercool fashion, be it hipster or metrosexual.  All I care about is getting my drink on with my friends and not feeling like I'm in a Denny's, at someone's frat reunion, or at any establishment anyone would label \"classy\" as those who generally use that descriptor have little knowledge of its meaning.  These are pretty much the standards, as I am a person who has a low bull$hit tolerance and a high fist-to-face ratio.\n\nI found this place to be accommodating to those standards on a Friday night.  A rare find.  Not a 5-star because the sound messed up during a band's set and sound guy didn't make any effort to fix the mistake.  Nonetheless, no staff got in our faces, no obnoxious patrons, decent music, not insanely crowded, and a surprisingly low amount of that special brand passive-aggressive pretense unique to SF.  Me likie.  \n\nAlso, would have liked to see a bit more on the beer front, but in their defense, Chimay and Duvel were in stock (Chimay blue though, bleh).   And decent food (aka burgers & mac n' cheese).  Put the ego aside and go here for a cold one...but leave me a space at the bar ;)", "author": "betty b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-30", "description": "There's a lot going for this bar - Decent drinks, fun decor, 2 pool tables, pinball, photo booth, smoking patio, burger counter, and karaoke the last Friday of the month! And yes, the Futurama character is prominently watching over both ends of the bar. (Go figure.) \n\nOn the down side, it gets packed by the door and bar (but opens up inside) and it's painfully loud.", "author": "Bill B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "My band played there last night. They give every band free PBR and Tecate all night. Freaking awesome! \n\nGrilled Cheese/ Mac & Cheese combo with tater tots: yum yum yum!\n\nSound guy Sam was really helpful, accommodating, and has awesome tattoos. \n\nDoor guy Chad was a sweetheart but with the right amount of BAD ASS. \n\nBartenders like Eric were friendly and pour a mean shot of Jameson. \n\nBut the real reason I give it 5 stars is because when I lost my phone and later found it at the bar, I saw that Johnny, the owner, had made sure to shoot a text out to like, the first 3 names he found in my contact history and wrote to them that Bender's had my phone. How altruistic is that? \n\nI appreciate it, Bender's. It was my first time there, and definitely not my last.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-28", "description": "Awesome place, friendly staff and amazing comfort food reasonably priced!  What is not to like about this place???  WOW  The drinks are cheap and the food? well....The grilled mac and cheese sandwich with bacon and tater tots can easily be shared with 4 people, HUGE portions, we all got meals and sadly had to throw most of it out.  We happened to be there on Karaoke Night, what a blast, good singers, bad singers and everything in between... Can't wait to go back!!", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-27", "description": "Sweet beer selection, great divey ambiance (though with way more room than your typical dive - at least during the week), good music rocking the jukes, TWO pool tables, fun bartenders, indoor bike rack, uniquely interesting decor and a nifty, little outdoor space combine to make this place pretty awesome. I still haven't tried their food yet so can't speak to that, but the fact that it's readily available is sweet.\n\nI plan on eventually checking this place out during the weekend to get a better sense of how it morphs while invaded by the inherently douchier weekend crowd.", "author": "Ed K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-03", "description": "I and two of my friends (we're 45-50) got to Benders Saturday night around 9.  I ordered two Jameson shots with Pabst backs and a Stella.  The waitress charged me for the drinks and after I took them back to the table, I realized we were short one Pabst.  I went back to the bar and reminded her I'd ordered two beers.  She said she'd given me two beers.  The missing beer wasn't at our table, in my hand, or on the counter, so I asked her if I could get another beer.  She replied she already gave me two.  No voices were raised.  Okay, here's where it gets interesting.\n\nA shortish, short hair young man with a beard pulls out two Pabst and shoves them in front of me and says:  \"Here, take your free fucking beer!\"  I said nothing took one of the two beers and, without comment, went back to the table by the front door.  At least now we had two Pabst.\n\nAbout 3 minutes later the same bearded bartender came from behind the bar and up to our table for the first time.  I said \"that was uncalled for.  I didn't mind paying for the second Pabst and I wasn't being rude.\"  He put his elbows on our table looked me in the eye with a smile and said \"Well, you got a free fucking beer out of it.\" I turned to my friends (we were nervous at this point), and I we agreed to drink these and leave.\n\nSo another few minutes go by, and the bartender comes back a second time to our table.  Again, he puts his elbows on the table and his face uncomfortably close to mine.  I say nothing and he says to me, again with a big, threatening smile and close to my face says:  \"So, how's that free fucking beer?!\" I said to him \"If you're threatening me I'm going to call the police.  He said \"Go right ahead!\"  I started to call the police, but thought better of it.\n\nThen, a few minutes later he arrived a third time at our table.  Same posture, smile, menacing--everything--and he says: \"So, where are your police?!\"\n\nAt this point, he leaves the bar to go outside.  My girlfriend gets up from the table and follows him outside and tries to reason with him and to calm him down. She was out there for about 10 minutes.  I was worried for her safety as well as mine--even just trying to leave--and at this point called 911 for potential violence at Benders on 19th and So. Van Ness.\n\nAs the three of us were standing outside, I told my girlfriend we were leaving.  As he turned to go back in the bar, he made one more comment to me about calling the police and headed back into the bar.\n\nA little about me:  I'm 50.  I have a job that pays me well.  I wear a long sleeve shirt, slacks, shoes, and I'm not about to get into a fight with anyone--not over anything. Not even over a $2 Pabst Blue Ribbon.  I was never rude to my original female bartender (even though we only got one beer).  She and I could have settled it ourselves.  I would have paid for five beers just to move on. . .and then this other bartender got involved.   An unreal experience.  Awful.  Never going back.", "author": "Homer J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-10", "description": "Tot-chos changed my life.  I can't believe I've lived almost 40 years and never had tater tots with nacho cheese and Mexican toppings.  Someone at Benders deserves a Nobel prize.", "author": "Needles K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-11", "description": "I have thrown a great many drunks out of the various bars where I've worked when they start trying to pick fights.  It never gets past a little shoving and name-calling before I grab someone by the ear (best way to get 'em off balance) and drag him outside.  Usually the phrase, \"What would your mother say if she saw this?\"  confuses them long enough that they'll stay outside and cool off for a bit.\n\nOh, I have a point, I promise.\n\nAt any rate, due to my early intervention, I've never seen a full-on bar fight, UNTIL I WENT TO BENDER'S!\n\nLuckily, I had a nice far-away seat (seriously this place is enormous) with a perfect view.  Legit punches being thrown, four or so people involved... it was glorious.  And the people-watching wasn't so bad before that, either.", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "This place was fun! We came here on a Saturday afternoon. We shot some pool and played in their photo booth. They have a pretty decent selection of beers, their pool cues were not all warped and beat-up and the staff was really nice! I would certainly come here again!", "author": "Tammy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-23", "description": "Meaty Marys. I'll go ahead and say this for Kristin P. They have bloody marys with slim jims! I'm not the audience for that, but apparently they're delicious.\n\nWould also agree that despite the place being a little intimidating and 'sceney' at times, the bartenders are great, the beer is tasty and I always have a good time at Benders.\n\nP.S. If you come for live music, bring some earplugs - it's a LOUD spot.", "author": "Gretchen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "I always have a great time at Benders! I like their beer selection and they make a surprisingly good margarita for a dive bar. Great menu of bar/comfort foods with vegetarian-friendly options (although the burgers have inconsistent quality). \n\nThey have an eclectic mix of rock bands here on weekends - for instance, I recently saw a Misfits cover band followed by burlesque surfer rock. And I highly recommend the Eileen's Punk-Schlock karaoke the last Friday of every month.  You can bring your bike, bring your dog...and there is plenty of space when it's not super crowded.", "author": "Kelly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "Not only a great place to see a live show but awesome food!\n\nGreat vegetarian options that make me happy.  The seitan chicken wings with bbq sauce that I so want to try are always sold out when I want to order them. Someday I'll get lucky.\n\nMac & cheese and mac & cheese grilled cheese, tater tots.  Good burgers for meat eaters and veggies alike.  Bar food with a lil' something more.\n\nPlus a photo booth! Who doesn't love those?", "author": "Sam Marie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-22", "description": "So even after it burnt down Bender's still has:\n\nStiff Drinks\nNice bartenders\nIrish Coffee for when you have to drink but don't feel well\nPinball\nMy favorite naked photo hunt game\n\nIt was a little freezing in there though...guess I need to hipster up and invest in a leather jacket.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-22", "description": "Bender's might be my favorite dive bar. It really feels dirty and dingy like one, except their bathrooms are immaculate. (Kudos on that). I like their selection of beer and their staff is really nice. We had a birthday party at Benders and were able to grab a long table so everyone could sit.\n\nI think they make food too, even though I've never tried it. They have outdoor seating too which is nice when a warm evening in SF comes along.", "author": "Analisa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-21", "description": "Just a hop, skip and a short bike ride from my apartment, Bender's is my go-to for bar food and pint-sized margaritas. \n\nOn sunny days, this dive bar's patio is prime. It's not a wind trap, so you won't freeze your buns off and is rarely too mobbed to find a seat. The margaritas are huge and cheap ($7), but buyer beware - they will knock you flat. Just to give you an idea: I once had three on a Friday night, and in no time at all, was up on the karaoke mic, regaling all with my rendition of Abba's \"Mamma Mia.\" Mamma mia, indeed.\n\nGamers rejoice - Bender's is fully equip with two pool tables and a pinball machine. Make sure to sample some of their bar food if you're in the mood to gain 60 pounds. The burger is the thing to get here, and comes with a side of tater tots. They also have a mac 'n' grilled cheese sandwich. Ouch! Plus, vegan options galore, and free BBQ on Sundays. In short, the food is no joke.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-28", "description": "I came here in the afternoon with my band.  We enjoyed the finest bloody marys of our lives, and then blew some cash on the photo booth.  The bartender gave us free beef jerky, and a fist full of stickers:\n\nOne that said WWLD?  with a picture of Lemmy on it\nand one that said WWHD?  as in \"What Would Husker Du?\"\n\nThis is an exquisite dive bar.", "author": "Jennie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-07", "description": "This place is a total dump/dive but kind of awesome. The food, altohugh I didn't eat any, looked really good. Tatertots, burgers, wings, grilled cheese, etc. Yum!\n\nPBR is $2. Other beers are cheap. Cash only.\n\nThe bouncer was a little iffy. He asked me if I had any alcohol in my over-sized work bag. I'm not a kid, nor do I look like one (especially after coming from work) and it was like 7p.m. Do I look like an underage ready to rage?? Plus he gave me attitude when I asked him if he wanted to take a peek in my bag... ?\n\nIt's fun in here, though. Photobooth, patio, pool, etc. Cheap beers, fun people. Super hole-in-the-wall good time.", "author": "christine c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-23", "description": "Stumbled in here with coworkers during happy hour and we found out that pitchers of beer is only $12!!!  They have a great variety of beers that you normally don't see on tap.  \n\nThere's a decent amount of seating, a couple pool tables (that are always taken), and bike hangers to hang your bike.  They also have a little grill area that makes some of the best bar food I've ever had.\n\nThe fish and chips hit the right spot after drinking pitcher after pitcher.  It also comes with a little cole slaw so you can get your daily veges in.  \n\nIt is also a cash only bar (like most of the places around the Mission).", "author": "Danny P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "After i had heard of this place (but before i actually arrived in SF) I was in a punk pub in Dublin (Thomas House) & saw a sticker for Benders in the bathroom. We took this as a sign & decided to look the place up once we got here. \nI liked it. Benders is big, quite a lot bigger than i expected in fact. When we got there the barman asked for ids. This was not a problem, as we were tourists we had our passports with us at all times. At first i thought he was not going to accept them as he spent an awful long time examining them (then it dawned on me that as they were in Irish he was probably wondering what the hell he was reading, strange unrecognisable language, transposed dates etc) Anyway he handed them back , got our drinks and was perfectly polite.\nIt was a quiet night that brought us there, a Tuesday, which is a pity because the place was very quiet. Like Lucky 13 this is another one of those places I would like to see on a weekend while it is in full swing, especially during a gig, & it has a layout that would work so well for gigs. I had no food, but it smelled gorgeous. The music was pretty good too, which was something i always appreciate\n\np.s. I do not get where some people are calling this place gross. I was only there once admittedly but it was in pretty good condition as far as i could see. Liked the fake id tables as well", "author": "Aileen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-11", "description": "This is a really great bar. Awesome music, cool patio, good food, pool tables. And only two blocks from my work. I would have been really psyched about Benders.\n\nAlas, the staff were total a$$holes to my friends, some of whom had the audacity to show up for my buddy's birthday party straight from work wearing (oh! the horror!) button down shirts. One of the people working the door made fun of my boyfriend's outfit before he even set foot in the place to spend his hard earned money. \n\nNewsflash for the fashion police- my friends are kind, open-minded, polite people, and therefore much, much cooler than you are, even if they don't wear Dickies and American Apparel tank dresses and giant feather earrings to work. \n\nI must have been dressed appropriately, because one of the busboys made a snarky comment about my own friends to me, not knowing that I was with them. Really professional. I am so impressed.\n\nFortunately, my friends handled the situation gracefully and didn't let it ruin the birthday fun. I enjoyed the celebration because I love the folks who showed up for it, but the attitude from the staff was a tremendous let down. I won't ever go back.", "author": "Angie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-23", "description": "I like this bar. I like the random nights when it's not too packed and full of smelly folks. I like when you can sit at the horribly dark bar and drink hoegaarden and not have anyone bother you. I like the days when there is food, good people, and you're not necessarily frightened for your life. Or leave covered in booze from bumping into too many folks. \n\nThose are some things I can appreciate in a bar.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "This spots good. the food is mediocre but the drinks are cheap. Its seems to be a mixed crowd which is fine, very divey.", "author": "Bantu Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "This was the first time I've eaten at Benders. I've drinks here a few times but never snacks. \nIt was a bit rough at first only one guy was in their little kitchen area so he couldn't get to us for awhile. My buddy and I were about to give up and go find a diner when the kitchen cleared up. \nWe got the chicken and sausage gumbo and a bunch of tator-tots. That hit the spot like you wouldn't believe. So good. I didnt eat again until dinner the next day  Can't wait to go try their Mac and cheese.", "author": "Geoff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-18", "description": "Long Live Punk Rock, and the Burgers are Kick Ass", "author": "Ann H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-28", "description": "I went out to Bender's with some friends on a Friday evening. It was early and things were mellow. It was quiet and we could talk. I was feeling a bit ill, so I asked the bartender: \"Would it be too much to ask if you could make me a Hot Toddy?\" \nMy expectations were: a sneer, or, if I was lucky, hot water, lemon, brandy, sugar, $8.00.\nHomegirl took the time to make it so nice with special German honey liqueur and a cinnamon stick. $6.00. Lady, you won my heart.", "author": "Myrrhia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "Reading the bad reviews on this place just kinda makes me laugh... if the bartenders and door guys treated you like you were a jerk-off then i'm willing to bet you ARE a jerk off. I showed up here last night and the music in the bar was awesome.. i asked the bartender if she felt like making me a bloody mary or if she was too busy and she joked back and forth with me a bit then made an awesome drink with tons of garnishes. \nThere were one or two people in there who had never seen me in this bar before so they eyed me up and down but hey, this is there hang out not mine and i understood. \nI sang songs with the door guy and at one point in time might have even high-fived him. I really like this place... but i imagine if i came in here and looked like a preppy jerk everyone would hate me. \n\nSo come here, don't be a jerk... and check out the Unicorns drawn on the bathroom stalls in the girls room.", "author": "Bc L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-06", "description": "Bender's makes me psych myself out.  I'm always like not enough of something to feel like I will fit in-- punk, hipster, goth, biker.  But having said that, I've never actually felt out of place once I get in the place.  The bartenders are generally super nice, the PBRs are $2 and there's typically good music.  Was there Saturday for a metal band night, which was totally not my thing but I still had a great time-- and that's saying something!\n\nAlso, one of the few bars where you can eat something AND have your doggie with you.  A big plus for my two pups and I.", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-25", "description": "The place seemed to be pretty cool, I played some pool and met some nice people, the only reason why I am giving this place a 1 star is the treatment that I got from the girl bartending. She was really rude to me and condescending. Definitely shouldnt be working in the service industry if her attitude towards customers is going to be arrogant and rude. I wont be coming back to this place just because of her.", "author": "Jorge P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-13", "description": "I have heard good things about Bender's. My experience though was not so great. \n\nFirst, IF YOU ADVERTISE SERVING FOOD UNTIL 10PM DON'T TURN ME AWAY AT 9:15. I was super hungry, i go to get food, no luck, they stop taking orders 45 minutes before they advertise. \n\nNext, try putting a few more people working the bar so there aren't crazy lines trying to get drinks.\n\nMost importantly, don't have absolutely horrible bands that make us leave to keep our sanity. \n\nBasically, Bender's would be great if they actually served food, had a full staff, and didn't have crap music. We ended up leaving for food and hitting up another bar around the corner. I would probably love this place, but not this time.", "author": "Peter V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-29", "description": "I kind of feel bad for giving this place one star, because honestly, it was a fun bar.  The drinks were well priced, there was a nice atmosphere, people had fun.  I just had an unfortunate circumstance with one of the busboys actually trying to pick a fight with me out of nowhere, and then getting thrown out of the bar.  I have never been thrown out of a bar in my life and I go to a bar usually around 3 times a week. I am a pretty mellow person.   I haven't been in a fight in over 10 years.  So to be accosted by one of their employees who honestly looked like he was on something pretty much just ruined the spot for me.\n\nOn the other hand I have to say that the bouncer didn't get out of line, and one of the other bus boys came out to smooth things over, so that was nice.  But the fact the guy who tried to start a fight came to the door to try and talk shit (while standing behind the bouncer) while i stood around having a smoke waiting for my friends to come out, just showed poor class.  I had come with around 15 people, so I just stood outside talking to my friends listening to this guy yell about how hardcore he was while we waited for the last ones to file out.\n\nIf you go, you will probably have fun, just watch out for the short busboy with a mustache and short hair.  He is the one with the tweaker eyes.", "author": "Ric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-24", "description": "A bar dedicated to Bender, what more need I say?\n\nSteps after walking into Bender's:\n1.  Walk back and to the right and order a burger or the mac n' cheese grilled cheese. (yes, mac n' cheese inside of a grilled cheese?!?!?! are you kidding me)\n2. goto the bar and order a pitcher of some delicious local beer (Pliny the Elder anyone?)\n3. Sit down and relax.\n\nBurger is decent, but the tater tots is where its at.  No doubt you'll be saying \"Napoleon [or insert one of your friends names], give me some of your tots!\"", "author": "Danny T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-27", "description": "Kind of the perfect place to go if you're with a bunch of friends on your bikes and want food/drinks.  You can bring your bike in and there's really no need to lock it. Awesome since I didn't have my lock with me anyway.\n\nThe fact that the food was actually good was a pleasant surprise.  I had a veggie taco, and for $4, this was a really large taco. \n\nI would've given 4 stars but the waitstaff here definitely have 'tude. Also there is ONE menu for the entire place and they get kind of snippy with you if you're hogging it for too long.  I mean, understandable, but why not just print out more menus? \n\nFun place otherwise!", "author": "Richa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-22", "description": "One of my top favorite bars in the city.I'm heresuper often,door guy always welcomes me back with a smile.Relaxed atmosphere.Pool Tables.Outdoor smoking area.Occasional shows.Good selection of beer.Whats not to love? I make it a point to bring every single person I know here atleast once.\n\nIf that isn't enough for you..one word - PHOTOBOOTH.\n\nLove.", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "Roomy dive bar with a good and cheap jukebox. 2 pool tables, plus it's the first bar I've seen with an indoor bike rack! Is this a SF thing?", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-20", "description": "Benders is a pretty rad little bar in the Mission. They have a ton of great beers on tap, tons in bottles and cans. Drafts $5, bottles $4/3, cans o' PBR $2! \n\nThey have two pool tables, a photobooth, tons of old school fliers and posters of rock shows long since past, and art on the walls. \n\nIt was my first time here, and it was completely PACKED. Good vibes, good tunes, and an all around good place to come kick back a few and chill out with friends.", "author": "Mace M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "Nice little place, service was good and the drinks were reasonable.\nThey have a photo booth which is a nice novely item but worthy of a few bucks to make some memories come to life.\nPlay some pool, sip a beer and enjoy the dilapidated ambiance!", "author": "Sam C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "I'd been in for a last beer on my way home a couple times but Xmas was the first time I really spent any time in here. \n\nI was at the house of some elderly friends I check in on in a food coma after a very well prepared Xmas dinner. It was nearly 9 Pm and I was ready to go home and go to bed when my The Viking texted me to meet her at Bender's. \n\nIt being so close to my house I would have felt like a real douche to say no but I had every intention of popping in for a couple of beers and saying good night. I ended up staying until last call and having a very nice time. \n\nThe Staff: \nI don't know if they were caught up in the Christmas spirit but everyone there including the doorman were extremely warm and friendly. The nicest group of people I've been around in a long time. \n\nThe Crowd: \nThere were a couple of douche bags but that's hardly the bar's fault. There was one large girl dressed up in some kind of Mrs. Santa outfit that threw up an elbow and body checked me, almost knocked me down, to get to the bar before I did. There was also some crazy longhaired bearded guy that reeked of Old Spice. He took off his shirt and started amoeba dancing and rubbing into people. He was talked to several times and finally thrown out. \n\nThe Band: \nThe Bass and Drums were solid the two guitars were awful. They were sloppy and the tones were ear splitting and shrill. I couldn't help having the feeling that they didn't usually play together. They played mostly cover songs and the few originals they played had every musical cliché imaginable.\n\nI hope to check this place again but they usually charge a cover and I refuse to pay to drink in a bar. They are a live band venue but if you aren't there to see the band it's more of an annoyance than a benefit.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-25", "description": "Bender's satisfies my appetite for \"slumming it\" as well as my appetite for scruffy 20-something hipsters. By slumming it, I mean cheap beer and pool. By 20-something hipsters, I mean drunk boys with stubble and ironic t-shirts. Oh, and skinny jeans. And a shot of cheap whiskey with a PBR back. \n\nOk, I'm not really attached to any of the above, but it sure likes me. What Bender's is good for is this: cheap drinks, pounding music, cheap thrills, pounding music, cheap dates, pounding music...and about a billion scruffy hipsters' phone numbers/business cards (who knew they had jobs?) if you happen to be me. \n\nAmple seating, cheap drinks, awesome multi-tasking bartenders, and dozens of boys who your dad would not approve of ammounts to a decent time out with the girls (and boys). Did I mention the pounding music?", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-09", "description": "This bar is FAN TASTIC!!!!! everything i could possibly ask for! GREAT jukebox, GREAT BEER,(Death and Taxes! yum!)  and I was there for NYE w/ my karaoke gang who has serious BIKE problem... and we had one of the best times we've have ever had at karaoke! Blow up instruments are really a nice touch and a diverse, awesome plentiful book of songs to choose from! CHEESE BURGER IN PARADISE!? yes. please. thank you!\n\nOH and the seitan and locally harvested free range organic home schooled mushroom tacos.... to die for! \n\n*heart* \nI am a fan and I will be back anytime I'm in SF! \n\nOH AND BIKE HOOKS INSIDE! A+", "author": "nicole a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "Dive Bar with the best slutty food created. Texas toast grilled cheese stuffed with Mac & cheese, hotdogs and chips... yes, stuffed with hotdogs and chips. 5 hundred fat kid stars.", "author": "Lizette C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-22", "description": "Come to Benders in the middle of the week.  Get a few burgers.  Then you'll understand this little slogan I created for the whole event:\n\n\"Worst thing about Whiskey Wednesday isn't the hangover, it's the ensuing heart attack and instant cholesterol spike.\"", "author": "Steven R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-09", "description": "Maybe im not trendy enough but i always feel out of place here. I think i need a leather bustier, afro, or skinny jeans to come here more often. \n\nDrinks are cheap and i havent figured out when i will get good service and which days i will be ignored for what seems like eons. \n\nSeems to be the happening spot for weirdos though, so you'd think i would fit right in. Maybe once i get that afro...", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-13", "description": "Bender's is awesome, cheap beer, happy hour with a $1 off already cheap beer = fun. And good food, tacos, tater tots, Satan's Little Helper (judging from a review on here I'll probably pass but still...) and free BBQ on Sundays! Spacious interior, pool table, almost always a place to sit. They also have KUSF benefit parties with bands. Bartenders are a little surly but nice. I've never been treated badly, I have changed my mind a couple of times at the bar because oh! they have Green Flash IPA on tap. Oh and they have PBR + shot of whiskey for $6! It's all good. And an outdoor patio with friendly customers who sometimes have puppies running around and that's where the BBQ. I'm glad it's in my neighborhood and it's a great go to bar. I don't usually go to bars on weekends but I may make an exception with this one!", "author": "Gina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-11", "description": "Return to Rock, I liked this place cause the Doorman was cool and all 3 bands kicked ass. Reasonable drink $ . In some of the other reviews I noticed patrons mentioning fights, banging and generally getting jostled. This is true, its a rock club. It is all really edgy but harmless and totally safe. \nWomen of every distinction. I would say I saw some of the hottest women in the city here.", "author": "William H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-03", "description": "Dog friendly! \n\nGreat beer selection.  Vegan food offerings. \n\nIt can get rather crowded later in the evening.", "author": "Jill B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-23", "description": "good fun dive-ish bar. Good booze and fun stuff always playing on the TV Screen. Lots of space for bicycles and good for people watching.\nwish it had a better jukebox though.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-25", "description": "I am a big fan of Bender's. I spend I large portion of my bar hrs here: playing pool, discussing random things with random people at the bar, joking around with the bar tenders, smoking in a real outdoor lounge(only open until 10 or 12), eating cheesy mac-n-cheese and fatting tater tots, drinking anything you could think of, watching bands(their mostly heavy biker rock ), and most importantly, i never feel over crowed, un-noticed, or upset when i am there. All-n-all great place!!\n\nplus they have free covers(sat exception), cheap drinks(PBR cans), and free food night happy hrs. I'm Sold!!", "author": "Heather P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-15", "description": "This place is a lot of fun. The bartender was the cutest ever, buying me a beer just because! I said what kind of beer I liked and she found something as similar as possible - even better! They all made me feel very welcome.\n\nThey often have bands playing, lots of local bands and other bands traveling in. In the back they had a photobooth that I ended up getting too drunk to try, but I met some really cool people and even played some pool. All in all one of my best nights out in San Francisco, and when I come back I want to try their food too. Check out their website to see what's going on.", "author": "Sigri H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-22", "description": "What an awesome place for a Saturday Afternoon Beer.  \n\nAnd if those Bloody Mary's aren't yet world famous, they ought to be.  8 bucks basically gets you a meal in a glass.  The beverage is garnished with all of the fixings including: a stringbean and two olives on a toothpick (queue up Cock 'n' Balls jokes), and A BEEF JERKY STICK!!!\n\nThe tiny backyard area is a nice place to soak up some Vitamin D and hang out with friends, and the nondescript entryway made me know this was my kind of place.\n\nRecommended.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-23", "description": "Bartendress did me a solid by buying a drink for me when she forgot I was sitting there. Good beer selection (some gems from the North West), pool tables, lots of places to sit and write/eat/cop a feel. Little doggies wandering around. Bike rack inside. Pinball.\nJust so rad.", "author": "Addyline L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-22", "description": "Loud music so you can't hear yourself think\nLouder music so you can't hear your friend speak\nEven louder so you have to scream at the bender tender then all you got to do is...\n...Blame it on the a a a a a alcohol\n...Blame it on the a a a a a a alcohol\n...Blame it on the a a a a a a alcohol", "author": "Kristina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "A great local watering hole.  Quite frankly, a great bar even if you have to travel a little bit.  Vegan tacos on the grill.  Some decent scotches on the top shelf.  What more can a boy ask for?\n\nThere is a special deal most days (e.g., Whisky Wednesdays) if you want to get your cheap booze on.", "author": "Douglas P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-19", "description": "Great beers on draft (Magic Hat #9 and Pliney!), great music in the jukebox and pool. Plus you can hear bands on the weekend for a small door fee. And for $5 you can use the photo booth which kicks out 2 copies. Score!", "author": "Nicole O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-10", "description": "If you have bad things to say about Bender's, you just do not actually like *bars*.  This is what a bar should be.  Deceptively large - looks tiny from the street, but there are several areas with seating and lots of space to stand about with your drink.  I've never had a problem finding a table for me and my friends if I just hang around for a minute.   Great jukebox, and nights with live music are either fantastic or hilarious (which is still fantastic).  Kitchen in the back with amazing comfort/bar food.   Bartending is no-nonsense.  Good selection of beers, strong drinks, fair prices.  It's not the sort of place that I'd order complicated cocktails; however, I got to say, my stitch n bitch group used to go here early in the evening, and they always happily made us (AMAZING) martinis.", "author": "Heidi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "This is one of my favorite dives. Cheap beer, mostly friendly service [except for the surly barback in a wifebeater that also works at Zeitgeist....wears glasses], they carry Moonlight's Death & Taxes, and there are hooks for your bike!\n\nThe pool tables are in pretty good condition, and I've never felt unsafe in this place. There was one time a big dude was getting aggro with someone over a pool game, but apparently one of the bartenders knew him and got him out of there quickly before anything happened.\n\nCheap, good beer\nTwo pool tables in decent condition\nBike hooks!\nKaraoke\nFood\nGreat jukebox\n\nWednesdays, they have a special that's a PBR and a shot of whiskey for $5\n\nAlso, Gracias Madre is just a couple blocks away if you're vegan.", "author": "C D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-01", "description": "Called to ask a simple question about happy hour, and the person who answers the phone had a serious attitude problem... I will take my business else where. Also their happy hour sucks...", "author": "Krissie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "Pliny the Elder on tap. Boobie touch. Not packed on a Friday evening. I think I like you, Bender's. I think I do.", "author": "Karena Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-01", "description": "packed with drunks and hipsters. the kitchen was closed early despite driving across town to try the vegan philly.  bad experience", "author": "Matt N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-07", "description": "Bender's is the epitome of bad things to come once you step into this place.  Not bad meaning bad, but bad meaning good.   First of all, they have the BEST burgers of all time.  On a Friday night, you may have to wait up to an hour for it, but it is so worth it.  Their tater tots are addicting, and during brunch on Sundays, their bloody mary's are monstrosities.  But tasty ones, at that.  (It comes with a huge celery stick, pepper, and a hunk of a slim jim.)  \n\nFriday nights also reign king of debauchery at Bender's since they have DJ Purple playing the saxophone to salvage the tone deaf drunkards who attempt karaoke that night.  (Thank god).  \n\nWhether it's the food, or the eclectic range of people who go there, I honestly like this grimy place.  A lot.", "author": "Ivy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-06", "description": "Apparently, I need to buy a fixie, because hipster bike messengers have all the good bars.  Benders has feisty bartenders, cheap beer, a pool table, plenty of space and one of the best bar kitchens around.  \n\nOccasional live music usually over-crowds the place, but its slightly remote nature means it's usually really low-key after midnight, a nice reprieve from the rest of the Mission hipster bars.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "Fake IDs in the tables, plenty spacious, pool table, $4 local and import drafts, Paulaner and decent Guinness. A great bar!", "author": "Megan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-04", "description": "This might be my new favorite bar, even though I don't ride a fixie.  Do you think they'll still let me in?  Because I had a blast playing pool and drinking beer dressed as Sleeping Beauty a few weekends ago and have been thinking about coming back ever since.  At least we know they let me in as a princess, which is a good start.  \nIs it lame if I hop on my Mike's Bike's rental and try to hang it up on the rack?  BECAUSE NOT EVERYONE HAS A BIKE OKAY?\nScrew it, I'll just take the 47.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-13", "description": "I have not given it 5 stars yet because I have not tried their food. Nothing fancy but get's the job done. There will be an update shortly...for I CANNOT wait to go back. \nI love the vibes...it's a purrrrfect spot for happy hour, or if you're lucky, all afternoon. I would love to spend a weekend day here just kicking back. I shall return. I have a feeling they might have killer bloody mary's.", "author": "Maureen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "I've been to Benders a few times, and it's a really nice place to just relax on a Sunday afternoon - without the mobs of hipsters or the typical Mission party crowd. \n\nTheir bartenders are friendly and so is the local crowd. They have a few pool tables and the inside is pretty big. I've yet to see it super crowded. My favorite part is their back patio; it's not super big but has enough room for maybe 20 people or so. It's shielded from the sun, so it's not hot and it's a nice place to smoke some sweet 420, or a gross cigarette, and sip on your bloody mary or one of their good beers.\n\nI've heard it gets much wilder on some nights, but that's not what I go there for. It's the relaxed day time atmosphere that I dig. If you're in the Mission during the day and want a place to just kick back and relax, this is  your joint!", "author": "Erik B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-16", "description": "A nice dive for burgers and beers. Pretty good selection of beers on draft and quick service from the bar. Seating is a bit limited. Tater tots are a must.", "author": "Kenny J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-01", "description": "How have I never stumbled upon this little gem?  Maybe because I don't typically take aimless, nocturnal strolls though this area for fear of my carnal safety?   But that's not the point.\n\nThe point here is that this is a fantastic dive bar, with the best bartender in the city (no really, SFWeekly says it's so), an impressive space, cheap and strong drinks, and FREE BBQ on Sundays.  \n\nThough I'm confounded over their business plan (they practically give away drinks at those prices and actually do give away free food!), I proclaim Bender's one of the best dives in the city.\n\nAnd a note to Vegetarians - they happily offer veggie burgers as well.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-29", "description": "Benders is a great little neighborhood bar, with a bizarre surprise: really excellent sandwiches!  The \"Blast\" is a BLT that has been crisp, flavorful, and well made, I've enjoyed it every time I've had it.  The BBQ pulled pork is also really good; salty and moist, with a nice sauce that rivals any BBQ place.\n\nAnd all the sandwiches come with tater tots. Seriously! They're really good, always fresh from the fryer.\n\nEasily the best bar food I've ever been served. Its not particularly quick but that's because they make it to order, so I forgive the speed.", "author": "Rus H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-13", "description": "Unpretentious, nice beer selection, and elbow room!\n\nSweet spot to grab a beer with your best four legged friend.", "author": "Elle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-30", "description": "Great freaking bar. The location is easy for biking as well as on foot. There are is plenty of bike parking outside and in (as long as there isn't a show). Once you get inside the atmosphere is comfortable for those who aren't interested in the Marina-I-wear-heels-out kind of bar.\n\nIf you get a chance try the food, they've changed the menu and it covers a large range to accommodate both veggies as well as carnivores.\n\nAnd a total plus: photobooth (that spits out two copies!) and pinball machine. But keep in mind the bar is cash only, so hit up the ATM beforehand.", "author": "Girl on the Bike s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-03", "description": "It's where assholes go to be assholes. I feel right at home. pliny the elder on draft, and Powers whiskey shots. A great place to go sit and drink and not talk to anyone. Good bands on saturdays usually, so pay the 5 bucks to get in, you cheap ass.", "author": "erich s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-21", "description": "I thought this would be a kick-ass place but...can I just set up a cot in the back patio and just live there, please?\n\nEven the fried pickles were good, and I'm a little weird about trying stuff like that.\n\nThere's a pool table, which is nice...a pinball machine, which is great...they have good burgers and excellent fries, which is awesome...the prices are superb and the drinks are strong...and there's a patio, but not just any patio.  It's a small patio, but it has plenty of benches and lots of character, complete with \"normal\" people.  In other words, no scene, no pretentiousness, just drinking and chilling.   \n\nNothing but love for Zeitgeist, but Bender's is its smaller and friendlier cousin.  I'm not saying go to Bender's though - in fact, stay at Zeitgeist.  Just stay there.  Don't go here.  Please?", "author": "Sus... B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "Benders is like a mini-theme park for the damned. In a good way.", "author": "Gwynnie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-28", "description": "Thanks you guys. For admitting what you are and servicing the kind of person that I am. \nThanks for being there, through every breakup and friend-fight. Thanks for having chick bartenders with colored hair and tattoos that make me feel like less of a f*ck-up. Thank you, mission. Thank you, Benders. Food and booze. And the food is served late enough so that, like, if they don't serve food i'm all thinking, 'too late, missed the boat. I probably don't deserve it. Next round's on me.' Then all the regulars love me and I'm shanghaied emotionally for the next two hours. Or whatever.", "author": "Chloe N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-29", "description": "Thanks for the free (donation) burgers yesterday!\n\nAfter riding Butter Lap for the first time, there was nothing sweeter than stuffing a gooey cheeseburger in my mouth, and washing it down with frothy, ice-cold beer as I played pinball. \n\nI have big cartoon hearts in my eyes for ya, Benders!", "author": "Blue R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-14", "description": "OH MY GOD!! IF YOU COME ON A NIGHT THAT THEY DONT HAVE A BAND YOU MIGHT JUST BE ABLE TO HEAR THE PERSON NEXT TO YOU SPEAK AND YOU MIGHT NOT HAVE TO REPEAT YOUR ORDER TO THE BARTENDER 5 TIMES BEFORE THEY REALIZE YOU ARE ORDERING AN ANCHOR HOLIDAY, NOT A BIG FAT WALLABY!!!\n\nDespite this I still like Benders for being a low key bar with a hipster/douche to normal person ratio that swings in favor of normal. They also have a pool table and a back smoking area (closed later in the evening), plenty of seating and a satellite Weird Fish kitchen so you can bring your Vegan friends.  As an added bonus if they are super preachy about animals being smart and pigs making better pets than breakfast you can just bring them on a night a band is playing and nod a lot.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-01", "description": "If you:\n1) Have a job where your boss is constantly criticizing your work\n2) Have a house full of screaming children\n3) Have a spouse who is constantly nagging you \n4) Have friends who talk too much\n5) Think that your sense of hearing is overrated\n\nThen you should come to Benders for a live performance.  The ringing in your ears will drown out all the other sounds in your life for a good 3 days.  It'd be like taking a vacation, but cheaper.\n\nI, unfortunately (or fortunately?), don't have any of the above, so my enthusiasm for Benders is muted. But if you like cheap drinks and have a pair of ear plugs, it's actually kind of a cool divey place.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-01", "description": "The concept of Bender's Bar and Grill in this location in the Mission is a good one. However, as a neighbor in the Mission, this business is pretty bad. \n\n1. The place ALWAYS smells of vomit out front. Inside it smells like a dirty mop. CLEAN THE F***ING SIDEWALK!\n2. The cigarette butts left on the sidewalk by all of the bike and scooter riding tree huggers is such a hypocrisy. CLEAN THE F***ING SIDEWALK!\n\nIt is just adorable that all of these tormented middle class brats,  trying to be and succeeding at low class nothinghood, have a place to hang out here. So edgy, so cool...so good for them. \n\nJust please clean the sidewalk....REGULARLY!", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-29", "description": "I was drunk when I wrote this review, I mean when I lived this review.\n\n* Best conversation EVAH with a female lawyer for the Hell's Angels Oakland chapter. She was so cool and fighting the good fight AND kicking ass playing pool. WHOA!\n\n* Had a 'phake philly cheese steak' made with seitan and it was so delicious and philling, I had to give the butt to my date. \n\n* Prolly THE best french fries I have had in months. DOUBLE WHOA.\n\nThe pool table was hopping, the crowd was getting ready for a punk show and I was never happier. I was in a gol darn chicken suit and still got treated with respect Aretha style. \n\nI will def be back for more more more of this dirty dive bar.", "author": "Miel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "Yet another scene of *coughshedoesn'twanthernamementionedonYelprosiecough*'s and my drunken asshattery.  There was making out and falling down stairs and general stupidity befitting 11pm on a Friday night.\n\nCheap drinks ($4 for a double Kettle One & Cran WHAAA?) and a back smoking area and pool and plenty of places to sit and good grill food (even if the cook is a bit of a douchebag) and all the other amenities one would hope to find in a bar located semi close to your own home.\n\nI'm sure I'll be back.  Hopefully I won't be putting the \"ass\" in classy on my return trip.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-25", "description": "I walked into Benders on Saturday night, utterly SHOCKED that i had never been here before.  This is my kind of bar!  My stipulations:\n\n1. Has enough space for you to move around in.  Chcek!\n2. Has a smokers patio surrounded by a fence covered with old street signs.  Check!\n3. Has a fat dude cruising around in overalls.  Check!\n4. Has one of the best bloody mary's in town, topped off with a BEFF JERKY STICK!. Check!\n5. Super strong drinks other than bloody marys.  Check!\n6. Has a kitchen filled with fried goodies like fried pickles. Check!\n7. Allows tables to be taken over by roudy birthday parties.  Check!\n\n\nMy only issue was that when we originally called, they said there wasnt a cover.  Yet when we showed up, there was.  I guess the band had been booked last minute.  Ah well.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-26", "description": "At the third bar of Christmas I bought myself for me:\nOne PBR.\nOne vodka Red Bull\nOne pint of PBR\nI love this phoenix.\nThey re-created it's original charm, space, and kitchen that they had before the fire.\nThe temptation to become bigger, better, bolder resisted - this is still a haven for hipsters who don't use the term.\nStill a great place for a lay.\nStill an awesome music selection.\nStill a great pool area.\nStill a ton of fun.\nBenders is A-OK in my book.", "author": "Theo R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-29", "description": "I felt like a biker hipster visitor when I came here randomly for a drink the other night, including when I went for the nightly special: a shot of Hornitos and a Tecate for $6!  I would never partake in either of these things, except for when in Rome aka Bender's, where ordering something wrong just seems right.  This place is huge, which is nice.  Didn't even notice a grill situation when I was there, so I'll leave the food reviews to others.", "author": "e w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-07", "description": "Pros: Bike hooks, pool table, Leather tongue video sign, hipster vibe.\nCons:  Got the \"you're not a regular\" treatment at the bar, bathrooms were a little bit icky, hipster vibe.", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-31", "description": "i enjoyed this place, but i think i'm about 10 years too old for their demographic. :/\n\ngood tap beers and totally doable for a big group on a lazy sunday afternoon.", "author": "May T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-24", "description": "I so wanna go on a bender at Bender's right now (I really should have checked to see how many people already used that one before opening the review with it, but fxxx it; it's been one of those days).\n\nThis place is RAD x the POWER OF RAD, because it's two blocks from where I live. And they have food, and cheap beers, and a huge space, and good live rock n' roll.\n\nWhich means I now live at the heart of a triangle of quality Mission nightspots that are relatively (!) hipster- and douchebag-free...\n\n1. Inner Mission Beer Parlor\n2. Bender's\n3. The Homestead\n\nNow, I should warn all the rest of you that this triangle is not unlike the Bermuda Triangle. All will be lost if you attempt to enter (and you're a douchebag), and those of us who live in the triangle and know these places are lost souls (but not douchebags)... BE WARNED, all (douchebags) who enter here... \n\n(What I really mean is... Douchebags: stay out.)\n\nIf you do find your way to Bender's though, please don't ruin it. It's my new favorite thing about my neighborhood. Which, if you look at the company listed above, is saying a lot.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-25", "description": "Great bartenders, good vibe, and stiff drinks! Need I say more?", "author": "Nansee P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-15", "description": "If you feel like slumming it, this is a good place to start. Behind the facade of tattoos and greasy french fry air, you'll find a disco ball, a photobooth, and a juke box full of poorly selected grungey late 90's music(?). I guess that's what bike messengers and  tweakers listen to. On Wednesdays there is an impressive bike pile featured in the middle of the bar, you can't miss it as it's hard to navigate past without getting your pant leg caught, unless your pant leg is rolled up of course. The bartenders are pretty friendly and the place is rather unique. Other things of note: someone stole my sister's full pint of beer once when she was leaning over fiddling with her bag; And, it is home to the late Leather Tongue Video sign.\n\nTIP: watch out for beer burglars.\n\nUPDATE: my roommate also had a beer stolen", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-15", "description": "BAD BAD BAD TIME.\n\nWe were in SF for the weekend and on Saturday afternoon we thought we would head out for a drink. I have been on this pinball binge for the last month or two, so I thought I would check yelp for bars with pinball. Benders looked promising from the reviews I read, so we hopped in a cab and headed over. \n\nMy first impression of the place was not much. It had a very small bar that made it difficult to order a drink, my drink was very weak. From my calculations, I figure it contained 1/2 oz to 3/4 oz of actual booze. Cheap! I don't complain, I just switch to bottled beer for my second drink. \n\nWe played pinball for a while, finished our drinks, and headed out for a quick smoke. When we returned, a table was set up and a guy at the door was asking for money for a cover charge. We mentioned that we were in here earlier and we just stepped out for a smoke. He said that was cool and let us in.\n\nWe get a couple more drinks and go back to the pinball. While I am deep into my game, a woman comes up to me and my boyfriend and says to us, \"Because you didn't pay any cover charge you two will have to leave, and if you don't leave in five minutes, we're going to have to trow you out.\" Wow! SHE ACTUALLY SAID THOSE WORDS--THROW US OUT! \n\nIt is worth mentioning at this point that the two of us are always good customers. We tip very well. We are polite and curtious whereever we go. And on this occasion, we were sober too. I cannot for the life of me figure out why they would threaten to kick us out. And the funny thing is, nobody even told us how much the cover charge was. Maybe if that woman had any business sense in her head, she would have asked us nicely to pay $10 or whatever amount it was to stick around, we most likely would have. And we would have paid for lots of drinks, on top of it all. And tips. You lose, Benders!", "author": "A K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-05", "description": "this was my most favoritest place in the whooooole city to get wasted. Like Zeitgeist without the overwhelmingly shitty attitude, like Thee Parkside without the sticky quality, like Lexington except the lesbians will make out with me, Benders had the perfect Pythagorean proportions:\n\n(dive bar x beer garden) + (music/dim lighting) + (unconventional bar food x delicious) + (reasonable drink prices x heavy pour) = P/Q (where P= my liver and Q= a compromise between my best judgment and my intense love of inebriation)\n\nWhen it burned, I felt the same kind of cheesy weepy that the girls in my high school got when Kurt got all sucky-sucky with the NRA or when my dad first heard about Jerry Garcia dying of whatever Jerry Garcia died of. \n\nDid you know that in France, it's common(ish) practice for competing bars to simply burn each other down? Why is there not a drink named after this? \n\nBut. The other day I was riding my bike down Van Ness I saw a familiar, yet hideously painted building and realized that it was Benders, sans boarded up windows and featuring a \"Coming Soon: Benders\" sign. My liver wept a little, but the rest of me sent a \"Benders is reopening holy crap omfgrotflbbq!\" text message to the entire contents of my phone book, including my mom, who isn't 100% sure as to what text messaging is, so she thought I was having a medical emergency.", "author": "jason l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-23", "description": "Two words: fried pickles.\n\nNeed I say more? It was like a little spear-shaped piece of heaven in my mouth. My friends and I hung out here at the grill, which is located towards the back for those who are asking where it is. My friend cooks here and he grills up a mean burger as well. Artery-clogging awesomeness!\n\nThe drinks are pretty strong here, and the bartenders seemed cool as well. All the people seemed pretty chill. \n\nThe bathroom scared me! I have a problem with pissing behind a curtain. I just feel so vulnerable, and it sorta makes me feel as if I'm pissing in the shower which is just weird. How hard would it be to nail some wood together and make stalls? Seriously.\n\nOkay, update as of 3/2/08:\n\nThere are now DOORS and STALLS in the ladies restroom. Ladies, get your piss on in private. Or go in the stall with your female friend and come out wiping your nose and looking guilty. Yeah, I saw that happen.\n\nAttractive people work at Bender's. Wow.", "author": "Pamela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-03", "description": "This is definitely a new go to spot when I'm anywhere near the mission.  How we ended up here was mere coincidence as we were headed to Mission Chinese.  However one of our friends with keen eyesight (yet ironically the only member of our group with glasses) spotted their chalkboard with the magical words Grilled Macaroni and Cheese Bacon Sandwich.  How could we not enter and find out the greatness of this sandwich?  What we weren't ready for was the perfect dive bar type atmosphere that came alone with it.  The bar is strewn with cool kitchy stuff to look at as you slam back drinks when waiting for your meal. There's pinball, pool, and a photo booth.  The booth it seems ends up having most of the photos pinned up at the bar so you can have an immediate place in the history of the place.  One major moment I wanted to mention was the bartender.  Automatically with his Australian accent he was better than half the bartenders I'd ever met in my 20+ years of drinking. But on top of that he was one of the nicest and honest bartenders as well.  I had accidentally over paid my round of drinks by about 25 dollars and he made sure to get back the proper amount of money before accepting a tip.  For that alone we tipped him an extra 5 on top of what we already gave him.  He could have easily walked away with all of it but he immediately went against that.  That moment alone solidified our return next time we were in the area.  If that wasn't enough the sandwich that we so desired arrived and it was as advertised.  It was simply amazing. It was a shame we only ordered one to split with the 4 of us but we didn't want to ruin our appetites.  Overall I can't imagine not coming back or suggesting to any of my friends to hit this place up as a go to spot in the city.", "author": "Joco F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-28", "description": "Came here for PUNK ROCK KARAOKE but left disappointed. The roomie is a big punk fan and had been wanting to go. We were a bit nervous as we were dressed pretty preppy (and you KNOW how superficial/bitchy punks can be) and didn't want to seem out of place. When we arrived there were TONS of hipsters...*sigh* oh, the Mission and gentrification. Anyway, we got there around 8 because I am a fatty and wanted to try the food. I got a grilled cheese and it was BOMB however, it took an hour to get my order. They were really busy but I mean, an hour? :/ Drinks were pretty cheap and VERY strong. I got a cranberry vodka and roomie got a pbr and Maker's shot. We were really excited about the karaoke and we waited until around 9:45 for shit to get started but...it was kinda LAME. \"Love Shack\" by the B52's is NOT PUNK ROCK! That's some '80's night shit, ya feel me?! Everyone's attitudes were pretty shitty, but that was expected. This is not a place to meet people, come with your crew. All in all, I'll probably be back but it didn't live up to the hype.", "author": "Vanessa Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-09", "description": "What a show! Eric W and I came here to watch Destroyer, the best fucking Kiss cover band ever. Who knew with some cabaret dancers on stage, the two would be six times hotter. I've seen Destroyer played many times and every time, the show never cease to stop with more excitement and thrills. \n\nBender's Bar is a dive but it's perfect for those who want to rock out and get wasted doing it. \n\nAnyone can tell me why there's a disco ball in the bar, and why does it say, SF is GAY!. I have no comment.", "author": "Stanley K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-11", "description": "Wow... dive bar extraordinaire. Have not seen so many love-hungry bar patrons eyeing each other meatily. My friend got hit on by two motorcycle biking lookalikes. One called her out on something and the other bought her a beer even though she was surrounded by all of us. Good time was had by all! Drinks were also fresh and flowing. Beers seemed to be each and everyone's drink of choice. Didn't see many people holding mixed drinks.\n\nThey also card every single person that walks into the bar at the beginning of happy hour. Got there around 5:45pm and it got way too crowded around 8pm, so I asta-la-vista'ed outta there and made my way to MIssion bart. \n\nCome here if you really enjoy the dive bar scene. I'm more a coffee shop kinda gal.", "author": "Cheryl F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-01", "description": "The way i hear it described the most is \"a friendlier, cooler, smaller Zeitgeist.\" I love this bar for so many reasons. They play good music, good people seem to come here, and the bartenders were total asses to me UNTIL they started to recognize me, which oddly enough, I admire. Free cheese burgers on Sundays, and the fish sandwich in the kitchen is rockin. It gets busy on weekends, but not overly crowded. Drinks are fairly priced and i can usually get a pool table or at least a table to sit at with friends. \n\nAll around, this place is my favorite, fucking awesome.", "author": "J. G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "Hmmmm \n\nSoon after this place re-opened two years-ish ago I headed over.  My roommate heard they had awesome food... and was an awesome bar!  \n\nWell she was right - \nMy kinda bar, playing metal with surly folk about, might get a chance at the pool table, outdoor seating section when it's nice and before 9, I think.  I have spent many a drunken night here.\n\nI am afraid though, Benders - I heard no more weird fish food!?!?! What will I do without my beer and my buffalo girls?!", "author": "Kristina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-04", "description": "Had a truly kick ass burger here last night.  The buffalo catfish and fried pickles are great as well while you enjoy the good selection of beer.  Add to this the fact that they have Honky, Grady, and the Reverend Horton Heat on the jukebox and you have a place that makes me wonder why I don't visit more often.  Sadly the mission fixie douche crowd has moved in (the fact that they didn't come here when the place first reopened used to be a major perk), but even that isn't enough to detract from this great bar.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "My experience here was somewhat restricted by the single Prohibition ale I purchased, the 45 minutes of metal I listened to, and the need to drive my friend to the BART before it closed. But I can say that my brief, loud experience at Bender's was great! A dive with quite a lot going on -- space for a band, space for a pool table, space for food to be cooked, space for regulars to sidle up. It's not a cozy bar by any means, but I'd definitely come back here for a good, chill, fun night in the Mission, when the sweat and nausea from [insert Kilowatt, Delirium, or other dance-based Mission bar here] get to be too much.", "author": "Stefanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-31", "description": "I really enjoy going to benders. The bartenders are always very friendly and will recommend different beers as well as suggest you get a pitcher to save money!\n\nI love that they have vegan options, I hope they bring back the fried pickles!", "author": "Meghan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-07", "description": "had the mac and cheese sandwich with bacon. pretty damn good. will come back and try other stuff on the menu next time.  tots were great.  cash only.\n\ncool dive bar.", "author": "Wayne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-05", "description": "i used to come here when it was SACRIFICE and this dude from San Mateo threw an \"underground\" hip hop night.\n\nYO YO YO YO YO YO YO\n\nSince becoming Bender's I've only been here once. I did some illegal stuff here and remember being in the boys bathroom at some point. I must have been on a Bender.Oh I'm funny", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-13", "description": "Had an awesome time @ Green Lady Killers.   Bar staff was great!", "author": "S W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-08", "description": "Cool Dive Bar + Good Food + Smokers Patio = Sunny San Francisco Saturday Afternoon Nirvana\n\nStars for:\n1.  Being a kick ass dive bar: Great bartenders, outdoor patio....\n\n2.  Great cheap drinks: Try the Palm Job - it's an Arnold Palmer (Iced Tea & Lemonade) with vodka @ 6 bucks a pop try 2 or 3 or 4....\n\n3.  Good Food: Ordered the burger and fries... very yummy (though the dude servin'em up was yummier)\n\n4.  Friendly, fun, honest people:  I lost my blackberry (1 too many Palm Jobs) and it ended up with the bartender.  I sat outside running my chops and came back to find my purse had been turned in at the bar.  I spilled a drink outside and every person back there said they'd come to the bar and vouch for me.\n\n5. Cool shows: While I wasn't there on a show night any place that has had a Burlesque performance to a Kiss Cover Band deserves a star! I hear they have burlesque ever other Saturday night...", "author": "Natasha R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-06", "description": "Total dive bar. $4 for a bottle of Newcastle. Interesting environment; bikes hanging on the walls and stuff. The place was fairly clean. I was sober enough at that point tonight to enjoy the drivers licenses that were part of the table decoration near the grill. I want to try their food sometime, because it smelled/looked pretty good.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-24", "description": "So glad this place finally reopened. My new local bar two blocks away. I know Inner Mission is on my block but no liquor there and even worse ventilation. Here's a tip, if your gonna let people smoke their cancer sticks all in my face, invest in a $10 fan over the door. Anyway, Benders has cleaner air, cheaper drinks, cool owners / bartenders, amazing fish and chips, pool tables, a good jukebox, bikers and you can park your dog and/or bicycle inside. Now if I only had the time to get out of the office and go get my shitface on... Oh yea and if i ever find the coward who torched the place originally we have a serious beef and yes thems is fightin words  ; )", "author": "Artimus I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-08", "description": "Josh and I met up at Zeitgeist this past Friday around 7PM.\n\nI should have known that this was a bad plan.  \n\nA decent sunny day, the weekend beginning, beer o'clock and Zeitgeist would, of course, be a freaking zoo.\n\nI used to be able to stand in the back, digging a hole in the gravel to keep the pitcher upright as friends and I huddled around the thing like a camp fire, ocassionally refilling our pint glasses.  \n\nI don't know at what point I became \"too old\" to stand in a pit of Grape Nuts yelling over the 10 million conversations happening around me.\n\n'dia was at Benders with some Youtube bretheren so we made our way to 19th and Van Ness excited to be going somewhere new.\n\nUpon walking into the bar, we had no problems getting drinks from the uber friendly bartender.  We even had room to sit down, the bar not packed yet not empty.  Just right.\n\nI spotted the grill and the menu.  I recognized the font instantly.  Weird Fish?  Really?  Some of the signature Weird Fish dishes were listed and sure enough before you could say \"seitan\" I was at the counter ordering food lest I fill my belly with Jameson for dinner.\n\nBenders was a nice lil' place away from the Valencia St. corridor of bars.  We loitered well after midnight.  \n\nYay for new things!", "author": "Jen I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-01", "description": "Back at Benders after two years, throwing another party.  I kept Johnny in the loop regarding attendees and checked that bringing in food was still cool.  Kevin  and the other Bender's folk made me welcome when I came in to set up.", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-16", "description": "If you walk into a bar and see a hand painted portrait of Phil Lynott hanging, you know this place rules! \n\nThe fire was the best thing to ever happen to Benders.   This bar used to be a dive and a half.  Today, it's cleaned up and has nice stage.  The pool table area has been lifted making it super cool to watch a band, check out/stalk the patrons, or shoot a game of 8 ball.   They still need a few things, like a PA system with a good sound guy. They also need to get rid of that bar near the unusable corner entrance as it's just wasted space and would be better served for seating.  \n\nBTW...The bartenders here are cool and don't take kindly to hipsters, yuppies, and poseurs.  If you think they're rude, you don't belong there.  \n\nGet the hint?", "author": "Larry A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-23", "description": "Tues. near midnight.  Wanted to go somewhere and this place is 3 blocks away.  The kitchen (which closes \"late\") serves seitan cheesesteak.  Sold.\n\nSadly there was just a guy with a damp rag and turned off lights.  I went back to the bar side and had an Arnold Palmjob (sweet but a bit weak) followed by a Guinness, and parked in front of the big projection screen.  I missed the zombie movie but then they started playing vintage Fleischer Superman cartoons.\n\n2 long-hair doods with flannel/metal t's and copious PBR's parked nearby and I apologized for taking the best cartoon seat.  Non-stop chatting ensued, from crewing music shows to hustling work to health care to the delicious pee and fish-scented neighborhood we could smell again, now that we mutually recovered from last week's sinus plague.\n\nThe bartender took care to ask my name and give his plus some chat.  He might have given more attention to some regulars but that's OK, I'll come back.  Pretension-free, so, 5 stars.  Hail Seitan.", "author": "Pat L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "What a cool place!\n\nMy husband's band played here recently and they were so accommodating.  Essentially unlimited guest list (although we didn't make use of it), free PBR and/or Tecate for the band for the entirety of the night, and half off at their lovely grill.  They serve tater-tots!  C'mon!  That's awesome!\n\nWe are originally from San Diego, and I have to say that whenever he plays out in the city there is always great crowd response.  I love the open-mindedness that the folks in the Bay Area have toward non-mainstream music.  It makes for a fun experience.\n\nHe has played at many places in the city and this has been, by far, the best!  Thanks so much to the genuinely nice staff!", "author": "Stephenie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-17", "description": "Yet another uninspired dive bar that thinks its hot shit. I really don't care how good the beer selection is or how cheap the drinks are. When you are a rude jack ass to me and my friends, you can kindly kiss my ass.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-10", "description": "Large space.  Not packed at all.  Plenty of room to sit, dance with yourself, or play pool.  \n\nStill it wasn't my favorite place  But to be fair, it just really wasn't my scene.  But I'm a good sport and I went.  When I walked up to the door, Duran Duran's Girls on Film was playing...that made me smile.  Then I walked in...\n\nDon't think I would be back.  But I can see why it appeals to many I guess.\n\nP.S. Where was the grill part?", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-05", "description": "I'm surprised I haven't reviewed this place yet, considering they've got the BEST BLOODY MARY IN TOWN. That's a bold claim, yes. It's perfectly spicy -- not \"burn your face off\" spicy, but makes you sweat -- & includes online, a celery stick, & beef jerky. The staff are nice but no-nonsense.\n\nA great little dive minus the typical Mission hipster posing.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-17", "description": "I had a terrible time at Bender's, but I do recognize that it's a pretty good bar. I wasn't feeling very good that night, and we went to meet some friends who were attending the screening of a really awful documentary. Prior to the documentary they played some really gross slasher film that literally turned my stomach. I went and threw up. \n\nThen this band came on, and while they weren't at all bad they were deafening. I'm not too old to say that I'm too old for loud music, but I am too smart to not care about my long-term hearing. \n\nI disagree with Julian M. that Bender's is \"douchebag\" free. It's just a different type of douchebag.", "author": "Maple Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-31", "description": "Cheap drinks and greasy fried food, what else could one want from a dive? Bar tender was responsive and quick. Only their lack of shuffleboard is keeping them from a full 5 stars. Definitely on my list of worthwhile dive bars.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-26", "description": "Cheap solid drinks($4 vodka soda's), tasty eats courtesy of the chefs a la Weird Fish(so I've heard), and a fantastic jukebox blaring Sonic Youth when we came in last night. How can one complain?\n\nLocated on the block following my best friend's apartment, it seems only natural we'd end up here eventually although she was a bit reluctant in that the previous times she'd been by there had been a $8-10 cover charge. I urged her on anyway with the promise we'd split if there was a cover but in fact, there wasn't. There was however, a pretty burly punk rock door guy though who didn't hesitate to card us. In fact, we were carded a second time by the bartender- a long haired rocker, who could have easily been a double for Sebastian Bach. For many, the double carding may have been annoying, but for moi,  who turns 30 this year, I'll happily take these requests as compliments. \n\nMore cool stuff about Bender's: \nIt's really spacious. We had no problem finding several seating options. A nice long sparkly (literally) bar with comfy short backed bar stools, pool tables, another room where the fryer station and a smaller second bar are located with some pretty awesome tables featuring tabletops made out of real confiscated fake IDs. \nAgreeable crowd made up of a random mix of the local younger 20's set, mid-aged punks, and normals.  \nThey offer the same fried pickles served at Weird Fish. We actually had ordered them at dinner before we hit up Benders and I can honestly say, they rule!\nAs previously mentioned, they have a sweet jukebox! This is key to the makeup of a bar that I'd make a weekly destination. \n\nTo sum it up, Bender's is definitely being added to my list of Mission dive bar faves.", "author": "Callie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-25", "description": "Bender's is definitely my new local!  After moving to the Mission, I lamented the loss of Molotov's and Cafe du Soliel as evening watering holes, but then I found Bender's.  Think Molotov's with nicer bartenders and about 8x more space, seating, and an outdoor area (oh and let's not forget fewer hipsters).  \n\nWhen you walk into Bender's, you're reminded of any old dive bar, save the killer decor, but it has a bar with a bunch of stools and then a series of small high tables with high chairs across from the bar.  Then you walk to the end of that area and you realize Bender's is so much more.  If you take a right at the end of the bar, you find yourself in a comfortable sitting area where movies are often projected on the wall - though with the jukebox on, it would be a miracle to hear it.  If you continue straight up the 4 steps at the end of the bar you find yourself in the pool area, it only has 2 tables, but plenty of room to shoot and plenty of seating to watch the shooters.  \n\nContinue back past that and you find yourself in an enclosed outdoor area with 2 picnic tables.  Great for those of us who smoke.  Also, they allow dogs, which given I take my puppy just about everywhere (save the office), is a huge draw.  \n\nThey also do free BBQ on Sunday afternoons, and the Wednesday special (Whiskey Wednesdays) a shot of whiskey & a beer for $5.00 can't be beat.\n\nDefinitely one of the cooler places in the Mission - though watch out for some of the guys there (especially greasy ones in track suits) they can be a little drunk and pretty aggressive.", "author": "Alison L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-05", "description": "Rode in by bike, parked up inside, left my helmet hanging from my handlebars, and started drinking.  I never felt so safe about leaving my passion without locking it up before.  \n\nI also thank the extra time spent poppin' an extra hole in my beers.  The sensation of alcohol breathability makes you appreciate, and drink, that much better.\n\nBest of all, Sam the bartender asked me \"Comedy or Zombie?\"  He made a wise decision playing The HIlls Have Eyes.", "author": "Christopher N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "Dirty, divey, and not really my usual kinda place, but what was that?  FREE BBQ???!??!  Oh hell yeah!\n\nI had so much fun the last time I came here.  I started out the day having Sunday brunch at Foreign Cinema with a group of friends, and we ended up getting drinks here afterwards (quite the contrast!)...drink upon drink upon drink....*hic*...\n\nThe pints of margarita were delicious and strong, the bloody mary's looked awesome (I would so get one if I actually liked them) with all sorts of celery and pepperami and other random savoury ingredients sticking out all over the place! Perfect to drink whilst sitting out on the back terrace in the sunshine and listening to punk rock.\n\nI am bonkers about bbq at the best of times, but when they are gratis??  Are you pulling my banger?!  Grill me up some meat and let me sink my teeth in already!  The burger was amazing (granted, this was after about 5 margaritas, but I still maintain that it actually was amazing) and the guy that made it was a master of his craft.   There was even a little bar piled up with relishes so you could customize your piece of meaty/bappy heaven. YUM.\n\nThis is definitely not somewhere I would want to go out to in the evening, but going on the fun I had here last time + drinks + food + sunny patio I have to bump my star rating up to 4.\n\nOh, and there's a photobooth to remind you of how bad you look after you've been drinking margaritas all day...", "author": "Melanie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-06", "description": "This place sucks. It might as well be in Santa barbra or some other town in SoCal. The bartenders suck, especially the girl, I think her name is Danielle. She yelled at me for tipping her only a dollar for my 2$ Pabst.WTF? They definitely don't get my vote. Probably top 3 worst bars in the city.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-29", "description": "Fantastic dive bar in the Mission. Great Veggie burger, good drinks, cool layout with pool tables and a cool little patio!", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-30", "description": "Gotta love a bar that shares its name with a cartoon character. Bite my shiny metal ass.\n\nBender's is a very solid local divey bar with some great character. The place has lots of space and while it's lively, it doesn't get stupid crowded like a lot of places can get. \n\nTend to have live music on the weekends, and most of the local bands I've seen there didn't suck, so that's a plus.  \n\nFor a bar they've got some solid menu items too, so foods is an option.\n\nVery nice and pretty low key crowd. Great bar to meet up with friends at and enjoy more than a few beers.", "author": "Andy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-08", "description": "Johnny Bender..or just call him Johnny, worked the SF bar scene for over 15 yrs before he landed this joint in the mish that used to be called Sacrifice. The bar burned in a fire in the same buiiding and they were outta commission for almost a year. just re-opened a year and a half  ago, it is the pinnacle rock n roll bar in the whole neighb and a sure fire way to send you straight to hell in a pint glass. Drink specials all week long and they serve food too with a full kitchen. Support your local rock bars as they create the mayhem we all seem to love deep in our hearts. Johnny,Steph,Chupa,Liam,Cassie, are there to provide you with the proper elixirs.\nI need a shot of Jager..!!Swill it!", "author": "Sven S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-05", "description": "My favorite local bar.  Mellow, decent prices ($4 for a draft beer...and a totally acceptable selection).  Dog-friendly if, well, if your dog is friendly (and on a leash).  The food is exactly what you'd want...fried and convenient.  Typically has good tune's pumping on the Juke box.  Usually a mellow vibe.  It's a really open space, which I totally dig (you don't feel packed in).  The only thing that it doesn't have is booth seating.  There are benches, though, so it get's a pass on this front.  I've been there with my squeeze and my dog a bunch'o'times and I'll be back a bunch more.\n\nAlso, Monday night is dog night.\n\nDOES NOT accept credit cards, but there is an ATM machine right inside.\n\nThere's a small beer garden out back.", "author": "Thomas K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-19", "description": "Nothing's better on a warm Sunday afternoon than a $5 Big Daddy, bobbing around to a little live music, and free BBQ on the patio. Hipsters, puppies of all sorts, young, old, and pasty girls like me are all welcome. \n\nSan Francisco at its finest.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-29", "description": "Could be my new fav bar...lots of cute hipster bikers to ogle, pool tables, pinball, good beer selection (Hoegaarden!) and food from Weird Fish satellite (Tues-Sat) and sushi on Mondays.  \nI would not order the fish n chips again.  Have you ever swam in a lake and accidentally downed some of the water?  If you haven't, try the fish n chips, that's what they taste like.  Yuck!  It's catfish, which I don't think normally tastes like dirty lake water, but this one did.\nNext time I'll try the burger and fried pickles.\nSundays they have free BBQ and they have outdoor seating, I'll def be back!\nHappy hour until 7, $1 off beer.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-25", "description": "I hung out at the bar the whole night and the bartender was funny asking us trivia questions. Oh yeah they have trivia question napkins too! I had this cherry lemonade vodka drink, first couple sips was good then it got nasty. Best thing I had all night, WOODCHUCK CIDER! I have never seen it before and it was good! I will be back for some woodchuck for sure. Oh I also had beer. Well Beer, Cider, and Vodka all mixed in my tummy was so no bueno!", "author": "Karen T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-31", "description": "UGH!  Hipster hell! Someone said for people who don't use the term... You were HIGH when you wote that right?\nOver ran with bikes inside.\nDecent pool area which is why they get 1 star.\n$10 for a Cheeseburger that I waited over 1/2 hour for and it was NOT busy at all! The burger was over seasoned and just plain awful!\nI mean really $10? for a burger? In a bar? Really? \nThis is a scened where the Delirium \"socialites\" (or so they think they are) go to go slumming.\nSomeone said plenty of seating? I'd like to know where?\nOh and let's not forget the puking girls in the bathroom that made all of the other girls hold the door open so us guys could make sure it was happening a", "author": "Jason K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-27", "description": "Great bar, the second time I've visited since the fire.  It was good to see Neil Motterham's photography on the walls.  I got to play the pinball machine.  Took photobooth photos wit my friend from Colorado.  Hung out on the patio...  Wished that Chupa had been bartending, but the bartender that afternoon was very friendly.  I'll be back.", "author": "Sam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-26", "description": "If you don't believe that Bender's has REAL Ultimate Power  you better get a life right now or I will chop your head off!!!  It's an easy choice, if you ask me.  \n\nBender's is sooooooooooo sweet that I want to crap my pants.  I can't believe it sometimes, but I feel it inside my heart.  This bar is totally awesome and that's a fact. Bender's is fast, smooth, cool, strong, powerful, and sweet.  I can't wait to start yoga next year.  I love Bender's with all of my body (including my pee pee).", "author": "Ziad E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-17", "description": "4 stars ONLY because I've been here once, on a Whiskey Wednesday with $5 dollar Jameson + PRB. Otherwise it seems like a yypical dive/biker bar...\n\nI'd go back I suppose...", "author": "Evan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-11", "description": "I have to say if you go on a weekday night (mon-thurs) you will have the bar to yourself! I come here every so often with friends to just kick it, play some pool, listen to some sweet jams, and maybe play some pinball while knocking a couple back. If I need a place to chill and not be bumping shoulders with a crowd but still want to get out, I'll come here. \nOh did I mention this place is divey!? F'N AWESOME!", "author": "Eric A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-08", "description": "I had a Day of Trauma yesterday. First day back to work after being flu-ridden, and I decided to get my hair cut. I have no hair now, which makes me very sad - a year ago it was half way down my back, now it's halfway up my skull. \n\nAfter staggering out of the hair salon in shock, I decided I couldn't go home. Beer would be my only salvation. I hit up the 500 club to drown my sorrows, and start chatting to another girl at the bar. After a few more beers, we stagger on to Benders in search of more beer and men. With rugby player thighs, as I recall. \n\nThe last time I went to Benders, I was a little overwhelmed by the aggression in the bar. Last night, I was full of love, and hefeweizen. It was a quiet night, with the barstaff chilling out. It seems my new friend is a regular there and made me feel right at home. I had good times, and a good seitan taco (killer spicy tho... I remember that) which had a double taco shell (glued together with melted cheese). \n\nToday I have a shocking headache and the memory of the chipfat smell from Benders (it did smell quite strong last night) - a smell I can't stand so I had to chip a star off. But really, I like Benders. And it's within staggering distance. Until my hair grows back, I am pretty confident I will drink there again, and again, and again...", "author": "Catriona C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-05", "description": "Benders is my kinda spot. I tried to branch out... but in the end, all I really want is non stop PBR's  and the occasional neat Jameson. I appreciate the fact that the bartenders here know how to open a can of beer properly, with an extra hole punched in the top. you'll usually find me camped out at the bar every sunday night. \n\ngreat song selection on the Jukebox too btw\n\nI love Benders. Cheers Kevin! Cheers Dion!", "author": "Jevir G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-03", "description": "Bender's bar was named that way before Futurama came around, but they've embraced their new mascot with style.  The two pillars behind the bar are topped with masks of Bender and Flexo (a gift from patrons) and Johnny (the owner) has a giant Bender tat on his side.\n\nThe booze selection is pretty good -- they had some nice scotches, including one cask strength (60% fire breathing goodness).  The crowd was nice and not full of mission hood rats like some other local bars.  I'll definitely be back.", "author": "Eugene F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "at Benders even Monday nights could become your new weekday drinking night...... full bar, pool, outdoor smoking patio til 10:30pm............try the $7 Strawberry Magaritas! There's even an indoor bike rack, so your bike won't get stolen until after you leave the bar.", "author": "Mystery M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-27", "description": "I usually love Bender's, but last Friday the 24th they had the worst doorman imaginable. He was denying me entrance and telling me that my ID was most certainly fake. He examined it with a black light, started bending it and almost broke it in half and then took it away... (My ID is 100% real and has all the holograms and black light seals to prove it.) He told me that I was going to jail and that I wouldn't be able to vote for 7 years because I just committed a felony. He was extremely rude and wouldn't listen to a word I said, using profane language towards me. I told him to go ahead and call the cops because they would just prove him wrong, but he just kept bluffing and never called the police. 20 minutes later he told me that he would do me a favor and give me my ID back and to get out of his face. What a nice way to treat a regular customer with a real California driver's license.", "author": "Clive H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-24", "description": "I am so lucky I don't live near Bender's.  They would so own my soul.  \n-variety of drinking options, from cheap, to weird, to fancy cocktails\n-qualified bartenders, not stuck up\n-awesome music\n-weird fish menu, hello buffalo girls and boys!!! NOM!!!\n-laid back but good energy\nIt's really hard to find a good bar where people aren't all pretentiously self aware of how good they are (thereby ruining the whole thing).  Benders seems to get past this easily.  I adore them.\nP.S. Sushi night Mon: best kept secret", "author": "Jessa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-11", "description": "I got in a fight about Black Flag with my husband a while ago after drinking too much champale. I stormed out to cool off for a while, and I ended up at Bender's. I drank a Budweiser, talked to a friend (amazing - I had lived in the city for less than a month at the time, so the fact that I found someone I knew at Bender's was a small miracle) for a little while, and headed home in a much better mood.\n\nBender's has good beer on tap, plays great music, is open on xmas day, and is named (I blindly assume) after a Futurama character. Five damn stars.", "author": "Jordan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-28", "description": "BENDER'S is the best dive bar in the city. If you want cheap beer and a shot, do it. \n\nIf not, go back to Union St.", "author": "Ralph M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-26", "description": "I am new to town and I have been hesitant to sign up for yelp because for me it is too 'californian' lol...  But this place made me wanna be a californian when they showed me mac and cheese in a grilled cheese sandwich... With Bacon! If you are a cheese lover than this sandwich has gotta be put on your bucket list!  Best place - have eaten so far in san fran!", "author": "glenn g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-08", "description": "This place isn't for everyone but it suits me fine.  Dig the rotating art, Saturday night live music, and the crazy locals.", "author": "Ralph S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-22", "description": "UPDATE; Definitely try the fish and chips!!!! I came back just to see if they were really as good as I remember, or if it was just the booze talk'n. My stomach has reaffirmed freak'n great fish'n chips!\n\nFun hang-out, decent happy hour, decent seating! They have great drunk food (fried anything), try the fish and chips, BOMB! The bar is fully loaded, although last week I ordered a 'red headed slut' (Jeager & Cran Juice) and I got a Jeager and Crown Royal.....blah!\n\nDo youreself a favor and bring a cab here.", "author": "Dr. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-30", "description": "Oh please, please, please keep the food here alive and well.\n\nWalked in here after my volunteer gig, and discovered to my pleasant surprise they have SUSHI here on mondays! The wait was not bad, and the quality of sushi was pretty excellent, the peeps from ICHI represent, and they do it well. The perfect beverage to wash down some hamachi or maguro? Two dollar PBR of course, the price is right!", "author": "wayne s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "I think it is the last friday of every month. They bring over the chick that used to do Karaoke at Annie's Social Club before they shut down. She is awesome! Half the group there could care less about the karaoke but then there is the part of the room that is just totally grooving to it. A great place for karaoke.\n\nOne thing to consider though...don't block the screen! Unlike some other karaoke joints this place has a single screen!", "author": "H B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-23", "description": "I have been to Bender's before but I think I just began to really appreciate it.  It's smack in the middle of the heart of the Mission, walkable from everywhere.  Cheap beer and whiskey, nightly grill, pool, photobooth.  All great things.  The back porch is like mini-Zeitgeist.  Bender's has sold me.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-16", "description": "Two pool tables, a pinball machine, and a couple of those bar computer games keep me amused when my mind needs a little more entertainment when hanging out provides. Plenty of quality beers bottled or on tap, and of course the usual bar mixers. \n\nYou can even get food here- vegetarians and non vegetarians alike can get satisfying delicious bad for you food. Another great factor when some in your group are hungry, and some want to go to a bar. \n\nI've never been here when it's packed, which is nice, because I get a little edgy in packed bars. It can get overrun by \"I'm cooler than you\" people on occasion, but it's always a hospitable place.", "author": "Nick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-23", "description": "hangovers hurt.... I heard I had fun though.\n\nFrom rainbow vomit on my bathroom floor I am assuming they have a variety of drinking options and decently strong drinks.\n\nPhone pix seem to indicate friendly slightly grungy folks and games...", "author": "Yosh K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-04", "description": "I LOVE IT HERE.  It's the quintessential Mission bar:  great beer selection, great whiskey selection, pool tables, beautiful graphic posters from awesome shows, delish bar food, pool tables, a bike rack, and it's dog-friendly :)\n\nThe layout is great and provides a ton of seating that is just right for people watching or keeping an eye out for a friend.  Even when it's crowded, it doesn't feel like you're boxed into an endless sea of people.  It definitely helps that it's a few blocks away from the rest of the Mission mayhem.  Oh, Bender's.\n\nI miss that robot.", "author": "Laura F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-31", "description": "Dear Benders,\n\n    Please come back, my liver has fully recovered.  I miss Damon's burgers on Sundays and Chuppa's triple strength mixed drinks in pint glasses.  So to recap.. Please come back because my liver is now fully healed and i must destroy it.\n\n-kiya", "author": "Kiya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-07", "description": "Wow I really like it here!  Spacious, laid-back (at least on a Tuesday), tasty food, good company.  (Well, *I* had good company at any rate... but perhaps the company isn't provided with the bar.)  \n\nAlso, when I lost my wallet, (a) someone found it and handed it over to the bartender, and (b) Johnny (bartender, owner I think?) called my cell phone later that night to let me know it'd been found.   Hurrah!", "author": "Angela P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-25", "description": "This is my bar when I'm not at the 540.\nGood Beer, Good Music, cool people, outdoor patio, reasonable food and Chupa is one of the coolest bartenders in the world. Even the bikers are usually friendly :)\n\nIf the ressurection were not proof enough of Benders being awesome, they have badass food! The Deep Fried Pickles are AWESOME.\n\nHIPSTERS STAY AWAY, WE HATE YOU.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-23", "description": "if you can get over yourself and the patrons and realize that you are knee deep in a hipster dive bar this place is actually pretty bad ass. the bartenders and chefs there are amazing and really seem to enjoy what they do. the octopussy's garden burger with tater tots and a side order of deep-fried pickles are a vegan dream. \n\nbenders also has a pretty elaborate draught beer selection along with various drink specials.", "author": "Hank G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-26", "description": "Like the other reviewer said: \n\n$5 PBR + Shot of Whiskey = Whiskey Wednesdays\n\nThe food is also GREAT. Try the mac n' cheese (a sandwich!) and you'll know definitely be cursing yourself for not trying this place sooner. \n\nBonus points:Play the White Stripes on their jukebox -- the bartenders get really mad!", "author": "Steve L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-29", "description": "I frequent this place pretty often bc of the great atmosphere and cheap drinks.  I recently saw a black sabbath cover band here that was pretty good and entertaining.  I had great experiences with the staff here and other patrons as well.  I love all the metal in the juke box and the decor around the place.  I find it great that i can bring my bike inside and leave it on the bike rack so i can keep an eye on it.   This is a great place to avoid all the people that come in on the weekends to the 16th and valencia area, that act like morons and thrash our hood.", "author": "daniel p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-02", "description": "Dirt bag bar full of dirt bag bikers. Whiskey Wed is hard to beat let me tell you. Kevin, Will, Chupa serve up the poison graciously. Good for a evening or weekend afternoon to just hang. The food has always been spot on. No faults in this bar.", "author": "Frank B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-20", "description": "Yes  Benders is now closed & Yes i'm still going to review it.\nWHY? \n\nAside from the obvious - i miss this place . . .\n\nBecause Benders just had its Xmas party at Annie's Social Club\nand what a trip.  To see everyone who use to drink at Benders\nall in the same place once again (just not at Benders).  \nHILARIOUS.  Good Times.\n\nAhh the drinking, the heckling, the flirting.  \nCHUPA - You're Still the Hottest bartender. \n\nOh how easy the Benders moments of yore come back. \n\nCan't wait for the reopening in 2007.  \nWherever it maybe, I'll be there.  Thanks Johnny!!!", "author": "M E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-07", "description": "Almost a perfect dive bar, except it had such open space and a friendly feel. Strong drinks, great grill menu, 2 pool tables with lots of space, plenty of tables and chairs even when it gets crowded, and clean bathrooms (at least I know the ladies room was) with working, possibly new, toilets!!! I had the usual Makers and diet, but my friends had all different kinds of beer. Also tried the grill... had a \"grilled cheesus christ and tomato sandwich w the added bacon.... perfect in all its greasy splendor and served with a side of tater tots. The grill even offers plenty of vegetarian options. I didn't get a chance to check out the jukebox selections but I don't recall hating anything that was played, don't recall anything standing out either.", "author": "ALEXIS S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-01", "description": "A friend dragged us down here because he claimed it had a chill \"rocker\" laid-back vibe. He was right. They have lots of great draft beer, including Russian River Pliny the Elder. The place has a jukebox and lots of seating for larger groups. Definitely awesome.", "author": "Natalye R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-17", "description": "I ended up here for a friends birthday... unfortunately it was late night and I was unable to try their food, but I must say I LOVED the environment and I can't wait to go back and bring my friends... \n\nI only drank beer, $2 pabst is definitely in my budget! Dennis order a Long Island, and OMG it was strooooonger than a race horse dragging a cart full of 20 people but very yummy... I also loved that 2 people brought their dogs to the bar since I am a dog lover.\n\nThe crowd was an ecclectic mix of folks and I can't wait to return on a Sunday for their BBQ!", "author": "Chrysantha C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "Hooray that benders is back. I went for a burlesque show starring three of my favorite performers - Kitten on the Keys, Allotta Boute, and Trixie Treat. It was fabulous, as were they.\n\nHavn't tried the new grill yet, but I was pretty excited that the men's room had a stall AND a seat AND toilet paper. Hmm, I guess my standards have gotten pretty low. sigh.", "author": "Gabe S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-26", "description": "Like Thee Parkside, Bender's is a great place to see bands play and put back a few beers too.\n\nI've only been here once, but it has a nice stage area with a nice sound system.  \n\nThey also have a grill where they supposedly make some good food, but I haven't had any of that yet.  Soon though, I'm sure.", "author": "daniel m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-25", "description": "This place rocks. Hard.\n\nSeveral times before I finally made it in, there was an attempt. Each time there wound up being a special event of sorts and therefore a cover charge.\n\nI don't pay cover charges.\n\nI've gotten lucky, lately. I've been able to actually go in...and that's totally rad because this place is hella tight. \n\n(See how I worked that slang in there?)\n\nThe bartenders are hot punky-types. There are TWO pool tables (and I hear they have tournaments). There is PLENTY of seating. There is a good selection of beer and there's ALWAYS 2$ PBR and 2.50$ Tecate.\n\nThere's also the Weird Fish sattelite here, which means I can get vegan fish'n'chips or (gulp) fried pickles with my booze.\n\nThe music didn't suck, either.\n\nAnd, if all else fails, you can just look at the fake ids that are set in the table.", "author": "Danyell K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-13", "description": "This place is a really great spot to stop if you're in the mission but don't want to hassle with all the crowds around 16th and Valencia.\n\nThey have plenty of good beer on tap (Death and Taxes, Coney Island Lager) as well as the cheap stuff (it's the mission...of course they have Pabst). Two pool tables and a solid jukebox should keep you entertained while you drink, and they have a pretty good selection of live bands roll through as well. And If you're finishing up a long night here, drunk food doesn't get much better than a grilled cheese sandwich, mac & cheese, and tater tots from the prominent kitchen/grill just inside the front door.", "author": "Devin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-28", "description": "There is an ample slection of booze for a good price.  Perfect place to start or end a bender.  I don't think I could spend all night here.  Attracts rocker types.\n\nEDIT:  Benders is BACK! And they have one of the best burgers in town for $10... better than about 90% of burgers on the market today.  Go get that dude... for real.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-15", "description": "One of my favorite places to get drunk and not recall anything the next day except for the photos taken in the booth as a harsh reminder...\nSeriously though, this is a community bar, it's awesome because they've held benefits for a lot of great people who have experienced hardship of some sort. That's how they do it and why I keep going back. That, and to see my hairdresser in Chupa's clothes. Pure sex. Free BBQ on Sunday afternoons ala Damon the Fabulous!\nUpdate: No photo booth in the re-model. Awesome bands on Fridays. Weird Fish does the kitchen now, tacos tacos tacos!", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "Good drunk food, cheap beers, chill atmosphere, the patio area is small but still a nice hangout.", "author": "Jorge H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-13", "description": "Bender's no longer serves the amazing fish n' chips or my other favorite greasy menu items of yesteryear. Now they serve things like tater tots, mac n' cheese and the like. Major disappointment. This is still a fun place to hang out but it is no longer one of my go-to bars in the Mission.", "author": "Veronica J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-09", "description": "If bars were songs this one would go:\nchuggachuggachuggachugganeeertneeertneeert WHHAAAAAAAAAAA.\n\nGo for the Whiskey Special\nStay for the burnouts.", "author": "Codester H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-29", "description": "I think my favorite parts about Bender's are\n\n1. The space. On a regularly busy night, there is room to walk around and not knock over drinks from bumping into tables. It's pretty spacious in regards to seating and standing room, even with two pool tables.\n\n2. The art on the walls. The first time I went, my coworker and I got into this long discussion about surrealism and feminism while trying to explain some of the art that was on the wall. I forget the name of the artist., but the art rotates so those particular paintings are gone.\n\n3. Drinks are a decent price.", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-16", "description": "I really,really liked Benders. I had heard all sorts of things prior to going there...you know...crap talking which was from it's former incarnation and prior to fire reputation. But it turned out to be great...for me. I wasn't actually buying my own drinks, SB was so I didn't get to interact with any bartenders and I stuck with something simple, vodka cran and thats pretty hard to F up. It doesn't strike me as a Lemon Drop type of place, more like a PBR type place. It's huge and has clean and modern bathrooms, really they are nothing like Pops.\nThey also serve food, you know things like Fish & Chips that can soak up all the booze you are consuming. A pretty good sized stage to see bands on too.\nIt just had an overall decent vibe to it and I was pleasantly surprised.\nOh and I can totally see this place getting really popular and thusly ruined, I really hope that doesnt happen.", "author": "Catty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-28", "description": "The ultimate biker bar...for fixed gears. $3 beers. Whisky Wednesdays. Cheap bar food. And a pool table. If you like divey and dirty, you'll love Benders, a true San Francisco bar.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-03", "description": "This dive bar is fantastic: motorcycles lined up in front, rough n' tough bartenders, patrons decked out in leather, and an awesome live band that will blow your ear drums out.", "author": "Jacqueline S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-18", "description": "Went there for my birthday a couple weeks ago. Took a while to find the front door but was glad when I did. It was mid-week so I can't attest to what it's like on weekends, but it had a good vibe, lots of space, and bike racks (always a plus).\n\nGreat dive bar, off the main strip (and close to Mr. Pickles). The beer selection was good, not to expensive. We ordered food in the back and were pretty impressed. It was reasonably priced and better quality than you generally get in bars.\n\nI'm glad this place is un-burned down.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-20", "description": "Benders\nThis is a pretty good dive bar. The bartender was nice and the crowd was pretty lively; I went with my girlfriend a Sunday night after The Simpsons. I guess I do not have much else to say about this place but I think I will go again to check out the Simpsons crowd.", "author": "E P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-02", "description": "My new favorite bar.\n\nIts a neighborhood joint that caters to a crusty rocker crowd, which is a good thing (no hipsters!).  Drinks are well priced, and the shots are huge. Tons of space.. two pool tables.", "author": "c v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-15", "description": "Lurved it.  The food, the cheap (er, I mean *reasonable* drinks), the funny-yet-just-surly-enough-service, and the PINBALL!\n\nWe almost didn't come here, because the menu as posted here on Yelp was about six items of Thai food.  But, a friend assured us that the food was done up by the same guy who did the food for Weird Fish, and we said \"what the heck?\"  \n\nSure enough, no Thai food to be found (maybe they should update the link, but I think they've got other business on their agenda :-)  Anyhooo...  The burger & fish and chips were awesome!  One star off for the fact that I was almost done with my fish n' chips before my husband's burger even came up.  :-(  \n\nIt took me until I went for a trip to the loo to find the backyard area and the PINBALL!  I am sold.  The pin was rad, a game I've never heard of called Junk Yard:  well-maintained and tons o' fun.  Got a match, the replay and everything!  It's labeled at $0.75 a play, but it was actually less than that.  Can't wait to come back for more.\n\nUpdate: There is a patio in the back!  It's nice.  We went on a Wednesday night & it was DPW night!  Lots of friends old & new.  Also, lots of drinking.  Sadly, they were out of burgers so my hubby opted to skip dinner.  Bad idea, but good times.  We'll be back & we'll definitely be eating again!", "author": "J Liberty S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-09", "description": "BEWARE OF ASSHOLE POOL PLAYERS WITH BALD HEADS AND LONG BEARDS WHO TRY TO INTIMIDATE YOU :) NO ONE GIVES A F*%&# IF YOU'RE ON THE BENDERS POOL TEAM!!!!!!\n\nOther than that, this place is fantastic! It's large, airy, serves good sounding food and stiff drinks. They also have two pool tables, but like I said, beware of the \"locals\" who are assholes about you enjoying a game of pool and making them wait a few minutes. One bald headed guy with a long beard is a particular ass. My solution: just go extra slow to fuck with them. This place is just far enough off the beaten track so the weekend Mission riff raff stay away. It is full of neighborhood types which is exactly how I like my neighborhood bars :) Also, they've got a pretty rad juke box...", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-12", "description": "I have to disagree with the holy Nish N. and say on the record that Bender's is a great name for a bar! I would surely be on one on a regular basis if I lived across the street from this place. Luckily I am about 2-3 blocks out of reach and can keep myself out of AA meetings for the time being. Bender's is one of those neighborhood bars that I never step foot in until Twelve Drinking Days of Christmas brought me there. No real reason for it - just never found myself wandering around the 19th and SVN intersection much. There's nothing to love or hate about Bender's, which equals a decent dive bar. Beer selection was strong and gives Shotwell's some competition. You couldn't beat the happy hour prices and if I remember correctly, it seemed to go on for a while. The only questionable thing I saw that night was a meat stick in a bloody mary. Could someone explain that?", "author": "Susan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-08", "description": "I've given Bender's several tries and for the life of me, I can't figure out what's drawing people here. They've got great fried food and good beer on tap, but I could easily name ten other bars within half a mile's radius that have better drinks and better atmosphere. I'll go here after work if I've got friends going, but I refuse to wait in a line to get into Benders. Not worth it.", "author": "Ali G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-03", "description": "I just moved one block from the front steps of this fine establishment, and so far it has proven to be stumble-home worthy. There is something magical about such a great place, so close to one's front door. I could easily go to Bender's in between loads at the Fiesta laundry mat (another magical place), or simply stop in every morning on my way to work. Or... not.\n\nThe staff is friendly, they didn't seem to have issues with my housemate passing out against the wall on Saturday (however there were issues with the strange woman with pigtails and Uggs). I have not tried the food, but the beer is delicious. It is a fun place to just hang out with friends, also a good place to see some rock n' roll.", "author": "Zara E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-05", "description": "An exceptional watering hole.  Came for the Noise Pop Happy Hour, stayed for the $3 Plinys.  The old Leather Tongue Video sign is a great touch.\n\nWell done, Bender's!", "author": "Michael O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-27", "description": "this place is my favorit bar around here. i just got here from sacramento and this bar is better than most there. \nguys im pretty drunk.", "author": "drunk y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-14", "description": "Came in fairly late to a Mike Giant poster release party, but the vibe was definitely chill and inviting. A hang out bar to get the night fired up for a house party in the Mission, this place is a good time!", "author": "Haz O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-15", "description": "I first learned about this place beause I performed at one of the monthly Burlesque shows. The place was packed, the crowd was lively, and it was a good time.\n\nI have since discovered an even better reason to visit however...\n\nTai Wei is back in action in the kitchen of Bender's Bar! Yamo used to be Tai Wei's kingdom... tasty unpredictable veggie thai. I experienced vegetables that I'd never even heard of... wore some borrowed \"bling\" from off the wall, and a watched 70's rennfairesploitation film. Alas, the place has been turned into another run of the mill restaurant...\n\nAt Bender's, he is serving meat, and the menu is whatever he feels like serving, but it's divine! You may not get what you ordered, but it will surely be delicious!! And, if you win the bar raffle you get a free meal, plus a shot and a beer...I'm in heaven...", "author": "Bethanne S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-14", "description": "A great getaway from the Marina crowd over-run places littered around 16th and Valencia. Usually almost empty, but always entertaining, it's a great place to avoid the douchebags on a friday or saturday night.\n\nHow sad that it closed... Boo....", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-03", "description": "Johnny Davis, Uber Alles, Uber Alles, Joh-on-ny Day-vis, duh dun duh dun duh dun...", "author": "Jonny A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-18", "description": "I like it.  Again.  Nice & open.  Wasn't crowded.  The pool tables have enough room on all sides to take a shot. There is also pinball, and other arcade games.  And lots of seating and yeah.  Only thing that keeps it from 5 stars was no food available and cash only.   \n\nI fully predict bumping this to 5 stars after another visit or two.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-15", "description": "First off I have to say who doesnt dig a bartender/owner with a Jim Beam tattoo? I know i do.\nI liked this place.  Nice comfortable seating, good live music, little outdoor area in the back, and reasonably priced drinks.  What else could you ask for? Food, you say.  Well theyve got that too.  All i had was fries, but they were excellent and with vegan ranch, i was stoked. Oh and did I mention that they display local artists work... \nI'll be back.", "author": "Becky S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-19", "description": "Me likes - outdoor seating, good beer selection, decent happy hour, food, sushi on mondays and apparently music - I'm guessing they move away the pool table or something.\n\nWill be back, probably on a wednesday for that whisky shot and beer.  I liked being able to find a place to sit w/o feeling like i was the only person in the bar.  A good spot on S Van Ness, stealing a little glory from Mission and Valencia - well done.", "author": "Tmon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-13", "description": "I like this place for happy hour. After work on Fridays me and the lady have met friends here a few times for drinks.  \n\nFinally got to try to food, it was better than average bar fare. My girl convinced our friend to get the \"Hellcat\" with bacon which we have all tried since then.  I'm telling you bacon makes everything better!", "author": "Richie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "I love this spot ... hung out there last night with the BF... showed up and was happy to see a wonderful variety of beers on tap .... great place to just hang out ... all kinds of folks come in and out.... great bicycles roll in and out .... bartender was great .. nice gal ... super friendly ... then I got the notion and orderred a Bloody Mary ... Bartender asked if I was a vegetarian ... I let her know I wasnt ... and in a matter of moments .. before me I had the Bloddy Mary Buffett Beverage of my Dreams! Beef Stick , green beans..olives and onions... oh boy! ... with the thunder and lighting having a feast outside in the night .. I sat and enjoyed my cocktail inside ... oh yes.. when their kitchen is going.... you have to try the deep fried pickles! \n\nSee you there", "author": "Dora G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-21", "description": "Fat drinks at very fair prices.\n\n6 stars in my book.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-30", "description": "The most beautiful Phoenix I've ever seen.\n\nThank you, doctor. May I please have another?", "author": "Linda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-23", "description": "can't wait to see the re-build. I have to say i am not the most impartial person to review this, I am one of those that was a reg. at Ziegiest and here:I have played many a music show at both venues er...bar.\nMy only beef was not with the bar but some of the patrons that used to come for the monthly burlesque shows. There plenty of places elsewhere for these richies to slum at. sheesh.\n\nSo the drinks are cheap and strong and the more you are a regular the stronger they get.  Nuff said.\n\nOkay now for the shameless plug. Come down on  this Sat 4/26 for a live show with Wilson Gil & the Willful Sinner's and T&A (Tracy & Angel and friends) It's some hard country and some dark sultry bluegrass if your hip to that sort of thing.", "author": "Angelique X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-30", "description": "For 12 bucks you can get yourself two decent fish tacos and a gynormous margarita. Most of the people that come here ride their bicycles a lot and don't shower. And the creepy lady bartender waits for you two finish your conversation while trying to take your order and looking totally annoyed.", "author": "Y K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-14", "description": "its a popular dive bar for people who want to go to dive bars but are to afraid or turned off by places that are too scuzzy.\ni like this place a lot even if i feel they try a bit to hard to be divey for the sake of being a dive. does that make sense? its cool.", "author": "Mattew W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-01", "description": "DO NOT GO TO BENDERS! Here is what happened to me. I ordered and paid for two drinks at Benders. The \"bus boy\" came by and took my drink even though it was half full. Later I ordered a second drink and the \"bus boy\" came by to take that too-- half full. I grabbed the drink from him and said: \"I haven't finished my drink yet.\" Instead of saying he was sorry and leaving it, he acted like he wanted to fight me, saying : \"It looks finished to me.\" I couldn't believe it nor could my guests. I asked to see the manager and the \"bus boy\" said he was the manager and he could throw me out.  Bender's is being reported to the liquor control board-ABC\n\nTo: Troy S. Does the S stand for Shill?  As in a Bender Decoy...\n\n\"Sitting next to us...\"   What a coincidence!  \n\nAnyone can report anything to the ABC.  They may or may not choose to investigate. If they do they will have a person/persons go to the club as participant observer(s).\nThey may notice that aggressive \"cleaning up\" occurs at or near the end of musical sets, particularly when there is a cover charge.  Such \"aggressiveness\" could lead to increased turn over and increased profits for the club... or it could be they ran out of glasses... but in any event, a patron of a club, not intoxicated, who wants to keep his glass which still contains part of the drink should not have to feel confronted with violence if he does not give up his glass. This was the second time a glass was taken from me that still contained a drink.  The protocol is: \"Are you finished with your drink?  It is not  \"give me that glass or I'll throw you out\"!  Such a reaction  can do  only one thing... provoke violence... and that is what the ABC has an interest in preventing.\n.", "author": "richard w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-18", "description": "The smoking room is permanently closed (y'all should quit smoking anyway!) and the menu has been revamped since I last wrote this.  Otherwise, the rest is still the same.", "author": "Rick E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-17", "description": "Went back and was pleased to find Bender's is now drawing a more diverse crowd.  They also have some great live shows, and the space is getting better and better - tons of seating, convenient Mission location, and I love how they have the old Leather Tongue Video mural...", "author": "Sid D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-25", "description": "Great music, great food, great bar. Checked this place out on a whim and was very happy we found it. It's off the beaten path a little but that only makes it that much cooler.", "author": "Reggie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-10", "description": "Went last night to Benders to see Greenhouse Effect and The Corruptors play. Great music, great bar. Bartenders are sexy and the place has an intimate feeling. Plenty of seating and an awesome pool table. Bathrooms are also very clean.\n\nCHECK OUT BENDERS! Pretty awesome place.", "author": "Laura E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-13", "description": "They only have burger for the free bbq on sundays 3-7 pm.  My cousins boyfriend cousins brought me a diet coke here and I gave a dollar tip.  I left early to go to work.  I think my cousin and her boyfriend were eating to many burgers that what my cousin said.  They didn't let them have any more.  They accept cash only.", "author": "John F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-23", "description": "A dark, cold bar named after a Junkie where the music is always loud, mediocre, or a little bit of both.  This place goes back and forth from being empty and depressing, to jam-packed and terrifying.  Everytime I go in here I realize that everybody really is getting laid except for me.  If you stick around long enough you will get hit on though.  Hope springs eternal.", "author": "Eggs M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-31", "description": "What richard w didn't mention was the awesome food and beautiful belly dancers!  What a great show!\n\nWe were sitting at the table next to his, and watched the barback try to cleanup the table while Richard w. Kept messing with the poor busy guy by pulling the glasses and napkins away while he was trying to work!  I thought they must have known each other, but I guess not... Here's a tip Richard w. Your drink was empty, not half full.  Shame on you for lying.  Since you are obviously old enough to be in a bar, how about letting the staff do their job instead of clinging to an empty glass and getting aggro!    \n\nThe barstaff (barbacks included!) have always been good to me, and with the music going on Saturday nights, I'll keep coming back for sure.", "author": "troy s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-23", "description": "yes, so, so great!  they have weird fish extention menu fried style!  fish and chips, seitan and chips fried pickle chips, curry ketchup, ohh so complimentary to beer and smokes out in the back patio.  \nthey also have a smoking closet that is fun to gossip in.  \nwill and kevin are the most entertaining and sexy bartenders i have ever encountered that side of the mission.  they did not kick my hubby and i out for doing simutaneous splits on their pool table.\nfun times.", "author": "yayoi s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-10", "description": "I went here to see the Kiss tribute band Destroyer and I thought this place was pretty cool until I tried to order a drink. The MOST unfriendly bar tending staff I've ever dealt with. Just about every person I was with on the night I went was ignored by or treated rudely by the surly bartender, and trust me, we are NOT out of place in a rock/metal bar. The staff was clearly interested in taking care of their friends and the scenesters with disregard to any other paying customer. Turned what would have been a good time in to an annoying time.  Benders, your attitude really sucks. Contempt for your patrons is not a good business model.", "author": "Kenny D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-06", "description": "Pint sized margaritas....a great Noise Pop Happy Hour....pool table....yes there is food if you are brave enough to try...cool art hangin around the place.  Not too loud, so chattin it up with your friends and spending hours on end is easy to do.  Bartenders are right on.  I could do without the stinky bike people with their little funny hats and super sized B-O.  I like places where I can see a band in a small place.  Although.....I can spend a lot of time waiting for a drink at the bar which gets annoying after a while, you'd think a gal could get a drink faster!", "author": "Q L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-25", "description": "Down and dirty... In an extremely good way. I love this place. So unpretentious and gritty-real. An instant local favorite for any laid back locals.", "author": "Jim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-01", "description": "This is THE place to begin a night out in the Mission. The outdoor smoking area is great, and the beer selection is awesome, mostly because they have Pliny the Elder on tap. One of the bartenders is totally foxy, too. But then they close the outdoor area and you hav to move to the inside smoking room, and then they terrible bands play too loudly, and the place gets filled with the douchiest kind of hipster. I love this bar until around 11:00 pm, then I knock a star off because I can never stay there the whole night.", "author": "Skyler C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-15", "description": "I like this place for many reasons, amongst them the food which is very tasty specially the gumbo, the burgers, fish and chips, and even the sushi on mondays isn't bad. Whiskey wednesdays gets you a shot of jameson and a pabst for 5$ and free burgers on sunday, good music, fun live shows(cookie mongloid, blood jello wrestling), good crowd, pool, awesome movies on the tv, douchebag free, good staff.", "author": "Julian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-21", "description": "delicious burgers, tater tots, beer, whiskey, and live music.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-14", "description": "I have been there just a couple of times, each time was a Sunday afternoon. Free BBQ Hamburgers! Of course a good tip to the cook. Don't take advantage and be a non tipping pig. Beer is cold and delicious. Great place to hang. Biker friendly both Cycle and Motor.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "Ah remember that band Helmet. As i walked in to meet up with some people for a meet for the first time i hear this bar blasting \"unsung\" by helmet. At that moment i knew this was gonna be good. The patrons seem to be more locals. I could tell because the locals were getting priority over me when ordering drinks but hey, they had good music on so i didnt care. Ordered a burger which was artery clogging heaven. The patty was probably an inch and a half thick and was cooked medium well the way i like it i wasnt too happy with their fries though, they were a bit on the salty amd soggy side. Overall Great bar food, great music, great mixture of people of all races.", "author": "Henry R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-22", "description": "deep fried pickles . . . amazing! although i recommend eating just one (I nearly ODed once)\n2 pool tables and easy going crowd.  Its a great bar to escape a lot of the bridge and tunnel crowd who infiltrate the Mission on Fri and Sat night.\nGood for groups.", "author": "Ashley P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-11", "description": "This place was sketchy in all the right ways, but only when it used to be called Sacrifice. No offense to Mr. Bender, but what a bad name for a bar.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-17", "description": "I should only review places that are closed, that would show everyone. Simran was really into Bender's for about a month. There are worse bars to be into. I can only think of the time we saw a black man sleeping in a room label \"Storage\". Is that appropriate?  Towards the end there was a new kitchen that served Thai food. Well, it's a shame it burned down.", "author": "Daniella C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-01-24", "description": "The new Thai Wagon food inside Bender's is a perfect fit.  Like your chefs high?  Like grease?  Like heavy metal on the jukebox?  You're stoked.", "author": "Melanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-09", "description": "Hands down the best bloody mary I've had in all of San Francisco. Actually in all of anywhere. Seriously. They make it with love and from scratch and it comes with pickled green beans, a beef jerky stick, and olives and onion! I've searched long and hard and have not found a better bloody mary. Five stars for the bloody!!", "author": "Jamie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-29", "description": "YAY!!!!! Benders is back and its gonna be trouble... hey na, hey na.. my Benders is back..   This is my neighborhood bar, I love the place and the people and I missed it while they had the year and a half hiatus to re-build.  The rebuild is complete and I am so happy to be able to get tore up and stumble home again (not that i couldn't before, just not from Benders)...  Well see you there.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-30", "description": "At the recomendation of a friend, I trotted down to Benders on a cold, rainy, Tuesday night. While most of the surrounding Mission was fairly dead, this place was surely not. Great rock music was pumping, drinks were flowing and patrons abound shared laughs and toasts. \nBender's has great pool tables, with bright felt that contrasts the balls well enough to aid even the drunkest of one-eyed-pirate-players.\nThere is a great pinball game and stand up arcade machine along with a small outdoor smoking room which was conveniently accessed from the middle of the bar. There is plenty of space to socialize and get cheap PBR's from personable bartenders who aren't to cool for school. These cats will even punch your PBR can with a bottle opener to allow for the beer to breathe and not foam up upon the first few sips (I never seem to suffer from such an issue, but the effort is appreciated nonetheless). Thanks Bender's, I've now found ANOTHER regular watering hole I will continue to patronize.", "author": "Jeffrey R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-21", "description": "It's our new go to bar. Friendly bar staff, good patrons, good music, perfect prices, awesome food (+1 for having some veggie options. Sadly, there's no longer sweet potato fries), and I can bring the dog with me. \n\nOh, and there's a back patio for the rare sunny days in SF (less rare these days though, go global warming!). Who needs to go to Zeit, when you've got Benders? \n\nSee you on Wed!\n\n*EDITED: to say- not that I don't like Zeit. I do. I like the back, I like the bartenders. I just don't like to wait in line to get into it. Also- Syd generally comes with me everywhere I can take him, and he's not welcome there. Boo. I get it, but boo nonetheless.", "author": "Jazmin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-05", "description": "I went back to Benders last Sunday evening with a gang of friends. Both of the bartenders (Dion? Kevin? I think those were their names) were super duper friendly and accommodating. More than made up for the bad experience we had last time. I'll be back!", "author": "Kandy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "Great beer selection, dog friendly, serves food from Weird Fish, plenty of room inside, what more could you ask for? Well, a larger outdoor area would be great, but still Bender's rocks!", "author": "Pete B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-11", "description": "Can't stop thinking of Futurama's Bender but that's another story (http://en.wikipedia.org/wiki/Image:Bender_%28Futurama%29.png). \nAnyhow...foodwise this place was very disappointing. The fried battered Tilapia had an horrible smell of mold and the fried pickles (yo-yos) were good but the batter totally came apart and they got uber-oil-soggy. But you know, they do lovely Jack Daniel's burgers and we got there late when the tiny kitchen was almost closing. So....yeah, I mean, it's not a restaurant. You get tanked and they feed you good anti-hangover food. \nEither it was my alcohol altered myself or not but the place reminds me of some movie...something like a Billy Idol videoclip.\nHighlights of the night:\n- hell yeah! http://www.youtube.com/watch?v=4bt_-R5LInU&feature=related\n- the burping girl....man, she had a loudspeaker in that tummy\n- can't get rid of the fried perfume it's on my jacket today though.....bummer!", "author": "Dario B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-04", "description": "What more could you want from a bar that has Anthrax on the juke?  I really like the look and vibe of this place.  My buddy and I went on a pretty dead night but I still enjoyed the time there and hopefully can check it out on a better night.  Parking lot right down the street if you can't find any on the side and plenty of other bars are within walking distance.", "author": "Joe E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-29", "description": "DO NOT EVER GO TO THIS HELL HOLE!!\n\nI was there recently and just watching the little nerd bald doorman get punked around by all the customers was just too pathetic. What a pussy. If anything would have gone down he would have been the first to run and hide. I cant respect a bar like this.", "author": "Diane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-15", "description": "I had forgotten how much I love this bar and have been recently reminded.  Great location, off the beaten paths of Valencia and Mission St but not too far out of the way.  A great friendly crew of bartenders, great drink prices, great room with a smoking patio, occasional live music and a great juke box.  What more do you want in a divey, neighborhood drinking establishment?  I'll tell you...a satellite kitchen from WEIRD FISH!  I had an amazing pulled pork sandwich the other night, my friend Jamin had the cuban pork sandwich special and we were both blown away.", "author": "annie s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-25", "description": "Is it weird that I like this bicycle bar slightly better than Zeitgeist? I sort of have to avoid the cycling elitists and hipsters here, but I enjoy the Vegan offerings with a fair share of beer. There's more open space with room noise toned down several decibels. So I can actually hear the punk rock and my friends!", "author": "Cathy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-29", "description": "i dont know what it is about dive bars but there's just something about them that is damn appealing. is it the seriously unpretentious atmosphere? is it that you feel like you can do whatever the hell you want and it's ok? is it that the more low-key a place is, the more it is conducive to drinking? who knows and who really cares... all i know is that it works.\n\nBender's had a similar atmosphere to Zeitgeist or Kilowatt. there were 2 pool tables, a pinball machine, and a jukebox filled with 99% heavy metal stuff. i tried to find something to play and could barely find anything i even recognized. i dunno if that's a good thing, but it definitely matched the place's atmosphere. they had Hoegaarden on tap, which as i've mentioned before, is definitely bonus points in my book. \n\nthe rest of the night was consumed by the titty game. you know, that game where they show two half-naked people on either side of the screen and you are supposed to find what's different about them. sheez... that game is so damn addictive. it's so damn basic, it never really changes, and yet for some reason it's practically impossible to drag yourself away. it just sucks the quarters right out of your pocket somehow.\n\neventually, we were able to drag ourselves out of the bar. we'll definitely be coming back. cool bar, cheap drinks, and it's a bit off to the side of the main Mission area which keeps it close to the action but a little secluded. plus, i totally love the name. really, what can be a more perfect name for a bar than Bender's?\n\n(my resolution this year is to visit 50 new bars in SF.  read about it at: http://fiftybars.thisisvlad.com   )", "author": "vlad k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-26", "description": "Pliny on tap for $5 receives 5 stars.  If they stop having Pliny it will be downgraded to 4 stars.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-21", "description": "This is my absolute favorite bar in S.F. by far! \n\nWhiskey Wednesdays are awesome! The food is great (especially if you're a vegetarian) and Sundays they have BBQ out back.\n\nAnd of course Chupa is a wonderful tender who she treats Syd oh so well (and the new girl... Jynx)!", "author": "Jeremiah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-30", "description": "I am so glad I found this place. It's like an extended living room. They have it all, great staff, awesome drinks, pool, megatouch, a patio, decent happy hour. It's clean and friendly. The regulars are even great. This will always be my first choice.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-25", "description": "The last time I visited San Francisco my wife's friend took us here and it was a lot of fun.  We also happened to go on Whiskey Wednesday.  1 Pabst + 1 Shot of Whisky=$5.  I keep hearing how expensive it is to eat/drink out in SF but we were there for 3 days and we ate out for just about every meal and spent just under $150.  Good luck trying to do that in Seattle or Portland.", "author": "Ezekiel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-23", "description": "I could totally ignore the bar and just enjoy the little Wierd Fish Satellite grill in the back. The food is fantastic.  The Cuban with slow roasted pork was the best sandwich I've had in ages.  I've never been disappointed (cept when they're not serving). Whomever decided a dive bar should have great, inexpensive food deserves a frickin' nobel prize.", "author": "John P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-11", "description": "We were the first ones there at 2 o'clock. The bartender unlocked the door wearing nothing but a black tee shirt, underwear and red lipstick. The bar quickly filled up. Bloody Mary's are $8, loaded with vodka, green beans, olives, pearl onions, lime and a giant stick of beef jerky. Sunday, free BBQ from 3-7. I spilled some of my Franziskaner on the table and noticed my white napkin turned black.", "author": "Andy E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-29", "description": "We came after dinner for some drinks and to hang out. We all crammed in around a booth in the back and just chatted for hours and watched the drunken pool game in the back. Interesting beer selection and very laid-back vibe.", "author": "Nutmegala A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-16", "description": "Not the cleanest bar I've been to by far, but it's close to where I live and my roommate really enjoys it, so I go there on occasion. Cash only is annoying and the service is okay. I do like the sushi night they have on Mondays though - decent sushi at really cheap prices. The back patio is a chill spot when the weather is nice out, even though it's rather small.", "author": "Janie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-28", "description": "Being able to snag a table at a dive bar on a Friday night is always a plus and although it was hot inside, there was plenty of open space to hang out it. Drinks were decently priced: $4 for a grapefruit and vodka. Music.....Was there music? I may have had too many $4 grapefruit and vodkas.", "author": "Kathy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-16", "description": "Very fun evening out with the international crowd of mystery. MMM....those dark and stormys were pretty damn tasty. They have a tendency to sneak up on you so be careful. I wasn't thrilled with the fries or tacos and I'm sorry the bathroom stalls separated by torn up shower curtains were pretty bad. All in all though a very fun time at bender's.", "author": "Hannah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-24", "description": "This IS my new local spot.  Feels like what Molotov's tries to be.  Whisky Wednesdays gets you a PBR and a shot of Jameson for $5.  They have two pool tables with room to shoot and a respect for \"pool table culture.\"  A great jukebox.  Supremely nice bartenders and a great local crowd.  The back patio is nice, too.  Oh, and did I mention they give out free BBQ every Sunday?!? Umm, ya.  We have ourselves a winner.", "author": "matt c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-04", "description": "two words... fried pickles.\n\nthat is enough for me, but the cheap drinks and killer jukebox doesn't hurt.\n\ngo there.", "author": "Dingo P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-09", "description": "I had a pretty wicked time the last time I came into this place.  Lots of dark nooks and crannies, secret back rooms where you can smoke, and a pretty cool crowd kicking it inside.", "author": "matthew w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-08", "description": "This is a good way to spend a low-key weeknight in a comfortable Mission-style dive (i.e., red and black deco, PBR, pool tables and a smoking area).   Relax at a booth listening to the DJs play metal of varying quality, catch the occasional jug band (?) or better yet, eat some experimental thai at Tai Wei's Wagon in the back.  His quirky take on Thai varies in tastiness, but is always interesting, and Tai Wei is a lot of fun to talk to.  I try to avoid this place on weekends, when the bands tend to be louder and of poorer quality, but overall a great spot.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-03", "description": "The photo booth. The burlesque shows. The strong drinks. Come back soon Benders!", "author": "Beth W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-15", "description": "I was here on a Saturday afternoon, 2 buck prbs with  the can top open too, excellent juke box, fucking excellent. Back patio could be a bit bigger but im not the city planner. ill deal. This place use to be a super dive that burned down a few years ago if memory serves me right, but fuckit, it looks super sweet now, its big, its not full of fashion hipsters, just serve the booze, a basket of fries, dollas for some quarters and keep the juke box going.", "author": "Joe J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-20", "description": "Hey, great bar down in the Mission.  It's on Van Ness, so it's a couple-block walk from the other stuff on Mission, but it's worth it.  Friendly bartenders, fast service, huge place with lots of seating and nooks to explore, and no claustrophobia.\n\nKitchen around the other side of the room, with a menu that looked both good and cheap, but I just don't understand people who eat while they drink.  Food just gets in the way!\n\nPabst is $2 a can - and the hottie bartender opens it for you and always punches a hole the backside for easy delivery.  Service.  Also saw that they've got a pretty wide selection of liquor, included a shelf of single-malt scotch - thought that was unusual for a dive bar.\n\nCame here on a Saturday night with music - $5 cover - and the joint was packed.  Standing room only.  100 people? Came again the next Saturday - no music, no cover - and it was pretty empty.  Finally filled up to a peak of about 25 people about 12:30.\n\nSome folks below mentioned the shower curtains in the bathroom.  I liked them, thought they were unique, but the curtains are gone and as of this weekend Bender's has full-on bathroom stalls.  Damn you people, for making them cave in to your demands!  \n\nFinally, please someone give Stephanie the hottie bartender all the shifts, money, praise, and booty she wants.  It's nice enough to find pleasant, quick, cheap service....but wearing those tiny tiny shirts is awesomely above and beyond.  There should be a statue or something.", "author": "Barry H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-20", "description": "Cool place and some good drinks.  Has changed since they rebuilt it but i am not sure that the people have changed at all.  There are still some that are pretty damn cool and fun, the pool tables are nice and the music is not bad but it does not seem like a welcome environment, a place i would want to hang out and be be comfortable doing so.", "author": "Tim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-26", "description": "$2.00 pbr can't be beat.  Indoor bike parking is a perk if it's available and Damon on the grill Sunday afternoon's is pretty nice as well.  The music is definitely acceptable.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-27", "description": "I live two blocks away, so I may be a bit biased, but I like giving Bender's my money. It's unfortunate that the bar lies on the wrong side of Mission St., as it doesn't benefit from much foot-traffic, but that's also a blessing. The crowd is as unpretentious as clams. Ample seating - I don't think I have ever had to stand. They generally have two pool tables running (unless they have live music; then they only have one going) and the tables are both in fine condition. They have some pinball if you are into that kind of thing, along with a photo booth that mildly offensive people take to making out in. The jukebox is skewed towards loud noisy punk, but it fits in with the overall vibe. I would say, however, that the jukebox is a weakness. They have been having DJs recently on Fridays, playing Delirium-style music. There is a free BBQ on Sunday - the quality of the food is definitely indicative of the fact that it's free, but then again, it is free. There has also been this guy cooking brats and what not for people late at night, but I don't know if he'll be a regular or not. He charges money, though. The backyard patio for smoking closes pretty early (9PM, I think) so don't get too excited about that. The bartenders are all friendly, and the drinks are cheap - $2 PBR & Tecate, and they have a $5 bike messenger special, which nets you a can of the aforementioned potabilities and a shot of whiskey. You might have to show a bike key to qualify for this, however, or else simply be charming enough to convince the bartender you are worthy of such a bargain. Overall, Bender's has huge potential due to its similarities to Zeitgeist & Kilowatt (no surprise, given the common ownership, I believe) and it's also been seeming increasingly popular with the kids lately.", "author": "Max H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-11", "description": "Still hosting  the same SF posers who think they are cool and the skanks who service them. Worth checking out if you wanna good laugh.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-22", "description": "Solid. A variety of beer, good fish tacos, good dive bar overall.", "author": "Max D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-05", "description": "nothing like getting drunk in a bar full of dudes who look like they could kill me with one swift blow to the solar plexis. go benders!", "author": "Jane P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-05", "description": "the bar is super cool...me and my friends went in for some food the other day and ofcourse drinks...well the grill was busy and the unhappy person cooking rudely told us it was going to be atleast an hour before we got food and he wasnt taking anymore orders for 25 min.  well if the food is that good then we'll wait...it had been awhile since we've been there for food and thought we could still get fried pickles and fish n chips...he barked at us saying \"no,look at the menu\"\nsoo needless to say we finished our beer and left....we'll be back for beers forsure but hopefully they will get that dude help or maybe a raise might make him happier to customers...dunno....", "author": "SASHA B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-25", "description": "I give this place 4 stars for being Benders, but 2 stars for being Benders on the night they hosts Burlesque simply because this is a bar, not a venue.  See... venues have seating and room and places to like, BE and breath and drink.  Bars, when trying to be a venue are very very very crowded with no place to sit, or for that matter stand, breath, drink, etc.  Since burlesque only happens once a month, and even if you are unfortunate enough to go there on that night, there are burlesque performers hanging around in their pasties, I bumped it back up to 4 stars.  Benders is good at being a hip dive bar with really strong drinks.  There's a tiny back patio with an occasional free BBQ where burgers are handed out in order of attractiveness of the burger eater according to the burger maker.  We refer to it as Zeitgeist Jr except on the days when we are feeling less charitable, then we call it Zeitgeist Wannabe.", "author": "Cosmolicious L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-08", "description": "Great place to go after climbing at Mission Cliffs! Cheap drinks, good vibe, and the kitchen is great!", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-04", "description": "o man, this is the first dive bar i ever walked into so at first i was alittle nervous for my life. then after a few beers things were fine. pool in the back was fun and the people you play against are cool except for the ones that are really serious and suck! haha. jk.  definitely a great place to hang out. yay! i'm a fan! cheers!", "author": "mike c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-24", "description": "fun bar. nice bartenders. very spacious", "author": "Steve C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-02", "description": "OK, I also went to Benders on the same night that Destroyer played along with a burlesque show, and I really only went to see my girl Rosa spin her nipples around and dance while scantily clad in front of the band, and let me tell you it was SOOOO AWESOME!!! Anyway, there was this lovely bartender lady who I can't remember her name, and I'M SORRY for that!!!  But she remembered me, and I remembered her, as we had a mutual friend TEDD who is no longer with us, and that's really weird, because I also know Rosa the dancer through Tedd too, so anyway, enough with the weird connections.  I totally loved this bar, and even more so because the door boy was so WASTED that he let us in for less than the price of the cover, since I was short on cash.  End of the story is I love Benders, I love Rosa, and I love the lovely bartender who remains nameless, but I never forget a face.  She used to work at the place next to Holy Cow on Folsom that has changed names many times over too, Ace Cafe?? Someon help me out here if you know her name, cuz I was a little drunky poo.... but I will be back!  Oh yeah, who ever heard of 2 Gene Simmons dudes on stage at the same time?  That was a real treat.", "author": "Barbra K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-18", "description": "stiff drinks that are served out quickly.  burgers, fries, and the likes of fried bar food to keep your stomach coated as you throw back your drinks.  there are many games to keep you entertained.  nice patio for fresh air, or smoke induced air.  definitely cyclist friendly.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-12", "description": "get bent at benders. the bar of your wet dreams, you pansies", "author": "Brewbacca W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-30", "description": "\"We serve good food at popular prices\"\n\nhttp://flickr.com/photos/jozecuervo/166057332/", "author": "Firstname L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-06", "description": "This gets all five stars and then some! Dog friendly! Incredibly nice, attentive barstaff! Free barbecue out back! Great, casual, happy atmosphere. The Bloody Marys come garnished with the works-- including jerky!", "author": "Geae D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-17", "description": "this bar is dark, the jukebox is loud, and the beer is cold.  they have a backyard area for smoking, something rare in SF, and 2 pool tables, some pinball, and deep red booths for those kissy types who like that sort of PDA.  i've wandered in and seen some killer shows (mother truckers) and they have free BBQ on sundays (i think).  foxy chics, fun times.", "author": "church B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-10", "description": "free burgers on sundays is always a good thing (with all the fixins to boot!).", "author": "Kerry L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-22", "description": "this bar feels like a time warp to the early nineties west coast hip scene. and somebody played  'san francisco' by scott mckenzie, yikes!  but the staff is really nice and the add a hole in the top of the beer can, real old school.", "author": "Markus B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-07", "description": "Big tasty burgers and beer,  hipster biker environment was so-so. I really liked the fairly large portion size and must try the catfish- hot wing style.", "author": "Brad Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-19", "description": "I love this bar!  Great crowd, awesome bartenders who are nice to everyone, great burgers, and dare I say no hipsters and thankfully it has not been discovered by people from that unmentionable neighborhood by the water...  I have never had a bad time here, and have also had the pleasure of hearing some very decent unknown punk bands, extra bonus!", "author": "Kate M."}
