{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Just finished half of my lunch from Bini's and of course, had to tell my fellow SF yelpers all about it! We got an order of lamb momos and the gurkha chicken combo (which comes with 4 pieces of Turkey momos). Everything was really flavorful, fresh and piping hot. \n\nThe combo portion was huge. Absolutely worth paying $12 for it - you can split it in to 2 lunches. An order of momos is more than enough for lunch as well. They also have vegetarian options (veg momos and kwati combo). Don't forget the mango lassi - yummy!", "author": "Nikita G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-02", "description": "My go-to spot when I'm craving for some dumplings/momos! For under $10, you can get 8 delicious dumplings with yummy sauce. Their veggie dumplings and their turkey ones go for $7 plus tax, and the lamb ones are an additional $2. I tried an order of their veggie ones, and enjoyed it so much. The texture of the dumpling skin was perfect, and they didn't skimp out on the filling. I lucked out because there wasn't much of a line when I went (1:30PM or so), but have seen long lines around noon. The sauce they put on the momos is great too. Some people might find it spicy if they are very sensitive to spice, but personally, I wished there was a bit more of a kick to it, or that they put some of that sauce on the side because sometimes it isn't enough. \n\nI tried the chicken curry combo the next time I went here. That was in the same size box as the 8 veggie momos. The box was filled with rice, 4 turkey momos, and the curry chicken. The chicken itself wasn't too try. It was more of the shredded chicken type, with some big chunks here and there. I wished there was more curry sauce though, as I was left with mostly un-sauced rice at the end. The turkey momos were good too, but I prefer the veggie ones. \n\nI went back a third time to get the veggie momos, as I felt that was better money spent ($7 compared to $12 for the combo) and I liked the momos more than the rice. They were quick, but I did enjoy the momos the first time I had them. This time, I felt that it was right after the huge lunch rush, so they were a little bit underdone, but still good nonetheless.", "author": "Rita W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-31", "description": "Decent portion sizes and prices for downtown San Francisco. I've only tried the Momos here, but I've heard the combo and burrito are pretty good.\n\nThe Turkey Momo that I had were fairly dry, but flavorful. I wish they gave more of that orange sauce, because that was what really stood out to me. If I could get the momos swimming in the sauce, then I'd be eating here every week.\n\nWould recommend trying out if you work or live in the area!", "author": "Kedar V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-15", "description": "Really good momo's ans chicken curry!  The lamb momos were a tad gamey (I'm very gamey sensitive) but the chicken ones were really good.  If you like chicken curry, they make really good chicken curry as well.\n\nVery quick, fast, cheap, and good! Very convenient if you're around the area!", "author": "Jang N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "The Lamb Momos are where it's at. \n\nWe tried Bini's Kitchen at the Presidio Picnic at got the Chicken Curry + Lamb Momos Combo ($14 + $2 for the lamb upgrade). They're generous in their portions -- filling for two people! \n\nThey've got a great story that you can read on their storefront as well to learn more about how they got started.", "author": "Patty B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "In San Francisco for work and some coworkers recommended that I check out this food stand. I love street food so I was very excited to try this place. I've never had Nepalese food before and it was delicious!!! I got the lamb momos. It's basically the Nepalese dumpling. The lamb was juicy on the inside and they topped it off with some sauce that gave it more flavor. Definitely recommend hitting up this place if you want something quick!", "author": "Nancy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "I always get the chicken combo when I come here. The food is really good and the portion feels good. The chicken is super juicy and the rice is really good with the sauce. They leave the bay leaves in the rice when they serve it though, so do be a little careful of that. The momos are really tasty and I love their momo sauce. It seems less spicy than momo sauce I've had elsewhere and I love it more. \n\nThe price is a little on the steep side though (13 dollars after tax), so that does run on the high side for lunch. Also, the line seems to vary a lot and is pretty hard to predict. I usually go at the same time and I've had anywhere from no wait to 30 minutes.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "SUCH a good option in downtown SF, near the Montgomery BART station! I dropped by around 11:30 am on a weekday and was met with a very short line that moved quite quickly. I ordered the vegetarian momos (8 pieces, but they actually gave me a few extra) and the vegetarian kwati! First off, I did not expect the portions to be so big and so filling!! The kwati was super delicious and filled with so many different lentils and beans that I actually felt like \"hey, I'm eating some good protein!\". I really recommend the kwati if you like some flavorful lentil-like soup that's super hearty. The momo's themselves came with the orange red sauce on top and o m g they were so good. I had to pace myself so I didn't inhale all of them at once like kirby. Now the set is good if you want a decent portion of momos, kwati, and rice, but I'm not a giant fan of the rice and decided to just order the soup and the dumplings separately. Frankly, I was unable to finish all the food at once and had a few momos saved for later.\n\nThere isn't much seating near this place, but it's perfect for when you want to grab something to go. There are a plethora of benches and other areas in FiDi where you can plop down and eat so it's a great option on a sunny day. Definitely check this place out if you want delicious food that will keep your tummy full and your soul happy.", "author": "Lakshmi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Wow. A quaint Nepalese place right on market where they take to-go orders only. Simple menu and I had the lamb dumplings and chicken combo. I love dumplings, and I loved these dumplings. It's a hearty meal that doesn't leave you feeling bleh. I can't remember there being veges either. Sometimes there's no time for veges. \n\nCan't believe I haven't discovered it for the past year of working downtown. It's attached to a building and right next to McKesson. Highly recommended. It will now be a part of my lunch circulation.", "author": "Young Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "I ordered 2 vegetable dumplings, 2 turkey, & 4 lamb. Very delicious & filling, but I'd say the vegetable ones were probably my favorite which was surprising because I'm usually a carnivore. Ordered & got my food within 45 seconds, perfect spot for a quick work lunch. I definitely will be going back", "author": "LeVar H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "Great lunch take-out option in FiDi! The stand/booth is kind of behind the McKesson building on Market, definitely had to look for it. I came early (11:15) so no line. The menu is simple and straightforward, reasonably priced for FiDi. I tried the chicken combo and the food was still piping hot when I got back to my office up on Clay. Overall, the food was tasty and filling. The dough for the turkey momos were a little dry, and the filling quite bland. But that sauce over the momos were super delicious! I wouldn't have known that the filling were under-seasoned if I didn't randomly take a bite of the inside on its own. The rice was also on the dry side for my personal preference, but with the chicken and the sauce it was fine. If you are tired of sandos and salads for lunch, here is an awesome option!", "author": "Nana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "Order good lunch spot. It's pretty filling too and the sauce goes well with the rice. Momos are decent. They pack it really well in foil so it remains warm.", "author": "Arjan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "The combo is delicious and they prepare everything super fast which is perfect during the hectic lunch hour. The chicken is tender and the sauce is absolutely the best. Only reason I gave it 4 stars is that I became quite dehydrated after devouring the whole meal.. which is usually a symptom I get after consuming msg. However, that def won't stop me from returning!", "author": "Zizi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "Tried gorkha Chicken and momos combo and must say it was really good especially the momos. The line was short and the service was fast.", "author": "Sharad B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "These smell soooo delicious when the person handed me my orders. Sadly they dont have bags, only take out containers. If you plan to buy a lot, bring a bag.\n\nI read that the momo tastes very good, so I decided to order two orders of vegetarian momo and three orders of turkey momo to bring to work and share with my coworkers (one order of turkey for myself of course.) \n\nIt smell so good in the box that I had a irresistible urge to try it while I was on the bus but I did not haha. By the time I got to my workplace, I had to try it. I would have thought that I would like the turkey momo but I found that I like the vegetarian moms more. \n\nGlad I decide to come here and check this place out, definitely will be coming here more often for those delicious momo or try their other options. Note: the turkey momo and the vegetarian momo are $7. They take cash or card.", "author": "Jen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "From the outside, Bini's doesn't look like much. It's essentially a brightly painted trailer placed in an odd corner of a line of retail stores somewhere off of Market St. \n\nDon't let appearances fool you. This place is wonderful! The staff is friendly and jovial, and there's plenty of outside seating available. For those new to Nepali food, the simple and straightforward menu will put 'em right at ease! \n\nThe food is traditional Nepali fare. Spiced, flavorful, and filling! My boyfriend (a Nepali-American) and I both got the vegetarian combo plate for 10 dollars. The combo features four veggie momo (dumplings), rice pulau, and a vegan bean chili. The momo featured a yummy tomato-based sauce and the chili included at least three different types of beans. The portion was huge! Definitely a great deal. For a big, yet quick and healthy meal- look no further.", "author": "Kendall G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "Got the veggie MoMos with a mango lassi drink. Nice and fast service and reasonable prices. Delicious snack or small meal. There's no seating so have a place in mind to go after picking up your food!", "author": "Sheridan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Good portions, fast, and definitely delicious! \nI think the prices went about ~$1 for the dumplings but still worth! It's a great way to go down and grab a quick lunch from my office and I always feel full after consuming 8 dumplings. \n\nI definitely recommend the turkey over the lamb dumplings. The combination with the tomato-cilantro sauce is divine! I've also tried the Mango Lassi and it has a stronger coriander flavor the most. \n\nLastly, they also have vegetarian variations so give it a shot!", "author": "Maggie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-03", "description": "I'm a huge fan of Nepalese cuisine. Bini's Kitchen is great for a quickie and top notch for food truck quality, but I think it could be better. I thought its MoMo's were too dry for my taste. But the Chicken with Momos combo was definitely a steal and more than enough food for me :)\n\n-- \ntaste / 3\naesthetics / 3\nvibe / 3\nservice / 3\nprice for quality / 3\nOVERALL / 3", "author": "Rachel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "I love Bini's Kitchen! I eat here at least three times a week. I get the veggie combo and add extra momo, and this meal is often the highlight of my day. The folks who work here are wonderful and friendly - Bini's is the best!", "author": "Julie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-15", "description": "Bini's is a classic on my lunches in SOMA. Or is it technically FiDi? Well anyways it's right on Market near Montgomery street. I've had the burritos, plus the chicken + MoMo combo. Fan of both, but I think I'll be going with the combo in the future. Big fan of the MoMo the few times I've had it, and might try getting them by itself next time.\n\nBini's looks like (or I guess is) a food truck from the outside, on the side of a building. You order at the window on the left, and then wait for them to call out your order on the right. Try not to walk too far away from the window though, as it can get pretty loud on Market during the day! \n\nHaven't gotten any of their drinks, but I know my coworkers have and enjoyed them.", "author": "Rajeev S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "My 5 stars is strictly for their Turkey Momos. Seriously the BEST MOMOS I've ever had. I first had these amazing dumplings at Outside Lands, & have found NOTHING BETTER in the city.\n\nTheir Lamb Momos are a little gamey for me, but still good, especially if you like lamb.\n\nAlso had their Gorkha Chicken + Momo combo which comes with rice. Not bad, but not a huge fan of their Gorkha Chicken because it's a little bland for my taste.\n\nOverall, quick service & amazing turkey momos!", "author": "Carol N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-09", "description": "Solid takeout lunch place with great vegetarian options!\n\nEnded up here with a couple of folks to grab food to go. It's right by the Montgomery Bart station. It's not a food truck but close - you might just miss seeing the place if you walk by. The lines are short, service is quick and food is yumm.\n\nI got the Vegetarian combo - it's 4 dumplings with tomato sauce, a portion of flavored rice and a kind of gravy with it. All of them were terrific! The sauce was a bit sober/bland and could use some reinforcement.\n\nAll in all, super happy about it and would def go again!", "author": "Vignesh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "One of the reasons I go into the office (and not work from home), is for Turkey Momos. I am a dumpling fanatic so I might be a little bias. $6 for 8 dumplings is a steal in the heart of downtown. They are located next to the Montgomery Bart Station, next to where all those bikers sit and hang out. Having tried Dumpling Time (roll my eyes), this place is sooooooo (how many o's until you get the point!!) much better. I removed one star just because they dont have a lot of variety, BUT what they do have is amazeballs.\n\nI first tried Bini's Kitchen at Outside Lands last year and have been a fan ever since. I really think they are a hidden gem of the city. Go now!", "author": "Cicely T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "I got the Gorkha Chicken + MoMo ($10) and it made me really full. The service was really fast and the portion size was decent. I asked for the cilantro sauce on the side because I am not a big fan of spicy food. The sauce wasn't too spicy anyways.\n\nThe chicken was not dry and there was a lot of meat/rice. The MoMo was ok. It tasted a little bit plain to me. The dumpling skin was thick and chewy. I was glad that the overall meal was not too salty.\n\nI asked if we could have water and the employees told us that they only sell water bottles. I don't know if food stands typically give out water cups anyways. \n\nThere were not a lot of seats in the area unless you like to sit on pigeon poop. \n\nI'll probably come back to try their vegetarian dish.", "author": "Kristina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "One of my favorite spots! Its a permanent food cart with nice service and some of the best food all for well under $10. I had the combo platter being a big fan of both curries and dumplings. If you havnt had Himalayan before think chinese and indian influences. \n\nEverything was jam packed with flavorful spices that complimented each other perfectly while not being hot spicy more mild/medium. The chicken ghurka curry over yellow rice was an amazing orange curry with huge chucks of chicken so tender I could easily cut them with my plastic spoon. It came with 4 large momo dumplings a specialty of theirs. I opted for standard turkey over paying the lamb upgrade.  They were great and filling especially topped with the curry. Super savory and flavorful for super cheap you cant go wrong here.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-21", "description": "What an hidden gem for lunch in the fidi right at Montgomery BART. More like a little Nepalese food shack, this spot is quick, cheap and delicious. No seating, so take out only. \n\nThey do momos real well. Looks like turkey and veggie are the staples with the third option varying. We ended up with bison and they were delicious and super filling. I was stuffed after 4! A nice amount of flavorful bison filled these doughy dumplings and accompanied by a light chutney sauce. \n\nThe also offer up curry chicken rice and wraps. I went with the wrap and for $8 it's a ton of food! The chicken was plentiful and well prepared, although not a ton of flavor. This dish definitely needed a little something - an extra sauce or some fresh veggies for a little kick. I noticed that on the menu there was mention of pico and hot sauce, which I don't recollect, so I'd make sure to ask for extra. I added some sriracha and although it didn't quite go with the flavors, it added that extra oomph the wrap needed.\n\nThis is a great option for lunch if you're on the the go and needing a quick fix!", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "This review is long overdue. I work nearby and eat here once a week. The gorkha chicken combo with momos (2 Turkey, 2 Veggie) is a great intro and you can go from there. I am addicted!", "author": "Karthik R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-10", "description": "Gorkha Chicken combo so nice\nbalanced mixture of meat and rice\ncurry not too bland, not too spice\nhad this meal a bit more than twice\n\ncomes with Turkey MoMo so yummy\nadd a mango lassi if it's sunny\njust enough food to satisfy the tummy\nbut for downtown SF level of money\n\nall in all a good place to dine\nweekday lunch not too bad of a line\norders are quick and service is fine\nhope you liked this poem, the pleasure was all mine", "author": "Posu Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "Not sure how I haven't reviewed this place yet! Bini's Kitchen is one of the better fast lunch options in FiDi. It's not a sit-down place, but rather a small food stand that appears to be permanently attached to another building on Market St.\n\nYou can order Momos (Nepalese dumplings, $6 for 8 dumplings) or a Chicken Curry/Momo combo ($10) for a little more food (and fewer Momos). I'm a huge fan of the Momos, and often contemplate buying and eating two orders (but then realize that would be ridiculous). If you haven't had a Momo before, it's a bit like a Chinese style soup dumpling but without soup and with more meat, and with more of a spiced flavoring.\n\nSince there isn't seating, you should plan to grab and go. Pro-tip: Crocker Galleria has a nice rooftop nearby if you want to eat outside without eating on the steps on Market St.\n\nTry it out and you'll find yourself in the mood for Momos all the time!", "author": "Brittany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "Really friendly, conveniently located pop-up restaurant. Affordable option too if you consider the competition and also the hearty portion of food you get in any order. \n\nMy favorite is the chicken curry and momo combo. It's really flavorful, mild spicy (heat), and filling. I've seen the workers interacting with others while waiting for my order to be filled and they are consistently pleasant and offer advice/suggestions when asked. Love it!", "author": "Anna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-19", "description": "Finally tried out this small stand by my office. I got the Turkey momo and it's delicious! Perfect for lunch. I got my order within five minutes and the price is so appealing ($6 for 8) compared to other lunch spots in the area.", "author": "Rebecca T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "The chai, the chai, the chai. Best chai in the downtown area, hands down. It's creamy, slightly sweet and suitably caffeinated. The perfect pick me up. I bring my friends and colleagues here as often as possible!\n\nTip: it runs out by 1pm. Aim for a 10am to 12:30pm arrival for guaranteed chai success.", "author": "Sunil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "TLDR - techbro paradise\n\nThis place is reliable, cheap, and tasty. Sick location right near all of the biggest tech companies. So all of you tech bros can easily come here to grab a quick set of dumplings to go!\n\nThe dumplings are very clean and can be eaten with a fork without any struggle. This means that engineers will experience a minimal lapse in efficiency during lunch as they can easily eat while writing code! \n\nPortions are good sized (especially for the price), and leave you satisfied but not overly full. This is perfect for the modern day engineer who has an assortment of snacks available at the office at any moment - it allows you to portion control with the 2 or 3 bottles of LA crouix and bags of chips each day. \n\nAlso, the tomato chutney is bomb.org so see if you can get extra", "author": "Samraaj B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "Ordered the Gorkha Chicken and MoMo Combo. It was $10 for a plate and I think one is big enough for two to share. It comes with a scoop of rice, chicken curry, and 4 momo's of your choice. \nI took one star off because you really can't eat around there. It smells like urine surrounding the area.", "author": "Jane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "I have literally fallen in love with this place. I love their dumplings (MoMos), period. You can choose to go full-momos and get 8 by only $6 or, if you're feeling hungry, get the Gorkha Chicken with Momos combo, and you won't be disappointed. Curry rice, chicken, and turkey momos is the perfect lunch in my opinion.\n\nIt's in a very convenient position close to Montgomery Post, although it doesn't offer seating or tables, it doesn't have much wait and you can pick the food, go back in the office and eat with your colleagues.", "author": "Giulio C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "- Chicken curry with rice is good, not much different from Indian curries.\n- Turkey momos didn't have much flavor on their own, definitely have to dip them in the curry.", "author": "Chinh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "Great dumplings... I've only had their Momos, but they certainly keep me coming back for mo'... okay... \nSo this place is a a good quick option in SF Fidi, located right on Market at a little stall tucked away on a corner, so don't miss it. There are no big tables to sit on but you can take a quick seat at a nearby public gathering area, or check out some of the public lobbies/gardens available  close by on Mission St.", "author": "Dee D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "Pretty fast and quick meal.\n\nI got the chicken and momo combo to try a few things\n\nThe momos are well cooked not too watery and benefit from the spiciness of the paired sauce, the chicken has a sort of sweetness to it that made me wish it was curry as it's hard to eat a lot of it over the included yellow rice.\n\nOverall pretty good and a unique flavor for the area", "author": "Robin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "A lesser-known gem of a place, best Nepalese lunch cart in Fidi. I am a dumpling fan, I am sold! \n\n- They have veg momos too. Great for my veg friends.\n- For momos, you can opt for veg/chicken/lamb. My favourite is the lamb momos, which is priced $3 higher.\n- Must Have: Gorkha Chicken + MoMo combo. It's served with a big dollop of curry chicken, and 4 momos served over a bed of rice. \n\n- Only dumplings plate is priced at $6 for 8 dumplings.\n- The portion served is big and very filling.\n- No line during lunch and very fast  service.", "author": "Payal B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "I have tried food from their outlet as well as their catered food. Their stall on Market is decent and good for quick pick up. It is not a sit down restaurant but their service was good. Their dumplings were really yummy. The rice and curries packed good flavor without being excessively spicy.   The tomato cilantro sauce was especially delicious and paired well with dumplings. I have seen people fond of Indian and Chinese cuisine, enjoy their style of preparation too.", "author": "Tejashree M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "I work in the financial district and always wanted to try this place. I wanted something spicy with protein so I ordered the Rice and chicken Gurkha with turkey Momo.  \nAs a personal choice the Rice with Gurkha Chicken was alright. Nothing out of the extraordinary. If you had Indian cuisine you will be able to relate. Though the momos were just amazing. Those dumplings are really good. Specially with the orange sauce they put in the top.\n\nWhat I will suggest is Momos here is a speciality, other food can't vouch for it.", "author": "Urvish -."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "I've never had Himalayan/Nepalese food before. The MoMo's looked pretty delicious from the pictures so on a whim we decided to head over to Bini's Kitchen for lunch. There was no line at all which is a bonus point. They are a permanent food stand/shack near the corner of Post and Market.\n\nI ordered the combo Chicken Gurkha and lamb momo's. The service is quick as the food is ready to be served. These momo's look like dumplings and are stuffed with plenty of lamb. The chicken had a little spicy kick to it and the rice was good too. It seemed like a hybrid of Chinese and Indian cuisines. The chunks of chicken are huge and perfect if you're really hungry. The momo's are covered with a spicy tomato cilantro sauce. From reading the other reviews, it looks like this place has one of the most authentic dumplings. I would avoid the Nepalito though. It's pretty much a Chicken Gurkha wrapped in a steamed wheat tortilla.\n\nThey take credit cards which is always a plus.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Really nice lunch spot on the weekdays. Small stall off of market. I usually get their combo. They are known for their momos but I like their curry too. Usually a line during peak lunch hours but it moves fast, usually takes 10-15 mins from getting in line to getting the food. Tried the chai once and it was really good but small size for the price.", "author": "Jenny J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-12", "description": "I tried The Bini's Kitchen for lunch a couple of days ago. It is located at Market & Montgomery on the side of the McKesson Plaza. At the peak lunch hour there was no line and I could just walk over and order. Bini's is a Nepalese themed food stalled with a simple menu consisting of momos (Nepalese dumplings) with different protein filling, Nepalese chicken curry with rice and combos of momos and chicken curry with rice. I decided to get the mono and chicken curry with rice combo ($10). A couple of minutes after ordering I was on my way.\n\nThe food that I got seemed to be hurriedly and haphazardly packaged. The momos were hard like they had been steamed earlier and then left to sit under a lamp. Two of the momos were submerged in the chicken curry making them soggy. They had flavor just did not seem fresh. The rice was a major letdown. The chicken curry was the star of the dish it was really flavorful. Unfortunately even it could not save the rice which was hard and chewy.\n\nPrice wise it was in line with what you would pay for lunch at other similar locations in FiDi. Overall I would have loved to have this meal in a proper sit down place with steaming hot momos and properly cooked rice. Unfortunately I was not too happy with my take out meal. I feel they definitely have potential but are not living up to it.", "author": "Ahmad J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "I'm in love with the momo (get the reference?). Haha Bini's is a small food stall close to Montgomery Bart Station. There was no line when I went a little before 12pm. I got the Chicken Curry and Momo Combo $10 and 8 Turkey Momos $6. Food prep was quick. Remember to get EXTRA SAUCE. Trust me, you'll want more sauce.\n\nMomo's are like Nepalese version of Xiao Long Bao but with no soup inside. It was a very interesting and yummy experience. The curry combo was pretty neat too. Though I didn't appreciate the giant cinnamon stick that I found in my rice but hey, at least i know it's fresh ingredients. The chicken was a little dry but still tasted pretty good with the curry.\n\nCome give them a try. It's definitely something different.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "I've been meaning to check this place out for months.\n\nToday I decided to forego the usual sandwich and salad lunch spots and expand our taste bud horizons. We strolled over to Bini's Kitchen for some Nepalese cuisine. Located at Post Plaza (adjacent to Market St. and New Montgomery), this fast-casual restaurant is no bigger than a food truck. Blink and you might miss it. There's never a long line or wait for the food, and the staff here always serves you food with a smile.\n\nI highly recommend the momo dumplings. There are 3 different choices of fillings (Bison, Turkey, and Vegetarian). There are 6 momos to an order (which are more than enough to satisfy your appetite) and they're topped with a mild tomato cilantro sauce. I went with the bison momos and they totally hit the spot. I also ordered the Nepalito burrito ($8), which is essentially a Nepalese version of a burrito made with cumin-scented rice and Gurkha chicken and wrapped in roti. Be warned: this burrito is the size of a football. While I enjoyed my Nepalito, I was already stuffed after my momo six-pack. Also, I felt like the Nepalito could've used a little more curry spice or some sort of chutney to kick up the flavor. It just felt a little dry for my taste. \n\nMy total bill for lunch was just $16 + tax/tip. Bini's definitely falls into the Cheap Eats category. All in all, this lunch is a delicious change of pace, and I look forward to coming back soon and exploring more of their menu.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "My coworkers rave about this place and I finally gave in and decided to try it. It is this shack behind the Bart station. It is good. I got the turkey dumplings. Very flavorful and the spicy sauce that comes with it is wonderful. You get 8 pieces and it is very affordable for the area. Under $9. Next time will try it with the rice.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-01", "description": "The momos here are delicious! And a reasonable price for this part of town. They are a small storefront tucked into the corner of the plaza, no seating or anything but good for a quick lunch. The food turnaround time is VERY fast.\n\nI've gotten both turkey and lamb momos here and loved both. The chicken gorkha combo was just OK. Chicken was a bit dry, and the curry is a bit plain. Note that the curry pictures might look more like Indian curry (e.g. chicken tikka masala) but this is Nepalese curry and the flavor is not as strong!! Not spicy either. Wouldn't order again, next time I'll stick to the momos and the lassi :)", "author": "Adela C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-26", "description": "I think this place is just average. While service was fast and efficient, the food left a lot to be desired. The veggie momos lacked flavor and without the sauce (which was tasty), it would be rather bland. The rice and soup were just okay and a little one-note. I don't really get the hype. It's not bad but not something to write home about either.\n\nThey do get points for being conveniently located and having healthy veggie options though. Overall, it's not a must-try for me.", "author": "Joan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Bini's is a fresh find for me in the city, especially when I'm cramped for a quick but DELICIOUS lunch.  The first time I had momos (AKA Nepalese dumplings), I was in Kolkata, India, where it borders Nepal.  YUM-MY, I was so satisfied with that meal, and I'm so happy to say that I've located an authentic place in the Bay Area to cater to my momo needs.\n\nI tried the lamb momos (although it seems that this one, turkey, and vegetarian are all very good), and oh man, this is probably one of my top 10 lunches in SF so far.  And, to top it all off, the prices here are so reasonably priced, I really don't mind supporting a local business as legit as this one.  Momos were $8 for 8, but they are pretty large!  They also come with a super delicious tomato cilantro spicy sauce, but it really isn't too spicy.  They also have a combo with Gurkha chicken, rice, and some momos that is currently priced at $12!  Legit, I'm telling you, legit.\n\nSince eating momos for lunch last week, I've seriously thought about them a lot more... they are seriously mesmerizing and a great way to introduce some ethnic food into your diet.  Sorry SF salads, you have to make room for this amazing eat!\n\nI'll be back Bini's!  And most likely sometime soon... :)", "author": "Jana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-29", "description": "I AM OBSESSED WITH THE MOMOS HERE !!! Conveniently located, small but great menu and delicious healthy wholesome food - what else does one really need ?! My only feedback - maybe stay open on the weekends so i can take people from out of town here :) :) \n\nMy favorite are the Turkey momos, but the chicken curry and momos combo looks good on a SUPER HUnGRY day !!! gonna keep coming back for sure :)", "author": "Nivedita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "Thanks to Eater SF's article \"Essential Cheap Eats in San Francisco\", I have now been introduced to the wonderful world of Nepalese food. For those who have no recollection of world geography from high school years, like me, Nepal is a country located between China and India - two countries with equally amazing cuisines. And this did not disappoint.\n\nFor a total of $10.88, you can get a combo of Gurkha Chicken + Momo. Gurkha Chicken is boneless chicken marinated in yoghurt, fresh ginger, garlic, homemade spices, and butter - yum. Momo is the dumplings that you're seeing in almost every picture. You get half a box of the chicken with the sauce, 4 Turkey Momos, and a good helping of rice. The lady was nice (and they were probably closing soon) and she gave me an extra Veggie Momo.\n\nThe Momo might look like XLB, but they're much harder - but still good, especially with the tomato-cilantro sauce. It says it's supposed to be spicy but it wasn't at all. The chicken was also delicious - very tender, tons of sauce. Try not to eat the rice by itself - it's bland, so mix it with the sauce from the chicken.\n\nIn general, I loved it. It's just unfortunate that I can't actually sit down and eat this. I had to walk the food down the street back to the office in the cold San Franciso weather so the food was barely warm when I got to eat it. And because it's somewhat wrapped in foil, I can't stick it in the microwave...", "author": "Athena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "I don't know how it is that I've walked this earth for as long as I have without ever having a Momo but I'm into it. For $6 I got to enjoy 8 of these turkey-stuffed delights while supporting a woman-owned business on International Women's Day. \n\nNote: this is a food stand above Montgomery Bart so be prepared to sit on the steps in the sun or take food back to your office.\n\nThere was quite a line to order which moved fast although the wait for food was pretty long. This may have been due to all the other woman-owned-business-supporters who came out that day, so perhaps atypical.\n\nGlad to have found a place that vegetarians and meat-eaters alike can enjoy, Momos can be ordered with lamb, turkey or tofu! My coworkers enjoyed both the meat and veggie dishes and the Mango Lassi was a favorite. FYI the sauce is a tad on the spicy side. I'm not a fan of spicy things but I found it pretty flavorful and enjoyed it.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "Amazing food and friendly staff. I got the combo with 4 veggie momos, rice and veggie bean chili and it was so tasty. Though at 13 dollars it's a bit pricey.", "author": "Sindy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "This Bini's Kitchen location is an adorable stand near Union Square, San Francisco that had two people working at the pop-up counter taking the orders and preparing the food. \n\nHighlights:\n- 8 dumps for $6 (up-charge for lamb, naturally)\n- combo plats with chicken curry and dumplings for $14\n- super quick, most of the food is prepared for the day\n- friendly service\n\nIf you're looking for a place to sit, there is a square in front of the stand and the building to take a seat.", "author": "Qurat K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "This simple to check there is just a few things we will enjoy their Momos. Nothing fancy but very delicious and interesting flavors.", "author": "James R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-12", "description": "I stumbled on this place at farmers market. Their food is very tasty and inexpensive. Momos is a must try. I tried kwati for the first time yester and I really loved it. The next time you see this stall at SF farmers market, do stop by for yummy options. They have decent vegetarian options as well.", "author": "Abeetha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "This place is a cheap-eats hidden GEM. Tucked behind the Montgomery St. Muni/Bart station and the McKesson Corp. building, this little place packs a punch.\n\nI work around the corner and have heard this place is good for a quick lunch on a budget. I stopped by today for lunch and was so excited to see what this place offered. They have a variety of menu options including delicious momo, \"nepalito\" nepalese burritos and other combo options. \n\nI ordered the Gorkha chicken + momo combo. It comes with turkey momo with a tomato/cilantro sauce, rice and the gorkha curry chicken. Pricetag came out to be $10 + tax/tip. Served tight in a to-go box because there is no seating immediately associated with the hole-in-the-wall shack. I waited no more than 5 minutes for my order and headed back to the office where the food was still piping hot. \n\nThe food was very flavorful. For the price, its right on point. i think the momo could be steamed a bit more for added tenderness, but it was still delicious and (IMHO) the highlight of the meal. The Gorkha chicken was also delicious and tender. Rice was a tad bit stale, but can't complain too much. \n\nOverall, a great lunch spot if you work in FiDi/SoMa/Montgomery area.", "author": "Anna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "First time trying Nepalese food and can say that I am a fan! I got the Gorkha Chicken + MoMo combo without the spicy sauce. The turkey Momo (dumplings) were pretty delicious -- very flavorful. The curry chicken, while tender, was on the oily side. If you don't have that big of an appetite, you'll definitely have leftovers.\n\nOverall, if you're looking for a quick, heavy, and cheap (by SF standards) lunch, I recommend checking Bini's out!", "author": "Casey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Delicious and cheap! Great for a lunch spot.\n\nThis place doesn't have any seating area, more of a takeout window.", "author": "Jordan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "Wow, this place is amazing! I have never had Himalayan/Nepalese food but this place always has me coming back. I ordered the MoMo combo (lamb), it came with chicken and rice. So much food! It tasted fresh, hot and the perfect amount of spice. The employees are really nice and always greet every customer with a smile and make it a priority to serve them the best way possible and it shows with the food they create. Definitely give this little spot a stop!", "author": "Navdeep D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-27", "description": "Around $7 for a box of either Turkey or vegetarian momo. Great for a quick meal since they come out with your order quickly, but the momos were okay - the filling was average and had some curry taste.", "author": "Jacqueline T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "MoMo's in SoMa....hell yes.\n\nIf you are walking down the north side of market street..you could easily pass this small little food stand ( it used to be what's up dawg...which I loved) right next to the McKesson building and the Montgomery Bart station/\n\nI love their turkey momos they are light tender and that delicious dipping sacue. Acutally all their dishes are good...made with tender love and care.\n\nIf you are vegetarian..they have some excellent options.\n\nDefinitely check them out.", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-26", "description": "This little food stand is really well located - right on Market street and Montgomery. While I'm usually a HUGE fan of momos - the lamb and turkey momos didn't quite appeal to me. Traditionally, momos are made from chicken was I was a bit surprised to see that they didn't offer this variety at all. The girl at the counter is extremely sweet though - and she makes my day every time. The service is also super quick - try the masala chai!", "author": "Sam M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "I am not an avid writer of reviews, but I could not help but write a word or two about Bini's kitchen. I often lunch here, and always go with the Veggie combo. Saffron flavored rice, with Kwati (mixed bean curry) on top and lip-smacking steamed Momo's (veggie dumplings) topped with coriander chutney on the side. This all is so mildly flavored and highly nutritious.\n\nOn Wintry days, I sip their Masala Chai and in summer, I sip their Mango Lassi, along with it. A special mention for the highly effective spice mixture that they put on top of their drinks.\n\nDo try. A small heavenly place for food.", "author": "Anurag U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "It's not like you can get momos anywhere. I've had good ones in remote faraway places like Sebastopol at the Himalayan Tandoori & Curry House (review: http://bit.ly/1nUx10t) and La Jolla at Taste of the Himalayas (review: http://bit.ly/1Q6jD6g). Why I've even climbed the chilly peaks of Bernal Heights to get to Little Nepal (review: http://bit.ly/20HkSxG), although ironically, MoMo's doesn't serve momos. What up with that? Everyone's momos are different, not necessarily better or worse, just different. As long as it has a doughy texture, I'm happy because that means I'm not eating basic dumplings.\n\nBinita Pradhan's momos are pretty doughy which already gives theirs a leg up on their far-flung competition. She took over the kiosk next to the McKesson building where Zog's Dogs sold ballpark franks and more recently, Street Food Dojo was hawking Korean takeout (photo: http://bit.ly/1ScYoje). The menu is intentionally small as the prep space looks pretty claustrophobic in there: three kinds of momos, a chicken curry burrito (of course), Nepali-style chili and a combo plate. They call themselves the Mt. Everest of dumplings, but I call 'em one-buck momos since the pork ones are priced at eight for $8.\n\nThey come drizzled in a tomato cilantro sauce, and they were gone pretty quickly (photo: http://bit.ly/1T2nd0h). Today I returned and tried the $10 Gorkha Chicken and Momo Combo. It was a jeera rice pulao with Nepali-style chicken curry with four turkey momos on top drizzled with the tomato cilantro sauce (photo: http://bit.ly/1ScYjfJ). There was no place to eat it there since the pigeon droppings have taken over most of the open concrete spaces, so I sauntered over to that strange lunch room on the third floor of the Galleria. It was a better balance of food than having a pure momo-fest. I hope Binita and her team stick around for a while.\n\nFOOD - 4 stars...wake me up before you momo\nAMBIANCE - 3 stars...well, it's that same damn kiosk, what do you expect?\nSERVICE - 3.5 stars...they seem grateful to get the business\nTOTAL - 4 stars...hard to find a good, authentic momo in this town, so finding one here is a treat", "author": "Ed U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-23", "description": "No complaints about the food, but for you germaphobes out there.....I would come here during only peak hours when they are fully staffed.\n\nI was served by someone who was busy cleaning down the outside of the shop in their gloves during the tail end of lunch...then they ran up my order, handled my bills/coins in change, then scooped up my orders of Momos with their same bare gloved hand.  I guess it was too late in the day for them to bother using any utensils.  \n\nBlasted my Momos in the microwave afterwards, haven't gotten sick yet.", "author": "rb l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-30", "description": "Are you craving for tasty Nepalese momos? \nNope, don't stop by at binis kitchen. \nWe ordered the veggie and chicken combo. \nI can't believe what we ate were momos. They were sized up, cold and the sauce wasn't great. Very bland. \nThe rice was yellow and there wasn't a pinch of Cumin in it. Jeera rice isn't made tat way. I am sorry binis. Although I am no chef. \nI got a veggie Curry that was a mix of beans, but was ok for my taste buds. \"The chicken Curry is bland\" - words from my husband. \n\nA few average things about this place :\nLocation- I liked sitting by the pigeons for lunch. They frequent this place! \nPackaging- clean, neat \nPrice - 10$ for a combo. Not too bad. \n\nThe food must improve. If you guys really wanna have great authentic momos, \nI recommend the everest momo in Sunnyvale. \nIt has set the standard and its hard to look at binis the same way :(", "author": "Viji S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-09", "description": "I've never had Himalayan food before so I didn't quite know what to expect. The restaurant is a small outbuilding next to the McKesson building. You'll see it to your right if you're walking west on Market St.\n\nI had the Gorkha chicken and momo combo (http://tinyurl.com/z5noeqf). Everything in the combo was covered with their spicy cilantro tomato sauce which isn't very spicy at all but had a nice kick of flavors.\n\nThe momo dumplings were disappointing after looking at the previous yelp reviews and photos. The momos were filled with savory chicken which tasted decent. But the wrapper was a bit thick and rubbery... Likewise the  rice was also on the dry side. \n\nThe gorkha chicken was definitely way better than the momos. But it definitely wasn't enough for me to want to go back.", "author": "Lily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-01", "description": "Huge fan of these Himalayan dumplings = momos!\nThey have the lamb momos back, and the turkey ones are also super good.\nI crave these almost every day!  I could eat 100 of them easily.", "author": "Todd R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "Tasty and not your ordinary lunch fare. In a neighborhood where my usual variety is among the type of sandwich or salad place, this is a welcome breath of fresh air. \n\nI tried a vegetarian combo. When I go back, I'll probably just stick with the momos (it's a better portion size and price point for me), but it was nice to try all the things. \n\nThe chai was tasty, too! \n\nAbout average price without the drink (~$12), but a little on the high end for food-stand-lunch with the drink ($15). Momos by themselves are cheaper. Looks like they'll be debuting a new burrito-style option soon, too. Can't wait!\n\nUPDATE: The burrito is definitely a generous portion of tasty food (probably the most cost-effective menu item), but it's definitely a fork and knife operation and pretty rice-heavy. My coworker got the same thing but couldn't find any chicken (whereas I had plenty) so you may find inconsistent meat servings.", "author": "Krista L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "The best walk up to order place - quick, delicious and good portion. I got the curry burrito version which wss so good but will go back for the plate. And the secrets in the sauce.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-26", "description": "5.25.16 12pm ish.\n\nNo lines! Fast for people who need to get back to the office. They have replaced the pork momos to lamb. Lucky for me I like lamb. Not so lucky for my coworker who was set on getting the pork. \n\nI like chewy wrappers so I didn't find it repulsive like others have complained about. I hate soggy wrappers. There probably could have been more meat in there. It was fine for me. I got extra sauce for my dumplings because I love tomatoey and spicy things. It wasn't all that spicy tbh. This place is pretty average. Not great, not bad. Pretty decently priced for FiDi. I don't know if I'll be back. The burrito thingy looked interesting, so if I do come back maybe I'll try that..", "author": "Dianna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "I get these Momos everytime i'm at off the grid at Fort Mason. Although I explore around with smaller bites from different vendors, this is the one food I actually crave every time i'm at off the grid ( but thats already reflected in a different review). \n\nThis morning I saw on SF Gate that this place had just opened up yesterday (Dec 7) only a couple blocks from my office! Naturally I booked it to get my momos. Chicken Gurkha + momo combo is the best. Very filling and flavorful and a very welcome addition to the financial district. There's literally nothing like it in this area. The place is a little hidden. Although its 1 post, you want to stay on the Market St. side right by the entrance of the McKesson building. \n\nA couple of small tables outside would have been nice, but they have just opened and i'm sure are working out some of the quirks still. As if I didn't like this place enough, I recently read they were a part of la cocina's incubator program. Their great reputation is well deserved.", "author": "Thielson D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-01", "description": "Bini's is a great option for when you're feeling adventurous and want to veer away from the usual lunchtime diet of salads and sandwiches. Their $10 lunch deal with rice, Gorkha chicken, and momos is extremely filling, but beware of the food coma that may follow! I'd say the food here is perfect for those valuing quantity over quality-- while I enjoyed the chicken and rice, the momos could be a bit juicier and the filling just reminded me of a dry-ish meatball. However, I think this is still a great deal for the price. Service was also very efficient and it took about 6-7 minutes total for me to order and get the food.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "I don't know why it's taken me so long to give this place a try. I've walked by it so many times! Never around mealtimes though, so maybe that's why. Anyway, my only regret is not coming here sooner! This place is amazing. I came here for lunch on a weekday (around peak hour) and there was no line at all. I was surprised! I decided to get the combo (Momo's and Chicken Curry). The momo's are like dumplings...they're actually shaped very much like xiao long baos, except they don't have soup in them. The meat is also made with spices that give it a slightly different flavor than the meat in traditional Shanghainese soup dumplings. Still good, though! The chicken curry that took up the other half of the box was so good!! So much flavor, and the chicken was so tender!! And there was so much of it too! They give you just the right amount of rice to balance it out. I was so full afterwards, omg. Great value...the combo was just $10! And my food was ready in less than a minute. Nothing bad to say about this place. I will definitely be back!", "author": "Ashley Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "Convenient little place to grab a quick lunch. It's takeout, so it's perfect for grabbing and heading back to the office. Ordered the chicken curry combo that is served over rice and with 4 turkey momos (dumplings). The chicken curry with rice was definitely great together. The momo was great too, but they're a little drier than what you'd get from japanese gyoza or chinese jiaozi. I'm more of a fan of juicy dumplings :)\n\nFor $10, it'll be a tasty and filling lunch.", "author": "David Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "Much more exciting than the hot dog stand which used to be housed here several iterations ago.  Not much Nepalese food in San Francisco, so any new addition is welcome.  A pretty limited menu compared to their catering options.  Hoping the menu gets a bit bigger as time passes.\n\nNepalito: I get it, everyone that serves some sort of rice and protein is putting it into a burrito nowadays.  This configuration felt a bit lacking though.  There was tons of rice and ample large pieces of chicken.  There was also some not-so-Nepalese pico de gallo (why not use an onion chutney instead?).  It probably could have used some of that Nepali Style Chili round it out with beans.  Also, the spicy sauce as a bit skimpy so it felt kinda dry with all the rice.  It was still good, but it had the potential to be really amazing.\n\nPork Momo: The star of my meal.  Slightly thicker dough than most dumplings sold around town.  The minced pork was very similar to Chinese styles.  But the real differentiator was the red sauce, which had a nice spicy coconut tone that is far superior to soy sauce and vinegar.\n\nMango Lassi: Pretty standard with ample mango, creamy yogurt and spice.  I liked that it was cold from the refrigerator without ice (which can steal valuable lassi space).", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "The momo here is really awesome. Also, i love their momo sauce!!! It feels like i am eating momo in Kathmandu   I really recommend to eat momo here as it has a really fast service and good MOMO!!!", "author": "Kusum T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Bini's Kitchen is a small indoor stand tucked away in the side of a building. When ordering, you can peer into the entire place. I have tried the lamb, turkey, and veggie momos. Everything is premade and kept in a metal container and when you order, they put 8 momos in a foil lined to go box and scoop some spicy tomato cilantro sauce on top. The sauce is bombbbb and I usually ask for extra.\n\nThe lamb momos were too gamey for my taste but the turkey ones are perfect! The veggie ones are good too but they are less juicy... I would recommend the turkey if you are a meat eater.\n\nThe part of the wrapper that is pinched and thicker and is sometimes not fully cooked but that never bothers me.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "In LA, this place would get 3 or 4 stars, but in the over-expensive Market St area of San Francisco, this place is heaven. Great momo dumplings, great chicken curry, can't go wrong with the price relative to the area.\n\nGet it and feel good about yourself--skip your boogie lunch plans for this place.", "author": "Salim Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "I've gotten the chicken combo a couple times from this place and I'm a fan. Very good food truck meal (it's actually more of a stand than a food truck, but comparable service and quality).\n\nWhat I liked:\n* Very filling meal if you order the chicken or lamb combo. I usually come here only if I'm craving a big lunch.\n* Combo is tasty and has some variety with the momos (dumplings) and curry.\n* Super friendly staff and seems like its a family owned food truck because I always see the same people there.\n\nWhat I didn't like:\n* Most times I get very thirsty after having this meal. I would definitely recommend having something to drink on the side.\n* Not the healthiest meal and pretty heavy, so expect experiencing a food coma afterwards.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "I came across Bini's Kitchen one time when I was with some of my co-workers - we were wandering around Market St, looking for a lunch spot. This first time 'round, one of the others got an order of lamb momos and I had a small taste - o... m... g... so good and tasty, and it was the right texture and consistency. Needless to say, the next time we were in the area, I got something here myself. My favourite thing lately is to get the combo to get a little taste of everything - rice, curry, and momos (and sometimes upgrade to the lamb momos, but the other ones are good as well). There are long lines sometimes (testament to how great the food is here), but I find that those go by fairly quickly. Besides that, the staff are friendly and can offer advice if you're not sure what to get. The only downside is that this is very much a weekday work lunch spot, so it closes early and isn't open at all on weekends :(", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "Finally some rain in SF and the perfect weather for momos- steamed dumplings- stuffed with seasoned minced meat. I got the lamb- $8.76 after tax for 8 healthy portioned momos. \nOh but they've got more than just lamb- you can get beef,or vegetarian ones too. The veg option has carrots, tofu & cabbage. The carnivore in was calling out today. \n\n...Thought  I'd still be hungry afterwards but it was just the right amount - will def try the gorkha next times & ask for some extra sauce to go!\n\nFortunately came by for an early lunch and was the only one in line. Got my food within a minute of ordering. Wooohoooo\n\n\nThis place is outside the Montgomery Bart station by Peet's & specialty's cafe.", "author": "Ruby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-06", "description": "Great little Nepalese place right on Market Street! I always get the Gorkha Chicken + MoMo combo. It's $2 extra if you want lamb momos instead of turkey, bringing the total to $12, which is still cheap by SF standards. The quantity is definitely more than enough and the momos are always delicious. My only complaint would be that the Gorkha Chicken seems a bit bland sometimes, but it's still pretty good. All in all, a great lunch stop.", "author": "Sahil S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-11", "description": "we tried the bison momo's at the ferry building market place. ive been curious about them for quite some time so i was happy we purchased 10 for $8. not cheap, but bison so very interesting.  they were cold, and didnt have a lot of flavor, so i wasnt super excited about these.  and the orange-y sauce was a little weird. they are shaped like soup dumplings but obviously there is no soup in them. i'll probably try the actual stand in fidi at some point to give them another shot though.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Delicious vegetarian momos with great sauce. Sometimes they will throw in an extra momo for you! Kind people and great service as well.", "author": "Divya R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "I grab lunch from here once a week week because it is super tasty, fast service, and the staff are very friendly. The Kwati is a great light meal. The Nepalese Burrito is very filling and they give you a tasty \"salsa\" for it, but ask for extra salsa because it is so good you will want every bite to be covered in it.", "author": "Paul N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "What can I say about this place...? \n\nThis is like a home away from home for me. \n\nI'm not joking,\n\nWords can't describe how I feel about this quaint little shop of delicacy. I spend more time here than I do at the gym.  I eat here multiple times a week, for a couple years now. If you visit Bini's kitchen, odds are I will be there.\n\nTurkey Momo's (dumplings) - My favorite \nLamb Momo's!!! - My 2nd Favorite / YOU HAVE TO TRY\nChicken / Burrito - Mmm good, especially if you have a healthy appetite\nVeggie Momo's - tasty, lighter & I feel healthy when I get these \n\nThey have a chili/soup, I've tried it, it's good / light,  healthy tasting, I don't get it that often but that's because I love the dumplings so much, but it's a nice option\n\nMANGO LASSI - it's a beverage, just get it - thank me later \n\n\nThe staff is super friendly and helpful.  Shout-out to Sonu, she's my favy. \n\nThe rice is hella good especially with the Orange sauce (I love you, Orange sauce!) and a little cilantro and chili flakes.\n\nAnd always remember, Mo Money - Mo Momo's.\n\nGimme all the Momo's.\n\n\n\n\n\nI'd like to set up a hose that pumps Bini's Momos straight down my esophagus and into my belly.", "author": "James M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-15", "description": "I order the lamb momo instead of the turkey , thinking the turkey might be too dry. The lamb was too strong for my taste bud. I think the cashier only want me to get it because it cost more than the other ones. There's no sitting area. The spicy tomato sauce is a bit bland not even spicy for my mild taste bud. Don't think I would come back unless I'm very hungry.", "author": "Miri L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "Bini's chicken+Mimi combo offers 3 distinct items in one satisfying lunch, all for only 10 dollars. The chicken curry was satisfying, especially with rice. But the highlight of the meal was the 4 Mimi dumplings, which tasted extra delicious when drenched in the curry sauce. The presentation of the food is great, and the service was insanely quick.\n\nNot much else to say: Bini's is an excellent place to get to get lunch from.", "author": "Ben Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Easily the best Momo's I've had and the orange sauce that comes with it makes it even better. This is an underrated place and worth the many times I get lunch from here", "author": "Arvind R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-08", "description": "My friend and I we decided to get something from Bini's Kitchen stand at Outsidelands because my friend really wanted to try out their veggie momos. I opted for the Nepalito because I wasn't sure if the momos were going to be filling enough (I was really really hungry and burritos always did the trick). \n\nI've never had Nepalese food before so I didn't really have any expectations for this stand. I tried my friend's veggie momo first before trying out my burrito and thought the momos were BOMB! I think the sauce on the momos really helped with the balance of the dish/plate/food. However, I really do think the burrito fell short on my scale and that's why I'm giving this place 3 stars. I think the burrito just felt really bleh and meh. It didn't have much to it.. I just felt like I was putting food in my mouth to mitigate the hunger. The burrito really could've done better with more sauce, some sort of sauce.. it just really needed something to go with the blandness of whatever I was tasting. I might go back to this place in the future if my friends really want to try out their food. But next time, I'm opting for the momos.", "author": "Emmeline T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "We got bison momo and kuwati. Both dishes were well balanced and extremely flavourful. We purchased this from their stall at the ferry building and later found out they have a storefront as well. Will be sure to stop by for our momo cravings!", "author": "Anisha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "First time here, extremely delicious and very much mouth watering Momos. Will recommend to all. Will keep coming back again. Wondering if they have chicken momos in the menu. Thanks again for bringing delicious taste of Nepal to Bay Area.", "author": "DJ J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "Nice !! Simple !! Reasons able price !! Try out .. coming back ...  for more in near future !!", "author": "raja g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "I am definitely a fan of Bini's Kitchen! I'm so grateful that they opened up their little booth on market (1 Post Plz) to share some Nepalese goodness with San Francisco. Their menu selection is small but I love how they are keeping everything simple. If this is your first time trying out Bini's Kitchen, MoMo's are the way to go. MoMo's are dumplings and you can choose between pork, turkey, or vegetarian fillings. What really gives it a kick is the spicy tomato cilantro sauce that is served with them. SO GOOD! For my first order, I went with the Gorkha Chicken + MoMo combo. It was a deliciously satisfying amount of food and easy to eat. My co-workers tried the their burrito (basically everything in the combo wrapped up in tortilla). It is huge but messy and so they ended up eating it in a bowl with utensils. Staff is super friendly. Definitely recommend and will be back for more!", "author": "Grace J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "Great little spot right on market street . Got the whole wheat burrito . It was simple. Good flavors and a large portion for $8. Workers were very friendly and quick.", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Love this food and great prices. Super sweet and lovely staff. I dream about the momos.", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-12", "description": "This place is pretty shifty. I bought a burrito for $8 and change with a $20 bill. They only gave me back $8. When I asked for the rest of my change they short changed me again! This is not big dollars. In fact, I would have given the difference as tip, but to\nshort change your customer twice in the same transaction suggests that this is par for the course. Don't let them rip you off.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "I love Indian and Nepalese food, so I'm delighted to have Bini's open across from my office. Flavorful, fresh, fast food at a very reasonable price ($10 or less). I love their momos, which are the dumplings that, to my mind, distinguish Nepalese food from other South Asian cuisine. But I prefer their Nepalito, a chicken curry burrito, packed with fresh tomato, onion, cilantro and peppers.\n\nThe lassi was delicious too.", "author": "Matt A C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "This place is a little tricky to find, had to use the pictures posted on yelp to help me locate the spot.\n\nI had the combo dish, with the dumplings and the lamb. Came with four dumplings, meat, and rice, with sauce over the top. Tasty, but pricey at $14 for lunch. Would definitely get it again, but not too frequently as there are too many options for lunch at this price point.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "This place is crack and MoMo's are life! So happy this place is within walking distance from my work. It's a nice break from my usual go-to salad/sandwich lunch places. This place is just a stand next to 1 Post Plaza so no formal seating. Menu is pretty simple but the items are delicious. Most of my coworkers just go for the MoMo's which are dumplings (veggie, turkey, lamb) that come with a delicious tomato cilantro sauce with a kick. If I'm feeling more hungry I will get the chicken and MoMo's combo. Beware of the burrito which is essentially the chicken combo in a tortilla. It's delicious don't get me wrong but it is huge and messy so only get if you are absolutely starving! Lunch price average is about $10 and the service is friendly and quick!", "author": "Alex S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-05", "description": "I've never in my life tried any type of Himalayan/Nepalese food, I came across this spot and decided to give it a try.  \n\nMenu is pretty simple, I tried the Gorkha Chicken + Turkey Momo Combo for $10 and a Mango Lassi drink $3.  The Jeera rice and chicken curry was pretty good and not overpowering in curry flavor.  The spicy tomato cilantro sauce was good, not spicy at all. The turkey momo (dumplings) were OK but I tried the pork ones that my girlfriend ordered and I thought they were way better.\n\nI didn't care for the drink at all. I'd probably return again and order the same thing but skip on the lassi.", "author": "Resa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "I've enjoyed the momo dumplings at Off The Grid Fort Mason and their outpost on Market. The slightly sweet, slightly spicy tomato sauce imparts more flavor than the momos I had in the Himalayas, while the dough and filling were just as good. \n\nI recommend the combo so you can try a little of everything, and the veg chili is comforting and flavorful. I feel like serving so much rice is just filler for the plate, but overall it's a satisfying meal.", "author": "Cristina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-17", "description": "Ordered the Gurkha chicken with momo (upgraded from turkey to lamb for $2 extra).\nThe momo's were lukewarm (understandable since it was past 1.30pm) but tasty. The Gurkha chicken was tasteless. Will stick to ordering a plate of momo's.", "author": "Amit K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "there is a horrible pun to be written here. something like, these were so good, i need some... momo...\n\nanywho\n\nits been about three days since ive returned home from sf and if i could reflect on my eats in this city i'd have to say these were the best bang for my buck i could afford anywhere throughout. (i apologize; turns out, im not much of a texmex gal.)\n\n8 veggies or turkey momos for $6, or 8 bison momos for $8, its your call man. whatever you choose, youre to get a lovely rectangular box of lil pockets full o' love. and you know its love.\n\nif youve never tried momos (ie you hail from a place painfully void of great southeast asian eats like myself), theyre delectable pops in your mouth which, to me, resemble in taste to some good xiao long bao, without the joy/mess of soup. top it with some of that tomato cilantro sauce--oof. make sure to ask for extra of that.\n\nwhat really did elevate the experience was the kindness and sincerity of the guys running the shop that day. they greeted with me a full-on smile as soon as i rounded the corner confusedly, wondering where the hey this little truck was. the guy at the window knew it was my first, and struck such a welcoming conversation, asking me where im from, how i enjoy things, dropping a \"why arent girls in sf as cute as you\" to which i guffawed rather unattractively because if the people in sf arent beautiful i sure as heck dont stand a chance against the modern beauty standard anymore. the man packaging the parcels of delight calls you out by name, says \"hope you enjoy,\" and also bids you adieu with a beaming smile. i stopped to take a photo, shoved one momo in my mouth, then turned back around to them and with my mouth full gave them a huge thumbs up, \"these are great!!\"\n\nif youre in the area on your lunch break, or if youre a traveler whos strapped for a good cheap meal on-the-go, definitely swing by bini's just to take a nice break from the hustle n bustle of this big big city and enjoy some hand-made lovin'. i'll miss this tons :')", "author": "Angie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Tasty High quality food at Off The Grid every Friday evening at Marina, SF...There is always a very long line at Bini's corner....Hot mono in the windy marina ---good combination.... 5star food at very inexpensive price. Don't miss the momos..", "author": "Prabin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-05", "description": "I really want to like this place.  I will give them one more chance.  \n\nMomos were cold in the  middle and undercooked.  That smeary taste of raw meat.   \n\nI paid extra for Buffalo Momos in combination with the Nepali chicken curry, but then ALSO only got three momos instead of four.   For $12, it felt like a nickel and diming move, and the quality of the momos - un  \n\nI want to like this place so I will try again, but if others see the same undercooked momos, PLEASE CALL IT OUT TO THE STAFF.  Probably just a one-time mistake.", "author": "Jonathan b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "I have only had the vegetarian momos and the vegetarian combo. Both are pretty good. The momos always taste freshly cooked which i love. I with they had more momo varieties!", "author": "Serina J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-26", "description": "Ehhhh...notnparticularly great, though certainly edible.  Would not recommend it unless you need quickly-prepared food and have nonother option.", "author": "Max S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "I love love love Bini's Kitchen turkey momo's - so flavorful and filing with their tomato sauce with a little kick to it and very reasonably priced! I go here every chance I get when I'm working in the area. I also enjoy the mango lassi (smooth, just sweet enough, filling and satisfying), and I recently had their chai tea (yum, refreshing and lovely). Such friendly service makes lunching their the perfect experience. I can't wait to come back again very soon!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "Great Nepalese food. I especially enjoy the combo, a good amount of rice, chicken, sauce, and momos. Mmmmm momos.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-17", "description": "Bad food and bad service.\n\n1.  The momos are a disgusting doughy mess with an awful texture.  They are NOT fresh; I saw them pull out a big bag of frozen momos to steam.  No wonder they are disgusting.\n\n2.  The woman who runs the shop has a bad attitude.  My friend ordered multiple orders to go, and the woman told us we have to wait for 5 minutes because she was one order short.  We waited patiently for 10 minutes, while other customers who ordered after us all got their orders.  When I finally checked on my friend's order, the woman yelled at me rudely.  \n\nBitch, you can take your lousy frozen momos and shove it.", "author": "Shin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-23", "description": "Pretty decent food for the amount and price you get. The people I went with really liked it, especially the momos are like little dumplings filled with turkey (I think it was turkey). I got the conbo which came with rice, chicken curry, and 4 momos. The curry is kind of like chicken tikka masala, but not spicy. Like at all. Maybe you can ask them to make it spicy? Idk. I thought the curry could of had more spices to have a stronger kick to it, but maybe they're just catering to a different crowd with different tastes.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-01", "description": "Small little Nepalese food stand right next to McKesson corporate. $11 for lamb napalese dumpling and a chicken curry combo. $3 for mango lassi. Delicious.", "author": "Joe H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "I stopped by this place when I got off BART. They just added lamb dumplings to the menu, so I go those. I wasn't sure if it'd be filling enough, and it was! The food was super fresh and the dumplings were super juicy with thin skin. Mmm. I also got the mango lassi, which was very tasty. It had bits of cardamom in it, which adds more an herbal kick to it than just a regular super sweet lassi. Quality food!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-11", "description": "We had their Combo Plate of Chicken with Rice and four Turkey Momo Dumplings (popular meat dumplings in Nepal that look like Xiao Long Bao) at Outside Lands. It was all so delicious! I went back for a second plate the next day! The sauce with the Chicken was very flavorful and not oily or too heavy. It was a very pretty plate of food and I don't know what the Chicken was called. They gave you a good portion of Chicken and enough orange colored sauce to enjoy with every bite of rice. The Momos were yummy though I would have liked the sauce to be spicier. It wasn't spicy at all to us and I think it was supposed to be. They ran out of rice on our second visit so we didn't get much rice. I'm very happy to find out their food \"cart\" is close to my work. I'll have to walk over to get some more Nepalese food. The price of the Combo Plate was reasonable but seeing that their website has a Turkey Momo Dinner package of 40 dumplings, broth and sauce for $50 plus taxes, I'm thinking they're quite pricey.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "The Gorkha Chicken + MoMo combo is delicious, and for just a shade under $11 it's also a really good deal for lunch in this area. For that price you get a takeout box with Gorkha chicken (kind of like a chicken tikka masala) and 4 MoMo's (kind of like XLB) over rice. When we ate here they had turkey and vegetarian momos so I think you can choose between the two. I'd consider coming back for the combo, but the burrito did not look as appetizing so I'd probably avoid that.", "author": "Wayne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "I was pleasantly surprised by how good Bini's Kitchen was! I ordered the regular combo, which consists of their super moist and tender chicken curry and 4 momos, all for $10. Having never tried momos before, I was swept away and immediately feened for dumplings all week. The sauce that comes with the momos is delicious, too. Bini's is, hands down, the best bang for your buck that you can find all over the Financial District. I did a group order for an office lunch once, and needless to say, everyone loved it!", "author": "Monica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "This review is for the momos only.  There aren't that many places you can get these specific dumplings.\n\nThey are good.  All of them!  They are reasonably priced and are fresh!", "author": "Sanket K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Had the turkey momos and they were delicious. Highly recommend. The spicy tomato basil sauce is great, and isn't too spicy. For $6, there isn't a much better inexpensive option in the area.", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-31", "description": "On my way, at prime time, to the usual burger joint, I realize I really needed to get out of my rut and saw this place which I hadn't noticed before and had no line.  Got the Chicken combo and I enjoyed it.  Very good amount for lunch.  I would saw the chicken is not super spicy; almost was a bit bland, but I appreciated this since made for good digestion.  The dumpling things are awesome; beautiful to look and and nice mouth-feel.  Definitely, a great choice for when you can't battle the lunch rush and then take up for a quick dining on the public access roof of that old Wells Fargo nearby.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Amazing food! Love the fast service and authentic Momos made by the Nepalese staff. This takes me right back to the time I've spent in Kathmandu - classic, weekly lunch spot that I love.", "author": "Justin R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-17", "description": "Ordered the vegetarian combo, which came with jeera rice, vegetarian momos and Kwati(sported beans curry) \nThe food came in good portions and tasted good.", "author": "Lakshmi Lavanya S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-22", "description": "I was heading over to Ginto for sushi when I saw that there was a new ownership at this little pick up joint and decided to give it a try. It is now a Nepali/indian restaurant. Small menu which is cool, I got the chicken combo which comes with chicken curry, rice and dumplings. Given the limited menu, I was expecting that it was going to be awesome. It ended up being ok but not great. Don't think I will be back at least any time soon.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "I've been wanting to eat here for two months, ever since reading about it in the Chronicle.\nI was impressed by the huge portion and taste. I also liked that the food was mild. I had the chicken gorkha combo. Fabulous!", "author": "Eva UnTiger S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "i really did like my lunch i had at bini's.\n\ni had the chicken momo combo, for 10.88 incl tax. \n\nmomos delicious, rice very authentic nd the chicken nice nd smooth. could have been spicier for me - but hey thats my personal taste. \n\nsome outside seats would be fun, but i guess thats not allowe here in sf.", "author": "Dom R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "It was my first time checking out Bini's but it certainly won't be the last. The Turkey Momo was so tasty and filling. 8 pieces for $7 is such a great deal! Can't wait to return and try something else on their menu. \n\nKuddos for being vegetarian friendly.", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "Brand new popular food truck turned brick and mortar outdoor food stand next to Montgomery Bart (talk about an ideal location).\n\nNepalese food (where Mt Everest is located) is a mix of Indian and Asian (Chinese like) as it's central between both locations and the food clearly tastes like it.\n\nI got the $10 Gorkha combo (4 turkey dumplings with palao yellow rice and a unique chicken side that was similar to tikka masala). \n\nThe MoMo dumplings, while a bit more unique than Chinese style, were just too dry. The flavor was solid, and had a nice yellow sauce (unknown flavors), but a bit currylike and a bit sweet and chipotle-like. 3 stars. Another tried pork (extra $2 upgrade) dumplings which were a bit juicier, but same hard textured shell. 3 stars.\n\nThe tikka masala like gorkha chicken (add cilantra for free) is very good. Looks like Indian tikka, a bit more oil, but with less spice and more tangy flavors. Goes well over rice. 4 stars.\n\nThe palao rice was just too dry.\n\nI'd try it again, esp with their upcoming Nepalises chicken burrito soon to come and the chicken gorkha by itself, but the dumplings are only so so.\n\n3.5 stars.", "author": "Chuck N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "After ordering the lamb Momos i got served almost instantly. The dumplings and the sauce were very delicious (but very garlicky), next time I will try the rice/chicken/momo combo.", "author": "Jakob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "Bini's KItchen officially opened as a B&M at McKesson Plaza, 1 Post St. in the little outbuilding that backs up against the McKesson building. Binita Pradhan brings most of her Off the Grid: Fort Mason menu (with a few additions) to the Montgomery BART station area. You'll find her signature momos (pork, turkey and vegetarian) at the humane price of $6-$8 for eight healthy-sized dumplings, vegetarian and gluten free Nepali curry (kwati) and Bini's poplular Gorkha chicken with pulao (Nepali rice). Wash it down with chai or a truly mavelous mango lasssi.", "author": "Gary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "- Momo's are delicious, not too overpowering\n- Affordably priced\n- Friendly service", "author": "Marc V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "These dumplings are delicious! My friend and I went for lunch today. We ordered the turkey and lamb dumplings. Like everyone says, the sauce isn't spicy at all. All dumplings were packed with meat and full of flavor. Definitely stopping by again!", "author": "Kristen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "I couldn't love this place more! It's right between the Montgomery BART station and my work so I try to stop at least once a week. On top of the lamb dumplings with the unique tomato sauce that I crave, and the fresh chai, the service is actually so thoughtful I was inspired to include a character in a book I'm writing on the woman that thanks me by name every time I go there. Truly a hidden gem.", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "Delicious and crazy cheap ($8-10) unassuming shack. The combo for $10 (chicken in sauce, 4 large dumplings, rice) is a feast and each separate item is equally delicious. With only a 5 or so minute wait from arrival-to-order-to-food, this will easily become one of my main lunch staples going forward!", "author": "Alexander Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "The service, food, and people at this food stand are amazing. We enjoyed all the dumplings, as well as the tomato based curry on top. We were so blessed by the young lady working. She saw my wife and I with our baby boy and brought my wife a free soup! She said it was good for mothers with infants. Very touching for someone to add that extra care and thoughtfulness...especially in a fast-paced city like SF.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "The Momo's are incredible!!  I had the pork.  Decent price, incredible sauce and filling, and plenty to eat!!\n\nGreat spot for a quick bite!! Excellent!", "author": "Jesse K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-03", "description": "Tried the \"Nepalese Burrito\" for lunch on Thursday. Got food poisoning. Was out of commission for almost 24 hours.  Tasted OK but something was not cooked properly.  Cost me a day of my life.  Not going back.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-09", "description": "Food was decent, but service from the cashier was very poor and combo meal portion sizes/prices are well out of whack with individual items, unless you're hungry for a LOT of basmati rice. Lesson learned: if you go here with a larger appetite, order a la carte, NOT the combo meal.\n\nI ordered the vegetarian combo ($10), which arrived as 4 veggie momos and rice in a box (the rice took up 80% of the container) plus Nepali style veggie chili (more like a bean curry) in a plastic bowl, which filled less than 50% of the container. After witnessing a group that had ordered a similar combo and seeing the portion size of their chili, I asked for a bit more chili, since my portion size looked like it was a mistake/rush job by the server. The cashier quickly said no, because I had ordered the combo. \n\nWhen I mentioned the other group, she said they ordered the momos and chili separately, so they got a full bowl of chili. Ordered separately, the total cost of 8 veggie momos and the bowl of chili is $12 (each $6), so I said it will be helpful if they share that information with you when ordering, since I spent nearly the same ($11.90 with my $1 tip) on my less than half portion. \n\nAlthough it's not the cashier's job to guess how hungry I am or to explain menu details to each customer without being asked, her attitude and response lacked any sense of customer service, so I will not be coming back.", "author": "Scott T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "My friend introduced me to this place yesterday. Got the chicken and momo combo and it was so good I dreamed about them last night! Extremely filling combo, rich, savory fillings, and really tender chicken. I will definitely be back! (Love the story behind Bini's, too).", "author": "Janie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Holy moly - the lamb dumplings were amazing! They looked like Xiao lun bao Chinese soup dumplings on the outside but were filled with tasty lamb meatballs on the inside. There were eight of these morsels for a great price and the chai tea was freshly made and not too sweet. Will definitely stop here again when I'm downtown. Next time, I'll buy some to take home to my family. Located right near the Montgomery Station stop.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "1st time trying Nepalese food & OMG is this place delicious!! Must try the momos (turkey, chicken or lamb) all delicious. Best way to sample everything is with the combo. Comes with rice, chicken & 4 momos of your choice all for $12. Definitely more than enough food. It's little hole in the wall is simply amazing! Well done.", "author": "Monika Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-15", "description": "We had the dumplings for breakfast. They were really tasty and came out quick. The meal was very solid, and the ladies were nice", "author": "Yanir R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-25", "description": "Fulfilling and very inexpensive for the location. I liked the sauce and the flavor of the momos, but the skin was a bit too thick. They reminded me of the Chinese soup dumplings without the soup.", "author": "C J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-28", "description": "I was definitely wrong about this place. Slowly, this has actually become my go to place for lunch and I love that you can either just got momo's (if you're not in the mood for something heavy) or you can get a combination of both the momo's and the veggie curry! The orange sauce on top of the momo's is delicious as well! Since this is a small shack looking establishment, there is very few staff, but everyone is extremely nice and the food comes out quickly! This is a great grab-and-go place in fidi!", "author": "Malika R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Really hits the spot when I have momo craving. Wish they had chicken momo as well, but beggars can't be choosers.", "author": "Isha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "I have been on the hunt for authentic momos in the city for a long time and I have to say Bini's hits the momo out of the park! I tried the turkey momos and they were AMAZING!!", "author": "Natalya R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-11", "description": "This place was OK. They had the food precooked and they assemble them once you order. It was not as fresh as I would like it to be. The best part of the meal was definitely the curry. The dumplings were tasty but I felt it tasted stale! the rice was lacking in flavor as well.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "Yes, this is what I was looking for. Authentic dumplings / momos. The service is super cool. And the persons managing it are fantastic. My wishes they grow more and more.", "author": "Himanshu Shiva A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-23", "description": "My husband and I loved finding small hole in the wall Asian eats on our trip to SF. Bini's was awesome and a great price for the location!", "author": "Shelby F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Loved the Bison Momo addition. Very delicious. Some of the wrappers were a bit tough but that is ok for the space they work in. I thought I was sad when I did not see the lamb but loved the Bison more!", "author": "Susan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "I tried the food at this cart last week and just loved the complexity of the flavors in their sauce. Dumplings were so moist and flavorful. Fast service, big portion and under $10!! Luckily it is right around the corner from my workplace. Looking forward to eating here again!", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Delicious food, reasonably priced, and conveniently located. Bini's was my first experience with Himalayan/Nepalese food so I don't know how it compares to others, but it's a winner in my book. Had the chicken + momo combo and it was just the right amount of food, with enough for an afternoon snack. It was like Indian food meets Shanghai cuisine with the curry and dumplings. Also tried the burrito the next day - also delicious but gets messy so have a plate close by. The burrito fed me 2x. Definitely will return.", "author": "RuthieAnn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-09", "description": "This spot is pretty good. The momos are moist and the turkey meat inside is amazing. Then the tomato cilatro sauce on it adds another level of flavor. I could just drink that sauce! The kwati is pretty good as well, as it has a healthy mix of beans and lentils. The gorkha chicken is very tender n moist w good chicken curry flavors. This spot is convienient and usually pretty quick.", "author": "Pavan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-15", "description": "Got the vegetarian combo: 4 veggie momos with tomato sauce, kwati, and rice. \n\nMomos: 3.5/5 I wish they had a tad more filling and spice. I've never had momos, so I admittedly have nothing to compare them to. But in the world of dumplings, they left me wanting a little more. \n\nKwati: 5/5 A thick, spiced bean stew served with a heaping portion of rice. Delicious and highly recommend. \n\nThe food was out quickly and piping hot. $10 for a large portion of delicious, hearty food in the financial district is hard to beat. The menu is small, but there's something for meat eaters and veggies.", "author": "Daniele D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-22", "description": "I had a Nepalito and a mango lassi. The mango lassi was great! That said, I've never had a mango lassi I didn't like, so I suspect my bar for mango lassi quality is pretty low :p I did not enjoy the Nepalito as much because it had wayy to much rice.", "author": "Maddie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-17", "description": "I had veggie Momos (dumplings) here and it taste like authentic. Sauce with Momos is delicious and must go place. I will try chicken/meat items next time.", "author": "Ashwani K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "I was in the neighborhood downtown and saw this spot.  I recalled hearing about them and decided to give them a try.  I just had the Momos.  Wow!  Amazing.  I love dumplings and these did not disappoint.  Very good and the sauce too was amazing.  I love Momos and love Binis.  This goes on my list of favorite dumpling places.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-23", "description": "Excellent Nepali food at a very reasonable price served by very friendly people.  Vegie dumplings are my favorite but everything is very good.", "author": "K S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-27", "description": "I love Nepalese food and was really excited when I found this spot. The service was quick - No lines. I ordered the vegetarian Combo which came with Rice, Vegetarian Momos and the Chili. The Chili was amazing. It was perfectly seasoned oozing with flavor. The Momos were little on a thicker side with little to no flavor. The Rice was super dry and also lacked seasoning. I would give it 3.5 stars.", "author": "Anu B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "I've loved Bini's Kitchen's for years and am so excited that Bini has opened a new restaurant right in downtown San Francisco so I won't have to wait for Off the Grid! The hot Momos (Nepalese pork, turkey or veggie dumplings with a delicious tomato-cilantro spicy sauce) have become one of my favorite meals. The Nepalese Chili (vegetarian), rice, and chicken dishes are to die for! The Chai is the perfect sweet and spicy warm drink to keep you cozy in our foggy San Francisco and the Mango Lassi is sweet and refreshing.  The combination of spices, fresh ingredients and love put into creating these dishes really comes together at Bini's Kitchen! Next time you're downtown I definitely recommend you stop by and try some for yourself!", "author": "Maggy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "The turkey momos are absolutely divine. I'd never had nepalese food before and now I'm super addicted! The sauce for the momos is absolutely perfect, too!", "author": "Tara R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "Satisfying vegetable dumplings! I went with some skepticism because the only sauce they offer has cilantro (which I hate), but the friendly cashier offered me a taste, reassuring me it wasn't too strong of a flavor. She was right. The taste was spicy but not overpowering. Will definitely eat here again soon.", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "We love to eat here for lunch all the time. It's lightning fast, the food is delicious (momo and curry combo is my favorite), and the staff is nice. I can't recommend it enough.", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "My new go-to spot for lunch in the Union Square are. The veggie combo is both delicious and an amazing deal and I keep coming back for it.  The momo's are super tasty and the nepalese chili with the flavored rice always hits the spot.  A great, healthy lunch spot in the union square area.", "author": "Gaurav N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "The food is amazing. You should totally get the momos, or Nepalese dumplings from the heart of Kathmandu. Overall this place is the bomb in downtown.", "author": "Ashwin G."}
