{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "I dragged everyone out of the house and drove to the city.  It was in the high 80s where we live so it was nice to come out of the tunnel to much cooler weather.\n\nWe strolled all over the wharf, had dinner at Boudins and watched the ships come in and out.  It was such a nice time but it was cold!!\n\nI have been visiting the pier for about 20 years, we live close enough to make many visits a year.  In all that time I have never bought coffee here.  We were all freezing and I was about to take my friends over the Golden Gate Bridge to Vista Point where it is almost arctic some nights.  So I stopped in and ordered coffee & mochas for all of us.  We didn't have to wait too long for our coffee, it was hot and delicious.  They include a little cookie with each coffee order.  I wasn't really interested in eating it because it was so small and didn't really call to me.  However, I decided to try it and ended wishing that I had about 20 more of them.\n\nMy friends and I really enjoyed the coffee and the cookies which kept us warm and fed on the other side of the bridge.", "author": "Robyn J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-07", "description": "Decent cup of joe at Biscoff coffee corner.  Located at Pier 39, it's hard to miss this little shop filled to the brim with snacks and of course, coffee.\n\nNo seating at this shop but that's not the goal here.  Really it's a get your sugar, caffeine and go.  They give you a free cookie (very small cookie) with every cup too.\n\nI got their small cup of coffee ($2.25), which wasn't bad but also nothing special.  The desserts almost got a purchase out of me because they looked great, but I passed this trip.\n\nStaff were friendly, fast, and I enjoyed myself here.  Yea i'd come back, especially if I were out visiting pier 39!  Hope you find your way to Biscoff coffee corner if you need a cup along the pier.", "author": "Jamarcus T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "Ok to get different late as Biscoff late it's only there\nFirst of all it's worth 45 minuets waiting on the line to pay and another 30 to get your order and the cold weather too\nNice customer service \nThe free Biscoff come with it mean a lot\nAnd snickers late it's good too but super sweet", "author": "Marco H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "These cookies are so amazing and their cookie butter is delicious to boot! \n\nThe employees were super friendly and offered us samples of their cookie butters, regular and crunchy. \n\nI purchased a big package of cookies and when I got home, I was extremely excited to find them in most any store! Costco has a good deal on them. I am glad I don't have to go all the way back to San Francisco to get them.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-17", "description": "I'm a huge Biscoff fan. My airline of choice (Delta) serves Biscoff cookies on their flights and I get them every time. When I walked by the Biscoff café on my way back from seeing the sea lions, I knew I had to stop in for a quick look. I ended up picking up a pack of chocolate covered Biscoff cookies and getting an iced coffee to go. You order inside the store and then wait outside by the window for your drinks.\n\nThe coffee was good and was much needed after my early start (6am flight from the east coast) that morning. The staff was very nice and helpful when I didn't spot any iced products on their official menu.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "This place is such a tradition for me and my bf! I'm also such a huge fan of their cookies!! Satisfied my sweet craving. \n\nWhy I was here // we always stop here when we 4th of July comes around and we watch fireworks at pier 39. \n\nThis place has excellent hot cocoa and great service! On a chilly night in SF this place really hits the spot!", "author": "Emily T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-16", "description": "Really bad experience here and it was my first Biscoff experience so not sure what to make of it. The guy making the drinks tonight was sooooooo rude! And our drinks tasted horrible. We got there close to closing time so they were rushing to make things but still  doesn't warrant attitude. I ordered a medium decaf latte and after waiting for awhile, the guy pushes a drink to the window and called my number. I checked my receipt and confirmed I ordered medium so I told him so. He then dumps the small drink in a medium drink and pours more milk in it then left. A girl comes by so I asked if she can check that it's decaf. She goes to the guy and asks and he responds to her in another language then puts the drink infront of me without making eye contact or answering me so I asked again and he said yes with his back to me and left. Totally didn't give me any confidence inis answer and when I tasted my drink, all I tasted was milk. Where's my coffee? My husband got the peppermint hog chocolate but didn't try it before we left the shop. By the time he tasted it as we were walking, he couldn't even drink it. It was so sweet like they dumped half a cup of syrup into it. Very disappointing experience to say the least", "author": "Rainie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "I would have given this place five stars if we hadn't ordered the matcha green tea latte - Do not order it.  It had  a fishy smell  and taste to it. It was not drinkable. We threw it away about a block down the street and my friend was left without a drink. I fortunately order the Biscoff latte which was delicious and tasted just like the cookie. Too bad my friend didn't have the same experience as myself.", "author": "Lupe S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-04", "description": "We passed by a few Starbucks on the way but thought we would try something different. I was sadly disappointed. If you go here do not expect Starbucks quality. I would never buy from this place again. The ice coffee was served in a regular paper cup that got soggy fast and the drink was not good I actually threw it out.\n\n\nThank you for commenting back on this review. The overall flavor of the coffee was not good. The cup issues detracted from the experience but was not the main reason for my rating. I do like the free cookie though.", "author": "Christina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "My favorite cookies has it's own cafe!! Yes please! My first taste of Biscoff  was on an American Airlines flight. I was so excited when my friend and I stumbled upon this place. The cafe is located at Pier 39 touristy area but it's a must stop to get a hot beverage, they also have a kiosk at the pier. When you order a beverage you get a free biscoff cookie.  \n\nI ordered a mocha latte and my friend got a cookie latte both latte was good, but the star is the cookie. If you check in on Yelp you get a free mini biscoff cookie butter! You can get a variety of cookie packages to choose from if you choose to purchase cookies and since it was Christmas time they had Santa cookie shape 3 pack packages great for giveaway.\n\nSo happy they have a stand wished they are located in more cities.", "author": "Julie Ann I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-25", "description": "Walking around Pier 39, we decided to check the Biscoff Coffee Corner. \n\nWhenever we think of Biscoff, we remember first trying them on certain airlines that offered these cookies. Their cookies are delicious, crisp with a caramel flavor. Pairs perfectly with a cup of tea or coffee. I appreciate that they are made with all natural ingredients, using no artificial colors or preservatives. If you enjoy Biscoff cookies, give their spread a try on some bread. So good! They offer coffee, espresso, hot chocolate, pastries, fruit smoothies, and plenty of Biscoff cookie products. \n\nYou will get a complimentary Biscoff cookie with every coffee beverage purchased at the café.", "author": "Kimberly J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "I believe that Biscoff made the original cookie butter. The little store carries different varieties of cookie butter and even Biscoff coffee! The man working at the counter was super nice! He gave my sister and me a sample of cookie butter. We ordered a Biscoff latte, which was very rich. It came with a free Biscoff cookie which was nice. Don't forget to check in for a free pack of cookie butter!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-10", "description": "Quick and easy place to grab coffee at Pier 39. \n\nI loved that you got a free mini cookie butter with a check in here and actually bought a biscotti to dip it in. The coffee was average but the pastries and biscotti were really great. I regretted not buying a street waffle once I tasted how great our friend's waffle was.", "author": "Caitie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "When I'm in this area, this is a great spot to get coffee, hot chocolate, cold drinks, etc.\n\nAlso, if you \"check in\" on yelp, you get little treat. The workers are very nice too. This place gets packed, and a little narrow, but it's worth getting your drinks here. :)", "author": "Jocelyn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-11", "description": "Honestly, this place was CRAZY DISAPPOINTING!!! Like honestly probably my worst coffee experience. My best friend and I both tried the cookie latte. She said it was delicious but definitely sweet. I ordered mine half the sweetness with soy milk, and my best friend added white chocolate syrup to hers. \n\nWe ordered together, and she received her drink. And a LOT of other people received there's. After about 5 minutes, I asked the girl. She requested to see my receipt stating she didn't get a ticket, no problem... I had the receipt. \n\nSo she makes about 5 more drinks prior to making mine. Then when I receive it, it's cold. I asked her if she could just throw it in a microwave or something and she apologized stating she forgot to steam the milk. She remakes the drink.... and really, I had to throw it away. Which for me to throw away coffee.... it was syrupy thick, like the consistency of pancake syrup and was disgustingly sweet. It was just ironic my friends was less sweet than mine and a normal consistency and she added an additional sweetener. \n\nNot a good experience. I definitely wouldn't come back.", "author": "Brittany N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-21", "description": "I can not believe I paid $2 for 2 ounces of mediocre espresso. Never again!\n\nThe little cup was not even half full.\n\nUpdate: OK I was a bit harsh but when I saw the small cup at the register and then got a tiny Dixie cup I was not happy. The sign was misleading but the portion was normal for espresso.", "author": "Joel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-03", "description": "We actually came to this location for something cold to drink before our dinner reservation. Surprisingly, there aren't many places that offer anything cold (on the pier), unless you want ice cream of course. \n\nService was ok, once you order you wait outside. I tried the mango orange frozen drink, it was a little pricey, but at least it was good! I love Bischoff cookies, but I didn't see any reason to buy any this visit when I can get them locally. I didn't notice any really great deals on the cookies.. \n\nI was a little disappointed after having dinner at Fog Harbor we got a 20% off coupon for this place.. sure would have come in handy.. ah well.", "author": "Mary P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "OMg I'm not a real coffee drinker but their vanilla lattes are amazing.  I met two friendly Italian women there and I believe generally they probably have better coffee... anyway.  The medium vanilla latte was perfect both times I ordered it today.  If I could have gotten a third one - I would have.  Not too sweet and lots of milky froth at the top.  Who would want anything more?", "author": "Deanna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-21", "description": "Nice little walk-up coffee shop on Pier 39. Much better than any of the nearby alternatives if you are looking for a good coffee experience. You order inside and then pick up at the window outside. No place to sit, just grab and go. It's usually pretty busy. I ordered a shot of espresso and a nonfat latte. Also got a blondie. They have quite a few sweets if you need something to compliment your coffee. Coffee was great and I enjoyed the experience. Go here for coffee on the pier!", "author": "Nathan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "This shop is small, right in the front of Pier 39, easy access for the morning goers to get a cup of coffee and pastry to start the day. \nThey have a small Krispy Kreme booth inside but it doesn't look like Krispy Kreme donuts... those are huge and bulky and not smooth like 'normal' KK donuts, nor does it taste the same ... \nTheir coffee menu is limit, don't ask out of the menu, because they don't have it, don't make it or don't know how to make it \nTheir pastry's are limited too with cheesecake muffin, pumpkin spice muffin, blueberry bread crumb muffin, some bagels, carrot cakes, ham & cheese croissant, chocolate filled croissant (not sure how often they change it or get fresh ones or where they get it from) \nService is nice, 2 registers, you wait outside for your drink \nMy friend ordered 2 smoothies, a berry one and mango one \nI dislike the straws ... it's paper .... ewwwwww \nIt starts to flatten and I taste the paper ... and you can't even twirl the straw to mix your drink! \nPlease change it back to plastic straws \nChanging to paper straws doesn't make it environmental", "author": "Fiona B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "This Biscoff Store made me so happy!!! I LOVE BISCOFF!! While waiting for our dinner reservations at Pier Market we indulged in a little hot coco to warm up at the Biscoff coffee cart. The girl was so sweet too.", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-16", "description": "I love the cookies but the coffee here is terrible. I purchased a couple of cold brews and they were weak and smokey. Not worth the price.\n\nFyi: they charge 3% healthcare fee", "author": "Mark J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "Was a freeezin summer day on the Pier and was looking to warm up with a nice hot drink. My and the kids got ourselves some Hot Chocolate and a coffee..... and I was hugely disappointed. A few years back, this place was gourmet standard. I wonder what happened :(\n\nThe Hot Chocolate had zero richness.... and it tasted like something out of a vending machine. The Salted Caramel Latte was SO SO SO SWEET. I couldn't stomach it. Had to throw the whole cup away.\nWhat a pity...", "author": "Alexandria L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "I love Biscoff cookies and coffee so when I found about the Biscoff latte I could not contain my excitement! This review is specifically about the biscoff latte, Ive had it iced and cold both very good but I think i like it iced better. Its not too sweet and has  nice balance between the coffee and cookie flavor. Whenever Im in the area I always try to stop by since its the only one in SF!", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Delicious latte, well made and the biscotti cookie was a nice touch. The barista was approached by two small girls, maybe 5-6 years old asking for cookies, she obliged and it was very sweet!", "author": "Amber P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "I am from L.A. I purchased their cookie butter as a gift from San Francisco, but apparently world market sells them cheaper . They give you a free cookie if you order a drink. They charge 10 cents for a bag.", "author": "Jhoanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "Yes, yes, yes AND yes. I could leave this review here but I won't. How did something as perfect as a Biscoff cookie get infused into coffee?!?!? Idk but had to be magic!\n\nThis little shop had a line (as anywhere else would on Pier 39) but it was so worth it. The pricing of the coffee drinks was reasonable (unlike the biscuits or donuts). They have little Biscoff tins on display as well as a case of Krispy Kreme donuts. The pickup window on the outside, a rather ingenious idea for a crowded place, helped keep the traffic inflow organized and convenient for pick up. \n\nThe coffee was piping hot and freshly made. My FAVE part is that they give a little biscuit with your coffee! The Biscoff coffee has those wonderful cinnamon notes - similar to pumpkin spice flavored coffee. \n\nI wish I was a local so I could keep coming back!", "author": "Anita N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-27", "description": "Checked in and Jose was a total ass about it. He even tried to take the sample away from my 2 year old.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "Tried to buy a drink from here. Not only did they get the order wrong but they did not apologize and furthermore were exceptionally rude about changing it. In the end all the barista had to do was add some syrup to the drink she had just made but she acted as if we owed her a living. \n\nAppalling customer service. Will definitely not be coming back and kudos to the rude barista for ruining what was an otherwise beautiful day on the pier.", "author": "Emily B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-04", "description": "The coffee was good but the barista was very rude. We took a little while to pick up our coffee and that irritated him and he ranted at us not once but twice. Very poor service!", "author": "Jash B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "My husband had the Cafe Americano and I had the hot apple cider.  A nice warm treat before heading back to the ferry.  Favorite part was getting a free biscuit with each drink.", "author": "Lydia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "I could not help but stop and try their Biscoff latte, actually once I saw that they have a large selection of specialty lattes, I went with the snickers latte and had my husband get the Biscoff.\nService was nice, prices fair and our drinks came out quickly and were perfect.\nGood coffee, excellent flavors, tasted just like a snickers, perfect for a cool and window day while shopping in the area.\nA free cookie with every coffee is also a nice gesture and matched perfectly.\ngreat stop while strolling the touristy area.", "author": "Nijole T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-29", "description": "Their Biscoff Latte was nothing to write home about. I thought it was pretty lackluster and the Biscoff flavor was extremely subtle to the point where you could barely taste it. However, their Coco Loco smoothie is delicious! Their Biscoff Brownie looked delectable on display, but it tasted okay.", "author": "Jamie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-28", "description": "I got a biscoff white chocolate syrup latte. Absolutely delicious from start to finish. Took a small while to get my order, but staff was friendly and patient with me.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "Today I was on the pier and I decided to go to the famous Biscoff Coffee shop. I was greeted by the lovely Grace who was so helpful while I decided on my order. I didn't want a hot drink as it was very warm so I got an iced coffee. The positives were that the iced coffee was delicious and lived up to its name. I would love to go back before my trip here is over. But I was shocked to receive my iced coffee in a take away coffee cup usually used for hot drinks. I couldn't use a straw when drinking it and I ended up drinking more ice then coffee at some points. Great customer service but poor product delivery", "author": "Shaun O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "My mecca! I wish this were in more cities! I had the Biscoff brownie and Biscoff latte best I've ever had... in my life!", "author": "joanna a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "When I fly Alaska airlines, I always look forward to the flight attendants handing out a little Biscoff coffee! So having a Biscoff corner in SF is a real treat! Every time I visit Pier 39, purchasing a warm cup of coffee is a must during a windy day. When you order a cup of coffee they'll give you the cup to fill yourself with the coffee flavor of your choice. You can choose from their regular drip, decaf drip, or my personal favorite: their regular dark roast infused with Biscoff Cookie flavor!  A great flavor  o pair with the free cookie they give you with each coffee purchase. They have treats in the stir  available for purchase too :) quick service and nice staff", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-19", "description": "I love Biscoff, the cookies, coffee and their hot chocolate. Even though there are Biscoff cookies at Target in Los Angeles, we still stopped by this store to buy one and a hot chocolate drink coz it's so cold tonight at the Pier. Tonight though, I'm giving this location a 1 star. The star is for their goodies. The negative 4 is for the person on the cashier. He's bald, middle aged and rude!!! So he told me to insert the card on the credit card machine and hit green. I put the card in and before I hit the green the screen states Remove Card. So I said Oh and removed my card. While doing so he looked at me like judgingly and rudely and slowly said as of I can't understand English (I'm Asian) beeeecoooz youuure not leeezzzeeening to me and while saying \"hit the green button etc etc etc ... he was rolling his eyes too. I would have put him on his place but I understand that it's a long day. We are all tired but that is not how you treat a customer. I don't care if he's an employee or a manager or an owner, Biscoff you disappoint me. Another young guy employee was at the side door and I know he noticed that I got annoyed. Sorry Biscoff, you just lost a customer. Oh I know you won't feel one customer not coming back. But I hope you change your attitude towards customers may they be American White or other color.", "author": "Daisy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-26", "description": "REVIEWER # 141\n\nWhy has it taken me so long to discover this coffee luxury?! I am totally a huge fan of those samples Biscoff cookies that we get when we ride the Delta or American Airlines (you know what I am talking about people).\n\nI didn't know that there was a Biscoff Coffee Corner until I was looking for the top 100 places to visit in San Francisco and this was listed. Right near the Pier 39 this place is a tourist trap!\n\nI have to admit that I am not a coffee person but MAN this coffee is something not to pass up! \n\nDID YOU KNOW: When you order a coffee you receive a Biscoff cookie for free!! \n\nYou really can't go wrong with these delicious cookies and the store itself is really cute! They serve not only cookies and coffee but they also have cookbooks that they have in the store as well (Don't forget to pick up one), they also have Biscoff Cookie Butter which is delicious to put on toast for the morning! I promise you this is children's favorite with a PB&J sandwich. \n\nNear the coffee shop there are also some really cool other places to look at when at Pier 39! \n\n**Biscoff Coffee Corner Location: They are located at the entrance of PIER 39 on the Street Level.**\n\nREVIEW 128/196", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "The irish boy at the front was so cute and sweet i'd like to know his name. gluten free options available here and VERY GOOD", "author": "Kate K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "Their coffee is strong, their goodies are fresh, and they've got a selection of plastic-wrapped goodies for gluten-free and vegan diets. \n\nReally small shop, so don't expect to sit inside, and if you do, know your coffee comes out around the corner and you need to go outside and get it from the window. \n\nThey also have a coupon in the Fun Pack book you can get by checking in at the California Welcome Center.", "author": "Audra S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-27", "description": "The staff Vania gave exceptionally rude services. No thank you, no eye contact, no instructions of how to get the coffee. Didn't worth money.", "author": "Anna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "The hazelnut coffee was pretty weak tasting , but still good. I'll probably get regular coffee next time. But, you get a free cookie with the coffee. Delicious", "author": "David W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-19", "description": "Nice location on the pier has a variety of selections. I ordered a smoothie its was a little over priced but most smoothies are. The mango pineapple is mostly pineapple hardly any mango that I could taste anyways.", "author": "Diana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Tourist trap... Being at the wharf and all.\n\nPurchase a drink and you get a complimentary cookie.\n\nI ordered  the biscoff latte and drank 1/3 due to it being sweet. It was good but it's not for me.  I do love the cookies, though.\n\nNo line in the morning.", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "Visiting San Francisco, we wanted to try a coffee shop we don't have back home. We tried the Biscoff Latte that has their cookie butter mixed in. Also every coffee comes with a complimentary Biscoff cookie. The service was fine as well. We will come back on our next visit!", "author": "Jerm M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-02", "description": "Just bought 2 doughnuts and they charged me $9.50(before taxes)!!! At first I found it weird but got them anyways. Later when I looked at the receipt it says 2 carrot cakes. Very disappointed, to be overcharged for something so simple. Luckily I work with tourism and will make sure to tell my clients not to go there whenever I bring them to pier 39.", "author": "Julyana A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-22", "description": "They give you a biscoff cookie with any purchase! We just wanted coffee, so we got an Americano. It was quite good with the cookie.", "author": "Cynthia J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "When you are in SF's Fisherman's Wharf area and you are craving coffee, go to Biscoff Coffee Corner!! DON'T GO TO STARBUCKS!!!  \n\nGET THE BISOFF LATTE!!!! I got it with soy milk and it's delicious!!\n\nI love the free Biscoff cookie they give you with the latte too! It's awesomely good!", "author": "Alice X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "I'm a big fan of Biscoff Cookie Butter! When I saw the Biscoff Latte on the menu, I knew I had to try it!\n\nIt was simply amazing - creamy & delicious! And you can't forget about the free cookie with a coffee purchase as the icing on the cake. \n\nA perfect treat!", "author": "Genna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-09", "description": "So glad I got to visit this place! I love the cookies. I needed a latte and they were able to accommodate an almond milk one! Free biscoff cookie with it too. I also got this mouth watering waffle donut that they actually press for you to warm it up, and OH MY...... perfect \"Pre\" breakfast.", "author": "Kayla S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "YELP 365 CHALLENGE 2014-(245/365) \"Biscoff....Nuff' Said\"\n\nI'm a fan of Biscoff(crunchy) more than Trader Joe's Speculoos, so naturally, we had to stop in to check it out.\n\nBiscoff heaven here....Coffee, cookies, spreads...anything and everything Biscoff!\nI ordered an Iced Biscoff Latte since it was one of their best sellers according to the cashier. Each order comes with a pack of Biscoff cookies. SWEET! The Latte was delicious and it hit the spot!\n\nIf you park in the structure across from Pier 39, they have a Buy one drink, get one 50% off in the coupon pack that comes with your ticket. ALOHA!!!\n\nShaka Meter:  \\uuu/  \\uuu/  \\uuu/  \\uuu/  4", "author": "Nelson Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-11", "description": "Was fortune enough to purchase some stale carrot cake from this place to go. Didn't think the experience could get much better until they charged me for a bag. Luckily was able to wash down the exchange with their special coffee--this is one of the few places left in the city where you can still get it with that burnt, stale taste! Yum!", "author": "Danny B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-12", "description": "So lately Biscoff or the lotus is getting bigger since they've been adding them to a lot of stuff, and the point of visiting this place is to see how good is the lotus latte which it should be better, I was really disappointed with the taste, at least I've tried it but as a hot drink wouldn't recommend it, I thought first it was only my personal opinion but I asked my friend who has a good taste with coffee and he said the same thing, maybe they should try something else. \nit's good to try though if you're visiting, of course they have other things and maybe will come back to try the cookie but for sure not the biscoff latte.", "author": "Mishari A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "Update:\nThe owner/manager Bob contacted me regarding this experience and has apologized and asked for more information so that he could address the issue with the employees. I greatly appreciate him reaching out and trying to make things right, it shows that they do indeed have great customer service aside from that one employee. \n\n\nJust experienced the rudest service ever. Ordered just a regular coffee, which the customer gets themselves out in the lobby. They were out of two of the different roasts and almost out of the third regular, all that would've been left is decaf. \nWhen we let the barista know (dark messy hair, wearing glasses), she gave us a huge eye roll before replying a quick \"okay\" and going about her buisness. \nThey were also out of cream in the container, and had the quart out from the fridge sitting on the counter. I grabbed it to use it and the San barista got mad and snatched it away from me. Maybe you should keep all your items filled? Don't take your bad day out on me.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "I kind of expected a half-assed coffee since it was a stand on the pier...but to my surprise-- it was so freakin' good!! I ordered the small white chocolate latte and kind of expected it to be a little bitter and not even that much coffee.. but the size was decent for a small and the coffee tasted amazing. One of my favorites!! My boyfriend and I loved it.", "author": "Mary T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "The parking garage BOGO 1/2 off coupon was put to good use prior to our departure. They told me the discounted drink doesn't have to be coffee. Staff is accommodating and had smiles on their faces at 9pm on a Saturday night. I love interacting with happy staff, completely makes my day better. They give out a cookie for every drink they make. My peppermint hot chocolate was too sweet though. I love the crunchy Biscoff cookie spread! I get mine from Target though for a fraction of the price. Had no idea they sell a variety of gift items including chocolate spread cookies! Next time I'm in Pier 39 I'll take a closer look at the merchandise.", "author": "Kristine F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "We ordered a white mocha chocolate, pumpkin spice latte and a Krispy Kreme doughnut on sept 4 about 1030 am. Would not normally do a review on a coffee shop but if service is exceptional or really bad I believe it warrants a shout out to fellow helpers. \n\nCoffees were both to sweet. Cashier was fine but the person making coffee was very snobbish and rude. Actual interaction; excuse me mam are these my coffees, her- did you check your receipt? Me- oh ok well thank you have a great day. Her - look at us like we were Satan and continue cooking her toxic brews.\n\nUpdate 9-6-2016 - business manager reached out. Definitely will go back.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "-A killer cup of Biscoff coffee, made in house, with hints of gingersnap. After one warm and spicy sip, it will linger on the tongue and tingle the throat. Oh my!\n-A bite of crispy spice Biscoff cookie, and I knew it. This will be my favorite cookie of all-times, and I've tasted my fair share. \n-A spoonful of Biscoff Spread, now that is an entirely different level of deliciousness.\n\nPro tip: Every cup of coffee comes with free sample of a Biscoff cookie.\n\nBiscoff = Biscuit + Coffee!\nFive Yelps.", "author": "Sari A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-30", "description": "Had a white chocolate mocha, pretty much taste like bad gas station coffee. Definitely would not recommend anyone to drink this.", "author": "Aj R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-22", "description": "Barista enthusiastically told me that they could make an iced version of any drink on their menu so I asked for an iced-blended mocha with a funky monkey.  Even though I repeated my order 2 times, they messed up my order and gave me a regular hot mocha.  When I brought it up, they decided to fix it by icing my drink by pouring it into an ice-filled plastic cup.  That coffee was awkwardly warm and disgusting.  The funky monkey also tasted very funky in a bad way.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Must try the hot biscoff cookie latte!! Delicious! Been to SF many times, but first time trying this coffee shop out while waiting for our reservations at the Fog Harbor fish house. The latte came with a complimentary biscoff cookie. The cookies were so good, we actually bought 3 bags worth to take home. I also wanted to try an iced version of the latte, but the manager/worker actually told me that hot version is way better. Took an Uber to come back here the next day before flying back home just to get another latte! Yup it's that good!", "author": "Carolina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "Good place to enjoy the chilling weather with their hot nice coffee. \nPS. Must try their bestseller biscuif coffee", "author": "Jatin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "Every morning I arrive to work, I start my day with coffee from Biscoff. \n\nMy usual morning order is coffee and a wonderful blueberry muffin. Today was different.   Biscoff now makes a fresh Belgian \"street waffle\". \n\nWhat makes this waffle so special?\nFirst, it is made from a dough, not a batter, so it is a bit denser than a thick and fluffy waffle that I was used to.  Also, there is pearled sugar in the dough which brings this wonderful sweetness not only to the outside, but to the inside as well.   I was comparing this to the waffle I got at another coffee place along the Embarcadero.  \n\nThe fact is, there is really no comparison.  This waffle is the perfect portion size, wrapped with a serving tissue and a couple of napkins.  It is sweet, mildly sticky, the right amount of crispness and makes a great treat for any beverage that is sold at Biscoff.", "author": "Scott A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "Fell in Love with the cookies on United... now we're hooked from Fl to San Francisco to find this house of fresh love!", "author": "Carla T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "Cool coffee spot in that it offered a lot more than just coffee, such as smoothies and frappes and lots of other pastries and drinks, plus all orders come with a free small biscoff cinnamon cookie! I only got the hot coffee, which was good, and real cheap, if I'm ever back I'll try some of the more exotic items", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-21", "description": "BISCOFF has been hands down one of if not my all-time favorite COOKIE !!!\n\nI once had one on an international flight during business travel which was so delicious, I was inspired to keep the wrapper for my whole trip and then do research on what this BISCOFF cookie was, only to discover it had a distribution location in San Francisco. \n\nI had gone to the North Beach location and also signed up for their corporate gift catalog, and most recently found the retail location in the Pier 39 area.\n\nI think the individually wrapped cookies are good to keep 'em fresh and also institute portion controlling, since they're so easy to eat.\n\nI don't know much about coffee, since I don't drink coffee, but know they do give a cookie with every coffee purchase and also sell the BISCOFF cookie in packages of varied sizes and quantities.\n\nSo, my * * * * * recommendation is based off of the BISCOFF COOKIE Brand.\n\nThe cookies remind me of molasses or ginger bread type cookies, and are crispy. \n\nThey even have a \"Spread\" (similar to Nutella or Peanut Butter) that tastes just like the cookie.", "author": "Rick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-13", "description": "I had forgotten that my husband and I shared a coffee from here on our last trip to Fisherman's Wharf (back in December). \n\nCoffee wasn't amazing, but it was decent and prices weren't too jacked up considering the location. They had some quick breakfast items to go which also were decently priced. We had already eaten so didn't need any of those. \n\nExtra star for the free cookie. And they even gave an extra so that we could give both kids one!", "author": "Nora S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "This is a nice place to grab a cup of coffee. The price is average, but the coffee is good and comes with a free biscoff cookie, which is great!", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "Got a soy sugar free vanilla latte and it was amazing! They also give you a free Biscoff cookie with each drink", "author": "Gina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "A few years ago, during a trip to San Francisco, I left my hotel in the morning and came back in the afternoon to find my room neatly cleaned. Placed on the pillow of my bed was an individually wrapped Lotus Biscoff cookie. For the most part, nothing seemed out of the ordinary. But, upon closer inspection, it was one of the best cookies I've had in my life.\n\nLabeled as \"Europe's Favorite Cookie With Coffee,\" it has a crunchy texture, with a unique caramelized flavor. More commonly known as Lotus Speculoos (a Belgian specialty), they are a type of shortcrust biscuit. They became really popular in the US during the 1980's, when they were served as treats on domestic airline flights. \n\nThe unique taste stems from the sugar's caramelization during the baking process, along with a hint of cinnamon and other spices. Biscoff Cookies are made with no artifical colors or preservatives, 0 grams of trans fat and cholesterol per serving, non-GMO ingredients, no nuts, and no animal by-products.\n\nI guess in San Fran, you can find almost anything, so I was shocked to find a Biscoff Cookie Corner on Pier 39, near Fisherman's Wharf. On a cold day, it'll be worth your time to purchase a cup of coffee, since each one comes with a FREE cookie. The store has other things too - Krispy Kreme doughnuts, smoothies, pastries, cakes, soda, water, juices, espressos, and other specialty drinks.\n\nI swear that the Biscoff Cookies pairs well with any warm beverage. My family thoroughly enjoys them in the morning, especially my little nephew. If I leave any at the house, he'll find it and will try to devour them all. Kids - I tell ya. \n\nIT WAS ME, I ATE THE LAST COOKIE\nThe Lotus Biscoff cookie also has a version with a layer of chocolate. If you're into spreads, they sell a creamy and crunchy spread too - perfect for toast. Here's their website for some online shopping. (http://www.shopbiscoff.com) If you're still not convinced, check out your local Cost Plus World Market. That's where I go to recharge when I'm dry.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-15", "description": "Stopped by this place while I was visiting the pier with my family. Got the biscoff latte. Wasn't anything special, just had a hint of the biscoff cookie flavor and tasted like milk mainly. Service was nice though and they were very quick.", "author": "Audriana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-13", "description": "Awesome coffee..comes with a complimentary biscoff cookie..my all time favourite  cookie...we stopped by got a couple of packs of the cookies for home and coffee and drinks for a cold Christmas eve in Fisherman's wharf...", "author": "Sivaram V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Oh. My. God. I love biscoff so much. I had no idea they had a coffee spot like this! I got a biscoff latte and it was just incredible. So sweet and SMOOTH! also, they give you a free little biscoff cookie with your drink!", "author": "Jessica G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-18", "description": "Such a touristy rip-off... our office is located across the street and I stopped by to get the cookies and a cup of Americano.  Got  also attracted by the pastries. The bill about 2-time as big as Starbuck and quality is 2 as bad (sorry, Startbuck, love you dearly, but we know, quality is not your thing, but this place managed to make it even worse)! \nNever again!", "author": "Marianna K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "I love their Biscoff Cookie coffee!\n\nWhenever I go to pier39 , I always stop by this place", "author": "Yoon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "Getting a free cookie with your coffee?  We did!  The prices are reasonable and the service is great.  We were there pretty late on a Tuesday night and they didn't turn us away with falsehoods like \"Sorry, our latte' machine is broken and we've run out of coffee\" like Peet's in Berkeley has.  \nPlaced our order, two flavored fun latte's and two free little cookies to go with them.  We also had a coupon from the parking garage to buy one, get one 1/2 off.  Overall, a great find.", "author": "Reba Jane S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "Biscoff Latte.... that all I need to say for you to come over and ch`eck this place out. It biscoff cookie spread inside the latte. so when you drink your normal latte you enjoy the great taste of biscoff. \n\nBuddy of mine got the hot chocolate with the biscoff spread, which was not on the menu, and that was just out of this world, its like a desert coffee. \n\nalso if you park in the pier 39 lot, you sometime get a buy one get one 50% off coupon with your parking. \n\nAdditional tip: they give you a free biscoff cookie with your order. put the cookie in the latte and let it disintegrate, it enhances the taste so much more.", "author": "Anuj C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "Ever had those delicious sweet crumbly cookies in the airplane? Before airplanes got stingy anyway.. well they were probably a biscoff and you were wondering where to buy them. They are hard to find, but guess what, in the heart of tourist trap San Francisco, you can find a cafe that caters to your needs.\n\nOver priced? Check, but where else can you get a latte with biscoff spread in the drink!? They also have their selection of cookies, spreads and souvenirs. They also sell fruit smoothies, but you'd be out of your mind to buy it there.\n\nThe service is pretty terrible, and the line can get pretty long on chilly foggy nights, but when in town, do try it out at least once. \n\nBest part? Free cookie with your drink! Don't hesitate to ask for it if they forgot!", "author": "Bevi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-04", "description": "12/31/2015\n\nWasn't good chai nor the decent hot chocolate. I guess they are only good for the ginger/cinnamon cookies.", "author": "Hussam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "Amazing.  The hot chocolate is the best on a cold winter evening.  I had this one in San Francisco.  Right across from the best donut shop.  I highly reccomend this place to open up more of their stores.", "author": "Tishie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-03", "description": "Got the cookie butter latte w almond milk. It's really good except it wasn't hot at all. I didn't mind it because it's how I like my hot beverages but for those who needs it piping hot, then you wouldnt be happy at all ;) I love the cookie crumbs on top, it was a pleasant first sip surprise :)", "author": "Jasmine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "A great place to start off your visit to Pier 39, grab a cup of coffee and stroll the pier or enjoy by the sea lions (down by the end of the pier signs mark the path). One of the nice things is each cup comes with a cookie to enjoy along with your coffee. I love that they add actual biscoff spread to the drinks and not just some flavored syrup. It is a small shop, they sell the cookies and cookie spread, have some pasteries, and offer an array of hot coffee, iced coffee, and smoothies. You order inside and wait by the outside window for your drink, this really helps when they are busy. All in all a nice change from our regular Peets.", "author": "Lacy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-09", "description": "Everytime we come to Pier 39 I must make my Stop to get coffee.......It is a must when completing your night at the Pier......there are three things I come to Pier 39 for.....the crab sandwich......my latte.......and the nostalgia of the Pier and all that it has to offer.......I love coming out here and I always come here I finish my night with a great cup or coffee or latte.", "author": "Joy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "After 4th of July fireworks needed a coffee to keep warm. Line was long but two cashiers were moving the line quick! Prices are decent and comes with one biscuit with every coffee. They also sell krispy kremes but was sold out by then. Theres cookies and pastries also available. I order a white chocolate mocha. Was pretty good and not as sweet as starbucks. I am defin a fan however theres not many locations.", "author": "Thuyvi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Great coffee and great customer service. I will come back for sure. The cookies are the bomb too. I really recommend the biscoff spread", "author": "'Ronald C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-05", "description": "Totally average coffee and coffee drinks, but a surprisingly decent shop overall, given the location. You can't go wrong with Biscoff cookies anyway, and I love how they give you a free cookie with each drink purchased. A nice stop to make if it's chilly out and you're already venturing here for a windy cruise on the Bay.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "I've always loved Biscoff - especially when I'm on a Delta flight. Why? Because when that lovely flight attendants with their carts pass by, they drop off some Biscoff cookies to me.\n\nYou can grab some coffee, cookies, spread, whatever Biscoff fancy you have. Sadness that I couldn't bring an entire truckload home.\n\nI ended up with a peppermint mocha. The mocha is from Ghirardelli :) nom nom nom. The perks of being in San Francisco. This location is towards the back of Pier 39. \n\nBtw, when you order coffee, they give you ONE cookie to dip in the warm cup. :) Enjoy!", "author": "Mandi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-26", "description": "Service sucked. No eye contact, sarcasm, had to repeat order multiple times (poor attention). Not going back....too many options.", "author": "Beebs A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "First yelp!! \n \nI love \"lotus airline cookies\" \nI got a biscoff latte which it was DELICIOUS, best coffee drink i ever had. Friendly staff, thanks vanessita and ammy for extra cookies with our coffee drink\nWish i could catch everybodys names definitely coming back for biscoof and banana shoothie", "author": "Fabrizio P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-05", "description": "Wow --- a Biscoff STORE!!!\n\nYou never know what you may run into on these SF \"piers.\" \n\nI love the Biscoff \"airplane cookies\" and thought this place was going to be nirvana ... but, uhm, no. It may be a treat for the large number of people clamoring to get inside and beat the chill air (hint: use the side door peoples.) but sort of let-down taste-wise.\n\nThere was a Biscoff-\"flavored\" coffee that I was eager to try and it turned out to be a substantial let down. That coffee was really weak and more reminiscent of french vanilla than actual Biscoff. (insert sad face here.)\n\nStick with the regular coffee and the cookies on the side.", "author": "Ray B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-25", "description": "Congratulations- my first unpleasant review on Yelp. Waste of money. Ordered a caramel mocha and it didn't taste anything like it. It was like a latte with a slight hint of mocha and not a hint of caramel. Blah", "author": "Bev B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-04", "description": "Horribly rude service not worth the money. Try not to ask any questions or you might offend the coffee man tending to the coffee lids!", "author": "cassandra t."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-21", "description": "Service was rude and impolite. The sign and price tag states the spread was on sale for $4.95 but the employees states none of them are on sale. What's the point of putting a sale section if it's fake? At least tell customers nicely.", "author": "Lianne W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "Cute little coffee shop at Pier 39. I got a white chocolate mocha which was so yummy! My mom didn't like her chai tea but I thought it was good. Added bonus is that you get a cookie with every drink!", "author": "Ashley N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-16", "description": "Eh, nothing too special. We were roaming around Fisherman's Wharf and didn't realize how hard it was to find a coffee shop! Luckily this place saved us. I ordered a small Soy Latte and went around the corner to the outside of the building where they have the pick up window. Pretty smart process in my opinion. Service was fast and the size of the cup was pretty generous for a small. I'm not sure if it's how all Belgium coffee places make it, but it did taste a tad bit diluted for my taste. I guess can't be too disappointed if its the only coffee option in the area.", "author": "Marissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-25", "description": "Labeled as 'The Airline Cookie'. The first time I had this cookie was on a Delta flight. My sister loved it so much, she wanted to find out where she could buy them. Fast forward 3 years, and you can now find Biscoff cookies at CVS and the like. \n\nWe discovered Biscoff spread while volunteering for a Chinatown race where they were a sponsor. There, they were giving away full-size jars of the cookie spread. My bf fell in love, and the rest is history. \n\nThe storefront carries these spreads, and in jumbo-sized jars, too. They have coffee beans, cookies in assorted packages for gifts, and even ones with chocolate. The real bonus is that you get a free cookie with your drink purchase.\n\nI would have to say the bf was on cloud 9 that day.\n\nTip: check the coupons that come with your parking stub for a buy one beverage, get 2nd for 50% off.", "author": "L T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-30", "description": "Me and my friends decided to grab a cup of coffee because we had a coupon on a buy one and get another drink 50% (thank goodness for that or else I would have never tried it out. \n\nSo, I got an iced vanilla latte. I was kind of sad because they charged an additional 25 cent to have it iced. I thought it was pretty good at first, but overall it was really sweet. \n\nMy friend got a mocha coffee. Thought it was pretty cool that they used Ghirardelli chocolate for the chocolate part, but honestly it tasted alright to me. \n\nIt was my first time there, so when people were saying you get a free cookie - you get a small bite size cookie. It was tasty, but I was expecting of an actually cookie. (Never tried Biscoff cookie until I tried that mini coffee.)\n\nOverall, it was decent. But I have tasted better coffee. \n\nCustomer service was your basic customer service, nothing extravagant.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-27", "description": "I stop by and grab a cup of coffee every now and again when I'm in the neighborhood. The staff are friendly, and service is fairly quick. \n\nThe coffee is a hit or miss.", "author": "Cass Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-05", "description": "The person who took our order which I think her name is \"vania\" based on her name tag was very rude and and screamed at us repeatedly while she was getting our order. Her Colleage was also weird when I asked to confirm her colleague's name and refused to confirm the cashier's name until we asked the manager for the name. It is not the customer's fault when you hate your job or having a bad day. If people maintain professional behavior instead of taking their anger out on customers it would be great.", "author": "Parastoo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-18", "description": "Service is slow and stupid here - they got my friend's smoothie wrong and the smoothie girl didn't believe me until the Mexican guy double checked after thinking to ask for my receipt.  He admitted to the mistake but didn't do anything about it.  Touristy places always have bad customer service since it's like the DMV, the market doesn't require it to be in business.\n\nBut the smoothie itself was tasty (they got my order right).  It was a good size for $5.25.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-14", "description": "Was looking for hot chocolate in Fisherman's Wharf on a chilly and rainy morning in San Francisco. I'm a huge fan of Biscoff cookies but I wasn't aware they had any stores. The store banner promoting a free Biscoff cookie with any drink order sealed my decision to stop here and stop looking for another coffee  store. While nothing special, the hot chocolate was comparable in quality as Starbucks or the nearby Ghirardelli's. Took a lot of willpower to not buy any of the store merchandise!", "author": "Allie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "I can't drink coffee but cashiers suggested BISCOFF HOT CHOCOLATE omg  the best. Best drink I ever had. Staff was very friendly a bit pricey, only one little table but still a good place, FRE COOKIE So glad I got to visit this place,", "author": "Ashley D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Cute little coffee place. Cookie nice. I like the caramel coffee and they have a lot of little goodies to bring home", "author": "Stuart K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-03", "description": "I came here for a coffee with my sister the Friday after Thanksgiving. We both knew this place was a tourist trap but badly needed an influx of caffeine.\n\nI ordered a Mexican mocha and my sister ordered a Redeye (drip coffee with an extra shot of espresso). The ordering process was fair enough and we were told to go to the window to pick up our order when it was ready. This is where the problems began.\n\nApparently drip coffee is self serve there and the people making the coffees did not get the memo regarding my sister's Redeye. A man behind the counter brings my Mexican mocha but no Redeye for my sister. I try to get his attention to let him know that we are missing something from our order and he flat out ignores me. My sister tries to flag him down as he is walking around back and he flat out ignores her as well.\n\nI am kind of puzzled at this point. Is he deaf? Should we try sign language?\n\nFinally, as he calls out another order number and walks back to the window my sister is able to tell him that she is missing her coffee. In a very annoyed tone he says, 'You're order XXX right? You got your coffees'. When my sister tried to argue, he holds out his hand and demands to see our receipt.\n\n2 seconds after scanning the receipt he calls out to one of the employees to make a Redeye. No apologies, no nothing. He doesn't even give her a Biscoff cookie when her order finally comes out. \n\nI really don't understand what the guy's problem was as it was not particularly busy (not many normal people are jonesing for coffee at 8pm). We decide not to let the jerk ruin our evening with the family and just decide never to go there again.\n\nPS: My Mexican mocha was pretty lame. I've had better Mexican coffee at gas stations in the Central Valley.", "author": "Daniel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Great little coffee shop. Went here just after arriving at Pier 39. Needed coffee badly. Decided to go there instead of Peet's Coffee next door to try something new. THE BEST CHOICE. Ordered a simple iced coffee and it had great flavor. I put a single pack of sugar in the cup but didn't need it. Went back later in the day and ordered another cup. Friendly staff.", "author": "Kristofer D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-13", "description": "Coffee??? Hahaha! WORST coffee in the world! I had a cappuccino and there was 0 coffee in there! Just frothed milk. I stirred it for 2 minutes looking for the coffee but it was nowhere to be found. Shop looks nice but there's morons running the joint. Cheap labour, no skills.", "author": "Joseph T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "I've always been a fan of the Biscoff cookies so Imagine my surprise when on our first day in Pier 39 we see a Biscoff store. They have different types (I only knew of one) with milk chocolate and dark chocolate and they even have a biscoff cookie spread. I can only based my review on the hot chocolate that I had which was pretty good and best part they give you a free cookie.", "author": "Zaida C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "The cookies here are so addicting and delicious! I always end up eating more than I should (4-6 cookies) when I grab a cup of coffee here. Plus, you get one for free how tempting is that. The coffee is pretty average not really amazing but not bad. The price for coffee is the cheapest you'll find at the pier one more reason to go on a chilly night.", "author": "Lainey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Their house coffee was one of the best I've had. There's no where to sit, you have to take it to go. The give you a Biscoff cookie to go with the coffee.  The pricing is comparable to neighborhood coffee shops, very reasonable being at a tourist spot. I'm craving for more as I write this review.", "author": "Analise A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-18", "description": "Our first time trying this place out. We decided to go after going to wipe out since they have 30% off coffee. Honestly the coffee isn't good we got white chocolate iced mocha and it was way to sweet. I also got a funky monkey blended ice coffee which wasn't bad. The cashier who took our order was kind of rude and rushing us (this is our first time here) and he kept starring at me while this other girl laughed. Also our iced coffee was warm. Don't recommend.", "author": "Francisco H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-12", "description": "After too many Irish Coffee's the night before I needed some coffee to clear some cobwebs. They brew San Francisco Coffee Co. beans and sell an assortment of City Baking Co. pastries. My bear claw was dry and not good but you get a complimentary Biscoff cookie with each cup and those are  caramel-ly awesomeness.", "author": "Josh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-22", "description": "After a failed run on the golden gate bridge (wayyyy to cold!) my husband and i decided to spend our last morning on pier 39.\nBecause im from hawaii and this 54 degree weather was seriously icicling me, i caved and got a biscoff latte to warm me up.\nSeriously, this was the best thing i had the ENTIRE trip in SF! And i had some good shit!\nThe free cookie prompted me to buy three giant packs, originally for my mother, my mother in law and myself.\nI turned into a giant pig and kept my mother in laws cookie pack along with my own, for myself. I only gave my mom her cookie pack because she house sat for me while we were away.\nSeriously, this latte is worth the calories, get it, and walk it off.", "author": "Ella A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-31", "description": "I was first introduced to this cookie on a Delta flight as a snack and fell in love. If you never had their cookie, it's kind of similar to a cinnamon graham cracker cookie. How excited was I when I found out they had a storefront at Pier 39 (it's right next to Hard Rock Cafe) when I visited several years ago! So of course, every-time I come to the pier, I have to stop by to grab a pack of cookies, a jar of spread or a cup of coffee. They have packages that have the cookies individual wrapped and even have some that are covered in chocolate! Talk about WIN!\n\nThey often have promotions with their items so be on the look out! One time they had a buy one get one free on their super addicting spread while another time if you spend a certain amount, you got an item for free. If you look on your parking ticket or if you get the Fun Pass from the Visitor's Center, there's a buy one get one 50% off a drink as well.\n\nTheir spread tastes just like speculoos spread and come in creamy or crunchy (which I always grab the crunchy one). Put it on your toast, waffle, eat it with a banana.. you just gotta try it!\n\nThe caffeine level of their coffee feels like a medium to me but they do taste delicious. I typically order the White Chocolate Mocha. When you buy a cup of coffee, they also give you a cookie to go along with it!", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-17", "description": "Wife went here to get a coffee for us to share.  She put cream (or half-n-half) in it because that's how she likes it.  I usually like my coffee black and dark-roasted, but even with the cream it was somehow still too bitter and burnt-tasting for me.  I couldn't drink it and had to find coffee elsewhere.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "This place is fabulous for a quick cup of coffee or light breakfast. I had the Biscoff Latte 2 days in a row. It was heaven! They also sell a variety of Biscoff products including Biscoff Butter! The fresh pastries are wonderful, especially the pumpkin cranberry bar.", "author": "A. K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-10", "description": "This is one of my favorite coffee places in the Bay Area.\nI never miss an opportunity to drink Biscoff house coffee every time I go to the city. The flavors are varied and smooth and the service mostly quick. i always drink their cookie flavor coffee but last time I tried cinnamon bun flavor. didn't disappoint. Like it for its unique flavors and rich taste.", "author": "Finla P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "Great Salted Caramel Latte. Sweet and balanced. The coffee was a good temp and did not taste burnt (which can happen often). I cannot have gluten and they were really good about being sure my drink was a perfect match. The free cookie was a nice treat for my husband.", "author": "Jules E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-19", "description": "They give you an awesome but small cookie to compensate for the watery coffee. Still, it's cheaper than Starbucks, so if you don't need a flavorful or strong coffee, you can try there.", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "Banana cookie butter smoothie...can't get any better than that! Plus, a biscoff cookie for every drink you buy? Score!", "author": "Dj F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "So surprised and happy to see this at Pier 39! I've never tasted their coffee before but i'm glad we took a chance. Ordered white chocolate mocha and it's sooo good!!! It came with a free biscoff cookie. I love freebies! Lol.", "author": "Kathryn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-06", "description": "THIS PLACE HAS SPECULOOS. \n\nBEST THING SINCE SLICED BREAD. \n\nI don't even like sweet things, but Speculoos changed my life!\n\nTrue story.\n\nIf you like Nutella (which is pretty much most people, am i right?), then you will LOVE Speculoos.  It is SO MUCH BETTER than Nutella.  What it is is basically spiced cookies smashed up into a spreadable paste, with the consistency of peanut butter. And you can spread it on your bread, fruit, or just eat it right out of the jar!  If you've ever eaten a liege waffle from a waffle truck, they probably have Speculoos as a topping option. \n\nIt's a pretty popular product in Europe, and I got hooked on this stuff when I was traveling around the Netherlands last summer, and when I came back home, I realized that this delicious item is VERY hard to find in the states - you pretty much have to order it online or import it.  \n\nBut if you live in San Francisco, YOU ARE IN LUCK.  This little random nondescript touristy store at Pier 39 has JARS AND JARS of Speculoos, ready for you to buy and consume happily.  It's $5.95 a jar, which is pretty decently priced in my opinion.  \n\nPlease go buy yourself a jar and ENJOY right away.\n\nYou can thank me later. ;)", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "This is our favorite spot to grab a cup of espresso while meandering in Pier 39. We have been here a couple of times and our experience has been top notch by far. There are no tables and chairs where one can ease off with a cup of hot drink, but we love to walk around Pier 39 during cold evenings with a cup of their White Chocolate Mocha. Service is friendly. They also carry other goodies.", "author": "Anu M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "Just get the biscoff latte. You can thank me later.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Soooooooo yummy. I loved the coffee I got. The staff was super nice. The prices are a little steep but there on the pier. Everything there is costly.", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Small shop but cute. Biscoff cookies are one of my favorites. I love them with tea & coffee. They had Krispy cream donuts which was a bonus along other pastries they serve. I ordered a large white mocha it came with 3 shots and it beats Starbucks and Peets Coffee. All coffees come with a free Biscoff cookie. If the shop is packed which sometimes it is they have a small cart at the end of the pier.", "author": "Jane H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "OMG!! Best hot chocolate I have ever had! My whole family each had one topped with whip cream and we all agreed....it was the BEST!  Perfect temperature, creamy, and flavorful.  \nPerfect treat to have after the tour of SF on a double decker bus =)", "author": "Erlinda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "Best coffee on the pier. This is always my last stop before heading home. Gives me something to sip on my long drive home.", "author": "April B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "Friendly staff and informative about the pier! They gave us extra cookies free with our drinks. Had the vanilla chai tea latte. Can't go wrong and it's an alternative to Starbucks!", "author": "Sofaking F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "I treated my Mom to a cup of coffee.. she ordered a cappuccino and asked me if it has whipped cream.. \"No, Mom.. it's basically an espresso shot w/ half steamed milk and half foam..\" I think she added a pack of sugar in it at the end.. service was really fast, it took them less than 2 minutes to prepare her drink after I paid. \n\nSodas and bottled waters are overpriced here but of course.. it's a tourist area so I skipped out on that but the Mississippi Mudpie Brownie was calling me so I ordered that too. The lady put the slice of brownie in a box and gave me a fork to go w/ it.. \n\nThere is a Yelp special but I didn't read on it further because my Mom wasn't going to order a caramel drink.. I paid $7 for the brownie (huge slice) and for my Mom's small coffee. \n\nThe brownie was super moist and not rich at all.. I don't know what makes them \"Mississippi\" but I gobbled the entire thing up last night and now I regret it utter-ably because my fat ass can never decline sweets even though I know that I shouldn't. \n\nSweets and pastries filled the pastry case, enticing me even after I left.", "author": "Tram N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-21", "description": "I love Biscoff cookies and was surprised to find this place tucked in Pier 39! The service was great and quick. All of the coffees come with a small Biscoff cookie (which is a plus for me)! We got the vanilla latte and it was delicious and perfect for the windy weather.", "author": "Daphne L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-20", "description": "The dinner place we went to at the whard offered a 30% discount on coffees at Biscoff which is across the restaurant..so why not....\n\nit was cold...the tree was just lit...... why not....\n\nSpecials on the Board... nomnomnom....\n\nMy boyfriend and got the Snickers Latte.....\nAfter realizing we both got the same thing, we walked up to the barrista and asked if she's started making our drinks yet....\n\nShe looks at us and says irritably.. \"NO. WHY\"...\n\ni said .. \"i was hoping we could change one of the lattes to a Toasted Marshmallow...if its okay\"....\n\nBarrista rolled her eyes.....\n\nGeeeezus..whatsup with the attitude???\n\nBad bad customer service.. Totally ruins the Christmas vibe....\n\nWOMAN! the gigantic tree was just lit!!! don't be such a scrooge!", "author": "Monica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-16", "description": "Prior to visiting this shop, my whole experience with Biscoff was getting their crisp gingersnap-like biscuits complimentary on airlines like Delta.  The biscuits were pretty tasty and addictive, but the reason I probably liked them had a lot more to do with how they were just there.  When you are stuck on an airplane for a few hours, any food feels like a special treat (kind of like Eddie Murphy's quote from Raw about if you're starving and somebody throws you a cracker - \"That was the best cracker I ever ate in my life.\").\n\nThis Biscoff shop dispenses coffee (a Biscoff cookie is free with each coffee purchase) and many different quantities of Biscoff biscuits (with twin cookies individually packaged to keep the intended crispness).  The prices were actually pretty reasonable and we were able to buy a good number of cookies for about $3.\n\nGood or bad, the taste is quite distinguishable (kind of like how the taste of a fortune cookie is immediately recognizable).  If you like that taste and find yourself at the touristy Pier 39 in San Francisco, you may want to stop by this shop for a reasonably priced treat.", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-16", "description": "Do you ever have a craving for those mini gingerbread cookies served on some airlines (i.e. Delta), but don't happen to be flying the friendly skies anytime soon? Well, fear not. Biscoff has arrived in San Francisco! \n\nI'm not sure when this cookie/coffee shop graced Pier 39 with its presence, but I happened to see about a month ago and knew I had to check it out the first chance I got!\n\nIt turns out that they serve a packet of their little gingerbread goodness with every coffee order. In addition, they have a wide selection of Biscoff cookie packages in all shapes and sizes, and a few other items (like an amazing Belgian gingerbread spread).\n\nI ordered the Biscoff latte. You're basically drinking Biscoff cookies with this. Boy was it fabulous! Not too strong, not too sweet. The small size was pretty large, so I definitely recommend being cautious of what size you're ordering. For $3.75 though, they are giving you your money's worth.\n\nI'll most definitely be back to grab some more cookies once mine run out. I highly recommend trying the gingerbread spread, which is like a Belgian spekuloos. It pretty much rivals (or complements, if you so choose) Nutella. :)", "author": "Mansi A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-21", "description": "Very rude service and not very good coffee. I simply asked what is in a certain drink and he replied \"look on the board behind me\" well I didn't have my glasses at the time which is why I asked. And then the drink I receive was pure sugar... Yuck!", "author": "Brooke M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-01", "description": "This coffee is hmm mmm good! But their cookies!!!!!!!! To die for!!!!!!!!! I got a tip to stop in here while I was visiting the area.  It is located dead center of Fisherman's Wharf.  There was no long lines to wait in when I got there and everything was served hot and fresh.  I had to buy cookies to bring home for me and my co-workers!!!!! So if you are a coffee nut place this one your list :)", "author": "Connie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-16", "description": "Got a double Biscoff latte with soy because it was recommended on Yelp. Was disgusting, waste of $6. Tasted like watered down milk with slight coffee aftertaste. Cookie was good, but coffee went in the trash.", "author": "Matt D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "What can I say?  I LOVE this place.  Their house coffees are just as delicious as their lattes, cappuccinos etc... There are always at least three different house coffee blends you can choose and sometimes they will even offer an Irish Cream coffee or a Kahlua coffee right along with their scrumptious regular house coffee which tastes like their biscuits.  While were are talking about their biscuits, I am addicted.  Can never get enough of them.  And,  for you donut lovers they carry Krispy Cremes.   I can't wait to try some of their other treats as well.  It might be a small little shop but it's full of flavor and fun.  Friendly and helpfull staff as well.", "author": "Marie Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-30", "description": "\"I got 99 cookies 'cause a bitch ate one\" yep, that's me...the one that took the cookie. I LOVE these cookies! Dip it in your coffee and hold onto something because there's about to be a hot party in your mouth.\n\nThey give you one free cookie when you buy coffee. Stupid me already bought Starbucks, doh!\n\nBuy these cookies! I live in LA so I have to buy them for much more on Amazon...boooo. Please open a store near me.", "author": "T N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-08", "description": "Corner gets a cart.\n\nFew steps away: http://www.yelp.com/biz/biscoff-coffee-corner-san-francisco-2#hrid:xFMkFUrhUPai_qmV0GUxwg\n\nWalk towards the back of Pier 39 and you get a second chance at caffeinated goodness. Three bucks quickly became a smooth Americano with sugar free vanilla syrup.\n\nSpace might change. Quality stays the same.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-15", "description": "This is a great location and has the potential to be great but just wasn't. The food was okay, we got a blueberry scone and a ham and cheese croissant. The ham and cheese were in a gross brick form. It should have been melty and warmed up. The scone was good for the first bite before you realize the scone is actually cornbread with blueberries in it. The coffees were okay nothing too far wrong there. Place was a little unkempt and dirty but that could be from its location on the pier. It's saving grace was the employees. They were kind while taking the order, prompt and fast getting the drinks made and the food served. They were attentive, a barista noticed I was cutting the croissant and scone in half with a stirring stick and immediately brought me a plastic cutlery knife as there weren't knives on the counter where they should have been. It was a fine place to get a coffee on the pier, but definitely not very good. The employees made the best of the situation they had and made the experience much more positive than it otherwise would have been.", "author": "Sydney W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Located ideally on Pier 39, with another smaller outlet within a few blocks away. Delicious hot coffee served with a Biscoff cookie. Oh so yumm!", "author": "Stingaph G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "When your freezing cold at the Wharf this place always seems like a good idea. Coffee is good and you get a little cookie with it! \n- If you want something simple- get the House Coffee which is very cheap and you can pour from four different kinds, i like the biscoff cookie coffee!", "author": "Renu D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "Its funny how so many people used to think that Biscoff cookies was a granny cookie and didnt think it would be any good...\n\nLittle did they know.....", "author": "phillip w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-06", "description": "What a great little coffee shop. Good coffee & a Biscoff biscuit with every cup!\n\nAnd a pleasant welcome surprise? The prices include tax. Thus the total bill is always a nice round number. No pennies! I love it.\n\nSo refreshing. Why don't more places do this?", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-26", "description": "Favorite place to get lattes before my class right across the street~the matcha latte is really good!", "author": "Tina W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-30", "description": "The coffee was weak and the service was rude. If you can't understand mumbling you may be treated like you're stupid. Thumbs down", "author": "Cheren B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-28", "description": "I'm a vegan so I got the Protein smoothie. it's not in the least bit good. I don't no how the other are, but you'll regret getting the protein berry for $6. I only drank it because it was healthy and I didn't want to waste it.", "author": "Salihah M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-14", "description": "I went here today and the employees suck. I don't know if it was because it's a Saturday and they would much rather be some place else but not even a \"hello\" or \"how are you\" or even a smile? It was my 3rd time coming here and I ordered a smoothie this time. Drinks are great.", "author": "Jami S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "Toffee nut latte and pumpkin pie latte were really good! They're on the specialty drinks menu on the chalkboard on the back wall. Every coffee comes with a delicious cookie! If you park in the garage, there's a buy one get one half off coupon for it. Definitely recommended, especially on a cold day on the pier!", "author": "Joanne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-16", "description": "Yummy! I love their cookies. They have a taste to them that no other cookie has. Great with some creamy drink, like hot choco or a capp. Unfortunately, cookies and coffee is pretty much all they have.", "author": "Debbie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "Good peanut butter shake.  A really horrible person in front of me.  I'd go back if that customer wasn't there", "author": "Rena A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-30", "description": "The mocha was ok, and all coffees come with free 2 packaged cookies. The cookies tasted good, although I thought their sign had said free biscotti, but I must've either read it wrong when I glanced at it or maybe the definition of biscotti is different that what I thought it was or maybe it was their brand biscoff cookie.", "author": "Tiffany Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-10", "description": "Gosh I love these lil biscuits.  The first time I had them was on a flight and since then I came across them @ Walgreens.   \nSo I was a little surprised and delighted to see the coffee shop.  I didnt stop in there but I bought the coffee at the kiosk.   The coffee was just ok and it came with the biscuit which is dippable bliss.  It's more than \njust a ginger snap and I find them easy to end up scarfing down more than one. \nThe woman at the kiosk wasn't the friendly so that sucks, otherwise I'd give this place a 5.", "author": "Toshi I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-29", "description": "Coffee was really bland and bad. Not a good latte at all. They don't accept card and the cash register was broken so they asked if I had a pen to write the order down. So... Nope.", "author": "L.J. G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "Great place to eat the famous airline cookie and drink coffee, while walking around pier 39's view.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-24", "description": "Pretty impressed that we even have a Biscoff store.... This is the newest craze brought to us from Europeans... Closely related to Nutella... MMMMMM got to love spreads... As far as their coffee goes.. it lacks flavors but does the job when your cold.", "author": "danielle s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "Great spot to stop and get coffee on the pier!  At less that $2 a cup with a FREE cookie,  how can you go wrong?  They also serve Krispy Kreme donuts too!  Wish there were more Biscoffs around instead of Starbucks. They apparently are popular in Europe. Even heard the cashier speak Italian to the tourists in front of me.", "author": "Elizabeth V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-10", "description": "Nice place to stop by for a warm drink on Pier 39.. \nThey give you a free mini cookie to enjoy with your coffee.\nService is fairly quick. \nMy vanilla latte was kinda watery. \nI would go back to try their Snickers Latte though!", "author": "Allie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "Good coffee.  Had biscoff latte the first time, vanilla bean latte & chocolate chunk scone the second time! I approve. Cost as much as any Starbucks or Bigby.", "author": "Tracy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "First, let me say that Biscoff spread is literally the best thing I have ever tasted. If you haven't tried it, and you like sweets, you simply must try it. It goes on fruit, bread.. straight on your tongue....\n\nAnyway, back to this particular shop.\n\nLast time I went to this place, I got a biscoff cookie, a strawberry smoothie, and a jar of spread to take home. The cookie and spread were heavenly, as usual, but the smoothie was just average. My boyfriend got the coffee and said it was good, and of course it's a plus that the coffees come with a free cookie.", "author": "Amanda O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-10", "description": "Everyone raves about the \"free biscuit\" with every coffee. It's a freaking ginger snap people! But, it was tasty, I'm not going to fib here.\n\nPrices posted do include tax, pretty amazing.\n\nCoffee itself, not so much. I had the mocha, and I guess I got what I paid for and where: Fisherman's Wharf, possibly the most impossible place to get quality food in all of SF.\n\nWhat's more, is that it seems to me that Biscoff is Fisherman's Wharf's omnipresent Starbucks. Even on the west side of the wharf (where the walruses/otters oaf about and bleat to the delight of idiotic tourists), there was a hot dog stand version of Biscoff as well. I think that trumps Starbucks: 2 locations within about 30 yards of each other.\n\nBottom line: syrupy, slow service but oddly satisfying (enough).", "author": "Davey R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "They didn't forget my cookie today!! \n\nI'm glad they also finally asked if we were AAU students (for the first time), so we got a little discount! \n\nOverall, great coffee and service. Drop by if you're in the area for a pick me upper!", "author": "Karen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "Craving a good cup of coffee while visiting Fisherman's Warf we stopped at Biscoff's and were not disappointed.  A really good cup of coffee with a complimentary tiny Biscoff Biscuit hit the spot.  A MUCH better cup of coffee than Starbucks and at a very decent price!!  I love it when an establishment at a very touristy spot doesn't try and rape you on the prices.  We enjoyed it so much that we stopped back a second time.  If you're craving a good cup of coffee while visiting SF, stop into a Biscoff's.", "author": "Patricia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-17", "description": "I'm not a big fan of hot coffee drinks, but the white chocolate mocha was S0 G00D!!! I'm glad that my friend wanted some coffee after dinner and the waiter at Luigi's told us to come here because it was a great ending to a night at Pier 39. The biscoff biscuit is super yummy too. If you're at Pier 39 on a chilly day, make sure to stop in here and warm up with one of their drinks!", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "I bought a gluten free brownie and mocha here. Mocha was ok but brownie was very good. It was egg free, gluten free, dairy free and was still moist and tasty.", "author": "Laxmi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-22", "description": "At first when I saw the \"BISCOFF\" sign instead of the usual San Francisco Coffee Company sign I've been gravitating to over the past decade at  Pier 39... I freaked.  I mean.  O-M-G FREAK OUT!  I could have gotten my Mocha WAY earlier, but I had saved myself because I knew I could count on a delicious Pier 39 Mocha here at SFCC.  Biscoff was a familiar name, but I couldn't remember why.  \n\n...until I stepped inside.\n\n\"Oh, BISCOFF Biscuits!\"  \"HOLY CRAP those things are SO GOOOOOOOOOOOOOOOOOOD!\"\n\nCan't believe that something I had to hunt down like a psycho years ago after having them on the plane and special ordering them over the phone after calling the airline - they are HERE in SF... at Pier 39!  YUMMY! \n\nAnd the bonus to this little story?  It's still San Francisco Coffee Company Coffee!  YAY!  \n\nIt's a Win Win!  A Caffeine Cookie concoction!  I am excited and now have ANOTHER reason I love to visit Pier 39!", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-01", "description": "White chocolate mocha!!!\n\nAnd make sure you try those Biscoff cookies.  Super delicious!  You can't quite explain what it tastes like/  Hmmm.", "author": "Chai S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-29", "description": "Good coffee at the wharf.  And you always get a little cookie to go with your tea or coffee.", "author": "Marcus K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-25", "description": "Try the crunchy spread!\n\nFree cookie with a coffee purchase.\n\nCoffee is bitter if you like that type of flavor.\n\nLove walking Pier 39!", "author": "Realtor Karl B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-18", "description": "Convenient to the Wharf action (picked up a coffee on the way to Alcatraz cruise), quick, and free Biscoff with coffee! A little expensive of course bc it's in the Wharf, but not bad. Cappuccino and Hot Chocolate were average.", "author": "Farheen Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-05", "description": "So I avoid going to Pier 39 like the plague.  This time was different.  I see this place every morning when I run past Fisherman's Wharf and thought, \"hm, I wonder if they have it. . .\"\n\nThey DO.  JARS OF SPREADABLE SPECULOOS.  No, seriously.  Crushed-up cookie paste deliciousness for $5.50.  I squeaked.  Audibly.  Forget Nutella, forget peanut butter, forget anything else: this stuff trumps.  I giddily picked up three jars and got a coffee, which comes with a free cookie.  They also sell packs of speculoos cookies, but you can get them at Walgreens for cheaper, so I wouldn't bother.\n\nVegans, rejoice: their cookies and the speculoos spread are all vegan.  If you get an espresso drink with soy, soy will set you back 75 cents (rather steep in my book).", "author": "Catherine K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-16", "description": "Small place, but it's the bomb to get the biscoff spread. If you haven't had this before, you should try it. This is also the cheapest place to buy it. Usually it's available at specialty stores at a high premium for being imported, but this place sells a jar for $6-7. I believe they also give samples of it if you ask. \n\nThey also cater very well to tourists or even if you're a local. I guess they just assume everyone is a tourist so they will wrap your glass jar so it's ready for packing. How nice!", "author": "Beverly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-09", "description": "I was here couple weeks ago. The place is small and clean. They have a place to order indoors or a window to do it from outside. The service is quick. I ordered their mint tea which was decent. \n\nI was surprised to see a biscuit with  my tea when it was ready. \n\nOverall, I was pleased with visiting this place.", "author": "Anisha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-03", "description": "Coffee served with a side of Biscoff's famous Belgian spiced cookies.... not to mention a hearty helping of really bad attitude. Why do the people that work here hate their customers? On my last visit, not only were the cashiers not helpful, they were almost hostile to the customers.  They even got my order wrong!  That said, if you can stomach the bad service,  the coffee is good and the cookies are exceptional. All different types of Biscoff's speculoos cookies and cookie spreads are available for purchase, as well.  If you park in the Pier 39 Parking Garage, check your parking stub for a coupon.  It's buy one coffee drink, get a second coffee drink 50% off  (unfortunately they wouldn't let us substitute with juices and smoothies).", "author": "Emcee K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-23", "description": "The coffee is really good and the service is friendly. They have a Krispy Kreme doughnut case which is always great, but my fave part is the free Biscoff cookie you get with your cuppa joe! They are so good! Like, insanely good. I had to buy a pack of them the next day. They are perfect to dip in your hot coffee. \nVisiting the Biscoff Coffee Corner after dinner and taking a walk around Pier 39 was one of my favorite things about staying at Fisherman's Wharf.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "Great espresso, courteous service and very convenient location. The custard filled doughnut was OK but their cookies are delicious. We will definitely go back here next time we are in the Fisherman's Wharf area.", "author": "Carl J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "A new addiction. I don't need another one. But the coffee and the cookies they have here are wonderful!\n\nI wouldn't have stopped in unless I had a 30% off coupon from one of the restaurants on the pier. I'm so glad I did because this is a new favorite find!", "author": "Madeline R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "Ordered a number of drinks. Reminds me of Starbucks but they give you a little Biscoff cookie with each drink. I had a White Chocolate Moca and compared to Starbucks it was pretty decent.", "author": "GB B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-28", "description": "OMG so the jar of biscoff spread I bought is totally gone. It tasted AH MAZING. I am going back to SF just to stock up on it and it's super low calorie. I LOVE IT.", "author": "Lucia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "Little coffee shop and tourist shop at Pier 39.  They make your coffee quick, have nice ginormous cookies and baked goods available for a midday snack.  I also really enjoy the Biscoff cookies by Lotus.  We liked it so much that we bought the big box online and had it shipped for Christmas to give a small treat to co-workers in their stockings.  Only thing is there's really nowhere to sit inside...grab your coffee and get to steppin!", "author": "Dee H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "Yummy coffee and great biscotti! Very cute cafe on Fisherman's Wharf.", "author": "Natasha F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "their biscoff cold blend? to. die. for. \n\nit's like their coookie, but in a shake! AHH. SOOO GOOD!", "author": "Ramandeep K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-16", "description": "small shop, but has a decent selection of biscoff stuff.  there was a line, so i was worried it would take awhile, but it moved quickly.   my friend is always raving about the little cookies, so i had to get her some when i saw the store.  my one mistake... i tried the cookies.  omg, have you had these things??? so addictive... sooooooo addictive.  it's one of those things you can't stop at just one.  do yourself a favor... buy lots!", "author": "Linnea E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-09", "description": "Great cookie.....not the greatest java though. Not for that price.", "author": "Danny M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-20", "description": "This place has never failed to offer up the worst possible service in the world. I work across the street, so it's convenient for me to go there. They are a Coffee Place and offer cofffee, it should be a go to for me..right?\nWrong.\nI have never ever been there once in the last six years without having the following problem, not once\n1.)Always out of coffee, not just one Dispenser but at least two to three out of four. I always alway always have to wait at least 10 minutes for them to make more and refil the servers before I can get some. It's like Lucy pulling the Football away at the last minute as Charlie Brown goes to kick it. \n2.)They are always rude, inept or badly spoken in thier dealings. The Manager himself is hostile and rude and has poor people skills. It's puzzling that someone who seems to hate people and hate serving people should pick this kind of business to go into. \n3.The coffee is always bad or old or cold. They make hands down the worst coffee in san francisco.\nI tend to buy my coffee at Starbucks or Peets but I have to walk several blocks to do so, it's worth it to avoid this place.\nThere will always be a bevy of unaware tourists coming here to buy thier wares, but not me. I'm done, I have had it, they fail and fail and fail again and again and again. \nAt least they are consistant, I will give them that!!!", "author": "Dean J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-21", "description": "Biscoff is perfect for a great cup of coffee. For bake goods. The people who work there are amazing!!!! I love the Biscoff Latte and the Mexican Mocha my favorite drinks there.", "author": "Alexandra A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-25", "description": "A great little coffee shop conveniently located on Pier 39.  Staff was friendly, and you receive a complimentary cookie with each coffee you purchase.  Yum!", "author": "Emily O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-06", "description": "I stop here for coffee whenever I'm in the area.  Different and delish espresso creations.  Friendly staff.  And the free cookie is the perfect lttle snack with an espresso.\n\nCoffee: 5/5\nService: 5/5\nAmbiance: 3/5", "author": "M R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "This place had pretty good coffee, and it looked like they were providing their own brand (San Francisco Coffee Company, or something like that) which are also available in packs for purchase. At $1.75 for a small VIP of coffee, I felt the price was quite reasonable given their location being in touristy Pier 39.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-02", "description": "They improved their pastries , the result.: perfection!! Love the ham and cheese croissant , and the raspberry one, well done!!", "author": "Karen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-09", "description": "Not a fan of the cookies, but when you crush them put them in a jar with a bunch of other ingredients it becomes Speculoos.  Most people never heard of such thing, is really popular in belgium.  If you are a local ride your bike there grab a jar or two and you will be hooked.", "author": "Albert G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "yummy lattes and good pastries. \nWent there several times while at the Wharf for the weekend! big fan!", "author": "Mary T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-02", "description": "Absolutely the best cookies in the city! I love them. I buy them as gifts to bring to people I visit. The coffee is also good (I usually get black coffee, so I can't comment on the fancy drinks). And dip the cookie in the coffee...perfection. It is in a touristy area (Pier 39), but if there is a line it moves quickly and usually there isn't a line. I definitely recommend this place.", "author": "Francie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-27", "description": "I don't think this would be my everyday coffee place but it was definitely fun as a tourist activity.  I especially enjoyed the little cookie I received with my coffee.  I ordered a double tall soy latte, which ended up costing me $4.50... being from Seattle I was less than impressed with the way the latte was made, but enjoyed the experience of this little shop anyway!", "author": "Hailee G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-13", "description": "Mocha was cold. Banana nut muffin was dry.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-04", "description": "I love Biscoff, have been ordering from their catalog for years.  I did not know they have a store at PIER 39.  I was a little disappointed, there wasn't that many choices that you can choose.  Seem like they only carry a few kind of cookies.  I was hoping they have everything you see in the catalog.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-09", "description": "This place has a decent coffee like many other coffees shop and we like to have coffee here each time we come down to Pier 39 for sailing. It was nice to have a small tasty biscuit with the coffee. However the service needs to be reviewed by owner. The girl who made coffee on Sunday around 10:15a had an awful attitude. And she was the one who messed up the order! We order a bagel and a medium latte with extra shot. She gave our coffee to someone else and when I finally asked where mine was she handed me someone elses latte. I asked if it had 3 shots and she snapped back that an extra shot was 75 cents. I said I had already paid for it and she said I had to show her the receipt which I did. Even then she insisted that my receipt was for earlier in the day (which it was by about 5 minutes due to me waiting). She acted as though I was trying to cheat her by getting a free coffee!  I don't even think she could actually read the receipt correctly to be honest.  In the end she gave me somone else's latte and gave me attitude when she pushed it across the counter. I told her  she was very rude and that when you make a mistake you shouldn't treat the customer as though they did something wrong to which she told me to go complain to the manager.  If I hadn't been holding up my Navy buddy during fleet week over a cup of coffee I probably would have.  She should not be working at this store where so many tourist come by for coffee. She gave everyone a very bad impression.\nBy way of contrast, on Saturday the guy making the coffee was very friendly and gave us an extra package of their biscuits when we mentioned how tastey they were.", "author": "Kim H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-03", "description": "Plain old, good coffee and a wonderful cookie.", "author": "Mike O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-27", "description": "I found this over the weekend while showing a friend the city and loved it! Great coffee, super yummy FREE cookie and the best apple cider ever. The cider is so popular that they were sold out when I came back  after dinner. Can't wait to get it next time I'm at Pier 39!", "author": "Nina Z."}
