{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "Needs child high chairs! People bring kids all the time, but they are confined to strollers and being held.\n\nOtherwise, a fantastic lower Haight spot with a nice varied menu and healthy options. They have a walk up coffee bar with grab and go pastries, mostly croissants if you are in to that. Could use doughnuts and regular bread products.", "author": "Steve T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-09", "description": "My friend and I were exploring different neighborhoods in SF and were in lower Haight when we came across Black Sands for dinner.  \n\nThe atmosphere was lively and cozy all at the same time.  Since the place was packed, we sat at the counter, looking out at the street.  \n\nI ordered the pork schnitzel ($17) which was nice and juicy.  It came with a side of braised cabbage and mustard spaetzle.  For some reason, the spaetzle tasted minty to me so I made my friend try some and he agreed. \n\nOverall, I would say the food was good- a 3/5.\n\nPros:\n-this place is also a brewery \n-great environment \n-they refilled my ice tea \n\nCons:\n-no working restroom in here when we came.  We were told you would have to go a few businesses down to use a restroom", "author": "Cari A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "Who says you can't have breakfast for lunch?! For part two of our weekly office lunch, I decided to try Black Sands. Our delivery order arrived via Caviar on Friday, August 10th a little after 12:15pm.\n\nI got the Fancy McMuffin: Fried egg, arugula, and bacon on panorama muffin, no maple mustard ($8). I love breakfast sandwiches, so this was totally up my alley. It all melded into one comforting bite. I did wish the egg was a little runny as I love my egg porn, but the addition of the arugula gave it a nice freshness. I didn't eat the muffin part, but it looked soft, chewy, and buttery. My kind of bread if I was in the mood for it.\n\nI heard Black Sands is currently for sale. Not sure what will happen to this spot, but I'm glad I had a chance to try it in it's present state. They do make a good fancy mcmuffin.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-26", "description": "This was an interesting place. A nano-brewery/brewpub style that had limited seating but that is to be expected where it is at. I sat at what I could only describe as the kitchen bar watching the guys cook up food (and eat off the line and not wash their hands after doing so). The food was decent but I do regret what I ordered. I got the Mussels and Chorizo and the waiter suggested the fries to go with it which I did. It actually doesn't make sense in this kind of dish and having the bread would have been a better option. I had a few of their beers and found them to be very well made and something I would definitely have again.", "author": "William R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "I came here with a couple of my friends for some late night dinner and drinks after having heard that they had reopened the restaurant. It was a pretty great experience, with some amazing food! \n\nWe ordered their famous burgers with fries, along with some of their local beers. The beers were pretty average in my opinion, but their burgers are DELICIOUS. You get a large serving of meat with sizzlingly melted cheese on top that just makes your mouth explode!!! I cannot get over how great these burgers were. \n\nThe ambiance is pretty chill overall - it was pretty packed when we arrived on a Thursday night, but we were able to find seating still. The staff is polite and the food came pretty quickly. It's a great place to grab a bite with friends or even go on dates (as a few people were around us). \n\n4.5/5 stars, with only a half star deducted for the average beer. Their burgers, however, are more than enough of a reason to come here!", "author": "Will W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Both their service and their food can be a bit hit or miss, but the vibe, decor and beer are all fantastic and last night's fish tacos were excellent. I like that they switch up their menu often. \n\nWe are in their 'Beer for Life' program which is a blast - my husband bought these $100 vouchers for each of us, and every month for the rest of our lives we receive a complimentary beer. Brilliant. Our monthly beer at Black Sands is one of our favorite rituals.", "author": "Camille L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "Longest wait to get a server and even a cup of water... \n\nThey didn't even call my name when I was sitting inside and just crossed it off. Only later when he came back inside did he ask for the name of my party -.- \n\nAfter getting seated outside, I wanted to order immediately but he said he wasn't the server. Server never came and both people in my party went inside to tell them that...like this is the first time in my life I had to wait so long to get a server and had to ask them for one -___- \n\n-Matcha Cappuccino: smallest cup ever! 8oz for $4? Like really? And it wasn't even a cappuccino! It was a latte...I was a barista previously so I've made them before. I could tell the moment it came there was no foam and it wasn't aerated enough. When I told him about it, he just said I don't like to put foam in mines typically...and I'm just thinking does he even know what a cappuccino is? He went back and brought me a milk pitcher instead of a new drink....that was a first...and it still wasn't aerated enough. Smooth enough to be a latte but definitely NOT a cappuccino! Worst part was the matcha taste was nonexistent! I would expect with less milk for the flavor to be more apparent but I couldn't even taste a hint.\n\n-Avocado toast: it was smashed instead of the whole slices unlike the pic on yelp. I took a bite and the goat cheese was too much for me, but worst part was that it was barely toasted so it was super soft. She offered to remake it and the next one came out with even less avocado!! Like really? I'm paying $8 for it and you can't even cover the whole bread!? Seriously appalled by this.\n\n-Crab Benedict: I knew the moment I saw this it wasn't going to be good. The bread was not the typical muffin and there was nothing but crab meat and the egg. At least the egg was poached properly... The potatoes weren't crispy either. Hard to believe this cost $17.\n\n-Churro French Toast: This was the best dish of them all. The texture was pretty good, and there were a decent amount of fruit too. Nothing to complain about for this dish, but still not worth $14.\n\nThe time it took for the check to come before asking and how fast they picked it up was unbelievable compared to how long we waited for our food/server. They need to get more/better servers if this business can't handle the volume of people. Also, I can't see how they skimp out on the food portion when they charge so much...\n\nMy mistake to come to a brewery for brunch!", "author": "Tina P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-04", "description": "Lately I've been searching places for good burgers & brew I was surprised ordered the black sands burger it was great the buns were soft with a crispy edges nice crunch cheese lettuce tomatoes ,pickles , the patty was seasoned perfect it all came together well , French fries were also salted well and had the nice crunch every bite I had the skinny dipper apricot ale saison  well balanced light crisp hint of fruit every good with the meal , will be a stop in the future for us, seen the chicken and waffles come out of the kitchen might try it next time looked good we'll see , nice place has it all cocktails brews coffee tea , also you won't be overwhelmed with tap choices should find a brew to enjoy .", "author": "Aaron B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-11", "description": "Overall this place was okay...\nMy friend and I swung in for brunch on a Sunday to no lines... I didn't know that even existed in the city!!!\n\nAs for the food, we ordered the crab Benedict for $17. That comes with some greens and some potatoes. The Benedict was extremely underwhelming. Little flavor, overcooked egg, sauce was too thick...\n\nMy friend and I we're discussing our disappointment with the benes and the table next to us got a burger delivered... Apparently they're known for it... Wished our server said something when we asked her about favorite dishes...\n\nGreens and potatoes were fine but I don't recommend their benes, too much money for the lack of quality and preparedness.", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-27", "description": "Just had one of the most frustrating and rude experiences at this place, since moving to SF. My husband and I stopped by to try it out and there was a 'sign up' sheet to put your name on a list to get seated. No one ever came to the front so I went to the bar where two seats were available. I asked if we had to get seated or if it was first come. She said we had to get seated so I went back and waited. People starting piling up behind us and still no one acknowledged our existence. Then a guy walks in with another guy and they bee line past everyone in line for the two seats at the bar that I had gone to. So, I went up and asked about needing to be seated in order to sit there and he and the same woman bartender that told me I had to be seated there said 'oh he's just getting a drink'. And I was like, I was also just going to get a drink. So he just got to skip everyone and no one said anything. She didn't seem to care at all in fact. And then still no one else acknowledged us. So screw this place. Obviously they don't give a crap about their customers. And if you're going to have a policy to sign up so people get seated in a certain order, follow it. If you don't really care, then just let people seat themselves. Don't have something that makes it look like you should wait and then let other people skip people who are following your wait policy. We won't be coming back here again or recommending it to anyone. Based on the mediocre reviews already on Yelp, doesn't look like we missed much anyway.", "author": "Drew M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-06", "description": "Will never step foot in here again for the following reasons. First, we waited approximately 50 minutes to be served our fruit bowl and grain bowl. The waiter never explained to us or to the customers at our neighboring table that there was a problem in the kitchen. And to top it off, they charged our credit card an incorrect amount.", "author": "Patricia Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-22", "description": "Review for beer and experience - \n\nI love the fact that there is a brewery in this part of town. Their own beer comes in 6 styles which seem like they rotate every so often. I chose an IPA which had mild hops, but too mild for my liking. They also had a saison, ale, and another IPA that I didn't go for.\n\nThere are a few tables, but it probably isn't a good place to come to with a large group who is hoping to sit down unless you plan accordingly.\n\nHonestly I feel like if I come back I may have a more outstanding experience, and considering that this is my future 'hood I'd say that there is a decent chance then this will be the case!", "author": "Allie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Had such a nice Sunday brunch at Black Sands. We were visitors in San Francisco and I am always interested in checking out local brews and brunch places and this place definitely hit the spot.\n\nThe atmosphere is really hip but still inviting and friendly. The food was delicious, as was the beer, and it was a convenient location. I definitely recommend stopping in!", "author": "Morgan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "A colleague planned some work drinks here yesterday and we enjoyed everything! \n\nBurgers were on everyone's mind so the whole table ruined their dinner at 3pm and ordered up a burger per person, add egg, add cheese, with fries...it was pretty out of control. Since I don't eat red meat often and didn't want to spoil my dinner plans I went with their only salad on the menu. It was amazing! Totally in season with apples and grapefruit, plus toasted pumpkin seeds with fresh greens. \n\nBeers hit the spot and I also enjoyed the sparkling rosé they offer by the glass. \n\nOnly issue with this place was the service. I know weed is now \"legal\" but our server was so high he could have come strait from a reggae festival. He forgot our orders, couldn't hear, and didn't seem to understand the steps that are taken to pay a bill. Poor guy needed a coffee and/or a nap. \n\nEither way, this was a great choice and I'd love to come back with my little family.", "author": "Alison C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-05", "description": "Really love the space, the service is great too. Came for lunch and ordered the burger which is supposed to mimic In N Out but thought it was disappointedly below average. Lacked flavor and needed onions. My husband got a beer though and said it was fantastic which he never says. I would definitely come back for a drink or breakfast.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Very very solid! Atmosphere is incredible - this brewery doubles as an incredible brunch locale. The white marble and wood is a killer look. \n\nWe enjoyed the Sausage & Eggs, as well as the avocado toast. The Avo toast was superb - crisp, melted goat cheese, and well prepared. \n\nThe sausage and eggs were solid - great if you like crispy breakfast potatoes. \n\nThe service was just ok - our server was a bit curt, but got the job done quickly and efficiently. \n\nWill have to try their beers next time we come.", "author": "John A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-24", "description": "The food is delicious, the service is pretty terrible.\n\n1. No host greets you for both lunch and dinner.  You're instructed to seat yourself which ultimately means you're left waiting a long time to place an order because it seems like there isn't anyone assigned to a specific table.\n\n2. Food gets plopped on your table and they don't ask at the moment or circle back to ask if you need anything. Most often I would, like condiments or another drink! \n\n3. My plate is clear but I'm nibbling fries, about to dip one into ketchup and the server pulls my plate out from under me. I'm still eating! \n\nPlease address these issues, you're in my neighborhood and I'd love to be more enthusiastic about coming here!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-05", "description": "I want to see their staff wash their hands and observe some basic hygiene.\n\nI want to not have any eye rolls when I order, or ask for silverware, or ask for the check, or anything else when I am a customer.\n\nUntil there's some sort of guarantee on the above, I am going elsewhere.  Good food doesn't make up for nasty.", "author": "Molly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "This place has great beer, but the service is slow and the food is over priced. We got garlic herb fries for $7.5. For a side of fries that us a very high price even for San Francisco, but the actual serving was very small. At another occasion, I have tried their salad, but it was also mediocre. I would recommend this place for beer, but not for the food.", "author": "Neda P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Excellent burger!! Get one. Service and overall vibe really great. I will be back to try more food and beer.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "I live very close to Black Sands and have been there  about 10 times since they opened. I usually go at night for cocktails and snacks, though they do offer coffee and brunch earlier in the day. \nTheir cocktail menu is ever-changing and I always love what I order. The food is very good, and on weekends they have beer brewing classes. The acoustics aren't great so it gets SUPER loud when it's busy, but it's a great place. \nIf you're really lucky you'll get Shannon as your waitress- Super cook gal who can turn any night into a better one!", "author": "leah w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-28", "description": "SPICY FRIED CHICKEN SANDO...do it! This sandwich taste like if Chick-fil-a grew up and had a mature taste. Also, all the beers on tap are good. \n\nIf you plan on going after 5pm make sure to expect a wait for seating. It's first come, first serve. You'll need to hover for a bit if it's busy. \n\nStaff is super friendly and welcoming to families.", "author": "Henry F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "My friends and I came for brunch. Really decent food and really decent beer. I felt the beers were definitely heavy hitters and great for a rainy day. I was sort of imagining a pirate ship, but it was really bright inside. We were all happy with our food though. It can get really packed, so make sure not to wait till the last minute!", "author": "Jason C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "It was a Thursday late afternoon and while Hanging out in the Haight,  I got hungry.  Checked out yelp to see what was near.  This place was hella close to where i was,  so there I went.  Loved the atmosphere of this open concept bar eatery. They serve beer, wine and bubbles.  I ordered a glass of Rose. It personally wasn't to my liking but thats cool. The menu had some good options. I chose the sea bass.  It was delish. The skin was crispy, which i liked. But it was slightly overcooked.  But not to the degree of me needing to send it back.  The bartender and a patron that I sat next to were extremely cool.  They made the experience a bonus.  I would defintely come again to have a bite and a glass of wine", "author": "Elease T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-16", "description": "A relatively new (two years) production brewery, brewpub, and restaurant, with a strong beer education program.  A big high-ceilinged room with the brewing plant open to the taproom, but that sounds like a cliched industrial-space brewery; here, it has been done with a lot of style sense.  White walls, blond wood, \"black sail\" canopies over the bar.  Also a home brew shop.   Open kitchen.  And serving breakfast, for Ninkasi's sake;  how many craft breweries dare claim that?  Very full on a Saturday mid-afternoon; I was lucky to find a space at a recently-vacated corner of a table for eight.\n\nFull bar, and a good wine selection, though there's no doubt that their heart is infused in beer.  Table service only after 5:00; otherwise, order at the bar.\n\n\n\nI ordered a flight six of 5- ounce servings, rather expensive at $24:  \n\n- Rose Shrine Farmhouse Ale.  5.9% ABV.  Slightly cloudy gold, light head.  Mild grassy nose.  Yeasty, with low hopping.  Brewed with black tea and rose hips...well, I thought I could taste rose, but perhaps that's the power of suggestion.\n\nSMASH El Dorado IPA.  (SMASH?  \"Single Malt And Single Hop,\" part of a house series.). In this case, Admiral malt and El Dorado hops.  Near-clear amber, halo and patches head, small-bubble carbonation.  Weak earthy and black pepper nose.  Honey note, though not especially sweet.  Spice and passion fruit notes.  Hop bitterness develops in the finish.\n\n- Eclipse Belgian Saison.  7.7 %.  Brewed 8/21/17, the day of a solar eclipse (which, of course, was not total hereabouts.)  Concord grape nose, tart and a bit perfumey.  Malt and yeast forward, sweet and spicy; so, what's a hop?  Pils, two-row, and acidulated malts, plus a wheat adjunct.\n\n- SMASH Azaica.  6.0%.  Near-clear orange-gold, light head.  Again Admiral malt, counterpoised with Azaica hops.  Stone-fruit nose, well-balanced hops and malt.  Canned peach nectar note in taste.\n\n- Crimson Haze Red IPA.  5.5%.  Slightly hazy red-amber, flocculent cream head.  There's a suggestion of rye in the nose, though no indication of it in the description of the grain bill.  German Red-X malt and wheat.  Cascade, Huell Melon, Azaica, and Ariana hops.  Dry and a bit papery.\n\n- SMASH Baja Kolsch.  4.4%.  Clear orange-gold, halo and patches head.  Perfumey nose.  Taste is somewhat at odds with the aroma; dry, crisp, and something \"meaty.\"   Boho Pils malt, Ariana hops.\n\nSingle gender-neutral restroom; downright attractive decor, but inadequate to the size of the restaurant and barroom.\n\nTwo blocks west of the sacred Toronado and the less-sacred Mad Dog in the Fog, making for a natural pub crawl.  On the MUNI 6 and 7 bus lines, giving a connection to Civic Center BART.  Parking?  Oh, you optimist!", "author": "Alan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-19", "description": "This was exactly what we were looking for on a chilly Thursday night. We waited about 25 mins for a table for four, although it was open seating. We could of stranded at one of the several bars if we wanted too- but elected to wait to sit. Service was quick and friendly. They said the bartender makes a great G&T so we tried that and a couple other beers. The fried chicken sandwich was scarfed down. The fries reminded us of elementary cafeteria style French fries- so that might be good or bad pending on what you're looking for. One of our eaters got the beat salad and just like the name, it was a beat salad. It didn't have any lettuce which was unexpected but was thoroughly enjoyed. There was a slice of fried goat cheese on top and by the end of the meal nothing was left on the plate. The table shared a burrata flat bread, which unfortunately came out after we all got our meals, but still was very tasty. Nice creamy texture from the cheese. I personally got the mussels and enjoyed them very much. As stated on a lot of my reviews, I'm not a grease fan, and the chorizo in the sauce came in big pieces and and didn't create too much excess grease. Not your standard red sauce mussels you might get on the east coast, but still enjoyed every piece of meat, seafood, and drop of sauce! Pleasantly surprised it came with two pieces of toast which was adequate to have a piece of carb with every bite- because... well... I love carbs! Good meal!", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Really cool brunch spot! Had the salmon eggs Benedict and the veggie scramble. High quality ingredients, salad is super fresh, and the vibe here is exactly what we were looking for. \n\nFriendly service with a smile and music fits the ambience well. Highly recommended!", "author": "Arthur G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-13", "description": "Came here for my birthday a few weeks back and it was a great spot for our group! It gets super busy, so we were lucky to get a table large enough for all of us--definitely come early if you're a large group or be prepared to swoop in on someone else's table. \n\nThe beer was good, although nothing extraordinary, but the cocktails and food were awesome! We had the burgers, fast-food fries (taste just like McDonalds), fish tacos, crudo and veggie burger. EVERYONE was super happy with what they got. \n\nIt was the perfect spot to start the night and it was super easy for more friends to join and order as they arrived which was a huge plus.", "author": "Anne M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "It's my local. \n\nStaff are fab. Seating is sometimes free for all, sometimes there's a waitlist. It can get seriously crowded of an eve, especially on a weekend.\n\nNever had the coffee, but the cocktails and wine are a treat. Let's get to the important bit though: BURRATA.\n\nDon't even THINK about eating here without that as an order. I can't stress this enough.\n\nIt comes with amazing jam, prosciutto, and a realistic sensation of what flying on a unicorn-pegasus might be like. If the unicorn-pegasus breathed rainbows and sweated Joni Mitchell songs. With a plate of burrata on it's mane, just for you.\n\nSure, I'm being hyperbolic. But I really enjoyed that burrata. I can't even remember what else I ate.", "author": "Rowena H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Excellent location, fantastic beers, buzzing vibe whether it's a weeknight or weekend brunch outside, and good food. Couldn't ask for more.", "author": "Julia O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Breweries can be a lot of fun. But at must places you have to either bring food or hope they have a food truck. This one tops that. (Although there's a lot of Amazing Food trucks out there.) But at this Brewery they have a full kitchen, and the food is really good. It was a packed Saturday night and the service was great! The atmosphere was fun and upbeat. Another cool thing at this brewery is that they have a full bar! Really awesome when there's some in the group that don't drink beer. Definitely gotta check this place out.", "author": "Ron V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Not a beer drinker but came here with someone who is. Was only supposed to grab coffee but I had banana bread with eggs and avocado. Others with me had the yogurt w/ fresh berries, egg scramble with greens and the best toast I've had with breakfast. Every plate was incredible. No lie. Simply delicious. The prices are reasonable and the atmosphere has a warm home feel. Very impressed with this joint!", "author": "Camille C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "The avocado toast with egg at this place is unreal. The bread is slightly crunchy, filled with plump tomatoes, lots of avocado, egg perfectly cooked, and sprinkled with parmesan.", "author": "Melissa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-11", "description": "I REALLY WANTED TO LIKE THIS PLACE! It was recently featured in Zagat's 12 hottest bars (https://www.zagat.com/b/san-francisco/9-hottest-new-beer-bars-in-the-bay-area) so I wanted to see what all the hubbub was about.\n\nWent on a Friday night around 10pm - it was full, but not packed. We were seated, immediately asked what we wanted, but had no idea because we had LITERALLY JUST sat down. The waitress never came back to us, so we moved seats 10 minutes later. Was still ignored. Finally got her attention and then the saison that I wanted to try was OUT!!\n\nAll in all it was a pretty shitty first impression. My beer that I ended up getting - one of the IPAs, was actually pretty good... but it's hard to fully enjoy when you've already been rubbed the wrong way.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-26", "description": "The food is GREAT. Unfortunately, there's a hipster between me and the food. We all know what hipster service is, so I won't bother to explain it... but I will provide an amusing vignette:\n\nKitchen: Ding! Ding ding!!\n\nHipster #1: (Crafting probably the best cappuccino of all time)... Dude, could you get that?\n\nHipster #2: Get what?\n\nHipster #1: The food.\n\nHipster #2: Oh. Ding. Duh. \n\nSeriously, the burgers keep me coming back, but service is infuriating. You have to ride them for water, silverware, cream with your coffee, the check. I suppose our role is to be grateful they bothered to come in to work in the first place.", "author": "Angela K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "One of the finest examples of hipster service one will ever aspire to witness in their life. A true master piece of the sumbtle art of not giving a fuck about your job. Bravo", "author": "Travis J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-03", "description": "We got mussels. Don't get mussels! \n\nThey boiled (not steamed) the crap out of it to start. The mussels were bitter which, after researching , we learned that it's due to it being spoilt or being unfresh.... ewwwww. Nuff said. Buyer beware.", "author": "Betty V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-11", "description": "Overpriced. What's a biscuit and gravy? Where the other biscuit?\n\nI've been burned too many times by your disappointing queso. It's either served too cold or too watery. \n\nThe chicken sandwich is great but $17 is cray cray.", "author": "McLain K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "I've been here 6 to 8 times now. Can't believe I've never actually written a review. I feel like the menu changes so frequently and I can't even remember everything I've had but I'll review what I had in the last few trips!\n\nSummer Grain Bowl  - I've had this 3 times now and it never gets old. The first time I ordered it, I was super reluctant because I didn't think it would be filling/satisfying enough, but it 100% hit the spot. It hit spots I didn't even know could be hit. Everything is so fresh and flavorful. Add an egg. Always add an egg.* This is probably my favorite menu item here atm. \n\nSpicy Fried Chicken Sando - It's pretty good, but honestly kind of a pain to eat. Super clumsy and messy. Not sure if actually worth the hassle. Same for the burger. I also just don't typically care for big sloppy sandwiches at bars when I'm mostly there for cocktails. Given the options, I'd rather try something more unique and inventive, but that's just me. \n\nDuck Garlic Noodles - These are no longer on the menu, as well as the this other incredible garlic noodle dish (I can't remember). The last time I came in was on chef Eric Ehler's last day and this was one of his specials. IT WAS INCREDIBLE. Hands down one of the best dishes I've ever had. I realize it's futile reviewing it at this point, but kudos for such a fantastic dish. They also had another garlic noodle dish once (I want to say bulgogi and burrata but I can't remember) and it was incredible. I haven't tried the crab noodles yet but my heart yearns for the garlic dishes long gone. \n\nAll the cocktails and lattes are wonderful. I always try a cocktail and/or latte when I come in (sometimes both). Sometimes the service is super slow and that's my biggest qualm with this place. Even when it's not terribly busy, it could take a while for someone to acknowledge my existence, and that's always frustrating when you're sitting at a bar and there are literately 3 bartenders walking past you and ignoring you. I actually got snarky once and asked if I wasn't dressed well enough to be served because I was in yoga clothes and had been ignored for 20 minutes at a practically empty bar and the bartender snapped into present time and took my drink order. Sometimes the staff seems a little pretentious but I've gotten lucky with a few more down-to-earth servers. It makes a HUGE difference.\n\nThe bathroom is rad as hell. Coolest public restroom ever. The overall aesthetic of the whole place is fantastic. Love the tile floors and marble tables and black accents. The lighting is usually really good for photos too! These are the things that really matter, after all. \n\nSincerely hope they bring back more asian dishes on the menu and less american ones. I know it's a brewery and they're appealing to the general masses, but some of the dishes that used to be on the menu were SO killer and it's lacking now. Come back!\n\n(I'll upload photos later)", "author": "Nikki I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-03", "description": "The burger and fries are among the best I've had at any SF restaurant. Everything else on the menu is just meh and I don't think the beer is terribly original or tasty. \n\nThe service is fairly typical SF hipster in that the bartenders/servers aren't maliciously bad, they're just aggressively aloof. Don't eat here if you have plans the same evening or if you are shy about flagging someone down for service, including clearing plates/glasses. \n\nReally that burger is worth being a service masochist over.", "author": "Erica G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-22", "description": "Stopped here on a Saturday around 5:30 - 6:00 and while full my wife and myself were able to get a couple of seats at the bar fairly quickly.  Unlike others, our service was actually pretty good - attentive and quick - No complaints there.  \n\nSo why the three stars? Well for a brewery they only had 3 beers on tap - Their IPA was out and there was no pale ale, lager or pils, just a red ale, kolsch and brown plus a cider that doesn't really count as a beer.  I tried the Red and Kolsch and both were very good but usually I'm expecting at least a half dozen beers if not more to sample when going to a brew-pub.  \n\nI was also really looking forward to the burger which a number have listed as one of the top 10 or so in SF and it was disappointing - I always am looking for a medium - rare but it came out more on the medium side - I was super hungry so just dived into it but it wasn't really that juicy.  Seeing how things were being cooked it seemed almost like an assembly line - not a lot of care and personalization.\n\nBlack Sands has a lot of potential if they keep their beers on tap and add some more variety also pay a bit more attention to how things are being cooked - It's a great space and with a bit more maturity should be an awesome place - I'll probably be back but will wait a few months and see if things change", "author": "Roy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-09", "description": "We came for dinner.  It is a busy place so be prepared to stalk a seat!  The beer was pretty good.  I had the passion fruit saisson- it was a bit sour but good.  The  fries were good.  The burgers were great!  The flat bread was ok- it could have been tastier.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-23", "description": "I walked by black sands today and had to jump over vomit to get on the sidewalk. Immediately past the bar were multiple additional piles of vomit. This business should have more respect for our community and and clean up after Saturday night. Gross.", "author": "R A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "I came here on Sunday, for brunch, which I believe they recently started. When we came in, it was seat yourself and you grab your own menus. I wish they had a stand in the front with the menus that said seat yourself. I came with someone who knew about the place, but for someone who had never been here before, it may be a bit confusing.\n\nI grabbed some oolong tea, while the rest of my party tried a variety of coffees. The oolong tea was really good. I wanted to try green tea, but it had coconut, and I hate coconut.\n\nThey have smaller menu for brunch, but we tried the Fried Rice and the Chicken and Biscuit. The fried rice came with a soft egg, celery, onions, a spicy sauce, and we added pork belly. I got the fried chicken and biscuit with gumbo gravy. The fried chicken was a chicken breast that was seasoned with mild spices, there were two small biscuits, and a nice gumbo gravy. The gumbo gravy was the best part of this dish. I wish there was more of it because it makes the dish. Even a smidge more spice.\n\nI will definitely come back and try some of the other dishes available. This seems like a place that has a rotating menu, so I'm not sure if everything will be available when others come in. But I'm sure when people come through, they will find something filling and delicious.", "author": "Alanna T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-22", "description": "Came here for brunch on a Saturday and one complaint is that the sign in list was confusing (a big question mark was written on top of half of the names?) also no one was really monitoring so some people just sat themselves in the outdoor area even though we were waiting. The food was good but the service was slow (might be because we were sitting outside) my server forgot to bring my drink until the very end of the meal but then she comped it for her mistake which was nice.", "author": "Karen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "This place is a neighborhood gem. Great atmosphere, beer, food, and people. You will not go wrong with the burger!", "author": "Orinna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Holy Dungeness crab Batman.\n\nThis spot does the most amazing garlic noodles with crab meat. There could have been a little bit more of the meat but this is probably one of the most satisfying one plate meals I've had in awhile. Crab + noodles + garlic = life! \n\nWe ordered the fries, chicken wings and the Singaporean fried rice which were all quite good but nothing tops the noodles. \n\nThe wine is affordable, I recommend the grenache by Elizabeth Spencer (as I was not a fan of the Malbec), and my friends told me the beers are all good too. \n\nSo we got there pretty late and had to find our own seats. It gets pretty busy past 8 and there are tonnes of people just milling around trying to find a spot at the bar but don't be discouraged, you will be able to squeeze in eventually. \n\nPro tip: There is only one bathroom so go before you really need to go. \n\nThere was a waitress there called Katrina (sp?) who was the sweetest, most attentive waitress I've ever encountered. Please tip her well!!!\n\nI will be going back for sure and I highly recommend eating here!", "author": "Eunah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "A brewpub with quality beers and a surprisingly good food menu to match.\n\nAs for the beers, you can do a sampler-sized flight of their offerings, all of which are quite enjoyable, including the Smash Equinox IPA, 2x2 Adriana/Mandrina, and Oil as Embers stout. The food is several notches above typical pub fare as well. There are predictable items like burgers and fried chicken sandwiches on the menu, plus surprising ones like Singapore fried rice and dungeness crab garlic noodles.\n\nService is also courteous and super fast. A great neighborhood venue that's worth visiting even from elsewhere in the city as it's close to the N-Judah line.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Best burger I have eaten in the world. Great beer and cool atmosphere. Love this place", "author": "Chris P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "For a brewery, their selection of beers is kind of small. That was surprising. (The beers that looked best were sold out, as well. Unfortunate.)\n\nProciutto Burrata: really good. These were a strong four-star item, and elicit a strong recommendation if you happen to go there.\n\nCrispy Fried Chicken Wings: tasty, with lots of meat on them. Also a recommendation. \n\nGarlic Crab Noodles: good. but not as strong. They were a little weaker on flavor than the other two items. That's not to say that they were bad, but if I were to go again, I'd try another item instead. (Maybe the house burger?)\n\nThe interior decor is cool -- the place has a nice atmosphere, owing to being a brewery and all -- but they're not managing to make the most of the space. The seating is a little cramped, though I'm sure they could fit in a lot more tables more comfortably if they rethought the double-bar layout. Service was fine, though I did get (very politely) yelled at for busting out my laptop mid-dinner.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "The Burger is amazing! Really nice staff and beautiful place. Gets quite busy on nights and weekends.", "author": "Alexis L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-20", "description": "First, it should be stated that I have dined at Black Sands before. I think the food and housemade beer is great. But they are dragged all the way down to the floor with horrendous service. \n\nMy latest experience at Black Sands was terrible. Point blank: It is absolutely irresponsible for this restaurant to operate on a first-come first-serve basis for tables. Especially during a Friday night. I couldn't count how many groups of people came in and then promptly left when they were left wondering how in the world they were going to snag a table without the help of a server/host or a queue system.\n\nI could excuse the lack of a waiting system if the bartenders/staff looked busy. However, I watched as a female bartender poured \"bartender's choice\" shots for everyone on the left side of the bar (and herself) multiple times during the night. If you have the time to be doing this, you ALSO have the time to be helping the 5+ groups of people organize themselves, find a table, and not just stand aimlessly at your front entrance. So, instead of serving 5+ more parties, you forced them all (including ours) to leave and take our money elsewhere.\n\nAs your popularity grows, rethink your business model on these busy nights and rethink how you staff your restaurant. I'm NOT the only Yelp reviewer here commenting on your poor service, so take note. I believe your servers would be better equipped to handle sitting guests better if you had a waiting system. I believe your revenue would increase because you're attending to customers who are otherwise leaving. And watch your bartenders, because having them take shots with already-paying customers while more groups watch is comedically terrible.", "author": "Kenny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Dinner review. \n\nFries - 3/5\nBrussel sprouts - 4/5\nBurger - 3/5\nSpicy fried chicken sandwich - 5/5 - Tabasco oil\n\nBeers+\n\nOverall, \"I'm a fan.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-08", "description": "Rude helpless service staff and gross food.  Rude helpless service staff and gross food.  Rude helpless service staff and gross food.  Rude helpless service staff and gross food.  Rude helpless service staff and gross food.", "author": "Dennis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-27", "description": "Solid place that I come to from time to time..I'd come in more if they would bring back The Israeli Couscous salad! It was my absolute favorite lunch in the city, and now it's gone.  :(\n\nBeer is excellent, even approaching Cellarmaker quality at times.", "author": "Tory O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Their burger is ranked in the top 100 burgers in the US and they are pretty high on the list.\n\nWell deserved because the burger is so so so good. \n\nThis place gets busy even on a late weeknight, but its fast and casual and comfortable. The ambience is also dreamy and cool!\n\nGo here, drink the IPA, eat the burger, be merry!", "author": "Kimia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "I'm a huge fan! \n\nI recently went to Black Sands to catch up with a group of girlfriends and was thoroughly impressed with the vibe, the food and of course, the beer. It's a casual local neighborhood brewery and perfect to catch up with a friends or head on a date. \n\nI went in expecting to try some new beers and maybe order some bar food to accompany the beers. However, I was stupefied with the quality of the food, which rivals that of the brews themselves. \n\nI highly recommend the Black Sands Burger. It's oozing with juices, perfectly cooked at ~medium, and gushing with flavor. It's a very simple burger with two beef patties, some lettuce, cheese and buns. However, it just works so brilliantly. I paired the burger with a special home brewed pineapple malt beer and was thoroughly impressed. The cheese curds are also phenomenal -- they're limited though and usually run out around 6:30-7pm per night. \n\nMy gal pals and I took up the entire communal table at the back and spent almost 4 hours here! \n\nHappy Eating, Yelpers!", "author": "Priya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "A refreshing and beautiful bar located on the lower Haight among dive bars and tattoo shops.  Black Sands is a bright and open space, open seating and a large marble top bar that sits about 15 as well as seating near the open kitchen to enjoy craft beer and delicious bites.\n\nBlack Sands offers 3-4 house made beers as well as 'guest taps' from local breweries.  Beers are offered between 10 - 16 oz and priced around $5-$7 each depending on what you are enjoying.  They also note 'coming soon' so you can check out what to expect next time you come.  I grabbed the red IPA, a nicely balanced beer, not overly hoppy and it paired perfect with the AMAZING house made olives.  Honestly, it is odd to say how fantastic these olives were but the flavors they packed into these little things were out of this world. And, I also felt fancy AF nibbling on these things with the chopsticks provided. This place is all about keen attention to detail making the slightly higher price tag for the area totally worth it.\n\nI will be back to check out what they are brewing and offering here next. Also, I might just come to go to the bathroom here. Hands down the best bathroom in SF. You feel as if you have been transported into a 1970s disco, it is trippy and amazing. \nCheers.", "author": "Kelsey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "OK so who knew Black Sands is also great for....breakfast. Yep amazing coffee and kouign amann to start my day, hey you could just stay here from am to pm, never leave they have all you need :)", "author": "Karen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Got the chorizo torta and you do you cocktail. Both were great. Girlfriend loved French toast", "author": "Tobeh J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "$47 out the door for two mediocre, smallish sandwich meals... ouch\n\nBurger: Was underseasoned. Greasy overall. Pickles are not tangy....and the price is insane. \n\nChicken sandwich: greasy and kind of bland\n\nSide salad: is just a hand full of mixed greens with vinaigrette \n\nFries: soggy/greasy, feels like they didn't have the oil temp high enough\n\nKetchup: Lacks flavor somehow", "author": "Andre N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "The burger is as amazing as it looks. Beer is amazing too. Go and you won't regret it.", "author": "Orchid B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "One of the best burgers I've ever had! It's extremely flavorful and juicy! Has a great sauce too! I always recommend this place to friends looking for a good burger & it never dissapoints. Sometimes it's hard to find a seat...but that's the price to pay for having such a great burger. They also always have a great rotating beer selection. The cocktails are also top notch.", "author": "Arsia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "This is the reason I love this neighbourhood. Any time of day this is my favorite place to be. Great coffee, incredible brunch menu (and you can actually get a seat), the burger is one of the best in the city, and of course their delicious beer brewed onsite. The owners are active in the community, teach brewing classes on the weekend, and the service can't be beat.", "author": "Ari S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "Parking was difficult.\nFirst,  I want to say this is labeled as a brewery. So I was excited to try new beers. \nFirst problem, I was handed a list of House beers, about 6. Four of them were stamped \"SOLD OUT\". But I found one of the two left that I wanted to try. The waitress came over and told me their was a problem with the keg, they think it to is running out. So I asked for a menu of their other beers. When I looked at it, it had nothing that resembled something I would like. There were no common beers that most places have. I ended with ice tea. \nThe two people I was with had the Black Sands Burger. They said it was ok. \nI had the Spicy Fried Chicken Sandwich. \nI can't say it was spicy, but it was ok. \nThe service was good. \nBut when I received the bill, I was shocked. \nTwo burgers, a spicy chicken sandwich, two ice teas and a cocktail, the bill was almost $100. \nMaybe if the food was fantastic, I'd be alright with that high bill. \nFor food that is just ok, he'll no.", "author": "Kenneth R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "This place is legittttt! Vibes off the wall, great cocktails, bartenders knowledgeable about Smokey Mezcal....not to mention the BEST BURGER IN the CITY. When you are craving a juicy, delicious burger you come here, period. It's a Brewery, but to be honest you don't come here for the beer.", "author": "Luke S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-10", "description": "This is regarding their brew supply store, not the Restaraunt. I think their brew store is more for show at this point and is completely unreliable. Their phone message says 10am to 6pm on the weekends, but the sign outside says 10am to 5pm. Every time I call it goes straight to voice mail. When I walk down it's usually closed, even during normal hours. If they open at all it is normally 30 min late and they are never open past 4:30.\n\nI was excited to have a brew store in the neighborhood when it opened a few years ago but it has basically been garbage after the first year. I get it, it may not be as profitable as your restaraunt. But then close it down. In or out cat.", "author": "Erik M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "Do they have food? I don't know. I was just here for a quick pint. Black Sands feels different from the other beer bars on Haight. Instead of dimly lit, moody, or divey bars, Black Sands feels quite modern, brightly lit, clean, and spacious. Hop on in, take a seat anywhere (it's free seating), then go to the bar and order. I love their varied selection of beer, and the prices aren't bad, either.\n\nExcellent place to go for a quick beer, especially in the mid-afternoon when the sun's still out. I'll have to stop by for brunch at some point.", "author": "Jade V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-23", "description": "I had brunch here this past weekend. This spot has a very unfinished feel to me. I tried their ricotta pancakes. They were green! The novelty was kind of cool, but they tasted very dry. I also tried their salmon toast concoction, which was alright, but not filling. Oddly enough the one thing I would come back for is their coconut green tea, super yummy. \n\nThe layout of the space is very cafe with some small tables outside to enjoy the cold SF sun. \nIf I ever go back it won't be for the food, but maybe to grab a beer.\n\nI am raising this to a four star spot. I recently tried their pineapple saison beer. A+", "author": "Cynthia G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-26", "description": "OK place. Can be tough to find a spot to sit. And they were out of something that I ordered so I had to get something else.\n\nOther than that, food was acceptable.", "author": "Scott Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "This place is a must- cocktails are phenomenal and unique as is the beer, and food is always above & beyond. Love the service too. Perfect spot if you want to go somewhere and feel like a local.", "author": "Olivia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "Review for brunch only:\n\nThis was my second time here for brunch.  Arrived at about 11:30 on a Sunday, and my friend and I were able to get seats at the counter facing the open kitchen - always a great way to choose your food :)\n\nSelection: The menu appeared pretty much the same as my first visit several months ago, and that's not a bad thing.  They have fairly small menu, but they cover the major brunch categories - eggs w bread (either in sandwich form or otherwise), eggs not w bread, something sweet (ricotta pancakes), something healthy-ish (salad, granola) and of course something a little different (biscuits and gravy, breakfast fried rice).\n\nAdditionally, if you're looking to enjoy adult beverages to start your weekend day, they offer a wide variety of cocktails and their house made brews.  They have very high quality tea, as well as coffee options.\n\nService: it's seat yourself which isn't super clear from the side door.  But, it's a small space, so not a big deal to walk to the front and realize it.  The wait staff is prompt and friendly.  They are happy to explain anything on the menu.  While they check in on you regularly, I never felt rushed. \n\nFood: The food is high quality, and the portions are on par with most brunch places.  I didn't have them, but it looked like 3 plate-sized, fluffy pancakes was in an order of pancakes.  The torta a la cart was a very significantly sized sandwich, and the tartines are equivalent to a sandwich w a very generous portion of salmon.\n\nAmbiance: It's lively inside but still reasonable for conversation.  The decor is what I might call \"clean hipster,\" with white penny tile, light marble bar tops and black seats.  They also have some outdoor seating on the side, and some pretty cool wall art in the bathroom.  In fact, check out the bathroom!\n\nPrice/Value: As far as SF brunch goes, this place is pretty inexpensive if you stick with non-alcoholic drinks for brunch.  The portions are more than fair for the price and the quality of the food is great.\n\nOverall: I'm definitely a fan, and while I wish them the greatest of success, I also sort of want to keep this place a secret as a reliable, \"low maintenance\" (read no hour-long wait) brunch option in the neighborhood.", "author": "Sara E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Came here for breakfast on the weekend - liked the decor, loved the service, enjoyed the food. I don't understand why people queue round the block for some more 'famous' breakfast places when you've got Black Sands a couple of blocks over - do yourself a favour and break out of the same old same old tedious American brunch and try something a little different and 1000% more chilled.", "author": "Ed C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Great for brunch, dinner, or casual beers. Food is great, the staff is amaaaaazing (seriously want to hang out with them IRL), and the bathroom is funky. A great spot any day of the week, one of my go tos in SF.\n\nFrom the menu: Can't go wrong with the Benedict, French toast, avo toast (something I never order at restaurants because it's never worth the cost, but at Blacksands it somehow is), or my personal favorite: the burger. I legitimately consider the Blacksands burger to be the best in all of San Francisco. Hands down.", "author": "Abby H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Food is a 5, service is a 3. \n\nI've been here twice and the food is always on point. At brunch I had the Mexican torta sandwich and it did not disappoint. There's a great combination of sweetness from the pickled onions, spice from the chorizo and toasted bun for the added texture and crunch. The fried chicken sandwich I had for dinner the other time was dense, crispy and again the perfect amount of spice. The food and cocktails are great. The staff isn't very attentive, helpful with making suggestions and seem to always be confused on how to work in a restaurant.", "author": "Craig P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-08", "description": "The bar for brunch is really high in the city. I liked the vibe and the neighborhood of this place. However I think the French toast was a bit soggier than I wanted (though it comes with a delicious variety of fruit!) and the matcha cappuccino too wet. I would come back here if I'm nearby. Also I had no problems with service--I read that other reviewers couldn't get attn, but I liked my server who was generally attentive.", "author": "Alias A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Stumbled upon this place and I was a huge fan! The food looked and tasted amazing and what really won over our votes - it was pretty cheap for SF! THe portions were generous - I wasn't that hungry so we just split cheesefries and a chicken sandwich and everything was done to perfection, they even put the cheese at the bottom of the container so you didn't get all messy when you go to eat. I'm a huge fan!", "author": "Quinn Li O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-29", "description": "Went here yesterday and had the burger, some fries, and some beer. The burger was good, and like others mentioned, is very similar to In-N-Out. I did not like how expensive it was though. An In-N-Out double double is what, $4? While the bun here made the burger a little better than a double double, it did not make it more than triple-the-price better. Same goes for the fries. While marginally better than In-N-Out fries, in my opinion it wasn't double-the-price better. Everyone loves In-N-Out because they make tasty burgers for cheap. The $13 burger here should be a significantly different experience.\n\nFor beer I had the brown. It was fine, but ultimately forgettable. Service was also slow.\n\nUpdate: I was contacted by the owner who left me a nice message about how they price their burgers. While I realize that In-N-Out has the advantage of scale which enables them to offer lower prices, I still feel that if you can't at least get somewhere in the same ballpark price-wise, then I personally wouldn't choose to put the burger on the menu. Nevertheless, I do appreciate owners who do reach out and try to do right by their customers, and from other reviews, it seems like a lot of people love the burger, so what do I know. I'm adding a star back that I originally deducted for the slow service.", "author": "Matt D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-14", "description": "I love breweries, great beer, great food and hopefully something extra like house made beer incorporating the beer. \n\nThe service at black sands is not to shabby during the dinner rush, I did feel at moments however like they over worked. They definitely have the food locked down, everything is fresh and delicious. Some parts of the menu have fast food origins and are even named as such, fast food fries specifically. The burger and onion rings are along those same lines. \nThe thing about burgers in a non fast food environment is that they should find out how you like them. How do you like your burger? I like mine not super red in the middle, just slightly pink, and not dripping grease at such a high level I could think about measuring it. I love mine dripping with cheese, not grease. It also didn't have the best flavor. Overall it was disappointing and I'd never get it again. That's not going to stop me from going back, they have lots of great things on the menu. \n\nThe beer rotates so it's highly likely to find something new.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "This place was amazing. It was mostly empty when we got there for breakfast. Bartender took our order at the counter. I ordered a rose lemonade but they were out. The bartender made me a regular lemonade from scratch. The food took a while to come out for only one other person in the restaurant. Serving size was large. Food was incredible. Had the \"fancy McMuffin breakfast sandwich\". Highly recommend to anyone looking for a great brunch spot.", "author": "Taylor J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "I could not give this place more praise. First, their drinks are amazing. I got something called the good girl but with gin instead of vodka. It was phenomenal. Our server/bartender Bren was super attentive and made sure everything was perfect. In full honesty, I switched birth controls this month and unexpectedly got my period while wearing white pants. Every woman's worst nightmare. I asked a beautiful woman working, Shannon, who didn't have anything for me, so gave me a sweatshirt to make sure I was ok. She showed so much kindness and understanding in an unfortunate and embarrassing circumstance.  I can't even begin to thank her. These two employees deserve recognition from their manager and anyone who experiences their service and hospitality is lucky.", "author": "Brittany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Came here after checking out the painted ladies! Not a far walk to enjoy a delicious Bloody Mary and have some avocado, goat cheese toast! Yummy! Friendly place and warming to a new comer not from San Francisco!", "author": "Krysten C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-13", "description": "Black Sands is such a cool concept - they are an modern, chic restaurant, brewery, cafe, and winery. I was quite unimpressed by the food/coffee (quantity, taste, choice). The salad was ok, but kind of small for $11. The matcha cappuccino was alright - needed more matcha flavor, and they don't serve almond milk (only soy). \n\nThey're known for their breakfast torta (looks kinda small) and their croque madame (also looked kinda small). I would recommend skipping brunch and going straight for a beer and lunch or dinner.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "I really liked the vibe here.  Great place to catch up with friends, have a unique well made cocktail or in-house brewed beer.  \nThey had run out of a few draft choices when I arrived on a Tuesday (Burning Man?) but had plenty of beer options.  Enjoyed both IPA's, and the Kolsch was easy drinking.  \nAte a chicken sandwich... fried but not greasy, spicy rub and fast-food type fries.  All around good time and left satisfied.\nType of place that sucks you in and you don't tend to leave until it's a must... wonderful!\nFun friendly knowledgeable bartenders.", "author": "Buddy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-23", "description": "No high chairs. My 14-month-old needs a high chair. Feel me?\n\nA bit pretentious in that I'm-a-hipster-and-I'm-so-not-trying-to-be-cool kinda way. Ohhhhhh, the irony.\n\nOur waiter suckeddd. I mean, suckedddd. Even our friends, who are quite possibly the most polite people in the world, acknowledged this one.\n\nI ordered the avocado toast with egg. Good stuff, too bad I won't be back. Why??? See above. \n\nNo gracias.", "author": "Gabriela W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "I met 2 of my oldest friends here for dinner last Friday evening. it was pretty crowded but we got a seat at a counter in the back. And although it was crowded, it was mostly other people who wanted to have a convo, so the noise level was more of a hip(ster) din than raging club. Our server was attentive and patient as we needed ample time to decide on food, and didn't get drinks (I'd like to try their beers next time). \n\nFood: \n'Fast food fries' that were like garlic in n out fries and SO good. \nALSO THE BRUSSELS SPROUTS. Just do it. Like big crispy, flavorful bulbs of delight. \nCrispy rice salad was surprising and fun, with so many flavors and textures. \nTaco salad (I think it was a salad?) was vegetarian and still managed to feel like a full meal and had a good kick.\n\nAll in all I'd def like to go back and try more items on the menu!", "author": "Lindsey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "I have been to Black Sands since my last review, and I must say things have turned around. Food and beer is still top notch. But the service, oh how the service has improved! No more rude interactions, people are smiling (actually happy to have a job) and are more than accommodating. Addam and  two others I interacted with were very very nice and friendly. \n\nI will definitely be coming back to Black Sands more often now. Thank you for listening to your customers!!", "author": "Zo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "Review for brunch only:\n\nOne of the best brunches in the city! The best part? There's usually no wait if you get there before 10:30am, which is practically unheard of for SF brunch.\n\nWould highly recommend the coconut tea and the churro french toast.", "author": "Neha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "This place is such a great addition to the neighborhood.  Friendly, great cocktails, not too pricey, easy to get a table, accessible, great beer and most importantly, not pretentious!  Seriously, just a solid spot with a great staff and good food & drink.  What more could you want?", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "Great breakfast. We had the Vietnamese coffee, chai tea latte, avocado toast and salmon toast both with goat cheese, and a pistachio almond croissant. Everything was pretty tasty and generous portions", "author": "Randy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "One of my favorite restaurants in SF! Amazing food and incredible service! I have been going almost weekly for over a year. Highly recommend the burger!", "author": "Emory C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "I think the beers are decent, but I really go here for the food and cocktails. The cheeseburger is simple and greasy in the best possible way. It's a squishy bun with two beef patties and oozy cheese in the middle. Burger purists will think this is near perfect. However, The chicken sandwich might take the edge over the burger. I tried them both head to head and enjoyed the chicken sando even more. They have an interesting variety of house cocktails. One bartender whipped up a concoction out of midair and it was one of the best drinks I can remember. I wish it was written down somewhere.", "author": "Huey N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "Heard from a friend that Black Sands had a top five burger according to some list. Gave it a try - pretty darn delicious. Compares to a Super Duper burger in terms of size and flavor profile, but the Black Sands' burger rates better on the flavor scale by ~12%. \n\nComplemented the burger with a saison on draft. Not too memorable, as I was mostly fixated on the burger.", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "They have really good cheeseburgers and salads. The fries are salty little crack bites too. It's fast food  (thin patty) style and for whatever reason tastes better than fancy schmancy Nopa burgers. \n\nAlso great beer. My one issue is they don't serve burgers after a certain hour around lunch (2pm?) or at brunch. One week I went twice, found parking, and had to walk away. That's my fault I guess so 5-stars I love u.\n\nEdit: rejoice! Brunch burgers now in action. 6-stars!!!", "author": "Alexander M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-25", "description": "or how 'bout in the haight with Black Sands\neat up yo plate then call me the brunch man\nTorta top or just gimme the Croque Madame\nthe sat to the ur to the day to the weekends\n\ni wanna, eateateateat food from breky to dinner\nn i wanna, mooove from the app to the entree to dessert\nthen i wanna, nomnom you cook it so good i don't wanna leave\nbut i gotta, let let me know wh what's yo or ordering!", "author": "Dan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "I wouldn't know how the food is because, it was packed- couldn't get a seat at the bar. I guess hipsters never heard of giving your seat to a lady. I told the bar tender what I wanted, he said I could sit somewhere else and order. I was confused but sat down, and no one came to get my order after 10 mins I left- the whole place had a bad vibe and i'll never go back ever.", "author": "Alison J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "Fantastic burger! One of the best and the special sauce was sooo good.  However, not a friendly bar service. We're not in LA, this is San Francisco, be friendly.", "author": "Valerie I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "I like this place! Good food, good drinks, good atmosphere.\n\nI'm in love with the fried chicken sandwich.\n\nI am not in love with their \"please seat yourself\" policy - it's always packed and you have to bring your seat-swooping A game. If they don't want to have a hostess, I wish they would at least have a list you can add your name to.\n\nAlso not in love with the rude bartender.", "author": "Audrey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Neighborhood café, bar, restaurant -- this place does it all! \n\nAwesome iced coffee + brunch, the cocktails are great (gimlets and margaritas are our go-to), and it is one of the best burgers in the city (reminiscent of an In-n-Out double-double, but classier -- and dare I say, just as delicious!)", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-22", "description": "I don't know what \"hipster service\" is, but I do know what garbage service is--come here if you want that. The bartenders are brain dead and rude. I've sat down at this bar so many times only to be ignored for way too long. Once I had to wave one down after waiting a while and he came over and said, \"what?\" Another time I was eating a burger here and the server said to me, \"good shit, right?\" Another time, someone I was with asked for a water and the server said, \"no\", hoping we'd all laugh at his pitiful attempt at humor. No one laughed. The manager even defends the troglodyte servers.", "author": "Jeffrey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "It's a nice place with friendly employees and some tasty beer/food.  But I had to knock a star off cause the 6 beer flight was $24!  That's crazy time!\n\nAt least the beer was good, we also had the burger and every \"snack\" LOL\n\nThe burger was juicy, and flavorful, but not super special.  The Chicharonnes were a big hit.  The Garlic Fries weren't real garlicky.  The pickles had nice flavor.  I'd stop by if I was in the area, but I wouldn't seek it out.  And I'd definitely not get the flight again", "author": "Corey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-05", "description": "Excellent burger! I wasn't really a fan of the seat yourself arrangement but the food made up for it.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-22", "description": "Came to get a some drinks and food. Terrible service. We placed an order and didn't get anything after 45 minutes! The kitchen staff was just standing around. When we asked about the order tlthe servers just shrugged. Would not recommend", "author": "Jesse B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-23", "description": "Veggie burger was okay, outdoor seating is uncomfortable, they have McDonalds fries. Food presentation is underwhelming- plain white plates, fries came in an open carton like at the fair. Ordered a side salad and it turned out to just be the greens that came on the burger, but more of them. Idk I expected more, a better restaurant experience, something. Maybe it's more of a beer place.", "author": "Jakob Eats Alone .."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-22", "description": "Cute spot with good beers and food, but an uber  rude bartender. From the moment we walked in, she was curt and dismissive and seemed put off by an questions. We left after one drink because we didn't feel welcome at all.", "author": "K F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "I would like to rescind my previous review that I wrote shortly after Black Sands opened. I've since revisited after the restaurant had a chance to settle into the neighborhood a bit and I couldn't have been more delighted with my experience! \n\nThe drinks are on point (both beer and cocktails) and the food was delicious and brought to the table in an incredibly reasonable time after ordering. I would absolutely recommend the breakfast torta! Simple and delicious. \n\nSo far I have only been for lunch, and look forward to returning for dinner sometime soon.", "author": "Tini T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-31", "description": "This place is totally fine spirits are overpriced food is the is not the best and the chicken sandwich apparently it is the only good thing on the menu I wouldn't know I'm a vegetarian anyway there are plenty of better bar is in the lower ahead and go to Toronado for example and you'll have a great time", "author": "Bryce G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "Black Sands is quickly becoming a neighborhood defining establishment of the Lower Haight. Offering a trifecta of delicious beers, delectable food, and delightful cocktails Black Sands is my go to for breakfast, lunch, dinner, happy hour, and the much needed nightcap. Staff is friendly, service is speedy, and portions are large and in charge.", "author": "Jake K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "The best thing is when you go in there and see Jakes smiling face staring back at you. No other bar can offer that.", "author": "Stuart S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "If you can work this into your weekend afternoon, post-bunch and before Happy Hour, you're almost guaranteed a patio spot and a non-chaotic experience ordering your brews. Every other time I've been here has felt rushed and loud, but I gave it another try on Saturday around 2pm and was pleasantly surprised.\n\nThe beers on top are always changing, and while they offer a variety of styles, IPAs always seem to be the focus at Black Sands. And for good reason.\n\nWe tried a red Belgium and a Black Sands IPA. Both were delicious (as if you needed any reassurance).\n\nThere are definitely small bites aplenty here, but nothing to write home about. Stick with the beer and you'll leave happy.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-20", "description": "Expensive, small food. Boring beers. Sterile ambiance. Now that I know, I won't ever be tempted to go back.", "author": "Rochelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Came just for the beer and had a flight of their beers. Solid. Was the afternoon on a weekday so no issues with any crowd nor parking.", "author": "Dang N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-26", "description": "Don't go there on a Friday night because they might be closed for a private party like they are today 26th May 2017.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "This place is amazing! Such a diamond in the rough. The food is simple offerings but done so well for yummy comfort foods. Faryl our server was great always checking on us at appropriate times and making our experience that much better! \nA must to stop in and check out!", "author": "Alicia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "Food: 4 stars\nService: okay\n\nCame in here for brunch on a rainy Sunday. We opted for a pumpkin spice french toast ($10ish) and a baked polenta with slow cooked eggs and broccolini dish ($13ish). \n\nThe french toast was soo delicious. You just can't make this kind of delicacy at home. I loved the mascarpone pairing, the sprinkled pomegranate, the crunch and softness. Thumbs up for this dish.\n\nThe polenta was good too, really hit the spot for a rainy day, but was somewhat bland after a few bites. I liked the broccolini a lot, but they gave only a couple of strands, so it quickly ran out. Could've been executed really well if they portioned each ingredient a little differently.\n\nThe menu was really simple; there isn't a lot to choose from at brunch. Besides their usual seasonal fruit and granola, french toast, there was maybe 5 other things to choose from. So it's kind of hard to visit often.\n\nThey're also a microbrewery and offer brewing classes for $60 once a month (the whole experience, it'll last almost a whole day, with tasting and stuff too). Would make an awesome gift to anyone who likes beer! (They also sell at-home brew kits)", "author": "Maggie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Can't get enough of the Pandan Ricotta Pancakes at this place, but they have a few other brunch gems that are also difficult to resist. When I can't decide, I order two brunch dishes. I eat one there and take the other to go. So far, I've tried the fried chicken sandwich and biscuit (yums!), the brunch fried rice (delish!) and the young kale salad (omg! Who woulda thought!). I have been eyeing the fragrant chorizo scramble sandwich. When I go there next, it's likely I'll order that to go while I have my yummy green pancakes there again, since resistance is futile.", "author": "Rindah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "We stopped in here for a few beers before hitting Nopalito for dinner. this place is basically a corner bar heavily patronized which caused us to share space at a table with some friendly people. The beers were solid and certainly nothing I had ever tasted in NJ. The SMASH - CITRA - DOUBLE IPA WAS VERY GOOD. Well worth a visit is you are into craft beers. The food offerings looked good as well.", "author": "Dave W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Black Sands has a great Brunch AND Dinner menu, that changes fairly frequently. For brunch, I recommend the salmon benedict. For dinner, either the fried chicken sando or the burger. \nThe brewery also serves up delicious beers and always has a high quality \"guest\" beer on tap. Only issue is the ONE bathroom, there's ALWAYS a line. Please put another one in... we gotta go!", "author": "Mark M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-02", "description": "I ordered their blackberry saison and it was really bad. I don't even think it tasted like beer! After much discussion amongst my friends about what to do, (another bud got the same beer and also disliked it but decided not to return it) I decided to return mine. I just hated it.\n\nI talked to a dude bartender, and he said that they've been \"getting a lot of complaints about that beer\" and handed me a menu to choose another. Ok, cool - acknowledged and fixed. So after a while, I chose another, and a woman bartender comes and asked me what I'd like. I ordered a replacement beer and when she asked for my name, I told her that I had returned my raspberry beer. She asked why, and I told her that I just didn't like it, and then she gave me the nastiest of looks and a huge obvious eye roll.\n\nThere's just no need to be rude. If your beer didn't suck, I wouldn't have returned it! Yes, I called her on it and she ignored me.\n\nAnyways, the burger was awesome and I like the place besides the attitude I experienced. They need to weed that kinda stuff out. I read through some reviews before I wrote this and it sounds like this is fairly common at Black Sands. I'll avoid the place as there are lots of places that aren't commonly rude.", "author": "Jon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-17", "description": "Super friendly bartenders and delicious and affordable dishes. The taps change pretty frequently, and they always have something new coming up.", "author": "Abel T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "This place was pure meh. Service was meh: for what our waiter lacked in timing, he made up for in slowness.  Nice guy though.  Food was meh: the fried chicken and biscuit with gumbo gravy was bland and forgettable.  The avocado toast was better but nothing to return for.  All in all... meh.", "author": "Saminda W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-18", "description": "Service is slow and it's evident that the staff is blasted!  They didn't ring in something that was a app that didn't need to be cooked and when our burger beat it out they lied and said it was just taking longer.  I worked 13 years in food service, I know when an item was not rung in!  And thanks for the $5 discount. Lol. I tipped well but will not be coming back.  2nd time and they disappointed again!", "author": "Paul L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-16", "description": "The place is very well decorated but the staff are kind of rude. No one attended us when we entered and they did not want to serve is a lunch item because it was half an hour before the time. We ordered avocado toast granola and scramble. The scrambled veggie omelette almost did not have any veggies and did not taste like anything. The potatoes that came with it were delicious thought. The avocado toast was also very plain and without much flavor. The granola was delicious but the portion was ridiculous.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "Hipster brewery. Looks like good food options during prime serving time. Not overly busy on Sunday afternoon, allowing for easy seating. I like that they have upcoming beers highlighted. They also serve mixed drinks, wine, and bottled beers. \n\nHad the blackberry saison which was interesting but not sure I could drink more than one. It was a pretty pink color though. They had unfortunately run out of the SMASH IPA.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Revolving list of beers and surprisingly good burger.  It is a good place to grab some decent beers or bites with friends on the fly.  Seating can be tricky.", "author": "Liela N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "Nice atmosphere, and well done space. Bright and pretty. Kinda unpleasant interaction with the staff though. Nothing big, just multiple kinda awkward moments. Ordering was much more of a struggle than it needed to be. For example I was told they didn't have the ingredients to make the drink I ordered first (which was on the menu). No big deal, that happens. But then they acted like it was bizarre of me to ask what they'd recommend instead. Not sure what I ended up with up it wasn't memorable. Likely just an off day, since the place seemed pretty cool in general. But I won't go out of my way to go back. Kinda a let down.", "author": "Kaitlin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-28", "description": "Horrible customer service. I went around 4:30pm and ordered at the bar because their table service begins at 5:00pm, and the woman who took my order was rude from the very beginning. A cook had to get her to take my order because she wouldn't acknowledge me, and when she finally did ask she said, with a snarky tone, \"what do you want?\" While she continued to make an irritated facial expression, I placed my order, she took my card and handed me a number. Forty-five minutes go by, everyone around us, who came after my table was reviving their food and we were yet to be acknowledged again. Long story short, I asked another waitress for the status of my order and the other woman never placed it. She said the ticket \"never made it to the kitchen.\" This is some of the worst customer service I have ever received and would highly advise their management to make sure their employees are not creating a bad experience for their customers.", "author": "Angie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "I love that I can come here on a Sunday am and not have to wait in a horrendous line and get seated outside to enjoy the sun.  I had the breakfast fried rice with pork belly and was so impressed.  I was very skeptical but wanted something different.\n\nI had dinner here once and thought my fried chicken was very dry and was not able to eat it.  The rest of the food was great though.", "author": "Anne-Mary P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "Limited menu,excellent coffee, can't beat the double smashed patty cheese burger with special sauce and shredded lettuce. My best friend had veggie burger..it's grain based and she didn't like it, my roommate swears by their breakfast sandwhich...like a,fancy egg mcmuffin. They make their own beer and awesome craft and regular ass cocktails.nice,sunny atmosphere and staff.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "There's a good atmosphere, but there are a lot of downfalls: they never refilled our coffees even when asking, the food was cold when it was served, the potatoes were undercooked, the avocado toast wasn't good and tasted strongly of lemons", "author": "Olcay A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "Super excited for them to begin their dinner menu next Saturday. They're going to have cocktails (by the person who made the Lazy Bear cocktail program)... but actually I might still spring for trying even more beers because the beers were delicious.\n\nAlso the food!\nWent for brunch and it was full, but still had enough seats available to get seated at the chef's counter (bonus - it's an open kitchen and you get to watch the chefs cook). \n\nBrunch items we tried:\n- Coconut jam toast: Get it. It has a perfectly balanced coconut cream sauce (not too sweet) spread on a thick piece of toast. Yum. \n- Baked egg: I'm not a vegetarian by any means and this definitely had a lot of healthy veggies in it (squash, chickpeas, and lentils) but it tasted EXCELLENT. Usually the problem with such healthy options is that they TASTE healthy. The spices in it made it taste light but delicious. I ended up spooning down every drop of sauce at the end. \n- DFT breakfast torta: Thick, slightly crunchy exterior with spicy chorizo, cheese, avocado, and scrambled eggs in it. Also fantastic. \n\nThe menu is a bit small, but everything on there is great and as a result of a smaller menu, service is fast.\n\nOh yeah... and the beers!\nI especially liked the sour, but also the Shochu (aged in sake barrels) was unique.", "author": "Sylvia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "One of the best breweries in SF and around the Bay Area. Beer is high quality and a variety of styles usually. Full alcohol bar and cocktails as well. Good food menu that runs from some spicy tasty Asian type dishes and unique items, to burgers, chicken sandwiches, and salads. Little homebrew shop next door too", "author": "Alpo H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-13", "description": "Been here twice now...\n\nThe good - really good drinks, both cocktails and beer.\n\nThe getting better - service. Last night super friendly waitress, though still weird you can't order food at the bar unless you sit there.\n\nThe slightly awkward - communal seating, though it kinda works.\n\nAnd the bad... The food that had been so hyped. Quality is ok but prices and range not so much. We ordered a burger and fried chicken to share. Burger was $12 and came w no sides. Nice but not all that. Fried chicken was $16 for 3 wings w some faro in a very vinegary source. It's not as if you can order sides as there are none. Short menu meant food came fast but we ended up having a second meal at Nara.\n\nExpecting things to improve but for now drinks only...", "author": "Diarmuid R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "I was looking for something near the Haight (there's a festival there today). I almost missed Black Sands because it was listed only as a brewery, but it is so much more and amazing for breakfast/brunch. Space is cute and open, staff is friendly and on point, food was amazing!! I tried the avocado toast and the granola. The toast was perfectly fluffy with a nice crust. It came with goat cheese and some kind of nut mix on top. The granola was crispy and perfect. Coffee was great. Another thing I love is that they add the tax to the price already so when they say something is $7, it is $7. It's great. Anyhow, I plan on coming back next week to try the Benedict. I drive to Berkeley once a month to have the best ones at Venus -- I've tried them in so many places in SF to great disappointment. But the ones at Black Sands looked solid - if anything the bread didn't looks soggy which is my biggest complaint. Great spot.", "author": "Miriam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "I think I just found my new neighborhood hangout spot! Totally underrated - they brew their own beer and cold brew! I got a Bloody Mary, which was v tasty.. but $11. A little pricey but well worth it. They have a bit of a hipster vibe // playing a lot of oldies on the speakers. Probably not great for a boozy, loud brunch but maybe solo or with a couple friends -- definitely recommend! I will be back!", "author": "Riley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "Went here for both dinner and brunch. The chicken sandwich is insanely good, and the torta is to die for. Crowded spot, but the service is fast and efficient. Beer selection is ace; the Saison made my night!", "author": "Andrea A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "I love this place! The avocado toast, with an egg, was the best I've ever had. The cream cheese on it tasted homemade. The people working there were friendly and helpful and the WiFi works well. Would highly recommend!", "author": "Aleksandra T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-19", "description": "Worst meal in SF in 30 years. Love the space. The beer is good. The food is a complete disaster. I had enjoyed the space for an SF brew event. It was lively and and had a cool urban vibe.\n\nWent back specifically to enjoy a nice weather day as they have good outdoor seating and wonderful bright light. \n\nWe hit the Snack Menu 4p-6p.\nThe smashed burger was nothing more than a Jumbo Jack with wimpy patties too thin to not overcome. Medium rare was fully cooked with a hint of pink..\n\nThe onion rings are wrong. Never expected to have large papery dried fish flakes hanging off the the rings. This made the ribs taste poorly. If they were thinking to use them to add a salty flavor jut use salt. \n\nMy friend had a cheese dip and tortilla chips with a liquids sauce with a few jalapeños drowned in the sauce.\n\nThis is not grub pub food. It is more like fish food. Some chef over thought the menu and tried to do some crapy samurai fusion. Too bad.\n\nSuper disappointed. I would only go back to drink beer. Also do not recommend to go at 4 pm... There was no wait staff and the bar tender was too over stretched to provide good service.\n\nThe kitchen did get the food out fast. Perhaps there are appetizing things on the menu. Too many stellar places to bother with this one on Haight St.", "author": "Janis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "Black Sands just opened a couple of days ago.\nThe team behind this new operation is young, ambitious and hungry.\n\nTheir breakfast food menu is a testing ground for their inventive recipes.\nLooking forward to see their extended lunch/dinner ideas once it's time.\n\nWhat Black Sands excells in though is their brewing operation with the adjunct hone brew supply store.\nBig thumbs up.\nGreat guidance & great supplies.\n\nI feel it will take a couple of weeks until the service, kitchen & menu are in sync, but am sure when this happens it will be a five star place.\n\nThumbs up!", "author": "Artur L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Really enjoyed this place.  Been here twice and ordered the chicken sandwich both times and both times very tasty.  For lunch it comes with a salad or fries, both great.  You only get the sandwich for dinner.  Came here for lunch on a Friday, not many people at that time.  Came again for dinner on a Wednesday and it was a packed house.  Clean, great decor, and nice place to eat and have a couple drinks.  Decent selection of beers and service was good.", "author": "Anh N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "Great food, uuuuhhh-maaaahhhhzing host (kudos, bro! Witticisms much appreciated), shitty service. The fluffy eggs made up for the wait and the daft apathy.", "author": "Kat F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-26", "description": "The beer (which I have put in my very own mouth and swallowed, firsthand, just to be clear) is, in my opinion, average and overpriced. And the brewing of it results in a bad smell wafting about outside. I follow the owner's personal recommendation and cross the street to avoid the smell. I'm not sure what they suggest for their outside seating arrangement. Maybe you can ask to move your table snd chairs across the street too...\n\nYou can buy a slice of toast here for $5, which is the most expensive slice of toast in my neighborhood (surpassing even The Mill, famed for its astonishingly expensive $4 slice of toast). In honesty, I haven't tried the toast because (in my humble opinion) spending $5 on a slice of toast would make me a bit of a wanker.\n\nAlso, my negative review of Black Sands has been removed twice now, and the business owners have sent me two very condescending messages. Not the best way to get people to like you. Sorta makes me wonder how many other negative reviews they have reported and got removed...", "author": "Kate H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "We picked tjis place by chance while walking down hight st. Quick service, delicious food friendly staff. Nice atmosphere too, a must on haight st.", "author": "Hadas W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "I can't believe it's taken me this long to review Black Sands! When I found out that a microbrewery and restaurant were planning on filling the space at 701 Haight, I was stoked. What Black Sands has brought to the neighborhood is exactly what we've been missing (at least in my opinion!) The food is incredible here- I've been twice for dinner and once for brunch. Highlights so far have been: the shrimp tacos, the veggie burger, and the taco salad. Everything is incredible fresh and flavorful, service is quick and friendly, and the space is beautiful. I also had the opportunity to interview Cole, one of the head brewers, for my company's blog (http://bit.ly/213xc7h) and he was awesome! The brewers at Black Sands are all about helping the home brewing community make delicious beer, as well as serving up unique beers on tap. \n\nIf you haven't made the time to check out Black Sands, I'd recommend you do it ASAP :)", "author": "Eliza D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-18", "description": "REALLY! Can't you at least keep the site updated. PUHLEEZ! it can't be that difficult to do.\n To plan an evening out only to arrive to find the reason to patronize your establishment is beer the beer, and for the beer choices to be not as advertised is DISAPPOINTING. .", "author": "h. w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-17", "description": "This is one of those I want to love this place reviews. Yes, I want to love Black Sands because it's in my hood, it's well designed, has a thoughtful menu, and good liquor. Unfortunately, it fell short of expectations.  The cocktails were more one note in flavor than their menu descriptions and the appetizers were just acceptable. Where it really fell short was the service and the lack of warmth in a neighborhood joint. Instead, it gave me the new SF vibe.  Maybe it's just me...and not Black Sands.  Welcome to your new home.", "author": "Joel A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-13", "description": "Food was expensive and portions were small. The two beers I had on tap were not good. Several draft beers on their menu were no longer available. They need some serious help.\n\nThe service was even worse. The condescending and flat-out rude attitude from at least 3 of the servers/bartenders was shocking.\n\nEveryone we interacted with was extremely confident in answering your questions. Unfortunately, they were frequently (and unapologetically) incorrect a few times during our dinner--served us a sparkling wine and swore to us that it was a sour beer, served us a salad instead of a noodle dish we saw the chef making (turned out to be the \"staff meal\"), etc. No one seems to really care enough to get things right. \n\nWill come back to this location if/when it gets replaced with a new restaurant/brewery in 6-12 months.", "author": "Ryan E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-12", "description": "Pretty space, excellent service. If only I drank beer.  Portions were perfect for my diet. Just wish they had more of a selection. I've definitely visit if I was in the area.", "author": "Leah L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-27", "description": "Review is for the brunch: \n\nThe granola was delicious but the breakfast torta did not stand out and tasted pretty plain. It came with potatoes that did not have much flavor or spice. I don't know about the other items on the menu, but the torta was definitely a pass for me. \n\nThe outside patio is dog-friendly which is nice, though as a note, if you're eating breakfast/brunch here, there is no shade on the patio and it can get pretty hot with the sun on your face as you eat.", "author": "Derrick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Literally the best burger I have had in SF.\n\nKeep in mind I have just moved from Brooklyn, where burgers and meat in general hold a higher place in food. \nThe thing is, if you love thick, raw, fancy restaurant burgers with artesian cheese, go home. If you want an amazing burger that is reminiscent of fast food, but with a higher quality, this is your place. Two thin slices of beef with cheese on each and lettuce and sauce and that's all. Thanks. I don't want tomatoes anyway. The beer is good too!", "author": "Niki S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-20", "description": "My bf and I were excited to try this place being it is close by and after reading the reviews. We stopped in here late afternoon on Sunday for a quick bite to eat. The place was pretty empty so we grabbed a table ordered some beers, fish tacos and a flatbread. Beer was great and the place seemed awesome but unfortunately the same can't be said for the food and service. After about 30 minutes the flatbread came out and we were told our fish tacos were on the way. Meanwhile the people next to us had come in, ordered, received their tacos and were finishing up. After about 55 minutes the tacos arrived with the smallest piece of fish I have ever seen, it didn't even fill half the small taco. Watching the service the food seemed to just go to random tables depending on who grabbed the plate. A new group of people seated next to us also had their order come out wrong and piece by piece. Overall the beer is great but the food service seemed to have no one in charge and the food itself was extremely disappointing.", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "Seriously one of the best burgers I've ever had! Stopped in here for a quick bite around 3:30- luckily they had a few bar eats available, as well as the burger. I got a nice glass of rose, and my boyfriend got the Saigon beer which was also delicious. Great service too. Ill definitely be coming back!", "author": "Izzy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-21", "description": "Excited only to be disappointed.\n\nMy brother had good things to say about this place so I decided to check it out. As I entered I got greeted by this monotone bartender with long hair and a cap (not the friendliest) but I guess you can't expect friendly at 9 pm on a Sunday. Now when I ordered a burger, I also specified to add on bacon and an egg, can't be that difficult to jot that down on a paper when you're taking an order unless of course you are just trying to remember it off the top of your head and when you reiterate it back to me you get it wrong and I have to correct you, oh yah that's what happened. After 15 min, I get my order and specifically asked, \"everything is in here right\" and the long haired cap wearing bartender who is too cool for school just gave me a nod. Didn't think much of it till I got home only to see my burger had neither of the add ons I had asked for along side some over salted mcdonalds looking fries.....  Blacksands SF , thank you but no thank you.\n\n$5 of non existent add ons, over priced food with jack in the box quality, I rather save my money and visit The Grind Cafe up the street for wayyyy better tasting food, better service, and where they actually write down your order when you place it!", "author": "Marlon M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-02", "description": "The entitled hipsters who work there need to get over themselves. Similar to the situation of another reviewer, my experience had to do with the militant closing of the kitchen at 2 pm (on a Sunday). I arrived at about 1:42 and was promptly told the kitchen was closing. The server hovered over me until I ordered. I order food then a cocktail. Five minutes later the Benedict I ordered comes out and I can see the under cooked eggs jiggling around but I decide to taste them anyway. Stone cold!! I send it back and, presumably because the kitchen wanted to get out of there, the server has the audacity to come back to me with my plate and say that these are poached eggs and do not looked undercooked to him. I tell him that they are and that I'm beyond annoyed about how rushed I was at a quarter to 2. He tells me last call was at 1:45, like I should care. the menu and website says 2, not 1:45. So I get up and tell him that he's just lost my business and walked out. Never again. You get one chance to impress. And I wasn't going to sit there like some of these masochistic SF diners and eat something that wasn't cooked properly.", "author": "Mark V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-02", "description": "It's tough to stand out as a micro-brewery in San Francisco, and as a Haight resident I wanted to love Black Sands. Unfortunately, the few brews they have are average - your run of the mill hoppy IPAs (and if you don't like hoppy beers, good luck). The interior is modern and clean, but to me, it lacks soul. There isn't really anything that stands out about Black Sands except the home-brew pop-up shop and funky bathrooms.", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-14", "description": "Great beer and great for breakfast but at night this place attracts an insufferable crowd.", "author": "Bradly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-08", "description": "Came here late at night to grab a beer and burger with my friend. I had the son of man, the garlic fries, and the fried chicken sandwich. Everything was delicious. I especially enjoyed the garlic fries. They did not skimp on the garlic and the wedges were warm and fresh. The servers were incredibly friendly and attentive. This is a great chill spot to hang out at.", "author": "Manpreet B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Delicious beers and the nicest bartenders in town. They have a full bar as well if you enjoy cocktails. I'm excited to try their food - it looked and smelled good! Well done Black Sands.", "author": "Brooke S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "Great neighborhood pub with good beer selection, bar scene, and food. The cocktails are pretty good too. Nice to be able to saddle up to a bar and watch the wiggle bike riders roll by outside. Also nice to have a mid-range, comfortable and clean bar to bridge the gap between dive and more upscale spots.", "author": "Todd H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-04", "description": "This review is a month old, so hopefully they have found their stride.\n\nWe showed up on a weeknight and found the place packed.  There was a crush of people at the bar and the bartender was pretty clearly overwhelmed.  We tried to stop a server to give our order.  We were told to order at the bar.  Server explained to us that \"we are a brewery, so we don't do table service.\"  This line of reasoning makes no sense when you consider how many breweries in the city have table service. \n\nWe noticed people squatting at tables (seating is at a premium) while waiting for friends to show up.\n\nOur food was excellent, the burger perfectly done, and we all raved about the tacos.   But it took a really long time, and servers kept trying to bring us food that other tables had ordered.  It became a joke between us and the two tables next to us, that we were just going to start claiming each others' food.  People were good natured about the hiccups, but there was definitely some collective eye rolling.  \n\nMy husband and I both had the beer flight; the beers ranged from fine to \"wow, would totally drink this on the regular.\"\n\nWe would love to return, because it's a gorgeous space and literally on the block we live, but it takes too much energy to deal with the uneven service, when all you want is a good beer, good food and to enjoy the company you're with.", "author": "Lorin Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-28", "description": "Beer is fine, atmosphere is fine. Their breakfast foods aren't great, but their lunch menu is. Heads up that their website is wrong and the lunch menu/burger/fried chicken sandwich is not available on weekends.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-16", "description": "The decor of Black Sands is superb. White marble accented with light colored wood gives the restaurant an elegant air while hearkening back to an old world atmosphere. The space feels open and airy, a great place to spend a late summer afternoon.\n\nThe food, and especially the beer, were quite good. The pickled vegetables were delicious, and the chicken wings were a pleasant surprise of flavors. The burger was unmemorable. There was a house saison on the menu that was really fantastic, would highly recommend it to someone that enjoys Belgium style beers. Only complaint in the food department was that there were only three chicken wings in the order. Typically chicken wings means sharing in a group setting, but it is a little tough to share three. Also $16 for three wings is a bit outrageous.\n\nThey still have a lot of kinks to work out, mainly in the service. It was unorganized and a bit chaotic. We were seated at the chef's bar, but our waiter didn't show up for quite sometime, leaving us to wonder if we were supposed to be ordering somewhere else. Beers took an abnormally long time to materialize, waiters were unsure where to make room to put plates down, a split burger to share came out on one small plate.\n\nOverall I would give this place six months to mature, master their logistics, and then come back and try the food again. In the meantime, I would definitely pop in for another one of the saison's.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "The lunch specials here right now are amazing!  I go twice a week and order the chef's special.  Exceeds expectations every time.", "author": "Mahdroo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "This place is a haven for lovers of quality craft beer.  They have a reasonably priced beer sampler (aka flight!) and some amazing barrel aged beers.  It's very spacious and modern, and a great place for a snack.  This was just the right place I needed to go for a relaxing few hours, and the staff were very friendly.  Truly excellent memory of San Francisco!!", "author": "Ian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "I just stopped by Black Sands for post dinner drinks. The Black Saison beer is delicious. Their fries are so good - fingerling potatoes with a tasty dip.\n\nDefinitely worth a visit!", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "great addition to the Lower Haight.  I tried all of their beers that they make in house and they're all pretty tasty!  Even their carrucha (tequila) cocktail was really good.  The food is also pretty good for a brewery!", "author": "Tammy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "Glad to have this new addition to the neighborhood. While they are no toronado in the amount of beers they have available, their made on-site beers are great and worth a visit. And as an added bonus, their menu clearly marks off the items that are vegan and vegetarian. Ill have to check out the food soon and report back.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Black Sands is a huge addition to the neighborhood.  The food is delicious, unique, well-priced, and a cool mix of creative & down-homey.\n\nNow, lets talk about the more important part: the beer.  What the founders of Black Sands are  doing is soon going to be legendary.  From the new beers they are constantly creating which are full of flavor, to the in-store beer supplies, this place is dedicated on a level you rarely see.  Stop by to talk with Andy, and he'll take the time to teach you tons about beer brewing.\n\nAlso, the design of the restaurant is top notch.  Not sure what more to say other than we are pumped to have this place in our neighborhood!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "Quickly becoming my favorite breakfast spot. I haven't tried any of their beer, but all of the food and coffee is great. The granola and yogurt is probably the best I've ever had. I expect this place to become a lot busier in the coming months.", "author": "Jacob S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "First official day serving dinner here and there's only one person taking food orders. I counted three guys busing tables and none of them were able to take our order. So we sat and waited until a patron suggested we go to the counter and order. That was a crap shoot. Bartenders only take drink orders which is fine because at this point we just wanted our \"beer for life\" for supporting establishments like these in our neighborhood.  \n\nThey are still working out the kinks. More than one person taking food orders would help and I noticed the bathroom line was six people deep!?! I can only imagine what'll be like when the place is packed. \n\nWe'll have to try dinner another time.", "author": "Eileen Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Great beer, wonderful setting on Haight. If you need beer brewing supplies, this is the place for you in SF. Been waiting since the Indigogo campaign, and excited they have finally arrived in the 'hood. \n\nStaff is super passionate about beer and brewing, and we get to benefit.", "author": "Ben R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "Black Sands is near the top of my best bars list. Shannon is the perfect bartender - warm, funny, and skilled. The in-house brews are crisp and interesting. I favor IPAs, and BS's are wonderfully hoppy. Clean, modern, decor; clear views of the masterful chefs, tanks, and bartenders; and a really cool restroom. And a pretty easy walk from the N (Duboce Park).", "author": "Savvy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "One of my friends recommended this place to me and I am so glad she did. I came here for breakfast and omg the granola is amazing!!! I have never had granola that tasted this good. I would definitely recommend this place for anyone in the area it will not disappoint not to mention it's a bar at night.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "Amazing Food! Fantastic service! Bloody Mary's are the best I have EVER had!! We're planning a trip back before our holiday is over. \nThe entire experience of dining out- casually was perfect here..", "author": "Leanne E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-17", "description": "Really wanted to like this place, as it's a block away from my apartment and looks really cool.  I've given them three tries though, and it has been brutal.\n\nVisit 1: brunch at the bar.  Not very busy.  Waited nearly an hour for my food.  Clearly there was a glitch.  Finally got served.  Bacon was super cold.  I asked for a replacement.  That order was warm but super fatty.  Gravy biscuit was so-so.  Food overall a 2.5.  They apologize for the order mix up and discounted the bill.  I appreciated that enough to not write the place off.\n\nVisit 2: walked in around 3pm. Place was DEAD.  I ordered a cold brew coffee to go.  I was told, sorry, we don't do take out coffee service after 2pm.  I thought that was super weird.  Why would you turn away customers when your staff is just standing there twiddling their thumbs.  I can see if it's 8pm and you have a packed bar, but when there is more staff than customers? Doesn't make sense.\n\nVisit 3:  (well, not a visit). I was in a big rush on a Sunday morning.  I called around 11 am and asked to do a takeout order.  I was told \"you have to come in person to do a takeout order.\"  WHAT?! I can understand a no-takeout policy.  But what the heck is a \"take-out, but only if you come in to order\" policy.  That kind of defeats the purpose of trying to save time....\n\nAnyway.  Two stars. Cool design, recognized their mess up on visit one with the discount, but I'm down.  Maven down the block has a similar vibe, better food, an normal policies.", "author": "mario k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-13", "description": "The Food can be summarized as creative or improved interpretations on ordinary traditional food. \n\nThe Garlic Fries: described as a refined version of the standard ballpark treat. Too many times at the ballpark they are soggy, cold, and too expensive. Black Sands has made these fries what they were meant to be. Sit at the counter in front of the kitchen and be smacked in the face with a pungent garlic cloud every 120 seconds, until you cry uncle and demand that they make an order for you too.\n\nThe Burgers: Comforting in the best of ways. They need a chocolate milkshake on the menu if they don't have one already.\n\nThe Wings: Don't ask questions, just put them in your mouth and chew.\n\nThe Beer: Constantly rotating and creative. They've produced one of the best IPA's I've had.\n\nThe Bathroom: Trippy.\n\nThe evening atmosphere: 78% nitrogen, 21% oxygen, 0.9% argon, 0.03% carbon dioxide, and 100% 20 to 30 somethings crowded into a cacophony of social relaxation.\n\nThe people: Beautiful. and so are you, according to the storefront.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-06", "description": "DO NOT GO HERE!  Want a good reason? I'm a local on Haight Street.  I recently had crutches and simply wanted to get out of the house for a bit and arrived at Black Sands about 1 minute after 2pm (remember I'm on crutches) which was 1 minute after what they post as the close time for lunch.  Not only was the bartender rude but when I asked, please - I'll take whatever can be made easily and quickly and noted that the restaurant was still fairly full but he looked at the clock and said NO!  Not an I'm really sorry, nothing!  What type of business treats locals like this?  The locals that will most likely help keep their business open. I will never go back here and will never recommend and equally, if someone asks about it, I'll tell them what others have reviewed.  CRAPPY place - don't go.", "author": "Abbe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-22", "description": "Met some friends here last night - really fun.  Beer is good, food is very good and the staff is the best.  The warm olives, tostadas, chicory salad and brussel sprouts were all very tasty.  It's a small space that got loud as it populated and a long wait for the bathroom; otherwise 5 stars for sure.  We will definitely return", "author": "Kim G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-25", "description": "I've been trying to get myself over to Black Sands for the better part of three weeks now and I'm pleased to say the wait was well worth it.  Got in just before 6, right when they start serving food, and the place was pretty much empty.  Grabbed a seat at the bar and readied myself.  Note to anyone coming with a large group, Seating is at a premium here if you want an actual table. I counted probably only 6-7 tables and only one was a 6 seat table.  On the other hand  they do have is seating all around the perimeter of the bar so it was easy enough to snag some wall space.\n\nBeers/Drinks 9/10: Black sands has a rotating cast of beer.  MY drinking companion and I decided to try what was Black Sand brewed to get the full experience but there were other beers on tap and in bottles.  The SMASH Ella Saison was flowery and not overly sour which i liked.  Had good color and I could have easily drank a kegs worth.  The SMASH Mosaic IPA was another great house beer. One interesting thing was by the time we were ready to order our second round they told us that they were already out of the Mosaic.  This befuddled my companion and I considering that it was only about 7:30 but i'll chalk it up to it being the favorite.  The bar also had an extensive cocktail menu.  I ordered just your standard Manhattan to see how it stood up and was very pleased with the results.  THINKING they may have had home made bitters but didn't ask.\n\nFood 9/10:  The menu is not the longest in the world for dinner but they hit all the right notes for shared plates and good entrees at a reasonable price.  I ordered the fish tacos and loved the spicy chipotle sauce and radish like slaw.  Friend had some sort of fried rice with a fried egg and this did not last long on here plate before she unhinged her jaw and engulfed the plate.  Wish we had tried the side of fries, we could smell the garlic aioli wafting from the kitchen.\n\nCannot wait to go again on a free night and recommend you do the same.  Friendly bartenders and a low key scenery.", "author": "Ryan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-07", "description": "Black Sands is a fun place to grab a beer or brunch while catching up with friends. I recommend the veggie scramble. The only downsides are $2 for a refill of coffee and the interior coupled with the clientele's fashion style will make you feel like you are in a restaurant/bar from the HBO series \"Girls.\" Update: 80s denim with no belt and a full display of camel toe was never a good idea, but thanks to the fashion trends set by said tv show, it's on full display here. Oh well. To each their own. Black Sands is a well located and inviting place that is easily accessible from all areas in the city.", "author": "Mark H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "This food was amazing. Whoever plans these meals has his shakes aligned. Some of the best food in a city that's littered with amazing restaurants. Hats off to the chef team.", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "Excellent, brand new restaurant in the Alamo Square area. Coconut toast dish was surprisingly sweet with a great, creamy texture. The breakfast torta was my favorite dish on the menu. Fresh avocado blended with scrambled eggs and sweet onions. Basically a poached egg toasted in the oven for a few minutes, with some excellent grilled bread and chick peas for some great texture. Coffee was also freshly brewed and delicious.\n\nThey also have a fantastic beer selection - I had the pilsner and a great shochu barrel aged stout. Looking forward to them starting dinner service and adding the cocktail menu. The head chef Eric mentioned that the director of the cocktail menu from Lazy Bear is going to be joining and I love their drinks!\n\nGreat start to the restaurant. I have a few craft brewing friends I'll also send over - looks like they have a great setup for brewing.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-26", "description": "The atmosphere is great for a drink and the beer is delicious, and for that this should be a five star review. The only reason it's 4 is because I ordered ribs and they were awful, my friends got the burger and loved it so, for next time I'll go there for the beer and enjoy that for what it is :)\n\nDon't expect too much from the food but the beer is amazing!", "author": "Sara A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "New place on Haight. Coffee and brunch by morning, bar by night.\nWent here for brunch today. The menu is small, but the coffee and food was delicious!", "author": "Haley K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "This is based solely on beer, atmosphere, and service, but I think I'm in love!\n\n Simple aesthetics, good music, bright and spacious\n\nReally good beer, friendly service with an edge\n\nI would really like to come back for brunch post haste. \n\nThis place is the perfect companion to my record digging at rooky ricardos and groove merchant.", "author": "Caddy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-16", "description": "Atmosphere: 4 stars- airy, light and fun atmosphere during lunch time. Good music too!\n\nFood: 3.5 stars- we had the BBQ pulled pork, it was good not great. It's apparent that it is fresh quality food but it's missing flavor- it was too bland for my taste. \n\nOverall, it's a good place. I would come back to try the dinner menu as it has more options.", "author": "Joanna F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "We have been waiting FOR MONTHS for Black Sands to open.  Having read Hoodline news and past it in the mornings on our morning runs. While we thought it weird that they had previously had a small open house in which they sold wares from their other stores, we thought it would be good to try their breakfast offerings on their second day of their soft opening. \n\nWe had their matcha latte (good), banana bread (very good ), summer scramble and chorizo egg torta sandwich (both very good). The chorizo was pretty spicy, I loved it! \n\nAmbience is nice with jazz music and some saw dust still on their tables and chairs,  however,  they give you numbers but then don't bring you your food or drinks although they felt embarrassed about it after inquiring. I suppose it's growing pains. \n\nMy girlfriend calls it bullshit. Having been to plenty of new places and soft openings  and given them a generous tip this morning.  This customer detail is more than disappointing.  \n\nWe will back for the brews, and I really hope they improve their service,  it will really suck that our long awaited newest watering hole will be for naught.", "author": "Nabil B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "Nice bar in the lower haight neighborhood. They also brew their own beers, which is pretty nice. The place is nice inside and they have a little terrace for the sunny days. \n\nTheir cocktails are good but the quantity is very small for the price. Same thing for the food, it's great (especially the fries) but there's not much in your plate for the price.", "author": "Margaux M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-13", "description": "Dirty bar, no acknowledgment for over 10 minutes of sitting down. Finally he asked if we needed menus and he passed them over our heads to people behind us who had just walked up. incredibly frustrating poor service. Ended up walking out at that point, tons of places in the area and no need to be treated that way. We live in the neighborhood and have tried multiple times to make this place work, but have been shut down by the extremely bad service at every turn (with the exception of the morning espresso crew). Disappointment at every turn here, masked by trendy hipster shit.", "author": "Kira M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-28", "description": "I went there on Tuesday 5/26 at 7pm for a happy hour.  Three of my friends got there before me and there was one house beer available on tap that they ordered.  By the time I got there, the beer was gone and there were zero house beers available (just guest beers and cocktails).   For a place that calls themselves a brewery in a city like San Francisco this is completely unacceptable.  Was told that they had a busy weekend the prior weekend but what kind of excuse is that?!", "author": "Chad P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-30", "description": "Finally tried this place for brunch. Super mediocre.  Weird menu choices, and overall sub par taste. Maybe lunch and dinner is better?  The music they play is good at least.", "author": "Max K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "We usually don't like California IPAs but these beers were delicious! Found out the brewer is from Ohio so it tasted a bit like home. Food was also great!", "author": "Brittany R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "I was highly skeptical of their menu as each item is so completely foreign and seemingly an artistic take on traditional bar food.  I've just ordered the Taiwanese Fried Chicken and it is so insanely delicious that I've been inspired, after first gobbling them down, to write a review.  My sweet and highly knowledgable waitress Kaly is attentive even despite the ever-growing crowd and she was able to walk me through the beer list til I found a thing I thought she'd like and I do indeed like it.  Really nice atmosphere: the lighting is dark and even though it is I'll I *can* still hear myself think and communicate with those around me without shouting: and the family style seating makes it so accessible. Top notch spot.", "author": "SR B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Congee was fantastic, and service was, for the most part, good.  The only negative was the tiny water glasses they provide and one hostess's refusal to bring larger water glasses.", "author": "DarkwingDick _."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "This is one of my fave spots! It's perfect for any time of day. They have delicious coffee, and outstanding lunch. All fresh ingredients, but obviously is prepared by hand. The staff is friendly, nice and welcoming. Plus, a great spot to come grab a drink! Highly recommend.", "author": "Venetia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "Fried chicken sandwich, beers and cocktails. All so good. Restaurant and service are quick and friendly. Interior is clean, trendy. Highly recommended.", "author": "Amy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-27", "description": "Well atmosphere would score about five stars but due to inattentive can't be bothered bartenders a two seems overly generous. High hopes but just because someone hires a designer doesn't mean they have the vision as to how to treat customers.", "author": "elizabeth m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-30", "description": "Very few beers that they brew themselves. Only 3 on tap. With that said, their saison was great. I am not an IPA person, but my fiancé is. He liked both that they had. Didn't try any food. Very small place. But would visit again. (They had a bunch of cocktails on the menu too!)", "author": "Cheri E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-26", "description": "The selection is great, and the staff are pleasant. I'll definitely be back.", "author": "Justin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Had the dark rye IPA, complex and completely drinkable.  Looking forward to trying more...", "author": "Larry H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-15", "description": "Had a lot of fun here last night with some friends. The burger is first rate- one of the best in the city. Great fries, fantastic beer selection. I really like the \"seat yourself\" style too. I'll be back.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-31", "description": "I have been so looking forward to the opening of this place. I have been here on more than one occasion for their beers. This is NOT a review of the beer, which is very, very good. This is regarding the food. I tried Black Sands about a month after opening for food and beers. Hated the food but thought it was opening issues and they needed to work out some stuff. \n\nI gave them a second chance today. \nThe food is bad. \n\nPlease,please,please investors/owners/managers bring in some food consultants. The menus need a complete re-hauling and you need people who can cook. \n\nCouple of suggestions: \n1. Hot food should be hot; cold food should be cold. Don't serve salad on a hot plate. Polenta should be very hot (and throughly cooked). You would not serve a cold beer in a warm glass would you? Try the polenta at Brenda's. That is how polenta should taste. \n2. Season the food. Salt and pepper is your friend. \n3. Weird combinations are just that - weird. That's why they are not done by others. Keep it basic. It's a pub. \n4. Don't try to be everything to everybody. Again, it's a pub. Simple food done right will fly out the door. \n\nThe place is beautiful inside and I know a lot of money must have been spent on the remodel. Now just spend a bit more on a food consultant and go simple. \n\nI do want you to succeed. I'll wait until the new year and give it a shot again. Hoping third times a charm.", "author": "Maggie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "I came here with my mum for lunch as we were visiting Haight St. I live in San Francisco (she was visiting from England) but I didn't really know where to stop. This was a great choice. We had a little mishap with the food order (it didn't go through to the kitchen so we had a looooong wait) but it was so graciously recovered by our server who was absolutely lovely that neither of us minded in the end. Also, the food was TASTY & that's what counts. Will be back with friends!", "author": "Fi M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-19", "description": "This place has a cold interior.  The bartenders were rude.  They had run out of grapefruit juice for drinks.  Worst of all, you could not put your name on a list for a table, or talk to a host.  You had to \"hover\" around a group of people at a table in hopes of possibly getting a seat.  This was unpleasant both for us and for the people still sitting at the table.  People sitting at other tables were trying to take tables next to them as soon as people stood up forcing us to tell them that we had been waiting for the tables.  YUCK!!!  Will never go in there again!! \nFinally, it was truly depressing to see that there could even BE a place like that in the wonderful Lower Haight area.", "author": "Maureen O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "I haven't tried the beer they brew, but the food is surprisingly good, consistently.  I think the kitchen staff have there shit together.  Unfortunately the female bar tender here is extremely rude, consistently.  I've had no trouble with anyone else, they've all been helpful, don't make faces, and huff and puff when I order food.  It's disappointing because I've lived in the neighborhood for a very long time, and this could be a cool hang out.  The food isn't worth being treated like shit.", "author": "nathan w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Excellent Beer and Excellent food. Always happy to come and check out the latest brew ... Constantly impressed with the quality and taste of the food. Excellent cocktails as well.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "Oh f*ck yassss!  More please.  Sh*t!  What the h*ll have I been eating for brunch instead since this place opened six months ago?!  D*amn.  It's not often that I'm a Johnny Come Lately in my own neighborhood.  I'm kind of an OG of the LH, I am a Lower Haightian (that totally predates Lower Hater for all you sniveling little children that think you have a good deal on rent since you started commuting on special shuttles to the peninsula from this hood a few years ago).  But I digress, everyone has to eat... and you should eat well... so you should eat at Black Sands.  The BF (a chef, trained in Paris, lah di dah he's kind of a big deal) and I just had a spontaneous Eating For Sport experience.  Bourbon Apple French Toast, Frijol con Puerco, Breakfast Torta Plate (gluten free cause I wanted tortillas) and California Rice Porridge.  My honey had a Floricane (gin, prosecco, citrus breakfast cocktail) and I had the Shakito (cold press coffee with rum, shaken and strained).  Each item induced involuntary tastebud orgasms.\nThe space looks amazing (hard to believe it used to be a shady laundromat).  We sat at the kitchen bar and watched the chefs do magic.  Their front of house staff was very attentive, nice and cool (but not in an over bearing hipster tech douche kind of way).  Will be back.  Often.", "author": "Aimee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-26", "description": "Great little homebrewing equipment shop.  I dropped by here just to pick up a few standard supplies, which were easily available and in stock.  \n\nCole was enjoyable to talk to.  Very knowledgeable and told me what I needed to know about sanitizers and gave a couple tips on the beer I am currently brewing.  He also introduced me to a useful piece of equipment for siphoning and took the time to explain it to me. However, he wasn't pushy about selling it after I said I'd think on it.  \n\n To top it all off, they take credit cards through square so no worries if you don't have cash.  Prices are generally comparable (within 15%) of what I usually buy online. Very convenient location. I haven't used the online order for pickup in store option but that also seems convenient.  I'd say the only disadvantage here is that they are a pretty small shop, so if you're looking for some really specific piece of equipment, you might not be able to find it here.  So just check online before you come into the store.\n\nOverall, I had a good experience and will be returning for future brewing needs!", "author": "Dan Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-12", "description": "I was quite excited to see that Black Sands is now open, as it looks like a cool spot just two blocks from my house. I tried to check it out for lunch today with a friend, and I say \"tried\" because after walking in and sitting at the bar for ten minutes, no one even looked our way or acknowledged we were there. Eventually we just left. Pretty lame, as I was hoping this would be my new neighborhood spot.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "Love these guys. Great to have a neighborhood homebrew shop.\n\nCole and Andy are super friendly, very low-key guys. Always happy to help build a recipe or give some input. \n\nCan't wait for the brewpub!", "author": "Sam C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-18", "description": "Service was not good the time we went.  We did hear back from the management which meant a lot; as members of the SF Brewer's guild we were disappointed about the overcharge as well, and the way we were treated.  My gut still tells me this may be an issue there, but at least they acknowledged looking into it.  \n\nAgain, acknowledge the immediate response to our concerns which is well intended.  Thus, moving to 3 stars.", "author": "Angela R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-07", "description": "I really wanted to like this place.  Came here at 4:15 on a Friday.  Pretty empty, I know, it's early...however, we felt like we were bothering the \"zero personality\" bartender.  Sorry we asked a question about a person we knew who worked there.  Actually, even the brewers didn't say hello as they were in the doorway when we entered.  We weren't even sure they were open.  We ordered 2 16 oz. of their brews which were okay.  We were looking forward to eating but they don't serve food until 6 pm.   \n\nHoneslty with all the other options in the city, we will not be coming back here.  Too unfriendly & sterile!  We headed down to Tornado, thanks very much!", "author": "Donna W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-12", "description": "What a disappointment! I've waiting for this place to open for so long and it's basically The Mill #2 with beer. I was hoping for a fun spot to drink a beer with friends, but this is an all encompassing coffee shop/restaurant that just happens to serve beer... I thought it would be a little bit more authentic.", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "Really good food, but very noisy place... I come there during week, otherwise there is way too much noise during weekend because way more people. It's also a pretty place, well decorated.", "author": "Michèle B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-05", "description": "Perhaps I will write an update with more stars in the future but so far the experience here is too inconsistent to give them more than 2. \n\nThey don't have published hours yet, so I have on several occasions tried to go there with friends, only to find the door locked. \n\nAnd although their coffee and pastries are great, the few times I've actually gotten into the place, there is no sense of urgency in filling the order. I have on a few occasions had to leave without my order because I waited so long -- while the folks working there are busy chatting up other customers. \n\nThere's clearly been a lot of effort and passion put into creating this business over the past year or so, but I think they need to step up their service quality and consistency if they don't want to become a cautionary tale. \n\nNot so sure I'll put in the effort of trying them again.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-08", "description": "Solid modern gastropub in the Lower Haight.  We came here looking for dinner on a Saturday night and found seats at the bar immediately. The space is California-industrial and features table seating with substantial bar seating and also chefs table seating. Cocktails and beer were solid as expected but the food was surprising - first, the prices were actually *reasonable* compared to other gastropubs in the area and on top of that the portions were real portions (not the dreaded *shared plate*). I think this would be a really nice place to meet friends in the area without having to feel like you rationalized your meal after seeing the bill at the end. Also it could be a good date spot as well (good drinks and cool ambiance especially if you sit at the bar or chef's table), although I think the people sitting next to us were on a first-ish date and they had to watch me eat my double cheese burger sloppily next to them so it is what it is.", "author": "J L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Excellent veggie burger, second only in my experience to the one at Houstons/Hillstone. In fact, I think they may have copied. Both use beets as a base, though Black Sands' beets are much chunkier (which was tasty but made the burger fall apart).\n\nWould be 5 stars but the brussels sprouts had a 80:20 ratio of oil to sprouts.", "author": "Charles D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "When I realized a micro (maybe nano) brewery was opening so close to my apartment, I was immediately excited. When I realized it'd be over 6 months before they opened, I thought they would never meet my anticipation.  However, they have exceeded my expectations. The place is run by beer lovers who just seem to want to share their passion for beer.  The small craft brew store they open is a great example of how they demonstrate this.  However, black sands is so much more. Their menu, although limited, is delicious.  Everything I've eaten has beaten my expectations; torta, noodles, burger, curry special, etc.  Even their granola (something I usually overlook as boring for a meal) is incredibly good.  Oh, and of course their beer is pretty solid too. The only thing I'd like to see is more beer on tap!  Thank you black sands!  You guys are great!", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "I live right around the corner and I couldn't be happier to call Black Sands my neighbor. They brew their beer in small batches so there's always something new and exciting on the beer list. I have a lot of food restrictions - strict vegetarian and no dairy - and it's always easy for me to find something delicious on their seasonal menu. Great service, stellar beer, delicious food, in a beautiful but not overdone environment; I'm not sure what else I could ask for from my neighborhood bar. You should come here!", "author": "Christina E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "Bartender with the beard:\nYour job is to get people beers not try and bang the customers. I waited for 10 minutes and you never glanced our way once. Please just try and forget yourself and make black sands the awesome place it should be. Because it is. If you don't get in the way anyway.", "author": "Chris A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "We only drank. They have a full bar, visiting taps and 3 of their own. Points for having the grand cry sour bottles (my favorite). Their pale ale and saison are equally tasty with refreshing flavors and not too much intensity.", "author": "Zara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Delicious biscuits and gravy paired with a flight of solid house beer! What more can you ask for besides a friendly bar tender. Oh ya they got that too!", "author": "James W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "I'm so glad Black Sands finally opened! Great beer and a wonderful space. The food is also really good. It's going to be a great addition to the neighborhood!", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "Awesome spot in lower haight that is well decorated, reasonably affordable and delightfully delicious. The brewery/kitchen opens at 5pm and 6pm respectively, so be sure to have something in your tummy before drinking a for a full hour. I had the coffee milk stout and my wife had a cocktail that had the word sin in it. The stout was fairly complex and not too heavy (5.6% abv), I'd easily drink it again. For food I ordered the crispy rice salad (vegan) and my wife ordered the cheeseburger. Both were awesome and chef Eric made sure I enjoyed the rice salad before getting back to work in the open kitchen. Will definitely be coming back!", "author": "Anthony S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "The food by Eric is impeccable! The burger is the best in the city! The vegan taco salad: I didn't even miss the meat and it's mind blowing how good it is. The brussel sprouts; I don't know what type of sorcery he used but it was phenomenal and I want to replicate it myself! Everything that comes out of his kitchen is wholesome, delicious,  and out of this world AMAZING! I wish I could eat here every night!", "author": "Kate Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "This is my weekend breakfast go to spot. The Breakfast Torta goes great with a cold beer, especially if they have a black IPA or stout on so you can make the excuse that you're drinking something with a coffee flavor to it.  \n\nFor lunch and dinner, their burger is one of the best around, and they've added some more options for sides to round out your plate. The sauces the chef makes have been amazing on everything I've tried. Split a plate of the friend chicken for an appetizer, its the best I've had in the area. \n\nBlack sands makes some great beers which are constantly rotating so you can always try out something new. I like their SMaSH series beers so I can try out different hop varieties. \n\nCheck out the homebrew shop next door that's open on weekends. It's a great place to pick up some ingredients and chat with the knowledgeable guys that run it. They will give you a good recipe or set you up with everything you need if you are just starting out.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Our favorite neighborhood bar/restaurant. Food is excellent and better than just typical \"bar food\". The guys here did a great job on delivering quality food and drink. From great coffee to good food - this place is a lower haight gem. If you are expecting a bar scene, this is not the place however if you are looking for a cozy date place or good chill place with friends, this is perfect. Tables are first come, first serve so expect to wait for a table if you are a group of people as it's a small space.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-06", "description": "Checked this cool new brewery out last night. Sadly, they were out of the Patagonia Pale Ale. I had the hoppy rye ale, brewed by black sands. Very delicious. I also got the fries for a snack. They were tasty but I wasn't a huge fan of the homemade green goddess dressing. Looking forward to coming back soon. Oh! And our server was super attentive.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "I have only gotten coffee. The cold brew was okay, the cappuccino was really good.  Service is nice but sort of standoffish.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-15", "description": "Well priced beer and food.The house beers are quite good and the location is just amazing. A minor drawback is that the place was super warm and the beer should have been a bit colder. Will give it another chance at al later date.", "author": "Juan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "Good neighborhood spot in lower haight. Great space to hang at any time of day. Their beer selection is not huge but most people will find something they like. I've gotten their breakfast sandwich which is delicious, try it out!", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "Just opening, this place is going to be great.  Nice space, good food, excellent beer, friendly staff.", "author": "Georges S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Stellar atmosphere, great staff, and the food is delicious and original, stands out even in this city. Will be sure to return!", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "I've turned Black Sands in to a regular occurrence for me because the food and drinks/beer are just low key incredible. I'd suggest it to anyone looking for a delicious yet casual evening. Awesome place and great people.", "author": "Anush V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "Good food with great value.  Great beer.  A fun find.", "author": "Debra S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-19", "description": "Super fresh wheat beer this morning! Also tried the stout - perfect chocolate and coffee flavors. Food was okay - tried the breakfast polenta and chile verde. Smaller portions and not super filing. Toast was great though. Beautiful interior and great service. Would go again for beer and to try the dinner service.", "author": "jennifer m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-13", "description": "The breakfast torta was so good we ordered another round. Good beer and a great atmosphere. Is come back if I had the time on our vacation.", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-31", "description": "Interesting beer and cocktail selection. I got a sour cherry beer that was super tasty! We sat at the bar and enjoyed watching the chefs whip up delicious looking noodle dishes in the open (and very clean) kitchen. Would go back to try food next time.", "author": "Tessa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "This brewpub has a great selection of house and guest brews, I particularly loved the double ipa. The food is average, thought the lamb noodles were over hyped. Friendly and helpful waitstaff and a great location made this eating and drinking experience quite pleasant...", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "Went to Black Sands a few weeks ago. I live across the street and love that there is even more opening up in the area! I had the cold brew and a chorizo breakfast sandwich. Both were great! I thought the sandwich was a bit expensive for what it was. I want to say it was $10+ when it should really be something like $6-7. \n\nI love the environment: open, clean, and spacious.\n\nWould definitely come back here!", "author": "Viet N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "The burger and fries were the best I've had in a long time!!! Highly recommended and cool chill spot!!", "author": "Julia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-10", "description": "San Francisco mediocrity. I went with a friend the another night and we sat at the bar. The wait staff was confused and couldn't be bothered to be helpful.  I had the burger, which was really an $11 big mac.  Actually, thats an insult to the big mac. there was no flavor, it came with nothing, the bun was just bland, the patty was crunchy (not how i like my burgers). I mean, I'm not a big fan of maven across the street, but their burger just kills this place. My friend had the taco salad and she did not like it one bit.  Even the beers were boring.  How can you have 12 beers on tap not one is drinkable.  It shocks me that this place can exist, but then i remember that SF loves mediocre boring food presented in a fashionable way.  Try at your own risk.", "author": "Noah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "I just did an end zone dance with tears in my eyes, this place is so good.  And as an extra plus, the cool kids haven't quite figured out that this place exists, so we've never had to wait to be seated (though I expect that to change soon).  So Black Sands opened up on a pretty inconspicuous corner of Haight Street.  It doesn't have much signage (if any) on the outside, so it's easy to mistake as just another overpriced SF living unit.  But if you actually notice the glass door leading into a dining room, consider yourself in luck.  What lies inside is a food and drink experience that will make you ask \"why have I not coming here my whole life?\"  For starters, it only opened last year, so i can forgive myself for that.  What is somewhat less forgivable is that I haven't yet tried everything on my menu. But that's also difficult since they rotate their dishes quite frequently.  But, alas, the dishes I have tried have all been ridiculously delicious.   Ridiculously.  I have come at breakfast, for pre-dinner snacks and cocktails [yes, the concept of pre-dinner snacking is totally acceptable to me], and full on dinner.  Blown away every time.  My most recent meal involved a fried chicken sandwich, roasted fingerling potatoes, pumpkin seed hummus, and some bourbon.  In short, it was perfect.  I've actually had their fingerlings on a few occasions [they are part of the starters menu, which they begin serving at 4:00] and feel that every meal here should start with an order of these.  Also notable are their cocktails.  I'm no longer 21, so I really detest sweet bombs.  However, i find a lot of cocktails that are intended to be less spring-breakish to be, well, disappointingly odd tasting.  Not so at Black Sands.  Their cocktails are subtle and smooth and will make you feel like a Humphrey Bogart movie.  One note, this place doesn't have a big wine selection, so leave your fake ability to detect citrus notes at the door.  But trust me, you won't miss it at all.", "author": "Ash T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-07", "description": "Great house brews\nFish tacos were delicious\nCould be better use of space and stronger menu", "author": "Helen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "I really like this place.\n\nIt is just the sort of place that I've been looking for.  Clean, and pleasant, but not terribly expensive and with a lot of energy.  A great place for a casual beer and a bit of nosh.", "author": "Bill G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "This is a great neighborhood spot. These guys have been super helpful for those looking to start brewing beer as a hobby. Now, the restaurant is open and they offer amazing beer and great food. The great part is they have all of the recipes for the beer you just tried- they want you to try to recreate it! We've been a few times already and have taken friends in that all love it.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "Black Sands knocked it out of the park at SF Beer Week opening Gala.  Superb Mosaic SMASH and Son of Man IPA.  This brewpub is run by a passionate team whose much needed contribution to the Lower Haight beer and food scene is truly appreciated!", "author": "steve c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-07", "description": "Great Beer, good service. Very average food and poor use of space. I am hopeful that the formula will improve since they just opened.", "author": "Neil L."}
