{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "Blanc Et Rouge is our favorite place to come for wine here in San Francisco. We have been coming here since Melinda used to work behind the bar  and might I add she was the most personable bartender there by far. Aside from the Manager of course, Ethan who is always very friendly. The owner as well, Andrew is super nice as well. Some of the new employees are nice too like the Latin guy, I believe by the name of Uriel. It's always nice to come in and they know who you are and what not.\n\nHowever, tonight I came in, it's Monday night, September 11th, 2017 about 6:30pm and I came in craving a glass of wine. The bartender (older short, balding with a scruffy face) or who ever was working behind the bar tonight did not seem like he really wanted to be there or did not seem like he wanted to serve me a glass of wine. He was not very nice. I don't know who he is because I have never seen him before, maybe he is new. But he was not so pleasantly inviting like everyone else. \n\nI sat at the bar first, thinking hey I'm by myself, why not just grab a spot at the bar. He was very particular and wanted me to sit on the bar stool all the way to the right because \"he was closing the left side of the bar area\" so then okay, I decide to to just sit at a round table behind me. Then he comes up to me to tell me to ask if I can sit somewhere else at the other side of the room, \"he was also closing that area of the glass tables down\" where I decided to sit after he was so picky of where he wanted me to sit at the bar. So I look at him and say, okay thank you and walked out. Who is this guy?!?!?!\n\nNever have I ever walked into Blanc Et Rouge and asked not to sit here or not to sit there. I don't know if he was just being very particular or maybe he took one look at me and thought that he didn't want me there or he did want to serve me a glass of wine. Never have I ever experienced any of the the employees there telling me where to sit. Usually you come in, find any spot to sit and order a glass of wine. Pretty standard practice, so I don't know what this guy's problem was.\n\nPaul (Mr. St. John \"You're so fierce\") and I love coming here and the owner, manager and a few of the employees there are really nice. Except this guy.   I don't have any personal issues with him or have never met him, but it sure did feel like he had issues with me. Or at least issues of where he wanted me to sit. His customer service skills, subpar.", "author": "Mr G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-14", "description": "Solidly decent wine bar that my colleague and I went to after work. The service was decent and the bartenders had a decently generous pour. We got the crackers and the flight which were both decent. The wines were not quite to my taste but it could be me.", "author": "Sharvari J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-04", "description": "Place itself is loungey, comfortable and decent wine list. Went here for wine after dinner with friends- the worst service I've ever received at a wine bar that had like 3 other people inside. They were not busy whatsoever. We got multiple bottles of wine and some snacks so you would think the service could have been on point. Do not go here unless you want to be treated like crap.", "author": "Sashini W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "I was meeting up with a girlfriend for happy hour and she suggested Blanc et Rouge at Two Embarcadero Center. I had never noticed this nice wine bar before. It's conveniently located near many offices but has clearly gone under the radar. At about 5pm on a weekday, it wasn't very crowded and It stayed that way the entire time we were there. We each had a couple glasses of the delicious red on the Happy Hour menu and we shared an order of deviled eggs, yum!\n\nI was having a rather emotional day and with the wine, I couldn't hide my feelings at all. I was thankful that there was some level of privacy and personal space to share stories with my girlfriend.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "Update: Andrew, the owner, reached out to me personally regarding my experience and offered to make it up to me at another wine bar he owns in the city. I must say, Andrew is a great guy and very passionate about what he does and his clientele. He is also very knowledgeable about wine and takes the time to craft his recommendations on food and wine with a lot of thought to appeal to your desires. I am very grateful he took the time to reach out to me regarding my past experience - not many owners would do such a thing. Andrew informed me that the guy I encountered no longer works at his establishment (Blanc et Rouge). \n\nAfter some thought, I decided to update my review and rating as I think it is rather unfair to base my review on this sole egregious experience when I had so many good ones here.", "author": "Keenya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "Really friendly place to grab a nice glass of wine in the day. Servers are highly knowledgeable and will not steer you wrong. Coming back soon.", "author": "S C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-04", "description": "If I could leave no stars, I would. I was just informed that a group of 9 professional women of color in this nearly empty establishment were \"screaming\" and that this place lost 5 customers because of us.  I have been here with my white male colleagues in similar circumstances without incident.  Indeed, the patrons closet to us are shocked and appalled (and leaving as I type). As a Black woman's lawyer and partner at an international law firm, I am truly offended and I will never again step foot in this establishment.\n\nUpdate: Ethan told us to not \"play the race card\" because he has a Black son who has an Afro.", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "a pretty nice atmosphere for after work HH. good bar bites. nice tables and lounge areas. there's something odd about the space that makes it pretty loud, but you get used to it\n\nI wish the bottle prices were a little better. not as much as in a restaurant, but it seems like they could still add a premium and do better on the prices. so my suggestion is to buy glasses to try a variety but you'll run up a tab pretty quickly that way too\n\nalthough this sounds more like a 3-star review, I kinda like the space and appreciate a nice wine bar in the area. so they get a bump :)", "author": "Bob U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-07", "description": "As an update to our previous review, we have spoken to Andrew who appears cooperative in looking into our expressed concerns.\n\nFortunately for us, we have ample support for our claims, including the fact that members of our group recorded the entire exchange with Ethan and others took several photos of the amount of business occurring in Blanc et Rouge that evening. Further, our candid discussion with Andrew confirmed numerous things, including that our noise level was more than acceptable for a wine bar in the middle of downtown San Francisco.", "author": "Katuri K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-21", "description": "I just found this place to be blah.  We came here for a glass of wine at the bar, but the bartender just didn't seem engaged at all.  The entire place was trying to be French, yet with a central-American bar-staff, it simply did not work.", "author": "Claire N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-30", "description": "If you're looking for a happy hour on a Friday afternoon, I would recommend going anywhere but here to find that happy spot. If you are looking for slow service, rude staff, and overpriced warm white wine, you have come to the right place. Not only will they serve you that glass of wine you didn't want, it will be in a warm glass at room temperature. \n\nNot only is the staff slow and rude but management does not appreciate constructive criticism. So, if you want to be surrounded by a mediocre ambiance with an even more mediocre staff Blanc et Rouge is your place. Trust me, you will be disappointed.", "author": "Jillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "Awesome spot! Delicious wine (nice happy hour menu), amazing staff, and yummy food. Everyone has something specific they are looking for when they head out for a beverage after a long day. But let me be super clear that if you are in the financial district EVERY bar fills up to the gills. It baffles me beyond belief that individuals come into a bar at 5:30p and expect super fast service all while they walked in with several other parties all at the same time. \n\nThis is a SMALL wine bar; it's chill, it's easy. If you want fast service minutes from sitting down, go to Schroeders or the Royal Exchange across the street - to an actual fully staffed restaurant. From the several visits I've enjoyed here the staff works hard and actually have personalities (they don't mind getting to know you - unlike other bars in the city who just want to pour you a drink). \n\nSadly the cons of this place are the rude clientele that sometimes frequents the place and the lack of management supporting the staff. If this sounds like you spot, I'd recommend a visit!", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-14", "description": "While the ambiance and decor is great - I love that there are cozy couches, but also tables for more professional type dates. \n\nBut I was really blown away by the poor service. We were there on a Tuesday(!) night. While seated at a table with no menu or anything, I waited for a waitress for about 15 minutes. Nothing. Finally I went to the bar. It was difficult to approach the bartender because there wasn't really a place to do so without impeding on the people sitting at the bar. Finally, I caught her eye, but she looked me in the eye and kept walking. It was pretty obvious what I was standing there for as I read the menu. After about 10 minutes of watching the two women behind the bar appear to have no idea what they were doing or care if they sold anything food or beverages, I got aggressive and requested service. The woman said she would bring it and the bill to my table. So I finally got a drink. Also, one restroom for all patrons seems paltry when people are drinking. There was a line every time.  :-(", "author": "Angela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-31", "description": "This place is super convenient- located in Embarcadero Two, and it has very very good wine. \n\nIt's never insanely crowded, and it seems more of the older after work crowd.  However, the service is pretty bad.  This might be because they never seem to have many people working, which reads cheap to me. \n\nThe food is limited (more like apps) but good.  The most recent standout was the Baked Brie.  Absolutely phenomenal. \n\nI go often since we tend to have book club meetings here over drinks, but don't think I'd come by otherwise, unfortunately.  It's a weird half store/half bar vibe.", "author": "Ghizal A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-05", "description": "#SocietyGirlApproved: definitely slated to become a frequent chic haunt because who doesn't love a good wine bar. Small bites and a massive selection of wine is a lovely way to spend just about any night. \n\nGo on a low key Friday. Dress in simple black and white, a patent leather flat with a minor heel. Take no more then 2-3 friends. Order only burgundy. Be seated near a window or outdoors and host conversations about celebrities, romance, and politics. Make friends with the party seated next to you and tip the wait staff well they're delightfully friendly and charmingly attentive.", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-25", "description": "Blanc et Rouge was a fabulous warmup stop for libations and eats before catching a comedy show at the Punchline around the corner!  We arrived before 6 and found a table for two no problem, and our server was quick to help us and advise we had 10 minutes to take advantage of the happy hour items.  You don't have to tell me twice!  I ordered up a glass of the happy hour Cava, my friend went with a Willamette Pinot Noir, and we shared their Croque Monsieur and Baked Brie.  \n\nThe cava was lovely and served up generously, and was of course a fabulous pairing for our cheesy eats.  The croque was nice and cutting it into bite-size pieces made it very bar friendly, but since we didn't wolf them down, as they got cooler they got a bit chewier.  So don't hesitate with those bad boys, inhale them!  The baked brie though - heavenly.  A reasonable amount of cheese wrapped and perfectly baked in layers of phyllo, paired up with pecans and dark cherries, resting in a pool of a flowery honey with lingering flavors of baking spices.  All those notes mixed together, with butter topping it all off (I don't know where they were hiding it - from the phyllo?  Blended with the honey?  Who knows, what I DO know is I was happy it was there!), it was just a divine dish, and a perfect decadent food to pair up with a light crisp wine.  The menu did say it would be served with figs, which would have been preferable and would have elevated the dish even higher, but I was still very happy with what we received.  \n\nService became quite slow after our first round and food arrived, I was surprised that servers at a packed wine bar in the FiDi weren't hovering over us to re-order $14 glasses of wine every other minute!  So while I appreciate a low pressure atmosphere, we could have used a smidge more attention.  \n\nOtherwise, I very much enjoyed my visit!  A lovely environment, and despite what others have said I found the douche factor to be quite low, although we did visit on a Tuesday.  I would happily return again for their elegant delights!", "author": "Terri N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "Bottom level/street level at the corner of Front and California Street.\n\nHad the half/half charcuterie board.\n\ncountry pate-\nproscuitto - savory\nsome sort of salami-\nspanish hard cheese-\nfrench soft cheese- favorite out of the 3\nhard cheese-\n\nThe bread could've been toasted longer\n\nfast service and attentive. Definitely one of the better options in the area.", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "I decided to come here on a Thursday night after attempting to go to two different crowded wine bars in FiDi. I was immediately drawn to the ambiance and was pleased to see there were comfy cushioned seating areas dispersed between regular tables. We were seated right away.\n\nI LOVE wine and appreciate wine recommendations, but I DON'T love when servers immediately recommend the most expensive wine on the menu, which is what my server did.\n\nI decided to go with a Pinot Noir. It was a 6 out of 10 on my scale, but that was fine. You won't always score high when you're trying new wines.\n\nMy friend and I ordered the Croque Monsieur to split. There were nine mini sandwiches that resembled cute ham-filled grilled cheeses. Very delicious. I wanted to order more!\n\nThe service was subpar. We had to wave down the server every time we wanted to ask for a suggestions, order, and get our check, and the bar wasn't even crowded.", "author": "Emmy Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-05", "description": "I will echo another review in saying that even one star is too much to award this \"quaint wine bar\" after the way that my friends and I were treated last night.\n\nPersonally, I've never been in a situation like this before in my life and I'm saddened that this will be one of my lasting memories of San Francisco. I met a group of 8 other professional women for happy hour here after work last night. At first things were great. Our server was nice and very attentive the entire time, and I immediately recognized the manager from another restaurant I had attended with a colleagues about 2 months ago. He was also very attentive to our party and engaged us with the same enthusiasm and respect as he engaged my colleague and I in when we met him in May.\n\nThe bartender, however, had a HUGE issue with us that I noticed from the moment that I sat down. I had a clear view of the bar. He repeatedly looked over at our party any time that we laughed out loud, continued to engage his colleagues in conversation while peering over in our direction, and at one point even mocked our laughter.\n\nUnfortunately, I wasn't shocked when he approached our table. I was shocked, however, that he approached our table and asked us all to leave because he had lost 5 tables due to the raucous that we were causing. He went on to say that we he \"gave us a chance to quiet down by lowering the music so that we wouldn't feel as though we needed to scream over it\". We asked him why he didn't come over earlier and explain this to us- why wait until 5 tables leave? Why not approach us after 3 tables left? He didn't have an answer.\n\nThere was a couple sitting right next to us that was sitting there the entire time that we our party was present and they said we didn't bother them at all. In fact, when they overheard our conversation with the bartender, they, too requested their check and left.\n\nWe were a large party of (professional) women of color who were enjoying each other's company. When one of my friends brought this to his attention, his response was \"Don't try to play the race card. This isn't about race. I have a son that's Black and Japanese and he has an afro.\" In a later conversation, he also asked 3 of my friend if they'd ever been to a quaint wine bar.\n\nWe'd already asked for the bill and we paid our share and tipped our waitress well because she was great, but I will never recommend that any of my friends and family even stop in for a drink at this establishment after the treatment that we received. We did absolutely nothing wrong and ran up a sizable tab. All we wanted to do was grab some wine and catch up after work.", "author": "Seanté B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Great place. Don't let the butt hurt SJWs deter you, they were talking VERY LOUD.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-23", "description": "I get so easily confused. Now is it Blanc et Rouge or Rouge et Blanc? Surely I can't be the only that mistakes this place for the one on Grant next to the Hotel Triton. I could see myself texting someone to meet me here and then having them show up at the other place leading to an extended period of passive-aggressive silence where I talk smack behind his back and then there goes the friendship. Thanks a bunch, Blanc et Rouge, for destroying a relationship that took hours to ferment. Y'know, I actually haven't been here after work with besotted colleagues. I came here at lunch and found it eerily quiet as everyone else was buzzing by on the sidewalk (photo: http://bit.ly/1bZ91PM). Did I make a mistake? Should I be heading across the street to Gambino's for a Jersey-style sammie?\n\nNo, the waiter clarified that they are indeed open for lunch and offer a Lunch Wine Special for $15 (photo: http://bit.ly/15ErCMf). A glass of wine for lunch? How bourgeois. Now the special applies to the sandwiches and the Quiche Lorraine, but the salads are a dollar extra. OK, so I ordered the Tuna Niçoise Salad with a glass of the House Rosé (photo: http://bit.ly/1bbxO5s). The salad itself was pretty good - butter lettuce combined with  hard-boiled egg, cucumber slices, fingerling potatoes, green beans, cherry tomatoes, and Niçoise olives drizzled in a sherry vinaigrette (photo: http://bit.ly/1aFZxay). I was a little bummed that they used a canned tuna instead of fresh ahi, but it wasn't offensively oily and there was a lot of it. The Rosé was nothing special, just a refreshing chaser at a time of day when I probably needed the respite. Now where's my friend (looks at watch)?\n\nFOOD - 3 stars...a good Niçoise in need of real tuna\nAMBIANCE - 3 stars...it's a wine bar alright...and very quiet at 1PM\nSERVICE - 3.5 stars...thought the waiter was quite attentive considering I was his only customer for a good stretch of my meal\nTOTAL - 3 stars...a little faux-French experience in the middle of the workday", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "Amazing variety of different wines, not too big but very yummy food menu, attentive, friendly service, and an inviting atmosphere. What's not to like?", "author": "Yelena L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-18", "description": "I like this place because it's close to work and they have a decent happy hour. HH price for a glass of red for $8 isn't bad and they also have HH specials for apps too.\n\nThey don't have a full kitchen but the small plates are decent. I've enjoyed the bacon flatbreads.\n\nThe ambiance is nice. Not overly crowded and you can carry on a conversation without shouting over others. They have outdoor seating as well. Not a huge outdoor space but a few tables to enjoy the cool San Francisco nights!!", "author": "Scott L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-17", "description": "Blanc et Rouge is on the ground floor of Embarcadero Two and should not be confused with Rouge et Blanc, another wine bar in SF. \n\nWe came to White and Red for a wine tasting event, and a small group of a dozen of us sampled healthy tastings of Trois Blanc et Trois Rouge Vins. These were accompanied avec charcuterie et frommage plats, et pan Francaise. \n\nThe Wine offerings were eclectic, ranging from Chile, Spain, France. There was a good range of varietals, too, in both Blanc et Rouge. \n\nThe space is relaxed, comfortable and modern. They are open M - F of course, to cater to the predominately business crowds who may descend from the 40 story Embarcadero complex towers. But they are open from 2 to 8pm on Saturdays, and this is a good time to take a leisurely taste of wines amidst the quiet retail complex, which was formerly a bustling shopping mall from decades ago.", "author": "Wanugee N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "Cute place to catch up with friends. The inside provides an intimate atmosphere and the outside patio is great for people watching on a nice day or evening. They have a great selection of beer and wine. You can munch on cheese and crackers and other bar bites to accompany your wine. I'm pleased to say their service has always been attentive even on a busy night. I have yet to try their lunch which seems a bit limited with only salad and sandwiches but I can do that for $16. You can apparently get a glass of wine with your lunch selection for that price. Overall, they are a bit on the pricey side but their happy hour specials are good.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "As a local business owner in the Financial District it absolutely breaks my heart to have witnessed and read about a situation that was greatly misconstrued about another local business just a few short blocks away my own. \n\nLet me be very clear, when you are a small business your reputation is extremely important. Yelp is a useful tool; however, it also has the ability to not only damage a business but the also damage the hard working employees with the click of one \"Post Review\" button. Please realize that a moment of frustration can do irreversible damage to a business. And attacking one individual repeatedly on a public forum only meant to share information about a business is completely unprofessional. \n\nI am a regular patron at Blanc and have experienced many lunch/happy crowds at this establishment. Unfortunately, I have often witnessed at Blanc the trend of at least one individual/group who believes that the wine bar and staff are there for only their personal needs (If you have ever worked in restaurants before you all know the attitude I'm referring too).\n\nRegarding the recent event, I was present for part of the interaction and wanted to share another perspective. I was already seated at the bar around 5pm when the happy hour crowd started to completely filling the space. There were several large groups and the noise level was boisterous per the norm. There is typically one or two groups that eventually escalate their volume above reason to be heard during the rush as they often do during happy hour at most bars in this area. However, even though the volume was high, there were several voices on this particular evening from a group against the wine wall that pierced through it all. They even made me turn several times in amazement at the piercing loud laughter. Again regardless of your perceived volume, if an employee of the establishment makes a request such as \"please try to be considerate of others in the space and lower your voices\", this is not a personal attack against you in any way. They need to keep all clientele comfortable, and might adjust the room as needed to allow for this to keep the business running smoothly/avoid loss of business. The mature reaction is to be considerate of other patrons and realize that you might have misjudged your own volume. \n\nAs a regular I have witnessed Ethan ask - only when needed - a variety of groups/individuals to be conscious of noise volumes so that the whole community of patrons can enjoy their experience. He has always been incredibly inviting/welcoming to those who show respect for the business and for the staff. Those who want to just enjoy a delicious beverage with good friends and unwind. To echo a prior review: \"I think this was a very unfortunate experience and do not think that the reviews here reflect what happened or how the bartender handled the situation. It was simply the staff at Blanc et Rouge responding to complaints/loss of business and attempting to ensure that everyone, including the said table, continued to have a good time.\"", "author": "Anne F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "I'm kind of surprised that this place doesn't have 4+ Stars. I've been here several times, both for lunch and happy hour. The lunch offers a \"meal deal\" of a glass of wine, and your choice of sandwich (with side salad) or entree salad for about $18. The portions are huge, and the food is absolutely delicious. Highly recommend for lunch.\n\nThe happy hour is a bit more standard for SF. The wine is a bit pricey (but what wine bar in the city isn't?) but they have Happy Hour until 6, with $8 glasses of hose processo, white, rose, and red. From my experience, all are delicious. The cheese platters and deviled eggs are also worth trying. \n\nAll in all, i highly recommend for a girls lunch over wine, or romantic happy hour date.", "author": "Jay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "Great place. Great/cool staff. Yummy bites. Great vibes. Totally accessible. Should I go on? I love their wine selection and hospitality. I always feel warm, invited, and welcomed into Blanc et Rouge. I've read some of these low starred reviews and they're totally sad. You people are very angry, entitled, and rude. It's all opinions and feelings, not facts. Yelp is NOT the place for that kind of energy. Find a better hobby! Nothing's wrong with Blanc et Rouge. It's effin great! Stop reading reviews to make up your mind, and go make up your OWN mind by popping in and seeing for YOURSELF! Vive Blanc et Rouge!", "author": "Syd F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "I have not posted a review in a LONG time. However, I had to write this one today.  NOTICE TO OWNERS of this establishment.  You have an incredible employee.  Unfortunately, I did NOT get her name, but she was on the job last evening, Saturday, Jan 21.  She manned the ENTIRE SRO restaurant all by herself.  I was amazed that she was able to keep her sanity and wits, with all the demands around her.  I hope she was tipped very, very well.  I told her, if I was working that evening, I would have locked the doors and not let anyone else into the establishment.  Crazy, crazy night.  Oh, and the Petalos Mencia was excellent.  Give that woman a bonus.  She greatly deserves it.", "author": "AJ L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-05", "description": "En route my friend turned to me with caution and said, \"Just so you know, this place is really douchey.\"\n\nAnd so it is.\n\nApparently a haunt for the \"douchey\" crowd during happy hour, I was happy to be there after hours; the crowd of suit-wearing-ass-grabbers was small. The ambiance is somewhat lacking - it wants to be upscale yet intimate, but the few well-worn couches need updating, and it teeters between fancy and outdated. Glasses of wine will run you between $8 and $25 (although I'm sure there are more expensive options if you inquire). Our waiter wasn't able to provide much in the way of recommendations, which is a shame at a wine bar, but I enjoyed the wine I picked. The location is incredibly convenient, a few blocks from BART and a few blocks from the water, and there are a lot of great dining options nearby. A decent stopover on the way to Somewhere Else!", "author": "Ray J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "I have been here twice. It is great for people watching at the bars by the window and the wine is excellent. I think of this place as my hidden gem. The food is great and the staff know their wines. I highly recommend.", "author": "Chane B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-26", "description": "This is always a stop on my work colleague's monthly happy hour, and definitely one of my favorite haunts.  I like the slightly funky couches and it's so great they have an outside seating area for when the weather is nice.\n\nThe wine choices can be overwhelming since they have so many choices, but I generally stick with sparkling wine - whatever is on the HH menu.  Another area where they shine is with their menu.  I am a big fan of their charcuterie selection and the flatbread with figs and pears is also delicious.\n\nFortunately for our group, it's never that crowded when we're there, probably because we head out at 4PM.  Service is friendly and very helpful.\n\nCheck them out for a good HH with great wine and food.", "author": ".Hon H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-08", "description": "Arrived at once previously rated \"top 7 wine bars in city\" with a party of 6 at 925 pm on a Thursday night. We were given a cut off sign (hand swiped under chin) by the bartender. He told us that he already called last call and would not serve us. His buddy at the bar started laughing. Now I understand they closed at 10 pm, but with family in the restaurant industry, we know we weren't staying for more than one drink. We would have been gone by 10 pm- just out for a nightcap with my family- and we had just all come in to town from various places in the US. The experience gave us a bad taste in the mouth. Horrible hospitality and customer service. Would give zero stars if possible. Recommendation: dont waste your time- you'll never get it back.", "author": "D. W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "Love this place. The staff are friendly and wine selection good.  It's packed and a bit loud right after work and then quiets down.  Great place for a glass of wine and cheese plate or flat bread. We go at least once a week!", "author": "Karen A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-01", "description": "Centrally located wine bar in FiDi, this is a solid choice for after work drinks. There is a small outdoor area (3-4 tables) to enjoy those few summer evenings in San Francisco, and there's a lot of seating inside.\n\nThe menu of drinks includes a number of wines by the glass (including a Riesling and Sancerre); the food menu includes flatbread pizzas, cheese and charcuterie. They have a pretty good happy hour from 3-6 - $7 glasses of wine (choice of white, rose and red) and a few different nibbles ranging from $3-$7.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "Loved this place! Made our first visit during lunch time on a Friday. Not busy at all, so service was fast. We we're just stopping in for a glass of wine and a snack, so this was the perfect spot. Our party of three each had a glass of an excellent tempranillo, of which I regretfully did not write down the name. I wish we had actually just gotten a bottle as the manager recommended. We also shared the Provençal Flatbread, which was just enough for three people to split. \n\nI'd love to come back here and try a flight. As we were leaving, a pair seated behind us had one on their table, and the pours looked very generous! Would also like to try more items on the menu. Will definitely be back!", "author": "Amanda A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-11", "description": "Not that crowded on a Tuesday evening, yelper-TC and I stopped in after not able to get into a movie screening. Courtney was our server and gave us some really good recommendations. We shared a $24 \"Half and Half\"=charcuterie and cheese plate (http://www.yelp.com/biz_photos/RqIPmEfqMLYITyWqkAs7Rg?select=b98DTfEaFJGPK0owffwwLA) and I got a nice $10 glass of '08 Dante Robin Malbec - yelper-TC got a $13 glass of '06 Barolo Barbera. There's also Happy Hour which ended at 6pm.\n\n- The \"sopressata\" is popular with customers, and was like good salame. \n- The \"chorizo\" was like spicy sausage. Good with bread, but adding the \"country pate\" made everything better. \n- The \"Comte\" cheese=semi-hard cow's milk was also good when combined with that pate.\n- The \"Manchego\", or was it \"Saint Andre\", cheese=semi-firm goat's milk was really good.\n- The condiments that came with the platter was spiced nuts, honey and dried peaches (http://www.yelp.com/biz_photos/RqIPmEfqMLYITyWqkAs7Rg?select=SCMVtxed-5-WrGBQj2p7pA).\n\nLocated in Embarcadero Two, near the crosswalk that leads to Embarcadero One. This is a lounge type of place more than a wine bar. There are a lot of seating, tables for two, tables for six, wine barrels cut and flipped as tables, leather ottomans even. Each are separated enough if you want privacy or don't want your group bothering others. Capacity is approximately 50, maybe more. A bit pricey (a glass of wine was $9-$24), but you can buy by bottle for a group. And, bottles of wines are 30% off if buying to-go.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "Solid spot to sip on your favorite vino or discover a new favorite. \n\nWent here on an weekend afternoon outing that included also included beer and cheese. (Yum!) 'Twas a pleasant experience sitting in to nearly empty wine bar on a comfy couch. The mixed flight we did was very nice and the employee was quite knowledgable. \n\nI'll definitely return soon relax and chat over some great wine.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "I was at Blanc et Rouge last night, and I notice an altercation between a table of customers and a bartender. The situation seemed to have been completely out of control and I figured there would be some negative reviews today. I was not wrong. \n\nI arrived at the bar at 6pm, it was very crowded and very loud.  As someone who has been to this bar before, this noise level was not surprising. As the night wore on, people began to leave and the level of noise decreased, except from the one particular table who continued to carry on at a higher than need level. They were distracting and I noticed patrons, including myself glancing over at the commotion. I even heard a few tables get their tabs and mention they could not stay because it was difficult to carry on a conversation. One person came in, heard how loud they were and just left. The staff turned off the music hoping that the loud table would realize that they did not have to compete with the music. Finally, the bartender went over and talked to them. Immediately they seemed to take issue with him and could be heard arguing and asking why they were targeted. At that point the bar had only a few tables were left.\n\nThe bartender then came back to the bar to continue working, and the table could then be heard complaining about him and making sure that everyone in the bar was aware of how they felt. At one point a couple of them got up and approached a table next to them to share in their complaint.  After a few minutes they called the bartender back over and proceeded to argue with him for about 20 to 30 minutes. During this time some of them stomped out of the bar while others continued to engage him in a discussion.\n\nI have to say that it seemed that this issue was completely driven out of proportion.  I have been out with my friends before having a great time and not realizing, as we are excited, that we are speaking at a volume that is not appropriate indoors.  When staff has had to come over and ask for us to quiet down, we take it as mature adults, lower our voices and then continue on with our night. It does not matter who you are or what you do, if you are being rude and disturbing other patrons, or causing the staff to lose customers, which affects their ability to make a living, it is then the staff's responsibility to address this. All they had to do was lower their voices so that it was not so distracting to the other customers. Instead they choose to get pissed off and make a scene. \n\nWhile looking at the reviews left by those at the table, it seems one, their stories do not align and two, at times makes it seem as if the situation was something other than it was.  They were simply asked to quiet down.  They were not asked to leave and they even got another round of drinks after he first spoke to them before he was called back over by them. The bar was not empty at any time they were there.\n\nI think this was a very unfortunate experience and do not think that the reviews here reflect what happened or how the bartender handled the situation. It was simply the staff at Blanc et Rouge responding to complaints/loss of business and attempting to ensure that everyone, including the said table, continued to have a good time.", "author": "Meredith A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Can't say enough about how much I enjoy coming to Blanc et Rouge since it opened a few years ago. Andrew and team are knowledgable helpful and so friendly.  This is my go to place for to bring anyone who knows and likes good wine. Additionally and I probably shouldn't share this as it will kill my quiet time it's my hidden gem for a lovely lunch time salad or sandwich and no-one cares if you buy wine or not.  Great prices for good quality.", "author": "Clare W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-16", "description": "Homebase v2.0\nGreat selection of world wines", "author": "Samantha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "Was here on a Wednesday evening in early November with a work colleague. Ambience was good, seating was great and very comfortable ... and the service was excellent. The bar was busy until around 830pm and then slowed down slightly. The noise levels were perfect, giving it a sense of atmosphere but not too loud. We had 2-3 glasses each as well as a series of light snacks including the charcuterie, olives etc. Very solid, good place to go if you're down-town San Fran looking for good wine as well as respectful service ...", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-04", "description": "The C&L management group recently bought out this space and have re-introduced it as a wine bar and shop. Not to be confused with Rouge et Blanc which is their other wine bar venture. Wines by the glass, bottles for sale and characuterie/small bites are the offerings. Had a very good Albarino wine and the half and half charcuterie platter with two pate's, a cured ham plus a blue. brie, and comte cheeses.\n\nGood mellow vibe in an area that is in need of more night hangouts. The service was excellent. Hope to see them grow the menu and wines more as they've only been open for a couple of months.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "We stopped in the other night for a glass of wine before heading over to a movie at Landmark Embarcadero. Our server was very nice and friendly and very knowledgeable. He recommended a nice French wine which we really enjoyed. It was Friday evening so they were pretty busy but the service was great. Will definitely come back and allow more time so we can have a bite as well as taste some others wines.", "author": "Stacy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "this place is really nice love the wine selection! the snacks and staff perfect location too! one of my favorite place for the pass 5 years great happy hour best wine bar in financial district. (happy hour can be really busy and late nite too)", "author": "Enrique Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "I've been in here several times, both on weekdays where it was nice to just have some low key time to myself. They handle large parties and me riding solo with the same attention to detail and appreciation. It seemed they had an especially large party as soon as they opened today, but managed to always make me feel attended to. I will continue to return.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Seating area is pretty cool, very modern wine bar, the staff are very friendly and personal, the wine selection is excellent, in my opinion if you are in this area this place is the perfect  place for a glass of wine with friends, get the champagne of Spain or Italy for happy hour Mon to Fri 3-6 pm.", "author": "Jorge B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-02", "description": "This place inspired me to start Yelping again because of how awful the service was. The wine is awesome and the indoor is cozy and romantic... But the servers are so rude and inhospitable. \n\nI came here with a group after work and attempted to order food and wine. Even though it was happy hour we were given regular menus and had to request the happy hour menu. When our waitress finally came over we apologized for moving some chairs to the table to accommodate our group and she just raised her eyebrows and asked what we wanted. When we asked for a suggestion for Sauvignon blanc she said we could look in the book. After again asking for a suggestion she tried to give us a bottle that wasn't refrigerated. We eventually chose our own along with some reds and food. The food and wine were amazing!.. But we were never again revisited to ask how it was or if we needed another bottle. Sad to say the service ruined this experience.", "author": "Julia P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-10", "description": "Stopped in for a drink with a friend last night after work. The atmosphere is more cafe-like with hard floor, hard tables, and concrete rather than soft plush couches and arm chairs. It was crowded and very noisy - noisy to the point where we it was difficult to have a conversation.\n\nI had a glass of the Preston Cinsault (pronounced san-soh) which was DELICIOUS. The wine list is pricey at $10-20 per glass with most in the mid-range of that bracket. They also have a solid list of wines by the bottle. Our waiter was very knowledgeable when my friend asked a question. \n\nWe also had the prosciutto flatbread which was really really good, and the bacon & avocado crostini which was just ok. They have a large selection of standard meats and cheeses for snacking which we did not try.\n\nWe each had 2 glasses of wine and shared 2 snacks and our bill came to almost $90. Yikes! But, this place is super convenient, has great wine and friendly service so I am positive I will be back.", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-23", "description": "So the chicks I was totally checking out at the table in front me turned out to be a bunch of biotches threatening the manager they were gonna bash him on Yelp because he couldn't pour wine down their gullets fast enough. Say what?! Not to my fav wine bar in SF! \n\nI hit a different wine bar every week in SF since I was legal (yeah, sure) and some come and some go. This one stays very near and dear to my heart. The wine selection is humongous, with lots and lots of French wine, also very near and dear to my heart. \n\nThe food is delicious, as I'm now addicted to the salad Nicoise. I'm trying the Croque Monsieur next. It smelled divine. \n\nThe service is outstanding! Even when they're super busy on a Thurs/Fri eve the staff is very solicitous. Mondays are best when I get the whole place to myself for lunch.\n\nThe ambiance is loungey, poshy without pretensions, chill, mellow, and relaxed - perfect after a long day at work or the beginning of a beautiful night on the town or just sit back and people watch. The music is not loud, but not super quiet.... just right.    \n\nThe food pairings are deliriously yummy. The almonds and honey with my Sauterne made my taste buds sing and dance.", "author": "Evie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-09", "description": "my business school has frequent gathering here. Love the wine selection here (the williamette pinor noir by the glass is excellent), and food is as good as it gets for wine bars. The charcuterie selections and croque monsieur little sandwiches are excellent. \n\nA bit loud for non-group gatherings.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "We love this place!  It's tucked away at the Embarcadero.  It gets pretty busy for Happy Hour.  Great wines and small snacks to enjoy.  It's not a full kitchen so don't expect a large selection.  If you like it more quiet, this place is open on Saturday.  We pretty much had the place to ourselves which was exactly what we were looking for.  A nice quite place to enjoy nice wine and relax.", "author": "Joseph T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-30", "description": "This place is PRICEY like all wine bars except the food price here is so NOT worth it. \n\nI do happen to love that they have a happy hour cause a lot of wine bars do not, but dont buy any food here. The pricing is ridiculous.", "author": "Brittini S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-13", "description": "Cute little spot. I had no idea it existed, but thankfully my friend had suggested it to me after we spent the afternoon walking up and down the Embarcadero one weekend day. What better way to warm up your belly after a long SF walk but with some WINE!\n\nI was skeptical about anything being open at 6pm on a Saturday near Embarcadero 2, but lo and behold, I pulled up a patch of couch, a glass of malbec and some fireside chat with my cohort. Staff was friendly, there are small bites and flights to tickle your fancy and the prices aren't TOO bad. I wasn't about to spend $15 on a glass of overpriced SF vino, but with glasses starting at $8 or $9, that was enough to quell my urge to substitute it with a cheap martini from a FiDi bar around the corner. I picked the classier choice.\n\nIt was very quiet when we were there, so I assume it's more hopping during the week with post-work crowds or shoppers out and about.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-18", "description": "I come here to entertain clients and the staff is always helpful. They usually push a couple of tables together for me, and I'll show up early to pre-pick some wines and appetizers. They help guide me and provide great service through out the whole time. I did learn that they do include a gratuity for a large crowd, I believe 6+ people but I'll have to double check so look for that. When I'm not here for work, it looks like a great spot to catch up with a friend or for a date. Extensive wine menu and very delicious.", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "As I've gotten older and my salary has thankfully continued to increase, my wine tastes have gotten fancier and by fancier I mean more expensive. I remember the days I used to drink $5 happy hour wine at Royal Exchange (ha, I condescendingly laugh at my younger self) now I can up the ante and spend $7 for happy hour wine. Thank life for progress.\n\nNotables:\n\n-good service\n-good prices for happy hour drink and food\n-fancy stuff like pate on the happy hour food menu\n-lots of varied seating", "author": "Kiristen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-11", "description": "Fav. wine bar for HH! \nGreat selection, great happy hour, generous pours and delicious food. \nThe servers and the host/hostess are always so friendly and knowledgeable. \n\nWhat more can you ask for?", "author": "Catalina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-26", "description": "Great Place for after work HH, just chill have a bottle of wine.\n\nGreat Host - Andrew, you have to know", "author": "SFoodie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-24", "description": "(See pics)\n\nThis is a good hangout place after work instead of going to a pub. A different vibe.\n\nWe were here on a slow night, but aperfect evening at a wine lounge to chill out without too much commotion.\n\nI was ecstatic seeing the wall of wines. Even though the take home wines are not cheap comparing with K&L even after the 30% discount,  it's a convenient spot if you are downtown and need to pick up a bottle for dinner and the wine bar closes 10pm during weeknights and 8pm on Saturdays.\n\nWe had a Malbec and a '06 Barbera. Both were actually quite good wine bar quality. Overall a good selection of wines, not extensive but good variety. We also had a cheese and cured meat / pate plate. Decent and good pairing with the wines.\n\nService was friendly and they didn't bother you too much, letting you enjoy food and company. Now it could also be because it's not busy. Will have to come back at a different time to know if that's the usual case. \n\nI also just read that they also serve lunch and offer $2 parking after 5pm and all day Saturdays with validation. Will come back and check the lunch out!", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-10", "description": "Went here last night with the BF for happy hour, well an hour of happy hour. If Happy Hour went till 7:00 PM that would be better. They have 3 glasses of wine on the list for HH for $7 which is good. They have some crackers for $4 which arent good, not worth it. They have a flatbread which I didn't get but I should have because it was cheaper.\n\nWe ended up getting the half and half of the cheeses and meats for like $32 dollars, pretty STEEP. I won't be getting that next time.\n\nI'll def be back, order diff things, but cute place, I like the sitting on the coach.", "author": "Jess O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-13", "description": "No thanks. We were here at about 7pm on a Friday night recently.\n\nService was way below par. This wasn't just wine snob attitude, this was just straight a**-holiness. Pretty pricey as well.", "author": "Amy O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-11", "description": "Great choice of wine and Champagne. Also has good wine and champagne for sale. Pricey because of the location but the service was great because the person I was having a meeting with is a regular. \n\nI would come back again if I am in the area for down time. Not much to the ambiance but it is good to have wine and Cheese.", "author": "ARIeL P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-18", "description": "Decent place for a quiet after work glass of wine (or three). Good happy hour prices and tasty selection of cheeses. \n\nMinus two stars from the odd odor I smelled the last time I was there (I had to sit outside) which left me wondering... WHAT IS THAT?!", "author": "Casey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "Melinda is awesome! We had great wines and wonderful cheeses. Melinda was knowledgeable and gave great recommendations.  Really fun wine bar!", "author": "Susana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-27", "description": "I Love wine ,  who doesn't?????? So working a few hundred feet away from here gives me NO EXCUSE not to come here for Happy Hour. And yes I will come back for more. Their wine selection is great, even their cheeses and meats are pretty good. Love their  warm bread and honey and my friends always ASK for extra honey from the cute Manager ;)", "author": "Claudine V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "very fun spot in the embarcadero buildings.  It has an authentic vibe, nice wine choices, good staff, very nice charcuterie/cheese plates.  cannot complain at all.  after being bombarded by corporate stores and feelings in this area, it's nice to drop into a cozy wine bar that exudes authenticity and individualism.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-02", "description": "I was surprised by how much I liked this place! Came here around 530 on a Friday with a friend. It was pretty packed because it was happy hour, but they (kindly) let the two of us sit at a table that was meant for six. \n\nThe happy hour special was pretty good-a glass of one of their four selected wines and a flatbread (the Provençal-tomatoes, basil, cheese, olives) for $15. Happy hour wines are priced at $7, as well. The flatbread was good-a little messy and lacking olives-and the wine was great. When they noticed we had been sitting around without being helped for a while after getting our food a random waiter that wasn't even our brought us out two complimentary glasses of a delicious red.  \n\nMinus one star for the slow, slightly awkward (there's no hostess stand so you basically wander around looking for your own seat) service, but otherwise I loved it! Would definitely come back again, especially to try all the other delicious looking food on the menu.", "author": "Mandy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-08", "description": "Came here for a business event, and I was suprised by how small and dark the space is. The wines are yums, and so was the food!", "author": "Melody L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-07", "description": "my friend and I went to 2 other bars after work on a Friday before we finally came across this relatively quiet wine bar with vacant seating. the interior was really clean and nice, but when we glanced at the menu, we understood why this place was empty. $17 for a glass of Pinot noir, really? I guess that's fidi for you. we both ordered a glass of Syrah ($13). I'm not a wine connoisseur, but it tasted good to me and they pour a generous amount in a large glass so I guess it wasn't too bad.\n\nit was a nice place to catch up compared to the super crowded/loud bars in the area, but it is pricey and they have a limited selection in their happy hour menu.", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-02", "description": "Being a fan of the lounge-y wine bar atmosphere, I was ecstatic when my coworkers and I discovered The Wine Bar (which is now called \"Blanc et Rouge\" under new management).  Ah yes -- with every fancy-smancy name comes with an abundance of arrogance and distasteful pretentiousness.  \n\nI have enjoyed every visit thanks to the lovely staff - all until I encountered unprofessional remarks and behaviors from the new manager.  On one occasion, he made a mockery of our choice of wine.  When we asked for recommendations, he suggested a few but added that we wouldn't be able to afford them anyway.  It's too bad for him since he basically turned down a group of eager corporate card users. \n\nDuring a second visit when we went with different colleagues, they asked him specifically for his wine suggestions.  He was condescending as always and even told us to go ask someone else.  He stuck his nose up in the air and walked away like a cowardly, irrational child.\n\nMy psycho-analysis on this man?  He breathes and lives through his ego and \"wine connoisseur\" reputation to mask his insecurities and the fact that he is an imbecile when it comes to all other things.\n\nLearn how to be a manger, or don't be one. Thanks.", "author": "Judy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-26", "description": "Great selection of wine from various parts of the world as well as pairing of appetizers and select tapas to go with! \nTry the Wrongo Dongo is you get a chance!!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-12", "description": "Amazing wine selection, cute clientele, great manager and staff, good location. very nice happy hour spot in the financial district.", "author": "Mike V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "One of my favorito wine spots in the City! Comfy pillow puffed banquets and i go for the wine- not food. They have fun appetizing appetizers with no kitchen for cooking so we get what we get and it's always perfect for accompanying our Champagne or Wine tastebuds. If we want to drink and do food - we go over to Aquitaine their other place that wines and dines us. BUT nothing better down town for WINE than Blanc et Rouge - m'oui!", "author": "Judi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "This place was EXACTLY what the doctor ordered! It's a scary close distance to my office and has a GREAT list of wines to choose from! \nThey were very accommodating as my friend and I wanted to do a flight (not on the menu) and they allowed us to pick three wines and went ahead and served us! \nThe wines were great and our server was great! However, I do see how some of the comments below mentioned the service, BUT it is very laid back, so the servers aren't up your you know what the whole meal, you get to enjoy your wine without feeling like you are in a stuffy wine bar - \nWe also ordered the cheese and meat plate which was FANTASTIC! Our server recommended which ones would go best with what we were both drinking. \nI will FOR SURE be back - those couches and a glass of the Australian Red Zin is calling my name... lunch anyone?", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-21", "description": "Terrific selections...and wonderful Staff Folk!", "author": "Vince P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "Had an hour to spare before a movie in Embarcadero. As we wandered along the street we saw the wine bar. Intrigued, we decided to pay it a visit. The decor is nothing fancy, but homey. There are many couches in a big room, none too close to each other. We ended up sitting at a big couch by the door, with a beer barrel served as a table. The wine list is not exhaustive by any means, with a reasonable price range from $10-$20/glass. I am not a huge wine fan, always preferring the sweet dessert wine due to the sweet tooth I possess. I ended up splitting a $26 bottle of Moscato d'Asti with three friends and a platter of cheese and ham, which is absolutely delicious! They supply unlimited mini-toasts fresh out of the toaster. Though we're a bit tipsy as we walk into the cinema, the warmth from the sweet wine protects us from the fall wind. Great Saturday afternoon.", "author": "Genny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-01", "description": "Blanc et Rouge is fantastic!  I work for an organization that hosts happy hours for clients.  I searched and searched for a spot that could meet the needs of our group.  After trying places like the Four Seasons, Press Club, Top of the Mark and many more, Blanc et Rouge took first place as the perfect place to host a Happy Hour!  Andrew, the bar general manager, has taken excellent care of us and we could not be happier.   The space is well suited for conversation, the noise level in the early afternoon is low, parking is convenient, the food is tasty and decently priced, and the wine selection is fantastic!  I am very grateful to Blanc et Rouge for helping me do my job!", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-01", "description": "I just love this place. It is difficult to stay away from it. We visit almost every week.\nVery good wine list, the servers are very friendly and nice and the finger food is just so good. Very cosy and sweet, definitely recommend it", "author": "Anna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-30", "description": "I was going to start my review \"We were there right at closing,\" but checking the BeR website, it seems they are open until 10pm during the week.  Huh.\n\nWe got there around 8:30 and were greeted with \"The kitchen's closed.\" Fine, since I was full of garlic-less garlic fries, but it was an odd welcome.  There was hardly anyone there when we went, but service was attentive and there was a nice selection of wines by the glass.  I didn't see any flights listed, but my expert companion Suzanne B (holla!) said they'll make one for you on the spot upon request.\n\nI'd like to go back to try some of the other reds and peruse that  big wall 'o wine in the back.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-23", "description": "These guys REALLY know their wine, and how to suggest food and wine together. I work close to this place and have been there a handful of times. The happy hour is great for a high end wine bar. I think it was $7 for a pizzetta and glass of house white or red. The house white was delicious. Every time I have been there I have been offered samples of wine and cheese as the staff was trying the new products. I have only had amazing palate-pleasing experiences with the gentlemen of Blane et Rouge! (oh and they offer a discount for off-sale wine!)", "author": "Kayleen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "Came here for an industry networking event. Typical dimly lit wine bar with tuscan decor undertones. The appetizers and wine were really good. My only both was the amount of space. Was tight for the 15-20 people that were there. They blocked off only a small portion of the whole place. \n\nSeems like this would be better to go with no more than 4 people, unless it's at odd times so they can open up more of the floor to a party.", "author": "Pamela R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "When a wine bar in the financial district of San Francisco plays real hip hop......of course I am a fan!", "author": "Prescott R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-01", "description": "Horrible service. The cheese and wine was good but I would never come back due to the bad service. I felt like walking out. There was plenty of staff members and the bartender was just walking back and forth plus it wasn't busy at all.", "author": "Claudia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-04", "description": "This place is right by my work and it took me forever to discover it! I love the comfy seats and lounge-y feel. The happy hour isn't the best but if you want a good glass of wine, some great snacks, and friendly service, this place is perfect!", "author": "Amber M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "This is a great wine bar.  It's very low keyed, relaxed atmosphere, and plenty of wines from low to high end.  The staff is very knowledgeable and can give you pretty good recommendations if they know what you like.  Last time I came here with a group of friends, the staff suggested a Kingfish Cabernet whichI really enjoyed.  Nothing like good company, good atmosphere, and good booze!", "author": "Terence N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "You know you are really really (really) old when all of the places you've reviewed over the years change ownership at least once. I was pleased when a wine bar went into this space a few years ago--the stock broker/attorney pub options are already well taken care of in the area and a wino doesn't want to have to go TOO far after work for some good stuff. Blanc et Rouge has not changed the space terribly much--wine to take away or drink there still covers one wall, but there are now more seating options with a couch, some standing tables, and some low tables in addition to the bar option. \n\nThe wine selection may be a little bit cheaper, but just as diverse and well chosen. The spiced nuts and cheese options are also familiar and delicious. It was the perfect spot for an early happy hour/post work-out stopover.", "author": "Gretchen T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-02", "description": "Note to the wise: do not accept the \"half glass\" of wine you just \"have to have (so fabulous)\" from the manager. \n\nAfter he saw I didn't have any wine yet, he insisted I \"try\" at least a \"half glass\" of x wine, It ended up being: \n1. not really my taste (good but I'm not a Sauv blanc fan).\n2. one of the most expensive on the menu\n3. On my bill. \n\nUsually at a wine bar:\n1. I will ask for help if I need it\n2. I will buy myself a FULL glass of wine \n3. I will choose the wine that I actually want. \n\nI almost liked this place, but that was just awkward and tacky.", "author": "Erin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-07", "description": "Nice people, lots of wines by the glass, and the food is pretty darn good since getting bought by the folks at Cafe de la Presse.  The service can get a bit slower when they're slammed with a happy hour crowd but it's no different than any other bar in that manner so it's not the end of the world.  If you're in the area - of even if not - it's worth checking out Blanc et Rouge for lunch, happy hour, or even a very casual dinner with nice wines.  Unquestionably my go-to wine bar in the Bay Area.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-02", "description": "Have been coming her since it was just \"Wine\".  The wine is great, though priced where you would expect for a FiDi establishment.  The staff is really knowledgeable and nice.  There have been many instances where me or my friends would order something and the lovely Melinda or Courtney would give us a \"No, seriously, you don't want that\" look.  They've never been wrong.\n\nAnd really, it's the staff that keeps us coming back.  Melinda and Courtney rule.  Trust them and they won't do you wrong.  I had the habit of always ordering Pacifico or a pilsner when I came around and a few weeks into this habit they always had a nice chilled Pacifico sitting on my table by the time I took my jacket off and stashed my earphones.  \n\nLove the addition of food as well.  Their bar bites are great.\n\nMuch love to Blanc et Rouge, but really, much love to Courtney and Melinda.  You guys are the reason we keep coming back.", "author": "Courtney N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "We selected Blanc et Rouge for our regular networking forum and it has been a fabulous choice!  The wine selections are wonderful, food is terrific and Andrew (manager and our host) can't do enough to make us feel welcome and create an environment that we can talk and enjoy. I highly recommend as a vibrant (and not too noisy!) place for small groups to meet!", "author": "Bobbie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-05", "description": "A few weeks ago I was walking by the joint on the way to get my car, and Andrew came out to ask me to remove my Yelp review.  I think he originally meant to apologize but he ended up being further insulting.  He referred to my review as \"slander,\" and I communicated, \"It's not slanderous if it's true.\"  He retorted \"It's only your opinion.\"  I mentioned that that is the premise and value of Yelp, and he said that he thought it was wrong that \"people like you, common people\" can write reviews.  Nice.", "author": "Kimberly Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-14", "description": "I went there for one last gathering with some of my workers and I had a great time. The food samples and wine were good. We had CA wine but the range of wine they offer was pretty big. \nThe food was delicious, great cheese plates, appetizers and bread.\nAmbiance is great, its a mix between an intimate sit down restaurant and dimmed light lounge with music in the background.", "author": "Christian P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-20", "description": "Great wine! Pricey but it is good wine. The waiters know their stuff. The place is not fancy but it is a place to meet and chat. I will be back.", "author": "Alison W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-05", "description": "There are lots of good wine bars in SF.  Blanc et Rouge is not one of them. The music is too loud for people to talk.  We asked the manager if he would turn it down enough so we could have a conversation.  He said he wants the place to have a vibe.  The vibe is nightclub, not wine bar.  When we asked again, he said he could make the wine bar into a library by just turning off the music.   The food (very, very small portions of cheeses and bread) were served after we finished drinking two glasses of wine and were ready to head home. How long does it take to cut a few chunks of bread and cheese?  Unfriendly and loud.  Have a good time \nelsewhere.", "author": "Ltw J J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-22", "description": "Happy Hour just got sophisticated. What a great place to go to after work. They have a Happy Hour menu that includes a combo of wine, cheese, wine, bruschetta, wine ... you know what I mean? Prices are pretty reasonable, or at least as reasonable as it can get when you're talking wine. It's literally in the heart of the Financial District, specifically in Two Embarcadero Center . It's cozy, but if you're meeting some friends there, go as early as you can for Happy Hour. This place gets pretty busy and the tables can fill fast. The staff knows their wine well, which always makes for good conversation. HAPPY EATING!", "author": "Rob B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-15", "description": "Service was okay, nothing special. I was short on time before my dinner reservation and I told the server that but he couldn't really be bothered. As I was waiting for my date to arrive, I scoped out nearby tables. Many suits & ties which is to be expected given the location but the vibe was off. Maybe because it was a Monday? Fine for a pre-dinner drink but I'm not sure I'd come here just to hang out. I would come back to try their croque monsieur and glass of wine at lunch though :)", "author": "Sara P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-25", "description": "I was here on a date and walked in a few minutes before the bar was closing. The bartender let us in and said she'd pour us a glass. We ended up having an AWESOME time talking with her and the other people sitting at the bar. Can't complain when there is delicious wine and great company! I'd love to come back again.", "author": "Magda M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-14", "description": "Pretty cool wine bar for happy hours / after work for those who want to avoid the FiDi pub hub in the area. Have some outdoor seating for those who want to enjoy the Embarcadero Center landscape. Nothing too special or fun about this place, a little bit too passive of a venue for me but could be nice for those who want to sip and talk business. They do not open late night so do not come here rage.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-01", "description": "I've been here before and remember having a great time so I decided to meet my bf and best friend here to relax with some wine and the charcuterie plate. Sadly we walked in and took a seat and were told to move because the seats by the window were reserved. We stood up and asked where we could sit but the host didn't seem to care he just waved to the back. We headed to another booth. Another employee frowned at us, \"No, those seats are reserved!\" We pointed to the cushioned seats by the side wall, \"No those seats are reserved too\" So I asked what tables exactly were available. He pointed hurriedly to one sad table near the back, \"Oh, I guess that one...\" and just walked away. So here's the problem with management. If you are going to turn over your whole venue to a private party put up a sign that the place is closed for a private event. Or if you are staying open then have one side of the place reserved and the other open for walk-ins. Or, even have better customer service. I guess they figured they made their money for the night so they didn't care. So we didn't care and went somewhere else. Bocadillo's. That place is EXCELLENT.", "author": "Timoteo K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-26", "description": "This used to be a great place to go before it changed management. It was my favorite wine bar in the area. They had a great selection of wine including tastes and flights at decent prices. You could buy a bottle in the store and drink it at the bar. The staff was friendly and the manager was knowledgeable. That all changed when it got sold and became Blanc et Rouge. The wine selection went down and the prices went up. I've not been back after one visit under the new management. I go across Embarcadero now.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-15", "description": "**Truly terrible service!! (I wish I could bold this)**\n\nThe other night I went in and sat at the bar by myself while I waited to meet a friend.  It was early, 5ish pm.  Neither one of the 2 people behind the bar even acknowledged I existed for the first 5 mins.  This was not due to them pouring for others (which I would have understood), they were too busy texting on their phones.  When I finally got the wine list, it was kind of shoved down the bar at me.  \n\nI will admit the new bites are tasty but the glasses of wine are expensvie and they are stingy on the pours. \n\nGood luck trying to get a second glass of wine.  Finally time was up and we had to leave.  Sorry to have inconvienced you.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-11", "description": "I do not understand the bad reviews on this place.  I have gone in with my girlfriends a couple of times on Tuesday nights and always have a great time.  They do a specials on bottles of wine on Tuesdays.  I always see the same two employees, Andrew and Brian.  They are very knowledgeable and help us get the perfect bottle of wine every time.  The food selection is great for a bar.  I have tried the cheese plate and the flat breads.  They are yummy.  You get to pick your cheeses but I always get one of the guys to pick mine.  They have always picked well and they paired with our wine choices perfectly.  I have been to a lot of the wine bars in the city and this is by far the BEST!!!", "author": "lilly a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-18", "description": "Im going to start this off with the fact that I am not a wine snob, I do however know a nice, relaxed, calm, inviting atmosphere. Blanc et Rouge combines a lounge feel with a straight up bar. Seating is mixed between social, upright and tucked away but overall the place invites conversation. It began with the somalier who skillfully guided me to my new favorite bottle of $50 wine, prisoner. It continued with some new friends as I was ever so eager to profess my new found love (and it's high alcohol content). Everyone I met there was friendly from the wine expert seated at the bar to the bartender who kept my dad happy with belgian beer. I will definitely be back and recommend it to anyone who likes wine but with less atitude.", "author": "Kennan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-19", "description": "This place is a nice spot for a chill/meetup spot for a glass of wine and HH. Hidden on the ground floor of Embarcadero Center 2, this place possess a dark and winery vibe. Also, keep in mind if you're trying to do HH here, they don't have too many tables, so go a bit early if you have a large group.", "author": "Derek L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-30", "description": "This place is either glass or full bottle.  No half bottle option.  Kind of pricey, and pouring is not generous.  a big MEH", "author": "Gigi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-11", "description": "Very cute little small place to have a drink with the girls after a long week of work. I've come here a few times for \"Happy Hour\". I've tried their flat bread which I would definitely recommend. But for their \"Happy Hour\" wines they only have 3 wines for HH prices so you are really paying regular price for drinks. But I would say they have a very large selection of wines to choose from.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-11", "description": "We live close by and love to come in here on occasion.  Andrew and his crew have always been friendly and accomodating. Along with a glass of wine, we order the fig flat bread. The lady that makes them on site is a pro. The appetizers are tasty.  We've bought a lot of wine here and their knowledge is appreciated in making our choices. I like that it has a more relaxed atmosphere.  They don't bug you to death but if you need something you can always get their attention.\nSee you soon Blanc et Rouge!", "author": "Michelle G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "Excellent wines, and the sommeliers are passionate about the wines and your taste in them.  The service can be a bit stand-offish and the food isn't the greatest, but it's a wine bar, not a restaurant.  I usually like to go about once every two months and let the sommeliers and others sitting at the bar around me lead me to new flavors.", "author": "Jo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-01", "description": "I've been a fan of this winebar for some time. I liked it before but I must say this place has really stepped up since it's changed ownership and management. The wine selection is great as always, but now they have really awesome food too! They serve lunch as well and the menu is fantastic! The croque sandwich selection is always tempting but I especially love the nicoise salad. The new manager Andrew is friendly and knowledgeable and the updated decor is much warmer than before. Fabulous wine, amazing food and elegant yet comfortable ambiance to boot. Stop in for a glass and see for yourself!", "author": "Jen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-01", "description": "This place is perfect for after work as well as for lunch. The service is excellent, the wine selection is fantastic, and the food is delish. It doesn't hurt that the staff is easy on the eyes and very friendly as well... I highly recommend this place!", "author": "Elyse H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-21", "description": "I didn't eat or drink here, just stopped by to meet someone. The atmosphere is nice.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-20", "description": "Cool wine bar.  Oh, and they were playing 80's music. Love it!!  Great selection of wine and appetizers! I wasn't paying so didn't know what wine we had but all tasted good.  Certainly get the warm mini cheese bread twists!", "author": "J B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-27", "description": "Not my favorite happy hour spot.  Why?  Because they don't have happy hour!  When it's $9-16 for a glass of wine, you need a happy hour.  Much better choices around for happy hour and if you want wine, there are spots for that too.  I'm sure this place is great if you're on a corporate card though.\n\nI will stop by again to check out the Tuesday night 30% off special.", "author": "Olivia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-12", "description": "This place is awesome! It's super close to the Financial District and they have a fantastic happy hour.  The staff is very attentive and knowledgeable able wine. Best wine selection in the city. Will definitely go back.", "author": "m s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-24", "description": "they are assholes and complete pretentioius loser wannabe snobs. after waiting for a menu for 20 min i left.  the manager that served me last week when i was wearing my business suit just looked in my direction and walked away.  hey bitch boy, just because i had my gym bag and was wearing sweats, doesn't mean you can treat me like i don't exist.  i hope we slip back in to recession because i remember your place with zero customers.  you don't deserve to be in business.\n\n**this came in via the messaging system at yelp last night.  i believe it was that andrew guy using a fake yelp id account:  Great reviews you piece of shit. I hope someone goes to the Philly club to find out who you are. You obviously have a vocabulary of an angry eight grader. How many single stars have you given out? 19? Go to rehab and stay out of bars in the financial district. You and your sweats. Did you think you might have smelled a little offensive?\n\nobviously, blanc et rouge, andrew and their employees have issuses with free speech.  the lack of service, attitude and pretentioious at blanc et rouge is nauseating.  frankly, i'm bored with them. at this point, i'm not giving any stars to this stupid wine bar.  i'll take your statement, which can be traced back to your server, as a threat.  i appreciate the law suit and i will gladly run you out of business.  free money!\n\nwith regards to all the one stars.. i give out a lot of one's because that is what most places deserve.  bad treatment, similar to blanc et rouge, deserves one star.  i don't care if it's the republican party or the burger bar SF.  one star is one star.\n\nif you are looking for the best little wine bar in SF, then take the muni train to west portal.   vin debut will treat you with respect and kindness.", "author": "T D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-20", "description": "I met a friend here after work on a Friday; they were busy but the service was very quick, efficient and friendly.  The wine selections were very nice.  I was not too impressed by the snack/food selections; but again, this place is not a restaurant and just a wine bar.  The snack food is basically available to you if you're too hungry to wait to go to a real restaurant to eat.  Prices were a bit too high but I can imagine that rent and overhead must be high in the financial district so I'll give them some slack for that.  Overall, a solid 3.5 stars.  Happy hour selections are very limited and not worth considering.", "author": "Steven V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-28", "description": "I Love this place, The server is good and I always get the best recommendation. \nI usually stop for a bottle of wine before a movie ( sometimes Two ). \nAnd I never use places in general to decompressed, that I do when I'm at the Spa or having a massage or walking at the park.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-20", "description": "The wine bar that used to be here was called \"Wine\" and it was wonderful. It was my favorite wine bar and my launching pad to the other wine bars when in SF. There used to be good people working here but they moved on. This is not really a wine bar as they do not serve any wine tastes. My fondest wish is to see a real wine bar here. The right people could turn this location into an oasis like it used to be.", "author": "Howard S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-04", "description": "This place is where I go when I really want to get my WINE on and chillax. Andrew and the team have a superb selection for all palates! The menu is really fun and works perfectly with with the wines and the atmosphere. Great music is always playing, so it's easy to get lost in a GOOD TIME. This spot nails it, EVERY TIME! I'm a bonafide(and credentialed) WINE GEEK, so I dig it!", "author": "Cassandra B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-22", "description": "Went there for the first time on a slow Thursday right after work.  The friend who recommended it was very enthusiastic and loves the place.  However, she makes a ton more money than I do.  The wines start at $9.00 a glass and the amount they pour seems to be up to whatever the server feels like pouring into your glass.  If I'd had great wine, great food and excellent service, I wouldn't have minded paying the price.  The attitude of those working there was not just snobby but aloof and careless.  I will not return.  I should've known that a wine bar in the Embarcadero Center is never going to be reasonably priced.  It was an expensive lesson.  Entertaining at home has never sounded better.  For what we paid that night, I could've bought a couple cases of top-notch wines at Trader Joe's (not their cheap wines) or from The Jug Shop at Pacific and Polk.", "author": "BJ M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-10", "description": "Great place to come to enjoy a glass of wine after work. Love the staff, especially Melinda!", "author": "ingrid H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-09", "description": "I recently had the pleasure of spending an evening at Blanc Et Rouge.  The atmosphere was so perfect for relaxing and having a glass of wine with some friends.  The wine list is excellent and full of options.  My friends and I had an amazing time and have gone back several times since.  The staff was very helpful and often has suggested great wines that I had never tried before.  I ended up buying some wine for a party which Andrew helped to pair with our menu.  Love this place!!!", "author": "Cohen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-07", "description": "I've come in here a few times after work as I work one building over. It's a great place to unwind. Even when it's busy, I never feel like I'm crowded in. There is one person there who is super friendly and outgoing, and another person who is not so much, but it doesn't bother me, since my mood changes too. Sometimes I wanna sit and shoot the shit with a bartender, other times I just want to catch up on my reading and people-watch. This place is good for both. They serve nice, heavy pours, and the wines by the glass list is extensive with lots of unique European selections. Great place, worth a go if you're a intermediate to advanced wine drinker.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-08", "description": "If I could give no stars I would. I am not the type to want to write negative views and tried to see light with this wine spot but this place left a rather bitter taste in my mouth and i just couldn't see past it. Granted the St. Patty's day event was going on a block away from the wine spot, this does not count for an excuse for horrific service from the manager himself. Being a wine fanatic and growing up surrounded by my family winery I was always tempted to pop into this place when passing by on my way home from work. I entered with 3 other friends and browsed  the menu before deciding on what to order, the manager asked for our id's and we carried forward into our order. Since we had to go up to the bar to order a bottle of wine, we figured there is no need to leave a large tip, all he did was uncork the bottle of wine. We sat down and poured wine then noticing that one of the glasses had a crack down the middle, I went to exchange the glass out with a new one and this is when the manager stated he would not change out the glass because we did not tip him. These were his exact words, absolutely UNBELIEVABLE and completely unacceptable!!! I travel to various areas in California for wine tastings and have visited various wine bars in SF and I have NEVER experienced such horrendous service from anyone, let alone a manager. To get a new glass we had to go to another side of the bar and ask another employee for one. I highly recommend checking out Bin 38 or any other wine bar in SF.", "author": "Michaela w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-02", "description": "Went there after work on a Monday and the place was busy, but in a good way.  Ambiance is fantastic.  Seated by a \"Scott\" (think, Kardashians' Scott, JUST LIKE HIM) who did not have much desire to chat up, but whatevs.  A gf of mine and I ordered and the service was fairly quick.  Ordered olives and some other goodies.  While eating and talking, I leaned over and noticed a chewed olive pit in the bottom of the small bowl.  Seeing as I was the only one eating olives and I had my pits on my plate, my stomach turned.  \"Scott\" came over and I showed him the pit.  He seemed completely undisturbed, apologized and took it away.  The more I thought about it, the more grossed out I got.  Either 1. they use the same bowl between tables and just dumped more olives on top, or 2. someone was throwing pits into the source.  Either way, someone else had chewed up something and put it into the food I was eating.\n\nI was not going to eat any more olives, and thought about not eating the rest of the salmon with crackers ($9 for a tablespoon of salmon), but he brought more.  As he set it down, he said \"I found out who's pit it was, and don't worry--their mouth is clean.\" Then left.  WHAT?!  That really wasn't the time to be making a joke when the cleanliness of the establishment is up for debate.  I thanked him anyways and moved it to the side of the table.  Kept talking and finished up, determined to get out of there.  Wine was good, great selection but now I was curious about the kitchen.\n\nHe returned to the table, noticed I was not eating the olives, and said \"You aren't eating them?  They are clean.\"  I thanked him but said no.  \"I already took them off your bill, so whatever.\" and he took them away.\n\nWOW.  I give them stars for being a great looking joint and having a very nice wine selection, but I will not go back, at least not for food or customer service!  On his defense, he apologized and changed the bill, but was still not really as disturbed as he should be.  What a shame. . .", "author": "Karebear R."}
