{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "Really like this spot!\n\nCoffee: Delicious\n\nAtmosphere: Beautiful spot with great lighting and cute furniture. Wish they had WiFi (some reviews said they have it, but when I asked this past weekend, they said they did not).\n\nService: Super friendly as always", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-02", "description": "I don't have a problem owning up to it - on several occasions in the past, I've outright said I didn't think Blue Bottle was worth the hype.  Maybe it's because my taste in coffee isn't discerning enough (Pike Place is my go-to), but I just never understood why Blue Bottle was so revered.  That is, until now.  After all of these years, I finally figured out what the problem has been - I just haven't been ordering the right thing!  I KNEW it couldn't have been me...ha!\n\nOut of all of the different ones I've been to (here, Mint Plaza, and the Ferry Building), this particular Blue Bottle is by far my favorite.  Besides how it's (relatively) close to my office, it's also got a great feel to it.  The minimalist look, the spacious feel (compared to its sister spots), the fact I've always been able to snag a seat the times I've stuck around to enjoy my drink...not much to complain about!  Most importantly, they keep the line/crowds moving surprisingly fast!\n\nWhile I'd always stuck with their hot drinks in the past, I finally decided to try something different and ordered the NEW ORLEANS ICED COFFEE with Cane Sugar, Milk, and Roasted Chicory ($4.25).  Now, I don't want to oversell this, but talk about a game changer!  Not only did it have just the right amount of milk and sweetness to it, but it packed the perfect caffeinated punch - not overly strong, but it had a delicious, robust flavor to it.  Delicious!\n\nNow, as tasty as my drink was, I'd be remiss not to acknowledge the fact that Blue Bottle is obviously on the pricey side.  Delicious to be sure, and certainly of better quality than the likes of Starbucks, but not all that cheap either.  Not that it would stop me from coming back again, not when I've finally discovered the drink to get to fully appreciate all that Blue Bottle has to offer!\n\nFOUR AND A HALF STARS rounded down for now.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Very relaxing, lots of space, counters, table along the window, big community round table.\n.\nTables along the windows is great natural lighting for people to study and do their work. \n.\nCounter space meaning there's a bar where you can watch them make drinks. It's quite nice and relaxing. \n.\nBig community round table - great for large groups or one who wants to spread their work all over. \n.\nDrink - so I tried their elder berry sparkling water with cold brew. It wasn't my favorite, due to the flavor and not enough sweetness. It was just different, either love or dont like it. They were nice to let me switch back to my regular. \n.\nMy regular to go to is the new Orleans. But the girl told me they have oat milk and I'm like yasss! It's one of my new favorites so this is how your order it. One new Orleans with oat milk.  \n.\nOf thing I noticed about their coffee is that its strong, and they serve you these big ice cubes which slowly melts and doesn't water down your coffee. \n.\nOverall this is one of my new blue bottle coffee spot to actually chill when I'm in the city. Comfy with space, and air flowing in and out which is quite refreshing. Thanks for reading and have a yelptastic day!", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "Stopped on in to get myself an iced coffee. They had a very delicious cold brew. It is relatively small but it felt like it packed a punch so it was more than enough coffee.", "author": "Yochabel U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-20", "description": "This Blue Bottle Shop has more flow customer coming and look more upscale than the Berkeley location.\n\nI adore their interior design of this corner coffee shop. It amazes and reminds me that, things don't always have to have a bunch of items in a room in order to catch ones eye. Best way to describe it is a simple and mellow vibe close to the SF ball park a couple blocks down.\n\nThe iced coffee to me was a little bit bitter and water down. I'm pretty sure there was a couple of grounds inside the pitcher that were not caught by the filter. I like coffee strong and that was NOT strong at all. \n\nI notice they do \"pour overs\" big fan of that, and will be back soon to see how well executed they can make one.\n\nJust note this place does have support or have WIFI like most shops would. \n\nNo pets are allowed in the shop, so be ready to tie your four legged friend outside, to the nearest pole within eye distance.", "author": "Elijajuan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "My office is literally a 2 minute walk to this Blue Bottle location and I literally visit at least twice a week. Talk about DANGEROUS!\n\nI love how spacious this location is and that there is plenty of tables/seats. It's a great place to just have a 1 on 1 with your manager or if you're looking to catch up on some reading. \n\nMy favorite drinks are definitely the New Orleans Iced Coffee and Mocha. Please note that they don't offer Soy Milk anymore, since it's not as environmentally friendly. They offer Oat Milk instead, which is just as tasty!", "author": "MyTien P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "I'm almost tempted to give this Blue Bottle a bad rating just so it doesn't get too busy lol\n \nActually though...\n\nThis is one of my favourite Blue Bottle locations, especially on weekend mornings when it's not too busy. The staff is generally friendly and helpful if you have trouble deciding what you want. If it's a nice day out, it's awesome to take coffee (and maybe a pastry) to-go and hang out on South Park nearby. If you do decide to stay though, there's plenty of tables and seating, making it a good place to work. (Not for too long though; it is a pet peeve when people stay at a coffee shop - any coffee shop - longer than they should and take up tables and chairs.) This location also has big windows with a lot of natural light, which I LOVE!", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Blue Bottle Coffee has quickly turned into a consistently good gourmet coffee chain in San Francisco. Their South Park location keeps up the tradition with a warm and open store on 2nd Street near Bryant.\n\nThe layout is very nice with large picture windows and a white and light wood interior. They have the full menu with several coffee styles including espresso, pour over, and vacuum drip in a rather elaborate and beautiful device. Snacks and pastries are also available.\n\nThe coffee just happens to be great here too. They have a good house blend with single origin espresso available. The espresso was pulled well with a wonderful flavor, especially when poured over a large scoop of gourmet vanilla ice cream!\n\nService was great, although it does take a while to make a custom drink done right. The interior is almost as gorgeous as the customers enjoying their drinks inside and those unfortunate ones just walking by outside. This location is close to AT&T Park so expect crowds during Giants games. \n\nI'm used to great coffee in Sacramento, and San Francisco is really great too. Blue Bottle Coffee in South Park may not have Tweek running around, but you can get a great coffee drink anyway.", "author": "Kristian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "Experience from 1/23/2018:\n\nThis is the best Blue Bottle Coffee I have been to. Some of the things I always like are the friendly staff, good service and clean facility. I really like how spacious this coffee shop is. When you are in need of a pastry and a cup of coffee, Blue Bottle Coffee is here for you.\n\nThe latte art is always so good and it's culinary creativity.\n\nWhether you are:\n- passing by\n- coming out of the gym\n- work nearby\n\nReasons for five star rating:\n- clean facility\n- friendly staff\n- good service\n\nCaffeine fix (run)? You got it.\n\nOverall, positive experience at Blue Bottle Coffee.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "Blue Bottle is my favorite coffee shop for times when I'm feeling a little fancier. It's right across from where I work, and the coffee cocktails are fantastic. Particularly, the coffee cocktail with orange and jasmine tea is my favorite thing to order! They have good snacks like cheese rolls and rhubarb pound cake. The atmosphere is beautiful and even if they're crazy busy the orders are always out fast. The only reason I won't give 5 stars is because it's suuuuuuper expensive. The coffee cocktails are not that much bigger than a shot and cost around $6! Also, this place can get CRAZY around that mid-afternoon slump when everyone needs caffeine.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "I asked the barista for her personal recommendation because I wasn't sure of what I wanted to order. She suggested their New Orleans cold brew drink which let me tell ya, was/is A-M-A-Z-I-N-G-oh my god! 10/10 a.k.a 5Starz...easy. \n\n(Honestly, yesterday may have been my first time trying Blue Bottle but it definitely won't be my last) \n\nStarbucks who??", "author": "Nathaly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Hello to the best coffee in www. Blue bottle made me such a coffee snob. Why do you have to be so good. My bf and I are literally addicted to Oat Nola. We could finish 2 in an hour. Yes it is that good.", "author": "Gwen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-18", "description": "Solid coffee spot if you're in the area. They have all the blue bottle staples and a good amount of benches and work areas. There's a good mac and cheese place around the corner and the AT&T Park is nearby as well!", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "I forgot how much I love Blue Bottle Coffee. Although there are a few location in Los Angeles, they're not easy for me to get to. I recently dropped by this location while in SF and just sat at one of their tables enjoying the Cold Brew and the sun beaming through the windows on my back. I wanted to try something different for once, but I defaulted back to a cold brew like I've always done anywhere else. I absolutely love the cold brew. BBC :-) is definitely on my list of top coffee shops. \n\nThe staff are friendly, and the woman helping me ran through a few items on the menu before I made a decision. This location is very spacious, with tables to accommodate small and large groups. The perfect place to get some studying or work done. I love the open space, with glass all around to bring in a lot of light. There are a number of baked goods that will get your mouth watering. I was tempted to try one, but remembered that brunch was shortly after this stop.\n\nIt's conveniently located near the park. I observed quite a few people who decided to bring their drinks and enjoy it there instead. There are benches for you to sit in and enjoy your brew. On a warm day in October, this is probably the perfect choice. Plenty of parking in the area too!", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-16", "description": "I came here because I was told this was one of the best coffee shops in the city. The environment of the store was nice (looked hipster and chill). The service wasn't as friendly as I would of expected but not bad. The coffee to me was just alright. I was expecting my mocha to have more flavor. Maybe I will try hot instead of ice next time. Still a great coffee place but would recommend philz before here.", "author": "Makaela M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "I am not a coffee drinker but I enjoy coming to Blue Bottle Coffee. It has a great vibe and love the clean decor. I hear the coffee is amazing and folks swear by it. I like the hot chocolate and the little treats that they have...cookies...ham and cheese baguettes...", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "The revitalized South Park space has brought a much needed facelift to the neighborhood, and unlike the eye-rolling result seen on some aging Hollywood actresses, the effect has been neither jarring nor scarring. Yes, I'm talking to you, Meg Ryan. Fortunately I am too old - not for a facelift, mind you - but to play on the cool new jungle gym in South Park unlike a couple of entitled hipsters Jamie W. and I saw who thought nothing of sitting on the tire swing while actual children were waiting for them to leave.\n\nNo, my entertainment comes from the caffeinated libations being served at the fresh-looking new Blue Bottle on the 2nd Street side of the park. What can I say about Blue Bottle that I haven't already said in the five other reviews I've written about at their other locations? Not much except they are certainly consistent. It's a lovely individual pour, and I selected the $3.75 Three Africas blend because I just assumed three was better than one (photo: http://bit.ly/2uPFpVD), even though the Rwanda blend was a dollar more. Go figure.\n\nThere were the requisite baked goods including ridiculously large pretzel buns (photo: http://bit.ly/2w0joCp) and alluring sticky coffee pudding muffins (photo: http://bit.ly/2vnJSAp). Jamie and I stayed strong and kept our temptations at bay. Anyhow, as I was waiting, I was really enjoying the clean lines of the space. Very contemporary and most suitable for a South of market location. There was even a large round table commandeered by a silent group of presumed tech geeks, almost like they were hired as performance art (photo: http://bit.ly/2gIoTCW). I was just happy to take my coffee to one of the little metal stands in the park. That's what those are for, right?\n\nCOFFEE - 4 stars...the smoothness still shines here\nAMBIANCE - 4.5 stars...one of the nicer Blue Bottles in the chain\nSERVICE - 3.5 stars...oh, friendly enough\nTOTAL - 4 stars...Blue Bottle in a most idyllic urban setting", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-13", "description": "The best Affogato in the city! I love it -- it's a very bright and open spaced café. The only reason why I rated them with 4 stars, is that they don't have any outlets and no WiFi. I had only 1% battery and thought I would be able to charge it here, while I enjoy my Affogato, but that was unfortunately not the case. Overall, very yummy and they play pretty good music.", "author": "Gia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "GOOD，sort of better than Starbucks. I mean Starbucks is good enough. I ordered Bella Donovan. Enn a small cute place but too many people noisily.", "author": "Xin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "I really like this location, and you can usually miss it because most of the other places around here are bars where you can watch the game.  This location is pretty open and there are a few seats.  The drinks here are just as good as the other locations.  It's also a great place to come here to read or study.  This is prob one of the most hipster cafes i've been to.", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "The best part about this Blue Bottle is that it's open early, even on the weekends. In an area that's starving for options that aren't Starbucks, having Blue Bottle is great when you're looking for a pour over at 7AM on the weekend. I wish they had the Leige Waffle like some of the other outposts, but I'll settle for their limited pastry assortment and a pour over in a beautifully lit space with lots of open seating! Friendly staff too, which is refreshing and welcoming.", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "The smoothest coffee you will ever have. My brother was raving about how smooth the coffee is here, but I didn't really know what that meant until I had a sip of my cappuccino from Blue Bottle. I always thought all coffee tasted the same until I came here. \n\nNot only is the coffee great, but the store is super clean and well kept. I absolutely love the minimalist layout of the store.", "author": "Eunice T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "Usually long lines and slow, but nonetheless worth it. There are a lot in the city, and now that it's bought by Nestlé, I'm expecting to see more pop up here and there. My fav is the iced mocha (not actually on the menu board).\n\nThe place is photogenic and has a hipster/mid century design fused to the aesthetic. Gets pretty hot sometimes, and no dogs inside.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "Cute and very clean location nearby AT&T park and a cute little grassy park.  Friendly staff and of course good coffee.  Looking forward to returning when I'm back in the area!", "author": "Rebecca R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-06", "description": "I met up with a friend at this new location just a few Saturdays ago. At about 4pm, we were able to snag a 2-hour parking spot pretty easily in South Park. When we got to Blue Bottle, I was worried that we were going to have a hard time finding a spot to sit, but luckily this cafe had a decent amount of seating and it wasn't too crowded. There were several tables with bench style seating that wrapped around the room, and a large round communal table for bigger groups. The cashier was friendly and surprisingly helpful in non-pretentious way, and the coffee hit the spot as per usual.\n\nPro: The large windows brought in lots of light and the high ceiling made it quite the opposite of a dark, stuffy little coffee shop. \n\nCon: Unfortunately, there is no wi-fi available.\n\nAll-in-all, a great use of space of the old Jeremy's consignment store.", "author": "Camille B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-11", "description": "This place does not have WiFi!!! Nice environment, big disappointment. It showed up as one of best place to study by yelp. It is misleading......\n\nGood coffee though.", "author": "S. L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "It took such a long time for a simple coffee. From queue to beverage was 20+ mins. Lines out the door. I decided to try it to see if it lived up to the hype. It was lovely - but so are many others and I personally would not bother again given the wait and pricing.\n\nEdit - they reached out and apologised which I didn't expect and I appreciate. Offered a gift card, but I asked them to give to member of homeless community as I am not in San Francisco very often.", "author": "Tom M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "The coffee here is fantastic! I will often switch between Blue Bottle and Philz and they both are ranked very evenly in my book.\n\nThis location, however, has a sweet setup and all around looks very chic.", "author": "James D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "If you are in the city, have some time to spare, and love coffee - Blue Bottle is your new favorite place. The South Park location is tucked into a corner on 2nd Street that gives it ample lighting and minimalist interior design for your Instagram feed and serves up a mean pour-over. \n\nThis place can be the perfect place to meet up with someone for coffee or put your headphones in and get some work done ... if you can find a spot. I've never been to this location when it's not busy, BUT if you can find a spot it seems like the perfect place to work and people watch. \n\nCoffee is timeless and I love how Blue Bottle caters to each cup/person & spends time on your cup of coffee rather than rushing through to get orders out by the second. If you don't mind waiting a little bit, your taste buds (and your productivity) will thank you later.", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "New location in SoMa, that opened a couple months ago. I just got back from New Orleans, so I was missing some chicory creole-style coffee. Got the New Orleans cold brew to satisfy my need! \n\nThe best aspect of this location is how spacious and chic it is. Great place to study or do work, with high ceilings, lots of light and huge windows!", "author": "Vasiliy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "New Orleans, burley with soy please!!!!\n\nMy go-to drink and with any Blue Bottle, they always deliver. I love their iced coffee and it's so fast to serve that I can stop by right before work. I'm glad this location popped up and will be coming here on a weekly basis.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "I've been a regular patron since it's opening, and they've single handedly improved the neighborhood.  \n\nThe staff are 5 Star, including the Manager....friendly, engaged, upbeat, encourages sampling of new beans, and on and on.  I\n\nBlue Bottle at South Park is a neighborhood gem.  \n\nThank you to all of you for being so inviting and real.  \n\nJeffrey and Jonah (yellow lab!)", "author": "Jeffrey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "I wanted to make a shout-out to their excellent customer service. They saw my previous not-so-good review on yelp, and contacted me the same day through Yelp, offering a refund for their coffee. WOW! This was excellent customer service. Because of their awesome Square credit card service, they were able to look up our receipt, and refund us. No catch. \n\nThat is stellar service. Kudos to them! Now I have to return!", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "New Orleans Iced Coffee - that's all you need to know about Blue Bottle.\n\nI still remember my first sip a few years when the first location opened up. Instantly I fell in love with this. I'm glad they finally opened up a new location which is located in South Park. \n\nThis location has a different vibe compare to most BBC I've been to but the staff and coffee is still very consistent!", "author": "Danny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "I was looking for coffee within walking distance on a rainy Saturday morning and was pleasantly surprised to see that Blue Bottle Coffee opened up a new location! \n\nI decided to walk over in the rain anyways even though my umbrella flipped inside out because of the wind on my walk over! I even came across two other coffee sojourners who were also making the trek in the rain to come get coffee. \n\nThis location has great interior design with large open windows and comfortable wooden tables and chairs. It feels spacious and comfortable without any clutter. There was also plenty of natural light from the windows despite the fact that it was overcast and raining this morning.\n\nI had an 8oz mocha made with almond milk. It had latte art in the shape of a heart and tasted delicious! \n\nI'll be back and definitely recommend this location to others.", "author": "Regina W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-12", "description": "No wifi. That's crazy in this day and age. WiFi is the main thing I need at a coffee shop. No chai tea either.", "author": "S S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "The nicest coffee shop, the employees always greet people by name. They know all the customers that regularly come in and their favorite drinks! I always enjoy coming into Blue Bottle and know that they employees take pride in their work. It is nice to have a coffee shop that still cares about community.", "author": "Aili P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "My 100th Yelp review goes to Blue Bottle Coffee!\n\nWe stoped by here this past Saturday at around 5pm. The place had a good amount of people lounging or just working on their laptops. \n\nThe ordering process was easy but the menu had a glare from the spotlight so it was a bit hard to read. The place is spacious with a lot of places to sit. We chose the tall chairs near the window. However, it was a bit awkward since the table was really low. We didn't stay long because it was just uncomfortable. \n\nAnyway the coffee, as always,  incredible :)", "author": "Alice L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "I love Blue Bottle but this is the best one among all of them! Not only the coffee is awesome but also the stuff is very friendly. If you have not tried this place, I strongly recommend this location.", "author": "Pelin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-13", "description": "Feelings a bit of the Monday blue? \n\nIf so, don't worry too much because Blue Bottle Coffee has you covered from your head to your toes. With their aromatic coffee, you'll be sure to please your taste buds without even tasting a single sip! And once your taste bud gets a sip, you'd better be ready to stay AWAKE4DAYS!\n\nWith all that being said, I still have a latte (lot) to espresso (express) but that'll be for another day and another review.", "author": "Benson M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Great vibe in coffee shop. Definitely worth the stop to grab a great cup of java, check e-mail and meet some new people!", "author": "Matt C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Out of all the blue bottles in the land, this one has the best team. What a friendly staff. They go above and beyond remembering faces and names and always turn my bad days around. Thank you guys for being awesome!", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-25", "description": "I don't get the Blue Bottle Coffee hype.  I visited this newly opened space by my work and found the space it be fairly spacious and clean.  I ordered a cold brew, forgot which one and it was just ok. I had to add my own sugar and it was still not quite to my liking.  I guess I'm more of a Mocha Frapp girl and they didn't really have anything similar to this.", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "As sad as I am to see Jeremy's gone, glad it was filled up pretty quick by a super cute, greatly appreciated Blue Bottle -  The neighborhood needed one! \nThe space is decent sized, open, lots of seating, high ceilings, and just a clean sleek look to it. Everything you'd expect from BB. \n\nSo far, they have the basic menu of espresso drinks, drip coffee, some tea, and some display baked goods, and sandwiches. Granola and other drinks in the fridge on the side.  While I didn't see it on the menu, I think they're doing affogatos because there is an ice cream scoop on the counter. Can't wait to see what else develops on the menu.\n\nThe big windows make for great people watching.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-07", "description": "Im Finally here in blue bottle. Been hear it long time ago. You can tell the difference between starbuck if you like me as a starbucks fans for long time. Turn out i Really like the atmosphere here, little crowdy but still got place to sit and sip my New Orleans coffee. Recommend place for coffee lover .", "author": "Hiro L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-04", "description": "An almond milk cappuccino is $6.19 and they donot have wifi!! Nice place for meetings but it's not a place to get work done.", "author": "Chaithra K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-14", "description": "Always love popping into Blue Bottle, no matter the location. \n\nYes, the coffee selection is pretty similar to other coffee shops, but what makes it stand out is the awesome Cold Brew they have. Their New Orleans Cold Brew is bomb and legit one of the best cold brews I've had and yes I know its simple. \n\nThe shop was a little packed give that they don't have WiFi but it's a great spot to start the day and either hit the Embarcadero or cross the bridge into the Eastbay. Anyway, overall pretty decent spot, quick service, no wifi, few seats,", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "Favorite coffee on the block for sure!! Great staff-cool atmosphere-and most importantly, great products!", "author": "Alvin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "Not a busy location, good amount of seating, and a nice quiet atmosphere to just stare out the window at a quiet SOMA street...", "author": "Leo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "This location is so new and I love it because it's so sunny in the afternoon! Been here multiple times but it's usually busy during the mid afternoon so be mindful of the line! I've come at 2:30 before an waited like 20 minutes vs only 2 min at like 12:30 pm so obviously it's a prime afternoon coffee spot. \nI've always gotten their New Orleans cold brew which is great, just a tad sweet on the finish and smooth! They've runout before in the afternoon so be sure to get there before that happens.", "author": "Kristie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "I came here and ordered a mocha. I was pleased with it. My sister got a cappuccino and was very impressed. Despite being in the heart of San Francisco, Blue Bottle was not crowded and the service was quality.  If you want a solid cup of Joe, this is your spot.", "author": "Sam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Happily representative Laura was really friendly and helped to assist this experience.\n\nI found mythical parking to get grilled cheese next door and was happy that I could finally sit down and have a moment here and then follow up with craft beer across the street.  The location is adequate for anyone who is driving and attempting to park and thus, this journey will be checked off my list sometime soon.\n\nWhen I walked in and got up to order, Bishop Laura was very comforting and pleasant. She instructed me to go to the correct area to order right next to me due to an honest mistake of not knowing how to line. Her coworker was warm and inviting but Bishop Laura was embelematic of the stereotype of the most caring person you see in any movie.  You know- the baristas you just want to say something to you besides the polite thank you and have a great day kind of deal.\n\nI ordered my Bella Donovan which came up fairly soon. It was done just right. \n\nI asked about the wifi here as many people are frequently seen with laptops and such and there's a lot of space to conduct business including a business round table on one side... once again Bishop Laura was helpful and informative with her caring \"we encourage community\" attitude.\n\nI was a fan of the location known as Handsome down in Los Angeles which was turned into a Blue Bottle and now will gladly make the trek over there again.  \n\nAnother thing to note is that this business does the \"Healthy SF Surcharge\" which adds a tax to your order to pay for employee healthcare benefits. I support businesses providing healthcare to their employees, I definitely want to help pay for an Elder to get healthcare benefits and further enable her. I'm all for helping to pay for things upfront to assist with that and what not and this expected disclosed on the receipt and also an extra f yes given the fantastic customer service   :D", "author": "Jefferson B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-25", "description": "Coffee is good but I seriously don't understand specialty coffee places that don't even have wifi for their customers, it's San Francisco for crying out loud, it's not like the worlds largest tech and startups live here... paid 6.75 for a pour over and can't even crank out some work for 30 minutes #lame", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "Well hello Blue Bottle. Your age reducing detox facial has done wonders!!!\n\nIf I were running a business of any kind, and this space was available for rent, I'd swoop in and pay cash!!! The space is stunning!! Nice, clean lines, very modern and could easily pass for a hipster SF loft. Classy AF!!\n\nThis is by far the most practical and user friendly Blue Bottle shop I've ever been to. They represent the product extremely well and clearly the brand is on display for all to understand. Ray Charles and Stevie Wonder could walk through the shop and would know within moments that they are within the Blue Bottle walls. \n\nNow, a fact that very well could be news to some of the coffee consumers in this area. The pour over, which I have come to believe is the only method of coffee brewing (hot coffee at least) that works for me. The owners of Blue Bottle went all the way to Japan, where the pour over was invented, to learn the art of the pour over. That's a solid nugget of intel to provide your \"friends\" with next time you sit down to drink coffee. \n\nNow, the barista on shift when I was here Sundee was an excellent coffee adviser. I asked him which coffee he preferred and he clearly read my mail. He said, \"the Three Africas holds up better to dairy and provides a creamy finish.\" Sold!! I generally refuse to order blends, but in Blue Bottle I trust. #Trust\n\nThe shop is nestled very well and I drove right by them without noticing the logo, but I think that's because I wasn't really looking for them. Full disclosure. I was on the way to (clears throat) Philz and couldn't find parking over there, so Yelped coffee and was pointed in the direction of BB. Found parking in the lot beside the shop and I suspect the parking Gods deserve some credit here cause that's not exactly the easiest hood to find a parking spot. Glad it worked out that way cause yeah, this is a really solid location to put your feet up and enjoy a solid cup of coffee.", "author": "Hector G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-15", "description": "I love Blue Bottle coffee, but they seriously have to do something about the wait times. Good things take time but I can't consistently reserve 20+ minutes for a coffee. Pleaseeee get more baristas. The line is out the door, there is demand.", "author": "Ross M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "I got the New Orleans Iced Coffee per recommendation from a friend. It was amazing! I didn't have to add anything, perfect the way it was! Very different than the coffee shops at home!", "author": "Kasia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-24", "description": "Note: they don't have wifi or outlets here, as the barista rudely informed me after I asked which seats are closest to the outlets. My drink was not good, definitely not worth the almost $5 I paid for it. It's a beautiful space inside, but there are probably well over a hundred better places to spend your time and money.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "This location has all the makings of a normal Blue Bottle establishment - lots of bright wood, white ceramics, and a huge line ordering lots of New Orleans Iced Coffees (don't blame them, it's delicious).\n\nMy only gripe isn't with the space, food, or staff, and is nothing the coffeeshop can really solve. Given its prime location next to Small Foods, the previous coffeeshop that monopolized the \"SoMa cafe meeting,\" this Blue Bottle is especially brimming with South Park VCs taking meetings with founders and recruiting pitches. As a result, there's very little space to sit & have a friendly conversation like most Blue Bottles.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-21", "description": "We tried out this new Blue Bottle that took over the former Jeremy's space. I had been wanting to try it for a few weeks and I had a legitimate question I wanted to ask but what's the deal with not having a phone number? I didn't feel like making the walk only to find out they did not have what I wanted. So I waited and waited until one day someone else brought up the idea of Blue Bottle.\n\nI had a Mocha and he had a Cappuccino. Both came with pretty latte art on top. I also finally found out that the answer to my burning question - do they have waffles? is No.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-27", "description": "I dig this little spot. Is there more than one? \nThe coffee is really God's as is the snack dessert type sides. The place is cozy cool with efficient workers and a variety crowd devoid of cliques! I will return the cappuccino I had was excellent!", "author": "Brian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "I do feel every time a Blue Bottle moves into one's neighborhood (in my case, my work hood), there's a sudden caffeinated joy and exhilaration engulfs the area.\n\n... That is, followed by the inevitable frustrations of a long and ridiculous line of folks demanding such amazing coffee, and ended by a genuine appreciation for these guys do.\n\nIf you're new to Blue Bottle, I suggest:\n- New Orleans Iced Coffee: something mildly sweet yet spectacular\n- Mocha: they make it perfectly and tastes like they melt bars of wonderful dark chocolate in there\n\nBe ready for lines at any hour, so best just suck it up as the queue goes fairly quick, even when its out the door. Worth it for one of the best coffee spots in town, ignore all them naysayers!", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-21", "description": "Sadly representative Laura was really offputting and helped to assist to ruin this experience.\n\nI found mythical parking to get grilled cheese next door and was happy that I could finally sit down and have a moment here and then follow up with craft beer across the street.  The location is attrocious for anyone who is driving and attempting to park and thus, this journey was not estimated to be checked off my list anytime soon.\n\nWhen I walked in and got up to order, barista Laura was very condescending and rude. She instructed me to go to another area to order right next to me due to an honest mistake of not knowing due to traffic in both directions. Her coworker was warm and inviting but Laura was embelematic of the stereotype of that snobby pretentious uncaring person you see in any movie.  You know- the baristas you just want to say something besides the polite thank you and have a great day kind of deal.\n\nI ordered my Bella Donovan which came up fairly soon too. It was alright. Just alright. Nothing fancy or extraordinary.\n\nI asked about the wifi here as many people are frequently seen with laptops and such and there's a lot of space to conduct business including a business round table on one side... once again Laura was snobby and rude with her condescending not caring \"we don't have wifi\" talk and attitude.\n\nI was a fan of the location known as Handsome down in Los Angeles which was turned into a Blue Bottle and now will sadly not ever make the trek over there nor this location ever again.  \n\nAnother thing to note is that this business does the \"Healthy SF Surcharge\" which adds a tax to your order to pay for employee healthcare benefits. While I support businesses providing healthcare to their employees, I definitely don't want to help pay for a rude barista to get healthcare benefits and further enable her. I'm all for helping to pay for things upfront to assist with that and what not but this not disclosed until seeing the receipt and not able to opt in or not surcharge was also an extra wtf given the horrific customer service :(", "author": "Jena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-23", "description": "my 1st ever visit to any blue bottle everrrrr\n\nordered an ice coffee then saw one called \"o.g.\" and had to order it too. ditched the baristas' friendly warnings and got everything str8 black.\n\nyou knew i would\n\n(^_^) Oji: bitter\n\n(^_^) New Orleans: semisweet\n\nbarista said one of them is actually a concentrate. i'm typing this like 7 hours later still lit trill lit son.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Technically, this is the best coffee shop in the Bay Area I have ever visited. Excellent stuff and amazing coffee.", "author": "Yijun Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-22", "description": "Both espresso and milk based espresso drinks are poorly executed. On both my visits the coffee was over extracted. Both the blend and single origin have the roast to the front of the flavor profile and lack any interesting character. \n\nThere is a poor selection of pastries and cakes with fruit flys lazily circling them. On this visit, one pleasantly followed us to the table. All up it was $21 for two drinks and two cakes. Expensive if the quality was better, a plain rip off with this level of execution. \n\nThis in stark contrast to the Hayes Valley Blue Bottle which consistently produces well made drinks with a better selection of cakes, all in a place 1/8th the size. \n\nThe only redeeming factor is the location and the bright, spacious interior. I most likely will not return and I expect this place to only devalue the brand.", "author": "George B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "This is the second Blue Bottle coffee location Ive been to and I definitely like this one way better! Theres a good amount of space, nice place to do work/study, or to just even catch up with a friend. I love love love the New Orleans, its definitely my go-to drink here. And my friend got the mocha which was really yummy!", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-16", "description": "Food: 4.0/5.0\nService: 2.5/5.0\nValue: 2.5/5.0\nDecor: 3.0/5.0\nOverall: 3.5/5.0 \n\nLike many Yelpers, I find myself spending unnecessarily large sums of $ on coffee and related products.  While certainly not a super connoisseur of the stuff, I do like to occasionally step away from my reward star collection addiction and treat myself to a true premium-er coffee.  Blue Bottle, along with S** et al serves that purpose, and this location is generally as good as any other.  Just don't understand the inability to put in WiFi.", "author": "Damian W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-07", "description": "The barista who was tamping the coffee to make espressos during the Wednesday 2:30pm shift makes horrible coffee. My latte was super bitter and not worth $5. Please hire better baristas if you're going charge customers this much for a cup of coffee. \n\nLattes are not consistent here, extremely bitter latte today, totally depends on the barista during the shift. \n\nVery disappointed!", "author": "Jane H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "SO glad to have a Blue Bottle in the neighborhood!!!  The lines is usually horrendous between 1-3pm but I'll usually wait anyway because they always give me a small sparkling water with my macchiato when I ask for it.  \n\nOne time I also left my wallet behind on accident, and they saved it for me -- and nothing was missing! Perhaps it's more of a testament to the neighborhood than the spot itself, but it's now permanently my go-to afternoon coffee spot. (It's also a good place if you want to stock up on beans or Chemex filters, sometimes hard to find in the area.)", "author": "Elizabeth K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "Fantastic place, has plenty of space, and love the design. The coffee is also great.\nReally like the interior design with large windows.\nYou even can find free parking space around the corner if you are lucky enough!", "author": "Sam M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "I've been waiting for this place to open and it's finally here. South Park will never be the same. Blue Bottle may be one of the original hipster coffee places in all of the country and now it's only a few steps away from my office. This place has the best espresso drinks in San Francisco, and you will never go wrong with their cappuccinos or lattes. \n\nI don't know if it's the overly tatted barristas or if the coffee is just that good. Either way, I know that Blue Bottle will be taking my money for many years to come!", "author": "Sam L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-19", "description": "It's very beautiful Establishment, however I consider myself a coffee connoisseur and the stuff is to better I don't understand what all the fuss is about.", "author": "Noah C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-15", "description": "Way too pricey\n\nWay too cool\n\nWay fucking way too loud\n\nWay to cramped \n\nWay to no hi fi\n\n\nWay too cookie cuttered \n\nWay too end of the world", "author": "Willi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "Best customer service experienced I've had in a while! If you're ever in San Fran, this place is a must stop!", "author": "Josh A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Coffee is great. Hot chocolate is legit. Pastries are meh.\n\nThat is, if you have the patience to wait out the morning queues.", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Cool location! Convenient for business meetings and coffee chat in the heart of Soma.", "author": "Nandan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-21", "description": "Great spot. Here is always great coffee and small (but good) selection of baked goods. This location has great atmosphere, cozy seats and a lot of natural light. Friendly baristas and quick service. Great to conduct a meeting, study, spend time with a friend or just grab a cup of coffee and read the news if you are in this area. One thing that i couldn't find a WiFi connection :(", "author": "Hadley J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-19", "description": "A coffee shop without WiFi - are you kidding me ? Lol\n\nI understand that blue bottle is very popular. But be fore-warned if your expecting what 99% of other coffee shops have.\n\nHowever, the brew and almond milk was great. But have to ding two stars for not having wifi. IMO, what people expect in a coffee shop. I went there for great brew and wifi to do some work with.", "author": "Michael V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "Upon entry you will notice it's minimalist decor, this shop is clean and not cluttered. I usually just get a pour over or Americano, you wouldn't want to taint such good coffee with any of the usual coffee house condiments. They roast their coffee in small batches , so it's like winning the lottery, when they have a freshly roasted bag of your favorite coffee. Blue bottle never disappoints, it's just good coffee .", "author": "Carmen M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-24", "description": "The fact that they don't have Wifi i get it. But this guys overcharge for poor executed coffee and don't even have outlets to work on your computer. Really disappointed.", "author": "Laura A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "Very nice and friendly staff. Light wood interior is bright and the hardwood benches and chairs are surprisingly comfortable. Pastries are good and the coffee is always great. It does get busy and crowded with nearby tech company people, who hang out in groups and are oblivious to other customers. I docked one star because of that, and because even if it wasn't full, it gets very noisy. Probably due to the acoustics of those nice wood materials used for the interior.", "author": "Paula S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "Excellent coffee, service was good as well. Just wish they had locations in Oregon!", "author": "Cassy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Pricey coffee but so good Perfect for coffee lover. You need to try \"Brazil\" coffee....it's worth it at $7 a glass.", "author": "Willy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Felt like I found a gem today! This is a fairly new location, so on a weekday afternoon it's not overly crowded like other Blue Bottles nearby. I tried the Oji Old Fashioned (slow-dripped coffee, jasmine tea, balanced sweetness, citrus rind) and was blown away by the refreshing smell & taste. This is my new favorite iced coffee!!!", "author": "Diana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "Friendly staff, great/potent coffee, good number of table and seats, free wifi. It can get pretty busy during work hours since this place is surrounded by tons of startups/companies. I like working at the large round table, but I have to remember to fully charge my laptop before coming here since there aren't outlets. This Blue Bottle doesn't serve affogatos (yet?), but I hope it does soon!", "author": "Annie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-22", "description": "This shop opened in the neighborhood recently. We were super happy. Very nice interior design. One star goes to their design and the other one to their flowers and compostable cups etc... People who works in the shop thinks they are super cool. There is a difference between being cool and mean. Piercing, tattoos and purple hair doesn't make you cool at least in SF. It takes forever for them to make coffee. I ended up waiting 20 or more min for a freaking americano when me and the other gentleman were the only one in the line is not cool neither acceptable. When I asked about my americano the other lady who just arrived to the shop made a comment right away saying, yeah, they are very slow here. \nJust go to next shop called Small. Way more friendlier and faster and same coffee.", "author": "Z A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-20", "description": "Got an almond milk latte. It wasn't good and had a grainy texture. My husband got a regular latte and said it was ok but not great.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "I just got a cappuccino here on my way to work, which was pretty good. Nice location and it's so clean and new. There's a big round table, which would be good for a large group (6-7 people).", "author": "Brian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-08", "description": "Ever since it opened up in this location, I have wanted to try it out. Today, I finally did. I had the Bella Donovan - drip coffee. This was the only flavor choice available for drip and the overall menu itself looked minimalistic. For drip coffee, they brew each cup individually but you have to mix cream and sugar yourself. The coffee tasted pretty good, definitely a step up from the usual chain coffee shops, but still not as good as my favorite coffee shop. \nThis store does serve lattes so people who prefer those might like it here. The decor is nice, and the coffee apparatus, books, etc provide a very cool vibe. Overall, this is a cute little coffee store but since there are better options at the same price point, I won't be returning here.", "author": "kumar k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-02", "description": "I love blue bottle coffee, I mean it's the best coffee out there and even moreso the food but the reason why I gave it a 3 star is because this location doesn't have food and they don't specify it anywhere . they should atleast brand it like blue bottle express or something.  we got all the way to this coffee shop only to hear casually from the waitress that ah we don't have food . I am hangry.", "author": "Ragfragger F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Great coffee and great vibe! I come here every day and would never go anywhere else now that I know it exists! Check it out", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "Love the vibe great staff very helpful in explaining  everything. Great seating area nice views.  My only complaint is as other reviewers indicated. No wifi ((((. Overall good would revisit in the future.", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "I love how open this shop is and all the bug windows. It's also dog friendly! I like the Oji coldbrew. Very nice to relax here on a Sunday morning. Definitely recommend!", "author": "Lindsey R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-07", "description": "One star for nicely designed space and a good will, but  operated by confused people who can't get your order right.  This is strictly coffee place ... Don't order a tea. ... You might wait for hours, ..\n  Perhaps, they will get it right with the time and experience ....", "author": "Jane T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-06", "description": "25 mins to line up and receive a coffee. Nice. Asks for a $1, $2 tip on a $4 coffee. Bit much for such a speedy turnaround!! Staff don't seem to appear bothered by the waiting customers", "author": "Steve R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-16", "description": "I love Blue Bottle, but you need to install blinds! With the sun out, the coffee shop is 15-20 degrees warmer than outside, add on the bright sun shining right through the huge windows, then add on warmth from consuming caffeine.  Please please please fix your set up.", "author": "Skye W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-12", "description": "5-12 wanted to give this shop another go and they still put my for here beverage in a to-go... come on, yall... it's not that hard. for $5 i FOR SURE don't want paper espresso. \n\n\n\n\nwas craving an afternoon espresso with my roommate so we decided to stop by this relatively new joint in our neighborhood. i oder my 4pm usual, caffe macchiato for here, please. they put my drink to go, while they put my roommate's drink in a for here cup, but never returned his 65 cent change to him. an odd and disappointing experience capped off with blue bottle's chalky and stale espresso.", "author": "Yves D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "Great coffee and sweet staff! This place came highly recommended and didn't disappoint. I'm a cold brew or latte lady but I went with the baristas suggestion of a mocha. Smooth, rich but not overdone. Next time I'll have a New Orleans cold brew!", "author": "Jen B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-02", "description": "One size only? Super small size?\n\nExpensive?\n\nNo wi-fi ?\n\nYes, this blue bottle coffee location offers all of the above listed.\n\nGave 2 stars because they have ice in their iced tea and there was tea in it.\n\nOtherwise - zero score on every expectation from any coffee / tea shop.", "author": "amit p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Among the blue bottle chains this particular shop has been consistently good. The foam and the taste had just been perfect every single time. The lines keep getting longer day by day hope they add more staff :)", "author": "Magizh T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-18", "description": "I've heard people rave about blue bottle and got to try the Oakland Lights today I was disappointed. $4 bucks for a small bitter weak drip coffee. I won't be back. The shop itself was cute though and the barista knowledgeable and nice.", "author": "April A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "While it's a great space the staff can never seem to keep up with the flow of traffic. It's a good and bad problem. Each cup is given its due attention, but you must bring your patience. Especially at peak times.", "author": "Caleb H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "This opened recently and I love the atmosphere. The prices are what you would expect but it's a beautiful shop. I go during the day and it tends to be steady but there is always seating!", "author": "Barry C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "Love their ice tea! If you are a tea fan I would definitely recommend their iced black tea. Freshly brewed from leafs with attention to every details such as brew time just make their tea very enjoyable. Went to this place on a Sunday with no line and the staff are friendly. This store is nicely decorated and very quiet. Only down side is no plug absolutely for my laptop and no WiFi, which in my opinion kind of defeat the purpose to sit in the coffee shop. But overall still a good experience", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "longest wait for a cup but it didnt hurt that it was one of the best looking blue bottles. they may need to add another machine especially when lines are way past the door.", "author": "NYSD G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "Hip spot with solid espresso. Pour over coffee looks amazing, long lines but the service is super quick.", "author": "John N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "Great new location in the South Park neighborhood caters to the cast of \"Silicon Valley\", San Francisco edition.  Wonderfully large, I've yet to arrive to find the store not completely full of coffee drinking patrons.  As busy as this location is, I would guess even more so than the Mint Plaza store, the team assisting customers is the best.  I understand that most of the crew who were displaced when the Mission location closed has relocated to his new shop.", "author": "Rafael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Blue bottle by and large instigated the \"third wave\" coffee revolution, (honorable mentions to Ritual, even though I don't like the level of sourness to their coffee), which means that that they chose lighter roasts designed to bring out a lot of the more subtle flavors of the coffee that the previous west coast style of over-roasting burned out of the beans. I am more excited about the beans themselves than getting a cup at the store location that often has huge lines. I also don't always enjoy the pour over method for all types of coffee types, that do much better in a french or aero press. Anyway, this review is really for the beans, which are some of the most exceptional in the bay area and reflect the types of things that wine experts go on about regarding \"terroir\" or the way that the composition of the soil and landscape inform the taste of a coffee bean.", "author": "Vadan Tereza R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "Great location! Very clean and friendly staff. Love the coffee. Lots of seating to share or individual. Bright and open.", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-28", "description": "Too expensive to wait that long for my latter. I ended up getting mad and start my day nervous.  They are SUPER SLOW. If you are in a hurry or so... don't even think about getting in the line. It might take up to 30 min... whaaaat? Yes... Design is pretty cool though.", "author": "Melanie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "I'm sure it's possible, but I've never went wrong at a Blue Bottle location.  This one is no exception.  Cappuccino is spot on.  There isn't much else to say.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Just saw the shop opened up across from my work. Beautiful cafe with friendly, informative staff. I got the single origin Ethiopian on espresso... so yummy!  They have a really unique espresso machine there, it's built into the counter so all you see is the group head on the counter. Saint Franks has something similar, but this is even more minimalistic. Really cool. Definitely worth checking out if you are in the neighborhood!", "author": "Marie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "Great! It's very clean. It is very good for a large group.", "author": "Hkc V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-01", "description": "Has a nice decor, very nice seating, great baristas. Would be an excellent place to work on your laptop but there is no WiFi. According to one of the baristas, this is on purpose. I imagine it's to prevent customers from staying for too long, but there is plenty of space and there are better ways to stop WiFi abuse than not having it at all. Furthermore, many people were using their phone to tether, so it doesn't seem to stop those with a data plan from camping out. It also closes at 6, which is a bit too early.", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Great coffee, cute location. Like other Blue Bottles no wifi", "author": "Clark L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Tried a three Africans drip coffee down at the farmers market. Probably the best coffee of my life. Highly recommended especially since it's at the same price point as the green Seattle mermaid chain.", "author": "Chris B."}
