{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "My girls and I arrived at this place after driving past two other boba guys.  The only reason why we came here is because the parking is a bit better.  Which is definitely a plus in San Francisco!!   When we arrived at the location, there was a lot of people in line already, the most confusing part is the line for ordering and line for picking up kinda merged into one line.  So we had to ask who was actually in line and who was waiting for their drink.\nMy friend and I both ordered Medium strawberry matcha latte (soooooo good!!)  and my other friend got a hong kong style milk tea with boba (25% sweet).  \nWhen I first tried it i was a little iffy about it, because thinking of strawberry with match just seems a bit odd.  But when i tried it, i couldnt stop drinking it.  The boba was also so fresh and chewy!!!  \n\nThe Hong kong style milk tea was pretty good as well.  But if i ever make the trip from San Leandro to San Fran I will def take advantage of getting the matcha strawberry milk tea!!", "author": "Irene M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-17", "description": "Drinks: They have a decent variety of drinks here (milk teas, green teas, fruity teas, etc.) and I went with the highly recommended Strawberry Matcha with boba and it was quite delicious. I loved the strawberry and matcha flavor - they complimented each other well. The sweetness was pretty good and it can also be adjusted by a staff member. The boba topping was also very soft and chewy! \n\nLocation: Just a short walk from Dolores Park in the Mission District. It's a cute shop but its also pretty small so you will most likely not spend much time there. \n\nParking: Street parking but can be hard to find on the weekends.\n\nService: Pretty quick for a weekday; will not be much of a wait. \n\nPrices: It can be pretty pricey, it will cost you about $5 or more for a drink here.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "I like that Boba Guys offers Hong Kong Milk Tea. All other boba places use Jasmine or green tea and there's never that much tea flavor, but by using black tea, the tea you're ordering actually tastes like tea! And of course you can't go wrong when you add condensed milk to anything. \n\nWould be nice if they offered light foods (maybe toast with condensed milk?!), but for now, the milk tea will do.", "author": "Cal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-03", "description": "Aw do it again. After hearing a lot of good reports about Boba guys from my friends and former coworkers, I decided to take the opportunity to give it a shot. My usual behavior was that I grab a drink after any interview and by chance and fate boba guys was nearby. There are multiple locations nearby and this one is the most convenient one. Why? There is a lot of parking nearby on the weekdays and all you do is park, cross the street and walk right in. You can even ride a bus and go right in. In terms of flavor, I really like it. The drink I had was real fruity and has a great taste in my mouth. It's really on point. This location seems to be a huge hit among SF natives and Academy of Art students. They have WiFi too upon request. \nDrawback: cash is not accepted but who the heck even cares? No one", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Yay!! Sooo happy I don't have to go driving into the City, look for parking and wait in a long line for boba. This location is only 5 minutes walking distance from my job and I couldn't be happier!\nI went it at 1:25pm and only 2 people in front of me. There was a large group finishing up to get their drinks and once they cleared out, there was plenty of room!\nI was out of there within 8 minutes with my iced Strawberry Matcha latte w/ boba. It was so pretty before I mixed it up. The boba was probably the freshest I've had- super soft, chewy and didn't get hard sitting in my iced drink. (could also have been cause I didn't let it sit that long... it was too good!)\nThey mentioned if I didn't like my drink, I could tell them and they'd remake it. I had mine with organic milk and 75% sweetness. It was perfect!\n\nI'll be back soon to try the rest of their drinks!", "author": "Mimie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "I don't get boba often, but when I do...\n\nIt's wherever is closest and good.\n\nBut when that place is Boba Guys, I'm pretty excited! I'm not sure why. Maybe because it feels bougie? Maybe because the consistency of their boba is chewy and fresh? Maybe it's the aardvark. We could go on for days.\n\nEff it, let's do it. Maybe it's the white interior. Or the quality of their matcha? Maybe it's their hidden seasonal menu that you only notice at the register causing you to question your decision and last-second-switch to the mango paradise and wonder if you just made a horrible mistake. Or stand your ground and regret not trying something new.\n\nMistakes or regrets. The meaning of life #tooreal\n\nReally though, I usually enjoy my drinks here. The people here are friendly, the drinks are good, and they sell boba bae shirts :)", "author": "Greg G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Can't go wrong with getting a drink at boba guys!This location is the only one (as of now) with the USA made boba that Boba Guys is testing out. There isn't a huge difference but I think these are softer / a little bit less chewy since they are smaller.", "author": "Jennifer Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "This was my first stop off in boba guys and it was great! I've got a couple friends here in SF that recommended it as their favorite local boba spot and I was not disappointed. Service was pretty fast (unusual from what I heard, mainly because the lines tend to be super long here). But we were served in less than 5 minutes. They have a limited menu selection - items like matcha green tea, tropic thunder, classic boba etc but that honestly helps them to keep a high quality product (you know they aren't dinking around with a million recipes - just stick to what you know well).\n\nThe prices are also pretty good for the 16 oz cups it is roughly $5 plus some tax for the drink - the 24 oz cup will run you a bit more.\n\nIn addition to all the fun Nina options they also have a number of auxiliary products that are available for purchase. Great spot to stop by and there's many of them throughout the city!", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "This specific Boba Guys location is one of my favorite places to get boba in the city! Their boba balls are always the perfect amount of chewiness and sweetness.\n\nI usually don't like my drinks really sweet, but 75% sugar is a good amount if the drink you get is adjustable; below that level I feel like the drink gets a little watery. Some of my favorites are their Jasmine Green Milk Tea, Thai Tea, and Tropic Thunder (with more grapefruit and less coconut milk)! Love that they're always more than happy to fix your drink if you aren't satisfied.\n\nAlso I love that they stock Third Culture Bakery pastries! Mochi Muffins, Mochi Donuts, and Thai Tea Custards are deliciousss. My favorite is probably the Matcha Mochi Donut.\n\nThe interior is really cute, and there's a nice park right outside where the doggos come out to play if weather is nice. (:", "author": "Alice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "Alright. So let's talk boba and tea. I was very, very happy with the taste of the tea itself. It was brewed nicely and I love when you can customize the level of sweetness and the type of milk that can go in your boba. Only in California! \n\nI think I paid exactly 5.50 for original black milk tea with boba. Is that pricy? Ehhh yeah, but it's good. I hate when places make you pay for boba, but that's another story. It's steeped nicely in honey, but isn't naturally over-sweetened. I would recommend getting between 50-75% sweetness, if possible. 100% is just too sweet though guys! \n\nI liked the flavor and it was smooth. Good boba and so I don't know why people be trippin. \n\nWhat to try: OG iced milk tea\n\nWater rating: 9/10", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "This place is hecking yum. I was visiting from out of state and this is the first boba shop I went to. I came right around opening and was really glad I made a stop here. This location is kept clean and the employees are kind. My order was taken quickly and also quickly made. There's not a lot of so it may become crowded as it gets busy. A negative is that when I went to get water, the water had a slight yellowish tint to it so I had to dump it out.\n\nAs for my impression of Boba Guys as a franchise, I think they may be one of my favorite. They have a wide variety on their menu and the ones I've tried (strawberry matcha, manga matcha, manga fresca) were all delicious and refreshing. They also have a variety of toppings and allow you to adjust the sweetness to your taste.", "author": "Ji L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "This boba guys has the best area for parking i've seen.\nAnd it's also never had too long of a line every time i've been here.\n\nThey got my order wrong once, but they took care of it.\nbut even the wrong drink was still good.\n\nThis location was trying out a new boba when i last came, and it was pretty disgusting. They were getting feedback on the boba and the feedback was not good.\nI'm surprised that they decided to continue to charge customers for boba during this experimental boba phase because it was pretty gross. My friend decided not to eat them at all, and i just left them in my cup, strategic positioning of my straw to avoid the boba.", "author": "Connie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-02", "description": "After trying the matcha with oat milk drink, I decided I am now a fan of Boba Guys. \n\nI have made my way back multiple times to try other things.\n\nStrawberry matcha - more for the photo I guess. Personally, I don't love strawberry jam/preserve type things so I didn't love the fruity component mixed with matcha here. Others may feel different.\n\nHorchata - eh. Tasted somewhere between too sweet and too watery.\n\nHojicha - this was okay. I prefer this over the horchata drink. \n\nAnyways, four stars because the people who work here are super nice and have offered to remake drinks if you don't like them. Now that I know what I like, I'm going to keep coming back for the matcha with oat milk.", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "First of all, I love this location bcs there's so much free parking within walking distance. (If you are patient to circle around the block a few times) \nI love the menu set up and how it shows you how to order and choose your drink. Plus, it's just so neat... it's the small things that get me, okay? Lol I appreciated that they had a few diff types of milk to choose from and a few unique teas, but also the traditionals. I ordered the Thai tea w/boba and it was so yummy! The boba was fresh and the tea was perfect. I've tried lots of different boba places and so I was def happy with this one! \n\nThe service is super quick and the workers are super friendly and patient. I can't wait to come back & try other flavors!", "author": "Jenae K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-05", "description": "One of my fav boba spots, this particular location is my fav location.\n\nI love the boba guys concept : the best ingredients in what isn't a very healthy drink to begin with (so i feel a tad better... hah)! They use only the freshest premium ingredients (real milk, real cream, real fruit!)\n\nLately, they've introduced such a variety of options beyond milk tea, which I love. Their mango tea Fresca is so refreshing on a summer day (mango, green tea, no sugar adjustments but you can ask them to dilute the mango with more green tea!).\n\nMy otherwise go to drink is jasmine milk tea with oat milk (!!!) and boba. \n\nBoba guys doesn't charge more to substitute milk options like other drink chains, and\n\nAlways great service. Place is impeccably clean, organized and welcoming. \n\nThere is seating, the space is airy, this nice location next to a green space to sit out on grass and enjoy a sunny afternoon.\n\nParking is terrible on the weekdays but ok on the weekends.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "After visiting SF a few more times, this one is my favorite one to go too! \nThe staff here is super friendly and quick. Plus, I think the lines here are much much shorter than some of the other locations in the SF area.\nThis past weekend we had their seasonal specials, Peach Palmer which is one of my favorite ones I've had their and the Golden Honey Black Tea which was also very good!", "author": "Jane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Wonderful experience here!\n\n+ Interior is bright, airy, beautifully designed\n+ Friendly staff takes your order & charges you in line to speed things up\n+ Matcha latte is always delicious, I got 75% sweetness and was still quite sweet\n+ Slightly pricey but better ingredients are part of the cost\n+ Oat meal is offered as an alternative to organic milk", "author": "Annie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-14", "description": "I love that this amazing local company has blown up like it has! Boba Guys has about a half dozen SF/Peninsula locations; a shop in LA; & when I saw them in New York, I almost shed a tear that they'd made it to the other coast. \n\nAlmost every drink I get here, I order 75% sweet & with almond jelly. My usuals are Jasmine Milk Tea or Hong Kong Style Milk Tea. I decided to try the Calipico on my last visit. The red gradient from the strawberry purée melds with a somewhat thick yogurt consistency. Won't be my new usual, but I enjoyed having something different for once. As with most of their drinks, stir before drinking or you'll end up sipping all the good, sugary stuff off the bottom first. \n\nFriendliest Boba Guys staff!", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "So yummy and everyone there was so friendly. They really have a great policy where if you don't absolutely love it they'll make you something new. Luckily we all loved our drinks so there was no need to get different ones but that is a cool way of running their business. \n\nThey have cool flavors, House made products, and different kinds of milk for our non dairy friends. \n\nI tried the black sesame. Very yummy, and very unique. I loved it even tho it was kinda weird.", "author": "Hayley G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-12", "description": "Pros: boba itself is well cooked, softer than most.  Nice jelly coating.  Very instagrammable interior for all the young whippersnappers.  Different milk options in your tea.\nCons: The Strawberry Matcha was too sweet.  Tasted like jam in my boba drink.  \n\nI'd come back for a simpler drink that I could modify the sweetness level.", "author": "Derrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "Best thing about this place is there are plenty of parking!!\n- usually on a busy day I wait for less than 8 minutes for my drink. \n- non caffeine choices: strawberry rice milk & taro drink is a bit sweet. Love their sesame latte & chocolata. Horchata is awesome too.\n-Love their matcha pastry although it sells out very fast\n-Also fun places to visit nearby: Philz coffee in 2 blocks, A design school around the corner, and Icecream shop next to Philz.\n-HK toast (honey drizzles and cream on thick toast) is a sweet & filling snack. Better split it with a friend!\n-Overall friendly staff & environment. The store can get busier in the afternoon.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "It seems like each Boba Guy's has its own specialty drinks that are unique to the location. This location however has many of the special drinks as standard drinks on the menu!\n\nI had the Guava with Kiwi tea drink this time and it tasted excellent. It is a bit light tasting in some parts and is quite different from what you would expect in teas normally, but it was nonetheless delicious and would I recommend it!\n\nThere are so many flavors at boba guys it's going to take forever to try them all!", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "I think Boba Guys is among the top boba places in the city. My favorite drink is their Muscat Oolong, with boba, regular milk, and 25% sweetness. It has a tinge of muscat (green grape) flavor that you can taste but not overwhelming. I get it 80% of the time I'm here.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-13", "description": "I had really high expectations for Boba Guys. Especially after waiting in line for bubble tea and watching people walk out with colorful drinks. \n\nI ordered the strawberry matcha with almond jelly. Almond jelly was on point, but the all I could taste from my drink was the sweet strawberry. It was overbearing and didn't get any matcha vibes.\n\nI also tasted the classic milk tea hot and the jasmine milk tea with bubbles, and all I could think of was: this tastes like water with a dash of 2% milk - not even whole milk *sob*\n\nI really don't get it. Maybe my expectations were too high. Maybe I wasn't ready for SF and the whole waiting in line down the block for food/drinks. But I was really disappointed and would never wait in line for this.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "Full flavored teas true to description \nArtfully presented \nThe price point is on the higher end but is reflected in the product \n\nOverall thoughts \n\nA delightful boba exprience", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "I've been super excited to try Boba Guys since literally everyone is talking about it. It definitely lived up to the hype! Although this doesn't really pertain to me, I have to say that my friend loves boba guys because they offer oat milk, which is apparently hard to find in cafes and boba places. I got the Jasmine Milk Tea with boba pearls, 50% sweetened and it was pretty dang good. The tea was light but the actual tea aroma/flavor was pretty strong, which surprised me! The boba pearls were probably my favorite part - most places have pretty chewy/rubbery boba, but these pearls were actually soft and kind of sweet! They apparently soak them in honey? Whatever it is, I was hooked. \n\nBoba guys, you've sold me. I'll definitely be back to try other drinks!", "author": "Michael Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "My first time at this location of Boba Guys wasn't great. I ordered my usual Jasmine milk tea and it didn't taste good here compared to the other locations of boba guys. But, I came back to this location a second time and I loved the customer service here and my drink was made better this time. I tried the Matchata and didn't like it so I asked if I could get the strawberry matcha instead. It was my first time trying both and I really liked the strawberry matcha! It is a tad sweet though, as you don't have the option to adjust the sweetener. Come to this location for better service compared to the one on Mission!", "author": "Claire Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "I am a boba fanatic. So seeing all the Boba Guys locations made me NEED to take a trip. Parking anywhere in San Francisco require luck or an nice walk to where you have to go. We went around lunchtime so there was parking two blocks away. Luckily, there wasn't a long line I've always heard about. If anything, there was only one other customer in there. \n\nI've always seen that cool picture of the matcha latte with strawberries. The last time I tried a matcha latte with strawberry purée, I hated it (mostly because of the texture of the strawberry purée). I made sure to read multiple reviews before actually ordering the strawberry matcha latter Boba Guys is so famous for. I was so nervous to order it because I hate being that person who tells the staff I don't like the drink and have them remake it. \n\nBut I went for it, and TRUST, the strawberry matcha latte is freakin' delicious! Order it. Really. Just order it. It's definitely worth the hype. The strawberry purée isn't chunky, it blends well with the matcha and the milk. I normally go to a boba place multiple times to try a couple drinks before writing a review, but I was impressed with this one drink, I had to let the fellow Yelpers know what's up.", "author": "Remelyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "This place has such delicious and creative bubble tea! I've been to the one on Fillmore too! Same deal, great flavors. Here I got the Ube Halaya. Ube makes a great ice cream flavor but I never tried it as a tea flavor. It was pretty good however, it could've been sweeter. I didn't know that the specialty drinks can be made sweeter so that's my fault for not telling them one hundred percent sweetened. Even still, it was really good, refreshing drink. The line can sometimes get along but I'd still wait. \nMy one recommendation to the business is to train their employees in working a bit faster. Each time I've come here, the service was a bit too slow.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Boba Guys is truly a lush oasis of disruptive innovation in a barren desert of archaic milk tea behemoths\n\nCreative and colorful combinations made by bubbly baristas? They've got it down to a T! \n\nEver struggled choosing a flavor? Let's be real, we all do... But now you can satisfy not one, not two, but THREE of your cravings simultaneously with the Nitro (Match, Strawberry, Oolong). Boba Guys never fails to sweeten up my day", "author": "Antonio C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "Probably one of the best boba guys locations I have been to. The area seems very new with parking available nearby. There are also a couple of tables inside, so it's a great place to study. Pretty much right next to UCSF and the line was not very long when I went.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Opens at 9AM but keep in mind that boba isn't ready til maybe 10 or 11 AM!! \n\nThe hong kong style milk tea is made with condense milk instead of regular milk. Tastes like taiwanese milk tea where the tea flavor is heavier because it is not covered by the milk. Love it!! \n\nThe jasmine milk tea goes so well with Egg pudding. Egg pudding is made in-house and they give you a great amount, especially if you order a large! \n\nThis location does not have the same snacks as the other locations. They had brick toast as an option for food and some other random small to-go pre packaged snacks on the shelves. \n\nParking is actually not too bad in this area if you just go one or two streets parallel to it.", "author": "Ivy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "A different spin from your average boba joint. Place is nice and inviting. Drinks are delicious. \n\nParking can be a pain. I got the horchata which was delicious and tasted fresh!", "author": "Christian S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-06", "description": "I walked here after the gym, which I sorely regretted because I got a huge blister on the balls of my feet since i was wearing sandals. \n\nTmi, I know. I really wanted the matcha strawberry drink because it looks so pretty and instagrammable.  I got the strawberry matcha drink in a small size. The drinks here are priced a little more than other boba places, which is alright since they use more premium ingredients.  \n\nI didn't think my drink was anything special though.  I might come here again to try their other drinks if i am in the area.", "author": "Tiffany Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "If you're looking for a healthy boba drinks this is the place.  Their desserts are also good.  Parking can be hard to find.  We will definitely come back.", "author": "Mark R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-13", "description": "This is the first time I've tried this chain. This location seems small, there's some seating inside, but not for a lot of people. It's bright, clean, industrial. There's a variety of drinks on the menu, but the prices are higher than average. I suppose the quality is slightly better, and the boba is soft and chewy.\n\nI got a matcha latte with boba. Equal parts milk and matcha, it's an alright concoction. I got it less sweet, and it's not filled with ice. \n\nOverall, this place is okay, it's not too special to me, and it wouldn't be worth a long wait or somewhere to go out of the way for.", "author": "Spencer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "Most boba places don't overcook their tapioca balls but Boba Guys consistently has great tapioca balls in all their locations. Most Bay Area boba places can't keep up with LA boba places but Boba Guys holds their own. They use pretty good quality of teas in their drinks. No matter which location you go to, Boba Guys just makes a consistent good boba drink.", "author": "Rey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-15", "description": "I really love Boba Guys! Their drinks are high quality and you can tell they are made with real teas and natural ingredients instead of some of the lower end spots that use powders to create their drinks. I had the Jasmine Milk Tea with boba and it was delicious! You're able to select the level of sweetness which is nice. One thing that really stood out is the you can select between organic milk or two non-dairy alternatives (oat milk or almond milk) for no additional cost! I had mine with almond milk and really liked the extra flavor it added to my drink! The only downside of this spot is the lack of seating. The area has other places you can sit outside in the surrounding blocks but if the weather isn't good, you have limited options.", "author": "Shav S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Good quality drinks, which explains why it is on the pricer side. Their Strawberry Matcha Latte is my all time favorite. \n\nGot to try the Thai Milk Tea but it is lacking some favor. The Coffee Milk Tea was pretty good but couldn't really taste the coffee bc the condensed milk was overpowering the taste. Glad to be able to try new things, but will definitely stick to the Strawberry Matcha Latte.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "This Boba Guys location is my absolute favorite! Not only is the store clean the workers are wonderful. Stacey and Janess were caring and informative about all the drinks. They were able to recommend drinks that fit my dietary needs.\n\n\nDespite it being my favorite location, I noticed the change in music. I enjoyed hearing the diversity in music that they use to play. The variety of Pop, Rap, RnB, and Spanish music was one of the few reasons why I would stay to work on school assignments. Lately I haven't been hearing the Spanish music that I admire so much since it reminded me of home. I hope they can bring it back!!", "author": "Oliva T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-05", "description": "My first time here at boba guys and it definitely lived up to the hype. I ordered the strawberry rice milk with boba. I liked how the strawberry purée was home made. The rest of my party ordered the muscat oolong, and jasmine milk tea. Both were also really good. You can really taste the tea. Boba guys really knows what they're doing when it comes to menu options. Would definitely recommend this place.", "author": "Windy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "My favorite boba place! A couple notes:\n\n1. I've gotten there right when they open on the weekends and there's been a handful of people already there waiting (maybe 4-6ish people right when they open!). This place gets busy \n2. I tried the mochi donut and it was okay/good but it's not something I would seek out. Another time I got the custard cake and it was definitely a day old/stale. They were very responsive and refunded me for the cake but it was a slightly disappointing experience. Based on both of these things, I'll be sticking to their drinks (which I love!) and skipping the pastries (or at least asking if they were delivered today).", "author": "Hyan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "So good. Mochi muffin and strawberry mocha latte is my fave combo. One of the best boba places world over. Can't go wrong with anything.", "author": "Aakash G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-16", "description": "I'm sorry,I don't want to say this but I can't think of any boba tea I've ever had is worst than this. I was so excited to try out this place for awhile because my friend mentioned it was good and there was always a huge line. I finally tried it last night. I had a decaf black with whole milk on level 50% sweetness. I didn't have a high expectation but I was hoping it would be a descent place for boba tea. But I was really really disappointed after my first sip. \n\n3 reasons:\n\n1. The milk tea was not milky at all, it tasted like either they didn't put enough whole milk in there or they used non fat milk or almond milk instead.\n\n2. The sweetness is way too sweet for half sweetness, especially the boba are sweet as well.\n\n3. The boba were not properly cooked or prepared, they were half raw and hard to chew. \n\nIt made me sick the next morning because it gave me a lot of gas after I had that boba milk tea last night. Definitely not a good boba milk tea place from my experience.\n\nI would give it 1 star, but my husband liked his lavender milk tea with 25% sweetness, I will give 1 star up. But the boba in his drink was half raw as well.", "author": "Choco W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Upon my first visit, I ordered a strawberry matcha latte. The boba guy (it was a guy) went \"Bonnie!\" And I went \"oh yay that's me\" and then I went up to grab it. Then POP! in goes the straw and I took my first sip without stirring the layered contents. From the bottom, I got a hit of delightfully sweet jelly jam. As I chewed the tapioca balls, I thought \"dang these tapioca balls are squishy and sweet I like it\". I then maneuvered the straw to the top matcha layer to have a taste of that delish liquid and YEAH it had a deep deep matcha flavor. I alternated back and forth to get the two flavors separately until I realized I should stir em both together to see how that tastes. It was a good choice. \n\nAll in all, I rate THIS DRINK 5 stars. Yelp only lets you rate the whole place which isn't nuanced enough. I don't know how the other drinks taste but I'd definitely get the strawberry matcha latte again. I might go tomorrow actually!", "author": "Bonnie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "I'm a huge fan of Boba Guys, and this is my favorite location because it's easy to get to, not too crowded, and easy to find parking! (Since I don't live in the city) Their interior decoration/branding aesthetic is really on point, and they have a wide variety of unique drinks. The strawberry matcha latte is beautiful and definitely worth a try, and I also really love their seasonal fruit tea frescas. Their tapioca pearls are probably my favorite out of all the boba brands I've tried, and all of their ingredients are extremely high quality and are worth the splurge!", "author": "Audrey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "Delicious tea for a treat-yourself day. My favorite is getting the Hong Kong style milk tea, a drink I grew up on. I also recommend trying the coffee milk tea. It's a Hong Kong style drink that's a mix of two delicious things, coffee and milk tea!! -- A good choice when you need some caffeine. I usually opt out of the boba because I used to drink boba 3X a week and found out how fattening it can be. If weight is not a concern, their boba is good! It is really filling, so it is good for an after workout treat. The Strawberry Rice Milk drink is also very good! I recommend getting all drinks iced unless it's a cold day.\n\nThere is seating inside and a park next to this location so that you can hang out with your buddies.", "author": "Andrea T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-11", "description": "Drinks are not good, but the store looks nice. They oddly don't accept cash. More for the eyes than the tastebuds.", "author": "Yong S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "Good drinks and the prices were very reasonable for the area, which surprised me.... But the Boba crew just wasn't that friendly. Good customer service goes a long way in the long run, especially when people risk tickets for drinks. Although the Thai tea boba was delish, I don't know if I'd return. There are other places in the area with much friendlier vibes. ‍", "author": "Kailee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "First found out about Boba Guys while watching a vlog on YouTube. I had been planning to check it out but never got to the last couple times I was in the Bay. We were spending the weekend in Napa, but I made sure we would stop here before we drove out. I finally got to try it out and I loved it! \n\nI had intended on trying the Muscat oolong, but when I got there, I saw the lavender milk tea (and I'm a sucker for lavender!) and got that. Loved the lavender milk tea! It was just the right amount of flavor -- enough to taste it, but not enough to be overpowering. I also tried the the matcha custard cake, which I wasn't expecting too much out of. First bite was okay, but it gets better with every bite. So soft and a hint of matcha flavor. I also bought a pack of lavender & coconut shortbread, which was good. I love shortbread so what more with lavender!\n\nOnce we got back to the city, we made another stop at Boba Guys before heading to the airport. This time I decided to try the Muscat oolong since the guy in the vlog raved about it. And he was right! It was delicious SO GOOD! It's so hard to describe how good it tasted. The lavender milk tea was good, but didn't set this place apart from other boba shops I've tried. But the Muscat oolong did!  All I know is I am DEFINITELY making a stop here for Muscat oolong milk tea whenever I'm in San Francisco! Wish they had this in LA so I can have my fix whenever I need it...", "author": "Grace T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "You know, it's kind of crazy how far Boba Guys has come over the last five years.  From sharing a modest space in the Mission with Ken Ken Ramen to carrying nine locations across the Bay Area and New York?  Pretty damn impressive!  Which speaks to their obvious popularity...and how good their milk tea is!  Well, that and all of the positive reviews.  And the hype.  And the photos all over Instagram.  And the lines.  Clearly, Quickly's, this is not!\n\nNow, when I first heard that there was a Boba Guys near my work, I knew it was only a matter of time before I found my way here.  However, that shortened up to just a couple of days when I realized they were actually just a couple of blocks away!  Surprisingly (or not so surprisingly?), there were a decent amount of people here on a random weekday afternoon.  Which actually worked out well, since it still moved decently fast while giving me time to figure out what to get from their intriguing drink selection!\n\n-- HONG KONG STYLE MILK TEA (iced) - Black Tea Blend with Organic Condensed Milk...$4 (16oz)\n(https://www.yelp.com/biz_photos/boba-guys-san-francisco-15?select=TwX6sZYhJgF9uDzdND-R3Q)\nI won't lie - the condensed milk is what really caught my eye.  Ironically though, I actually didn't taste much of it (though I did ask for 50% less sweet...).  Similarly, while the taste of the tea itself was fine, I thought the drink as a whole was a little watery, so getting \"less ice\" might be the way to go.\n\n-- CLASSIC MILK TEA (Pre-bottled) - Signature Black Tea Blend with Milk - $4.50\n(https://www.yelp.com/biz_photos/boba-guys-san-francisco-15?select=WMo4qkQIYKEvmmauq8CCTg)\nI'm not sure how the flavor of this compares to getting it \"fresh\", but it was as good as the first time I had it years ago.  Not only is the tea blend they use terrific, but I really like how balanced and flavorful the milk tea itself was - not too milky or thin nor was it abrasively sweet.\n\nSince neither of the two drinks I tried here had toppings of any kind, I can't speak to anything other than the drinks themselves (ditto for their food offerings, which all look pretty appealing).  That being said, I do recall the boba being pretty awesome from my first ever trip to Boba Guys and I can't imagine they would have changed the formula at all (given their name and everything...).\n\nConsidering how they aren't all that far away, on top of the fact that Boba Guys are pretty much popping up everywhere, I guess I should look into investing in one of their reusable mason jars...\n\nCheers!", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "I try to eat as healthy as I possibly can which means I try to avoid sugar as much as I can. However, my kryptonite is definitely bobas!  \n\nTo be quite honest, you can pretty much throw some fruits, sugar, Tapioca, and ice in a cup and I'll probably like it!  LOL!  However, the boba guys is a lot better than an average boba you'll find anywhere! For some strange reason, the bobos here taste a lot cleaner and fresher! It doesn't taste quite as sugary and artificially flavored as the other places. I'm not going to pretend like I know what's going on or what the cause of it is but I do know that it taste better than most places and it doesn't taste as unhealthy as most places!\n\nThe best part about all of this is that the price is comparable to any other boba places that you'll find in town.\n\nWhenever I go back in town, I'll definitely try a new cup of Boba! So far, I've had five different bolt bus and I'd like them all but like I said before, I like them all!", "author": "Jang N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-13", "description": "I got the strawberry matcha latte (the one with the pretty green-pink gradient that you see everywhere on IG) with almond jelly. \nPRO TIP: not only is the almond jelly actually delicious in that its soft, creamy composition compliments the sweetness of the strawberry tea, it will also make the your photo prettier as opposed to the boba lol\n\nTLDR;\n\nH  ella asian,\nY  ummy tea with\nP  retty gradients but all at the cost of an\nE  exceptionally long 30-40+ min wait\n\nIG factor: typical (A-); take a picture at the counter and everyone will judge you. but the flooring is still great and you must take a photo of the aardvark", "author": "Yuuki O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Great location! Line went by fast and my drink was made fast. I got the matcha latte with boba, 50% sugar. If you don't like the drink, they'll remake one for you!", "author": "Rose C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-01", "description": "Came here on Saturday, 29th. Boba was overcooked, and all three drinks were extremely watered down. Would've had them redo it, but they were hella busy and we weren't trying to wait. It was probably a given, when all the workers looked like they did not wanted to be there.", "author": "Flo F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "I come here often because it's close to my work. The drinks here are amazing, affordable (~$5-6 per drink), and pretty customizable: I usually order at 75% sweetness.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Ask for the non-diary oat milk, the best! And the boba is very chewy and tasty. \n\nI love their matcha or strawberry-matcha bubble oat milk tea. I'd definitely recommend trying Boba Guys, just try to avoid long lines, since it might be annoying. They have multiple location around the city,  the service is fast and friendly.", "author": "Liza B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-13", "description": "First time coming here wasn't crowded, but the customer service sucks the girl took my order was rude she was like in a rush taking our order didn't explain much she just its sweet sweet like all the drinks. They need someone better represting this franchise I'm not even sure about going back better customer service needs to be in point and explain they menu better.", "author": "Hoa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "I love boba guys so much! My go to orders are usually a jasmine milk tea with boba or the strawberry matcha latte! This location is pretty nice and has about 4 small tables and a large community table, plus their nitro bar! I've tried the nitro once and it was pretty good. I tried the Jasmine nitro tea which was very smooth and velvety, and if you like Jasmine tea you'll really love it. There is 4 hour street parking. What I didn't know was that they also have a bathroom... you have to ask LOL. Other than that, this location is great and the employees are nice!", "author": "Kimberly D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-02", "description": "Nice location under a bunch of new apartments or condo\nPretty roomy and big, there was a good amount of seating as well\n\nThis location also offers the nitro tea but I didn't try it this time around\n\nStreet parking only\n\nService was pretty fast, ordered a thai tea this time around and for some reason there was a weird after taste, i've had their thai lots of time before so i thought it was odd that it had that after taste there, maybe it was not as fresh?\n\nOverall the new store is nice and definitely would come back again to try the nitro tea", "author": "Michele G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "This location is basically perfect!\n\nPlentiful street parking? Check.\nSeating? Check. \nRelatively short lines (even on weekends)? Check. \nDog friendly? Check. \n\nThere's even a dog park next door so you and your pooch can enjoy your muscat oolong or strawberry matcha latte outside, if SF weather permits of course.", "author": "Olivia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-03", "description": "One of my favorite boba places! I always get the strawberry matcha latte (I tried the Strawberry Rice Milk once, and didn't like how strong the flavor of the rice milk is). It's a bit of a bummer that you can't adjust the sweetness level of specialty drinks since I think most of the drinks here are a tiny bit too sweet for my taste. The location is clean and quite aesthetic, haha, so perfect for social media photos, and the workers are always super nice!", "author": "Elise X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "I didn't want to like this place because it's so hyped up, but I find myself grabbing the Strawberry Matcha with boba at least once every two weeks! If you work in the area, take advantage of the neighborhood discount...I use that discount as an excuse to order a large. I've ordered some of the other items off their menu, but I'm a loyal hoe for the Strawberry Matcha...I just really enjoy how the strawberry's tartness cuts through that bitter creamy matcha. And don't get me started on the boba...I've never enjoyed having balls in my mouth so much.", "author": "Charissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "First time try the\" Green Tea Latte \" and fall in love with it! Love this place so much,customer services and the drink quality were excellent! Keep it up!", "author": "Joyce L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-06", "description": "So I normally get the strawberry matcha latte at boba guys and I absolutely love it.\n\nFor this location, I tried the HK milk tea and the coffee milk tea, so I'm not sure if this location sucks at making those drinks or if Boba Guys sucks at making those drinks. Too sweet (75%) and too thin in consistency. I suspect it's the lack of evaporated milk and not straining the tea enough that led to my disappointment with the Hong Kong milk tea.\n\nEh.\n\nThe lines are way shorter. Maybe I'll come back to get a strawberry matcha latte to have a constant variable. You know, for science.", "author": "Trang B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "No wait !! I usually go to the one near Chinatown and that one is so annoying. There's a line even before they open. If you have a car I would just drive to this location because it's literally no wait. And it's just a nicer location. There's chairs and tables and you can sit down and chat.", "author": "Marlana Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Great drinks as usual, awesome location right in Potrero Hill, and fun vibe. They have some nitro options for a pretty similar price than the regular.\n\nTwo things to keep in mind: no boba until 11am and the lids used for hot drinks are made of a hard plastic that doesn't bend as easily. Ended up flicking liquid on myself several times when I tried to drink from the lid.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-22", "description": "Got the strawberry matcha latte with boba that you see everywhere. It was pretty good, although I did think the strawberry was a little overwhelming and masked the matcha flavor a bit. The ingredients did taste super fresh though, especially the tapioca which were nice and soft. We went around 6 on a weekday, and it wasn't crowded at all! I would assume this is one of the less crowded locations. Parking around the area was plentiful- we found parking right near the intersection of 7th and 16th. They also have a restroom outside- just ask for the key fob!", "author": "Rosy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Great location (a little too easy for me to get to as well).\nI have yet to check out the rest of the menu as I am kind of stuck on the matcha strawberry. The boba today was especially soft and sweet. I think they had just finished whipping up the batch? I saw two giant pots on the stove cooking.\nI also ordered the classic boba milk tea normal sweet for my son. Their sweet is WAY sweet so next time I'll just order less sugar.", "author": "Liz N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "Finally this place was open on a weekend. When I use to work in Mission Bay, it was an idea of a friend and mine to open a boba place. Looks like we should of. \n\nDrinks taste like all Boba Guys drinks, but the interior of this one is much bigger than the one in the Mission, which I do really like. There's still not that much seating though. The whole place can maybe seat 10 people? The wait was kinda long for how short the line was, but they're still working out the kinks, so I'm sure it'll be quicker hopefully soon. Anyways, this area has been in a need for a bubble tea place and I'm glad there finally is one.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "Living in LA, I've always heard of friends from SF raved about Boba Guys. Finally I got to try it when I visited. As expected, there was a line when we arrived. The line went by pretty fast and we got to order drinks within 10-15 min. I got their matcha latte with boba and my BF got their matcha latte with strawberry puree. We both got 50% sweet but it was still way too sweet for us. However I did enjoy the matcha latte with strawberry puree. The strawberry puree created this sourness which surprisingly balanced the creaminess and sweetness of matcha latte very well. Also when it comes to boba, I am all about the texture of tapioca and their boba was super chewy and sweet. Also I love whatever milk they use for latte, it was super rich and tasty! Will def come back when I am in the area.", "author": "Yushan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-22", "description": "Fast and friendly service! Clean and not crowded like all other locations.\n\nBonus: open on Monday unlike other locations \n\nTip: no boba until 11am :(\n\nPicture: caramel matcha latte, chocochata, horchata with organic chia seeds.\n\nThe caramel matcha latte had too much caramel. Adjustments would cost $1.50", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "When you move into a new neighborhood, or start a new job, some things a high priority - among those is finding your best local boba place.  Boba guys has been pretty good to me here - I have to give credit to them for balancing offering traditional drink choices along with more inventive, unique offerings.\n\nTheir menu has a wide range of interesting flavors, that I might call hit or miss.  Some, like the chocochata, sound great on paper but are a bit light on flavor.  Other drinks like the strawberry matcha latte are good, but seem a bit more designed for instagram and maybe a bit overhyped.  I see not a lot of love in the reviews for my actual favorite - the Purple Rain.  This drink has a great balance of sweetness and tartness, is packed with berry goodness and feels worth its price in produce.  For a cafe-type place that has both drinks and baked goods, I'd have to say the baked goods seem almost like an afterthought.  The mochi muffins are well-baked, but experience of these, and probably most of their baked goods would be enhanced if they offered to warm these up for you.  A gooey, chewy, warm mochi muffin is comforting and addictive - a cold one is alright, but forgettable.  I also think some of the baked goods are not great value, with some of the steepest priced pineapple cakes I've ever seen ($5)", "author": "Neal B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "OMG. I can not get enough of their OAT MILK!!!\n\nThis location is prime considering there are not much stores around this area.. Since I work nearby, I always walk over to boba guys on my break. Their staff are always friendly and their service is always amazing!! \n\nI always get the jasmine milk tea with oat milk. I have never tried oat milk until boba guys. It might sound weird but its a tastier and healthier alternative than milk. The consistency of oat milk is very light and refreshing. Unlike milk, its heavy and filling. I would highly recommend oat milk to those who want a new twist to their drink.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "They say that trends come back in cycles, but did boba ever really leave? Gone are the days of Tapioca Express where the biggest decision you had to make was whether you're getting boba in a drink or not. Enter Boba Guys that caters to everything an SF foodie enthusiast would want: organic and housemade milks, enough matcha combinations to turn you green (literally?), and Instagrammable drinks to make all your friends/followers envious. After avoiding the lines at their other spots, I finally bit the bullet and stopped in to their newest place in Potrero. I went with their Black Sesame Latte with boba. After many many many years of not having boba, I can confirm that I'm still in fact a fan. I will definitely be back to try the next concoction - I've got my eye on that Strawberry Matcha!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-29", "description": "# 15 Boba Guys *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars\n\nOf all the boba guys in the city I like this location the best. I got the standard milk tea with boba and it was pretty good. I enjoyed how they asked me if the ice level was good enough for me (the little things do matter).  Not a huge boba guys fan however for taste they land squarely in the median range of my SF boba rankings below which makes them a solid option if I'm close by but not something I'd go out of my way for.\n\n\n# 15 Boba Guys *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars\n\nRod M tours San Francisco in search of the BEST standard milk tea with boba. I have individual reviews for all the places listed below.  Check out my latest reviews for the most up to date list. \n\nI recently embarked on a completely pointless quest to rank most of the Milk Tea/Boba Places in the area.\n\nRules: I ordered a simple milk tea with Boba (regular sweetness, ice etc.)\n\nRanking explained:  #1 (listed at the top)  is my favorite/ #38  (listed at the bottom) is my least favorite. \n\nRod Boba SF Rating = (Taste of Milk Tea / Taste of Tapioca Balls) on a Scale of 1 to 10 (10/10) being the best score possible\n* Please note that I like my boba a little bit sweet. I don't like it too milky, too strong of a tea taste or too watery.  I prefer fresh tasting larger \"boba\".  Powdery drinks (those places that simply have a plastic carafe that they pour out of ) and boba that tastes \"old\" get docked on my rating scale. \n\n# 1 Itea *Rod Boba SF Rating * 9/9 *Rod's Yelp Rating *5 stars \n# 2 Puppy bobar *Rod Boba SF Rating * 8/8 *Rod's Yelp Rating *5 stars \n# 3 Asha Tea House *Rod Boba SF Rating * 7/9 *Rod's Yelp Rating *4 stars \n# 4 Caffee Central *Rod Boba SF Rating * 7/8 *Rod's Yelp Rating *4 stars \n# 5 Cool Tea  *Rod Boba SF Rating * 7/8 *Rod's Yelp Rating *4 stars \n# 6 The Boba Shop *Rod Boba SF Rating * 7/7 *Rod's Yelp Rating *4 stars \n# 7 Good Earth Café *Rod Boba SF Rating * 7/7 *Rod's Yelp Rating *4 stars \n# 8 Hanlin Tea *Rod Boba SF Rating * 6/7 *Rod's Yelp Rating *4 stars \n# 9 Keep it *Rod Boba SF Rating * 6/6 *Rod's Yelp Rating *4 stars \n# 10 Wonder Tea *Rod Boba SF Rating * 6/6 *Rod's Yelp Rating *4 stars \n# 11 Enter the Café *Rod Boba SF Rating * 6/6 *Rod's Yelp Rating *4 stars \n# 12 Tpumps *Rod Boba SF Rating * 5/7 *Rod's Yelp Rating *4 stars \n# 13 The Ramen Bar *Rod Boba SF Rating * 6/5 *Rod's Yelp Rating *3 stars \n# 14 Eightea *Rod Boba SF Rating * 6/5 *Rod's Yelp Rating *3 stars \n# 15 Enter the Café *Rod Boba SF Rating * 5/6 *Rod's Yelp Rating *4 stars \n# 16 Tea Hut *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 17 Sharetea *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 18 Tanca *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 19 Boba Guys *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 20 Steep (not Steap) *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 21 T&T Café *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 22 Bobo Drinks & Pho *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 23 Samovar Tea *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *2 stars \n# 24 E Tea *Rod Boba SF Rating * 4/6 *Rod's Yelp Rating *2 stars \n# 25 Steap (not Steep) *Rod Boba SF Rating * 4/5 *Rod's Yelp Rating *2 stars \n# 26 Maggies Café *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 27 Belly Good Café & Crepes *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *3 stars \n# 28 Tea Bear *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 29 Sweet Heart Café *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 30 Honeycreme *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 31 Elixiria *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 32 Quickly *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 33 Plentea *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 34 Mi tea *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 35 Ten Ren Tea *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 36 Wonderful Foods/Dessert & Café *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 37 Out the Door *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 38 I Café *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Obsessed! This is also my favorite location because easy parking, friendly and high energy service, and a restroom you can use!!! What to try? Everything. Of course gotta try Strawberry Match Latte and for food...Mochi Muffin!", "author": "Sharon Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "Visited boba guys recently for the first time and it was a mixed experience. The locations for boba guys are great as they're generally located in up and coming areas with some street parking. \n\nI liked the organization, cleanliness, and unique specials that they offered. There were some that were great alternatives to the traditional boba milk tea experience as seems to be their mantra.  I didn't try their famed drink, the matcha with strawberry which was surprisingly delightful but odd at the same time. I didn't love it enough to order to every time but I definitely enjoyed it enough to keep drinking it.  Tried the almond milk tea, which was okay - wasn't blown away by the tea flavor or the almond flavor. As for the actual boba, it was good, not amazing; nicely cooked but nothing special.  Also tried the topping of grass jelly and it was subpar to say the least, felt like it came straight out of a can, it was hard and just plain.  \n\nI did speak to a couple of friends and they recommended the black sesame latte so I'll definitely try that next.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "My GF is a boba fanatic and she's been wanting to try Boba Guys since we were in SF last year. We finally got a chance to check them out. The line was out the door and it wasn't moving very fast. Once we placed our order, it took about 10min to get our drinks. I got their Strawberry Green Tea with boba. I am not a fan of boba but the ones they make here are chewy and sweet. The texture is definitely a lot more different that other boba places. As for the dirnk itself, it was really good and not overly sweet. I get the hype now.", "author": "Juan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "I'm a milk tea addict. It's truly my drink of choice and I've been to many boba tea shops in my lifetime.\n\nGetting to the point... Boba Guys is hands down one of my all-time favorite milk tea/boba shops. \n\nWhy I LOVE Boba Guys:\n- They use premium, natural, organic ingredients\n- Like a BOSS they make everything in-house and from scratch (rice milk, almond jelly, grass jelly)\n- If you're a fan of black sesame, you MUST order their Black Sesame Latte specialty drink. (Note: The Union Square location doesn't have this flavor)\n- Their milk options don't discriminate from those with dietary restrictions. They have quite the selection and from fancy and top brands: Straus Family Organic Milk, Califia Farms Almond Milk, Organic Soymilk, Oatly Oat Milk. (My personal favorite is the Oatly Oat Milk!)\n- Most of their drinks are customizable in sweetness and ice level.\n- Unique flavors like horchata, Hojicha, Chamomile Milk, Strawberry Matcha\n- The entire store is IG-worthy, including their Strawberry Matcha drink (trust me on this--it's gorgeous and makes you not want to mix the vibrant colors)\n\nToo bad I live in LA and so far from the SF and NY locations. It's no joke that I'm always craving a refreshing and satisfying drink from them. Last time I was in SF I visited two days in a row and it left me wanting more.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "The trick to loving Boba Guys is simply knowing what to order!! They give you so many options,  it's really difficult for people like me to know how to not screw it up!\n\nHere's a couple helpful hints if you need help deciding...\n1. Strawberry Matcha Latte - this is one of the ones they're really known for, but if you don't like Matcha green tea..you should probably steer clear!\n2. Horchata Milk tea with Almond Jelly (but don't order this if you don't like Horchata!!)\n\nPretty intuitive advice, no? Well, fine!..i guess I'm not as smart as you!!\n\nOther honorable mentions:\n- Their Dirty horchata\n- Coffee Milk Tea\n- Classic Black Milk Tea\n\nIt's also worth mentioning that they offer 3 different varieties of milk - oat milk, regular milk and almond milk! Awesome for all you lactose people out there!!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "Tried Boba Guys for the first time and have to say I was very impressed. Got the Lychee Green tea and it was delicious. Will for sure be coming back for more and to try other things on the menu.", "author": "Roman L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "I used to dislike Boba Guys, but now that there's a store downstairs and I've had the chance to try out some of their other drinks, I can happily say that Boba Guys is one of my favorite bubble tea places in SF!\n\nMy go-to drink here is the Jasmine Milk Tea with Boba, Default Milk (Half and Half I believe), and 50% sweetness. I've also tried the Strawberry Matcha Latte and the Taro Smoothie, but the Jasmine Milk Tea is what keeps me coming back. I love that the boba here is chewy and soft - I haven't found anywhere else that makes such good bubbles!\n\nThe service here is pretty fast on weekday evenings - I usually only have to wait 2-3 minutes for my drink to be prepared.\n\nNote that if you live in the apartment complex Potrero 1010, you can get a 10% neighborhood discount.", "author": "Yuan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "My horchata was watered down. We did come in 15 minutes before closing but 15 minutes is ample time to make a good tasting drink. Otherwise, the location is bigger than most others and there wasn't a line when we went. We got some free stickers as well. They are starting to sell merch which is pretty cool. There's a cute black unisex shirt that says \"Boba Bae\" for $20.", "author": "Kathy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "UGH. You guys. When you're in Cleveland and type \"bubble tea\" in Yelp, you maybe get one result that's cities away. When you type this in in San Francisco, there's bubble tea everywhere. Next door! Around the corner! You're actually in one right now! Okay, maybe that last part is an exaggeration, but you catch my drift.\n\nWith that in mind... Boba Guys doesn't disappoint. I've had my fair share of bubble tea around SF, and Boba Guys continue to kill it as one of my favorites. Not only have they catered my work functions on several functions, but I finally had the opportunity to stop into this location. I love, love, love their menu. The iced Classic Milk Tea is my favorite, but I've tried the Horchata and Jasmine Milk as well, and they all rule. Love that they pride themselves on using organic ingredients and as they say, \"Grade A Balls\" (get your mind out of the gutter). Great tea, cool space, nice people. There's not much to dislike about Boba Guys.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "i know there's a lot of hype for this place, but it's definitely on point.\n\ni got the rose black tea with milk and half sweetness- perfect tea taste. and the boba is definitely the best i've ever had, and this is coming from someone who frequents socal boba spots.\n\ni'm excited to try their LA location! :)", "author": "Tamara A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-21", "description": "So I would give this 1 star but I actually like boba guys.\n\nSo here's my riff, I came to Boba Guys to get my boba fix. A young lady yells out \"Hello! Could you wait a min?\" I gladly replied \"Sure!\" So I waited for about 5 mins and she proceeded to take my order. \n\nI ordered 2 strawberry matcha and the young lady says \"we don't serve boba until 11\" I looked down at my watch and it was 10:52 and pulled out my iPhone to double check and yup 10:53. I then stated it's 10:53? She responds with \"do you want to wait????\" Flabbergasted by the statement I just said YES! It's really the only reason I came here, you guys are called \"BOBA GUYS\" .. \n\nI own my own business so I get protocols but even this was a little ridiculous.", "author": "Rio J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "Came here for the first time and love their Boba drink. \n\nOn my first day, I ordered (special drink) Matchella (Topping: boba). I requested no ice but they told me it will not have the good looking color for the drink (green color at the top and pink color at the bottom). So, I ordered a less ice one instead. It taste more like a mixture of matcha + fruity flavor. It was a little sour. The boba is extremely chew, definitely high quality and I like it! Def love their boba more than the drink.\n\nI came back again to order another special drink, Mango Matcha Tea Fresca (Topping: homemade almond jelly). It doesn't taste like Matcha but more fruity flavor. The almond jelly taste pretty good.\n\nI feel like most of their drink has a fruity flavor more than tea flavor, which I don't mind.   \n\nI definitely will come back again to try other drink. The price for each boba drink costs more than an average boba drink should be but why not give it a try :-). \n\nThe line can be pretty long and there's only one cashier available -- a good sign that people love this place :-). If you don't mind waiting, it will usually be around 15 minutes.", "author": "Evelin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Finally a Boba Guys near my work. Aside from the standard drink menu, I love how they have drinks that are seasonal and could change every week. All the drinks are very well made and the baristas are making them in a heart beat. Can't find a fault even if I wanted to.\n\nMy go to is the Strawberry Matcha Latte!", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "This is my favorite boba place in SF. I recommend their matcha series! Matchella I got today had in-house raspberry/pineapple purée, and it was a good balance of sweet and tangy. Still, my favorite is the strawberry matcha! There's a decent amount of indoor seating, but due to the popularity of boba guys, it becomes packed pretty quickly. It's more of a quick stop-and-go type of place. There's no public restroom!", "author": "Hailey K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-06", "description": "the past 2 times i've been,  i did not ask for toppings and both times they automatically added boba as a topping to my order. of course i should have checked my order but who has time to read all that? they also dont mention it when they read it out. if i ask for them to remake it, they will but that 50 cents is still charged.... #schemingonthelow #watchout", "author": "Lydia Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "The Potrero Hill Boba Guys is new and do not a lot of people know about it, which means shorter lines! I came here on a Sunday afternoon, on a nice day too, and waited only about 4 minutes. Tried the jasmine milk tea with boba, which I hadn't tried before. It was a little too milky, which is common with jasmine teas. I usually get either the Hong Kong milk tea or the matcha milk tea. Both are exceptional. The boba here is always fresh and perfect too.\n\nHighly recommended.", "author": "Billy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "This place is gooooooood! I ordered the dirty Horchata and it was so yummy!  I will come back here.  The site looked clean, a lot of light coming in very open and pleasant.  The staff was nice and cool!  I got my drink super fast but then again there was only 1 other person ahead of me.  They have cool stuff for sale, like mason jar cups and other Boba guys stuff.  They have plenty of seating and the lighting is good. This place is right by my work, a few blocks so I will continue to come here.  The prices are fair, probably what you would pay everywhere else.  You should come get your Boba fix here, its worth it!", "author": "Alexandra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "This one is one of the nicer Boba Guys! It has tables and a nice little bar area to sit, chat or do work. Honestly though, with the constant flow of people coming in, I don't think of this as a go-to study place. It's just too crowded! But they can't help it, Boba Guys is one of San Francisco's treasures~ \nLove the decor in here from the cute stickers on the walls to the neat Nitro neon light! Definitely need to try that nitro one day, but I can't help but order a strawberry matcha milk tea every time I stop by. That drink is just tooo guuud!! Also, for some reason, this location in particular always has a bunch of cute puppies coming through! Uguu~", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Boba guys is the best of the best.  By this I mean that their drinks are free of artificial ingredients and they never use powders.  Their products are created only from the best ingredients they could source. From their Grade A balls to their hand-shaken froth, they put care, thought and an immense amount of love into every aspect of their drinks.  They also allow you to adjust sweetness and ice.  You can't go to San Francisco without going here.", "author": "Ghazal S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "I was expecting the boba here to blow my mind as this chain seems to be super popular now. I ordered a regular-sized strawberry matcha latte with pearls. I think the drink looks pretty snapchat-worthy and it did taste just okay. I think for $5.50 is a little steep for what I ordered. The ambiance of the place is super cute and the customer service was friendly. I probably wouldn't come out of my way to go this boba spot, but I'd be willing to try another drink.", "author": "Joanne Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-23", "description": "I tried their Jasmine milk tea with pudding and boba.   The boba is nice and chewy.  The pudding was too stiff.   I've never seen pudding that stiff at any boba places.  It was so stiff and hard to suck up the straw.  I had pudding and boba shooting up into my throat and choked a few times because the pudding was stiff.   Seriously... this pudding is not for kids.", "author": "Angel Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Boba Guys has been my favorite milk tea place ever since I had it for the first time years ago! I love that they have so many locations now and still keep up with the consistent quality and service! This location is just as good as the others I've tried. \nMy go-to is the matcha latte with almond milk at 75% sweetness. I'm lactose intolerant so I always love a place that does good non-dairy milk teas. They have tons of tea options here and allow customization of your drinks! They use high-quality ingredients and you can taste the difference!\nI used to be a fan of the horchata. It's really good but there isn't a non-dairy option. I also really like the earl grey with almond milk! A lot of people like the strawberry matcha latte. It just tastes like strawberry milk to me so I prefer the regular matcha latte.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "Boba guys re ignited my love and fire for boba. \n\nI used to love boba but then I kept getting boba that would get hard and nasty so I stopped enjoying boba until I came here. \n\nI love everything about this place to the boba itself to the interior decorations. It's so aesthetically pleasing inside and it makes it so inviting. \n\nThe boba and drinks itself are sooooo good. I like how you can choose your level of sweetness. I like my drinks really sweet and being able to choose how sweet you want it is just a plus. I order the coffee milk tea and it was the perfect amount of sweetness. Usually when I drink coffee I get headaches, but with boba guys I didn't experience any at all. The drinks themselves taste really clean and refreshing.\n\nOne downfall of this place is the amount of time it takes to get drinks... the line isn't that long and they take quite awhile for drinks to come out. I remember ordering after a specific couple and we thought our drinks would be next but the person who ordered after us got their drinks before us. \nThat's the only downfall but other than that, amazing drinks and atmosphere!", "author": "Jinthana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "This place is very aesthetic, fast service, kind employees, and the drinks were great, just wished that they would take cash", "author": "Sarah N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "I've been a long time fan since 2013 visiting the 19th street location. This location is perfect for me because I can find parking easy and it's on my way home from work.", "author": "San F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Finally! A Boba Guys joint that is close to me with okay parking nearby. I like that they use real tea leaves instead of concentrates. That said, in comparison to TPumps et al, I think the drinks here are a little bland (I've had the jasmine, HK style and matcha). I guess you can't have it both ways. \n\nI've also tried the kaya toast, which I'll skip in the future. They use challah from wise sons, which is a nice idea and generally delicious, but challah doesn't have the same texture and milky flavor that comes from Taiwan toast (which I think uses milk powder in the dough). I think maybe if they doused the challah in butter first, the concept would work better.", "author": "Jean L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "If you're ever so lucky to be here for the seasonal raspberry pineapple Fresca tea, it is sooo good. So refreshing and the grass jelly complimented it so well. \n\nWe came about 10 minutes before opening and we were the first ones in line but a few minutes later there was already a line forming. Service took a little longer than your normal bubble tea shop but it is well worth the hype.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "Worst coffee outside of The Mission but my kids said the Boba was OK, not as good as Quikly though.", "author": "Adrian J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-25", "description": "There is a lesson to be learned here: not every long line ends in a yummy eat or drink.  The boba here is too sweet and the tea is dull. If you wanna have a proper boba drink I would suggest qualitea or steap tea bar.", "author": "Adar G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-02", "description": "This Boba Guys location is so quiet and modern, I love it! \n\nIt's gonna be hard to miss. We drove right past it, and thought it was some sort of gentrified shop in the warehouses. It's unmarked, in the retail below the new and modern condominiums. \n\nStreet parking is street parking, but on the weekend, there is plenty in Mission Bay. We parked across the street where the off-white warehouses are.\n\nIt's not busy here, but that's what I like (that's what I like). Though there was a line, it was short and quick. We hogged the counter seats where they do the nitro brew stuff, I think. I love the vibe here. \n\nAs for the boba, I decided to try the Hong Kong milk tea, for the first time ever. Probably not my favorite. I didn't know it was condensed milk in it, so it was super sweet. My friend pushed me to ask for more tea, but I hate doing stuff like that. LOL, so I told her to do it, and they were nice about it and added more black tea. It was a little better, but for personal preference, I don't like condensed milk with my tea -- only Vietnamese coffee.\n\nI got the infamous strawberry matcha latte to-go for the bf. I've been warming him up to boba, so I thought that this drink would be best for him (he likes fruity boba). I brought it to San Jose, and it was still good quality! But, neither of us were a fan of this drink. Pretty drink, but not for us.\n\nOh, also they have some off-menu toast! Maybe ask the cashier what they have to offer.\n\nNext time, I'll stick to my regular black milk tea.", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-14", "description": "DUDE WHY DOES THIS PLACE HAVE SO MUCH HYPE?!?!?? Boba Guys are probably the most popular boba place and I don't know why! \"Taste our Grade A balls\" NO THANKS THEY SUCK! \n\nOkay... maybe I should back it up a little bit. So I had scoured SF for the best boba place around and found myself here. When we went in, I could already feel that nice hipster vibe, and was enjoying myself. And then we ordered our drinks... and things went downhill from there. I ordered the Jazzcat with no milk, my mom ordered the Lychee Rose with no milk, and my dad originally wanted the Taro Smoothie, but figured it had milk. He asked anyways though. Here's how our cashier responded, \"Oh, well we make our Taro smoothie with rice milk and only an ounce of regular milk.\" My dad asked if he could just have a smoothie with all rice milk, but the cashier refused and insisted on having an ounce of milk in the drink. Finally, my dad gave up and changed his order to a Jasmine Green Tea without milk. \n\nAfter 5 minutes of waiting, we finally got our drinks. One problem: my Jazzcat and my mom's Lychee Rose had been made with milk. *facepalm* so we told them that we had ordered without milk and had them make it again, which took another 5 minutes or so. Then they finally got us the drinks.\n\nThe Jazzcat was decent, the tea was very fragrant and I could taste the flowery jasmine along with the sweet muscat. The boba, however, was subpar and was hard and had a weird aftertaste.\n\nThe Lychee Rose was pretty good too and had a nice fragrant rose taste, along with a fruity Lychee undertone. Again, the boba was rock solid.\n\nThe Jasmine green tea was good too and had that nice jasmine flavor. I think I could get one just as good anywhere else, though. Anyways, the boba in that was hard, and I regret not ordering an almond jelly in mine.\n\nOverall, my experience at Boba Guys wasn't too great, and I'm sure that I could get WAY better boba tea in SF elsewhere. If you're craving boba, I'd recommend Mr. and Mrs. Tea, because their boba isn't hard like Boba Guys was.", "author": "Ella W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "If you like milk tea/boba tea then this place is definitely worth a visit. Lots of different styles of tea on the menu along with lots of options to customize. You can choose toppings ranging from tapioca balls, almond jelly, to organic chia seeds. Pick from almond, oat, and regular milk. Lots of options. They also serve a couple drinks on nitro tap which rotates. If tea isn't your thing they do have some other options like horchata and standard coffee/expresso. It's a small location so not much room to sit but there is a little park/green space right next door. Street parking can be tricky during the week but pretty easy on the weekend. It's common to see a line out the door but I will say the staff are pretty solid and the wait typically isn't that bad. Got a boba milk tea craving check this place out", "author": "Peter P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "There are few places I'd wait in a line as long as the one outside Boba Guys. We walked up to a slew of people lined up all the way outside the door. Luckily we didn't let that deter us, we needed our boba. The line moves pretty fast and once you get inside you're met with the friendliest of faces and great music. Quickly after ordering our drinks were made so the wait turned out to be not so bad. I had their strawberry matcha latte (with almond milk) and the chocochata, both with tapioca balls. They were absolutely delicious. The matcha latte was a perfect blend of matcha with fresh strawberries and the chocochata was full of chocolatey and cinnamon flavor. So while he line can be intimidating Boba Guys is well worth the wait!", "author": "Angela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "When they say they take boba to the next level they ain't lying! I absolutely recommend their strawberry matcha latte for all you matcha and strawberry lovers! Their boba had the right chewiness and sweetness to it to make it perfect! I am also a mochi lover so I decided to try their mochi muffin. Not a fan of the seeds on top but a huge fan of the muffin overall chewy and delicious in my opinion! When I comeback to the city boba guys is a must go to!", "author": "Drea R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Boba guys is for sure one of my favorite bubble tea places in SF. Growing up in Japan, I have super high standards for matcha and the matcha latte here definitely makes the cut. I love that they use authentic matcha powder and whisks it by hand. This location is perfect as I live right next door - the interior and atmosphere is super cute and relaxing. For the longest time, I was hesitant about trying their popular strawberry matcha latte since I've never seen that combination before, but I'm so glad I tried it because it's now one of my favorite drinks. The strawberry purée adds just a subtle hint of strawberry flavor that blends well with the matcha. It was such a pleasant surprise. So excited to keep trying the other flavors they have!", "author": "Mika N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-30", "description": "Love the Boba tea. \n\nHowever, extremely disappointed by the kaya toast. It might have NOT meant to be authentic ..... Because it was far from it. The toast was from Wise Sons, it tasted great, but very thick. The most disappointing thing is that the so called kaya tasted more like custard. No coconut taste, and it was not green neither. Kaya is meant to be from kaya jam, which is made of pandan which gave the color green.\n\nIf you want a tasty toast, sure, it is a 4-star toast. But 1 star for being called kaya toast. \n\np.s. I grew up in Singapore, where kaya toast originated...", "author": "Anonymous L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "Yum! First time here. There was a line which honestly was a good sign for me. I ordered the Matcha Latte with tapioca balls at 50% sweetness. It was so amazing and kept me buzzing for the rest of the day.\n\nThe place itself was also visually pleasing. Very light and open! Would go back a million times.", "author": "Faith R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "I randomly encountered this boba spot while walking after dinner. The place itself was cute and modern. They had an interesting menu to choose from. I ordered the lavender milk tea with less sugar and it was super good. You could definitely taste the lavender. My friend ordered the strawberry matcha milk tea and thought it was too sugary. I would come back when I am in the city again.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "If you have some brown blood aching for that ube halaya.... Just don't. Tasted watered down with something grainy... Oh that's the coconut bits.  Good thing the boba has good texture and flavor.  If you want purple sugar water with grits, ube halaya is drink of choice. I'll be getting taro  milk next time I want a satisfying purple beverage.", "author": "Chi H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "Strawberry matcha latte is refreshing and unique. I was expecting fake strawberry flavor but you can really taste the fresh strawberry and matcha in this. Swirl and you're good to go!\n\nCoconut tea latte is deliciously coconutty although bordering on the too sweet side.\n\nI normally judge boba places by their regular black milk tea and boba. The Black milk tea and boba is pretty good, nothing mind blowing though. Boba has good consistency and is fresh and chewy. I usually get it half sweetened. \n\nI'd be back to try some of the other unique options but wasn't blown away by their standard milk teas.\n\nI wish they had Sunday Bird and fried chicken treats like the Fillmore location as well. \n\nIt's so nice to have a boba place nearby in the Potrero area though!", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "Happy to come across Boba Guys in Potrero Hills. Beautiful modern space with a constant flow of people. \n\nI tried the black sesame latte with bobas and it was good! Nice and nutty like sesame ice cream.", "author": "Lis A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-23", "description": "I've been to this location 20 times or so. It's overrated and overhyped. There's a 25% chance of them getting your order wrong. Prices are high. You will most likely wait in an outdoor queue. Some of the drinks taste OK but none are worth the price. Just don't.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Came in on a Thursday afternoon for their soft opening and received 10% off (until April 15). As a loyal customer- I come at least twice a week - I had to check out their new location!  The interior is like any other boba guys with 3 or so tables inside. \n\nDrink: \n-Strawberry matcha latte with either soy or almond milk and I usually add boba and/or almond jelly - best drink on the menu forsure\n\nParking: \n-lots of street parking \n\n\nPlease open one up in the sunset!", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "This had a high rating while I was researching stuff to do in San Francisco! We came pretty late a little right before closing, but it was still hustling and bustling which is awesome to see when you're coming into a boba shop! The drinks were very interesting to look at and tasted awesome! thanks for an awesome visit we will be back the next time we fly in!", "author": "Charlie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "I frequent between this location and the one in Fillmore for their decaf black milk tea with fresh milk and boba. Not too many locations offer decaf so its pretty nice to find one with a lot of options. friendly staff, on point boba. Pricing is slightly higher than the norm but worth it because of the quality of the tea.", "author": "Tao Tao W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-30", "description": "Ordered a Ube Boba however got nothing but coconut milk so disappointed!!! So I went to MilkBomb down the road and added a scoop of Ube ice cream #winning !", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "This location seems less busy than the others in sf (I'd say mission is the worst though the filmore can get pretty bad). I always get the same drink, the machata- matcha + horchata. The drink is around $5 without boba for the smallest size which is pretty expensive for boba. The flavors are interesting so it's worth going for the eccentric flavors. Their milk tea and Thai tea aren't that great however, and I would recommend walking to sf spark social food trucks, which is 7 min away, to get the OG boba flavors for cheaper and tastier.", "author": "Kalani R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Very clean and cozy place! The drinks are always good  but too bad the strawberry matcha latte can't be adjusted for sweetness :( so I ended up getting the jasmine green tea with aloe jelly 25% sweet. I loved it! Next time I'll try it with their boba.\n\nThe restrooms are two doors down and you ask for a key. They get quite popular throughout the day but the wait isn't too long. I love the atmosphere :)", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "Nice addition to an upcoming area. Asked the cashier for a recommended and she suggested matcha latte with boba. I was worried it would taste too much like brewed tea and I have a sweet tooth so I picked 100% sweetness.  The drink is delicious once you've mixed all three layers together but it's a bit on the pricey side; $5 for a small and $6 for a large. \n\nMy husband is a big coffee drinker and really liked the coffee milk tea. You can tell they use higher quality tea leaves and coffee beans in their drinks.", "author": "CL S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-18", "description": "BLAH very very very bland...wont be back...this is just a trendy spot and thats it...i'll go to quicklys", "author": "Jenny P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-12", "description": "My order was incorrect, missing grass\nJelly but was charged for it.. He also forgot to give me my custard but luckily I remember when I got to the car and walked back for it. My first time at the Potrero location. Disappointed", "author": "Whitney N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-18", "description": "I know the boba craze is real in SF, but it's unclear to me why people love boba guys. I know the logo is cute, the stores are / can be cute, but to me, the drinks are just okay. They're not particularly good, nor are they particularly bad. However, I personally don't see what why people love them so much and that they have so many stores around SF o.O", "author": "Jade F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-17", "description": "I don't remember the service when I've gone here in the past. They are pretty busy, so my guess is they were being efficient and nothing stood out as outstanding or bad - and yes there is usually a line out the door. If you want prompt coffee I would go elsewhere. This location is very clean, with some places to sit (but not relaxing, and leave your computer at home). The interior is great, they take pride in their small chain of stores around the Bay Area, and it shows.\n\nLove their specialty drinks with balls. You can't really go wrong with balls, but these are especially good. My personal favorite is the dirty chai latte, but make sure you request the balls as none of the drinks include them by default.\n\nIm not a big fan of their coffee by itself, and their balls aren't ready until 11am, so my personal recommendation is to wait until 11 or later. I wasn't impressed with the food (there's only 2 options i believe, both toast with ingredients on them. One of them was alright, but i probably wouldn't order either again). due to the amount of time it takes to wait in line and order, Its more of an experience best done with friends while walking around Potrero. Lots of people out walking dogs nearby too!", "author": "Brian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "I've been to the boba guys in the mission plenty of times but there is something special about this store in Potrero. Not only is this store bigger, but it is evident that the workers all get along and enjoy their job. They also had great music taste so that's always a plus. \nI had a good experience with one worker who I believe is named Bryan. He offered a friendly smile and answered any questions I had. He helped me decide on which drinks I should get based off my preference but also his without forcing any drink on me. He was very patient considering how indecisive I am. So thanks Bryan for that! ^.^\nThe drinks I got were Strawberry Matcha Latte and the Jasmine Milk Tea. Both tasted fantastic and fresh and I am definitely coming back here again.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "I'm a long time Boba Guys fan and was super excited to find out that they opened a Potrero Hill location! Staff is friendly and the boba is top notch as usual. \n\nAlthough it's seasonal I highly recommend the Tropic Thunder. It's really delicious and dairy free (I'm lactose)! But if they do t have it, my go to is the Coconut Green Tea with oat milk and boba. \n\nI'm not sure if it's only this location, but they have aloe jelly too as a topping! \n\nThe store itself isn't too big, but definitely bigger than the Mission location. There's plenty of outdoor seating nearby even if it's full. \n\nOverall 5 stars!", "author": "Kelly D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "Their strawberry rice milk is seriously good. I think about it regularly. I do wish the line was a little bit more orderly - there's not really a place for people to exit without having to dodge around other people.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "This place is BOBAMAZING!!!!!!! We celebrated our friends birthday here and we had such a great time !!! Thanks boba guys !!!!", "author": "Connie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "Updating my review to 5 stars after getting the jasmine milk tea with tapioca balls. My last review was 3 stars purely because the Hong Kong style was so terrible. This location has it all: ample street parking, no line, ample seating, and aesthetics.\n\nI highly recommend the Jasmine milk tea. The Hong Kong style was honestly terrible, I couldn't finish the drink.\n\nTheir hours are a bit shorter due to the nature of their location, but there is never a line at this location. The service is excellent and quick. If you want to go to a Boba Guys where you can always find parking and you never have to wait in a line, this is it!", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Seriously top notch boba and milk tea! The line is very long during the weekends and prime hours but goes through fairly quickly. It's definitely worth the wait. It's the only boba place in the neighborhood and is top notch quality.\n\nSometimes you can see the owners at the shop. They're super open to talking and meeting. Very great management and staff!", "author": "Sophia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Service, on point. Friendly. Longish line but pretty short wait. And the people who work here (each time I've gone) are all kind of attractive. Yowz!\n\nDuke of Earl Grey with Almond milk, 50% sweet and boba. It's my go-to, for a good time.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "A lot of love for Boba Guys and I'm glad they're opening up new locations.  While it's sort of convenient of a location, why did it have to be right between 2 Caltrain stops...  Similar interior to their other locations, this one does provide a bit more seating than most which is great.  They have a small bar area set up for those who want to try some Nitro Tea, which I highly suggest you do if you're here.  It's great, and doesn't cost that much more than the regular milk teas.  I'm a little concerned with the quality here compared to the other stores as the coconut green tea I had was a bit different from the other locations I've had it at.  It was much more floral for some reason and I guess it had a bit too much sweetener inside.  Still good, but maybe they're still working out the kinks here.  I love the Nitro Tea here and hope they expand it to their other stores soon, that stuff is so incredibly smooth and refreshing!  Also, while I spent a while waiting in line here, the drinks came out incredibly fast compared to their other locations, so just an observation there.\n\nPros:\n-Nitro Tea Bar\n-Serves Pastries and snacks\n-Decent amount of seating (if not there is a park right outside with benches too)\n-Quality Boba of course.\n\nCons:\n-The location is a bit far to walk to from Caltrain in the blazing sun, but it's still worth it.", "author": "Bryson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-28", "description": "I love their jasmine green milk tea and coffee milk tea (75% sweet). However, their boba pearls are a little too squishy and gooey for me.", "author": "Grace M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "I wanted to give 5 stars as the first time I tried this place my taro smoothie boba was pure heavenly perfection consistency flavor-- delicious!!! It was busy and I waited in a long line and it was totally worth it. Sooo I went back as soon as I was in the area again and was hugely disappointed as it was no where close to the same, it was not busy at all this time, the drink was literally watery and it seemed the flavor and the boba were not as good. Consistency is a big deal so only 4 stars as it is an average of 5 and 3 stars. I do appreciate that they use quality & organic ingredients as I don't like fake creamers. I will probably try another location...as I am hooked on that first try! ok went back yet again--giving 5 stars as they carry third culture bakery items, and the mochi muffin was amazing, got plenty of boba, and the crew was nice.", "author": "marya k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "All the Boba Guys locations are consistent on quality, and this location is no exception!  One of my favorites is the humble Lychee Green Milk Tea; can taste the Lychee and the high quality of the milk and boba.  I also recommend any of the fresca teas.  Overall ambiance of this location is great as well, looks great on a sunny day.  I have always liked their pride in transparency and quality ingredients..Boba Guys is by far my favorite in the Bay.", "author": "Jarrod Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "HIGHLY RECOMMEND. \n\nService & drinks at this locations never fails! Still dying to try out a drink from the nitro menu but i tend to always come in when theyre out :(\n\ntil next time, boba guys!", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-09", "description": "If boba is literally in the name of your cafe, you shouldn't call boba a 'topping' and you shouldn't have to pay extra for it.  Wasn't clear that I had to do both these things to get boba here.", "author": "Jenna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "I don't know another place to get boba in SOMA so this is a nice addition. Sure, it's pricier than other chains, but the quality is on par and the service is really good. Can get pretty crowded at lunch so be prepared.", "author": "Gonzalo S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Greatest boba guys spot! Opens as early as 9am on weekdays, what's not to love?!\n\nMy guy is addicted to the matcha latte, 75% sweet with oak milk. The oak milk really brings out the nuttiness.\n\nI enjoyed muscat oolong on a hot day. Get it without milk, iced, and no topping (grass jelly would go well with it, but boba seems to be too sweet), 75% sweet.", "author": "YY M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "Out of all the Boba Guys I've been to, I never have to stress about finding parking at this location. There's plenty of parking in the residential areas across the street.\n\nI always get the strawberry matcha latte which they are really known for. Personally, the other milk teas are a little too milky for my taste. But everyone has their own preferences :) There's some seating, but are usually occupied when I go.", "author": "Clare H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Got to finally try the nitro tea. \nThey described it like was a Guinness beer. \n\nTried the strawberry and gemaicha. It was really interesting and I definitely liked it. But now since I've tried it I more than likely will get my regular milk tea with boba.\n\nThey dont add boba to the nitro teas", "author": "Anne-Mary P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "4 stars because the boba itself is cooked and sweetened to perfection! Of all of the honey boba I've had over the past 20 years, boba guys definitely is in my top 5! Their service is also quick and efficient which is great. \n\nMinus 1 star though because although the drinks are decent, theyre bland and lack flavor. Tried the milk tea, horchata, and matcha latte. All three were eh.\n\nI'll definitely be back though to try the strawberry matcha latte!", "author": "Allison H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "This is my second time trying Boba Guys. This visit I got the 16oz original milk tea with tapioca and 50% sugar. I waited in line for maybe 5 minutes. The staff was friendly and got my drink made quickly. Also this location has the boba sign on the ground in a bold font. Great for an IG photo", "author": "Susan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Love love love. I didn't know what the craze was about until I actually came in and bought the matcha latte. You can choose the level of sweetness along with the type of milk. Must try. I also chose aloe over tapioca.", "author": "Summer M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-09", "description": "I'm new to this concept, and when I found this location in my nabe I thought I'd try it. I had the black sesame with boba. I loved it. I've had it twice now, but the second time I had it it wasn't stirred, and my first sip was beyond sugary stuff at the bottom of my cup. I guess you need to stir it first.\n\nMy complaint is that the line moves sooooooo slow. I have low tolerance for long but slow lines. They need more workers filling orders more quickly.\nAlso, the layout of the store is awful. One door into the space which also includes a line/bottleneck. Once inside it is difficult to find a waiting space for your order. I'm surprised the fire marshal approved this space.", "author": "Eebee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Been itching to try this because of a video in Facebook and I must say, the Strawberry Match Latte was worth the drive!\n\nMy husband had the Natural Taro Smoothie with Almond Jelly and he liked it. He didn't like the Starwberry Match latte though 'cause he's not a fan of matcha drinks, but for matcha lovers like me - this drink is the best!", "author": "Carmela O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-29", "description": "Ordered matcha strawberry and there was not much matcha flavor.  Can tell from the photo that it's not green like the ones at the other locations :(", "author": "Grace T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "i love this boba place.  I try the Hong Kong style milk tea and I love it. I add the boba and my drink is so good\nI like the environment and the sitting.", "author": "Isabelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Surprisingly lives up to the hype! I have tried, and like, the jasmine milk tea and the classic milk tea, with boba and egg pudding. I really like that you're able to customize the milk and the sweetness levels, since I'm lactose-intolerant and usually don't like my drinks too sweet. This specific location seems to have a shorter line in general than others (like, the Mission), and this one is very bright with lots of natural light (read: perfect for IG pics!).", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Amazing. Best boba I've ever had. I got the original milk tea with boba and my boyfriend got the dirty chai with almond milk. So many options on the menu and very quick regardless of the long line. Love this place and wish I lived closer so I could have this all the time!!", "author": "Kelsey W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-23", "description": "Despite a line out the door, I've made it in and out in 13 min. \n\nBut they don't take Apple Pay. In a brand new building full of tech folk. I don't remember the last time I couldn't complete a counter transaction due to lack of Apple Pay.", "author": "Jenn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "Got two iced matcha lattes and they were both on point, on the same standard of boba guys in the mission and Chinatown, both of which are my go to boba in sf.  \n\nI cannot get enough of the green tea matcha latte. This place definitely filled a hole that was missing in terms of Asian/boba in portrero", "author": "Patrick J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "This boba place is my favorite.I personally recommend the strawberry calipico ,which is milky and tastes like strawberry.Boba Guys is delicious and has interesting pastries which you can enjoy with your drinks.", "author": "Heidi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Best boba tea in town. Love this location because my pup can romp around in the dog park with my hubby while I wait in line to get our milk teas. Only disappointment is that I can't get my strawberry matcha latte with half purée anymore. Just too sweet with the full amount of purée in my opinion, but luckily they have lots of other options. Also, hoping they bring back the Tropic Thunder next summer. That was a great icy combination of sweet and bitter on hot days!", "author": "Sumilu C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "one of my favorite boba places! The matcha latte with boba is my go to! staff is super nice and the service is awesome!", "author": "Tammy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "A decent boba joint that's become a real trend in the area. Came to get a Matchata, which is a blend between horchata & green tea (matcha), a suggestion that a friend of mine had made to me. In regards to how I found it? The bubbles are just as good as they've always been. Good consistency, texture, and not too hard or soft. Now as for the drink & the concept itself? Personally, I found the matcha in this particular drink to be a bit overpowering ... a little too strong for my particular liking. Reason being that having too much of it tends to give you a much more bitter drink that doesn't go well with the normal sweetness that is found in milk tea in general. The horchata part of the drink wasn't actually too bad though ... the part of the drink that I actually liked. Overall, a worthy boba joint worth stopping into to pick up a drink. The basic black milk tea is pretty good & there are other drinks I'd like to try the next time I'm at this chain again. This location can get a little busy though & the servers take a bit longer than those at others to make your drinks (for the very same reason).", "author": "Jack M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-23", "description": "me: \"can I get a matcha fresca without the puree?\"\n\ndude at register: \"Um that's just matcha with water\"\n\nme: \"oh but that's what matcha is right?\"\n\ndude: \"yea....okay\" *takes my order*\n\ngirl making the drinks: \"hey sorry he shouldn't have been able to sell you that we can't do it without the puree\"\n\n*shows me the order slip*\nI see on the order slip after my order the dude had typed in \"No puree he weird af\"\n\nme: \"oh why not?\"\n\ngirl: \"it's a seasonal thing it's uniform across all stores.\"\n\n*me wondering if she means some weird inventory control issue meaning all puree *\n\nme: \"well can you just give it to me separately?\n\ngirl: \"no you can talk to my boss if you want but it's seasonal we can't\"\n\nme: \"nah that's fine, well can you just add milk if you really have to put something in it?\n\ngirl: \"no....\"\n\n1) what I don't understand is I can still drink just the matcha part if i don't stick my straw completely inside.  so there's no actual enforcement of their \"vision\" of a drink that's actually very ceremonial and pure in other \n\n2) I'm not sure why mango being seasonal is a reason?  I even offer them to just give me the puree on the side to allow them to maintain inventory (although that's the actual part that's hard and important to running a restaurant?  not concept, not flavor but inventory control).  It's odd to shift that burden to your customer.  I wasn't asking for them to cook me a chicken instead of tea.  I was asking for them to do rare instead of medium rare.  It would actually take even less work than steak customization which requires extra attention.\n\n3) You guys may jump on the \"he weird af\" part, but oddly enough that part doesn't actually make me that mad.  The guy was just confused because the owners miseducated him regarding what matcha is, I think?\n\n4) I understand if maybe the Boba Guys owners have decided specifically to prevent the Third Place-ification of Boby Guys.  Perhaps they've read Griffiths and Gilly 2012 (http://journals.sagepub.com/doi/pdf/10.1177/1094670511430530).  There are well studied detrimental effects on business.  But I believe they are far away from this and and many benefits of a cafe on the local community stand to be realized still (see Jeffres 2009 http://engagedscholarship.csuohio.edu/cgi/viewcontent.cgi?article=1011&context=clcom_facpub)\n\nI'm past mad now.  I think I've made it past my blind rage at these continued interactions.  I have less the antediluvian anger of Noah and more the lament of a post-Exilic Jeremiah.\n\nTo sum it up, all I'm asking for again is just some respect and inclusion of the customer in the process.  I'm not gonna weave some long weird story of how matcha was a deeply religious and ceremonial part of chinese culture (Chanyuan Qinggui).\n\nI just don't want to feel completely excluded from this long important and typically deeply refreshing relationship between a person and their local watering hole.  It's the last hope I have of slowing the effects outlined in \"Bowling Alone: The Collapse and Revival of American Community.\"\n\nWelcoming cafes and the like have been the seed to many of man's most beautiful moments, the organizational and ideation nucleus of many reactionary movements\n\nThe Enlightenment (Parisian cafes)\nThe Boston Tea Party (Boston taverns)\nThe French Revolution (Café de Foy)\nThe 1886 Haymarket Rally (Greif's Hall)\nLGBTQ movement (Stonewall Inn and various other gay bars)\nArab Spring (https://youtu.be/lstnsT2JPnc)\n\nYou don't need to help change the world!  You can offer solstice against a world that is hard to change.  Some platonic examples include:\n\nCheers from Cheers\nMoe's from The Simpsons\nCentral Perk from Friends\nMacLaren's from HIMYM\n\nIt's a mental sanctuary and physical / spiritual refreshment meant to, if not the light, be at least the salt in an otherwise wage slave existence.\n\nAgain, not every local cafe needs to change human history.  But living up to that the nobility of the profession is something worth striving for.  I'm not saying Boba Guys has the moral obligation to lead a reversal of America's increased segmentation and tendency to \"bowl alone.\"\n\nSo I'm not going to fault them for not doing so.  But it'd be nice if you didn't make it so apparent that our relationship of patron and cafe is 100% transactional and insult your customers in the process.\n\nThe rejection of my attempt to encourage this relationship towards something less Mammon-istic is, after contemplation, much more saddening than maddening.", "author": "Randall L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "I am surprised to find out today about the new no cash policy. The notice says the policy is implanted to speed up service. But I have to walk away because I only have cash and didn't expect this at all. I wonder speed up service is better than no service at all??! Curious policy. I would rethink about it if I were management.", "author": "D. Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-03", "description": "My favorite boba shop is now next to my favorite ballpark and breakfast spot. Hands down the best brews and boba. This location will be getting a lot of my business due to their location and available parking.", "author": "Joshua F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "This is the best boba place I have ever been to.The strawberry latte is my favorite from them.I don't mix it so I can taste the strawberry then at the end of the drink I can taste the matcha latte.So it's like a two in one for me.Definitely recommend if you are near one of these boba places.", "author": "Elle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "I've been to most of the Boba Guys locations across the bay but this one is probably my favorite just in terms of accessibility, which goes a long way in the city! It is by far located with the best parking solution out of their SF shops, as there's tons of street parking in the adjacent and surrounding areas. Drink quality on par. Their strawberry tea fresca is my favorite! While I wish the store itself had more seating indoors, there is a nice outdoor area right by it for when the weather is right.", "author": "Glennda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "50% sweet Hojicha Roasted Milk tea with boba is my favourite and its only available at this location!", "author": "D C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-18", "description": "Great place. No so super friendly but the drinks came out great. A little different than your typical Quicklys. Taste better in my opinion and a bit more fresh. No complaints aside from not so friendly staff members. Great location. Street parking available.", "author": "Meishi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-09", "description": "Almond jelly.... awesome. But the price! Sf prices for sure! But no one I know in sf makes almond jelly in house and I love it.", "author": "Ed C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "This was my first time at this place and came highly recommended by my brother and SIL. First day I tried the Strawberry matcha with bubbles. Second day I tried the Hong Kong bubble tea with almond jelly and it was so yummy!", "author": "Susanna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "Five-star for the decorations and the arm bands of the store. Also another five star for their friendly staff and services. Three stars for their drink I don't think that it's super great nor do I think it's super bad it's just a little blend for my teeth and I think the Haight was just too much it didn't live up to the hype.", "author": "Michele T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-22", "description": "Can here during soft opening to check out the new location. Liked that their were more choices than the mission one since I go there the most. Service was a bit slow but understandable since it was their first week, but they messed up on one drink and I let the guy know and he just seemed annoyed and took more than 10 mins to them to switch it out. No apology or even a smile. They need to work on their service skills. Drink itself was fine but mission location is still better.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Definitely my go-to boba spot. My favorite drinks are the taro smoothie and matcha green tea! Don't be intimidated by the line - the service is super speedy and worth the short wait.", "author": "Doc R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-20", "description": "While I admire their effort to provide the best ingredients, their execution was not great. The tea was very dilute and it tasted like water (even though I got light ice). Boba was on the softer side and not that chewy, although it was sweet. Sure it's boba but not as great as they claim to be if they're using the best ingredients.", "author": "Doris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "Love the design of the space and all the boba options. Especially love the matcha and horchata bubble teas, and it's great to be able to choose the level of sweetness.", "author": "N L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-22", "description": "We get here before closing. Then the worker with the dubs shirt says she wants to go home so closes the door on us when ppl are inside drinking and getting their orders. Don't go to this location. She told us to go to another location. Lame.", "author": "Christine K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-15", "description": "not as good as their Hayes valley or Mission location.  The matcha milk tea had very minimal matcha flavor!\n\nNote: if you feature the brand \"Strauss organic milk\" so prominently in your displays and ads, and also your website http://www.bobaguys.com/faq/ as a reason for your high prices, you should probably use Strauss organic milk =X.  On a recent visit, none of the many gallons of milk behind the counter were Strauss!", "author": "T Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "Finally a boba place near mission bay! Tried their coffee milk tea with oat milk swapped for the creamer--not bad at all :) It's a little oatmeal-y in flavor but if you don't mind it, I'd recommend giving it a try!", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Great new boba spot. With all different types of flavors of teas, coffees & blended drinks as well.", "author": "Jackie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "First time I've seem black sesame (my favorite dessert ever) on a boba menu. So good! Tastes just like those Chinese desserts. The wait for this location is also shorter than most other boba guys", "author": "Betty H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-30", "description": "even though they open at 9 they don't have bubble tea available until 11:30\n\nand thinking of getting a gift card for a boba lovin pal? well think again they don't offer any denomination less than $20 despite the fact a drink averages $5. The guy claimed the plastic cards are too costly - gimmie a break - then offer paper punch cards! \n\nplace is a total rip off only appealing to the yuppie scum ruining san francisco", "author": "Marisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Solid boba shop, got the oolong milk tea and it was just the right amount creamy, and you can still taste the tea.. you can really tell the ingredients are high quality", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "The best Boba! The milk substitute is great. Recommend the jasmine milk tea. But a little expensive", "author": "Zoe F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "I've been waiting years for a milk tea place to open up in Mission Bay. Not everyone wants coffee! Whenever I try new bubble tea shops, I always go for the plain black milk tea with boba and less sugar, and this did not disappoint. I will have to try out their other drinks/flavors, but so far, I'm a fan!", "author": "Zell C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "I finally got around to trying Boba Guys, and I can officially say I am converted and addicted. I first tried their iced Matcha Latte, and boy, did it live up to its hype. I tried it with their Oat-Milk, which honestly is amazingly good by itself, and will only add the Oat-milk now. The Matcha Latte was sweet and creamy. My next drink was the Strawberry Matcha Latte, and was it really good. It almost tasted like a Mexican Strawberry Agua Frescas drink with Milk & Boba.  My goal is to try everything on the menu. I hope Boba Guys eventually expand to Berkeley. Their Boba Balls are very chewy, maybe a little too chewy for my liking. IMO, if comparing it to Purple Kow Boba Balls, I still think Purple Kow balls are much easier to chew on. Keep it up guys", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-24", "description": "Just tried to do a large order for my office via Postmates and Boba Guys Potrero  apparently refused to fulfill it because they've already done 2 large orders for the day?!?!?! That doesn't make any sense and it's frustrating that they don't have phone lines to be able to communicate with them! I've never heard of a place refusing to do a large order! Is this sheer laziness on their part? This is absolute BS!", "author": "Mary J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "I've been here twice now and I love their HK milk tea, which has condensed milk. Their boba is soft, chewy, and slightly sweet. The staff was very friendly and very accommodating when I couldn't make up my mind. I came here midday so there was no line and there was parking across the street. I'm addicted!", "author": "Freckles H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Airy and clean boba shop in the new 1010 Potrero building. One of the owners was working behind the counter today--always nice to see! I'd recommend the original flavor or the matcha with tapioca balls. There can be a long queue at random times during the day. Staff are nice and the quality of the product is superior to any other boba place in the city.", "author": "K J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "I've had Boba all over the bay area and these guys are definitively doing it well. All the flavors taste fresh and natural, and the texture of their boba is consistently good. They do have some nice treats as well. Kinda wish they had more snacks, but I'm reviewing them for their tea. They do have a charcoal pineapple cake that is by far one of my favorite treats.", "author": "Esteban A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "AmaZing boba! Green tea matcha latte is amazing. Also their cotton candy is unique and exciting", "author": "Amber R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Same great service like other boba guys, drinks came sweeter than other locations but they were super cool about remaking them. Nice chill location and they actually have tables to sit at and a wonderful park next door.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "This is to counter-balance Randall L's rude review. Because no one likes a stinker. :)", "author": "Anthony R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-31", "description": "I only go to Boba Guys because they do decaf black tea. However, their tea is often wayyy overbrewed-to the point of being bitter and unpleasant to drink. I haven't had this problem at their Hayes Valley location, but tea quality at this location is very inconsistent. I don't like their boba, so I order without. I do love that they do oat milk instead of soy now- it's really good!", "author": "Diana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-29", "description": "Great variety of flavored teas though not a fan of the texture of the tapioca pearls; a bit hard and may be steeped in syrup for too long. Would love to try a few more flavors, still a great spot for a bubble tea craving and a yummy snack to pair with.", "author": "Chatel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "My preferred location because there's usually no lines. Plenty of parking on the weekends and a little harder to find parking on the weekdays. I always get the 25% sweetness and I always taste the flavor of the teas.  Love Boba Guys!", "author": "D V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Love this place !!!!! my go to place for milk tea , usually always get the jasmine milk tea with their homemade almond jelly or grass jelly. IT HITS THE SPOT!", "author": "Ben Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "No matter how picky I am when it comes to boba, Esmeralda always gets it right. Try their strawberry rice milk and strawberry calipico! wish we could adjust the sweetness for strawberry drinks tho! Go Esmeralda", "author": "Eing O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "My favorite little Boba spot with wonderful staff. Their suggestions are never bad and happy to help newbies to the Boba. If you have four bucks in your pocket and looking for a nice refreshing drink, hit up Boba Guys.", "author": "Chelsey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Great customer service!! Hint: if you ask for no milk, there's a 10% off discount, and if you work nearby, show them your badge and you might be able to get another discount!!!", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "I went in to Boba Guys on Sunday. I was greeted by Mirley. I was not sure what to order so i asked her what she recommended and she offered the new caramel matcha. She also recommended hojicha with oat milk. I was hesitant but i got both and she said if I didn't like it I could exchange it for something else!  The oat milk blended very well together with my drink which the drink 10 times bShe gave a friendly smile and was very accommodating.", "author": "Delaina J."}
