{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Cool bar with great cocktails and a decent beer list as well. It's fairly small and narrow, so not great for large groups but there are a few tables in the back. It was pretty crowded when we went on a Saturday night but the bartenders were very attentive and helped me almost immediately.  It's pretty dimly lit and there is always good music. Note that there is a $20 credit card minimum. \n\nGood spot in Hayes Valley for a drink or two. I will be back.", "author": "Taylor F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "The bartender would not assist me in putting my straw (only given upon request) in my mouth, but she still makes good spritzers.\n\nI think her name was Elisha.", "author": "Joanna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Fancy schmancy bar.  Some of the clientele even came here in nice suits.\n\nThey have a ton of Japanese whiskies.  They make some nice cocktails.  I guess you can say that this can be a classy-yet-hipster type of bar in the midst of some fun new businesses in the area.\n\nThere is also a nice little lounge area towards the back of the bar.  The restrooms are nice and clean.  No worries there.\n\nParking:  Street.  Honestly, anytime I make a review on a business in San Francisco, the parking is likely going to be a pain.\n\nFYI:\n\n- It's probably an animal-friendly place, as it allowed a parakeet.", "author": "Wilson A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-21", "description": "Went on a Monday. Fairly busy. This spot is a neighborhood bar mixed with an after-work crowd. \n\nIf you don't mind a cold bar ( meaning the windows being wide open while it's freezing cold outside) this is the place for you. I would have stayed longer and would have bought more drinks if it was warmer in there. \n\nDrinks were nice however the wait can be long at times. Bar tending staff was attentive. Try to get drinks at the far end of the bar - you will have better luck. \n\nThere are couches to sit on to enjoy your beverage, but no servers ( sitting area only)  - so prepare to go up to the bar and battle for a drink. \n\nActually - get 2 drinks at a time. They are small servings.", "author": "Zita M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-19", "description": "Walked in around happy hour.  The Bar tenders were less than welcoming.  They seemed busy not making drinks.  A woman behind me was served as I stood at the bar.  Oh...and there is a $20 minimum if you use your card.  Not a very welcoming place.", "author": "Neil C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "Day drinking is my favorite thing to do after a long afternoon of shopping.\n\nWe like the chill vibe from this place compared to Anina (hella millenial and hippster!). We sat at the bar and asked the bartender to make me something with Mezcal (of course), a hint of spice, and citrus. Within two minutes, I got a wonderful tasty mezcal cocktail in my hand. Cheers!\n\n\nBrass Tacks cocktails was terrific and inexpensive ($11). The bartender was awesome. I hope you give this place a try. Cheers!", "author": "Owie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "Fourth and last stop on an impromptu Hayes Valley bar crawl. My girlfriend and I decided to yelp one final stop before heading home. We stopped by Brass Tacks on Wednesday, July 12th around 11pm. Right when we walked in, we saw two seats at the front of the bar, so we snagged them.\n\n*Dr No: appleton rum, apricot, lemon, amaro montenegro ($11)\n*Mr Majestyk: scotch, alessio chinato, benedictine, allspice ($11)\n\nMy time here is a little hazy. I remember the ambiance being very dark and bustling. The bartender was nice and it felt very casual. I got the mr majestyk which I recall liking. My gf didn't like her dr no as much. But that may have been because she was mixing all kinds of alcohol that night. I stuck to the mainly the dark stuff, so whiskey / scotch / bourbon. We had a good time just talking and just catching up. I do remember talking to the bouncer for a bit who was really nice. (At least I believe it was at this bar.) Although I'm close to being over the hill, I guess I should appreciate being carded every once in a while.\n\nA fun final stop to end a whirlwind Wednesday night. Even though I was in pain the next day, I still enjoyed our time here. Great bar to just grab a cocktail and catch up with a friend.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-03", "description": "It's a solid bar but there are several things you should know about when deciding to pay a visit. First off, menus seem to be coveted. It might take a while to get one from a bartender, and once you order, it is quickly whisked away which makes it tougher/longer to order a second drink off the menu. Next, some of the drinks are pre-mixed at least the coffee cocktail. Nothing wrong with that but once the pre-measured drink is poured over ice, bartenders mix the drink endlessly for a very long time over lots of ice diluting the drink. I am a fan of stiff cocktails and would rather have smaller more concentrated drinks that diluted ones. I think I timed the mixing of a drink on ice for about 2 minutes (most drinks are mixed 15-20 seconds). I found this pretty absurd if not from an efficiency standpoint. Lastly, there is a selectively enforced credit card minimum of $20 which would be good to know if it was posted somewhere vs. being told after you hand over you card. I appreciate the volume of the bar, long bar seating, seating in the back and seats by the window but those items I pointed out are rather annoying.", "author": "E E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "Brass Tacks was our second stop of the night.  We were hungry, and looking for a place with a more spacious and modern vibe, to take our family visiting from out of town.  \n\nThe staff was super friendly, and he helped us get a table to accommodate my wife who uses a wheelchair.  They had a lower bar, as well as booth-like couches and tables to choose from.  We were hungry and didn't realize that they didn't serve food here, so we were immediately disappointed when we didn't see food on the menu.  The guy was super nice and handed us a free pretzel (they're normally $3), and apologized...even though it was our fault.\n\nThe drink selection is nice, and I don't know about the other drinks, but the mosquito coast packed a nice flavorful punch. If we weren't 3 drinks in and starving by this point, I probably would've ordered another.  \n\nIf you're a wheelchair user and need to use the bathroom, look elsewhere.  Their bathrooms are small, have no bars, and we had to use a weird angle to get the chair in and close the door.  \n\nFinal thoughts? It's good for a spot on a bar hopping trip, but when the hunger sets in and the drinks send you to the bathroom, you'll need to look elsewhere if you require more space.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "My new favorite local bar! Apparently the bar next door has the same owner but personally like BT more.\nDim lighting, intimate atmosphere with a gorgeous chandelier that drew me in from the outside.\nFun crowd, delicious cocktails and awesome music. But the main attraction was a cockatoo named Casper who stole the show! Apparently he is regular at this bar.\nThis is a great spot to come on a casual date, with friends or even solo! It does get pretty packed there on a Friday or Saturday night which has its pros and cons considering the size.\nHighly suggest stopping by.", "author": "Sahar N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Great neighborhood spot for a few drinks or many many drinks.  Don't expect elaborate decor or a high level of sophistication, just place is just a good 'hole in the wall' spot to have a drink and mingle with friends.  \n\nDrink selection - on point.  Plenty of bourbon (some hard to find options), tequila and others to fit your pallet.  Not sure of their beer selection as I was laser focused on the bourbon.  \n\nAtmosphere... as said earlier, a good spot and i believe the owner actually owns several spots with at least one more in the works (I'm. not. A. Local.)\n\nShort and sweet.. next time I'm in Hayes, I'll be back.", "author": "Cory S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "Hungout here last nite. All decorated fro xmass. Loved the vibes.\nThe Rose sucks! The menue drinks are a bit too sweet for my taste. The atmospheres pretty spectacular.", "author": "Mary N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "I've been meaning to come to Brass Tacks for awhile now, and it did not disappoint! I rarely come to Hayes Valley now that I live by the Caltrain station, but it's nice to be in this neighborhood once in awhile. It always seem to bright, sunny, and full of energy. That's exactly the vibe I felt when Nina Y. and I sat down at the bar before our dinner reservations nearby at a Mano.\n\nThe bartender was super friendly and greeted us with a smile. He was busy entertaining the many other customers at the bar. We came at the perfect time when the bar seating was practically full, but there weren't several people lined up to order drinks behind them. It seemed like a nice, chill pace.\n\nWhatever cocktail I ordered (can't remember now!) was fantastic. It was refreshing and well-crafted. I definitely want to come and try more of their cocktails in the future. Just from one visit, it's become one of my favorite places in Hayes Valley, and I don't know why I didn't come here earlier, but now I want to come here more often!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "Nice bar, good drinks and good service. Not too big if you have a large crowd but they make good drinks and its conveniently located at the heart of Hayes Valley.", "author": "Ian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "I think Brass Tacks is so great. The service is good, the drinks are good and well priced. I like the people who are there since they are people who don't care about being at the more trendy place next door. Overall it is just good. My favorite place to go in Hayes Valley for sure.", "author": "Jazlyn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "Located in Hayes Valley, Brass Tacks offers a vibrant, cheerful and overall happily energetic vibe where you can enjoy the masterfully crafted cocktails they serve. \n\nHighly recommended stop on a bar hopping trip in the area.", "author": "Mario B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "Super fun vibe with an innovative cocktail list. I tried \"story of ricky\" which is similar to a gimlet and it was delicious. The bartender is pretty friendly too :)", "author": "Christina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "Came in for drinks.  The atmosphere was very relaxed.  Nice drink menu and the drinks were good portioned and delicious.  If you don't want bar style seating, the back of the restaurant had couch style seating.  Good place for drinks with friends.", "author": "K G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "LOVE LOVE LOVE BT - the ambience is unpretentious and relaxed and the drinks are quality without the downtown prices. the only thing I don't love is the neighbourhood ... but that's a whole different review ha!\n\nnot sure who would have conflicts with the staff but I found everyone to be charming and pleasant. what's the saying? you get what you give?", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "This was a nice find. Good place for day drinking. They have the most unique cocktails, and great bartenders. At the time they had this great record player, so we got to listen to a bit of rock while we sipped our whiskey. Great for groups, and doesn't get that crowded on rainy Wednesday afternoon. Friendly crowds.", "author": "Joel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "This place was jam packed, however, the bartenders are amazing!!! This has got to be my favorite bar thus far simply because the bartenders make it that much better. They are lively, friendly & energetic! The drinks were also amazing. It is a bit dark in here, but if you snag a seat at the bar, you're set. The decorations are also super cool & hip. I will definitely come back!", "author": "Mel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-31", "description": "\"Brass Tacks, that's a fun name.. let's go in.\" This is basically how all my lackluster experiences start.\n\nThat bar is small, but so is everything in San Francisco and even though it was jammed packed with people, the service wasn't greatly affected. They have a slew of spirits lining the wall behind the bar, so they can make you anything except for a drink with Jäger (the guy next to me asked).\n\nThe reason I wasn't so stoked on this joint, is because there was a $20 minimum on cards that wasn't noted before I opened my tab and the bar feels like every new, hip bar that has ever opened. There's nothing new or unique. Well I take that back, there are glass condoms hanging from the ceiling, yes I've attached a picture. \n\nIt's a cute stop if you're in the 'hood, but bring cash and prepare to stand.", "author": "Luci H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-14", "description": "Came here on a weekend - the place was pretty crowded but we still managed to find seats by the bar. We got 2 drinks - the life of Ricky and the BQE. The life of Ricky (mostly gin, soda, lime and a touch of basil) was pretty good and very refreshing. However, the BQE was objectively the WORST drink I've ever tasted. It was really heavy mezcal (super bitter) with a touch of jasmine. Inedible, basically. On telling the bartender, he dismissed us and insisted he couldn't switch out the drink. Disappointed with the service here.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "Ask for a shot of Jameson and it will be watered down. Not just a little where you start wondering in the back of your mind, but very obviously watered down.", "author": "Kaizer D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "Drinks were average, but the bartender (short white bald dude with arm tattoos) was just incredibly rude. \nCome 1:50, he announced that all drinks have to be finished. I had just a small bit of my drink left so I jokingly mentioned \"still got at least 5 minutes, man\" and the bartender looks straight at me then his co-worker and says \"look at this guy being a bitch\" and then proceeds to berate me for apparently stating that. Both me and my buddy were totally taken aback having been perfectly decent guests the whole evening and strongly regretting the tip I gave earlier. \nDrinks were ok, but would absolutely never return here. \nCame here on the recommendation of the the super friendly bartender at Smuggler's cove which is a much better place to spend your money.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-05", "description": "You know I wanted this place to be good. As soon as we got close to the bar, the \"bar manager\" asked for everyone's ID. We had a couple of girls who didn't want to drink and he still insisted on seeing their ids. Then there was napkingate 2017. One of the girls asked for a couple of napkins to clean the side table and the same \"bar manager\" threw napkins at us while making an orgasmic face. What a weirdo. This place would be better if they just fired this guy. He went around the bar telling people to take their feet off the table.\nClearly he's clueless", "author": "Redi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Love this place. Our work comes here for happy hour and the drinks are equally interesting and delicious with something for everyone. The bar is also dog friendly... I think? and its the cutest thing ever to see dogs in a bar. Reasonably priced drinks for SF and for Hayes Valley. Not overly pretentious, great location, great people that frequent.", "author": "Beata G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Came here for the second time the other night and was so incredibly satisfied with my drink, it might just be my new favorite! It was seriously so frickin good. The vibe here is pretty relaxed, cool inside decor, and good service. Not much not to like.\n\nDRINK:\nStrangers on a Train (bourbon, lemon, honey, and I think blackberry?) - Holy god this drink is so smooth and unbelievably delicious. I ordered 3 of them. \n\nHighly recommend.", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "Small bustling bar with a good cocktail list (reasonably priced at $11). Plus good selection of wines and beers. Small snack menu. Great atmosphere.", "author": "George T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "My non-local local. \n\nWhile a lot of people say the service isn't great may be true, it's not terrible. Generally the bar is packed so the bartenders aren't one to hold chats and long conversations which I appreciate when I just want a drink.\n\nCome in on a nice day if you can score a window seat, right in the Hayes Valley square with fully open windows to enjoy a beer or cocktail. Conversation and Brash Smash are my fav cocktails.\n\nAnd yes as a few said it's a $20 min on cards but there's an ATM if that's a big issue...", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-02", "description": "Cool bar, lots of seating, good place to meet up with a friend for a drink or 2. The environment seems to be set up for a Constant rotation. Meaning people come in for a couple drinks and leave and new people come in.", "author": "Kayla B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "Great joint for a weekday happy hours. Came here with my group while we were waiting for a table at another restaurant. They have 1 tequila shot and a beer for $10. I love tequila so I was sold.", "author": "David Dat T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-22", "description": "This is a straight up drinkery in the heart of Hayes Valley. I know that's not a word but I didn't want to say \"drinking establishment.\" It's a place where it's basically a rectangular room with some seats in front, a bar to your left, and some more seating in the back. They serve pretty decent cocktails and the bartenders are friendly. This is a good random place to bar hop to/from.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "A Moscow Mule and a craft beer under $15.00!? Am I really in San Francisco? It is true! The cocktails here are fairly priced and properly crafted. My MM was exactly the way it was meant to be, not too sweet at just the right strength. Strong that is! \n\nIt can get crowded so be prepared. There are chairs at the bar as well as along the wall behind the bar. The atmosphere here is lively as can be expected, but the staff operate with a cool sense of 'hey, I got this.' No stress and everyone is served promptly with pleasure. The atmosphere was so nice on this 1st visit that after dinner with friends, I actually returned for another round.", "author": "Jaylena P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "Cute neighborhood bar with plenty of seats in the back. I really enjoyed my cocktail (strangers in a train), and they had an IPA that I actually liked! It didn't take too long to get a drink, music was not so loud that I couldn't hold a conversation, and there was a t.v. on with sports for those of you who care about that type of thing.  Street was lively and it was nice to stop by after walking around checking out the stores.", "author": "Susan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "After enjoying a nice meal which started a 5pm, the night was still very young.  A couple of sausages and countless number of boots later, we decided to get drinks here.  \n\nRight when we walked in, we were greeted by the prettiest white cockatoo by the name of Casper.  After that, the night was filled with lots of laughter, weird topics, massages with no happy endings, the smell of farts and burnt hair, a heart to heart with someone either in the sober or drunk stage *shurgs*, a wolf looking dog chilling at the back of the bar, selfies with Casper, shots of fernet, and the best part, watching a random lady giving our friend the WTF look for slowly sipping on the shot of fernet while calling him out and taking the shot from his hand and downing it like a boss. We died.\n\nThe place was packed with a nice friendly crowd, the bartenders engaged in conversation with the customers, and the drinks were good.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-03", "description": "the bar is descent, would not say its the most open minded place I can think of", "author": "Brendan O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "Best old fashion I've had in a long time. Ambiance is relaxed, the couches are a little dated but otherwise a chill place to grab a drink.", "author": "erika e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "Oh Matty I'm so happy for you! I love both your establishments! I like coming to Brass Tacks on Sunday evenings for the low key vibe, easing myself to the work week or in my case Monday. The location is prime and the venue is quite spacious. It seems small because majority crowd around the entrance but don't be fooled there are couches in the back as well as tvs to enjoy NFL Sunday. The bar also offer snacks with a wide selections of spirits. I always look forward to seeing Drager (I hope I didn't butcher that) and the bar staff, they are so very friendly.", "author": "Trish Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Pretty chill neighborhood bar surrounded by local restaurants and shops.\nCame here on a Sunday afternoon and the place was fairly packed, but luckily I was able to swoop on a couch & table located in the back by the big screen TV where they had the football game showing.\nThe drinks menu is pretty innovative and I was told they change their specials pretty regularly.\nI stuck with the regular mojito (my choice of poison for cocktails) and it was on point. Bartender also came by several times to ensure we were good & the drinks were tasty.\n5 stars for the drinks and service, will definitely be back soon.", "author": "Ada C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Great atmosphere & the mixed drinks were incredible. I had the Mosquito Coast and it was just the right amount of everything. I highly recommend!", "author": "Amber E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "Let's get down to the brass tacks. OK, bad joke I know. I've been to this bar a few times now, and it's always packed with people! With few options in this \"stretch\" of Hayes Valley, it's definitely a solid option if you want a great cocktail in a casual atmosphere. \n\nI'm a big fan of their selection of spirits as the back wall is littered with tons to choose from. I fancy myself a bit of a Gin snob, so it's nice to drink at an establishment that offers a plethora of botanically liquors. :) \n\nI think the best part is that nothing is overpriced. Hayes Valley can get pretty expensive and Brass Tacks is a great alternative to save a few bucks.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "I went to brass tacks in protest. Can't imagine that space with no drag queens or  one of Marlene's fixtures at the foot of the bar. The bouncers was super nice and the drinks were pretty good. But the lack of 1 star was for the attitude of shorter bartender. If ur having a bad day, internalize it, don't get short with your customer.", "author": "brian k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Came to this place for a quick drink with my friend and ended up really enjoying it here. The bartender jagger was super friendly and made the time we spent here great, also made us some yummy mojitos that weren't even on the menu!", "author": "Tas Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-10", "description": "Now serving hot buttered rum! The bartender happily announced this as I sat down for a beverage during happy hour.\n\nThough I sincerely love hot buttered rum (make it at home A LOT), Monday night was actually pretty balmy, so I'll have to save that drink for another trip to Brass Tacks. Had a Stray Dog with tequila and anise. Festive but still craft cocktail boozy.\n\nLook at all the Santas... they're so awesome and creepy! Note: this is only a holiday thing, no need to worry about a Christmas-themed bar. Though that would likely do well in a city like San Francisco.\n\nCome see the decorations, have a drink, pet one of the many dogs inside (doesn't hurt to have a treat or two in your pocket) and enjoy an adult drink. Very cozy, indeed!", "author": "Abby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Delicious drinks each time I go and adorable holiday decor. It will be somewhere I return to many times through the year but additionally at Christmas times to see all the santas. When it's not a holiday the decor is sheik and modern. Gorgeous floors. Friendly staff. Well Thought out drink menu made with care", "author": "Jess H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "Brass Tacks is one of my favorite bars and it's located in the fantastic Hayes Valley.  It's generally pretty crowded but I've never had a particularly hard time getting drinks here and they do have a good selection of alcohol (namely my favorite, whiskeys).  \n\nPricing is actually pretty good for the area and the being located so close to the Proxy makes it a go-to spot when there are events going on.  I also have to say that the bartenders here make a FANTASTIC Sazerac.  It's my cocktail of choice and they do it very well here.\n\nIf you're in the area looking to wet your whistle, Brass Tacks is the place to be.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "This is what a neighborhood cocktail bar should be.  Plenty of seating, friendly staff， great drinks.  Not a destination bar, but solid.", "author": "J M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-15", "description": "This place only allows you to order off \"their menu\". Asked for a fruity, sweet drink... I was looked at like I was crazy and she said the only drink they had was \"this\" and ended up making some other drink than what we agreed on..... wasn't sweet at all and tasted horrible. \nIf you're going to be a bar you should hire bar tenders who can understand and deliver what you want. \nMade me feel stupid and crazy for having a simple request. Thank you.", "author": "Haley J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "Cool little bar in Hayes valley with a relaxed dark atmosphere. It's not that large and seating is limited, so I would get there before 10pm most nights. It gets too packed after that unfortunately. Good selection of drinks and in a great location.", "author": "Leo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-16", "description": "Had some rapid and well made old fashions here (one with bourbon and the other with rye). There are a couple seats and tvs in the back and a counter running alongside the bar. It's dimly lit and has a fun and young vibe. Nice spot for drinks earlier in the evening.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-18", "description": "With bars aplenty in the area, Brass Tacks is a decent spot to head down to after work to meet up with friends or co-workers. It's not a big bar but large enough if you go with less than 4 people at once.\n\nThe music isn't so loud and the service with the bartenders is surprisingly quick with getting my drink considering how busy they were (which means they must be pretty good). I do wish there was more seating here but real estate being more valuable than gold out here in SF, I can understand that they have to make use of the space the best way possible, which means more people standing than sitting taking up space.\n\nI did wish they had a larger stout selection.\n\nPrice: $6+\nWait: None", "author": "Pourio L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-01", "description": "Nice cozy bar. Lovely mezcal mixed drinks but lacking wine selection. The place has a great vibe but the music was a bit off.", "author": "Natalia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Great place fun atmosphere quick service. I only gave it low marks because the drinks are so damn expensive. Unfortunately that's on par with the rest of the city.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "Really love the interior of this place- dark and classy is how I would describe it. Bartenders are friendly. $10 cocktails that are delicious. Bar was actually fairly crowded at 2:30 PM on a Monday (what do ya'll do for a living?!?) but the tables at the back were available and we gladly plopped ourselves down there. \n\nIf you're trying to live life on the bougie side, I would come through.", "author": "Arezou A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "Solid place for cocktails.  I had one with mezcal and jasmine and it was excellent and only $9 during HH ($10 regular price, definitely below SF market rate!)  I also sampled my friends' drinks, one of which was a good take on a Negroni, and another which used a brown spirit base, peach, and lemon (too citrusy for my taste).  \n\nOf note: This place is popular!  It was already pretty packed by 6pm on a Friday and can get a bit loud.", "author": "Beatrice W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-02", "description": "The type of bartenders who could care less... outstanding customer service was not on their radar.", "author": "Cordlaine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "Came here after work for a quick drink before dinner. The drinks were unique, strong, and delicious. The bar is pretty small/narrow, and it gets pretty crowded even on a weeknight, so might not be the best for groups.", "author": "Jules C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "Love, loved Brass Tacks. \n\nBae and I went to celebrate for happy hour on a Friday. It wasn't too crowded at 5pm. We were able to get seats, but by 7 it started getting packed, but not in a 'I can't breathe here' sort of way. Fun vibe.\n\nThe bartenders were actually awesome. You catch eye contact without waiting very long and they're really fast with their orders. \n\nThe cocktails are amazing. I ordered the Velouria. I'm a huge fan of savory cocktails and it was so delicious. Kind of hard not to throw back everything at once! That's the problem with bomb cocktails - I want a huge jug of it. Two of them had me nice and tipsy and ready for a pizza dinner. \n\nI've been delightfully surprised with cocktails in this city. They don't cost an arm and a leg, they're super creative and tasty. Theirs run for $10 each, but we got for  $9 for HH. That's a steal! \n\nPerfect place for our date night. It'll be on my bookmarks for future funtimes.", "author": "Priti K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-08", "description": "A group of us met up here on a Wednesday night at about 9pm. It was not too crowded (plenty of room for 6 of us to hang out at the bar), but still lively.\n\nThe bartender was really nice. They'd run out of their pretzel so he gave us a free jar of spiced almonds.\n\n* Blood on the Sun ($10) - 4.5 stars\nBright red/orange color, and delicious. A great mix of sweet and tart, well balanced.\n\n* Salem's Lot ($10) - 3.5 stars\nA lot of well mixed flavors, but on the strong side for me.\n\nDrinks menu: http://www.yelp.com/biz_photos/brass-tacks-san-francisco-2?select=qZQAPpRm5dGegVY-xL6O4w#qZQAPpRm5dGegVY-xL6O4w", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-25", "description": "I like this place! It is the perfect combination of intimacy and cool. If you're looking for a date place to get drinks, I'd search no more. \n\nThe bar staff are super friendly and attentive. I didn't have to wait - in fact, the bartender came up to me the moment I sat down! Whenever my drink was finished, the bartender would ask me if I wanted another one. What nice service!\n\nAs for the drinks, they are well priced and well-stocked. The draft beers are in the $6-9 dollar range. The wine by the glass are slightly more, around $8. Cocktails are $10. If you come during happy hour (before 7pm), cocktails are $1 off. \n\nCheck this place out! It won't disappoint.", "author": "Nicole J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-15", "description": "Trendy bar that's usually packed. The service is slow as molasses and there's a $20 minimum on credit cards.  Not a neighborhood, bar.  The bartender I spoke to was a major Nob.  I'll be drinking elsewhere.", "author": "Nicolas T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "4.5 Stars\n\n$10 All Craft Cocktails +1 \nBeautiful ambiance +1\n\nDrinks are well made, stiff with a good balance of sweetness, acidity and flavors are true to their descriptions\n\nOverall Thoughts\n\nBrass Tacks will certainly be on my list of return visits", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Brass Tacks is one of my favorite bars for the drinks. Although they are pricey, they definitely know how to make a great drink. This place makes a really great old fashion. It can get rather crowded and hard to move around at peak times, so I would suggest going early.", "author": "Jorge S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-11", "description": "Cute spot, very central, friendly staff. A good mixed crowd all around. The prosecco was so so, but I had the old cuban here and it was solid.\n\nThe decor was very unusual, done with a sense of humor. Tens of small santas (with occasionally bigger ones standing ones) in different forms adorn various parts of the glass lineups, overwhelming one in terms form and number. This was during the holiday times. The owners here definitely has a unique sense of humor.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-03", "description": "Usually this place is packed so I never bothered, however, one brisk weekday night I wandered in when I saw there were several spots open at the bar. \n\nThe bartender was super cool and we chatted for a bit because he actually lived in Seattle for a few years, like myself. He was also kind enough to give me some really useful tips about the Hayes Valley 'hood since I was a n00b.\n\nI got a Sonoma Valley Cider upon his recommendation after I told him I can't drink beer (the glutens!) and love a nice dry cider. I forget which one it was but he really pinned the tail on the...apple. \n\nI also spent a bit of time talking to a new friend at the bar about life, careers, and everything in between. So if that's a sign as to the type of patrons that frequent here, I'd happily go back.", "author": "Carol M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "I was struggling between 3.5 and 4 but end up doing 4 because the bartenders are so nice and attentive here. It's not a huge place but then again space is limited in the hayes valley. If you plan on driving just come at night when people start to clear out from the dinner rush. This place gets busy even on a weekday surprisingly. Since I don't drink I can't comment on the alcoholic bevs but my friend said her drink was strong which was a plus in her book. I guess they don't skimp on the alcohol -- kudos !", "author": "Yvonne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "The place looks like it's been sprinkled with Santas everywhere. A very nice decor with a vintage juke boo. Great drinks and place to hang out.  I really had a great time with my friends here.", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "Update: During a rowdy session of day drinking a couple weeks ago, I left my purse at Brass Tacks. Yes, my entire purse-- including my wallet, cell phone, etc. \n\nA million thanks to Brass Tacks' staff for their kindness and integrity. They returned my belongings to me the next day, and everything was intact. I'm from NY so seriously, their honesty was truly unfathomable to me. THANKS AGAIN BRASS TACKS!", "author": "Alyssa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "Small space but good atmosphere. There were a lot of people inside but no line when I got there which is always nice. The Moscow mule was really good! The drinks were priced pretty average for the city. Definitely mid- to late- twenties crowd.", "author": "Rachael P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "Great spot.\n\nThis bar is perfect for a few high end drinks in Hayes valley. \n\nThe atmosphere is very slick, clean and dark - More like a NYC (Brooklyn) than SF bar in a good way. \n\nPrices are great - $10 cocktails and they are really good.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-23", "description": "Even as a Marlena's loyalist, I recognize that Brass Tacks is a great bar with good quality cocktails and a nice addition to the neighborhood. But...last night I left my credit card behind the bar and after picking up my card today, I noticed that my bill had been closed out with an unauthorized 20% tip on five drinks.  What kind of policy is this?  A bit ridiculous, in my opinion.\n\nSince there is no phone number listed on their yelp page, facebook page, or website, i'm left to air my annoyance on yelp.", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "Fun bar. Cool crowd. No cover charge. Good drinks. Friendly bartender. Could get packed. Have some cool lounge chairs on the back.\nDrink costs around $10-15. This bar reminds me of College in Marina but not as young crowd and less d***chy. Hheheh\nMight be back here again if I'm in the area.", "author": "Claudine V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-08", "description": "Despite working and living on the same block for 3 years, these guys have gone significantly downhill. No respect for prior relationships or neighborhood support and they will not remember you. Suck.", "author": "Drew P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-09", "description": "The red headed bar tender is very rude. \nAdditionally, the Bloody Mary's were gross and hardly had any alcohol. \nHire staff that can handle crowds and aren't mean to their customers. \nFeels like the Death of San Francisco inside", "author": "Joaquin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-22", "description": "Good drinks, always packed. There is a $20 minimum on credit cards but I guess that is how most bars are these days. \n\nThis is a great place to grab a drink before going out to your destination or a good place to just drop in if you need a drink. Haven't ever spent more than an hour or so there. It can get a little claustrophobic. \n\nBartenders know how to make a drink that will please any palate so if you are having trouble deciding what to get, they can help you out. That being said, their menu always has great inventive cocktails made with unusual but tasty ingredients.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "Had the Stray Dog.  Delicious and refreshing.  My date had the bloody, served on the spicy side, very good.  Saturday afternoon, Good relaxed vibe and ambiance.\nBartender was friendly.", "author": "Katie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "I think I've found my favorite neighborhood bar!  The drinks are made well, the bartenders are friendly, and the prices are reasonable. The decor is minimal, minus the odd light fixture above the bar that looks like a bunch of droopy condoms. I will definitely be coming back here for after work Friday drinks soon!", "author": "Josh S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "Get the Beetlejuice.  I want to be drinking that at all times of the day no matter where I am.  It's delicious.\n\nOther than that?  Great location in Hayes Valley.  I get a cool vibe from the people that come here.  No creepers or party girls or douche bags.\n\nOnly 4 stars though because my roommate asked a bartender for a napkin because he had spilled some beer on our table and he wanted to clean it up and she said no.", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Made a pit stop here before heading over to Izakaya Rintaro in Mission. \n\nCame here a little bit after Christmas time and the place was packed, like literally PACKED, with little Santas... EVERYWHERE. It was cool and creepy at the same time.\n\nI personally didn't get a drink here at the time since drinking before getting food in my stomach seemed like a bad idea ( I had hot cheetos for lunch). \n\nThe place is cozy, dimly lit and had a super nice ambiance to it. I'd say it's a nice place to bring a date or even just hangout with a couple friends. The noise level is about moderate but don't expect to get rowdy here. Drink menu is no Yardhouse menu but it has a decent amount or craft beers and cocktails. \n\nI will probably come back here when I want to grab a cocktail or two... and also when I have more than just hot cheetos in my stomach.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-04", "description": "Stopped in here with my guy and a friend before dinner nearby.\n\nBartender was friendly, even though he was slammed.\n\nWe al l had different drinks, some being better than others.\n\nI appreciated the amount of seating and that thee bathrooms were relatively clean:)\n\nIf I were nearby, I'd stop in, but wouldn't go out of my way for. Boozing in this neighborhood is stiff competition!", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "Nice bar, plenty of seating, excellent cocktails!", "author": "Virginia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "I was sad when I heard that Marlena's would be closing. The LGBT-friendly bar in Hayes Valley was a San Francisco institution. Back when I lived in the hood (before it became the posh Hayes Valley 2.0 that it is today), my girlfriend and I would grab a night-cap there and chat with all the regulars (everyone from hipsters to drag queens). Plus, they had a smoking section adjacent to the bar (this was back when I occasionally smoked). And, of course, Marlena's was famous for their over-the-top Christmas decor during the holiday season.\n\nBut alas, all good things must come to an end, and Marlena's was sold to new owners last year and transformed in to Brass Tacks. Needless to say, I was skeptical of the new tenants and their new cocktail lounge-y concept. Fortunately, I'm pleased to report that Brass Tacks is a wonderful addition to the neighborhood. The interior is a complete 180 from the old Marlena's. They have a shiny new bar; plenty of black leather couches; lots of modern light fixtures; and open window seating. The place is definitely a nice mix of sexy and comfortable.\n\nBrass Tacks boasts a solid mixology program. All the featured cocktails incorporate a gourmet medley of spirits and flavors. I ordered the Salem's Lot (bourbon, punte e mes, lemon, apple spice). My friends ordered some sort of fancy rum cocktail. \nNow I won't lie to ya - the drinks here aren't cheap ($10 a pop). And they each take 5 minutes to prepare. But if you don't mind the wait and the price, I think you'll be rewarded with a tasty beverage. Who ever created their cocktail program certainly knows what they're doing.\n\nAlthough I miss Marlena's and its colorful characters, I think that Brass Tacks is going to do just fine in this neighborhood. And judging by all the young hipsters and yuppies who showed up for happy hour, I think this bar is off to a great start and can expect to be around for a long time to come.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-05", "description": "What a stuck up bar. It's great that it's open till 2am compared to other bars down the street, but the bartenders have a serious bad attitude. Drinks are not that great anyway. There is plenty of standing room, though, with a roomy area in the back with seats on the side. I guess if you don't have to interact with the bartenders and don't get stepped on or elbowed in the face, it won't be such a terrible experience.", "author": "Sherry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Great cocktails and good vibe at this Hayes bar! We arrived on a Thursday night around 10:30 PM and they were packed but we managed to get our drinks fairly quickly. We will definitely be back!", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-04", "description": "While some people bemoan the loss of Marlena's, it's better to look forward and give the team behind Brass Tacks a big thumbs up in turning a less approachable bar in Hayes into a popular spot on any night. The bartenders are friendly, the owner is always around helping out or chilling, I think it's always a good time to catch a drink at Brass Tacks. \n\nDrinks are priced right, thus placing Brass Tacks in the same competing neighborhood bar category as Place Pigalle down the block. Although Pigalle boasts a better craft beer selection, Brass Tacks has all the liquor options & cocktail concoctions. But I'm all for having more libation options in Hayes, every bar has their purpose!\n\nGet the window seats if you come by daytime, you get a direct view of Patricia's Green to people watch while the sun is shining in. You can plan your next move from here, whether to get some ice cream from Smitten, or perhaps a healthy juice from Juice Shop, or onwards to Biergarten for some more day drinking!\n\nThat glass chandelier centerpiece is pretty badass too.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Great bar in the center of Hayes Valley. Went there on a Thursday night. Friendly crowd, great cocktails  and outstanding after party. \n\nBest drinks: Old fashions and Brass Smash", "author": "Enrique H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "I think I've found one of my new favorite bars in SF.  The place is dimly lit, with a great ambiance. Bartenders are always quick to help you out with your order which is always appreciated. Cocktails are priced fairly even when its not happy hour and they are extremely well crafted. \n\nJon was bartending when I went in and made me the most insane Mai Tai. I would go back any day for the amazing cocktails and service from Jon!", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Great vibe, great service, great drinks! It was pretty full on s Friday night, but it wasn't loud. We came with a group of 4 and were able to find a spot, get drinks quickly and actually hear each other talk. I was really impressed with the service though. Somehow the bartenders are able to make great drinks and keep track of the order in which people walk up to the bar. They looked like hipsters, but they were SO nice, attentive and professional even though the place was completely full. I wish all bars were like this. We'll definitely be back.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-07", "description": "I miss Marlena's but these guys have done an amazing job with the space: hardwood floor instead of the old carpet, a beautiful chandelier made of blown glass, a sexy new bar, a record player, and a jukebox. The service was great especially considering that it was their first Saturday night and the place was super crowded.\n\nThey have a full bar with at least 2 Islay scotches: Laphroaig and Lagavulin 16. That's mostly what I care about.\n\nNotably missing elements from Marlena's: the stage, the pool table, and the smoking patio.", "author": "Amir H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-24", "description": "Good neighborhood bar with a pretty diverse selection of draft and bottled beer. I was pleasantly surprised to see Hitachino's White mixing company with Dogfish 90 minute IPA. Of course, these guys are on the pricy side but you can also get some Stone IPA for just $5.\n\nHaven't been on a weekend, but it was a relaxed atmosphere on a weeknight. If you're looking for something low key, where you can nurse your beer for a while, check this place out.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-16", "description": "Another great addition to the stable of drink spots popping up in Hayes Valley. With a solid cocktail menu, well crafted beers on tap/bottle and bartenders that know mixology, Brass Tacks will be a regular drink spot for many.\n\nThe Conversation is twist on an Old Fashioned that won't disappoint. Also, check out the bourbon spiced nuts and the soft pretzel snacks - winning!", "author": "Justin O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-30", "description": "Came here for a friends birthday to grab a couple drinks. Ordered a couple rum and cokes and not sure what rum they used, but it was absolutely disgusting. We took one sip and couldn't take another. When I told the bartender (dark brown hair) she was extremely rude. I asked her for drinks made with a different rum and she took a total attitude saying why would I make you a free drink. I wasn't asking for a free drink, just the drink that I payed for to not taste gross. Other people who worked there were also somewhat rude. Won't be back here.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-17", "description": "If you need a beer in a pinch, Brass Tacks is for you. But, if you like bubbles in your beer, steer clear, cause these fuckin guys haven't heard of carbonation. \n\nThat said, cocktails - delish. Crowd - bros in tucked in polos. Decent spot to watch a game in the afternoon. Don't bother coming at night - it's a shitshow. \n\nRIP Marlena's.", "author": "mahela s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "The music was great and the bartenders were really attentive. The club provides umbrellas when there is a chance of rain and they keep the space at a good capacity. Ask for the cotton candy and have a fun night!", "author": "Larry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-12", "description": "This was a nice, sunny bar in the heart of Hayes Valley.  They cocktails were balanced and didn't even taste like alcohol even though there was quite a bit of booze in them.  I really liked the Beetlejuice and the Corpse Reviver 2 w/ Elderflower instead of Lillette Blanc.  \n\nThe bartender definitely made the experience.  When my boyfriend asked him what he recommended, he said \"Give me a spirit and a feeling.\" Meaning, name a type of alcohol and a feeling you want to have.  Then he whipped something up.  I thought that was a cool way of asking for inspiration.  \n\nThere's no food served here, just nuts and soft pretzels, which I didn't try.", "author": "Elise G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Best neighborhood bar. Highly recommendable, it never disappoints. \n\nTry the Brass Smash, nice rum cocktail...", "author": "Jorge G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-15", "description": "Came here during the warriors game so it was crazy packed. CRAZY KUDOS to the bartender though for keeping up with everyone ordering drinks. I got the moscow mule, but it was too ginger-y. It hurt my nose!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "My go to neighborhood bar. Super low key but the place is always crowded after 5pm and on weekends. Prices are pretty decent and it's comfy. Only thing is I wish they served some light food (besides pretzels). I heard the owners are opening a restaurant next door so that's exciting!", "author": "Shawn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "This place is my favorite bar in Hayes Valley. The service is always phenomenal no matter how busy. I love how the bartenders immediately hand you a menu before you even have to ask. Such fresh cocktails - I love their greyhound. \n\nFun fact: This is a dog friendly bar :)", "author": "Alexis T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "The \"basic facts\" are\nthis: it's the party of Hayes.\nWindow seats are best.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "This place is always packed! It's probably the most popular bar in Hayes Valley. Location is on point. The drinks are reasonably priced and strong. It's clean enough. Honestly, the only reason I gave the bar 4 stars is because nothing really stands out to me that would make this bar unique. Maybe I'm missing the mark on something? Overall, great place to hang, but no \"wow\" factor.", "author": "Molly V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-15", "description": "Best bar in the area. Bartenders are easy on the eyes and super friendly, delicious, well crafted cocktails/wide range of liquor, unpretentious vibe. \n\nThey have tarragon grapefruit vodka based drink I believe. And me and my friend got pretty high on it... Not sure why but allegedly tarragon has calming and sedative properties if consumed in highly concentrated form- go figure. We don't smoke weed otherwise- thus very sensitive when it comes to anything like that. \nIt did not feel bad though. ^^\n\nWhen we asked our bartender if anything like that ever happened to anyone he replied that once a girl was freaking out after she had... 7 of those.", "author": "Liza B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "One of my favorite bars in San Francisco in one of my favorite neighborhoods Hayes Valley. Great craft cocktails including one made with Mescal and homemade hellfire bitters that is amazing.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-03", "description": "Great location, excellent and attentive bartenders, a bit on the pricer side for cocktails, but great selection nonetheless. \n\nWhy the low rating you ask? The 'bouncer' on the night of August 2, 2014. I walked into the bar while he was out on the curb puffing on his e-cigarette. Yells \"Hey KID\" and demands my ID. In shock I fumble with my wallet and accidentally drop it. Keep in mind I had no drinks at this point and had just come from smitten across the street and was in a pretty good mood. He then proceeds to tell me to take a big breath (in front of all of my friends) and completely humiliates me. Calling me kid, assuming I'm intoxicated, and generally just giving bad vibes.\n\nDespite the location and selection, as long as this faux-hipster bearded vaping loser is bouncing here, I won't be back. \n\nNote to management: don't hire douchebags as bouncers. Sorry not sorry.", "author": "Andy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "Brass Tacks, you get an A+ in my book!\n\nWe stopped by around 9pm on a weeknight and had an awesome time here. We joked with the bouncer who was checking our IDs and said something about my best friend and I having nice, warm scarves in the cold weather. We said that he should open up a scarf check to stay warm before letting people in ;) (hey, at least I thought it was funny after a couple drinks!)\n\nThe bartender was nice and attentive, no attitude at all. He made my gin gimlet (made w/ St. George Terroir) perfectly and asked me if I approved  - is it just me or does no one do this anymore? I appreciated it! My best friend enjoyed her whiskey cocktail and we had a great time ogling the collection of Santa's proudly on display for the holidays. \n\nA fun place to meet up with friends with no pretension.", "author": "Liz G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "Trendy, clean, upscale, pricey but justified, great location and overall fantastic atmosphere. Will be returning.", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "\"Beetlejuice, pre opened bar tab, good vibe, hipster crew, I maybe here for a while.\" I wrote it when I checked in on Yelp. I did. It was a nice bar. Really great for happy hour with the colleagues. We are a valley company with many people living in the city. It is a great company, mind you, but commute is a bit of a pain. That said, meeting colleagues after work in the Hayes was fun, in particular, this bar, was a great find. Drinks were good. Space was open. And staff was friendly. It's a bit of a young crowd, but I have no problem pretending that I was still in my 20s. While drinking a cocktail, my colleague, the engineer was showing me the new app his team was building. Then, my other colleague and I chatted about France. Two young marketing gals showed up for more drinks. Yep, it's a quintessential San Francisco tech heavy scene. We are in the middle of a gold rush. I remembered the last boom like it was yesterday. I told my colleagues \"Back in the day, I'd come here on dates, buy one of kind clothing, and feeling hip. Then we'd all hang out in North Beach for late night (drinking) activities and for the morning after, Bloody Mary served in any number of restaurants in the Marina. That, of course was before those areas went on to become full on touristy and stuffy.\" They looked at me like I was some eight-headed *ancient* creature. Hayes Valley was hip once, yes, like it was the Mission. Now Hayes Valley has become fully yuppified, overrun by French tourists.\n\nYouth is the most valuable currency of all, and yet youth is wasted on the young. Perhaps if I hang out at this bar long enough, I'd come to appreciate what I have learned, and be thankful that I still look relatively youthful.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "Good spot for a drink in Hayes Valley. Wandered around the area for a while trying to find a bar big enough for a group of about 8 people.  Many places we passed by were restaurants with only seating room.  Brass Tacks is mainly standing room, with a central bar. A nice spot to stop by for a drink after a meal or on a Friday or Saturday night.  They've got all the regular drinks, from beers to sparkling wine to cocktails.", "author": "Aletta B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-26", "description": "A little spot for the beautiful people of Hayes Valley to mingle. I liked the adjustable stools. Good wooden floor. Didn't care for the sleek, stripped down decor otherwise.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "Great place to have a drink after work before hitting the road for dinner elsewhere in Hayes Valley. Amazing decor & a very trendy crowd to enjoy a delicious cocktails and great beer (served in mason jars). I'll definitely be back!", "author": "Juan T. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "You know what Brass Tacks does that I wish ALL bars did?  They print the APV next to each beer.  This is incredibly helpful in helping customers make smart decisions to avoid hangovers.  I mean, of course, other customers... this never happens to me.", "author": "Chloe M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-06", "description": "I am astonished by the number of reviews here describing the barstaff as \"friendly\".  I have frequented Brass Tacks on numerous occasions because I think the decor is stylish, sleek and inviting, the cocktails are delicious and it's well placed in the neighborhood.  \n\nBut every bartender I've encountered here has been the now typical Hayes Valley Trend in shops and bars:  the Rude-I'm too cool to smile, be friendly, warm, welcoming or even say 'Thank You' poser.  To be met with aggro when paying a premium for a cocktail is just not on.  \n\nI'll be only too glad when this current trend of hippishly mod snobbery grows out of itself and the neighborhood returns to a reflection of what real cool in the City actually is:  genuine, down to earth, authentic human beings who treat one another in a friendly, warm, kind manner.\n\nDisappointed for the last time here.", "author": "Casey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "Nice bar. Great place to watch a game - they have 3 TVs. I came to watch the World Cup and they have lots of enthusiasm - even flags for all of the countries are hanging on the wall. \n\nThey also have the spiciest Bloody Mary I've ever had. There are definitely minced peppers in it. \n\nI'll be coming back for sure!", "author": "Desirae E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Very cool bar in the Hayes Valley neighborhood. Stopped in for happy hour and enjoyed a couple local craft beers and the tab was only $10. The bartender was great and their liquor selection looked amazing. They even had some Japanese single malt whiskeys that you won't find in most high end whiskey bars (Hakushu 12 and a few others). I'll definitely be back next time I'm in town.", "author": "Rob S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "My wife and I came here on a Sunday afternoon, great selection of local brews and really nice bartender who knew his beers. Nice interior decor and its clean there wasn't that sour stench of old spilled beer and puke. There are a few nice bar seats at the large window with a nice view of the park. Definitely going to stop by again soon for an afternoon beer or cocktail.", "author": "Wei W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-17", "description": "I'm very happy about a new bar in Hayes Valley, owned by someone who is also responsible for Churchill. There's a lot of similarities between the two, starting with the hip/trendy/industrial/wood/metal/leather lounge look. You know, like the place where you'd go sporting a smart mustache and raw denim jeans that's cuffed. Another similarity are the serious cocktails. The drinks are pretty strong and dressed up with fancy ingredients. I found it to be a learning experience. I had Her Majesty's Secret Service, which was strong and woody. It was similar to an Old Fashioned, but with more to it. I also tried the To Wong Foo and also learned the reference. It was sweet and strong. Any drink with grapefruit flavor is good in my book. I tried the Valley Club with gin and it tasted summery and sweet as well. There was also something called Knife in the Water, which was no cocktail I've ever seen. I forget what was in it, probably an apertif, but it was served in a tiny stemmed glass and looked like a solid amethyst crystal. The Hella Berry Rum Punch was okay. It had a generous amount of berries in it, but it didn't seem all that well mixed. Some berries were added in the end for garnish rather than flavor. The beers on tap were nothing new to me, except the Bockor Cuvee des Jacobins Rouge. It was a Belgian sour beer served in a very small glass. It tasted like liquid dried cherries. The draft Racer 15 and canned Oskar Blues Pale Ale was a favorite among my group. Bartenders were nice and friendly, but also very serious about their craft. They can definitely use more people behind the bar though. This place gets crowded very fast because it's not that big. I liked that their background music is played with vinyl. There are 2 restrooms and a digital jukebox that is placed way too high :(\n\nThis place is also DOG-FRIENDLY!", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "Really nice, chill bar with an interesting beer list and a great atmosphere. It's definitely a good place to catch up with some friends. I came in on a Sunday evening around 7:30 and there were lots of seats available. Only about 8 taps but they were all pretty cool local beers. I'm not sure I would go out of my way to Coke back here but I would certainly drop in again if I'm in the area.", "author": "Kaysee T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "Damn, a smart bartender, Bulleit bourbon, a smashing chandelier, and the best lighting? When a friend said Brass Tacks was a go-to, I knew he wouldn't disappoint. The bartender was so kind, the drinks and cocktails were expertly mixed, and the space is conducive for great conversation, almost teetering at the edge of a lounge with the swanky feel, but without the flashy and almost cheesy glitz. Great for a date, a hang, or for drinks with a good friend. Would love to return.", "author": "Sharon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "I came here for a business meeting. On a Sunday. On a holiday weekend. Weird right? This place was hopping at 4.30 in the afternoon. Everyone was crowded up at the bar area and clamoring for the sunlight that was coming through. So we moved to the back corner where there was lounge seating and plenty of space. As time moved on that got crowded too. Guess I BRING THE PARTAY. bit smaller than I expected as I like the larger space of Churchill that one of the other folks is key in a hear. Ill definitely have to come during a later night where Im not working and imbibe on the many cocktails.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "A nice bar that doesn't take too long to get drinks even when it's crowded. The layout is like a hammer -- narrow through the handle with a couple tables in the back.\n\nI recommend against coming here with more than a few of your people.\n\nEdit: oh yeah they have a bunch of tasteful cocktails. Fun place to go with a date -- you can play the naming game.", "author": "Christophe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "Some of the best cocktails I've had anywhere and the decor is gorgeous without ever feeling over the top. The bartenders are knowledgeable and fun and Matty even went so far as tracking down a hard to find gin at a store downtown so my wife and I could impress friends back in Germany. \nShort of getting rid of the tv's I can't think of a single thing you'd want to change. As near to perfect you could get in the real world. Bravo Brass Tacks!", "author": "Deniz U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "All the cocktails are very delicious and the bartenders are extremely friendly.\n\nI can't think of a better way to describe this, but the decor feels like a Justin Timberlake album cover.", "author": "Nader F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "Great neighborhood bar with inventive drink list...a must if your in Hayes.  Bartenders were the friendliest we came across on our trip and the juke box is stellar...they even gave me a couple free credits (The Stooges, The Devil Makes Three and Cash).  Their take on an Old Fashioned is a pure intoxicating delight! The light fixture over the bar really sets the scene here.", "author": "KC K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "Maybe I'm jaded... I haven't written a review in ages, and at the end of the day, my excitement about Brass Tacks, is based on the question \"Where can I get a drink after work, without a schtick?\"\n\nWorking near Hayes Valley there are plenty of places to get an afterwork but there's always a schtick. \n\nOnly beer or wine... Mostly food... Incredibly pricey... It's outdoors and too cold to hang out... Theme bar with only 20ish seats... Whatever the heck is going on at Sugar. \n\nRemembering Brass Tacks had just opened after a new teammate completed their first full week on the job was incredibly helpful as we could certainly not all fit in the space left at a certain pirate bar was a huge win. \n\nI know that a lot of reviews have remarked how underwhelming the decor is, but who cares when all you want after work is a stiff drink and somewhere to enjoy it?! Joking aside- inside the bar is certainly nice, and I have no complaints- then again that was not a concern on my first visit. Bartenders are incredibly nice and make sure everyone gets taken care of with stiff delicious libations. What more do you really need?\n\nExcited to go back and try more of the specialty cocktails.", "author": "Niki M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-30", "description": "The bar menu is alright, the staff is nice an friendly.\n\nThe interior is very disappointing bc it has NO CHARACTER at all. Very generic and generally meh. \nYes Marlena's bathrooms were old but the place was fun. This place is clean and boring.", "author": "Anjelika P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "Heard about this place because one of my favorite bartenders works here!  Came by with a bunch of friends on a Thursday night and was surprised to find it packed (but not too packed).  Same owners as Bloodhound, it's a really cute place with a great ambiance.  All the bartenders seemed really nice too.  They would come up to US and ask if we'd been help yet, which usually never happens since bartenders like to be waved and shouted at in order to get their attention.\n\nI've only sampled a few of their drinks and they were hit and miss.  The first two I had, I didn't like much.  The two after weren't too bad though.  I'll definitely come back to try their other things though and since it's such a nice, chill spot.", "author": "Jane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-17", "description": "Great cocktails!  It gets very crowded here with a younger group.  I like this place a lot, the cocktails are awesome and they have good beer too.  I think you can bring food in because they don't offer any.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "Great Cocktails , \n\nI had the Best time with my girl there ,  the bartenders now what they are doing , he made  me amazing drinks for me and my girl all night long , even some drinks that was not on the menu , the bar is super cool , amazing selection and  beautiful people ! i love the fact they have  a huge windown for the street ,  if you wamt have fun in Hayes Valley , that is the place to be. \n\nTHE DRINKS WAS AMAZING , FUCKING AMAZING !", "author": "Danilo D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-05", "description": "I visited this bar today and the service was subpar. I came in with a friend from out of town expecting to enjoy a few drinks. Unfortunately, that did not happen. The woman bartender took our orders then other patrons which meant we were first in line to get our drinks, but we were the last to get out drinks AND she forgot our order because she decided to serve other patrons' orders before ours. It was really rude and unacceptable - we felt as though we were not welcome. I would never return there again.", "author": "Lovejoy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "On my last trip home to SF we moseyed over to Brass Tacks for afternoon drinks. Really fun atmosphere and good cocktails. The Rose we ordered was really good, not too sweet and came in a very convenient carafe size to share among us ladies. \n\nWhile it's a small establishment, the wall counter worked perfectly for our party of five. Love the location and the fact that the bartenders are willing and able to concoct the perfect cocktail for your alcohol preference and mood. Recommend for day drinking and happy hour and looking forward to visiting again on my trip home.", "author": "Alexa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-15", "description": "It's boisterous, it's noisy and always feels crowded even when it s almost empty. The flat drywall ceiling does nothing to keep sounds from bouncing around like a game of pong.  The layout is congestion inducing and there are always various people hanging out there claiming to be the owner as part of a ploy to impress the opposite sex.  Maybe they are owned by a public corporation with a lot of shareholders but who knows.", "author": "M S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "Stopped in at 3:30 on a Wednesday for a quick drink.  Ended up sitting at the bar for 5 hours- the regulars at the bar were fun to talk to.  Bartenders were even better.  John (and then Sam) were friendly, welcoming, funny, attentive- can't say enough good things.  And I just told them that I liked rum drinks, and they came up with a unique special concoction to taste each round.  It was very low key when we came at 3:30 which was awesome.  By the time we left at 8:30- it was a scene. Standing room only.", "author": "Aneesha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "If you are looking for a packed bar to stand around whilst you're sweating bullets, this is mayhaps the bar for you. You have to be in that particular type of mood, y'know?", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "I loved the drinks! Everything was very reasonably priced. They allowed our dog Inside and they had treats for him! By far our favorite bar we went too. The bartenders were super sweet! Good place to watch the world cup. Loved the beetlejuice drink! If we ever visit San Francisco again. This would definitely be the place to go!", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "Such a cool atmosphere! Great bartenders, mixes, and chill spot. Although I love spicy Bloody Mary's this one was super spicy. Then ordered a specialty drink and that was smooth. No food except for bar snacks.", "author": "Yen H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-06", "description": "Seriously, people? This bar has disappointed me a few times, but last night was the last time. The bartender was extremely rude to us and our guests. I had a few foreign friends with me who were asking which kinds of rum were behind the bar, and we were promptly told that it didn't matter. A menu was later shoved our way, and when we tried to ask if a particular rum was gold or spiced or whatever, we could not get any help. I am usually patient, but the place was not packed and it seemed like another \"I'm so SF and important\" moment for the bartender. It really sucks to live in the neighborhood and not be able to enjoy a great spot. Ugh.", "author": "JJ F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "It's hard to believe that quite some years ago, this area was kind of sketch.  Parking here might not have been recommended due to probable break ins or theft.  Fast forward to 2013 and now, Hayes Valley is a great place to go to enjoy the outdoor urban market on a warm day and the biergarten with friends on a chilly fall night.\n\nBrass Tacks is what I feel fits the area currently.  There are friendly and informative bartenders, a list of cocktails with interesting names (The Spanish Prisoner, for instance) and a relatively lively crowd.  Signage is subtle on the exterior and interior, the decor is not elaborate.\n\nAwesome place to stop for a drink, although, it can be relatively pricey.", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-27", "description": "BEWARE - One of the bartenders wrote/self entered in a tip on my bill! I know for a fact because I was with a friend, who paid for the tip in cash, while I paid the bill with my card - $35. I usually write in the tip if I do... Anyway, my billing statement says they charged me $40. I tried to call, but there is no bar number, left a message on the website, and no response. Really loved this bar but they definitely will never see me there again!!", "author": "Ann L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-26", "description": "This is a great hidden gem. Very friendly staff and plenty of seating. Even on a Saturday night it doesn't get too loud or full of people. My go-to spot for first dates.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "I came here for the first time last week and forgot to post about it but brass tacks is a great spot with tasty balanced cocktails and a good local bar feel, the bar staff was friendly and knows their stuff about all the spirits behind the bar(and there's a lot of them) \n\n  That's why I'm giving them 5 stars\nKnowledgeable  \nFriendly \nReasonably priced \n\nThis place has it all!", "author": "Duke D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "Came to check out this bar with some friends. I'm happy to have another bar in Hayes Valley. I'll definitely be back.\n\nDRINKS: I'd say so-so. I tried The Conversation and The Secret Service. My biggest problem was that I felt they were unbalance. The Conversation tasted like drinking only rye. The Secret Service was a bit more toned down and I really liked it. But all the rest of the drinks I tasted - overly sweet, or tangy or just something that would be hard after a couple sips.\n\nENVIRONEMNT: On a Saturday night, packed and loud. Shouting to be heard loud over the other patrons and music. There's some seating in the back. Overall decor-wise, it was pretty yuppie standard. Drinks get mixed in lab beakers (which I dislike as it gives a weird feeling of your bartenders not being able to measure correctly).\n\nSERVICE: I'd say the bartenders seemed on top of their game. My friends did the ordering so I can't personally speak to it. But was told they were really friendly. We also had a second bartender ask if we'd been helped (yay for good service). Pretty good about getting empty glasses cleared from tables too.", "author": "Kailyn G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-18", "description": "A good bar with many cocktail options in an excellent location. Not much of a beer selection, but solid options for specialty drinks. Be prepared to likely drink out of a mason jar. A good stop for your bar hop and some local flavor.", "author": "Marcus T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "Nice little bar, super hipster.  They serve drinks in mason jars.  The clientele is fun to watch.  Not a bad spot to hang out before or after dinner.", "author": "Nick F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "It is well known in these parts that Brass Tacks is my headquarters. It has the distinct honor of being my favorite bar in San Francisco. Their dark & stormy is an indispensable part of my Sunday. They stay open late. The people who drink here mingle and talk to each other. There's a pulse here unlike so many of the dull joints that Brass Tacks towers over.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-09", "description": "Been here a few times for cocktails on Friday nights. Its your standard boujois wannabe bar...the specialty drinks were ok but a little steep....not a top choice but ok every once in a while", "author": "Zara S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-09", "description": "Beautiful decor but soulless clientele, horrible service, an almost undrinkable cocktail (tasted like peaches and pickle juice); in short, unfit to be in the same category as the previous bar, Marlena's. *sigh* Now THAT was a bar.", "author": "Trisha F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "Clutch bar in Hayes Valley. Good place to meet friends for drinks for happy hour or before a night out. It can get pretty packed, so I've never stayed super long. Good beers and good mixed drinks. Pretty quick service even when it gets packed. I'll definitely stop back in.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-31", "description": "Bar tenders don't know how to run a bar.\n\nWe were having a going away get together and a drunken patron approached my friend, hitting on him.  He politely declined which made her irate.  He did not want to ruin our goodbye party so he tried to walk her back to the bar, but she kept following him back, shouting at him to our booth.  I alerted the bar tender that they had an over-served patron and she needed to be removed.  He asked her to come back to the bar nicely twice and then just left.  Instead of the bouncer he got her friend to try to convince her to leave.  The bartender just went back to serving other people instead of handling the situation. Do your job man, don't ask her friend to do it for you! The friend had no luck either.  This drunk girl was 100% dug in and continued to berate our friend. We were now 20 minutes into just listening to this chick shout at our friend as he just kept repeating \"I'm sorry\".  I had to flag down a waitress to tell her to do something.  She raised her voice to me warning me, \"I'm handling the situation, can you let me handle the situation.\"  Are you kidding me? You are mad at me while we doing nothing but buying drinks and having a nice party of 15 people.  Also, you were not handling the situation, you were clearing tables until I flagged you down.  The waitress was able to get the pair of friend to leave - back to the bar WHERE THEY CONTINUED TO SERVE THEM ALCOHOL.  \n\nHere's a tip bar-workers, it is illegal to serve a patron alcohol who is visibly intoxicated, and you are liable if you continue to serve a patron and they injure someone.  \n\nThis incident ruined our night.  The staff was annoyed at us for asking them to clean of their mess of getting these girls drunk.  The male bartender was ineffective. The female bar-back/waitress was rude and simply terrible.", "author": "Erik K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-16", "description": "I live nearby and last time I was in here the owner/manager/whoever accused me of paying with a fake $50 bill on a previous visit.  Since I'm in the neighborhood, and very easy to recognize, I have no doubt they remembered who I was, but their story just didn't make sense.  \nI get my money out of ATMs, I never see a $50 bill, real or fake. He claimed 3 bartenders confirmed it was me who had paid with the fake bill.  This is highly suspect because: if they had noticed a fake, why wouldn't they have confronted me then?  It they hadn't noticed it, how would 3 people be able to confirm it was me?  As someone who goes out a lot, I'm at neighborhood bars all the time, it wouldn't really make sense for me to rip off a place that I frequent and that will surely recognize me.  And even if I did, there would be plenty of easier ways to do so: run up a huge tab and not pay, swipe unattended drinks, bring in a flask, etc.  \nAfter explaining all this, he still didn't believe me so I asked him what he wanted.  Did he want me to leave and never come back? No.  Did he want me to give him $50?  No.  So basically from what I can gather he just wanted to accuse me of robbing him, just to piss off a regular customer.  Great.  A+  Way to go.", "author": "Tristan J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-29", "description": "The worst service I have ever experienced in sf. Rude beyond belief . Sunday 12/29 ass holes. I am so angry that this bullshit bar is now in my neighborhood", "author": "Chippy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-27", "description": "This is a really cool bar. My girlfriend and I were walking by and decided to grab a afternoon drink while we shopped. And the beer selection is great. The bartender made my girlfriend a great drink. And the vibe was really cool, they played some good music. I think though we caught it at its quietist. So fellas if you need a drink while the gal is shopping stop here!", "author": "Jesus B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "Came here for some drinks on a Saturday night and had a great time. Not to big of a place and got busy pretty quickly once 11pm came around. The atmosphere was chill and relaxed which was nice. Unfortunately I did not get a chance to try out any of their signature cocktails which they are known for, I will definitely come back again to try some of them out, overheard many people raving about how good they were while I was there. Only thing that was strange were all the creepy dolls they had in the place, guess it added character?", "author": "Josue V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "Fun concept bar added recently to the neighborhood. Very good cocktail program and a strong selection of interesting liquor. Fun and lovely vibe.", "author": "Milan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-04", "description": "I came to this bar for my 21st birthday before heading to a dance club. First off, the drinks I tried were exceptionally good! I had the Beetlejuice which I really really liked, I then went to the bar and asked the bartender some of the flavors I liked and he made me a perfect drink. I wasn't sure what was in it but it's been one of my favorite drinks I've ever had. The only reason I'm giving it 4 stars is because the vibe was a bit  quiet for me.", "author": "Omar M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-16", "description": "This was... a bar. Noise level was wayyy above average, the music was blasting! We had to shout to talk. Most of the tables in the back set kind of awkwardly so you have to sit in a straight line. Not good for more than 2 people. Cocktails were very tasty though. It was fine, I probably wouldn't go out of my way to go back.", "author": "Liz W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-08", "description": "Place is cool inside. Nowhere to really relax.  It's either standing room or tight bar stools.  Very small.   There's other places that offer better lounging environment  in Hayes valley.", "author": "Dan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "Brass tracks is the best bar in Hayes valley. Always a great ambiance no matter what day of the week. The cocktails are mixed to perfection, the bartender John mixes the best dirty martinis, makes great recommendations, and is always friendly. I love this bar. I always recommend this bar", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "Wow! What a great place with a very mingling ambiance. Perfect for the solo business traveler! I'm happy to have met the friendly bartender Kenny who made my night by offering excellent customer service. He always made sure my drink was full and most importantly, that I was happy! I will be back!", "author": "Kara B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "The drinks are tasty but only decently strong. I've had 7 drinks and I'm not slurring or stumbling. If you want a crafted, delicious cocktail, come here to have good conversation on a date. If you wanna get blasted have one drink here and move on.", "author": "Steffen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "This place is what I would call a classy dive bar. It is definitely a divey place, but it features house cocktails, which I have tried, and they are delicious. What I think is really the seller for me and why I dub this place as \"classy\" is that their \"well\" liquor is actually decent. I know this fact because when we ordered tequila shots, the bartender picked up the tequila bottle from the well. I was about to stop him, but the bottle read \"100% blue agave\" and then when we had it, it was actually pretty smooth. In all likelihood, most people probably don't even care, but as a bartender, I am definitely sold on this aspect of this place. Personally, when my friends want to go to Biergarten, I would rather just go down the block and come here... but I am usually overruled :( . However, we always come by here afterwards :) . It's also a great place to hang out if you have just put your name down at Patxi's on the other side of the street and are expecting a 45 minute wait. However, even if you are just looking for a place to come and hang out with some friends, I would definitely recommend Brass Tacks. As I said in the beginning: a CLASSY dive bar.", "author": "Kunal N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-16", "description": "Tried the Stray Dog, which was yummy. $20 minimum on cards. Bar was packed Saturday night, there was more room in the back. The couches in the back were comfty. Nice place to go and have bar conversations and good cocktails.", "author": "Karen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-07", "description": "Popped in here on a Saturday afternoon to check out the renovations to what used to be Marlena's. I gotta say I really like what they've done with the place. Hardwood floors and blown glass lighting give the place a more modern vibe. And they're still dog friendly. Pretty awesome. The bar tenders were nice enough to make us a couple of mimosas and chat while some old school hip hop played in the background. Can't wait to hang out here more.", "author": "Judy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "Our favorite go to bar in Hayes. Delicious drinks, good service, not too douchy of a crowd. And a plus, open window for great people watching...so if you are sitting there and see a couple stalking your spot it's probably us!", "author": "Adina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "I got a summer ale here with a friend. I liked the atmosphere and the weather was a lovely 70 degrees and they had the big window at the front open, which created that kind of half inside, half outside feel. Lots of beers on tap and it looked like they were churning out some fancy cocktails.", "author": "Madeline S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-17", "description": "This place use to be a Gay bar; now it is full of breeders..ugh...", "author": "Joe N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-18", "description": "love this place. \ngreat drinks. i was little shy about the conversation cocktail because of the root beer syrup but it was perfectly balanced, just sweet enough.\nplus, metallica playing in the background. \ni'm sold.", "author": "tinkerbell e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "Cool place, good music crowd is very diverse. Bartenders are on it!!! Their Moscow mule is really good. Cocktail list is top notch. Check it out I recommend it", "author": "Waldo A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-01", "description": "really solid drinks and a great environment.", "author": "Joel B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-02", "description": "Interesting cocktails and nice service, dark ambiance and decent prices. A good place to count on for drinks if you're in the area, but you probably won't find a place to sit.", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-22", "description": "Nice remodel, good vibe. However, drinks were mediocre I thought... tried 3 different drinks, all a bit overkill. I'd come back here for location and the space, but will stick to beer.", "author": "Val J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-11", "description": "Like how my little brother says it in a text, \"KEWL\"\n\nThis place is \"kewl\". Definitely brought in a different type of crowd since they re-opened and change the name of the business. Very trendy, chic and offers wide variety of alcohol. It is nice addition to the area. \n\nPlus good looking people here too! Plus plus", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "This is my spot during the work week. Great selection of drinks, always good music and some of my favorite people in town behind the bar and at the door.", "author": "Alec N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-31", "description": "Great neighborhood bar here in hayes valley. Since i live in the neighborhood its refreshing to have an awesome cocktail bar open up with bartenders who are super knowledgeable and know what they're talking about. Id give the place 5 stars but on weekends its such a mad house becomes so cramped inside that its just hard to enjoy yourself. I'd recommend coming in before 6 on weekends or if you can any time during the week.", "author": "Zino M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "Great chill bar in Hayes Valley...lots of good choices to choose from. The beer selection was a hit. Anywhere that has Stone IPA on tap is a bonus for me. The bartenders were super nice as well. All around this is a great spot to drop in for a drink!", "author": "Ladybird G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-07", "description": "Big window street side. Spartan set of quality alcohols behind the bar. Not your usual tap choices - selection includes Stillwater, a favorite brewery of mine. Nice beats. Hayes Valley keeps getting better.", "author": "Craig L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "Arrive early for a seat in the window!  Especially now that the weather is lovely and the place has become popular.", "author": "Ring Leader D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-04", "description": "Stopped by here for drinks on a late Sunday afternoon. Chill place, well-mixed drinks, nice staff.", "author": "Rowena L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Not really good for a date as the acoustics are not good. However, the unique cocktails are worth it and can make a boring date more interesting.", "author": "Keren R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-04", "description": "The cocktails are great, no doubt. But, as with many \"premium\" cocktail joints across the City (see, e.g., Rickhouse, Bloodhound), the atmosphere sucks so hard that I'd almost pay money NOT to hang out here. Guys, the room is a long shoe-box with nothing on the walls to dampen the sound. Do you REALLY need the music to be that loud? Can't you see EVERYBODY in the place straining to hear one another?\n\nI like cocktails. But I like talking to my friends even better. I live a block away from this place and pretty much never want to go back.", "author": "J M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-11", "description": "I probably need to go back to try the cocktails, but there a decent selection of unique beers available here ranging from $3 standard beers to $10 beers that are a bit more interesting.", "author": "Nik K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-01", "description": "Terrible service. This could be a really great spot - good ambience, etc. But the patrons and servers really don't live up to what they should be. As a local, I recommend against coming here.", "author": "Jessie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "Had brunch around the corner and stopped into this place.  Their cocktails were strong but also had a good beer selection for my friends who wanted a good IPA.  The place is super chill, allows dogs, and has a good vibe to it (at least during the day when I went).  Definitely a cool spot to stop in for a few drinks.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-18", "description": "All was fine (good drinks - good service - good atmosphere) until one of the bartenders decided that the place was too crowded and took my seat away. Literally. She picked it up - declared the location a fire hazard - and walked off with it. We were five drinking adults (with four seats) in an overcrowded bar (see all other reviews - they all remind you that the place is crowded) with two credit cards at the bar. No apologies as I asked for it back - no effort to make it up to us. Just a cold hard stare as she walked away.... Last time I go back until/unless they track me down and apologize. I'll let you know.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-20", "description": "One has to have a lot of style and personality to open a bar that can become a local favorite--Marlena had that. This place just seems like every other place that is opening up. Reclaimed wood; utilitarian, post-industrial stripped down; precisely measured shots in a lab glass (just give it a healthy pour!). The music was good, but incredibly loud, so after awhile we moved venues--it was just too piercing. You have to scream to hear each other. The crowd was very homogeneous, but no wonder given the ubiquity of the design. This place needs to find an identity and integrate itself into the community if I'm going to come back. There's no trace of Marlena or the old place anywhere, which is sad and disrespectful. San Francisco is painting over itself. The service was very good though and the drinks fairly priced.", "author": "Jerry P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "Great ambience, fun crowd, not too loud, and I had an einstok beer for the first time - yummy.  Can't wait to go back!", "author": "Latte Queen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-13", "description": "Delicious finely crafted cocktails. Very friendly service in a great location. Small, charming bar.", "author": "Daniel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "The bar and drinks are great. Generally a good, friendly crowd keeps this place buzzing. Lots of good food options nearby, though they don't serve any bar snacks themselves.", "author": "Vivek s."}
