{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "For a neighborhood place a block from our hotel, it was a solid place to spend a couple of hours. We did not try any games. Bartender (young white female) was very knowledgeable and helpful with the beer and bar snacks selection.  I would like to apologize to her for my husband seeming like he had a problem with our bill - he did not - he's a super sweet dude who has serious Resting Scowl Face. It wasn't you. \n\nA big screen behind the bar played awesome older movies. The music selection was pretty good (later in the evening, it went from being a nice mix of 80s rock and r&b to all r&b. I like both, but it was better when there was a mix of the two styles).\n\nClientele other than ourselves was very young, but not overly loud or impolite or any of the other things young drinkers sometimes are. Everyone seemed to just be having a good time. \n\nBottom line, I wouldn't necessarily criss-cross the city to get here, but it was a great place for \"close by\".", "author": "Haltone H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "A solid arcade bar in the edge of the Castro with lots of retro games, mainly pinball machines, some shooting and fighting games, and a couple random games. The most entertaining game I played here was the Killer Queen game which can have up to ten people playing at once!\n\nThe bar itself is okay, they only serve beer and wine (no cocktails), but the bartenders were really friendly. There's a machine in the back to exchange bills for quarters if you forgot to bring some with you.\n\nGreat place to hangout with friends and relax on a weekend night, especially if you're not looking to go crazy at a bar or club!", "author": "Kedar V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-12", "description": "Located in a modern condo building, Brewcade is a bar with arcade games. Sadly in the Castro, but not a gay bar. The bar serves only wine and beer, with a couple premade/previously frozen food options. The games are fun, but nothing too modern nor too iconic. The games fit the ok to decent category. Some seating when not playing games, but overall a small bar. Service was friendly. Slushy drink was ok but lacked flavor. Some games were broke.  \n\nWould like to see some more food options, more events, and ability to sign up for game play.", "author": "Alan H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-23", "description": "Came here on a Sunday night during our visit in SF, because everywehre else was closed... It's a small barcade with some games, a bar, and a huge tv screen that was playing the basketball game. Chill vibes, however, the biggest issue I had was when we were trying to play the games, MAJORITY OF THEM, DID NOT WORK. I mean it didn't say out of order so we proceeded to insert our coins and then it would \"start\" but then the buttons don't work or the players won't move. It happened to us on a few games and we were too lazy to ask for a refund. Why have games that don't work?? and if they ARE out of order, then put a sign on there so people don't waste their money.\nI obviously wouldn't ever come back and I wouldn't recommend it.", "author": "Katelin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "As an arcade, this place is totally on point. As a bar, it's super meh.\n\nThe game selection is excellent, with some pinball, some classics, some fighting games, a racer or two, and some shooting games. Even though they don't swap games out as much as I'd like, the ones they do have are always in working order. They're also not too busy; there's definitely an exciting atmosphere from the other patrons being around, but you won't have to wait all night to play a game you want.\n\nBrewcade also has Killer Queen! It forces you to talk to strangers, but it's a hell of a game that will entertain you and your friends for hours. It's sort of like a MOBA, I guess, but without the rage that League and Dota are wont to cause.\n\nThe bar is just okay. The beer selection is okay, but nothing incredible. They have wine slushies, which are fun and unique, but again, nothing life-changing. I'm more of a cocktail guy anyway, and they have none of those.\n\nIt also gets bonus points for allowing myself and my mom to bond over old games from her youth, something I've very much struggled to do in the past. So I guess my advice would be to get drunk with your mom here.", "author": "Shawn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "Before the Coin-Op Game Room came here in SF, there's this original arcade bar that has started it all right here at the Duboce Triangle neighborhood. It's called, \"Brewcade!\" Brewcade serves the customers to experience their old school arcade vibes from playing classic arcade and pinball games to endless assortments of drinks from beer to cocktails all night long! The atmosphere is very active and on-going as I welcomed there. The concept is pretty simple filled with a combination of an arcade room and a dive bar; all-in-one. The decors is much modern and dark filled with hanging lights across the whole interior room.\n\nThe employees here especially bartenders are doing a great job for making the customers like me a remarkable and tremendous service despite the busiest environment. No cons.\n\nNow onto the experience! Inside, they have good selections of well known arcade games from Super Mario Bros VS, Pac-Man, Ms. Pac-Man, Galaga, Rally-X, Rampage, The Simpsons, Street Fighter II etc including the mostly popular game, the 5-vs-5 favorite, Killer Queen! Pinball games are still there while entering the front door too! Games costs between 25 to 50 cents. How cool is that!?\n\nAs for the drinks. I did ordered one of their available brewery selections: the Ruhstaller 1881 California Red Ale. While I drank that beer, it tasted quite good for that Sacramento brewery's signature beer. Crisp and refreshing.\n\nIn some occasions, Brewcade has tons of video gaming tournament parties every year, so it's a plus for modern video gaming addicts to show how these participating teams will battle their fate. Fun and mesmerizing!\n\nParking at Brewcade can be challenging to park. You can park at the nearby surface street parking if it's available during peak times. Alternatively, you can ride a bike, walk, carpool, ride sharing or public transportation easier without the hassles and gimmicks.\n\nAll in all, Brewcade is the most incredible and interesting local arcade bar that I've ever visited for the very first time in San Francisco! Perfect for friends gathering! A well received and planning to come back for more! My rating: 4 solid stars.", "author": "William L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "Quite the interesting fusion of an arcade and a beer bar that draws folks from all over. There aren't that many seats here, as the floor space is devoted to games, games, and more games, but the vibe is still boisterously social. There's also a surprisingly good, comprehensive beer list. Service is fast and efficient. \n\nSince it's about games, the vibe is different that it would be if it were simply a bar or a dance club, but there are plenty of those places in the neighborhood already. A welcome hangout and a nice addition to the area.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "Honestly, to truly enjoy this place, you should get there early with a friend or two. On busy nights it gets wicked crowded, which can ruin its charm, appeal and your ability to enjoy it. \n\nThat said, I have an affinity for Brewcade because it's where my girlfriend and I had our first date. We shared a few craft beers which were fun to choose from, since they're largely local and unique. We played the vintage arcade games (badly) but enjoyed every minute. \n\nFast forward to my most recent visit, which occurred during Pride weekend whilst showing a friend from home around the city / Castro. The bartenders were all grade \"A\" cuties, very attentive and friendly with us being two of six or so guests. Working in the industry, it can be easy to take advantage of slow hours - you'll be on your feet all night and day interacting with throngs of people just trying to get drunk so you avoid when you can. I've seen it and I've been there, but these guys were the exact opposite. \n\nWe had wonderful conversations with the guys working and even played a couple rounds of Mario Kart on the projector screen with them. I've always been a fan of Brewcade but this experience really made my friend visiting feel at home, and he raved about it the rest of his visit!\n\nANYWAY, on to the details, and if you skipped ahead I don't blame you. \n\nThis spot serves up really delicious craft beer as well as a few wines on tap and a couple of sugary cocktails. It all fits the theme but I really appreciate their beer list since it's actually quite well put together. Anyway, prices can be a tad steep, but you're paying for atmosphere, fun, and craft beer, so can you really complain? \n\nThey also do video game tournaments and movie nights, though I've yet to participate in either so I can't speak on them personally. \n\nAt the end of the day, I dig this place, but I'll likely avoid it during peak hours and opt instead for a low-key afternoon or early happy hour to truly catch the vibe.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-01", "description": "Went here randomly on a weekend trip to San Francisco and couldn't have had a better time. Perhaps in part to the fact I had amazing friends w me, but overall the venue was great. \n\nFirst off, the service was great. I can't remember for the life of me the name of the bartender and bouncer that helped us but they were tremendously friendly and helpful. \n\nAs an arcade, the place had less games than I was expecting but provides a wide range of classics, pinball, fighting, shooter games, and also a tv to play Mario Kart in (a blast, honestly). They also have Killer Queen, which I thought stole the show for the night. Luckily, we went on a Sunday which is a quieter night, and we had a ton of fun meeting other people playing this game. It was our first time seeing it. It's a fabulous up to 10 player vs. co-op game that lets you meet and talk to strangers and is endlessly entertaining. As for the bar, we really enjoyed the wine slushies, which were pricey for what they were but delicious nonetheless. \n\nOverall, this is a place I could see myself frequenting if I lived in the area, but for now I guess I'll just have to visit whenever I'm in town.", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-29", "description": "THIS REVIEW IS STRICTLY FOR THE ARCADE: \n\nSo I went here with my boyfriend a few weeks ago. It wasn't busy at all roughly around 5pm. There was a quarter machine to exchange your cash, which was convenient. However, although they had a moderate selection of games to choose from, it either didn't accept the quarters I inserted or it didn't work at all. A little annoying, granted I could've used them for other games. Also, it's much more of a selection of retro games, which is cool if you're into that. \n\nIf I were in the area, I'd probably go back later on in the evening and purchase drinks as well to get a feel for the overall barcade. The arcade, specifically, just wasn't as exciting as I had anticipated.", "author": "Rebekah D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-12", "description": "9/10/17\n\nLet's face it, the drinks here suck.  Okay?  Just gonna have to get over that... ..(I got a BC Paloma for $10--don't be me, don't get a BC Paloma.  Just don't.  You're welcome.)  BUT, good thing is they have a pretty decent beer and cider list.  So, if you're not feeling like drinking what tastes like the creation of a club catering to barely legal 21ish year-olds, then do yourself a favor and get beer.  Thanks.\n\nAfter you got your happy buzz, then... then! you will appreciate what this place is really all about--your childhood memories at your fingertips, in your happy childhood delirium you always had then but never knew you had until you had-not.\n\nFor small bills or quarters you buy back your childhood one beautiful death by glorious death at a time... until you are ready to wander out the doors, seeing the world as you once did, full of wonder, ready to conquer whatever the f stands in your m f way\n\n3/5\n\n#arcade #bar #sanfrancisco #beer #pub", "author": "Dean C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-21", "description": "Barcades are always a fun alternative experience to bar hopping or whatever. Also, I enjoy retro arcade games, sober or buzzed. Exchange a few dollar bills into quarters, grab a beer, then enjoy some arcade games (unless it's the weekend and every machine is occupied). If you don't want to play any games, you can always lounge around too!\n\nBeer selections are plenty and the bartenders are very friendly. I was actually given a beer on the house because he claimed I waited for a long time. Frankly, I thought waiting several minutes before ordering a beer is normal but this guy went above and beyond, making my night all the more better (because how can you not enjoy a free beer?). The drinks are pretty standard so it may be best to stick to beer. The main attraction aren't the drinks anyway, it's the overall ambiance and arcade experience.", "author": "Derek T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "There were a few machines that didn't work and kept stealing my date's quarters! :-/  They should fix those... Joust and I forget what other game kept taking quarters. Other than that guess it was ok in hindsight. I'll probably be back. Wish there was a pool table.", "author": "Isabella A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-12", "description": "Brewcade is cool, I went a few times and had a decent time. A lot of the games just aren't that interesting, it's a bit like stepping back in time but to the 80s, when games weren't quite that well developed. If you love retro gaming you'll have fun. \n\nThe positives were the beer list and the wine slushy. Killer queen is also super fun but there are also professional players who drop in sometimes and kind of ruin things for the casual folks. Had this happen both times I went. \n\nOverall, a good place to hang out for a couple hours but I wouldn't make anjigyt of it.", "author": "Enrique C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-30", "description": "I came here on a Friday night and the location is nice but the place was very disappointing. The place is small with limited seating and doesn't have many arcade machines which makes it hard to enjoy. They do have some fun games like Mario kart on the big screen and big buck hunt but it was hard getting on those since they're the more popular games.\n\nAnother negative is the drinks. They are licensed to only serve wine and beer and the one beer I had, blue palm, wasn't good. Their frozen wine slushie is their popular drink and the grape flavor was just ok imo. I like the idea and concept of the place but one visit is enough for me.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-12", "description": "I'd rename it Brewclub instead of Brewcade. There are tons of video games, but on a busy night the games are all being used and it's got the vibe of a club. Lots of \"what did you say?\" \"Huh?\" \n\nGet there early to hang and play.", "author": "Marc B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Quick stop for some pinball action, metal Slug, aero fighters,  and bust a bubble!!  So many old classic games here if you're looking for a fun play while enjoying a nice cocktail or cold beer! Definitely had fun playing childhood games. Also the winter Olympics were on the big screen!  So they have TVs all around to enjoy. \n\nThe bathrooms were clean and well equipped. A big plus for me when going to a bar because I hate dirty and nasty bathroom. \n\nOnly complaint for my short visit was both coin exchange machines were out of order. Good thing the bar tenders were able to us change. \n\nIf you like classic games and want to grab a drink, I recommend this place. Definitely fun with a group too.", "author": "Lucy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Small, old but fun place. Few machines were broken but loved the wording board and the plays were not expensive. Perfect for team building!", "author": "Anya C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "A blast from the past for game aficionados. An awesome place to get together with friends or even by yourself for a quick game or two on retro arcade games. Arcade games take quarters, and of course Brewcade has a change and ATM machine convenient. \n\nI love the decorations, the magnetic wall, and their beer selection. Bartenders were on top of all orders and I never had to wait more than a minute for some assistance. \n\nIf you want to rent their locked up games or their wii all you have to do is check in your ID. Simple and effective way to keep track of their games. \n\nFood can be ordered on your phone from the restaurant next door. The secret food window by the pinball machines is awesome haha. We ordered two sides of fries and they were ready within ten minutes. \n\nFriday night we reserved a section for a birthday party from 6-8. When we first arrived Brewcade was quiet, but between 7-8 it became a full house quick!", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Threw a goodbye party here. Brewcade has lots of beers and some mixed drinks. They also have a respectable amount of games, especially for the size of the venue including: pinball, classic side scrollers, and even a 5v5 game. I think this is a casual hangout place, great for dates, get togethers, etc., but it gets a bit loud sometimes. Brewcade now has food too, I didn't get to try it though. It's my go to arcade bar.\n\nService is really nice. You can book tables ahead of time and it's free, but they require a credit card, which they will charge if you don't show up. It can get kind of busy later in the evening, but it's pretty low key before 8.\n\nFavorite beer is the:\nhef", "author": "Sean W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-29", "description": "Very cool spot! Lots of beer and mixed drinks selections here! It's also an awesome place for a date spot. \n\nThere's a  good amount of old school games here from the Simpsons to mortal combat to even pacman! There's even pinball machines!! \n\nI would definitely come back", "author": "Caitlin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "Good selection of beer on tap. A good amount of arcade games. Reasonable price. Super Smash Bros competition on the big tv. \n\nIt wasn't overly crowded on a Saturday night so my group of friends were able to enjoy ourselves at the tall tables. I appreciate that they have water on tap to the side of the room - lessen the hassle of having to ask for refills and good for preventing super drunk customers (maybe). \n\nI would definitely come back to this spot over the other arcade bars since it's a little less crowded.", "author": "Chariya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "Stopped by to kill an hour or two with a few friends the other day.  This place is pretty cool - they have a wide selection of beers and drinks, and they have a bunch of cool arcade games (ie. pinball, racing, shooting games, whack-a-mole).  I ordered a white belgian ale and it was solid.  The drink ran me about $8 including tip during happy hour, which wasn't terrible, but this also wasn't the best happy hour I've been to.  Their deal is $1 off, which is a pretty low discount compared to other places.\n\nService was great, and they also have a giant screen that you can use to play MarioKart on with your friends!", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Killer Queen!!!!!!!!!!!!!!!\n\nOmg you can spend hours here screaming in excitement/joy/angst\n\nThe teamwork and competition is REAL.\n\nIt's always going to be a fun night,  I personally like coming later on days where it's not league night so I actually get a chance to play", "author": "Tina A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-07", "description": "After having dinner nearby, my group of four wanted to do one last stop. After walking around, we decided to check out Brewcade on Wednesday, January 25th around 10:15pm.\n\n*Anchor Steam: Anchor, SF, CA, 4.9% ($6)\n*Witless Zombie Witbier: Blackhammer, SF. CA, 5.5% ($7)\n*Mondo Pils: Temescal, Oakland, CA, 4.8% ($7)\n*Boylan's Diet Cola \n\nI got the anchor steam as the giant colorful menu was a little overwhelming at first. I basically just picked the first thing that looked familiar to me. Although, thinking back, I probably should have gotten the witless zombie as I normally prefer Belgian whites. They didn't have mondo pils on tap, so my friend just got a can.\n\nWe walked around for a little bit to check out the games. They definitely have some throwbacks for me such as Paperboy, Street Fighter 2, etc. They also had a row of pinball machines. The most popular game seemed to be the Killer Queen. I didn't play it as there was a huge crowd in front of it, but I guess they have tournaments every now and then for that particular game. In the end, the four of us just grabbed a round high top by the window and chilled while we finished our drinks.\n\nFun place if you want to play arcade games while drinking. Not the biggest selection of games I've seen, but still a decent size. Next time, hopefully I'll play one of the games. I do miss going to the nickel arcade by my house back in the day. Definitely a little nostalgic.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "Cool spot, though we weren't able to play any games because we didn't have any cash and the Chase atm next door apparently closes at 11pm.\n\nI had the peach wine slush and it was sooo good. But also $10.", "author": "Ellen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "Came here for a work outing! It was nice being able to make a reservation and have our own designated table area. \n\nHave you ever heard of a wine slushee?! Neither did I! This is the first time I had their Grape Drank aka wine slushee. There is multiple flavors like peach, watermelon, orange and OG and strawberry. I had the peach one, but I was disappointed that it was just original flavor with peach syrup. I did like they have a sparkling tap you can get yourself! Beats asking the bartender for water!\n\nI played a couple games like Pac Man, pinball, Deer Hunt. Very chill hang out spot!", "author": "Frances K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-11", "description": "I came here to meet up with a friend. I didn't get the opportunity to play any of the arcade games, but by glance there seems to be a good variety. I noticed a few classic and popular games, as well as some shooting games. They also have a good number of pinball machines.\n\nAtmosphere was chill and lively. Staff was cool. There is plenty of beer options and other fun beverages like the Grape Drank. Parking was surprisingly easy and there were a fair amount of seating.\n\nOverall, a fun and laid back place to hang out and grab some brew. Love the concept. It's worth checking out if you're in the area.", "author": "Julia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "Small bar with some classic arcade games, that also holds weekly video game tournaments on the big screen. Ben, the bartender, introduced me to Gose style beers and they are my new jam. I described desiring a glass of wine, but being at a beer place = gose. Had the blood orange (local) last week and it was great. They always have a good selection on tap & food is right next store if you're hungry.", "author": "Alexa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "Gaming arcade + Beer. This is a very interesting concept and appeals to a large group of ages. \n\nIt is accessible from the 16th and Mission Bart stop but is a slightly long walk or short uber ride from there. The bar itself has a wide list of beers which include IPA's, local brews, etc written up on a big chalk board at the bar. I tried the Temescal brew and that was not bad at all 6/10. The beers range from roughly $5.00 per glass and $28.00 approx for a pitcher of beer (5-6 glasses). \n\nNote : You need quarters to pay the games. You can get these at the bar itself. \n\nAlso they offer a free taste of the beer before you get it so just ask. \n\nI am personally not a big gamer so I wasn't able to appreciate that part of the experience and felt that the bar overall is only meant for those interested in that to at least some extent. The beer was not bad and prices were good ( comparable to other bars) \n\nFor me this is an ideal pit top on a bar hop night but not to let this be the only place you go to. It's also too loud to talk so sit and drink is a no no. The accessibility was also slightly an issue for me. \n\nThe staff was very friendly and the bathrooms were decent to use too. I recommend it to people interests in gaming and beer on a decent budget.", "author": "Shivani B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "Brewcade is a fun, albeit a bit small, bar/arcade located in the Castro. We came by on a Saturday afternoon and had a relaxed, fun time.\n\nTHE OVERVIEW.\n- Parking can be a pain, but that goes with the territory of the neighborhood\n- Good assortment of arcade games, including one that works best for large groups (so make a friend!)\n- Coin machine available for anyone whose last quarters went to parking\n- HUGE assortment of local beers, and a few solid in-house cocktails available, averagely priced\n- Limited seating, but most people are playing arcade games anyways, so who cares!\n\nThe offerings at another bar-cade in the city are better, but this is still a solid place to kick back and unwind.", "author": "Claire S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-05", "description": "This place gets a 3.5-4.0\n\nBig fan because of the booze and video games but unfortunately many of the arcade games were not working when I was there. \n\nI love the idea of this place but wish they had more space. I know it is SF but wish they had more space and more games (wishful thinking).\n\nI will definitely be back though for some good old nostalgic fun.", "author": "Derek F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-05", "description": "Cool idea.\n\nA lot of the games are pretty old school and they are all well played, so some of the joysticks and buttons are not as crispy as they could be, but it was fun coming in here and playing a few games before heading out for a night on the town.\n\nI got slaughtered a few times in Capcom vs. Streetfighter, played some tetris, then called it a night since we couldn't get on one of the shooter games.\n\nThey had a full bar there, but I was stuffed from dinner and had no space at the time.\n\nI'm not up on killer queen, but supposedly it is the $#!t.  There were a bunch of guys going crazy over it and celebrating hard after victories.  I guess they have competitions on certain nights.  I'm going to have to do some research and see what this game is all about.  I can't believe I've never heard of it or seen it before.\n\nIt is definitely worth stopping by.", "author": "Ty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "Stumbled upon this place while walking around SF. I'm glad we found it. Games were about $0.50-1.00 to play, many two player games. Sometimes the machine would eat my money, but it wasn't worth complaining to the staff about. That night there also happened to be a Super Smash Bro tourney. Overall, a great atmosphere if you're trying to drink, have fun and reminiscence on the past.", "author": "Katie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "This place is so much fun! Went for a date night and only spent 20$ for about 3 hours, we played pretty much every game we wanted to. A lot better of a deal than a Dave and Busters and waaaaay better games. It wasn't too crowded on a Sunday night. The frozen wine is really good, and you can get it sweeter to your preferences.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "Love this place. Awesome beers, great arcade selection. No bad vibes. They have Killer Queen, done deal.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "Love the concept and staff!! Great selection of beer and everyone was super friendly. I went on a Friday at 7 and found a great spot for the 4 of us. The bartender was attentive (Ellie was great). I think I'd like to go on. Not so crowded night to play video games", "author": "stephany m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-17", "description": "This is the best arcade-bar in SF if your main focus is to play games.\n\nArcade games are cheap.\n\nDownside is this place gets CROWDED. \n\nThey have a large beer selection (with sours!) and they bus tables super fast. They have self serve water and sparkling water! \n\nExpect this place to be insanely crowded to the point where there's no where to sit and barely enough space to stand without getting touched every 5 seconds by someone passing by.\n\nI probably wouldn't come back here but I'd recommend others to check it out at least once!", "author": "Leah A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-05", "description": "So they don't serve hard alcohol which was a bit disappointing. They had plenty of beer options and unique ones at that! We got a mango beer which was pretty tasty! \n\nParking wasn't too bad and we found some pretty quick! The place itself had a good amount of seats considering they had a lot more games then some of its competitors in the area. \n\nThis personally wouldn't be my first choice for the \"barcades\" in the area but is definitely a gret spot to check out!", "author": "Chantal Noelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Came here for my birthday and it was a blast. Only beer and wine, but that was perfectly fine for me. Loved that they had change machines and lots of retro fighting games (Street Fighter, Marvel vs Capcom, etc.). Bathroom lines were reasonable and there's a free water bar. Good selection of pinball machines and other games as well. Reminded me a lot of Ground Kontrol in Portland. Absolutely loved this!", "author": "Evonne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "I've heard that this place can get pretty crowded but on a Sunday night at around 9pm you have free reign of the place! It's not a huge place but they probably have 20+ machines of all sorts of arcade games (classic, sports, driving, fighting, pinball, etc.). I believe you can also ask them for a console to play Mario Kart on. I'm not sure how that works as we didn't do so on this occasion. I could see how on a busier night you'd have to wait if you don't feel like playing with strangers. There also isn't much seating so if you're hoping to leave your stuff at a table and play, that might be harder to do.  \n\nIt's a really cool ambiance with the lighting, decor and the sounds from the machines. It'd be a great place for a date. \n\nThe only thing is that some of the machines are a bit older and not completely functional. You may have some quarters eaten here or there, notice some calibration errors on the pinball machines or find that a few buttons on the machines don't work. Overall it's not a huge deal, just wish there was a little more attention paid to this (maybe a warning label for the controls that aren't working).", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-16", "description": "Such a cool spot. From a date to hanging out with friends. I came here for the first time this passed Saturday with one of my friends and I had a blast. I love that they have some of my favorite childhood games. Puzzle Fighter!!!! I can play that for hours. Wish they have mario kart, that would totally be awesome. .50 cent per game. They have this game call KILLER QUEEN, 5 players per screen/team and compete with 5 others. I think that was pretty awesome. \n\nThey also have board games. They ask for your ID to keep whiling you hold on to the board games. The beer was slightly overpriced. 2 beer for $15 x 3 that night. But staff was friendly and TONY was awesome, very helpful.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "Brewcade is a fun place on the edge of the Castro to chill out and meet people. It's something of a geek's paradise, whether the geekery is for video games or beer.\n\nThe staff is friendly and helpful, and the prices are about what you would expect for a mid-Market joint.", "author": "Philip J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "I love the right idea of having both the bar and the arcade in one place.  That way, it'll be better to play the arcade games if I barely communicate with any strangers whenever I sit between them.  I was about to have a drink first before I walked towards the arcade behind me.  I asked the bartender if there is at least one non-alcoholic Spritzer.  Then he said there are two choices: bottled sodas or a kombucha.  So I settled for a kombucha and watched the big screen.  Of course, I'll be ready to buy a glass of wine or beer on my second visit.  Anyway, I had to finish up my whole glass so I can play the arcade.  No need to pay again for the refill.  I'll do that if I have enough time and money to burn.\n\nLet's see!  Marvel vs Capcom?  Joust?  No coin holes for Whac-A-Mole, but I did indeed scored 160 points back in Museé Mecanique.  Superb, non?  Perhaps I'll go for Killer Queen.  I chose the blue side of the two large arcade machine.  I wasn't here to score to win.  I was testing the controls after putting four quarters.  That's how the game works.  Well, I'm glad I had this much fun on my first visit. :D", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "The perfect bar for the inner man-child in you. Brewcade combines nostalgic video games with a good selection of craft brews. \n\nLike any arcade, your money can go fast here as you move form machine to machine... even faster than your bar tab. Still it's lots of fun to see old faves like Street Fighter and bubble puzzle here as well as reliable pin ball machines. For me though, I'm more impressed with the selection of beers on tap. I tried a couple of brews that were new to me including the cheekily named New Kids on the Hop and the Ascender IPA. The bartender was friendly and answered the questions we had about the brews. There's also a decent amount of seating if you're not wondering around the arcade games. \n\nIt's a fun atmosphere. Good beers and the lively ring of arcade games around you make Brewcade a fun spot to start a night of drinks in the Castro.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "Great bar arcade .... where adults can play games like kids haha ... TONS OF BOARD GAMES what I call the rentals (give them your ID) just don't forget it.  \n\nFirst time visitor and will becoming back. Good choices on beer and cans. Decent location (although I'm new to the city) \nPretty decent size building odd layout they cramp the bar a little but people manage to move around. \nFew of the arcade games didn't work and there wasn't a sign to keep you from putting your money in.", "author": "Angelina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Brewcade is my go-to stop for good quality craft beer and incredibly friendly service. Brewcade's beer list is extensive and even includes a few wine cocktails that are quite good! Try the frozen Grape Drank with the strawberry wine added! Really hits the spot. The beer list is constantly changing and the beer buyer does a good job of keeping things exciting and new. Their bartenders are knowledgeable and have never led me astray with their suggestions. \n\nThere are a ton of arcade games and some pinball machines to play. They are well maintained and on a semi-regular rotation. Recently Brewcade got a competition grade Big Buck Hunter HD machine, which is a blast to play.\n\nUnrelated to the beer or games but something I appreciate is that there's usually a really diverse clientele at Brewcade, something that's not always the case at bars in SF.\n\nAll in all an excellent bar that is worth putting into your regular rotation!", "author": "Mikhail B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-09", "description": "The owners need to address the lack of hospitality and tact with the male bartender working yesterday afternoon.  The female bar tender, while not friendly or inviting, at least got our drink order together.  The male bartender appeared about 40-50 minutes later - I was sitting at a table repacking my backpack when he took my water bottle off the table.  When I told him it wasn't trash he brought it back over and stated to get rid of it because outside beverages aren't allowed and walked off.  Note - this was the first and only interaction with this guy.  Regardless, there is a way to interact with people and treat them with respect.  Especially guests in your city.\n\nSecondly, there were many games, however, close to half of them had notes describing how to get around the menus.  Several of the game consoles appeared to be unauthorized knock off's.  The pinball selection was pretty good however I paid $2 for 3 plays on one of the machines, as advertised, but it only gave me two games.\n\nAfter the manager contacted me and assured me he addressed the issue, I change the star rating from 1 to 3.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Awesome drinks! The bartender was super helpful when me and my friends were picking our drinks. Her recommendations for the sours we're dope  and the classic games are dope too", "author": "Devon J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "This was such a fun bar! They have water taps for you to serve yourself to stay hydrated in between brews, which I find genius. The magnetic letters on the wall were a great touch.", "author": "Samantha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "This is probably my favourite arcade bar for the ones I've been to in SF. It's a casual, divey-feeling bar with good drinks - I particularly like the peach grape drank which is frozen white wine with peach syrup. They don't serve food, but I've seen people come in with outside food on occasion, with no issues. There are lots of arcade games to play (lots of classics!), though the one I probably spend the most time on is Killer Queen, a 5v5 game in the corner of the bar near the entrance. It's definitely a game that attracts people to Brewcade since there are twice weekly league nights (one for serious players, and another one that's a casual meetup). The only thing they're missing is my favourite game, which is Time Crisis, but fingers crossed that it'll just show up one day - you never know :)", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "If you are looking for a fun time, I'd say come to Brewcade to kill a few hours or to spend the night playing games. They have a large bar along the side but if that is not your scene, there are old-school and new-school arcade games throughout the space. They also have a number of themed nights that allow you to easily meet up friends for a fun time or kill a number of hours prior to another event. (aka a good pre-game spot) With the number of arcade games around the place, I'd have to say that the most appealing and more popular is the Killer Queen arcade game. They even have leagues for the game which allow you to bring your own team or meet people there to build a team. Pretty good way to be oober excited to gather berries and kill the queen. I came on a Thursday evening so it wasn't as poppin' as I would expect this place to be on other nights but I can expect this place to be extremely crowded on weekends.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-27", "description": "This place has a great location and awesome beer selection. We live a few doors down and have stopped in to grab a cold one a couple of times. Would have rated a bit higher but I'm not a big gamer in general.", "author": "Wade W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-12", "description": "I've only ever come here after work on a Thursday or Friday, so this review is for being there are those times. \n\nHere's the breakdown of how Brewcade earned its stars:\n+1 star for having KILLER QUEEN. Addicted.\n+1 star for having Buck Hunter. I like big bucks and I cannot lie.\n+1 star for the bartender that helped switch the TVs to the Warriors game when we requested. Thank you! \n+1 star for the large selection of beers, and yes, you can get some of them by the pitcher FYI.\n\nIf you're not occupied with playing games though, I can see how this might not be the best of places to hang out at. Music is loud and hard to talk over, and the lighting can get a bit much. It's not always my thing, but once in a while... All in all though, fun spot. One of those places you might start your night at. Find me at killer queen or buck hunter hehe", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "So glad I found this little gem of a bar in SF! I've never been to a bar/ arcade (or barcade...lol) and this was a cute little place for that introduction!\n\nThey've got a wii for up to 4 players (for those modern gamers), tons of older arcade games with favorites such as Pac-man, Galaga, Street Fighter, Super Mario, etc. along with themed pinball machines, and even a newer up to 10 player arcade game! Each arcade game is $0.50 per credit and they've got a cash to quarter exchanger! There are high scores for each gaming area at the top of each game so if you think you've got what it takes to be at the top, go for it!\n\nThey serve draft beers and cans, as well as wines and cocktails. Pretty good selection for beers and they've even got a little book for more drinks and bar bites! Happy Hour is Mon- Fri from 4-7 pm, with $1 off drinks!\n\nOnly con I'd say is there isnt much arm room when playing games so it's tough, but it's a fun experience! Brews, don't lose- try this place out!", "author": "Mary F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-17", "description": "Very nice people.  Bartender is very friendly and the crowd is  nice.  The issue I have is with the quality of the beers.  Love they carry craft but the ones they had were just okay.  Will give em another chance and update this review accordingly.  Selection of games were okay but would be nice if they rotated and had new ones from time to time.", "author": "avi a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "This place is awesome for a date, or groups of friends! They have tons of old-school arcade machines,  new school, pinball machines and Gaming consoles that you can use on the big screen on the wall! And the bartender Joe, is really awesome, has a great attitude! Thanks for an awesome experience!", "author": "Marty M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-12", "description": "Super fun and engaging idea that doesn't fully pull through because of the limited space. This is one of the few places that has Killer Queen, which is a super fun, multiplayer versus game. It fits 5 people on each machine at a time so it engages a large group of players and also spectators. The pinball machines are in pretty good conditions. They have Demolition Man, Spider Man, Ghostbusters, Adams Family, and Game of Thrones. This is a pretty diverse set of machines in one place. I would come here just for the pinball machines but not at a busy time. Spider Man played pretty slow, which is great for warming up and feeling good about yourself.\n\nThe main issue with this place is how crammed it is. Granted, I came on a Saturday night, but the space itself is just small considering the room you would need for this type of establishment. Compared to other barcades I've to, this is definitely one of the tightest. It's hard to fully enjoy yourself when you keep having to get distracted by people trying to get through. The bar area is pretty small and there's basically nowhere to sit. \n\nPositives:\n+ Killer Queen\n+ Good variety of pinball machines\n\nNegatives:\n- Crammed space\n- Hard to find parking", "author": "Angie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "This place is awesome. So many childhood memory games here and good selection of beers. The owners are extremely friendly and welcoming.  The place is pretty small but filled with character. It's actually well lit and theres parking across the street. \n\nThere's outdoor seating, plenty of games, and beautiful decor. This is a great place to celebrate a friend's birthday, and I'll definitely take my friends here for their 21st birthday. I highly recommend trying Killer Queen! It's extremely addicting and fun to play with a group of 5 or more. \n\nDon't go to any typical bar in SF. Go to Brewcade!", "author": "Sandra N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "Cute little spot in SF. It's a pretty small space so I couldn't imagine going with lots of people. There were pinball games, some arcade games, a couple of driving games, and whack a mole. I was super disappointed that the whack a mole only took dollars. Bummer.", "author": "Arelys V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "A great selection of brews and the games are great! Happened upon the place when wandering with a friend and it was a great stop.", "author": "Faridah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "arcades and beer! \n\nWalls are lined up with old school arcades, like the simpsons, street fighter vs capcom, rampage, metal slug, time crisis, and super smash tv-- all great multiplayer games providing an opportunity to bond, yell, and cheer in victory. i grew up playing these games with my brother so i was able to hold my own against my colleagues ;) The games take quarters, but the have a change machine on the wall\n\nKiller Queen is probably the best game to team bond, giving u an opportunity to go 5v5. It plays like Joust, but with some strategy involved. Grab a beer and let loose!\n\nThere are flyers on the walls about video game tournaments, like Golden Eye (!!), and movie nights. \n\nBeer selection is decent. But the combination of alcohol, arcades, and great company is what really seals the deal for Brewcade", "author": "Eliza T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-24", "description": "Oh Brewcade, I want to like you more. If you would just buy some acoustic tiles and bring a bit more charm to this space, you will be 4.5 stars. You have a great, if overpriced,  beer list.\n\nIt's hard to make new retail construction charming, I realize, but I feel like you can do better. Please bring some sound dampening and some other comforts to your space. \n\nLove, \n\nA patron.", "author": "Shanan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "Pros: Good variety of drinks at a reasonable cost. They have board games, retro and new arcade games and enough searing for those who want to chill. Patrons from all walks of life and are cool. Overall, good vibe and atmosphere. \n\nCons: One bartender liked to tease and was somewhat unhelpful, the other was on his game. \n\nIf you go, def use to Super Mario because it's a CLASSIC.", "author": "Laurisha C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "I don't leave many Yelp reviews, but this is one of my favorite places in SF and deserves a great one. \n\n\nPro tip #1: \nStreet fighter machine has 500+ retro games (Hold 1P Start button!). Includes:\nVs. series - up to Marvel Vs Capcom\nLots of fighters (KOF, SF, Darkstalkers, etc) \nMetal Slug(s) - special version has extra ammo/bombs.\nSimpsons\nTeenage Mutant Ninja Turtles\nX-men\nPuzzle Fighter\nTetris/other puzzle games\nMegaman titles\nSuper Mario Bros (Pow button one. Near end of list) \nOriginal Mario (Near end of list)\nBubble Bobble (Near end of list)\n\nPro tip #2: \nIf the machines are broken in any way, let the staff know. They don't play the games since they're working... so they won't know if no one tells them. The bar takes very good care of the machines when they know about the issues. \n\nPro tip #3: \nHands down best game is Killer Queen. No more league tournaments on Wednesdays, but there is a casual meet-up that day starting at 8pm. Everyone is super friendly and encouraging, and they like to teach people how to play. Good night to show up if you want to \"git gud\" and whoop your friends when you come back.\nJoin the FB group for more info on KQ mixer/team tournaments, league, and events: \nhttps://www.facebook.com/groups/KillerQueenSF/\n\nEdit- Pro tip #4: They have a Wii U with wireless controllers for the big screen(s).", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Killer Queen.  That is all it takes for a 5-star.  Brewcade has one of the eighteen Killer Queen arcade machines in the country.  I had no idea what Killer Queen was when the night started, but noticed a lot of mentions of it in the reviews.  We had hours to kill due to an early morning flight and this place stuck out.  Once we got there I saw the 10-player cabinet and eagerly waited for my chance to play.\n\nEventually I had my chance to play with some strangers.  It was a blast.  Easy to pickup, but insanely difficult to master.  The team I was on went back and forth with wins until a new group stepped up on the Blue cabinet.  We mercilessly destroyed them game after game, up until this insane master player joined their team.  Once he joined we got killed over and over.  He was hardcore coaching his team and none of us had any idea how to counter.  We won a few of the following games, but it was crazy.  After a bit some people had to leave and master queen ended up playing 3 vs. 1.  It was wild.\n\nI haven't had this much fun playing a game in years.  It was amazing and a great social experience.  The rest of the place seemed pretty awesome as well, plenty of variety in arcade games for you to play.  I don't drink, but they did seem to have a decent lineup of drinks for those that do.  They also actually had a really good lineup of non-alcoholic drinks as well.  \n\nI wish there were more places around Salt Lake that offered things like this.  I would come here multiple times a month if something like it was near SLC.  Come for the Killer Queen.  I am watching Youtube videos of Killer Queen while I write this and am looking forward to the next time I can play!  Brewcade has risen to a must visit in San Francisco for me now.", "author": "Curtis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "The ultimate business idea: find what people liked as kids and mix it with unlimited amounts of booze. Thus Brewcade was born. Craft beer + arcade games = what can go wrong?!\n\nBeer selection is truly immense. I tried couple of sours, because heck, this is what cool kids drink these days. And of course barrel aged stout. Delicious!\n\nWe obviously had to play Killer Queen. This is arcade gaming at its best. Up to 10 players in two opposing teams. They have competition night every Wednesday, when you can play for free.\n\nWhat was tad confusing is that some arcades had different games that what was advertised on the machine. For instance, we wanted to play some good auld Street Fighter and we ended up playing Yet-Another-Space-Invaders.", "author": "Jakub S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "Such a fun and relaxing atmosphere! I love that I can go here after work and enjoy a brew with some friends while playing some pretty cool video games. Highly recommended!", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "Brewcade, one of twelve Killer Queen hives.\n\nThe only arcade game that matters is this awesome 10-player game called Killer Queen. If you go to killerqueenarcade.com, you'll see that this game is only available in 12 locations nationwide. The game is a bit confusing at first because it has a good number of moving parts, but anyone who looks competitive will probably be able to explain the game to you pretty quickly. Unspoken etiquette is that if your team is losing too often, other people can tag in. Tournaments are held Wednesday evenings, which, for n00bs like me, are the nights I need to avoid. Until I become the Killer Queen master, that is. In 2050.\n\nAside from Killer Queen, Brewcade is known for their $10 GRAPE DRANK, which essentially is a wine slush. Though it's sweet, it's quite sour, so I'm not a big fan.\n\nNo cover fee but you're carded at the door. Come for Killer Queen, stay for Killer Queen.", "author": "Adele F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "If you're looking for some low-key fun on any random night, this is it.\n\nAnd anywhere I can imbibe and play a video game at the same time is all good in my book :)\n\nSit at the bar, lounge at the table, or just carry your drank around the joint. Open until 1am, and not to mention, Brewcade is just down the street from me!  Life just doesn't get better. Wine pours are standard, and the list of reds isn't too long - just a Pinot and a Malbec.  But hey, either does the job :)  \n\nAs far as the games are concerned, the selection is pretty decent for such a small space.  A few pinballs, a car game, some shooting games, and a few classics like Paperboy, Super Mario and Ms Pac Man.  Let me tell you, I can play the car games all day.  So the fact that my victims can sit in the seat next to me and get beat is enough to wake me up in the middle of the night. \n\nThe only reason I can't dish the 5 is because the machines do sometimes suck your quarters without giving you the game.  \n\nOverall, it's a fabulous place for a date - or better yet - bring a group of friends and get down with some ol' school fun :)", "author": "Angella S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Got to finally check out brewcade, great arcades and lots of fun drinks for people. Played some Mario Kart on the giant wall and checked out Alien vs. Predator arcade machine.\n\nA guy dressed as RAIDEN showed up to play games, 'ppreciated it.", "author": "Colin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Friendly, no bullshit kind of place. They've got a few large screens, including a giant projector screen behind the bar, that are usually playing sports (I've come in for Warriors games - fun crowd, generally pretty well attended), something goofy like vintage Wrestlemania, or whatever the video game tournament of the night is. \n\nThe games are definitely front and center here - plenty of pinball, retro arcade games, and a couple more competitive, newer games, Big Buck Hunter HD and Killer Queen, both of which see tournament play at Brewcade. They also run some other semi-competitive nights with prizes, stuff like Mario Kart on Wii U, which is free to play if you're having a beer.\n\nWhich is the other part of the equation. Solid beer bar, lots of taps (never counted, but 20ish?) and lots of bottles, including standard staples and some oddballs, including some tasty probiotic ciders and sours. No liquor, as mentioned elsewhere, but I've never gotten bored with the tap list. \n\nI've always found it to be a friendly place that knows what it's doing and does it well.", "author": "Thom B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "This Place IS GREAT!\n\n10/10 - Beer Selection\n10/10 - Games\n10/10 - Community/Bartenders\n\nIf you want great beer and to play some arcade games in The City, this your best choice.\nTry the wine slurpee thing it's awesome and does the trick ;)", "author": "Matt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "I came back here recently and there was no urine odor.... so I must have had some really bad luck my first time here!  Had a great time playing Buck Hunter and many other awesome games of my youth.  Also very much enjoyed a bright blue house cocktail made from something I would have only drank in high school.  Sweet spot!", "author": "Tracy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "This place is awesome as advertised- Brew (ie..BEER) - Cade (ie Arcade games) so it confuses me when other reviews go on about their meh cocktails, lack of space and few arcade games... Need I remind them it's San Francisco- so if you were expecting the # of games of a Dave and Busters and its size, then please go right ahead and take yourself down to Daly City, the local folk will not miss ya, and you can get all the shitty drinks of your dreams. \n\n     Now for those that actually appreciate the vintage arcade games of their childhood, you will not be disappointed in the selection (which rotates), favs of mine include Street Fighter, Donkey Kong,   Paperboy, and of course the 5 pinball machines they stock. They also just got a badass new Big Buck Hunter that is so addicting. The atmosphere is lively, relaxed,  and especially fun during sports games (which are on the bigscreen), and its great as a meet up for afterwork drinks as its pretty centrally located in the city, and easily accessed on Market Street. \n    Now for the BEER! Here they excel- by always have a rotating selection of new and inventive local craft beers I get a great sense of what are local brewmasters are creating these days. They always have something for the IPA drinkers, usually 4-5 to pick from, and sours that I cant seem to find at other places. If you're curious, and the menu seems overwhelming, chat it up with the bartenders, they have great recommendations, and always ask if you want to taste if you're wavering on your choice. Also they have wine, but get a beer (death and taxes, please!)\n\nThey welcome dogs- so rad. \nThey let you bring in food, or get it delivered when the drunchies strike- rad again. \n\nBrewcade is always on my rotation and there isn't any place like it in the city. Just go!", "author": "Chelsea J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-11", "description": "Great idea, needs some work in execution. I want to really like this place but the awkwardly configured space, average mixed drinks and surly to indifferent staff (maybe we caught them on a bad night but not too friendly) will make this a pass for the next year... will check back in after that to see what's new...", "author": "Kate A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Why is this place only 3.5 stars? It's a good bar with nice bartenders, good beer selection and GAMES! I love any bar that has something extra to do, really pushes it over that 4 star hump. There's mostly older games, but who doesn't love pinball and pacman? \n\nAlso, you can play Mario Kart for FREE on the TV above the Killer Queen game (you just have to give the bartender your ID to hold while you borrow the controller.) My fiance and I played with a couple of strangers and it was fun.\n\nHad a good saison and great strawberry hibiscus sour and my fiance had a very tart cider he liked a lot. Bathrooms are clean, decor is cool, you can write things on the wall in magnet letters. Seriously, what's not to like here?", "author": "Christine U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-23", "description": "Stumbled upon Brewcade randomly this past Sunday afternoon. Although I had had this place bookmarked/on my radar I didn't realize I was passing by it until my boyfriend noticed the chess board tables outside.  Us both being the chess nerds we are decided to grab a beer and play a game.  Brewcade is small and unassuming, the walls are lined with vintage arcade games all at pretty affordable prices (I believe cheaper than a place like Golden Gate Tap Room).  The beer selection, although unique and excellent was a bit pricey.  Board games are free you just need to leave your ID behind the bar.  In all, a great spot to stop in play some favorite arcade games you forgot how much you loved and, in my case, get your ass kicked in chess.", "author": "Kelsey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "My friend and I stumbled upon this place randomly while we were exploring the area, and it was such a nifty little place! \n\nAlthough we didn't get to try any of the drinks, we did take a quick look at their selection and saw that they had lots of beers, wine, and food on their menu. We spent most of the time just playing the old arcade games that they had available, which was so awesome! Just think pacman and paperboy and pinball and whack-a-mole and etc. Each of the arcade games were 50 cents each, and you could also play Mario Kart on the big screen for free! \n\nHonestly, this place is pretty awesome, and the decor is pretty cool. Overall, this is such a fun and chill place to be, whether it's with a group of friends or with a date.", "author": "Tricia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "On the expensive side for Happy Hour, but they do have a great beer selection. Happy Hour prices are a dollar off the listed price.\n\nI ordered the \"Grape Drank\" which is basically a wine slushie. I actually liked it.\n\nDidn't get to play and of the video games but there are plenty towards the back.", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "When my friend said she was in town with her new bf, I wanted to find a cool spot with drinks and fun stuff to do. The solution? Brewcade. This place is a great option and reminded me of a similar place I went to down in LA.\n\nDrinks: They have a fairly large selection of beers.\n\nArcade: They have a good amount of classic video games that will get any late 20-early 30 year olds excited (believe me -- the boys did some gaming while us girls caught up). They also have board games available if you want to stay at the tables. \n\nAtmosphere: It's cool and casual. It can get a little loud and crowded, but it's still fun.\n\nService: Bartenders are nice and they clean up the tables pretty frequently, so there's not just empty bottles laying around.\n\nLocation: Parking can be a bit difficult in the area, but it's conveniently located pretty central.", "author": "Leana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "Brewcade is just a few blocks from my house and it's a great spot to catch up with some friends. They have some classic games I grew up with such as Blitz, NBA showtime, and of course PAC Man. Coolest game though is probably Mario Kart on the projector. There's usually a wait but def worth it.  \n\nTheir beer menu is probably one of the better ones in the area--it's a bit tough to get craft beer in the Castro! Outside of one instance with a sarcastic bartender, the environment is really friendly and laid back. No one is trying to rage, more so just have some good fun. I played Uno with some friends and had some good beer. Couldn't ask for more. Oh and I think they have food trucks on Thursday! Pretty cool.", "author": "luis m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "Great bar and bartenders, games are cheap and they show awesome 80s movies on background.", "author": "Frank W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-02", "description": "Good selection of beers. Really fun place. We are visiting from Colorado and this place has a great vibe. The bar tender was super friendly, drinks were kinda pricey (compared to Denver) but great selection of local beers. Played a bunch of games, which was awesome. We had a great time. (Plus, it's literally next door to our hotel, Becks Motor Lodge, so super convenient also.) Thumbs up.", "author": "Ariel R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-20", "description": "PUMP UP THE VOLUME!  Please, I want to be in an arcade and hear the sound environment of the arcade.  Having all the games on mute or barely audible is tragic and kills the experience. We didn't come for the radio or ESPN or to have a quiet chat.  Explaining Moonwalker to people who've never heard of it and every audio flourish was lost on them because it was nearly muted was lame \"no it's really funny when you put in the quarters and how the kids praise him and when...\" god... .  Playing Joust on mute... sigh...  so much less exciting.  Playing Rampage and leveling a building with your 1st time playing friend on 1% volume... grrrr. Pfff...  Pump it up. Make it rumble with all the weird noises an armada of arcade machines can.  Boom is the sound you should FEEL when pulling the trigger and it should be exciting. You should feel that last life slipping off the screen and that game over sound...You should feel like you're in an arcade.   Please take an hour and fix this.  I'll re-write and re-rate at that time.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "In addition to a broad selection of craft beers and alcoholic \"mocktails\", Brewcade houses a fantastic selection of classic arcades, plus WORKING pinball machines that they actually maintain on the fly. The machines take quarters, so no need to carry home a pocket full of tokens or buy a card. And finally, my favorite detail is the water taps on the wall so you can stay hydrated with either flat or sparkling water without having to bother a bartender or pay for a bottle. The beers are a little pricey, but it is worth it for the venue.", "author": "Craig M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-30", "description": "Went to Brewcade today and had an amazing time! So, Brewcade is near the Castro District and is accessible via Muni. For those that have never been, Brewcade is a healthy mixture of old skool arcade games and a bar. The beer is cold and reasonably priced and the games make you long for days old. Games ranging from Mrs. Pac-Man to WWF Wrestlemania. The space is decent but the lighting could be a little better. Also, the machines (games) take quarters and sometimes it will ear your money. Overall a good place to hang out.", "author": "Rhett B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "Love this place! The bartender was super friendly and the games were fun! They have game tournaments that are for amateurs.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "I love an arcade game/bar for adults, especially of the arcade games consist of pin ball machine and classic Atari games.  I don't like those \"all in one\" console game units where you scroll through a menu to select the game you want.  No Bueno!\n\nThe beer list was great, I don't need fancy drinks.  Especially if you are there to play games.  All that will make me happy is PBR.\n\nOnly thing that I found funny was that the bathrooms were hot!  Like turn up the a/c or something in there.  Especially with all the stinky bathroom smells.  Other than that fun place to go!", "author": "Nyla K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "This bar is a cute concept and reasonably priced. However, it was extremely crowded on Saturday night. We were still able to play some games, but there wasn't much space at all to hang out, drink, and talk - my group of 5 was squished up against the back of a game machine. It's a relatively small space. It's a fun activity for a very small group or a date, but I'd come back on a weeknight.", "author": "Cynthia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-14", "description": "Do you like screaming in order to be heard by your friend standing 2 feet away? A thousand points of light flickering constantly on every surface? Blaring dance music (at a venue with no dance floor)? How about having to constantly wriggle through one-human-wide spaces to get to the next game? \n\nYou can experience all this and more at Brewcade--on a TUESDAY evening, too. (I can't imagine how awful it must be on a weekend.) I went here with some friends because Free Gold Watch was closed. It was a mistake. Go to Free Gold Watch... it's BYOB, spacious, and you can actually hear yourself (and your friends) think. Better games there too. Brewcade's interior lighting design was likely masterminded by Tim and Eric, because I felt like my eyes were bleeding within ten minutes. \n\nThe upside is that they have a fount with really good sparkling water that you can pour yourself. I don't know why more places don't have this. Now that I know it's there I might be inclined to walk in, pour myself some seltzer, guzzle it down and then be on my way.", "author": "Maxine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-13", "description": "A belated 2014 review. By now, Brewcade isn't even considered a new bar in the Castro - but I did go one of the first weekends they were open. Brownie points, anyone?\n\nThough I'm not a gamer (unless an obsession with the old school Nintendo version of Tetris counts?), Brewcade is still a fun bar. Not because of the endless amounts of dudes here. Not because of the copious space. Nope, it's the slush wine on tap. Yes, you read this correctly: Slush. Wine. On Tap.\n\nWhomever thought of this concoction is a genius! It's also a way to get ladies in the door without forcing the issue too much. That's not to say there aren't gals out there who love arcade video games, but let's face it, the guy:girl ratio would be even more out of whack if it weren't for this awesome beverage.\n\nI like the unique concept and everyone working here was incredibly nice. You wouldn't even have to bribe me with free quarters to come back.", "author": "Abby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "Brewcade is great. Every time I've been there, at both busy times and slow times, I've had a excellent experience. \n\nThe beer selection is top notch. They seem to carry a regular selection, but also always something fun and new to try. They also have these wine slushies that my lady still talks about (that was a fun next day). \n\nI also really like the arcade aspect of the bar. I'm not really an arcade person, but it's a really fun selection of games (did someone say Big Buck Hunter... HD??? Yes Please!). Bars can get monotonous, but that isn't the case here. You can be social, you can game, you can game and be social. \n\nFinally, the staff is great. This isn't the kind of spot where you are going to get rude bartenders. They are friendly and keep the drinks flowing. What more could you want? \n\nBottom line, give it a shot. I don't think you'll be disappointed.", "author": "Nat S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-28", "description": "Came here on a Tuesday night to celebrate a friend's birthday. The place is rather small but has a great vibe to it. The decor is very cool and fitting for an arcade. We got there around 9 and found a table easily but it started getting pretty packed around 9:30.\n\nThey also have board/card games that you can check out at the bar so we played a few rounds of taboo and a couple arcade games before heading out. \n\nGreat concept but rather small and crowded. Fun place for a casual evening but would not go with a large group.", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "We finally get a bar arcade in SF!! I'm a huge fan of Ground Kontrol in Portland, and while Brewcade isn't comparable, it's off to a really promising start. There are quite a few classics, including Paperboy, Smash TV, Joust, and Ms. Pac Man, along with what appears to be a MAME emulator with hundreds (thousands?) of games.\n\nThe games take quarters, and there's a change machine near the games. It was pretty mellow during the weekday evening that I was there, and I was able to get my games on without feeling crowded or rushed. The arcade area is a bit small, so I can see how it could get crowded during prime time. \n\nDefinitely a cool concept, and I hope they get a lot more games in the future!", "author": "Allen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-18", "description": "Fun arcade meets craft beer pub. I like the concept and it works well. It was fun!\n\nDropped in after a couple of drinks at Hi-Tops across the street. Tried a few games and ended up staying. The beer selection is good, but they don't have liquor or spirits.\n\nEnded up getting hooked on this game in the front, towards the right as you walk in. It's multiplayer where 2 teams of 4 go head to head. Was confusing at first but the stranger who invited us to play taught us and once you get the hang of it, it was so addictive!\n\nI felt like a loser coming here on and leaving at 2am on a Friday night, but maybe this is the new going out?", "author": "Billy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "I've been coming here every Monday night for a month now. I have to give this place 5 stars because of the game Killer Queen. It's an incredibly fun 5-5 arcade game and there's a meetup on Monday nights where people just throw coins on the machine and rotate in and out of play. It's a great way to spend a Monday night, have a beer, and meet some people. Additionally, winning at killer queen results in some kind of high akin to morphine. You just drift off to another place and revel in having crushed your opponents.\n\nWhen not playing killer queen, you'll find me on the pinball or donkey kong games. They also have a selection of board games to be played with friends.\n\nEven if you're not a huge nerd (am I a huge nerd?) you'll appreciate this bar.  +  what's not to like?", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Grape. Drink.\n\nI wish they swapped the games a little more often, but that's a pretty minor gripe. If this looks like your kind of place, it probably is.", "author": "Joseph G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "This place is AWESOME! First of all, their beer selection is always top notch. They consistently rotate a wide variety of styles and flavors from bay area breweries. There is always something for everyone, including wine and wine and beer based cocktails. The bartenders are always friendly and willing to help you out if you are overwhelmed by all of the options. Once you have a beer in hand, the wide selection of vintage and updated arcade style games are there waiting for you. All of the pinball machines are always a solid decision. However, the new and improved Big Buck Hunter HD is the best!! It is definitely one of the most addicting games. If video games aren't totally your style, they also have a ton of board games you can borrow. I played Guess Who for hours and it took me back!! \n\nOne last perk of this bar is the fact that they are totally cool with you bringing food in or having it delivered to you! Overall, it is a super chill place that is always one of my go-to picks for a fun night out. With great drinks, unlimited food options, game options galore, and easy access to muni stops, Brewcade is never a disappointment!", "author": "Kalin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "The \"adult\" version of an arcade- = Brewcade*\n\nThe inner child in me jumped with joy at the 30 something plus games that only cost 50 cents to play. (yes, 2 quarters only!)\nSo as my co-workers and I tried to battle it out over the games, we had also got to choose from a massive selection of beer and wine. \nThe \"house special\" of frozen flavored wine wasn't too bad either.(peach and watermelon- tasted a tad similar- but delicious and refreshing none the less)\n\n**Pure Genius on compounding Brew and Arcade", "author": "Ada C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "I finally made it to Brewcade!  And the reason is I wanted to have an amazing date night with my hubby and he loves video games and we both love beer!\n\nI didn't tell him we were going. I made it a surprise. You should have seen his face. First it was a little confusion and then that little boy in him appeared. Yay!!! I love this man. \n\nWe got our beer. What a great selection!!  The beertender was so cool too.  She let us preview a couple beers before we made our final decision. And then again and again. They have a lot of beers!  I mentioned I love beer right?  \n\nMy hubby began his walkthrough with beer in hand. I followed with the biggest smile on my face as he stopped at each and every game.  He told me stories and shared memories from when he was a little boy and would sneak off to his neighborhood arcade. And how his mom would find him and drag him home. He was once again in his happy place but with a cold Ale versus a cola. The man was damn near in tears. \n\nWe played all the pinball games and Ms.Pacman and the race car game and so many others. What a great collection!\n\nBrewcade is more than a place to have great beer.  It's a reminder. A reminder to have fun, be a kid, go out and play. \n\nP.S. He may have gotten the high score, but I got the Wife of the Century Award.", "author": "Jean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "They have Killer Queen, what else needs to be said? They also have a great draft beer selection with some interesting wine slushies at reasonable prices. The place isn't huge so I can imagine it's pretty packed at peak hours, but a nice spot for some daytime drinking and arcade games.", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "A hundred million years ago, there were these places called \"arcades\" that housed the best and brightest video games on the planet.  It's also where you would find yours truly spending more than his fair share of time and rolls of quarters.\n\nTimes have changed and now most people experience gaming in the comforts of their own homes.  So much so that I have to ask, why would anyone need to go to an arcade anymore?\n\nAnd yet there exists these nostalgic and often fraternal (let's face it not a lot of girls played video games back then) musings about those dark secluded spaces that sometimes also served as electronic sanctuaries from the outside world.\n\nHello Brewcade.\n\nBrewcade is home to an assortment of classic video games and pinball machines that will have your inner gamer jumping for joy as you once again experience the sights, sounds, and feel of a real live arcade (although tweaked to cater to a slightly more mature game junkie who is old enough to purchase alcohol).\n\nAfter a couple of rounds of Street Fighter II, a smoked porter, some Addams Family pinball, and a purple grape slushie thing, I was good.\n\nOverall, it was a nice revisit to days of dazedly past and one I may want to go to again.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "I've been to brewcade twice and I must say it's a pretty poppin spot on a Friday night. They have a good variety of beers on tap and their \"grape drank\" or flavored wine slushes are pretty strong. They don't have THAT many arcade games but if you go up to the bar they have a list of board games you can check out if you just leave your ID with them.  The only complaint I have is that the staff isn't very friendly.", "author": "Linz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "Whenever I come here it is relatively chill and not super packed as it is late at night. The staff here are extremely friendly and they have a whole list of unique beers that you probably haven't heard of. Staff is friendly and there are a lot of games to play (pinball, wii, etc). It's a good place if you wanna go somewhere a bit more slow pace and want to catch up with friends.", "author": "Galen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "This place is awesome their drink selection is a little limited but they have Killer Queen which is the most fun arcade game I have ever place. Small place but great atmosphere!", "author": "Matt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "I go here twice a week to play Killer Queen with one of the best communities I have ever been a part of. On top of that the beer selection is really good and always rotating. The staff is super friendly, The get-to-know-your-name kind of staff. Shawn the bar owner is very nice. He plays games with the patrons and is always listening to their ideas, complaints, compliments. The place is brilliantly decorated. They throw fun parties like Neon Arcade Night with black lights and funky ornaments. We've also held some Killer Queen tournaments.\n\nIf you want to meet great people, drink beer, and play video games, you've found the right place.", "author": "Tony H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-11", "description": "Came here on a Thursday night and the place was packed! By which I mean not just friends chilling but groups turning up and having a blast. \n\nSuper fun idea to mashup an arcade and bar so it's not just a few machines sitting in a corner collecting dust. Great place to end up that I'd classify as a \"bar+\" (more than a bar, less than a lounge / full arcade). \n\nSmiled so much at the magnet letters on the wall - proof it's in the little things! Also find it hilarious they serve Kombucha, but heart of Castro what are you gonna do *shrugs*\n\nOnly thing I'd change is cut down on those green laser lights pointing every which way. Kinda distracting when you're watching a game on the big screen and while attempting to maintain eye contact during a conversation haha.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Came here when we were in San Fran visiting my best friend and it was super fun! I don't personally drink but my bf and friends said the beers were great. Definitely a cool spot to just hang out and play some old school video games.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-22", "description": "I ordered two drinks from here, a Hefeweizen and a Lil Sumptin. Both drinks were $6 each. Total to $12 right? I handed the bartender a $20, and he just walked off and disappeared. Didn't even think to give me my change back. $8 tip for two beers? Heck no. It was the tall black bartender with dreadlocks. So thanks for treating your customers like that.\n\nOtherwise, it's a decent enough spot. Lots of beers on tap. Lots of arcade games. Some of the machines stole quarters but hey what can you expect from a place that combines electronics and alcohol.\n\nIf not for the whole bartender thing I'd be back, but I'll pass for now.", "author": "Sean H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-10", "description": "** No Simpsons. I repeat, no Simpsons. (Yet.) **\n\nChange machine's broke.\nGet 25c's from bartenders.\nOne of the games ate my coins.\nSo narrow aisles between machines.\nBut once Simpsons comes,\nNone of the negatives will matter.\n\nI'm on some high score lists.\n(Till actual gamers show up :p)\n\nP.S., Where's Sunset Riders?\nMexican was #southernplayalisticadillac\nIn the flamingo poncho\nWith double shotguns, muzzafuzzas.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Arcade games, pin ball machines, board games and BEER!!! Everything I love to do on a casual night. I was happy my friends wanted to go here, too, because I've been wanting to go to this place ever since I heard it's a fun place to play games and drink beer. They event have a screen set up above the bar to watch wrestling and/or sports games. \nAnd if you're not a beer fan, no worries. They also have other drinks, such as Wine Slushies, coffee and other non-alcoholic drinks. My favorite is their nitro-stout beer. I also ended up buying their Habanero chips, which has the perfect amount of spiciness and cool comic book packaging, too.  \nI will be back for more fun nights drinking beer, and playing board games and arcade games.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Had a few selections of classic games. Killer queen was my fav :) \n\nI drank the apple fritter frizz, it had a cinnamon taste.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "This is the type of bar I been waiting for since I have turned 21. As a gamer you want a place with old school video games like this. And as a beer drinker your want a bar with this kind of selection of beers. \n\nAll old school video games, and pinball machines. Games I fell in love with growing up. The decor is real nice and modern looking as well. And you can have fun with making out words on the wall. Atm as well in case you forgot some cash. \n\nThe beer tenders have all been very kind. And are willing to answer questions about the beer. They do offer some light snacks as well. And have 2 tvs to catch the game. \n\nParking does suck in the area. But very close there's a pay to park in case you give up. There's many places to grab a bit all around; sushi, Mexican, etc. Plenty of other nightlife around as well.", "author": "Gustavo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "Wide selection of games, excellent drinks. They even have a Wii U they'll let you play ssb4 and Mario kart on if you buy a drink! They even mailed me my ID after I forgot it and drove back home, solid establishment, would go back", "author": "George A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "Hey is that Jeff Bridges over there? ...Nope just me going HAM on the TRON machine!\n\nI know the main draw here are the arcade machines but hot damn, the tap lists here send a craft beer lover into a headspin!", "author": "Sam J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "I love this place, great mix of people. Great games. They serve Boulanger diet sodas, which are quite good. I wished they had more options maybe the diet cherry version.\n\nhttps://www.boylanbottling.com/product-category/diet-sodas/", "author": "Lucky S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "I'm a little biased because this place fits my four primary needs: it has excellent beers, it's local, some classic arcade games, and - at last! - pinball. \n\nThe drinks selection is great, both alcoholic and not: some fine ales, and some unique and tasty soft drinks. Prices are about average by Castro standards, and you'll want to get some change so you can play the games. \n\nThe cabinets are universally 50 cents a game, accepting quarters only - there's a change machine available. Some older games aren't very good at saying you need to insert multiple coins; I wonder whether this is responsible for some of the complaints of machines swallowing quarters. \n\nSome of them, however, are likely legitimate. My only real complaint is that some of the machines aren't very well maintained. Some have dodgy joysticks or buttons, and some definitely have eaten a coin on me. \n\nIt's not, therefore, a perfect arcade, but given the choice I'll happily call in anyway. If they can fix the maintenance problems it'll be even closer to that ideal.", "author": "Sophie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Huge beer, wine, and NA drinks ... AND old school arcade games!! Perfect combo!  A must-visit joint in SF", "author": "Dustin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "A friend suggested this video game bar spot to visit on a Thursday night. Dope spot, one of the bartenders had some bangers playing through his playlist. We even played a game of super smash on the big screen! The place is a bit cramped but good to meet up or start the night definitely.", "author": "Rj L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Great place to hang out with fun arcade games and decent beer choices\nPro tip: trying getting in before 8 pm for a spot at the games.", "author": "Alex P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-07", "description": "Fun and energetic place! Pretty crowded on a Saturday night so it was hard to play the games you wanted.\n\nMostly game machines, pin ball, and then you can rent board games from the bar.\n\nBeer & wine only, frozen wine aka \"grape drank\" was tasty. Good for small group or a fun date!\n\n(I brought $20 in quarters, spent $15 of it, just so you have a gage)", "author": "Rachel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "This is a wonderful, gloriously fun beer bar.\n\nTbh I'm not a big fan of beer, but the bartender was super good about finding something delicious and then later introducing us to the wine slushies. #problemsolved \n\nBeer folk will appreciate the beer I'm sure but the part I loved about this place were the games. There's a jackpot of board games lying around that you can bring back to your table, play with and be merry. (Personally recommend uno) \n\nThere's a change machine so you can play the old school arcade games. frogger and some sort of race game around SF were particularly great. \n\nAlso free water all night. A++ for the SUPER nice and cool bartenders.\n\nWe'll be backk", "author": "Andrea D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "Nice selection of beers. Killer queen is a fun and original game they carry. Some fun arcade games but also a bunch that aren't fun or interesting. They also have Mario kart.\nNicely designed", "author": "Jones T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "SF finally has a barcade! It's pretty simple, beer + arcade games = fun. They have a good selection of reasonably priced beers, tables for chatting, some retro games, a wii u (with mario kart!), and a magnetic board with lots of letter magnets. \n\nI recommend coming earlier if you want to play good games or find a good seat. I went on a Saturday and it was really crowded, I had to wait outside for 5-10 minutes. The demographic is pretty typical of SF, super diverse: folks from Castro, people on dates, college friends, etc. \n\nOverall, I think it's a fun concept at a reasonable price. Beers are $7-10 and arcade games are .50 cents a round. They also have still or sparkling water and are efficient with their bathroom systems (sinks on the outsides and non gender discriminatory bathrooms). Although the night I went was a little too crowded, I still enjoyed a beer and watching people play games. I hope the barcade concept catches on and continues to grow!", "author": "Steven V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "This is probably one of my favorite video game bars in the city!!! From Mario Kart and Killer Queen, to the older more classic games like Pac Man and Joust there is something fun for any age group (21+). The bartenders are friendly, passionate, and extremely hard working. Also featured: awesome beers on tap and food just a few short steps awwy!! Shouout to my two favorite bouncers Daniel and Justin!!!", "author": "Anna Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "A huge variety of beer options, wine slushes and a ton of retro arcade games, is there anything else you need?\n\nKiller Queen is a fun game for groups, 5v5 is possible =)\n\nGreat for groups, just make sure to get a reservation since seating is limited\n\nOverall Thoughts\n\nSolid place to hangout with friends over drinks and video games", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-21", "description": "Oh man, where do I begin. Let's start off by saying that I love barcades in New York and in Portland. I am a fan of drinking and playing video games. Combining those two things together is basically the best thing anyone has ever thought of. However....\n\n+1 star: I don't drink beer, but they definitely get 1 star for offering like 30 beers on tap. All the taps look really pretty.\n\n+1 star: There's a cute chalkboard with magnet letters on it so you can write cute things and then take pictures of things you wrote that you thought were clever when you were drinking 30 kinds of beer, but then when you looked at the pictures later, realized were  maybe less awesome than you had originally thought.\n\n-1 star: At least two of the games we tried to play took our quarters and didn't react to the fact that we just given them silver coins in exchange for something.\n\n-1 star: The game console that said joust did NOT have joust. Sooooo disappointing as this is one of my favorite games of all time.\n\n-1 star: The bathroom situation seems quite unfair. The boys get their own bathroom, but the 2nd bathroom is co-ed. What year is this?\n\nI guess I'll just save my barcade visits for when I'm out of town.", "author": "Robin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-12", "description": "Alright place to spend an hour or so. Good luck finding a place to seat. Way too much people at one time that you can't even walk without having to ask someone to move.\n\nCool games bring back nice memories from childhood.", "author": "Gilbert A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Love this place.  Brought our office here for happy hour and it was a hit!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-30", "description": "Came here on a Friday night and it was packed. Not necessarily a good thing.. It was hard to move anywhere and sometimes people just block the walkways. I heard the drinks here aren't great when I got here so I didn't get anything from the bar. However, they do have free self serve still and sparkling water in the back corner which is definitely a plus. The arcade games are old and outdated for the most part and not the most fun. Music here can be turned up a little louder. Not the best but also not the worst experience.", "author": "Jonathan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "An arcade-cum-bar with wine slushies designed for adults? Count me in.\n\nWine slushies sound 1) gross, 2) like the recipe for a hangover. Only the latter is true. These are freaking delicious. I typically hate pre-mixed drinks, but these are tart, not too sweet and truly addictive. Love love love. \n\nThere's a great variety of arcade games, from the nostalgic (Street Fighters! Pac-Man! Area 51!) to the new and modern (...can't remember the names of these, but they were also fun - especially the one designed for groups, which is awesome if you're with a lot of friends).\n\nMy only real complaint is that some of the older machines are broken, and just eat your quarters. But that only makes the whole experience more authentic and reminiscent of your childhood, amirite?\n\nAll in all, a great addition to SF.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-21", "description": "Came here for an after work event. \n\nPros\n+Mario kart and super smash brothers on the big screen\n+Wide selection of beers and old school arcade games\n+Clean bathrooms\n+killer queen!!!\n\nCons \n+Nothing bad. Unless you are an old school arcade gamer, this was okay. You can be done here after an hour or so.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "This place is a ton of fun! \nWe went  in a Tuesday night so it wasn't too crowded & there was only one game that we wanted to play that was always taken- Super Mario bros, go figure :)\nThere are probably about 20-25 different arcade games.\nSeveral times we had issues that the machines eat our coins- we didn't care too much bc we would only loss  a few quarters but i figured I should tell someone so it didn't happen to anyone else & I was told that they have a \"no questions asked\" policy & they refund you completely. He also got on the phone right away with someone & was explaining which machine & what was happening to get it fixed! Talk about great customer service!\nLots of beer on tap & their famous wine slushie!\nThey had a self serve water area with atill & sparkling on tap! LOVE IT!\nThe place was clean & a great environment with fun jams playing in the background. Will post pics of some of the games they had.", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "I've been to Brewcade twice now and it's a really fun place! There's a ton of beer with cool names! Not to mention dozens of old school arcade games. It's a good place for groups but it always seems to be crowded so get there early and grab a spot! Also! Happy hour is M-F 4-7! ;)", "author": "Meliza M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "(Pac Man theme song plays in head).\n\nIt's exactly what you think it would be. Come in with some quarters, play some old-school video games. Grab a pint. Get on with your day.\n\nI wonder what they'll do to keep this place fresh, as months pass, though?", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-09", "description": "Much as in The Fountain or The Time Traveler's Wife, I find myself looking back temporally at a previous existence. But where there might've been one of two beautiful Rachels, I am met instead by Paper Boy and Donkey Kong, Jr.\n\nI am both 9 and 32, and there is a Neo Geo console offering Final Fight. In only one of these realities am I actually playing the game, brawling through Metro City with an amazing glass of red, while my friend who invited me to this media opening is engaged in her own battle against ghosts, fruit, and those little dots that Pac-Man can't seem to get enough of.\n\nThen there are Millipede, Willow, Galaga, and many other remnants of our beloved lower-bit past. Paired with the promise of a nice selection of craft beer, wine, and cocktails, how could anyone not love this bar?\n\nBrewcade is a welcome addition to the hood, located a short walk from Church Street Station and just next door to Hecho. I highly recommend checking it out (when it officially opens on 12/10/14).", "author": "Keane L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-02", "description": "The concept is cool but in reality it was a letdown. The games were fun, obviously, but the bouncer kept telling people to quiet down. Also, they kicked people out more than 30 minutes before it closed. Last call is one thing, but telling people to leave is another. Also, it was raining, and they didn't let us wait for ubers/taxis outside the bar under the awning. I was there with two friends and there was another group of about 5-6 people and no one was super loud or anything. It was just weird and the whole time it felt like they didn't want people inside. The place is super isolated too, so it was annoying since we made an effort to go all the way there because an arcade/bar sounds like the coolest thing ever. Anyways, it's not horrible, but I didn't have a great time and I wouldn't really recommend it to anyone", "author": "Megha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-07", "description": "Frozen wine on tap was not very good. I kinda thought it was going to be something tasty like a pina colada, but it really was just wine mixed in slurpee-like ice that didn't taste so great (watered-down wine) once it started melting. The caramel popcorn from CC's that they sell there is amazing though. But of course, the drinks and food there feel somewhat overpriced. I guess it wouldn't be hipster enough for the Mission if it wasn't horribly overpriced.\n\nAs for the place itself, it gets CROWDED. Even early around 3pm on a Saturday afternoon. The layout as others have complained is quite horrible. Literally packed back-to-back and unless you plan to go there to play games and drink by yourself, this isn't a place that's really cut out to handle a group of larger than 2. I'm a small person and don't mind small spaces as much as some other places, but I definitely agree the layout and how closely the machines are put side by side is just a little ridiculous.\n\nOh, also, they charge a fee if you accidentally leave your credit card there overnight and don't close out the tab. It's something like 15-20% of your bill.", "author": "Joanne Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-15", "description": "I want to put the disclaimer out there that I will probably update my review in a few months once Brewcade gets its game together... no pun intended. I love the concept of this place, and it just opened.\n\nThere are more arcade machines than I thought, but I don't like how cramped that area is. I just feel so claustrophobic... and I'm not even claustrophobic. There is plenty of seating to hang out with your friends, but the section in front of Brewcade seems out of place. There's something about the atmosphere. It just feels... not cool and homey quite yet. Maybe it's because everyone is still getting used to a new bar. It's hard to tell how much some of the games cost because the prices have been rubbed off from the machines being so old. I think it's 25 to 50 cents, so if one quarter doesn't work... put in another one.\n\nThey have a wide selection of craft beers, which is cool. It would be even better if there was some sort of beer menu (maybe they're working on it) or if their taps were labeled. There's a refrigerator on the side of the bar for non-alcoholic drinks. Super random. Everything just seems super spread out. The beer is in one section of the bar and the games are in another. Brewcade definitely has some work to do, but I think they're off to a decent start. I would recommend checking it out now just to compare to what it will become in a few months!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-17", "description": "The machines cost $0.50 each, even the oldest games. Multiple of the machines don't work and just eat your quarters. The controls on many of the machines are frustratingly imprecise. Multiple machines are out of order. \n\nBrewcade has lots of beers on tap to try. It's a good place if you're into beer. \n\nIt's a very unsatisfactory experience, however, if you're into classic arcade games. If you're into classic arcade games, go to High Scores Arcade in Alameda instead. They have the best classic arcade cabinets, keep their machines in top condition, and offer unlimited play for one low price.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-10", "description": "No way albertino! Here comes the judgment train! Choo... choo...\n\nI love this place it's like my own little slice of Brooklyn in the mistro!  We got some free willy on blast, bike messengers chillin they caps, also I saw pharell here on opening night, they gots some mean ass beertenders.\n\nIt was like communist times.", "author": "Andy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-30", "description": "Ninja Turtles, Simpsons, and Xmen are missing.  Maybe we can get some pinball machines.  This place is seriously lacking compared to other barcades.\n\nTINY glass of beer for $7.  \n\nIt's really overpriced here and worth checking out once.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Great environment! Staff and owner are very friendly. We came to play Killer Queen after getting hooked on the game in Portland. The machine was having trouble with an update so we waited a little, but the proprietor gave us a free pitcher of beer when he saw we were waiting to play! Great guy!The KQ crowd was very tight knit yet were very positive towards us newer players. They even had a Super Smash tournament going. This place is awesome!", "author": "Robert J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-14", "description": "The wine slushie \"Grape Drank\" is a cool idea and tastes good, but pretty small. The ambience is really chill and it has a lot of classic arcade games.", "author": "Abraham G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-12", "description": "Weak.  Is there a way to get negative stars on Yelp?\n\nThis place is more of a lounge than the \"Brewcade\" as they call it.  They have more lounge seating than they do arcades.  If they get more arcades I think it could call itself a Brewcade....  Certainly as of right now, doesn't compare to the ones in Chicago/Portland/Denver/New York. \n\nStep your game up, get some more arcade games from the 90's. X-Men, Ninja Turtles, Street Fighter 2, Simpsons just to name a few.\n\nOn top of that the drinks are super expensive AND the arcades are a shit ton of money, how the f*ck is a game going to cost 75 cents to play..... GTFOH, but I get it, its SF rent is high, but get some more variety in there... half the people there weren't even playing any games.\n\nThat is all.\n\nwomp womp", "author": "Cliff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Cool spot, great selection of craft beer on tap, old school arcades from the 80's 90's . On top of that the service is great.", "author": "Mario S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Love Brewcade  perfect for dates or just with a group of friends! All the hipster beers and drinks are really fun to try if you're into that. Obviously it's not a cheap night out but it's SF so it is what it is", "author": "Shivam P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-12", "description": "Fun idea for a bar and awesome that they had all of my childhood favorites.  Was I the only the 80's kid who loved playing Paperboy?  \n\nTwo complaints:  no hard liquor available (but still a good selection of craft beers and ciders), and the layout is a little odd:  bare-bones decor, with games situated really close together.  If the place gets busy, I could see the latter becoming an issue.  There is something about the lack of ambiance that makes me somewhat uninterested in visiting again.", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Randomly/spontaneously decided to check this place out when we drove past it. Pretty cool, small place. Most games are at least $0.50. Beer only bar, but I just found out through Yelp that this place has wine slushy?! WHAAAT!! I need to come back for that. Maybe if I drank one, two, or ten of those, I would've had more fun haha... but the popular games were usually occupied. I wish there were more arcade games that I knew.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "Great selection of games. I will say that the cramped floor plan didn't bother me because I was too focused on the game I was playing at the time, but the pinball machines are close to the front doors, so you end up kind of freezing over there during the winter months.", "author": "Bianca H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-17", "description": "Bar is FILLED with arcade games and offers wine slushies. What more do you need to know-- visit this place! \n\nIts super rad.", "author": "Denniz S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-24", "description": "Great game selection, DC comics animation on the big screen, but the drink options are pretty weak.\n\nGet a full bar, please.", "author": "Miles L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "Highly recommend you get the peach flavored wine slushy! And bring quarters to play the games. Great atmosphere.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Best place ever! Tony was the BEST attendant ever. Super knowledgeable about the games. He showed us secret menus where we could find hundreds of games including my old school favs like Phoenix, Centipede, and Galaga. I will definitely be coming back to this neighborhood gem, mainly because Tony made it fun and we stayed because of the sub-menus.", "author": "Heather D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "Dive like, decent beer, fun arcade idea, was not crowded and overall good bar crawl stop. Will be returning.  \n\n*they did not have arcade game Rampage", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "Arcade games and beer. What more could you want? Ok, well, a few (vegan) food items would be nice but we can't get everything. Came here recently and had a few beers and corn nuts while the bartender had the best shoegaze mix on the stereo. Almost afraid to go back, as I don't think the experience could be that good again. But with the variety of beers they have on tap, you know I will be.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-26", "description": "I'm a huge fan of classic arcade games but I didn't feel that enough classics were present. Just as everyone else has said, the games are crammed into one section of the bar. With people playing shooting games, it's hard to get by and get to others. Oddly enough it was busier at 3pm than at 7pm on a Saturday. By the later time, everyone was focused on drinking beer. When I'm doing that in the area, I will pick Lucky 13 over Brewcade any day. \n\nThe beer selection was vast though. That was nice but trying to see what was on tap was annoying. The only list is on paper. \n\nIf I'm in the area and want to kick ass on Milkipede, I will stop in but I wouldn't make it my destination again. Shame. I really wanted this to work!", "author": "Tera K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-08", "description": "Okay, so after blasting Brewcade in its early days, I'm happy to report they've turned the place around, and it's now a damn good spot to have a beer and play games.\n\nThe improvements:  they've re-designed the layout of the place so that the games are spaced out much more, and now you can hang out and play (before it was either/or).  They've also added pinball machines (!!) which are in great working order (shout-out to the Gamemaster who takes care of the machines -- he's a great guy and doing a fine job).  In short, everything about the games at Brewcade now basically kicks ASS, from the selection (Robotron with two joysticks! Tron!! Donkey Kong!! Adams Family Pinball!!) to the price.  Thumbs up there.\n\nBut there's one continued problem, and it's a big one.  The beer selection sucks ass.  I mean,  you can't even offer ONE normal beer, Brewcade?  Not ONE?  You've got Uncle Cooter's Sow-Ear Triple Bock, and 666 Brewery's Satanic Saliva IPA, but not one goddamn Corona?  Not one Heineken?  Not one beer I can get at the grocery store?  Really? \n\nI mean, come on.  A game of Robotron lasts 45 seconds and takes two weeks off your life.  I don't want to drink some extra-fermented rat urine from upper Bavaria, I want a PITCHER OF MODELO that I can pound to regain my nerve.  Or really ANY regular beer that I can drink quickly. I get it:  you're not the bowling alley, you're not serving nachos and pabst.  But do you have to be sooo high-falutin that you can't cater to plebes like me who just want a normal friggen beer??? You can charge me your higher prices, I don't care, I just want a regular beer!\n\nLet me put it to you like this:  I'm a drunk.  I drink all the damn time.  But I was there Saturday afternoon and I didn't drink AT ALL, because I'm not down with all that craft beer nastiness!  Just feature one regular beer for chrissakes, PLEASE.  I had a really critical review on Yelp and I came back and changed it because you guys have improved so greatly.  Can't you repay a brother by offering even one regular beer??", "author": "Cody V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-23", "description": "Came here with some friends on Saturday night. \n\nIt wasn't super busy, but it was only 7:30.\n\nThe décor is really barren,  and it makes the place feel cold and not vey welcoming.\n\nIt seemed the games were squeezed super close together, which wasn't necessary as there was a lot of extra space between tables and walls.\n\nI liked my beer, but no one in our group would return.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-23", "description": "New space, new business, and a new concept for the Castro. Bar and pac-man.\n\nEverything old is new again, at some point, and for the vintage and slightly beat up arcade machines that time is now.\n\nDraws a young crowd, most have never seen machines like the ones here. \n\nInteresting beers, quite a selection. If you don't know beer, this might be a good place to learn as the staff is friendly and informative, and it does get busy.\n\nEnjoy!", "author": "William M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "I frequent Brewcade since it is a few blocks from my house and I'm very passionate about beer. Aside from having a great beer selection, Brewcade also has a great bartender! Miller is always happy and welcoming whenever I come in! She's very knowledgeable with her beers and is always willing to let me sample them before acting deciding which one I want. She's fantastic! I highly recommend you come in when Miller is working, she won't let you down!", "author": "Sabrina H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-20", "description": "Great beer selection and a bunch of arcade classics and pinball machines. The highlight is the 10 (5 on 5) player Killer Queen game. My only wish is there were more modern games, as almost everything was from the late 90s or earlier besides Tekken 5 and Killer Queen", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "Good selection of beer and a fun place. Didn't have some of the game I would have liked, but still a good place to go grab a drink and play games.", "author": "Ryan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "This place is a gem! They serve a giant list of craft beers, a handful of wine options and even some type of frozen wine drink! I haven't had any of the wine because the beer list is fantastic. So I can't help out any beer haters.\n\nThere is a machine where you can obtain quarters from. All of the machines work with quarters- so perhaps you could skip doing laundry for a week or two? They play music over their system like a normal bar. So if you're a \"gamer\" and are in it for the cool sound effects- this isn't a place for you. It's like a typical arcade in that there are old and new arcade games. Unlike a typical arcade- you cannot hear all of the dings, shots, bells, whistles etc from every single game. I actually prefer listening to some great songs and just playing the games. \n\nDogs are not allowed inside for obvious reasons. But I believe if/when they have their tables outside you can bring Fido. \n\nOMG the best part: Each machine has a beer holder! If it's a two player game- there are two places for your beers :)", "author": "Karen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "This bar has a variety of options (beer and wine only though!) and some solid entertainment! :) I enjoyed the large selection of beers. It was actually a bit overwhelming for me since I'm still new to enjoying beers and figuring out which I like, but I would much rather have too many options than too few! It's great for those who aren't sure which beer they will like or want to try something new; the bartenders are helpful and willing to describe the various options, give suggestions, and more importantly let you sample a few to be sure you find one you like before making your final choice. The one I decided on (which I can't remember the name of ) was described on the large wall-side menu as a hazelnut beer. It was true to the description and delicious! The other drink I had was the frozen wine one. It tasted just like frozen champagne. It was pretty good but I was expecting something a little fruitier. To be fair, I ordered it by referring to it as \"the frozen drink\" and hadn't realized it was wine afterwards. Still pretty tasty. I also enjoyed the arcade games that line the bar. They have games ranging from Rush (yessss!) to Pacman to Pinball.\nI enjoyed it overall, 4 stars for only having beer and wine, but I would be happy to go back again!", "author": "Shav S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-09", "description": "The drinks were good but the games were trash. Their website advertised a whole bunch of other games that they didn't have. Also most of them had shit controls. I can't play Tekken 5 with a stick that doesn't go forward.", "author": "Shawn M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-10", "description": "Awesome spot!! Arcade games galore and great brews. So many to choose from. But... if you're going to be a Brew Bar then your mugs better be cold. So minus 2 stars for that. I like my IPAs cold and fresh.", "author": "Maria G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "Brewcade definitely puts their own stamp on the standard arcade. They cater to a specific demo, but fortunately for them, that demo makes up a large portion of San Francisco's population. Our company threw a party here last week and everyone had a great time. \n\nThe craft beer selection is awesome (I stuck to the Summer Porter and Oyster Stout but there were many options for IPA lovers) and they even have a water station, complete with still and sparkling taps. A few people in our party opted for wine and ended up drinking out of water cups since there were no wine glasses. Not what I would call classy, but hey, it's an arcade. \n\nBring lots of quarters! Most games are 50 cents (2 player = $1) with a few exceptions. They have a great variety so there's really something for everyone. To name a few: Buck Hunter, Tekken, Street Fighter II, Marvel vs. Capcom, Pacman, Mrs. Pacman, 1942 (!!!!), Frogger, 2 racing games, 3 or 4 pinball machines (including Addams family!) and just as many other games that I can't name.", "author": "Shaina V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Went for the first time on Super Bowl Sunday and it was great! Fantastic beer selection as well as good n/a sodas (for non-drinkers). My friend got their wine slushy, which she swears by. It's a small space but that makes it cozy! A great selection of old arcade games, although Joust wasn't working which was a bummer. They don't serve food but you can order delivery to the bar; just think ahead and either bring or ask the delivery service for flatware...we were eating sausages with our hands.\n\nI'm trying to think of anything I didn't like but I can't! It's close to the Muni Church St so easy to get to. I'm definitely going to be a frequent visitor when I'm in the city.", "author": "Victoria G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "One of my favorite spots in the City. Fun, lively, excellent selection of beers, great music (especially when Ao is sharing his playlist), and amazing and knowledgeable staff keeping the beer flowing.\n\nThe game selection is great (arcade and board games), there is a full magnet wall with refrigerator magnets, and movies/documentaries play in the background, making you realize that the the fact you couldn't wait to grow up has been validated. Finally. Adulthood is here and it's awesome.", "author": "Janiene L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "I'm so glad the initial hype of Brewcade finally wore off because now I can actually go and play arcades without it being crowded with swarms of people who are like \"omg I love Mario brothers!!!\" and you're just like, \"Man, I'd love to play some Marvel vs. Capcom without people just obnoxiously crowding some place they have no interest in being.\"\n\nI love all the different beers, ciders, ales, etc they have on tap. There's something for everyone. Also, bonus points for having still water and sparkling water on the tap for self service; I love that idea!\n\nThe men's bathroom is a bit weird. If you're using a urinal and someone opens the door you're probably going to get smacked while giving everyone outside a free show.\n\n\"There are too many games squeezed tightly together\": have people ever been to an arcade before? \n\n\"The machine ate my quarter\": you over privileged child, that's what happens at arcades. It's a quarter, deal with it.", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-07", "description": "Had a great time reliving some of my childhood experiences while chilling on cold glasses of beer on tap. \n\nModern with an old school twist, I enjoyed my time here playing Marvel vs. Capcom and making it to the boss! The arcade machines are the same ones since 10+ years ago, and they take quarters. (Yes, quarters, not tokens!) There is a handy change machine if you need to fill your pockets with change.\n\nC'mon! Neo Geo?!\n\nGood times!", "author": "Jamie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-22", "description": "Cool concept unfortunately it didn't live up to it.\n-Most games are like rejected, wtf never heard of. Not a great selections of arcade games. Maybe like 3-5 one we actually heard of. \n-Super tight/crowded, all the games are packed into a tiny space, it's hard to play games and drink. I rather go to DnBs. \n-Wtf, were in SF and there's a Huge Seahawks neon light hanging on the wall. Know what city your in?! \n\nNo need to come here again.", "author": "Julie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-25", "description": "Great concept. Games are very worn down. Some of the joysticks are not very good.. would have been funner drunk? Neo Geo did eat my quarters on both sides,  but didn't want to bother the bartender.", "author": "Rob L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Fun place with good drinks and beer selection - they even had a decent non-alcoholic beer, which made me really happy. None of the games stole my coins or anything.\n\nHighly recommended - the Michael Jackson game. Make sure you use the hat twirling superpower as often as possible.", "author": "JF H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "I really like the resurgence of arcade games coming back into fashion in the bar format. It's like Wunderland grew up right along with us.\n\nWe popped into Brewcade to kill a couple of hours with a couple of beers and a couple of rounds of pinball. Pretty much everything in Brewcade is 50 cents a play, which isn't outrageous, but I would have much rather everything been a quarter. That's how Wunderland would have done it. From a nickle to a quarter, that seems like fair inflation when wages have been so stagnant.\n\nThe beer selection is great. They had grapefruit Sculpin on tap and being from San Diego, I always like to see Ballast Point doing well in other markets. They have two different \"cocktails\" that are made from various beers and wine. I went with the Grape Drank which is a wine slurpee. Honestly, I couldn't get through it. Everything was just too acidic for my taste, but other's mileage may vary.\n\nThe old school game selection was good. Staples like Pac Man and arcade Super Mario were represented. Kiss Pinball was there (at a dollar a play though), as was Demolition Man, one of the most complicated mechanical hybrid pinball machines produced. There were also some newer games like Tekken 5 as well. One of my favorites, Marvel versus Capcom is here as well, though the screen is a bit wonky. I think you may have a migraine if you play that one too long.\n\nAll in all, a lot of fun to be had here and an easy place to kill a couple hours. Just make sure you bring small enough bills for the change machine or you may be leaving with some pretty hefty pockets. Either that, or buy your beer in quarters.", "author": "James G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "This establishment is a great place to hang out and have some drinks and play some pinball and old school arcade games. The bathrooms were clean i loved that the faucet was outside the bathroom. There was no line for the bathroom and i was shocked. Great idea for a bar setting and the place was clean as well. The bartender Alex Miller was the best ever.  She Was helpful in making my drinks not so strong and i seemed to catch a nice buzz while playing pinball. Thank you Alex for making our eve great . We will be back next time we come to sf", "author": "Kelli H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "VAST improvement as time has gone on. Congrats to the ownership for revamping the layout, making it feel much more open, and really bringing the place to the next-level. \n\nPROS:\nGood game selection\nGreat beer list. Was really impressed with the selection and all the local options\n\nWISH LIST:\nServe food please, somehow. Maybe food trucks outside or something I can munch on. I know it's hard with all the games but I love food.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "Killer beer list, pinball, and arcade machines! What else could you ask for. Definitely one of my favorite bars in the Bay Area.", "author": "Lars S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-07", "description": "Killer Queen !!\nI loveeeeeeeeeeee this place for having killer queen game machine !! \nThis game is awsome ! we played for like HOURS lol\nonly need $1 to play 10 players\nI will def go back for more killer queen lol", "author": "Yumi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "Brewcade is a cute, new, trendy bar. They serve sour beer which is legit. I'm an IPA person, but am kind of addicted to their sour beer.  The bartenders are nice and the vibe is chill. They also have tons of arcade games to play! The only thing I don't like is their layout. They have a large open space which is nice, but needs to be rearranged. It is just a weird set up. Still a great spot if your in the area.", "author": "Natalia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "Alcohol and Arcade Games...there are hardly any better combinations.\n\nFuel your childhood nostalgia with craft beers while exchanging dollar bills for quarters.\n\nThis place is as addicting as Phils' New Manhattan especially if you're a fan of legendary games such as Marvel vs Capcom or Tekken.", "author": "Charles M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Didn't have my laptop with me but was looking for a place to game. Couldn't find any internet gaming cafes so I stubled upon Brewcade.\n\nHad two anchor steams ($6 each) and spent $5 on games. Unlike most other arcade hangouts, all games were in working order. Moderately priced drinks ($10 or less) and great throw-back games earned this place 5 stars from me.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "I am in love with this bar-cade!  Not only do they have some really awesome old school arcade games but they have a truly expansive beer list. We went on a Saturday night and it was full of a super happy vibe...everyone was laughing and having a great time. I would highly suggest this place for a night out with friends.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "Alright, let's start with the common complaints.\n\nYes, the layout leads to it getting insanely cramped around the cabinets. Yes the beer is slightly pricey (depending on what you order). And yes, some of the cabinets seem to eat quarters (though this may be a misconception: see below).\n\nTo the first point, just don't come on a weekend night if you don't want to squeeze past some group in order to play Bust-a-Move. This is much better as a weekday retreat from responsibility and the real world, not a weekend nightlife spot (there are plenty of those within walking distance).\n\nSecond, the beer selection is actually pretty good, featuring Bay Area breweries (Fort Point and Berryessa to name a few notables). Do you pay $7 for that pint? Sure. But this is San Francisco, and on the edge of the Castro...wtf do you expect? I'd say the beer selection and pricing are better than most, though to be sure it's no \"craft beer bar\".\n\nAnd third, I started to suspect that the cabinets I chose to play (of which there is a good variety) that \"ate quarters\" did so because most people did not realize they were $.50 to play. Putting one quarter in most of them gives you no sense that you need to put another one in to actually play, so people got frustrated and walked away. Sure, there was one machine I spent $.75 on to play, but everything else seemed to work just fine. Again, this plays back to my first point, don't go on a weekend!\n\nSure there's no Simpsons, X-Men, or TMNT, but there are plenty of fun cabinets to get your nostalgia going. A few cabinets have multiple games to choose from as well. I'll admit, playing \"Willow\" as an arcade game wasn't for me, but there's something for everyone, be it puzzle games, platformers, or shooters.\n\nAnd what makes it even better? A metal holster for your beer next to almost every cabinet, making it a breeze to set your brew down without worry of knocking it over during your spastic, killer combos in Marvel vs Capcom.\n\nSolid four stars. Not the best arcade around, but it delivers on what it promises. Plus, iced Sumptown coffee on nitro?? Hell yes.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "I love this place! Can't wait to go back. Great bartenders, great beer on tap, great games, everything is just great! I'm not sure if they were serving food. So I would like to go back and really great a better feel for the place. Love that they have installed drink cups and every game. It makes it so much easier to get your gaming on.", "author": "Skye J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-15", "description": "As three nerds, we went to this place with high expectations. We wanted to drink a couple of beers, and challenge each other in Street Fighter or one of other many games listed. \n\nWe go in to see that it's actually just a bar with a couple of arcade machines pushed to the side. Granted they might bring in more games and change the interior, the arcade side of things seemed like an afterthought. \n\nWhat did we play? We tried playing a game (I forgot the name, but basically you're a half naked guy fighting wolves and monsters), and even though the game was supposed to be two-players, it wouldn't allow more than one of us to play. We lost a bunch of quarters trying to get it to work, but nope. \n\nOh, and as soon as one of us put some metal song on the jukebox, whoever is running the show decided to just play their own playlists and ignore the dollars spent on the jukebox. \n\nSo we came out thinking we could give it another chance a couple of months down the line, when all the kinks are sorted out. But right there and then, the bouncer told us to not talk right outside the bar because the neighbors complain a lot. Yeah that's gonna be great for your business.", "author": "Devin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "When I first heard about Brewcade, I immediately thought of Barcade in Brooklyn, one of my favorite bars EVER. Similar sounding name aside, Brewcade really has to do a bit of work to catch up to the awesomeness that is Barcade. The gaming area is pretty cramped and it's weird basically being butt to butt with other gamers. And while the initial list of games mentioned a few pinball machines there are no pins to be found. One last gripe about the games - it would be neat if they kept a list of top scores (again, like Barcade does)\n\nOn the Brew side of things, Brewcade has a great selection of beer and actually a lot of interesting non alcoholic options. I haven't tried the snacks but it's nice that they do have some munchies available and also let you bring food in from the outside. There are plenty of tables to hang out while waiting for games to become available, actually I think they have too many tables. They could easily remove a few tables to spread out the games (or add some pinball!)\n\nOverall, Brewcade is off to a pretty solid start. I've had a lot of fun going during non peak hours but when it's packed, it gets annoyingly crowded. I say if you're a fan of old school games give it a shot some lazy afternoon.", "author": "phil h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "You know what? I'm starting to think that people in SF are getting a little TOO entitled. \"Wah they don't have this game or that\" You know what's cool? A bar with an awesome beer selection that happens to have video games. Sure, they don't have EVERY beer on tap ever, and they don't have EVERY video game you loved as a kid, but they do have an awesome selection and entertainment! The bartenders here are nice and did not roll their eyes when I asked for recommendations. There's a change machine and serve yourself water as well. What do you snivelly SF sour-pusses want? Oh well, all the more beer and games for me and my crew ;)", "author": "Alyssa J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-22", "description": "Such a cool concept. Except the games were WAY too close together.  Most of the time my quarters didn't work.  and Not as many games as it sounds.\n\nIt still has great beers and a lot of potential but Needs a new layout!", "author": "Matt C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-21", "description": "I wanted to love Brewcade, but the space is actually too small. The arcade selection was limited and it was difficult to play without first checking your surroundings to make sure you don't bump into or elbow someone.   It made me wish there was a Dave and Busters in the city.\n\nSuggestion:  I think they should have some sort of coat check service or coat hooks or small shelving.  Logistically, it is quite difficult to hold a beer, your jacket, purse (luckily, I have a side bag), your quarters and try to play Bust-a-move.  Some machines had a cup holder, but not all do.", "author": "Ames L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "We had a great time here. What's not to like... great selection of beers and classic arcade games like Donkey Kong, Joust, Paperboy, and Super Mario Brothers. Don't know how to play a game - not to worry, just ask Tony and he'll give you some tips.", "author": "Dean L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-24", "description": "The Brewcade itself is a pretty cool concept. Decent/pretty good selection of beer and old-school arcade games sounds like a good time. But the bartenders are not nice. Not the stereotype Toronado bartender, they are just rude here. I asked about flavor profile and the bartender huffed and puffed and said \"well it's an ale.\" I know...i was hoping for a little more....They won't even let you try a beer before you get it and even on a quiet night they do not greet you until they feel like it. Kind of ruined the experience for me.", "author": "Zara S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-12", "description": "Annoying private parties constantly shut the doors to regular patrons. I like the place and they have a surprisingly good beer list. But 3 times in a row that I tried to go it was closed for a private event. I'm pretty much done.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-08", "description": "Brewcade has a lot of promise. From the same folks as Blackbird down the street, a lot of people (myself included) were looking forward to a new beer bar. Plus, they would have video games?! Sweet!\n\nWhile Blackbird has its charm and ambiance, Brewcade is a much more minimal/sterile. The neon greed BREWCADE sign in enchanting at night, I will say, but not much else. There is plenty of space, it seems, for large groups of thirsty gay (?) nerds to gather. It was an odd hour, so the place wasn't full on my visit.\n\nThe beer selection is exhausting-- there should be something for everyone. There are some fizzy non-alcoholic things to be had as well. Small snacks are available, and they encourage/allow people to get food from Hecho next-door, or Hi Tops across the street. \n\nNow, about those games. I will admit that I was salivating at the idea that some of these vintage games would be available, bringing up memories of young Bryan throwing his NES controller across the room, or screaming at Sonic the Hedgehog, or inventing new swear words during heated Pokemon battles. (In fact, maybe I should attribute any rage issues to playing video games.. but I digress...)\n\nThe game situation is crowded. Literally. The current configuration has all of the games tucked into a corner in several rows. Most of the games have some sort of beer holder nearby. Since it was slow traffic, we didn't have any elbowing issues, but I could imagine with a larger crowd, it would become downright claustrophobic. Also, if you read the list of arcade games from any news articles, just understand that they will not all be available at once. I was looking forward to reliving my days playing The Simpsons arcade game at the local movie theater-- alas, no such luck on my visit.\n\nAll in all, a great addition in terms of a beer hall, but I don't see myself returning just for the games anytime soon.", "author": "Bryan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-14", "description": "Like some of the other Yelpers, I was left feeling pretty \"meh\" about my experience at Brewcade. It's definitely not an awful time, but I think I may have over-hyped it to myself. I've been waiting and waiting for this place to open since reading about it a while ago on Eater. \n\nOn the good:\nThe service is pretty great. Greeted by a really friendly door guy to check IDs. The bartenders were also really nice, if not slightly overwhelmed by the crowds (there were remnants of Santa Con still around...), but I give 'em a pass--it's opening week!\n\nThe space itself is pretty cool--has a fun vibe and they were playing the Hobbit on a really nice TV. Ample seating and places to stand and talk. They have a magnetic wall thing with letter magnets (reminiscent of Q Restaurant that closed in the Richmond) so you can make dirty words. I think I saw \"Kinky Elf Sex Porn\". Not my thing, but hey, could be hot. \n\nBathrooms were clean and had a cool selection of brews.\n\nThe meh:\nThe selection of games listed on the Eater piece seemed crazyyyy long. When I got there, I was pretty shocked to see how few games there were (plus no Simpsons :( Guess everything's not coming up Millhouse just yet...). I guess in my mind, that list seemed to take up a lot more real estate. As others have mentioned, the whole set-up is really weird. The games run parallel to a communal table so there's a lot of traffic going around the games and they're so tightly packed that if you want to watch a friend play a game or play with them, you'd basically have to stand in front of another game, hoping no one else wants to play it. \n\nThat goes for the bathroom as well--thought it was odd to have a shooting game right in front of the entrance to the bathroom. I almost got elbowed in the face a couple times trying to pee after breaking the seal. \n\nAlso, I thought it was it was weird that they have these taps sitting at their bar with no indication of what it actually is. The only way I found their selection was to go through their menu...which just seems to slow things down a bit much (and I imagine might be increasingly difficult if you're drunk). \n\nThe quality of the games for the most part were fine. I do miss, as another Yelper mentioned, the sound aspect. I played and beat the Michael Jackson game, but sadly, all I could hear was a trademark \"YEEHEE!\" everytime I entered more quarters. Some of the games ate my quarters, and also games that had multiplayer only allowed you to play 1 player. Sad days. \n\nAll in all, I'd still give Brewcade another chance; could just need some time to figure things out a bit more. I'd also say adjust your expectations of having a full-fledged arcade experience to one that's more like a casual drinker/gamer hanging out for happy hour and who may or may not be into kinky elf sex.", "author": "Patrick W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-18", "description": "A fun place to grab a beer and spend an hour jamming quarters into different machines.\n\nPros:\n-Pac-man\n-Good beer\n-Nice place\n\nCons:\n-No Tron :(\n-Hard to find a menu. It would be a lot easier to order if there was a chalkboard above the bar\n-Expensive beer in small cups\n\nSome of the games are in better shape than others, just expect to find some oddities as they are all fairly old games.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "My wife Linda Had a great time here last night! What more could She ask for, beer and video games! She is a avid Ms Pacman fan and Tony was great showing where the machines were! \"Thanks for ur help Tony\" ~Linda", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-18", "description": "Brewcade would be a great place to visit even if there were no cool old video games.  Their beer list is one of the best in SF.  \n\nBrewcade would be a great place to visit even if there wasn't a great list of beers.  The video games are just awesome and in good shape.  \n\nGet my point?", "author": "Nelson W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-11", "description": "Huge potential and I look forward to re-reviewing this place in the future but as of now there are some problems that should be addressed:\n - cabinet controls are in very poor condition.  if they want to attract gamers, start by respecting the games.\n - machines are packed in as closed as physically possible, making it very difficult to stand.  i literally had to stand sideways and play tetris one handed to fit in front of the machine.\n - overhead fans were running full blast on a cold night for some reason?\n - quarter machine was broken on day 1.  surely this will be fixed soon.\n\nThe biggest problem by far was that the bouncer was maintaining a line outside even though there were ample seats and tables available inside.  This is a giant middle finger to the patronage and will probably be the deciding factor in whether or not I make this place the regular spot I wish it could be.", "author": "joe b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-18", "description": "Definitely a bummer. All the games are old and they are going to eat A LOT of your quarters(thank god they are not tokens). Not wanting to hassle the staff constantly to get me my credits I just kinda gave up. All the games are old school which has its place but boredom sets in quick.\n\nMortal Kombat plz!\n\nI'll be back, but I live down the street.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "Such a fun place for our group of friends! Tony the attendant was awesome! He unlocked a ton of games for us and taught me some of the secret moves on Street Fighter. Also a great selection of beverages and overall a great time. Thank you Brewcade and Tony for making my birthday party awesome.", "author": "Amber C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-07", "description": "Great concept, although the Barcades in NY have already set the bar higher with all games being 25 cents and the use of tokens. At Brewcade, one machine ate my quarters (though the bartender was nice enough to replace them), the games aren't clearly marked about how much they cost and which slots to use, and it's super cramped in here. Nice that they had the Anchor Christmas brew though.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-03", "description": "Came in at 6:20pm yesterday (the bar was open, there were customers) but no one was manning the bar-- there was no bartender, nor any employees around.  We stood there for 5-10 minutes hoping someone would show up for work and serve us some drinks.  But no one did.", "author": "Ulysses L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "This is San Francisco's smaller version of New York's Barcade or Portland's Ground Kontrol. Most unique game here? Killer Queen.", "author": "Gordon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Cool bar. Tony was really nice and showed us the games we wanted. Lots of sour beers:)", "author": "La W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-12", "description": "This place has a LOT of potential, but I have to say I was kind of underwhelmed. The atmosphere is kind of lackluster. There was an overall feeling of blandness. Maybe the beer taps just needed their actual decorative taps. Besides the awesome BREWCADE sign, there wasn't anything on the walls and it fell kind of flat.\n\nThe game selection was definitely for people older than me (and I'm in my late 20s). Maybe I wanted to see Cruisin USA, House of the Dead, Time Crisis, even pinball. Just something a little more eye-popping and \"wow, I totally used to play this.\" Maybe kudos to them for not including those games, and keeping the appeal slim.\n\nI didn't like that they only had beer and wine. Prices were fair though. The menu was average.\n\nUnless they ramp up their game, I'll be passing it up for HECHO and Hi Tops.", "author": "Adam K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-19", "description": "This is a review-in-progress...\n\nI've been to Brewcade a few times and have found it pretty chill so far.\n\nThe good:\n-Joe the bartender.\n-Atmosphere is fun.\n-Good beer list.\n\nThe meh:\n-The layout is not great for people trying to play the very few arcade games in the back. Definitely a disappointment given the hype.\n-Expensive beer in tiny glasses.\n\nOverall, a sweet place to hang out when it's not busy, but not worth a trip out of your way.", "author": "Kat F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-15", "description": "Came here on Wednesday night which I believe was the actual opening night, after their \"soft opens\".\n\nThe wide selection of craft beers are tasty.  Seems to favor Belgians and IPAs.  In addition, there are tasty pub eats.\n\nI was pretty excited for this place given the online hype and arcade list.  As other reviewers have pointed out most don't have discernible volume, a lot of cabinets were not present yet (Simpsons), and some of the cabinets were defective (Moonwalker & SNK cabinet in the back). \n\nAs someone else pointed out, the layout is also questionable   Intentionally cramming people seems to be the goal.  I would flip-flop the lower tables at the entrance with the BuckHunter game near the restroom and a few other cabinets to alleviate congestion. \n\nLastly - I would go back after awhile to have them work out the opening kinds.  In addition, I left my card here and literally cannot find a phone number for this place to call them.  Minus one star.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-26", "description": "Cute concept, okay priced beer. If you are ever in The Castro, it's a cool spot to check out.", "author": "Esther P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-06", "description": "I went here the other day for a friend's birthday party, and it was really fun. I wish they had hard alcohol, but I know how hard/expensive that is to obtain. The games were really fun. There were some broken ones, including mario, which broke my heart. I ended up playing galaga (my favorite) all night. The atmosphere was great, and the bartenders were really nice and knowledgable. \nI'd go back for another friend's birthday.", "author": "Sami B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-25", "description": "Bouncer was starting fights with people who were waiting outside. Maybe the establishment is okay, but the man working the front door was absolutely unprofessional.", "author": "Casey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "Games could be better but the pinball makes up for it. Good selection of board games too. The standards anyway....and great beer!", "author": "Danny and Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "I visited SF to spend NYE with some friends. After debating what to do and where to go we decided to bail on an overpriced party and opted for the promise of Brewcade. \n\nOrdering beer was a social experience. I got to know the bartenders and we talked about their selection and what I thought sounded good in the moment. \n\nAfter getting my first beer I set out to play some games. There were some games from my childhood that I didn't find, but I had a damn good time learning Donkey Kong Jr.  \n\nAt midnight there was a countdown and hundreds of balloons fell from the ceiling. It was a nice touch. \n\nAll and all I will definitely stop back in the next time I'm in town. Thanks for a great NYE experience!", "author": "Zane C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-13", "description": "Brewcade is awesome on paper: a stellar beer selection and the lure of old-school arcades. In practice, though, Brewcade is a cramped, sweaty bar with a \"meh\" selection of games. \n\nThe layout causes most of my issues. Arcades are on top of one another, and the table placement creates narrow alleys to move around the space. This results in bumping into people left and right and a bottleneck at the bar ... not enjoyable in the slightest. The place also smells like my old fraternity house, and most of the games are pretty obscure for me (and I'm a child of the 90s).\n\nTo the positive, the beer selection is quite great, and there are a few enjoyable games (for me, that's Frogger, Paperboy, and Buck Hunt, when there isn't a line at each). But on a Friday/Saturday night, I'm looking elsewhere.", "author": "Matt T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-12", "description": "good lord, this place was ridiculously crowded on a Saturday night. I couldn't even get to the video games. I will not be back, unfortunately. I enjoy video games/pinball machines & drinks! I thought it would be a winning combo, but the crowd here was just awful. Not so much the capacity of people, but the content. Marina South. NONE of which were playing games, just standing in the way and giving snarky looks when I attempted to play them.\n\nGo to Lucky 13 instead. No attitude, no douche bags & a couple of pinball machines upstairs with ample room to put your drink down & actually play a game.", "author": "Amber G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-15", "description": "My friends and I popped in after hearing all the hype and we were underwhelmed.  Considering this place is owned by the peeps of Blackbird, I had high hopes as Blackbird is a cool bar.  You can definitely see the cost cutting in the materials and design of the bar.  It has a minimalism similar to Hecho.  The only redeeming feature are the pipes on the wall above the bar and that is kinda cool.  This place was hyped up for the video game/arcade feature and.... I find myself a little underwhelmed with it.  They have a ton of beers on tap which is great.  However, I haven't found one that I like.  Unless friends want to go there, I don't see myself seeking it out on my own or suggesting it.  It's unlikely that'll happen as my friends seem to be on the same page in that the place is just underwhelming.  Nothing bad, just........ nothing wow.", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "Strong on-tap coffee.\n\nVideo game at bar, on big screen.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "Wow wow wow. Love this spot. Wine slushies and cute bartenders, can you ask for a better place in the Castro?! \n\nGood ambiance but not so loud that you can't hear your friends!  Cool space, love the high ceilings and neat layout. Also the still and sparkling water on tap is a nice touch. \n\nWent with a gaming friend and he freaked out about Killer Queen, not sure what it is but apparently it's a big deal! \n\nWould recommend this place to friends, co-workers or even for a first date spot.", "author": "Alex N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Brewcade has an awesome selection of beer and are the only bar in California that has Killer Queen,  a 10 player arcade game. I come here all the time and everyone feels welcomed here.", "author": "Rusteen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-09", "description": "In a world where people dance upon light-up squares to gain points in songs that they don't even like, one bar had the strength to stand up and say \"8-bit is Best!\" \n\nNever had I realized that Ms. PacMan gave the much desired opportunity to play a video game and hold my beer at the same time! Are you sick of playing a game that requires both hands and no room to drink? Do you remember a world where small dinosaurs used color-matching marbles to stop the ceiling from falling on their heads? Did you memorize Chun-Li's shoulder toss combination?\n\nThis is the bar for you! Finally, there is a place that combines the joy of crafted beers and games with the flare and color of the arcade from Tron!", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "This place may smell bad but, it's pretty damn cool. Such a blast to the past with these games. Except then I couldn't drink. Now, drinking makes losing at Frogger and Paperboy that much easier.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "I like the idea of old school arcades and a good time with friends and this is a pretty chill spot. Drinks are a little overpriced but it is a good environment for a fun and chill nights that bring back childhood memories. Will be back.", "author": "Q W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "This place was the raddest. Went with a friend, played all their fighting games, their racing game, and a MICHEAL JACKSON THEMED BEAT UM UP where you kill people with dance and turn into a robot. They make a peach wine slushy that's wonderful. Would go again.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-08", "description": "You would think that a bar + arcade combo would be way cooler than this, but unfortunately Brewcade just falls short. The beer selection is sort of limited, but decent. The games themselves are clearly targeting a specific demographic, which is fine, but it's seriously so cramped in there, no one can play games next to one another.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "Great place. I hope it does well. There is a huge beer selection, some quite expensive. I got a $5 Saison farm ale I really liked.\n\nThe games are well maintained. There are many single game machines, and a few multimode ones. Many of my all-time favorites were present, and I really enjoyed playing them. My one frustration was that the Defender on the multimode had a bit of an unorthodox layout I couldn't quite get used to. However, games on the multimode that have a more conventional control scheme were just great - e.g. Joust, Robotron (yay!).\n\nThe have a Street fighter II Turbo edition (the one true version if you ask me) that is in fantastic shape.\n\nA special treat was the co-op 15th anniversary edition of Dig Dug. I was a big fan of the original, and this is a very fun variant, particularly for co-op play.\n\nThe employees were friendly and likable. The owner really knows his stuff about games. \n\nOne piece of constructive criticism - the coin slots are kinda hard to see. I understand getting the coin slot lights working is less important than maintaining the games themselves, but maybe there's an easy way to improve this (paint around the slots, some sort of subtle floor lighting?)\n\nThere's great 70's and 80's music playing on the jukebox. Shooting robots with \"Brick House\" playing in the background takes me back. All-in-all, a wonderful experience. I'm sure I'll be back.", "author": "Carter S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "A must visit for beer and classic arcade game nerds a like. It is a bit crowded around the gaming area, as someone else mentioned, though in some ways I think it may add to the classic arcade feel. Beer selection was good (even had a great sour on tap which always wins points for me), and the girl working (I wish I had asked her name!) was very knowledgeable and helpful.\n\nWe went on a Saturday afternoon so it wasn't insanely packed, but we were told that it gets crazy at night. I'm definitely a fan of this place! They have plenty of classic staples as far as games: Joust, Track &  Field, 1942, R-Type, Pac Man, Mario, a few multi-cades with things like Burger Time and Puzzle Bobble on them...basically, just go check it out.", "author": "Sara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "Awesome arcade games, good beer selection, and solid atmosphere. Only downside is it gets a bit crowded, so you may end up waiting for the games you want to play.", "author": "ben r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "I'm not really sure how one could go wrong with an arcade that serves alcohol. The vibe was friendly there and the bartender was also super nice. Also love the self serve water near the magnet board with alphabet letters to play with, which speaking of magnet boards is also an entertaining way to spend your time there if you're not so into Donkey Kong..", "author": "Katie N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-28", "description": "Compared to adult arcades in Philly and Chicago this place is subpar. Limited selection of games, tight space, and in typical sf fashion the games are more expensive!", "author": "Jason W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-27", "description": "Our gaming clan decided to meet up here since it was new.  If you're a craft beer fanatic, you will love their huge selections.  If you're a gamer, depending what era you're from, the selection in video games are limited to stuff that span during the early 80s.  I mean, some of these games are a little \"too old\" for us and we're not spring chickens either.  Not only the game selections are limited, but they're also a quarter or 50 cents to play!  Inflation is a b-tch!", "author": "Huy N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-30", "description": "Every single game I tried ate my quarters. Staff was basically  not interested, but maybe that's not their problem. I give it a meh.", "author": "Sandy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "Pretty cool spot. It has lots of arcade games (Killer Queen is cool if you have a big group) and great beer selection. It was a bit tight when I was here on a Friday night but hey that is city life y'all. I would come back!", "author": "James B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-16", "description": "Staff is EXTREMELY rude. They called last call so I bought my last beer. I set the beer down next to me (which was still completely full- I hadn't even taken a sip from it) and was talking to a friend. Less than 5 minutes after I bought the beer, one of the bartenders came by, took my completely full drink, poured it out and said we needed to leave because the bar was closing. I said that I just bought that beer a few minutes ago and asked why they would sell me a beer if they were just about to close. The guy told me that the bartender would not have sold me the beer so late in the night. I then went over to the bartender with him and asked her to confirm that she just sold it to me but she wouldn't respond. Then 3 other bartenders came around me and started yelling at me telling me that it was my fault for setting the drink down on the table. They did not need 4 males to surround me (a small girl) and yell at me, which was honestly pretty scary and aggressive- when the only thing I did wrong was buy a drink at last call. I was so upset and shaken after this I decided to just leave and give up. I will NEVER let come back here and have told my friends to not come here because of the extremely rude and aggressive staff. This is not a way to treat a customer.", "author": "Katie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-08", "description": "Very pretentious and arrogant bartender. Also a lot of the games had broken joysticks. Other than that cool concept. I hope they get better. 2 stars maybe 2 and a half.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "This place is amazing, lots of great arcade games and amazing beers. Also, you can't leave without playing Killer Queen! You won't regret it. Andrew has been bartending the past two times I've been there and this guy is a beast! He was handling a full bar all by himself and I've gotta give him mad props. Go say what's up to him if you see him.", "author": "Christian H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-07", "description": "Made my first and last visit here last night.  A friend and I thought it would be a good place to get a beer before dinner at Hecho. \n\nThe service was so bad my friend and I kept confirming with each other that it was as bad as it seemed. \n\nPlace was empty. Once we sat at the bar there were a total of 6 customers.  It appeared the bartender was friends with another couple at the bar and talking to them was more important than helping us. \n\nThe 3 main issues were #1 We sat ready to order for several minutes. #2 My friend drinks non-alcoholic beer and they have no options for that and then the final straw was after I finally was able to order my beer, the bartender stood at the taps for 5 minutes twirling my glass in his hands while talking with his friends.\n\nThis was the point we just got up and left.\n\nBased on me telling friends about this experience and them telling me they're hearing the same thing from others, I don't see much of a shelf life for this place. \n\nWith all the choices and options, why businesses don't focus more on service and giving people a reason to want to come back is a mystery to me.  Especially when a bartender would know he's never served someone before.  Do better at making people feel welcomed.", "author": "Bill L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "I noticed things were a bit different when I walked by, so I went in.  The machines are spread out now, so you can play without being crowded.  They have two change machines and they have added pinball machines.  Much improved.", "author": "Bay G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-15", "description": "Had a good time here . There were beers and old school arcade games . There wasn't that big of a selection, maybe 30, but they also had pinball and a great 5vs5 game called Queen Bee. It's also next to a couple of other great restaurants and bars", "author": "Nick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-21", "description": "Really digging this place, it's nice to have another bar on the 37 line to belly up to while waiting for the ever undependable bus to roll through. The smoked bear and sour are my early favs, as are anything from Hen house brewery. haven't starting going through the wine selection yet, but although this place is beer and wine (and snack like jerky and chips and nuts) only, they have a fun little menu of \"cocktails\" featuring their beer or wine. Pop in and say hey to Kishanti, dude knows his stuff and has been very helpful showing me some and delicious brews. They also take credit/debit cards, which is quite welcome in this often cash-only-bar city.\n\noh, and they have a bunch of rad arcades, if that wasn't obvious.", "author": "Andy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "This place is perfect.  Great beer selection, nice staff and people to boot AND GAMES LIKE YOU WOULDNT BELIEVE", "author": "Scott H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-10", "description": "This is a great addition to the hood! Love that there's a ton of gluten free options with decent alcohol percentages cuz y'all know my priorities lol. Prices are reasonable but I think the gaming selection could be better. I'd love to see some air hockey and skeeball additions even though they're not technically arcade games. I'd also be down for some other classics like Q-bert, Toejam & Earl, and Sonic the Hedgehog. It's a good place to have a mellow time and chill.", "author": "Jill D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-02", "description": "Tekken was super fun - the other games not as much for sure... Love the broad selection of beer but the wine slushy was pretty nasty :)", "author": "Mariya L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "They have the perfect music to take a dump to and the rest rooms are nice and clean. They have a few varieties of beers which is good and they have a variety of don't take because they have you for a few variety of beers which is cool.", "author": "George G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-17", "description": "While in Portland I checked out a similar place called Ground Kontrol. It was amazing. Filled with 90s video games (Simpsons, X-Men, DDR, etc), beer, and a great atmosphere. When I heard SF had something similar I was really excited. To sum it up Brewcade is not a good arcade nor is it a particularly good bar. Not many good games and the drinks seemed a bit on the expensive side.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "I'm a huge fan of arcade games and beer. So, for me, Brewcade is an easy goto spot after work. The staff are super nice, the beer selection is great, and they have tons of games (including 4 different versions of Ms. Pacman). Pro tip: This is a great place to grab quarters for your laundry.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-17", "description": "What a piece of crap. I recently made a trip to LA and loved EightyTwo, a well designed arcade bar with lots of space, all the classic games (for the classic price of just a quarter) and plenty of pinball. Brewcade is classic San Francisco - over priced hype. What are these games they have? They are terrible and 80% of them I've never heard of before. What's worse is that the games cost fifty cents, which discourages playtime, and some eat your quarters. Most of the patrons are standing around talking about what a cool place this is but they aren't even playing the games. Sure, there is a decent selection of beer on draft, but that has become the standard for most SF establishments that in itself isn't worth the draw. The space is tight and poorly designed. It was worth it to check out but not interesting enough to stick around.", "author": "Anthony S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-05", "description": "Eh. Decent place for a beer but the arcade experience is disappointing. Fifteen minutes before closing, one of the employees killed a four-person game of pinball on the third ball. Not cool.", "author": "Stefan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-10", "description": "the neon is glowing\n         around the edges and family is\nround\nbeer with arcade\n      can it get better\nflannel\n\nlove e e cummings", "author": "Sean A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-02", "description": "You know that feeling of excitement buildup prior to opening that Xmas present then the wash of apathy the ensues: socks (channeling A Christmas Story Movie). Wanted to like this place and we did, but the novelty wore off quickly. Plenty of beer selections (big plus here!) but not much in the way of cocktails. Bring bills less than $20s since the change machine takes up to tens. Filled with guys that can probably write the code of these games on their phone.", "author": "Vivial S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "Very fun place to hang out, play video games, and have a beer. Great selection of local craft beers. Can get crowded around 10pm. Great atmosphere, great service.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-11", "description": "So here's the deal. I want to give this place 5-stars but as of Day 1, they are only 3. I will certainly check out this place as it evolves over the next few months but here's the rundown for all of those interested in checking it out. I want to be candid here so expectations are clear.\n\nPros:\n* Nice, big space and plenty of tables and seating\n* Good selection of beer & wine\n* Nice bouncers and bartenders\n\nCons:\n* No hard alcohol which could be considered a Pro too...\n* Quarter machine was out of order so it was a hassle for both customers and bartenders to constantly have to give/receive quarters. Waste of time and money for both parties\n* Only 15 or so cabinets. No pinball for all you pinball enthusiasts.\n* Those 15 cabinets are mostly filled by knock-off cabinets. What I mean by that is 5 or so of the cabinets are PC cabinet emulators that have 50 or so games to choose from. It's nice, in terms of selection, but loses the sense of nostalgia and accomplishment. Nostalgia is what's drawing people here but they fail pretty badly in retaining that sense of nostalgia. There's only a few REAL, authentic cabinets.\n* Cabinets eat quarters like crazy! Fortunately, they were nice enough to refund the ridiculous amount of quarters eaten.\n* Cabinets are squeezed together so there's not a whole lot of room to play. There was much bumping and drink-spilling due to the compact area around the cabinets.\n* Joysticks and buttons are terrible. There will be plenty of frustration from stuck buttons or non-responseive josysticks...\n* Here's the biggest issue with this place - MOST GAMES ARE $.50 A PLAY...I'm not trying to be cheap here but the fact that i have to play 8-bit JOUST or Tetris or Pac-man for $.50 is a bit ridiculous. Again, nostalgia is important in keeping people coming back but having to pay inflated prices for these games, kills that sense of nostalgia even more.\n\nThis has HUGE potential to be a great place and somewhere I would go on the regular. They just need to find a way to stop trying to make money off of their cabinets and increase their opportunity to sell drinks. Full liquor license is inevitably coming so that should help. Cabinets are expensive, but if they can get authentic ones, they'll be better in the long-run.\n\nLike I said earlier, I went Day 1 so there will certainly be some hiccups. I know things will get ironed out so I'm excited to see what comes.", "author": "Tommy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "Went here for a friend's birthday. It was fun. There are lots of fun arcade games we played as kids. I also really enjoyed the pinball games. I will be going back! The only problem is that you can't be too loud when you are outside the bar because of the residents. Which really doesn't make too much sense. If you're at a bar, loud noises are kinda expected. We didn't appreciate being shushed by the residents at 8:30pm. Still had fun though.", "author": "Tali N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "Tony (attendant) is awesome. Played Frogger and reminisced about childhood. Lots of beer choices. A good spot for a group to hang out and exercise their competitive juices.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-22", "description": "somewhat disappointing , however i do have high standards when it comes to #barcades, i hold these places to Chicago standards #headquarters #emporium", "author": "Dre P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "I LOVE Brewcade. I've been here several times and it's a blast. Fun atmosphere, great games, and tasty drinks!\n\nI would definitely try the wine slushy drink too. But be careful, it's deceptively strong :)", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Went here for the first time last night and had a blast! Having played videos games maybe 3 times in my life, Tony the attendant was super helpful. Homeboy knew his stuff and helped us pick awesome games all night.", "author": "M N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "Great location. In general the bar is a fun place.\n\nThe good: Not packed, no massive lines for the games, fun retro game selection, great beer variety\n\nThe bad: Some machines are pretty janky (bad joysticks, unresponsive buttons, blocked coin slots, eaten coins), very expensive beers, many emulator-based machines as opposed to original cabinets, pretty loud.\n\nI would absolutely go back. Brewcade is unique and fun, which makes it a gem. If they address some of the problems listed, it is entirely possible that this joint could be a 5.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "Some classic arcade games in a fairly tight space. I lost two quarters to the slot in one machine where the coins got jammed but the barkeeper compensated me for them. This was at around 3pm or 4pm when the bar was not that busy. They have a change machine for quarters. A solid 4 stars.\n\nSome Yelpers are complaining because their favourite games are not available. This seems a bit unfair as there is a wide selection of games. There are a small number of machines, probably 10-20, but some machines have multiple games installed, particularly the Neo Geo beast which has a *lot* of classic 90s games that I remember skipping church to play (read: \"old\"). It would be great if they listed their collection online though http://www.brewcadesf.com/our_games does not currently do so. \n\nThe selection includes: i) games with simple mechanics like Bombjack, Joust, Dig Dug, and Frogger; ii) games which have wide appeal like Puzzle Bobble; iii) vertical scrollers like 1942s and Moon Crestas; iv) platformers like Super Mario Bros, the Donkey Kong games, and Willow; v) shoot-em-ups like Metal Slug; vi) many, many beat-em-ups and slash-em-ups on the Neo Geo; vii) soccer games... You get the idea; enthusiasts and non-gamers alike should find something to enjoy.\n\nGiven the choice between arcade games and beer, I'm a dedicated button masher so I can't comment on their selection of cold ones.", "author": "Shane O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "My favorite bar in San Francisco.  The Michael Jackson \"Moonwalker\" game is the best.  The beer selection is good, though I do wish they had more cocktails.  Still, I'd choose this over almost any other bar in SF.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "As you can see, I don't write reviews. At all. However, I will for this place. The beer is great with a wide selection and the location is easy to find and big. They had one of my favorite saisons, saison du pont, which was pretty cool. The arcade games are nostalgic and fun, but what sets this place apart from other arcade bars is the cabinet with multiple arcade games inside. What I mean by this is inside the cabinet is a motherboard that holds multiple ROMs to choose from, with an easy to use selection screen and when I say multiple ROMs, I mean over 500 different games in just one cabinet. 512 to be exact. Their selection ranges from SEGA to NAMCO to CAPCOM to NEO-GEO. HUGE selection. I was oozing with nostalgia when I got to choose from any of my childhood arcade games. If you like classic arcade games, you gotta go to this place. If you like a wide selection of craft, local, and imported European beer, you gotta go to this place. \n\nA few suggestions: I was told that some people have a hard time figuring out how to use this cabinet, which I can understand. It's pretty self explanatory, but my first impression of it I thought it was a street fighter cabinet. I think if they put like a sign that says like over 500 games in one above the cabinet it would be easier to understand what it is. Also, make the instructions on how to use the cabinet more visible. The lighting in the place is dim, and the instructions are right below the screen in very small font. Because this is also a bar I can totally understand people who are a little tipsy to not read or look down at the instructions. Aside form that, it's great.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-08", "description": "3 beers = 33$ tip not included .......beyond whack, bring a flask play video games #nostalgic i guess", "author": "Johnny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "Great spot! Took my department here for a team outing and had a great time. Everyone loved it! Shawn and the bartenders were wonderful to work with and flexible to accommodate our needs. Great game selection and great beer offerings! \n\nWe will be back! Thank you!", "author": "Loretta R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-10", "description": "Was excited for this as a new option in the neighborhood, but had the life sucked out of me as soon as I entered last night. The music was awful. Completely lifeless space, and boring crowd. The guys looked like the type of dork in their 30's who has never kissed a girl--and they're straight.  \n\nAnd the Donkey Machine was broken.", "author": "Jeff F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "Great place. Had a happy hour here with my company. Had a few drinks and a great time playing older arcade classics. Only complaint is that its too crowded to go behind people to get to other machines when the place gets super busy. Would honestly take out the booths and put in smaller, standup tables in order to get that extra needed space. Great manager who pointed out where one of the games we were hoping they had was (Sunset Riders).", "author": "Sean C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-27", "description": "The beer was good. However, the layout is terrible and the crowd was a little too basic for me. After two beers, I had to leave because I needed a little more stimulation than some old arcade games that I definitely would not waste my quarters on. Make them a nickel and fix the layout...that could help.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-11", "description": "I'm disappointed with the bar tender more than anything else. I would suggest coming during the day when you can play board games, and arcade games your hearts content. And the beer is fabulous. It's too bad the tall black bar tender with a shaved head and dreadlocks was the worst bar tender  and not very nice at all.", "author": "Jennie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-10", "description": "Where do I start! This place is everything a guy can want beer, video games and food from hi tops.  Points off for not having all the beer on the menu", "author": "Pawel K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-14", "description": "Very let down by the lack of games and pretty poor selection of the ones they have. With Brewcade as the title I was expecting far more. This place doesn't touch any of the game bars in Portland or Denver for example. \n\nAside from that the bar itself and drink selection is pretty solid. But again the games were supposed to be the differentiator and they are meh to poor.", "author": "P C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "Even though it isn't purple, try the grape drank--its slushy meets wine. What a great concept!", "author": "Arvind R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-12", "description": "They have BurgerTime! That game speaks for itself! Great atmosphere to be a kid and an adult at the same time. Definitely coming back!", "author": "Michael V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "Incredible draft selection that is larger than the selection available at most good bars and is better quality than you can find just about anywhere. Obscure drafts, reliable go-to brews, all around delicious. It was hard to make a decision because of all the great options.\n\nGood selection of arcade games, space is laid out nicely. Plenty of room to sit down or stand. Excited to check it out when it is a bit less crowded to get more game time in. My new watering hole!", "author": "L M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "STOP IT with your not 5 stars meanies. This place is the bomb. Frozen champagne delight? What ? Whaaaat? Brynna behind the bar? Whawhat??? ARCADE games of the OLD SCHOOL stature? Check yourself four stars and below.", "author": "Laura P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "if you love old games like bust a move by taito, you can play it here while drinking beers on draft, gluten free omission beer in bottles, frozen slushy wine, hitachino nest, lots of great options.  if arcade games don't interest you, you can also play board games or the boxing game!", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-28", "description": "I'm not really into arcade games, but I had fun here.  They are still trying to figure things out as the bar is super new.  The bar tenders are not seasoned, but are very sweet and attentive.  I love that they have a lot of seating and that you are able to order food from other places and eat there. I recently spent a Saturday night there playing card at a corner table. FUN! Also, they have a great selection of sodas, if you don't feel like beer or wine.", "author": "Skye W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-28", "description": "Some good beer, but I would call the atmosphere anything to write home about. They also have wine on tap - that was a nice option to have.", "author": "Nathaniel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "Kai has done an amazing job with this space!  Solid draft list, service with a smile, and totally awesome classic arcade games for 50 cents a play!  Not to mention it's a huge space.  I've been waiting for something like this to pop up in Duboce. As an added bonus you can even order food from Hi-Tops across the street.", "author": "Natasha K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-22", "description": "I love this place. Nothing better than brews and games. The space is a little small and it gets pretty crowded in there. Also, there never seem to be enough bartenders. But overall, can't say no to this place. Beers and retro arcade games? I'm down.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "I found this bar to take my boyfriend to while we were visiting SF. He loves his video games and classic arcade games. When we walked in were were immediately excited to see a Mario Kart tournament being projected on the screen above the bar. They have a huge beer selection and a good variety of classic arcade games: frogger, pac man, donkey kong, centipede, to name a few. The bar was not over crowded when we went so we could walk right up and play any game we wanted. Definitely a great place to grab a few beers and play some games.", "author": "Dana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "They have DONKEY KONG. Old school donkey kong!!! This is not the place for the new school, these are the games of the arcades when they still existed. And fresh, local brews on tap. We came for a work happy hour and left way too late to be productive at work the next day. And you've got to try the Purple Drank. It's pure class pouring out of that slushy machine.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-20", "description": "Eh. I really expected more arcade games or at least some board games or something. There are about 10 arcade games. The line gets long and the machines eat quarters. \n\nThe beer selection is good though...", "author": "A K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-13", "description": "Glad my friend brought us here, because I do like trying new things, but I can't see myself going back willingly. The beer selection is decent, if on the pricey side. I like the big, frosty, glass mugs they serve in. I'm lukewarm on the beercade concept; it's a great idea, but not really my thing. What pushes this review down a star is the unfriendly service. The bartender's disdain of our party was visible (he had the look of a freshly drenched cat) from the moment we sat down, I suppose because we weren't three young hotties, but people who were as classic as some of the arcade games. I guess that's what I get for being old. If you're Too Cool for School, you will probably love this place.", "author": "Joe V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "The beer selection & nostalgic atmosphere is awesome! Snacks, old school video games & especially the great wine on tap are amongst my favs here.", "author": "Kahele C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "This place is a GEM and I think that a lot of people who reviewed don't understand what a barcade should be like (since they haven't been legal very long in California as well, which is fair).\n\nGrowing up in Chicago, I have been to my fair share of barcades and this was definitely my absolute favorite! Yes, the machines are close together (the more the merrier as far as I'm concerned), yes, sometimes they jam or are out of order, this is normal and what happens when you have tons of amazing old arcade games! \n\n\"Videogame Bob\" has been in the industry for a while and was super helpful anytime we had a question or a machine jam.\n\nMost of the cabinets are modded to play 200+ games including Mario Bros, Donkey Kong, and PacMan! I played up to level 20 on the new 50th Anniversary PacMan game with my friend and we had a blast!\n\nI will be back for sure in the near future and am telling all my gamer friends to check it out because I know this place won't disappoint! :)", "author": "Suzie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "Great video games and beer selection. The atmosphere is good if you like house music over the sounds of the pinball games and arcade games. My beef is that the bartender went out of his way to ignore my friend and I. We were asked what we wanted, and we needed a few more minutes to decide. He helped some other customers who were ready (as expected), but then other newly arriving patrons would step up right next to us and he would help them first (I'd say 10+ people, or 20-25 mins.). It was painfully obvious he was concentrating so much attention on not serving us or looking at us. When he finally begrudgingly asked us what we would like, he took our money too. He served about five other people before bringing back our change (still no beer). My friend finally got his beer. Then the bartender was greeting friends and chatting with some other patrons for another 10+ minutes, before I had to specifically ask where my beer was. I suppose not having our minds made up about what we wanted to drink immediately, offended him to no end. Since he was attempting to give us the worst service ever, I must commend him for a job very well done.", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-15", "description": "One star for the beer, one star because I guess I'm in a good mood, minus a zillion stars for terrible-condition and overpriced gaming units too packed right together to even use, plus no sound?!?! Instead lame techno house music? Weird crowd. Annoying bouncer. Indifferent bartenders. Uncomfortable seats. I dunno. High hopes but no luck. Wah wah.", "author": "Clark L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-26", "description": "When I arrived I was very happy to see some of my childhood favorite games such as Rally, 1945, Dig Dug, etc... The excitement worn off as my quarters were being eaten and games not working. One after another, every game I tried to play ate my quarters and didn't work. I really wanted to play. Very disappointing.", "author": "Y G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "Good beer and fun games.  But not a fan of the layout.  The tables in the center really make it hard to get around the bar.", "author": "J E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "This place is quite cool and this stretch of market is really picking up. Good for large groups and copious drinking. Only downside is that the games seem more like a gimmick than a feature... I wish they were free (or at least have a working change machine).", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-14", "description": "Great selection of beers! Pricey though..  Had fun playing the games. Nostalgic. Hope they increase there playlist. Some arcades in chicago charge a little more for booze but the games are free.. cool concept..  Smelled like bleach when walking in... yuck.. Bartender handed me wrong ATM card... aggravating. No legit phone number either for establishment... Had to trek back across town to pick mine up. Hey! Since I had to spend money to cab it down how about a beer on the house? I sure was thirsty..  Would of been better than a \"sorry about that\".  Pfftt.. Small industry.. take care of your customers.. specially if you mess up. Many of us are bartenders, servers and managers at other places. Not the way I would of handled the situation. And yes I do take some responcibility for not looking at my card when it was handed to me. But the trust is on you when I hand you my source of payment. Anyways... thanks for a fun time. I will be back. ;)", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "As a consumer I was very satisfied with this establishment. I went for the first time on a Friday night and they even had the Teenage Mutant Ninja Turtles movie playing on the big screen, classic! I feel that since classic coin arcade machines are the selling niche for this place, a well stocked change machine is key for it, which this place totally has. Never did i have to worry about the dreaded orange light like from the laundromat. You're not going to be able to enjoy your beer if you have to keep bothering the bartender for more quarters. Second was management of machines. I actually like how there is a staff member who goes around and directs people on beverage placement for the machines. It shows they care about the machines and as a fan of these select classic titles, I want just as much care shown to them. Now granted their selection is limited which I know they get flack for, but they did have some good ones like joust. Felt like they cheated a bit with the emulator arcade shell, but overall I think is a success on this take of a barcade theme as it would be easy to mess up on. Bar setting feels slightly on the trendy side making the bar and gaming area feel separated. I would have liked to see more a design blend where the bar has more an arcade feel to it, but I guess they wouldn't want drunk people trying to put quarters in the keg fridges. Easy public transport access, will be back again!", "author": "Sanger S."}
