{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Have been watching this female gardener working in the park while ive been walking my dog shes always doing a fabulous job keep up the good work park looks nice she also is very friendly one of my favorite parks i feel like im in the great out doors", "author": "John K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "I had always seen this park while visiting Haight street as a teen and thought it was just the park where the wannabee hippies/homeless/druggies hung out on the grassy knoll.  I didn't realize it was an actual open space area and expanded really far back up the hill with trails, lots of trees, and views.\n\nThere are a lot of different views throughout the park of the Golden Gate Bridge, downtown, Sutro Tower, and the southern part of the city.  It's not a destination viewpoint onto itself like Corona Heights or Tank Hill but it's nice to stroll along and admire different views throughout your walk.\n \nFor a hike there is enough incline to get a work out and kick your butt yet it's not too long so if doable for a hike after work before it gets dark.  Many paved and unpaved trails zigzag through the park so it depends on which trails you use but in general it's about 45 minutes-1 hour/1.5 miles to go around.  For something longer it's best to add Corona Heights/ Vulcan stairs which are like 5 minutes away.", "author": "Joan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "I had never actually walked through Buena Vista Park. It is near Ashbury Heights and Haight Street. I went with a small group(Urban Adventure) and that was ideal for this because I wouldn't go by myself at nighttime. It could be creepy as Joan W. says. We had started Twin Peaks Bar in the Castro and walked to Corona Heights Park and over to this park. The walk took maybe an hour. I do recommend this path in the city if you have company.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "This is one of my favorite parks to take my 1 year old husky. You're likely to see at least a pup or two off leash here on any given day. Often dog walkers bring their dogs here as well in fairly large batches but most are not looking to socialize and may have some \"pack mentality\". The top of the park though has a really cute patch of stone and grass (pictured) which dog owners do gather on top of on weekday mornings (typically before 8am) if you're looking for a fun play group for your pup. There's also a sandy dog run lower down in the park where dogs come to run. It isn't too far from the street though so make sure your dog is good with recall if you bring them. Plus, every now and then you'll see a coyote warning sign - I have yet to spot one myself but I've heard of other dog owners who have. Best to keep the smaller dogs on leash!\n\nIf you're just looking for a nice walk, this park is for you, too! There are so many little trails and turns you can take that you can easily spend over an hour traipsing through it. And the view of the city at some points is just wonderful. I'm myself a big fan of how green and woodsy it feels. Still can't believe such a great cluster of trails and trees exists right in the middle of San Francisco!", "author": "Diana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "A 37 acre forest in the middle of the city? No wonder people call San Francisco the land of Oz, there are so many magical things to discover.\n\nI confess I've only walked around the edges of the park but I mean to venture up the steep paths for a good workout rewarded by spectacular city views including the Golden Gate Bridge.\n\nIf you're going for sunset views, go in pairs or a group. There are some aggressive homeless and people who aren't quite in their right minds (that's why there are plenty of undercover officers near the park, especially on the Haight Street side, who are \"holding.\"\n\nYeah, they're holding alright: They're holding handcuffs and a shield and a gun! \n\nOverall very quiet, this neighborhood surrounding the park is one of my favorites in the city: Long, winding streets dotted with both single family homes and large 1920s apartment buildings and incredible mansions make you wistful you were one of the 1% though until 20 years ago, this was still a middle class neighborhood with pockets of wealth.\n\nAnd I wonder as I drive along the Buena Vista Terrace towards Upper Market if actor Danny Glover still lives here?", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "Quiet forest in the city\nBuena Vista Park is a hidden oasis in San Francisco. On the map it's not huge, but in a city like SF it can easily be missed. When you're tired from walking and you decide to hike these trails, it's more tiring. But it doesn't take too long. It's unpaved paths, with manmade wooden steps. Dogs are welcome. There's even a playground in here too.\n\nIt has a great view at the top, but since you're not that close, everything does seem small in perspective. It's well maintained. I see staff picking up garbage. I did notice a few tents in the park, most likely homeless people living there. But which part of SF doesn't have homeless people?\n\nIt's not far from Haight Street and Golden Gate Park, but if you're searching for a short uphill hike, this is a great place.", "author": "Vincent H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "It's the park that changes personality the further you go in. \n\nFirst of all, if you look at the address you will note that it's very near Haight-Ashbury, so you'd expect that it's crawling with spillover tourists and/or other looky-lous. But reading through the reviews, you'll find that not always do the locals even realize it's here. At the bottom along Haight, however, you do notice some spillover from Haight-Ashbury, but it's the hippie type. I mean, there were A LOT of people parked there at the bottom of the steps and at the corner, rolling their joints and otherwise administering their freshly obtained Mary Jane. \n\nIf you only have a couple of minutes, just take the drive around the road that borders the park and connects you back to Haight. You'll see the personality change along the way. From the legalize crowd, you'll quickly ascend to a cleaner-cut crew of beautiful homes across from a more wooded park. In fact, Buena Vista is kind of a jungle of trees and walkways on the exterior, with nice (but not ostentatious) homes along the exterior.\n\nWhen you get to the top, you'll see the other Buena Vista. The dog-walking, people bustling, amazing views of the city and of the Golden Gate Bridge version. \n\nThis seems like the kind of park that you should at least plan to see if you're in the neighborhood. Tourists, listen up--grab a meal to go and come picnic here. Locals, make it a weekly routine and take a different stroll through/around/near the park once a week and see what's new, and also how it changes. Ya, it's super steep as it's carved into the hillside, but you'll get some sexy calf muscles along the way.\n\nMe? It's the kind of place where what I really want to do is grab a small box of varied chocolates, take a walk into the deep wooded interior, find a small patch of grass or bench or two rocks to sit on, and sit and share the chocolates and plan the rest of my afternoon.", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "By far the best park I have ever been to. It's literally a forest in the middle of a big city. So beautiful, definitely will come back. \n\nThere's a coyote alert so beware", "author": "Art G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Overall - a gem in the city.  Admittedly, I'm biased when it comes to this one...it's my neighborhood park, and I am exceptionally grateful to have it right outside my door.\n\nBuena Vista Park is a little bit of one of those great finds that you keep missing even though it's right in front of you.  I had seen it plenty of times as I passed between upper and lower haight and not even given it a second look.  It wasn't til I moved into the neighborhood that I discovered what a great (large) park it is.\n\nWith its hilly terrain and being nearly covered w mature trees, BV park can almost make you forget you're in the city. The forest-y aspect of it sets it apart from most of the City's other green spaces that tend to be wide open spaces. The paved trails, ample dog owners walking their pets and the peek a boo views of the city remind you that you are in the middle of the city, but park is a lovely sanctuary from the rest of the concrete jungle of SF.\n\nThe trails are numerous, there are tennis courts tucked away on the southeast side and if a grassy knoll is more your style, there's one of those on the north, Haight Street side...admittedly with an interesting representation of SF residents. There used to be a view of the bridge that was framed with trees such that they looked like a heart, but either the trees have grown and so it doesn't look like that anymore or I just haven't found the right look out point.  \n\nOnly downside to this park - there are some resident coyotes.  No threat to humans, but you should probably keep your dog on its leash if it's small.", "author": "Sara E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "very nice place. dog friendly. I went there at around 9am on Sunday and i was able to find a parking space easily around the tennis court. there are a bunch of trees so you won't be exposed to being under the sun which is really nice.  But what's bad is that it doesn't have sign everywhere to tell you where this road takes u too.", "author": "Tina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "A beautiful park that makes you forget you are in the city. There's some hiking trails and steps that can take you to the top of the park and get a nice panorama view of the city. A bit of a workout going up but the hike is quite short and maybe takes only 15 minutes. Truthfully, the harder part is going back down the steps since the steps are so wide. \n\nAt the top, it is a very tranquil spot and a wonderful place to just sit and enjoy the wonders of Mother Nature. There's not many tourists here and a lot of locals bring their dogs here to run around the paths. There is a small children's playground in the park.", "author": "Diana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "My friend and I wanted to hit our Fitbit 10,000 steps, so we decided to hike the hill of Haight Street. We stumbled upon this park after seeing a guy walking his dog up the hill. We saw the walking paths with a few steps to the top, so we decided to check it out. What a nice, peaceful park with beautiful, majestic trees. If I lived in San Francisco, I would walk my dog here all the time.  There is the nice garden at the top of the park, with some great views of the city. Perfect place for a sunrise morning walk, or even to sit in meditation and reflection.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "Beautiful park with breath-taking views!\n\nBe prepared to go walk up and down a ton of steps so dress properly. When my boyfriend and I went here, it was kind of foggy so we weren't able to see the best view.\n\nDefinitely will love to come back here again.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-06", "description": "A great local place to take a short hike without crowds of people. It is a bit of a workout making it to the top. From the entrance, you'll already have a beautiful view of the city (though obscured a bit by trees). **Views from the top are obscured by trees as well, but if that doesn't bother you as much then it's still a nice place for a stroll. \n\nYou'll make your way up a couple of hills and then a series of stairs. There's actually two \"tops\" so to speak, both with great views of the city. You'll think you've reached the top when you see a bench facing the city (as seen in one of my photos), but it actually goes up a bit higher, and the top-top has more seating area. \n\nPARKING: street, plenty; didn't have any problems finding a spot", "author": "Vivian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "Such a beautiful and picturesque park! One Sunday morning, I wanted to go on a walk from Castro to Haight and came back via Buena Vista Park. The greenery makes you forget about being in such a huge city. There's plenty of paths to take with minimal tourists here. I would definitely take out-of-town visitors here to this San Francisco gem - now one of my favorite parks in the city!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "This is my favorite park in the city.  It's one of the only ones where you walk in and really feel like you're in the woods.  The city noise fades fast when you walk in, and there are plenty of places to go.\n\nThe walk to the top is a bit of a workout, and the trails can be a bit confusing to follow, but I rather like it.  The view up there is mostly obscured by trees, but there are a few spots where you can still get some pretty wide views of the city.  The park is better suited to walking around and exploring rather than sitting and chilling.  I like it a lot and can't think of a better place to wander around.", "author": "Lars T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Great park in the middle of the city.  Views of the city and Golden Gate Bridge are incredible.  Minimal general level of fitness required to get through (did it with my 6 month pregnant wife and two kids, 4 and 6).", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "I used to live around the corner from this park and would run there regularly. It's absolutely beautiful! And made a 20-minute run feel like a big accomplishment (hello hills!).  \n\nOn a clear day, it offers a gorgeous view of downtown. The tip-top of the park is one of the most peaceful places in the city.\n\nThere can be some sketch characters around, but the park is mostly filled with dog-walkers.", "author": "Sabrina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "As a Bay Area native, I am embarrassed to admit that I had never walked into Buena Vista Park before last weekend. Like most people who don't live in the immediate vicinity, my default choices for bucolic frolicking have been Golden Gate Park, the Presidio or Dolores Park where spaces are more wide open. But if you like a little more elevation (575 feet high) in a condensed forest, then Buena Vista does the trick, all 37 acres of it. Jamie W. and I just happened upon it because we were at the Castro MUNI station, and out of sheer randomness, I suggested we go north on Castro versus our usual route of going into the Castro. Jamie was a good sport, and we trudged our significant arses up 15th Street and then Park Hill Avenue where we were greeted by a large rat only to find a long flight of steps beckoning us.\n\nFrom there, it was just a quick stroll to the summit where there were already a herd of camera-wielding European tourists and a couple of dog walkers, all of them taking in what we could see of the view through the trees. The best view from here is toward the Golden Gate Bridge, but you have to position yourself just right for your obligatory photo op. We then descended down toward the west where there is a genuinely nice view of St. Ignatius Church and the NOPA neighborhood. You eventually find yourself on Haight where the grassy area is festooned with what looks like the remnants of Woodstock or at least Burning Man with a lot of hippie types in all sorts of horizontal positions. The smell of weed was thick, and if it were better quality, we would have stayed. But no, it was time to leave the park.", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "An Off the Beaten Path Park with Beautiful Natural Scenery, Incredible Panoramic Views and Hiking Trails! \n\nMy mother and I visited Buena Vista Park during the afternoon of August 1st. \n\nWe had been exploring the Haight-Ashbury neighbourhood and ended up wandering further down Haight Street, when we discovered Buena Vista Park. \n\nThe park is basically a large hill with walking trails winding through the densely wooded landscape to the top of the hill. \n\nWe entered the park and began hiking to the top. The hill was steep and I had to take frequent breaks as I climbed. It was a really exhausting and tough hike, so be prepared for a great work-out! The scenery along the pathways through the forest were beautiful. The trees were so huge! We finally made it to the top of the hill, where there was an open grassy area and a clearing in the trees, with a park bench overlooking the entire city. \n\nI hadn't realized how high we had climbed until we made it to the top and saw the amazing panoramic views of the surrounding city! They were incredible and we took some time to relax, admire the views while taking lots of photos, and absorb the fantastic natural beauty around us. The atmosphere was so tranquil and calm. It felt like we were in the middle of a secluded forest and not in the middle of the city. \n\nWhat (pleasantly) surprised me, was the fact that we only saw two other people in the entire park during our visit and we pretty much had the whole place to ourselves. \n\nBuena Vista Park is definitely an off the beaten path, hidden gem in San Francisco. With stunning views and beautiful natural scenery like what this park offers, this is a must-visit for nature lovers, fitness gurus, and those looking for an off the tourist track experience. I thoroughly enjoyed my time at this park and it was well worth a visit!\n\nShhh... Don't tell anyone how great it is. I want this place to remain a secretive hidden gem!", "author": "Brittany T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "This place is a gem within the city. Great views, trees, and Adah's stairway. If you don't know what that is, let me tell you...600 steps of pure cardio heaven. I love the curvy roads going through here. Definitely worth a stop.", "author": "Arden M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "This is actually my favorite park so far. Not that I've been to many but the city views and the feel of the neighborhood is so gorgeous and welcoming. Wild flowers and huge aged trees.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "This park is like a rainforest in the middle of the city without the humidity, monkeys or giant spiders (I've trekked through the Amazon--I know of what I speak). The foliage is really dense in certain parts and even when you're walking along clearly paved trails, you feel a hush in the air that's partly due to all the surrounding vegetation. Bonus: blackberry bushes. Lots and lots of blackberry bushes.\n\nWhen you get to the top, the view is stunning with the added bonus of being able to see even higher peaks like Corona Heights Park not too far away.", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-17", "description": "Not sure why BV Park gets as high ratings as it does.  The views from the top are negligible.  The views from a bit below the summit on the north (Haight St side) are better but still not as good as other locales.  Maybe it's the large grassy area adjacent to Haight St?  I dunno but if this park hadn't been on my hiking route down to Haight St I would have been disappointed.  I guess I'm glad I've been there and delete from my list of places to visit.  Go elsewhere for views of SF.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "My favorite place to jog. I enjoy getting lost in the foliage. The untamed trails and tall trees  - I love. Lots if uphill trails.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-11", "description": "There was a bunch of grass on the stairs. Got to the top and there were dumb old trees blocking the view. I can't believe I wasted my time here. Go to a different park.", "author": "James B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-27", "description": "There are tons of steps at the park.  Up and up you  go finally,  Look at the tree tops.  It used to have the best view anywhere,  the trees cover most of it.", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-15", "description": "Homeless encampment. Hardly a view because of the shrubs. But good park to jog. The stairs will will make you sweat.", "author": "Michael Angelo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-25", "description": "Hanging in The Haight With Dogs would be a great name for a song. Or a sitcom. Or a doggy vegan cookbook. \n\nMy pal Jon A took his dog Noam Chomsky and I* to Buena Vista to check out the views and get Choms some much needed exercise.\n\nBuena Vista is 37 acres and was in Vertigo. Thanks Wikipedia. She is a magical hilly forest that stands tall above SF in Haight Ashbury.  \n\nThe views are a tourist's dream, so if you're not from the Bay Area you should definitely check this park out. Buena Vista itself has many playgrounds, types of massive trees and butt-loads of homeless partays at night. \n\nSidebar: If I was a homeless person who hung out a lot in BV I'd definitely call my posse the Buena Vista Social Club. \n\nPEPPER'S PISSED: About one particular dog owner whose dog body checked NC hurting his precious paw. If you're a dick then your dog will be a dick so do everyone a favor and use a leash and try not to procreate. \n\n*Fun Fact: We are all gingers. Even cutie pie N Chomsky. What a peach.", "author": "Evelyn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-18", "description": "Though Buena Vista Park isn't necessarily the kind of park that I'd recommend wandering around at night or early in the morning in by yourself, it still remains one of the most under-rated parks in the San Francisco area. It boasts some of the most stunning glimpses of the city and beyond - up in it's hilly foliage, and if you're looking for an energizing walk and solitary escape to nature  - it's full of great inclines and hidden treasures.\n\nAnd random fact(ish): I listened to Rich Girl on repeat here for at least 40 times - a little while back.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-07", "description": "I hiked up here in the mild rain one afternoon. Much do prefer this park over say.. Bernal Heights'. Here, there's also the Saturn Steps and the Vulcan Stairway to ooh and aaah over---not to mention the great houses to enjoy. Randall Museum is just a hop/skip away, and all the plethora of cool eats just down the hill.\n\nDriving up Levant Street was a trip! Brilliantly located park in the center of it all... lovely  trail... more 'character' to this park perched atop a hill.", "author": "Jana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-12", "description": "This sprawling park is a plot of Narnia plopped in the middle of the bustling city. Though a favorite among dog-owners and groups on the weekends, Buena Vista Park still manages to give you that magical hush that comes from being a hundred miles from civilization. When you first enter the park through one of the entrances on Haight Street, you can trek up winding paved paths that zig zag up the face of the hill. It's a manageable walk, but the going does get steep in some sections (so bring the sneakers and leave the little kids). For the more adventurous (and less patient), there are also a whole network of off-the-beaten-path stairs and trails that cut through the dense groves of the pines and oaks that grow here. On your way up the slopes, you can catch glimpses of absolutely breathtaking vistas (thus the name!) of the city skyline through the foliage. \n\nThough there are grassy slopes towards the bottom of the park near Haight for people who want to picnic and socialize, the park itself is a mini wild patch of land and more suited to being a walker's paradise-- the soothing calm it offers visitors is perfect for soul-searching and thought-sorting.", "author": "Esther W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-11", "description": "A great place to take a stroll and relax.\n\nEvery single one of my visits has included the following:\n\n*A long hike up a hill\n*Sweat on the brow\n*Seeing a homeless person urinate\n*The downing of a 40\n\nI love this park. Find a bench and down some of your favorite malt beverage.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-04", "description": "San Francisco is a place of heart.   It is a place where things come together and break apart and come back together again.  It is a place to build memories, to take photos, to experience life to the fullest and to take that knowledge and share it with the world.  It isn't surprising to me that the technology industry is here and booming because this is where ideas emerge and radiate.  \n\nWhere am I going with this rambling review?  Well, I've had ecstatic walks here, hopeful walks and just as sad goodbye walks.  If the hills at Buena Vista Park could talk, they would tell of mixed emotions of my short timeline in SF, as well as, of those of others. \n\nI love my city by the Bay.", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-17", "description": "I grew up in the bay area, and never knew this place existed! Me and the BF took a short trip to the bay, and I took him to Golden Gate Park. I thought we could take the bus to Haight-Ashbury, and walk from there to the park. On our way, we spotted this fancy grand staircase that looked like it led to someplace magical. \n\nWe were curious, so we made our way up the stairs. It seems there's a couple pathways once you get up there. They all went upwards. So we continued to climb up. On and on we went, and we could begin to make out a view of the bay. It was slightly foggy that day, so we could only see glimpses of the Golden Gate Bridge. We continued to climb all the way to the top, and it was a pretty awesome view from up there. \n\nI wish there weren't so many trees so that you could overlook the whole city. There's a little bench up there, and it's pretty romantic. I wish we had a dog to bring with us. There's a little dog run somewhere in this park where you can let them run around and play.", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-17", "description": "WOW! What an amazing park! May just be my new favorite one!\n\nJust went here earlier today, hiked up to summit, and was rewarded with a beautiful view of SF. Amazing. Definitely bring a camera with you!\n\nIt's a great place to run, bring your dog, have a picnic, or to have a leisurely walk through. Perfectly safe during the day time, plenty of parking on the one side street, and I would highly recommend treking up to the top, it's a little steep, but not a far walk at all..it's quite fun! :)", "author": "Akvile D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Beautiful view. Very relaxing. Not too long of a hike so don't expect a great workout. Unless you run through it. I still loved it because it's in sf.", "author": "Gol L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-10", "description": "Don't let this park fool you: this shit is STEEP. \n\nThe views of the city from the top are amazing, but it's a nice workout to get up there.\n\nBeware of people having sex in the bushes, needles and spooky homeless people. I'm not saying it's a dangerous park, I'm just saying it's not a walk in the park. Wait, that didn't make sense. \n\nSeriously, go while the sun is out unless you're into Senator Craig-type antics.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "Spectacular views, long winding trails that I can race my remote control 4x4 trucks on right in the heart of the city. What's not to love?\nThey are doing a ton of upkeep on the park right now and it's looking better then ever.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-30", "description": "We need to cut down those trees at the peak so that we humans could enjoy the view of the city - the human creation made of steel and wood.  Oh wait, that would defeat the purpose of having nature friendly parks.  \n\nBut seriously, I was expecting a better view from the top of a park named Buena Vista, but 30 yard radius grass platform at the peak is nice for a picnic, but trees blocked majority of the view.  Far better unblocked view of the city could be found at Corona Heights (http://www.yelp.com/biz/tGCFC0PTjLbU5m7Euw2NJg?hrid=r9ks4E3Hngro7vrktND4Mg) next to Buena Vista Park.\n\nThere is good number of free street parking on Buena Vista Avenue.  While there are several paths up the hill, if you would like to minimize the climb, park at a higher altitude location, perhaps around corner of Buena Vista Ave & Upper Terrace.  From there, there is a paved road (not accessible via car) that is not a steep climb that leads you to the top.", "author": "トモ T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-20", "description": "This is a very nice park in the middle of the city. I know that a lot of parks in San Francisco can get a bit busy with people but I never found that to be a problem here. It's nice, quiet and relaxing. Sure, there's people out on a jog or people walking their dogs and that's about it. \n\nThe path to the top is really not difficult. There are some nice easy paths and there are stairs, all of which are shaded by the trees. Although there are some very nice views from the top, there are lots of trees in the way. Howver, this park can be enjoyed on its own terms and not just for the views.", "author": "JD R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "I love this park. I just moved to the area and I will definitely be frequenting these steps. Its a good work out at its peaceful. If you can block out the faint car noises from the streets below and listen to the birds, you almost feel like your in the middle of the woods no where near a city.", "author": "Kelso H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "Great place to take your dog! I live in the neighborhood and bring my dog here often. He loves wondering around and meeting all the other puppies. It is great exercise to explore the park and the views from the top are beautiful. I would say to avoid the park after dark, but otherwise I come here 1-3 times a day.", "author": "Aili P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-03", "description": "It's no Dolores Park but a the walk to the top is worth the view.", "author": "Louis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-18", "description": "Really? I must have came on a clean day. Friendly people about, not a speck of litter, a few characters but that's to be expected. It was a gorgeous hike to the top and well worth it. (It's really not that steep, just enough to keep you healthy.) I would love coming here all the time if I lived close. Perfectly serene at the top, isolated from the hustle of the city, panoramic views showcasing the Golden Gate and beyond. Fun little paths that you never know where you'll end up.", "author": "Naomi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-23", "description": "I come here almost every morning with my dogs, fog and all.  They absolutely love it.  I actually enjoy the cool feel and eerie look the fog evokes when cascading down the hill through the trees.  The air is always so fresh and even humid sometimes. I often feel transported to a South American Rainforest. ahh.\n\nI generally prefer to start from the bottom of the hill at the dog run, then work my way up the concrete trail. Its a great early morning workout and the hills are abundant.  Once at the top the views are remarkable.  Even when it is foggy you can still see some of the view.  There are many trails to choose from and I try to explore different parts of the park each time I go.  Just a side note, dogs love walking along side of the mountain  on the dirt trail.  \n\nIt's amazing to have this well maintained, stunning park in such an urban neighborhood.  \n\nLastly, ladies be aware gong late at night, because sometimes there are sketchy people there.  Best to go earlier when there is more people.\nHowever, I have seen more cops patrolling the area and I always feel safe there now. A few years ago, not so much.  Nevertheless, I highly recommend going to Buena!", "author": "Molly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-20", "description": "Minus one star for lack of maps. This park is big you know. Other than that its beautiful, easily accessible and the views are spectacular!!!!! The trees are truly a sight to see and they have so many different types!!! Never visit at night unless you plan on getting mugged or asked for sex lol.", "author": "Tj J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-05", "description": "Apparently there were no trees on this hill when white settlers showed up in the nineteenth century, but locals began planting them in the 1880s.  Then a comprehensive planting effort was overseen by SF parks godfather John McLaren.  From the 1970s through today, periodic small-scale replanting has occurred, giving us the lovely wooded hill that we have today.  \n\nWant a brief but vigorous hike?  Want to see some great views of the city?  Want something peaceful to do after the sensory cacophony of Haight Street?  Buena Vista Park is for you.  Thanks to the trees at the crown, the vistas are not quite as buena as one might hope, but I don't begrudge the trees their existence.  You can get some great sights of downtown, but to the west is mostly obscured.\n\nThere are even a little playground and two tennis courts.", "author": "David R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Golden vista.\n\nA new year. Another sunny day. A late start. A hike to the top. Small grassy area to rest and read and linger and contemplate. The Golden Gate Bridge sits off to the distance.\n\nSo begins 2012 in the ever so beautiful city by the bay.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-14", "description": "Why are there signs stating \"dogs must remain on leash\" posted around the park? Is this an off leash play area or not?", "author": "Mark I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-13", "description": "Buena Vista Park is a park in the Haight-Ashbury and Buena Vista Heights neighborhoods of San Francisco, California, United States. It is the oldest official park in San Francisco, established in 1867 as Hill Park and renamed Buena Vista in 1894. It is bounded by Haight Street to the north, and by Buena Vista Avenue West and Buena Vista Avenue East. The park is on a steep hill that peaks at 575 feet (175 m), and covers 37 acres (150,000 m). The lowest section is the north end along Haight.\n\nMuni bus lines 6, 71, and 71L pass Buena Vista park on its north end along Haight St. The 37 line passes along the south end of the park. The 24 and 33 come within three blocks. The N Judah runs through the Sunset Tunnel, which is directly below the park.\nit's great place to take pics. and walk your dog.", "author": "B H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-18", "description": "I thought this park was just for scoring drugs or having sex with men in the bushes.  I've done neither of those things here, but the rumors were enough to keep me away.  Not because I was repulsed...mainly due to laziness.  Are these reasons to bother with walking up that damn hill?  No.\n\nAnd then my roommate wanted to walk through the park when we were house-sitting for a friend who lives adjacent to it.  I thought, what the fuck.  Why not?    I really wanted to see the tombstones I'd heard so much about.  Sure enough, they are all over the place!  I have uploaded a couple pictures of them for your viewing pleasure. \n\nWe talked to a groundskeeper named Hugh who was very passionate for the park, and a total wealth of knowledge.  He explained the tombstone story a little more thoroughly, and ID'd some trees for us (Cypress, Monterrey Pine).  This is also the oldest park in San Francisco and Mayor Sutro wanted it to be an escape from urban life for those who couldn't afford to travel.  What a nice man!  I'm glad he got a tower and some baths named after him.\n\nI've since come back a couple of times and really enjoyed the rich stillness of the park.  For me, it's a great big wooded cathedral.  I saw no evidence of shenanigans going on and thought maybe the rumors were just rumors.\n\nAND THEN I read the Yelp reviews--most of which mention all sorts of sex going on in the bushes.  And now I worry that when I go for walks through here, the good and decent citizens also strolling through the park might think that I am cruising.  Which I'm not.  No, really.\n\nMaybe I should stop wearing daisy dukes and mesh tank tops when I go for my walks.  Wouldn't want to give anyone the wrong idea!", "author": "Eric E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-27", "description": "Shady bushes?? Yelpers need to stop scaring me; I'm afraid to leave my house, sometimes!\n\nI cherish and LOVE Buena Vista! I like to get here really early when there are only a few people around (sometimes with their very cute pooches) to get my morning stroll on.  I'm the crazy girl doing jumping jacks - don't mind me. \n\nIt's a nice getaway in the middle of the city and there's a really great panoramic view at the top. There's also a fun little green bench with a decent view - 'tis a nice place to burn, guerrilla style. \n\nI haven't had any sketchy encounters, but it is a city - complete with its fair share of homeless and/or freaks - so play it smart.", "author": "Minnie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-29", "description": "Ever get that feeling, upon getting back from visiting or traveling somewhere new, where you look around and your home that was once so familiar now looks... different, somehow? Not in a bad way or anything. It's kind of like the light seems to shine on objects from a different angle, or like you can envision more clearly the exact spot you're standing in in relation to something much larger.\n\nThis mini form of culture shock (geographic shock, maybe?) is the best way to describe what I felt like after I returned to my home in NOPA after taking a leisurely walk to, through, up, down and from Buena Vista Park. I always knew this park was just beyond the Panhandle and damn close to my house, but for some reason I never ventured there. Maybe it was the bums and stoners that always seem to hang out on the front lawn at the Haight side?\n\nI'm glad my upcoming move out of the neighborhood (and the dire need to take a breather from packing!) inspired me to finally visit last Sunday. The weather was perfect... sunny and actually warm, almost to the point where it was a bit too hot for your normal SF clothes. As I began to follow a random path up the park, the temperature was cooled down by the increasing winds rustling through the trees, which after a 10-minute walk was really the only significant sounds.\n\nThis place is so peaceful! In addition to the spectacular views of the central and downtown neighborhoods you get from the top (one of the best I've seen of St. Ignatius Church on the USF Campus!), once you're really deep into the park you also have a great view of all of its hills and steep footpaths. The feel of this park is much more woodsy, grandiose and secluded than other parks in the city... walking through it you feel like you're in another world. I pretended I was in the Secret Garden :).\n\nOnce I get a dog, I'm SO bringing it to this park for some uphill exercise and meditation!", "author": "Kate V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-31", "description": "Doggy liked this park okay, but I wouldn't go out of my way to return now that I've seen it once. I made a very wise decision to go around 10 am on a Saturday morning.\n\nThe upside is that it's a nicely wooded park with paved or dirt paths crisscrossing all around the hill. It's quiet and you can forget you're in a city. The trails are pretty well maintained although the dirt is seriously eroding between the wood steps. There's a little fenced dog run that no one uses because the dogs are wandering around off leash. There is a nice looking playground. The views are good although not the best in the city. The main entrance is just off Haight St. so you can grab a bite and coffee before or after your hike. My dog seemed to like it okay and was playing a little bit jumping up and down the stairs. There are a few joggers and children at the top of the hill which gives it a bit of a family feel.\n\nThe downsides, and why I wouldn't go out of my way to go back:\n- lots of homeless men lying on the grass near the entry at the Haight St side, and a couple wandering around on some of the lower trails, some smoking, some with a scarey looking pit bull type on a dirty rope leash - you get the picture\n- parking on Haight was a pain, had to feed the meter\n- weird smells, couldn't quite put my finger on it, but there was something about the air that wasn't as refreshing as Bernal Heights or Stern Grove - the air smelled stale or dirty somehow\n- some paths are paved but mostly loose fluffy dirt, so you are shuffling through a lot of dry dirt - wish there were some grass or the paths were packed down better or mulched\n- I was a little tense the whole time expecting some hobo to jump out of the bushes; while no one jumped out, I did turn the corner and there was unexpectedly a man standing on the edge of a cliff peeing who began screaming antagonistically at some other man down lower\n- I shouldn't have gone on my own; I would have been more relaxed with someone else with me\n\nI'm satisfied with my other go-to dog parks, such as Stern Grove, Bernal Heights, Glen Park, and Fort Funston. Now I've seen this one and it was fine - and enough for me.", "author": "p v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "If you are not feeling like running up the stairs at Twin Peaks or want to make it all the way to Golden Gate Park then let your feet doing the walking and head over to Buena Vista Park. It has nice view of the park. I really liked it that I wanted to keep my run in the Twin Peaks and Castro streets and I could take a side trip into this park to get off the sidewalks. You can find a good place to take rest or take in the views. Good park for walking your dogs.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "When I was a tender chap at 19, I looked up Buena Vista East and said, \"I should live here someday.\" As fate wouldn't have it any other way, I live just down the street, and every time I go to this park -- for my pooch to pinch a loaf or otherwise -- it's pinch worthy. \n\nChatting with a friend she said to me, \"what is that, anyway?\" when I said I spent a large portion of my weekend day walking through this park. It seems not many know about it? Or they see it and not realize that it's open, public space, with trails? I love walking cities. It's a pastime that heals me, energizes and calms. When a city walk goes from street life to neighborhood to being lost in a magical forest... that's a special walk, and that's what this park offers. There's a \"Dog Run on the West side of the park that's fenced in and shaded for off leash dog play. There's a knoll on the western side, too (pro tip: atop the knoll is a clearing by a eucalyptus tree that has a patch perfect for a private picnic and eastern view of the city). Speaking of views... just ramble through this park -- up and down, all around, and you're bound to turn a corner and come across a view of the Golden Gate & Muir Woods on a clear day. There's a children's playground that has an open patch just below it that has clear views. \n\nThen, there's a magical tennis court. Tucked away in an elevated grove (if that's even possible), you might find me building my own chairman's judge chair one day and just sitting up there, waiting for players. Or, you may find me here attempting to become the Baron of the Buena Vista Tennis Club (does that exist? If not, let's do this.). \n\nThere is a magical forest in our back yard, and let's use it enough so we never lose it.", "author": "Jon A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-22", "description": "This park is beautiful. Really worth the little hike up. The trees were gorgeous. It's really windy up there though. I recommend taking the climb up. The slight sketchyness of it didn't bother me at all, i just ignored it. I'm used to that and maybe its also because i'm not a scared white person.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-08", "description": "180 degree panoramics and a nice uphill stroll. Inner peace can be found somewhere up here...", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-11", "description": "This place is GIGANTIC.  I really thought I could just \"stop by.\"  It's really steep on some parts, so you can challenge yourself.  The paths diverge into a concrete or dirt path, but go to the same place-- so you can choose which depending on your preference.\n\nI unfortunately came here on a rainy, foggy, cloudy day so I couldn't enjoy the view, but it's pretty nice even then.  Lots of trees and just a great place to roam.", "author": "Lily N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-22", "description": "A sweaty walk uphill (stairs or loop around by foot). The views are amazing but there are some bums sleeping under the sun, bushes, trees. \n\nBring a book if you want to escape the hustle/bustle of the neighborhood.  \n\nTall trees, some shade and steep hill.  Beware of unleashed dogs. \n\nParking can be tricky.", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-26", "description": "Buena Vista is my new favorite park in SF. Adorable puppies, great views, and sunshine at the summit! What more could a girl ask for?", "author": "Eliza D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-11", "description": "Looking for a great view of the Bay then this is a place where you can find it.  It's a easy hike up to the top. The dirt trails crisscross each other around the hill. Fun place for dogs to run off leash.", "author": "Maverick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "This park has one of my favorite vistas in the city. It's a work out to get up there, but worth it. It's also very dog friendly.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-26", "description": "This park is named appropriately.  Make sure to walk all the way up to the top.  There are views towards all directions of the city.  You can see the buildings downtown, the Gloden Gate Bridge, and much more.", "author": "Nick F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-22", "description": "I've spent many summer afternoons watching the fog roll over the city from a park bench on the north side of the park.  It's surreal, like the Blob from outer space.\r\n\r\nThe difficulty of the climb and the stillness of the views make this a great picnic destination. But beware off-leash dogs who may try to steal your sandwich when they give up on chasing squirrels.", "author": "Tessa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-01", "description": "So one night we were walking along a path in Buena Vista. For the record, some of us were inebriated, but not overly so. Certainly no hallucinogens were involved. I swear!\n\nA group of five, we were a little loud and obnoxious. It was Saturday night, a week before Halloween. One of my friends was stumbling. Hipster couldn't handle his Pabst!\n\nWe heard hoof beats coming up on the path behind us. WTF?\n\nA guy with an old-time outfit on top of a horse trotted up beside us. My first instinct said he was a cop, because that was pretty much the only time one would ride a horse in San Francisco. I hid my brown-paper bag drink discreetly behind my back.\n\n\"Dude! I LOOOVE your costume! What party are you going to?\" screeched my friend.\n\n\"Quietly! Quietly, now!\" the horseman said. His voice sounded weird, like it came from underwater. He reached down, grabbed my drunken friend by his jacket, and dragged him screaming off into the night.\n\nWe tried to follow him, but they both disappeared. The police thought we were crazy or wasted, and didn't even bother coming out. We used our phones as flashlights. Though we found our friend's footprints in the mud, we couldn't find any hoof prints.*\n\nLater, I heard that some of the structures in the park are made from recycled gravestones. In some places, you can still see the inscriptions. I'm too scared to go back to that park. Will someone upload pictures? We want to pin down the sonofabitch ghost responsible and send a spirit to kick his ass!!\n\n*We eventually found our friend passed out in the bathroom of \"The Men's Room\" in the Castro, with no memory of what happened. He had half a bottle of lube and a thrown horseshoe in his pocket. (scary music)", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-19", "description": "watch out for the dirty hippies or homeless kids having sex in the park.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-07", "description": "One of my favorite parks in the city - the park itself is larger than it seems. There are tons of twisting trails that lead to god knows where. Just try to find a trail that leads you to the top which has a great view of the city. It is SO quiet up here that is quite startling and peaceful at the same time. I could probably end up chilling here the whole day without even knowing it.", "author": "Henry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-02", "description": "Great place to bring the dog! When we first moved to SF we lived in a furnished apartment right across the street. My pup, who's approaching middle-age and discovering that \"it doesn't come off like it used to,\" got to run through the forest here every day, and now he's in better shape than ever!\n\nI was wary at first from some of the stories I heard, but quickly determined that, at least during the day, there is nothing to be worried about. Perfectly safe, and as clean as you would expect any city park to be. Just the beautiful trees and views that make it like no other park in the city.", "author": "Naomi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-19", "description": "I have to give this place a 5 star review, because it's just so damn nice to have a big green space in the middle of the city. Given the weirdness that pervades on The Upper Haight, this block of green opposite a church acts as a little buffer before you begin the descent into a more somber (but no less shady) Lower Haight. If you're willing to exert a little energy, and brave the winos and crackheads while you hike that hill the view you get as a reward is well worth it.\n\nIf nothing else you can kick it here and wait for the bus with a little green space.", "author": "Wes T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-25", "description": "Nice park with a steep clime to the best view in teh city.  Also it doesn't seem to crowded.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-14", "description": "This park is even creepier than Sutro Heights Park at night.  \r\n\r\nLocated in the Haight, you get a central view of the city. There's lots of vegetation, but it's cool getting glimpses of the skyline through the trees--it's part of the mystique of this place.  There's also plenty of wildlife; you'd be remiss if you couldn't catch a glimpse of at least one squirrel during your visit.  One even posed long enough for a picture.  \r\n\r\nFor another spectacular (and less obstructive) view, climb up nearby Corona Heights.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-30", "description": "Ah, some funny reviews here!  \n\nI am lucky to live in the area, and have recently been walking my dog here.  It is a great climb that sure beats the Stair master.  My buttocks are looking much better for it (IMO).  As for my dog,  I've created a monster!  He quickly adapted to the walk and loves using the stairs.  When he finds stairs, he wants to climb them, I have to draw the line.  \n\nThere is an amazing view at the top, totally worth the climb.  A recent guest of mine was awestruck.  She comes from Boca Raton, Fl., so this is like 3D to her.  Also, there are tennis courts here, first come, first serve.  I hope I'm not dissed for giving out that secret.  \n\nThis is a great place to go during the day.  I suggest it if you are in the area and want something special, it will lift your spirits.  It's a must do if you visit the Haight-Ashbury.", "author": "Billy Dee R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-20", "description": "Either Mt. Everest is in the middle of San Francisco or I am so out of shape I can barely climb a little hill.\n\nWe made it to the top without the use of supplemental oxygen so we've got that going for us.\n\nViews are great from the top.\n\nHillary.", "author": "Archie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "Buena Vista park is a short walk from my house and when I am not in the mood to go running through Golden Gate Park with my dogs or drive them over to Crissy Field I like to take my pups up here.  There is a doggy play area down at the bottom and really great views as you wind your way up to the top.  I also like the fact that there aren't usually a lot of dog walkers up through here so I can let my dogs run and play without worrying about someone who is attempting to watch 15 dogs at a time.  If you don't have recall on your dog I don't recommend letting them off leash in this park but that won't matter too much because you and your pup will have a great time checking out this little Gem.", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-28", "description": "Get this: I haven't scored any recreationals nor gotten bent over in the bushes here, and I still dig this park! \n\nIt's always trying to convince people to meander in; the Haight Street entrance is usually guarded by some shady looking kids and a grumbling vagrant or two. Off-putting? Sure. Just consider them the guardians of an urban Eden.\n\nCanines romp as freely as people do (though they don't leave the latex evidence everywhere), so if your pup's all hyphy bring 'em here to work it out. If you're itching for some ball play, the tennis courts are run-down but functional. \n\nAlright, I'll level with you. It's true that following the thigh-burning paths up to the top you may hear some rustling leaves and the occasional grunt or pissing sounds. But the pot of gold at the end of the muddy rainbow is beyond worth it; keep walking past and you'll discover marvelous views of downtown, Dolores Park area, even a bit of the Golden Gate. Weed, whaaat? All you need to feel high is right here.", "author": "Ligaya T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-11", "description": "Well say what you want but Buena Vista is San Francisco.\n\nThe trails are steep \nThe bushes are filled with litter (needles and dirty underwear)\nThere is a sense of great danger\nIt is home to the homeless a refuge for drug addicts\nAnd there is no where as beautiful or wild- much like our city.\n\nIt is this paradox called San Francisco, even run down and at it's worst it is the most beautiful place to be.\nWhere you can climb undisturbed... open a tall Tecate and see everything for miles.  While Twin Peaks is vast my friend Buena Vista is more intimate literally on top of the surrounding neighborhoods. If you're lucky you will find the strange solitude overlooking this town. No one will bother you.  You can get drunk and not worry about police, I've never seen a policeman here ever for like 20 years.  But please don't add to the litter or the senseless vanadlism.", "author": "j s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-29", "description": "This park is so pretty. it's small enough that you won't get lost and nestled in the Haight neighborhood. Every time I go, I lump it up with a visit to this vibrant part of SF where street music is played and there's often someone soliciting a signature for a non-profit like GreenPeace. The park's highest point has views that span the Bay Bridge to the Golden Gate on a clear day, which is pretty cool. It seems like all trails lead to the top!", "author": "Emm C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-15", "description": "(Spoken in my dog's lisp voice)\n\n\"Mom, please can we go.  I wanna go to the park, I wanna go to the park, I wanna go to the park, I wanna go to the park, I wanna go to the park!!!!\"  \n\nDog and I  LOVE this place.  Its got great hills to work your butt, great views at the top and COMPLETELY dog friendly!  \n\nI love that there are single track trails mixed in with the paved sections.  The park is such a relaxing haven from the craziness of the city!\n\nGood parking too (if you dont live in walking distance!)", "author": "Claudia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-18", "description": "You see a rock, you've seen them all, right?  Same with trees, views, moments...I don't think so~!  Who can take a star away from Mother Nature?  My boo is all about sappy moments, so we just had to go here (we're running out of cute spots to visit in SF btw, so can anyone give us any new ideas??).  So we randomly landed on Haight Street and had an adventure there, but my boo kept bugging me to go to the park already.  He couldn't miss the sunset, so I put some pants on (under my dress, it was cold out!) and went on a mini hike with him.\n\nIt's the typical scene-annoying couples like us wanting to capture each moment, bikers getting miffed at people who won't get out of their way, awkward groups...jk, there's a ton of picturesque sights to see, random people to greet, and look for the sign that says \"today is the first day of the rest of your life\" (although it's bombarded with trash cans, probably so the fans will stay off its radar).  So if that's the case, I'm going to start living up every first day for the rest of MY life.\n\nSince that's the case, I'll need some more sappy places to check out.  Anything to make my boo happy.", "author": "Lili K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-18", "description": "I used to live a block or two from this park and despite everything that it has to offer, I never could quite get over the feeling that someone or something was lurking in the bushes for me. Most likely a dirty hippie or drugged out bum. Easily remedied... I just avoided dusk or night. \n\nThat aside, this park has really great views from the top. On a nice day, you can actually see all the way to the ocean on every side of the city. The view alone is worth it. And you can get decently out of breath making it up there. \n\nI wouldn't recommend this park for dogs. Not a lot of opportunity for off-leash time.", "author": "Meagan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-31", "description": "Yet another lovely park in scenically brilliant San Francisco, Buena Vista is off the beaten path of Haight.  Wild woods and a dense web of branches lie between you and the clearing at the top.  That is right, this park requires a hike.  Truth be told, it is a steeper, but your glutes will thank you.  Still, I would not recommend it for unfit folks.  However, once you reach the pinnacle, you are rewarded with an amazing view of the city--downtown, Dolores Park, and as far as the bay if the fog does not roll in.  There are only about two or three benches in the area, but this park is not as popular as the multitude of others, like Dolores, Washington Square, and, of course, Golden Gate, so you should be able to find seating.  Take advantage of it.  Enjoy the natural beauty of a city anointed by many as one of the most beautiful in the States.\n\nIf you have a dog and you dragged the poor thing up with you, take him/her to the lush clearing.  The grass is a vivid green and as you do the once over and admire this gorgeous slice of nature, you might wonder how this patch of doggie heaven got here.  Most likely the idea of some thoughtful landscape architect, but as your dog runs in circles and makes new friends (it can sometimes amount to a dog convention here), share in his/her glee by imagining the magic of finding a perfectly manicured meadow nestled within a mythical forest of trees.  I would not roll around on the knoll with him/her, though, unless you are wearing some uglies 'cause like I said, dog conventions take place here and they leave some business behind.", "author": "Dee C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-02", "description": "Recap: \n\nDon't go there at night unless \na) you are looking for gay-boy sex-in-the-bushes or,\nb) you want to hang out with the homeless/punk/stoners and do drugs\n\nSince neither of these things are of any interest to me, and I'm not likely to walk through a pitch-black park at night anyway, I'd like to take a moment and sing the praises.\n\nViews and Foliage: Yes.. they are AMAZING! Some days I swear I can see Stinson Beach and well into the Oakland Hills. And it's true, that from several different locales, I believe you can see 360 degrees of the Bay area. In the springtime, I have never seen more varieties of flowers, plants and trees in full bloom. It's like hiking through the mountains and botanical gardens all rolled into one, right here in the middle of the city.\n\nNow for the interesting part....\n\nGravestones. Yes.. you heard that correctly, and I am surprised to not see it previously mentioned. Did you know that the pathways through the park are bordered by old gravestones? You will mostly see them positioned face-down, but in some cases the workers (fueled by carelessness, drunkenness or a morbid sense of humor) laid them right-side-up so that you can see the engravings... and in some cases, the names and dates! \n\nWhy, you might be asking, are the pathways lined with gravestones????? This is actually a great piece of San Francisco history! When all the cemeteries were moved out of the city in the early 1900's, the unclaimed graves were still moved (meaning... the bodies) but the gravestones were broken up and used for various other things throughout the city.\n\nNow, you may be a little creeped out by this, but I think it's an interesting part of this city's history... and being a little fascinated with cemeteries and such myself, I am proud to say that I think I've found (and photographed) almost all of the face-up headstones in the park, although there's no way to really know. \n\nA tip for anyone that wants to go on a headstone-hunt... the gulley-ways along the paths are often filled with leaves and dirt and such, in which case you wont see anything unless you move the muck out of the way. The park frequently cleans these out however, which is when you'll be able to easily recognize them. If one part of the park's gulley-ways are mucky, keep walking.. another area might have just been cleaned.\n\nSo..... Now all you gay-boys have something to look at while you're cruising!", "author": "Bella B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-19", "description": "Huffing and puffing I climbed the steep inclines of this park whilst shrouded in thick beautiful vegetation. Upon reaching the summit I turned around to discover the fruits of my labour and sat quietly in a bench taking in a beautiful view of a gorgeous city.", "author": "Mo A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-07", "description": "I wouldn't make a special trip here because it isn't that large of a park, but it's a lovely park near the shopping area of Haight Ashbury, with plenty of trees, lovely Victorian homes, and panoramic views of SF. It reminds me of Alamo Square without all the tourists and with taller trees.  It can be very peaceful here though I have seen some strange things on the lawn facing Haight Street.\n\nThe park is on a steep hill, so it's good for walking and jogging and you can also climb the stairs.  Once you reach the top, there's a patch of grass and usually a couple of people up there with their dogs.  It's a nice place for a picnic and the most of the homes that surround the park are quite lovely.  \n\nParking is tough on weekends and marginally better on weekdays.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-09", "description": "Please note: this is not a good place to wear open toe shoes unless you enjoy the feel of condoms and soiled under garments beneath your feet.  \nThe following observations can be made at Buena Vista.\nThe bushes shake and talk to you. \nPeople love to do all kinds of things they probably should not be doing in the is park.  Things like playing with needles and little bags filled with white powder. At least one thing is for sure. There is safe sex happening among the strangers in the night. \nWhen ever I have walked through this park I always seem to find the following: \nOne single shoe, a ripped bra, soiled underwear, condoms, needles, empty little baggies and poo.\nHowever the views are spectacular", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-31", "description": "Hidden gem. I think most people are intimidated to come here or at least friends have made such remarks, but it's a nice place for a short hike.", "author": "M R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-04", "description": "A few of my friends and I had all heard the rumors of what goes down here at night so we set out to see if there was any merit to these alleged sightings. \n\nI was shocked and slightly scared.\n\nPeople wander aimlessly in the night of this huge park trolling for sex. At one point I was approached by a man in what couldn't have been anymore than his mid to late thirties who wanted to get down behind the bushes. Plowing ass in the middle of a park not being my thing, I declined and moved on-minutes later I noticed my friends and I were being followed by this same man.  We leave the park and head on home. Why 4 stars? Because the views are crazy cool and I have walked it during the day and I find it to me one of the most serene places in SF.", "author": "James J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-08", "description": "a beautiful place in a beautiful city.  \n It's a forest (complete with sun-filtering-through leaves and mysterious bush rustling), a perfect place to take a break (read a book, bring your journal, have a beer)\nWhen it's a clear day and you can see straight to the Farallon Islands (home of the largest number of mature great white sharks, but you can't see 'em from the park) i doubt there is a more lovely spot.  \nMy favorite place in San Francisco.", "author": "Alexandra G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-11", "description": "can remember the first time I walked to the top of Buena Vista Park. This park has to have the most stunning view because the walk alone is a hike. I definitely recommend that you wear your kicks when walking up this steep hill. When you finally do reach the top it is such a surreal experience; the vision is beyond anything I could ever imagine, for a hill, that is. You can see a good number of landmarks that have doted this city for many years. When you look to the north you see far beyond the beauty of the trees that surround this area. There is the most breath taking views of San Francisco to the Marin Headlands. From the west to the east you can see the Pacific Ocean to the San Francisco Bay and afar.\n\nBuena Vista Park borders Haight Street between Buena Vista east and west and has multiple entrances. It is sited on a sand covered bedrock hill and has its own natural spring and steam. There are certain flowers and plants; for example, the coastal oaks flourish extremely well on this type of land. When I was adventuring around the park I thought WOW this is the absolute most amazing view hence the translation: good view. I never dreamed of a place that could have so many views while drawing emotions and thoughts too. I was so dazed I could see the oceans blue glare blend into the sky, church/temple(s), mountain range(s), infamous bridges and streets, and clusters of homes.\n\nIt is such a GOOD feeling to look around at what you have conquered so far in this extremely diverse city. Upon peeking out I always wonder why I moved to this city and what drew me here. Just taking one quick look brings back all the memories. It is nice to see where I fit in as an individual in this circle of life. I must also mention that there is a patch of grass to lay on and stare into the sky. It seems to me that many people do not know about this vastly rich park. A place where all of your cares and worries fade away. I felt like I was a child again, lying in the grass dreaming, thinking, and pondering.\n\nBuena Vista is a different kind of park where you can rest or check out the views and the city. It is not that big but there is such a good energy about it! I recommend a trip there during morning hours and sunsets too! Some of my friends have watched the sunrise from there. It is a superior feeling I have after walking to the top, and when you look out over the City the feeling just gets better!", "author": "Tamara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-03", "description": "Love this Park!!! So fun, calm, green! A peace sign shrub?! Kick ass! Come here to plan your revolution!", "author": "Twinstar G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-12", "description": "Stumbled upon this park on a gorgeous sunny spring day.  Beautiful gem of a park.  Next time will bring the doggies and take more time.", "author": "Michelle O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-08", "description": "This is a great park that isn't too crowded, offers a lot of little trails for a variety of views, and gives you the feeling of being tucked away in the woods. There are a ton of hideaway spots (great for a daytime picnic or a nighttime mugging) in the overgrown bushes and under the tall trees so I wouldn't come here at dark by yourself and just be aware of your surroundings if you happen to be there at dusk.\n\nIf you tack Corona Heights onto your Buena Vista Park trek, you'll get fabulous views of the East Bay.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-15", "description": "I will give this spot 5 stars because I grew up around the corner and actually used to play in the playground. \n\nThen I got older and we used to have Keggers up at the top of the hill\nthey never got busted.\n\nI think the guys doin what they do @ night throw the cops off", "author": "Kim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-29", "description": "I haven't been to this park since my dog died.  I just went this morning for the first time in three years and remembered why I love it so.  \n\nFirst of all, the park has AMAZING views of the city!  Secondly, it's just so tranquil and smothered in huge trees and bushes, that it's hard to not love it.  The many trails this park has and the high steps.  Make sure to wear your tennies or hiking boots to endure these steep inclines.  \n\nI of course don't recommend any parks at night time, but during the day, rain or shine is fine!  May I recommend heading to this park when it's foggy and dewey.  It really makes for a very peaceful walk.  But, that could just be me.  Bring your dog for sure, the doggies love this place!!\n\nIndeed you may have your homeless making house here sometimes, but they need shelter somewhere and I've never personally been bothered by anyone here, nor have I seen any needles like someone said.  \n\nLove this park, nothing to hate about it really.  It truly is a gem in this amazing city!!", "author": "Kat M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-22", "description": "I wish I made it to Buena Vista Park more often.   \n\nIt is really an amazing resource / retreat in the heart of the city.  A great walk with elevation to get a little exercise.  \n\nAmazing views, large trees.  Especially pretty in Spring.\n\nSomewhat unsafe at night though.", "author": "Bruce M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-01", "description": "This is JUST for the tennis courts.  BVP gives me an overall uneasy feeling:  how many needles are in the bushes today?  will someone grab my ankles as I walk by?  will I see a couple engaged in a naked tango in the trees?\n\nThe tennis courts, however, are great.  Nice view of the city, well maintained courts and net, and close enough to my house to walk.", "author": "Krista C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-24", "description": "Great hour or two hike in a semi-wooded area. Good places to stop and look over the city. It's nice to interact with the dog owners and chit chat for a moment with total strangers.", "author": "Celeste T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "This pretty hill is in close proximity to a number of cool SF neighborhoods/restaurants. So it's a perfect place to explore and work up an appetite before pigging out in the Haight, Cole Valley, Castro, etc. \n\nWatch out for just a few folks who might be waking up or bunking down for the night.", "author": "Jacquee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-10", "description": "Beautiful views of San Francisco are even better after walking up a steep hill... there are a few trees in the way, but hey, that's nature!\n\nI looove going up this park while walking towards Haight St... it makes me feel like I've accomplished something that day :)", "author": "Laura W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-20", "description": "This is just for the gardeners/landscape caretakers at Buena Vista Park.... I applaud you! You manage to keep this park looking pretty good given its high traffic volume all day and all night. You also are taking some health risks as mentioned in other reviews, it's not rare to find needles, human poop (so much worse than dog poop, also found there) and condoms.\n\nI have a dog walking business and often walk my \"pack\" there. The gardeners are extremely tolerant because I think, thankfully, the majority of us dog walkers have developed a respect for them and their work and we do our best to keep our dogs well behaved and staying out of areas being propagated. \n\nAs a dog walker, I feel at peace in this park and not like I'm a criminal like I do in so many other parks in this city, thanks mostly to the gardeners at BV! :)", "author": "Keri R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-13", "description": "Boy I would not want to be here alone in the dark but on a clear evening, with two tennis courts, blackberry vines to be picked and views of the entire city - where else would I want to be? \n\nWith other green space such as the panhandle, Alamo Square and Golden Gate Park all in close proximity,  Buena Vista is perfect when you want privacy and romantic views.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-20", "description": "This review is just for the tennis courts.\n\nLike others have said, the two courts are a little less than stellar - probably resurfaced sometime in the mid-late 1990s.  After it rains, one of the courts tends to puddle up with water.  And Saturday/Sunday mornings can be pretty busy....\n\nBut, the view is pretty amazing - you can look over Dolores Park, Downtown SF, and even the bay.  If you do want to play on Sat/Sun mornings, I suggest arriving at 8:30am or 8:45am; otherwise you may have a 30+ minute wait (sitting on some benches), while the courts turn over.  Outside of that, the weekday and weekend afternoons are typically clear.  And I must add that some of the cutest dogs come walking by...\n\nIn terms of safety, I can see why people are concerned.  There are probably 15 paths that lead to the courts, but only 2 are actually paved.  Try to enter off Haight, and work your way up the stairs and to the South/SouthEast, and you should be golden.  There isn't a great entrance off Buena Vista, unless you like a quick, steep hike up through some dirt and dry trees/shrubs.\n\nSo stop reading and go play some tennis!  Oh, and maybe save an old tennis ball for those super-cute dogs that walk by.", "author": "ashok r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-30", "description": "Amazing views of the city. Be sure to stop near the bottom and jump on a swing for another fun view of the city.", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-06", "description": "I heard some shady things about this park, so I usually walk around it on my way from my house to the Haight, but this weekend we wanted to walk through the park as we are still committed to our walking trips around San Francisco.\n\nWe walked straight through it and I must say I was really impressed.  Suddenly you are out of the city and in nature.  It really is much denser than I thought.  It would be a fun place to walk around and explore.\n\nWhen we got to the top we had a great view of San Francisco!  \n\nI think this park is totally worth-while.  I take off one point because the boards that are there to make stairs actually make it more difficult to walk around.  Besides that it's a cool little spot and I didn't see any of those shady things people spoke about.", "author": "Sean O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-01", "description": "uh uh uh OMG was that guy getting a bl** job in the bushes?!\r\nGuess the tweekers are jealous. Hence the beatings.\r\nAvoid at night. Thought would be a good short cut to the car after a home party.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-19", "description": "A pretty little thing like me wouldn't dare wander through all the nooks and crannies at night, although I am definitely not the target night time market, I'm not about to tempt the gods. \n\nBut, during the day time, this is a dirty urban utopia. As I feel the burn on the back of my thighs as I brave the hills or the steps if I'm lacking patience that day I watch my view get better and better. As I explore off path I see reminders that tell me baby, you're still in the city. Tall cans and hot pink condoms (way to be safe boys), various articles of clothing, trees, flowers, trunks filled with rocks, city to the right, elements to the left. I'll charge those steps like a retired Rocky. I know that view up at the top ain't going no where, not without me, oh no.\n\nSeedy it may be, but BVP is one of my favorite places for urban exploration.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-26", "description": "Ok, we get the idea, don't go to this park after dark.  Seriously, what woodsy, unlit park *would* you go to after dark?\n\nPersonally I think this park is beautiful.  It's really the closest of the hill parks to downtown, so the views are unbeatable.  Plus the tree cover is quite atmospheric, especially the cypress trees.  When the fog rolls through here it's hard to believe that the heart of the city is so close.  And I really don't recall seeing that many \"park people\", certainly not as many as the east end of GGP.  \n\nAlso, if you're walking through here, take the time to walk through the hilly neighborhoods surrounding the park as well.  You'll be drooling with envy over the gorgeous houses and views.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-01", "description": "Nice park, pretty views.  The stairs kicked my butt, but I'm pregnant and had my toddler in a hiking pack.  I was worn out to say the least.  \n\nThe top was kind of anti-climatic. It's got good views but it's all still partially blocked by trees (or at least from what I saw.)  I may have missed something but by the time I got up there, I was too tired to explore much.\n\nMy dog loved it.  I'll probably be back when I'm not carrying two babies.\n\nOh, and the top grassy knoll area smells like dog pee... so I wouldn't sit down (or if you take a picnic, take a blanket too.)", "author": "Leah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-04", "description": "Thank you Buena Vista Park! You are single handedly getting my buns into shape with all your uphill trails! You are my only defense against all the decadent, cream sauce covered, meals that I keep eating in local restaurants.\n\nI love you almost as much as my dogs do.  They've now taken to faking the need to go potty, just so that they can go outside and pull on their leashes in the direction of your green, tree covered hills.\n\nI have decided to completely ignore/overlook/pretend its a rumor that there are creepy trolling men looking for a little booty action love in your bushes. That's why I go during the day, stay on the path, and avoid eye contact with anyone  whose hands are not clearly visible.\n\nI love the view from the top of the hill. And I love when the professional dog walkers bring their troop of happy pups up there to frolic.  \n\nBuena Vista is my own little slice of nearby heaven", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-30", "description": "This is nice park with a lot of uphill paths/steps and when you reach the top it's a dog area and you get a nice view as well. Would like to take a nice leisure walk through here again and take photos.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-19", "description": "The view from the top of the hill reminds me why people love living in the City and why the rest of us Bay Areans like to brag about living in one of the most beautiful regions in the world. Why have I never walked (hiked, really) through this park before. I always pass by it when riding the 71 Muni, but never gave it a second thought. What a (hidden) gem! Climb to the top! It's worth it. The view is outstanding especially on a clear day. Like Naomi K., I would totally come here to escape any chance I got if I lived in the City. Just lovely.", "author": "Farah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-30", "description": "This park would be better if there weren't so many derelicts living there.", "author": "Roger H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-10", "description": "You know it's quite amusing to read reviews of some of these postage stamp sized parks in towns in the peninsula as if they're Wonderland. Now here's Buena Vista Park (I call it Buena Vista Social Park), which is a tiny fraction of the size of Golden Gate Park or the Presidio... And it's a breathtaking wonder. Giant old growth trees. Lovely spiraling trails. Quaint stairs in the hillsides. And of course spectacular views. Oh, and plenty of free street parking. Yup. Every time I go to the Safeway on Market Street I stop here and take a lil hike first. Five stars easy.", "author": "Chuck S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-25", "description": "This is the kind of place that makes me feel special for getting to come here every morning with my dog.  If you go in the morning, the sunlight filters through the trees, and it's an ethereal, magical sight.   Also, you feel really great if you hike all the way to the top, there's a great view of Golden Gate Bridge.\n\nNote:  The SouthWestern slope is currently closed off for construction, and it won't be finished until October-November.\n\nOne star taken off for all the junkies, though they've never really bothered me, especially since I own a huge, vicious-looking dog.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-24", "description": "I live right on this park and it is a beautiful park during the day, but it is totally sketchy at night.  I wake up in the middle of the night and look out my window and see creepy looking people walking in and out of the park.  Lots of rampant rumours about what goes on after dark and I'm not so sure it is all rumour.\r\n\r\nIt is a really big park, if you look at the Google maps of it, there are tons of walking trails.  The playground is always empty and great for younger kids.  The tennis courts never seem to be in use and you can easily street park in the area if coming from afar.\r\n\r\nIt is either the oldest park in SF, or the first one, can't remember.", "author": "Doug M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-02", "description": "A gorgeous little oasis in the city, with one of the best hills to climb. The views from the top and from the lookout point are amazing and you can usually see the Golden Gate Bridge.\n\nWe live a few blocks from the park, and we take our dog there every day because he loves it so much. Lots of trails, squirrels to chase, grass to roll on.\n\nMinus one star for the fact that often the people that illegally camp here will use the park as their personal bathroom.", "author": "PF D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-11", "description": "Great place to bring your dog, but stick to the designated trails, don't make the mistake and try to cut through the \"MAN\" made trails... You'll find that oh so uncomfortable situation of some dude looking for dude on dude on dude on dude on dude on dude on dude action. \n\nSo that is why you get 2 stars you dirty little park. Unless you're into dude on a lot of dude action and the high possibility of contracting an angry STD, then you can give it 5 stars... get a room... for real real, not for play play.", "author": "danny e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-11", "description": "This is an impressive spot, especially once you learn its history and all that went into establishing the park.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-04", "description": "Fantastic views let you have a vigorous yet relaxing walk.\r\n\r\nIt gets really dark in evening, so be careful after sunset though.", "author": "Chacha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-10", "description": "Once, I had some friends in from out of town, and it was a beautiful Sunday afternoon. I was taking them down to Haight, cause they'd never been there, and it was in the area. \n\nOn our way there, my girlfriend suggested we walk up this park. It's very beautiful here, but kinda rough walking when you have a buzz going. Plus, I think I saw some one shitting in the bushes. Nice.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-19", "description": "The thing about this park is that one must never venture past the grassy knoll that faces Haight Street.  You may encounter a crusty hippie who has been residing there since he got kicked out of Golden Gate Park in 1972 or find some cracked out 14-year-old from Fresno who will try and beg some fries or pizza out of you.\nI went out there for a day of walking around the Haight with my roommate from New York and we stopped to sit and watch the cars go by.  We were thoroughly entertained by this absolutely unassuming dude who looked like he had a corporate day job and a wife and kids in some subdivision in Daly City.  He had this contraption that made thunder sounds and he sang songs along with the rolling thunder claps.  Then he started talking about eBay and what you can find on it.\n\n\"Man, you could buy a dragon for sure on eBay.  I want a dragon man.  One that could swoop down and you wouldn't have to feed it or nothing.  Don't have to worry about fossil fuels.  I'm gonna get me a dragon, man\"\n\nWhen he got tired of talking about eBay, he moved on to talk about the CDs he bought at Amoeba, namely Prince and the new Justin Timberlake (which he referred to as \"Justin Timberland\").  \n\n\"Man, I love Prince.  He's got the jams.  You play that shit for your lady and daaaaamn!  That Justin Timberland, man, I don't really know about him (thunder clap).\"\n\nSome people were sitting close to him and started giggling, which egged him on.  After they made fun of him for professing his love for Toni Braxton (\"...and I will never even breathe again!\") he threw the Justin Timberland CD at them and went back to talking about a dragon.\n\nOf course, he was talking to no one in particular.  I always have a good time at the grassy knoll when I want to stop for a ciggy or two and people watch.  Good times.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-26", "description": "Good views and big trees.\nMaybe not so nice at night --\nWatch out for condoms.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-03", "description": "As stated by many, great views at the top hence the name. Stick to the top and perimeter to avoid the possible views of gay folks puttin on a show - in broad daylight!  C'mon fella's get a room.  \n\nA great place for banana slug watching.", "author": "greg e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-31", "description": "This park is surrounded by beautiful homes (one I saw up for sale at 2.1 mil! I'm starting to save now). When you walk into the park it's like you're not in San Francisco anymore, more like Oregon or something. The woods are dense with trails winding through, up and down, throughout the whole park. The best part comes when you reach an opening and you remember that you actually are still in San Francisco. The views are amazing! At one spot you can actually see the tippy top of the Golden Gate Bridge (on a clear day of course). Beautiful park, great to bring your dog for a nice hike.", "author": "Casi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-18", "description": "I love hills and stairs and great views, so I love this park. I don't go at night, but then, you really wouldn't want to go ANYWHERE in this city that has heavy foliage at night - no idea what you might find. \n\nInteresting note: this park was built. It is man-made. And if you look at the drains along the paths, they are actually marble. Marble with names and dates on them . . .yup, they are old headstones from a cemetery. \n\nHappy Trails!", "author": "Sarcastic T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-11", "description": "I think it all depends on what day you visit this park.  Take last Saturday for example...75 degrees, a comfortable breeze, and not a cloud in the sky.  The views from the top terraces offered amazing 360 degrees panoramic views of the city.  It was relatively quiet (not including the incessant sound of sirens - sounded like the entire outer Richmond was burning) and their was a really pleasant smell - a slight hint of fresh cut grass.  \n\nThat said, I could see why it would not be as pleasant to visit, say at night, esp. alone.  Lots of places for people to hide and conduct illicit activities.  Go during the day with friends and enjoy what a city park can offer.", "author": "Sy K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-26", "description": "So today happened to be one of those rare beautiful days in SF, with clear blue skies, temps in the high 60s and SUN!!!  I think to myself, today is a perfect day for a picnic lunch and reading in the park.  I pack up my book, blanket and shades and head out the door to explore an unfamiliar region of the city. I am picturing lying in the grass, drinking an iced coffee, enjoying the sun.  To my dismay, you will not find any of this at BV park!!!!\n\nI parked along Haight and climbed the over hundred something stairs, along a thickly wooded dirt path to discover: a single park bench facing a partially obstructed view of the city.  No grass, no sun, not the best view I've seen.  Furthermore, I spent the entire hike up feeling like I needed to be watching over my shoulder for some cracked out mass murderer-pepper spray in hand.  \n\nLessen learned: unless you are a six foot something Dad with boys looking for an adventure or a young woman with a death wish- avoid this park at all costs.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "Very cool park... it's all woodsy and stuff!  Who could tell that there is a kiddie playground and tennis courts from where I was standing on Haight Street?  I trod all around it today and finally found some of the fragments of Victorian tombstones that line the gutters of the park.  whoa.\n\nIt's not a park that I will hang out in regularly, but I'm glad it's there and when I want to raise my blood pressure a bit I'll power walk to the top.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-05", "description": "Only two courts here, one has a crack in it, so if the ball hits it - who knows what funny bounce it might take... NOT COOL, if  you're in the middle of a game and a bunch of people are watching.\n\nThe other court has a dip in it, so water gathers there. NOT COOL.\n\nThe only saving grace to these courts are the views of the city, but you should be watching the ball instead, right? Right.", "author": "wayne s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-24", "description": "I love parks!  But particularly this one.  It's small, but still can make you feel like you are in the middle of the woods.  The views are really good as well. I added some pictures of both, it's just amazing.  Don't go in there by yourself at night.  I have hiked up and watched the sunset and the sunrise both from the top and loved it.  I do that with a group or at least one friend generally.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-11", "description": "On a sunny afternoon, Buena Vista Park is the perfect place to chill out, drink a beer, and smoke a nice bowl. Ahhh yes...very nice. It also makes a great spot to pee when walking home at wee hours in the morning after pulling an all nighter.", "author": "Danielle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-08", "description": "Hiking around the curvy trails and wooden steps of Buena Vista park is an enjoyable way to spend a sunny San Francisco afternoon. Views of city can be glimpsed through tall hillside trees and sweet smelling flowers.  Patches of grass and park benches randomly decorate the landscape, and offer a perfect place to enjoy the sights or a  delicious picnic. Bring your best friend, boyfriend, or adorable dog for an easy afternoon exploring the trails and enjoying a \"Buena Vista\".", "author": "Caroline J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-16", "description": "A is for AWESOME VIEWS at the top of the hill\nB is for the tennis BALLS you can whack around on the courts that are almost never in use\nC is for CRUISING, which if you're gay, a man and horny, you can do in the bushes\nD is for DRUGS, which you can also do in the bushes, just mind the men having fun and don't disturb too much!\nE is for EXERCISE - you'll get yours by climbing the hill to get to the views\nF is for FECKING, which, again, you can readily happen upon when chasing after your dog into the trees to see where he dropped a poop. \nG is for  GRASS, which you will find on the north side of the park, both in the form of the green stuff people golf on as well as the kind you can buy in baggies from some smelly guy on the corner by the steps. Warning: the second \"grass\" may be \"oregano\" and the \"smelly guy\" could be a \"police officer.\" \nH is for HORNY - I mentioned the cruising, right?\nI is for ILLUMINATED - which is the amazing spectral of USF's spires seen lit up from this park at sunset\nJ is for JOGGING, which you can do if you're motivated (*mind the dog shite!)\nK is for KLANSMEN, which you won't find here\nL is for LESBIANS SUNTANNING NAKED, which you also are not likely to find here (Michigan Womyn's Festival = better shot)\nM is for MUTTS, which run aplenty on the trails\nN is for NIGHTTIME, which is a sketchy time to visit the park (unless you're into that sort of thing and have already hit the Windmills, Collingwood, the last car of BART, Lafayette Park, the second floor men's room, 2nd stall, of SF's main library and SFM4M on AOL)\nO is for OUT OF TOWNERS, who you're unlikely to encounter here\nP is for POPPERS, which have been done here\nQ is for QUIET, which is the silence of the hill\nR is for REHAB - there's one conveniently located on the North West side of the park\nS is for SILENCE, another term for quiet (see what I did there? You thought I was going to say \"sex,\" but I didn't!)\nT is for TENNIS - again, best kept super secret courts in town\nU is for UGGH, I'm getting bored of this alphabet\nV is for VIRUSES, which can be caught by the dozen (again, watch the dog crapola)\nW is for WATER, which you can just almost see from certain vistas\nX is for XERXES, which is mentioned in the movie \"GO!\" and has nothing to do with this review, except that it's a great movie\nY is for YERBA BUENA, which sounds like BUENA VISTA, but isn't: YB has a playground, bowling and ice skating, BV has dogs, tennis and views\nZ is for ZIPPER, which you don't want to get caught with yours down taking a whiz and not knowing the kind of attention that can signal in this park...\n\nOne of the best places to walk your dog in the city because there are short trails through trees and a good hike to the top of the hill. You are so unlikely to be busted having your dog off-leash here. Also, great for tennis, since most yuppies shun the place due to cruising and drugs. Great, well kept secret awesome spot.", "author": "Hannah Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-20", "description": "Its perimeter is lined with an eclectic collection of apartment buildings and private homes (one owned by actor Danny Glover) that proves San Francisco is as diverse in its architectural styles as it is in its population. As previously noted, the views from the top are phenomenal on those days when this section of the city isn't shrouded in fog. For a period of time, a series of severe gay bashings drawing limited police response kept thrill-seeking men out of the bushes at night, but apparently the little rascals have returned in full force. Heavy overgrowth and underbrush contribute to its viability as a spot to deal drugs, as well.  As dangerous at night as it is beautiful by day, so definitely proceed with caution after dark.", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-03", "description": "Yeah...I am gonna say it...I admit I have...been to the park and um...done things....oh well you only live once...oh and when I stood up I had dirty knees :-)", "author": "Denny R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-20", "description": "beauty.  fog.  wind.  that deep woodsy odor.  kid-friendly playground. headstones in the paths.  short cuts straight UP.   bums.  crusiers. dogs!\n\nThis sweet stunning park is a jewel by day - beware after dark.\n\nHint: the view from the tip-top is so-so, but the outcrop to the East of the summit is best.  Bring a windbreaker!", "author": "Jim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-20", "description": "Buena Vista Park is a gem! Despite it's central location, it's always pretty empty and quiet, plus it has a dog run and tennis courts. But the best parts about it are the incredible views from the top (360 view of the city) and the fact that there are over 3200 trees in the park!", "author": "Sara W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-16", "description": "The oldest park in San Francisco is one of my favorites.  I've actually never walked all the way up to the top, but I do enjoy reading on the lawn facing Haight Street when it's warm enough.  The grass can be kind of sketchy, and there will be some strange people around, but I've found that the street people on this part of Haight Street aren't as demanding as their counterparts west of here.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-12", "description": "what a gorgeous park! you'll work up quite a sweat climbing to the top, and once you get there, wowweeee! it's gorgeous. views of the city all around. such a killer spot to pack a picnic and sip on a brewski.", "author": "cristina s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-14", "description": "One of my (and my dog's for that matter) favorite walks in the city is circling up through the park to the top.  With all the trees, you literally get engulfed in the park.  When you reach the top, you are treated to one of the most amazing panoramic views of the city, bay, and on especially clear days the farallon islands in the pacific.", "author": "eugene c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-10", "description": "beautiful views. we walked up and down many of the paths, and saw striking views of the west end of san francisco. the sun was setting, so that added to the splendor.\n\none note: if you don't like the cold, then bundle up. the wind really slams the park, and without hats our ears were freezing within 20 minutes.", "author": "omar k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-11", "description": "Great place to make out in the daytime. Steer clear of the stinky hippies and crackheads. I used to not like the park so much because when I first moved to SF and mosied by, there was a dead guy in the bushes right on Haight St and the cops were just standing around sipping coffee and letting everyone get a good look, I didn't need to see that. I'm sure there's been lots of dead bodies in places I've been so I refuse to let those experiences stop me.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-04", "description": "Pretty good as far as in-city dog parks goes.  Great trails and big trees make it fun for dogs to run around and nice to get a break from city life.  The walk to the top is a nice short hike and you can enjoy a nice lunch on grassy area with beautiful city views. The drawbacks: there are a lot of dog walkers with up to 12 dogs and lots of dirty, vocal hippies hanging around near Haight street that have aggressive, un-neutered dogs.", "author": "Angie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-24", "description": "On a clear day this month I finally climbed the mountain!  This was the original Divisadero, Spanish for \"lookout.\"  Great views between the trees.  The City looks smaller and hillier up there than I expected.  I was able to spot my home (who doesn't try that?).  Good views of the Pacific Ocean and the East Bay.  Climbing through the trees has a very calming effect.  The park was uncrowded, the birds were having fun, and the trails looked like they were being maintained for the most part.  There's pavement in there, and once we found that we stuck to it.  Walking back down the stairs to Haight Street had an otherworldly feeling.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-29", "description": "I love this place!  It's like a nature hike in a forest but in the middle of the city, and it's not crowded in the interior.  It's quite lovely and almost peaceful.  Minus 1 star for some slightly creepy people here and there, occasional litter, graffiti and loitering teens.", "author": "I. Lee W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-29", "description": "This was the site of my first mushroom trip. At the time I thought it was a beautiful place in a kind of sketchy way and that I was never going to be normal again. I thought it was just the effects of the fungus but years later I realized I was right on both counts", "author": "Josua P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-16", "description": "Requires a hike from home, so that I have earned my park-bound laziness. This is one of the more beautiful and interesting parks in the city, and is surprising in size and is quite quiet.", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-05", "description": "I used to go to Buena Vista park almost daily with my last dog.  I loved it because I could hike around and my dog loved it because of the smells, the pine cones, and most of all the squirrels.  It's a good work out and great exercise for your dog.  The views at the top are INCREDIBLE, especially on a sunny and clear day.  Even though it's in the middle of the city it doesn't feel like you are.  Unfortunately, there are a few things I didn't like about this park:\n\n1)  The muzzled Akita, with a dog walker, who attacked my dog and punctured her cornea by smashing her muzzle into my dog's eye.  \n\n2)  The ziploc bags of condoms and lube hanging from tree branches.\n\n3)  My dog once led me down a path and we arrived at a tree with writing on it directing us to \"young hung men\"...the problem is the arrow was pointed the same direction as all the squirrels!!!  \n\n4)  Another time my dog ran excitedly ran into the bushes (on the side of the main cement path, I might add) because she heard some rustling and two men quickly ran out of the bushes pulling up their pants, that was awkward to say the least.    \n\n5)  There's poop and used toilet paper on the ground.  If I have to pick up my dog's poop then people should have to pick up their poop and properly dispose of it in a trash receptacle, should they decide to go outside on the ground.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-18", "description": "As much as I love that this park is near me, has great views and lots of trails, I can't get over it's appearance. In so many places it just looks so run down and dirty; it's not kept up well at all. Walking around and especially uphill is worth it though!", "author": "Barbs J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-10", "description": "Don't let this place fool you. From the outside it looks like a simple trail with trees covering it, but as soon as you start walking you're going to have to choose whether you want to walk on the steep cement path or walk up the stairs that seem to lead to nowhere. I came here with my cousin after eating pizza and was not properly dressed for the hike, so I recommend some good running or hiking shoes. The only down side I can think of are the homeless that live hidden in the bushes, but then again a park isn't a park without homeless.", "author": "Gabby H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-14", "description": "A great place to take your dog for a hike in the city! There are plenty of trails (paved and unpaved) that wind up, down, and around the park. You and your pooche will have fun getting lost in the tree cover. I have noticed some EXTREME sketchiness on the North East end of the park (near Duboce St). If you follow the trails just above the sidewalk that surrounds this part of the park, you may notice pockets of weird men standing in the bushes. They always seem startled when my dog and I are walking through. I don't know if this is a place for gay sexual favors or a place to get drugs. Either way I'd suggest avoiding this part of the park.", "author": "Sal B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-24", "description": "Amazing views. Even though there is no leash law enforcement I wasn't able to unleash my dog as she's not the brightest of creatures. Might be my favorite park in SF...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-25", "description": "Awesome place to go for a jog. Wind up the hill and if can reach the top...props. Great views from unsuspecting places. Agreed about some of the sketchy characters that inhabit this place. Women should avoid this place after dark. Gay men apparantly love it because the tennis court at the top is a notorious place to hook up discreetly. Why do I know these things? I guess you can't live in SF without knowing more about gay people than gay people do. This park is great but if you're looking for sun and fun go to Dolores. If you're looking for a good workout dodging crackheads then this is your place.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-28", "description": "What to do.  What to do.  I live EXTREMELY close to this park.  On the one hand, I'm proud and would like to sing its praises.  On the other, I don't want too much riff raff stomping down the trails.  I also feel that it is my civic duty to warn people about the seedier elements of this place - trust me, you DO NOT want to be walking around this place at night (unless you have a vicious animal to protect you, or, better yet, Captain Planet - cause he's our hero, gonna stomp pollution down to zero).  Ahh, f-it.  This park deserves its name.  The view IS beautiful.  Just bring your can of mace if you go after dark.  But stay off the tennis courts!  They're mine!", "author": "Jason S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-23", "description": "truly a great SF treasure, Buena Vista is a great civic jewel that shines brightly from its upper Haight perch.  A true multi-use park that gets joggers, walkers, trippers, dog walkers, tennis players, guide book hikers, toddlers at the playgrounders, picnics at the toppers, not quite ready for sleep and looking for gay sexers, cops on motorcycles looking to bust the having sexers, and everything in betweeners.  never a dull moment and usually a great view from  the Marin headlands and the top of the Golden Gate, to the Mission to Twin Peaks to SBC Park to Corona Heights to, well, you get the panoramic picture, dont you?  Well?  the tennis courts have literally million dollar views.  the unpaved trails look like an Ewok village.  great park, folks.", "author": "church B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-12", "description": "had some scary experiences here on halloween a couple of years ago. first of all, i wasn't in my right mind at the time and we were a little bit paranoid/nervous since we were there at like 3am on halloween and lots of strange people were everywhere (at least i think they were) also, at the top of the park...i swear we walked in on a circle jerk which was really disturbing at the time. as well it shoudl be, i imagine. \n\nanyway, i'm sure it's a really nice park in real life, but my experience there just gives me the heeby jeebies just thinking about it.", "author": "annie c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-28", "description": "Just look at the view in the photograph. This big hill probably has some of the best views of San Francisco outside of the office buildings downtown. But you'd rather be here than in one of those offices.", "author": "Anonymous P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-09", "description": "well-kept gem of a park with beautiful views.  go in the middle of the day and meet every dog walker in the tri-county area.", "author": "Sasha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-03", "description": "The tennis courts here are, like, the best in public courts.  First of all, each has it's own cage so you won't be hitting balls into other courts.  Second of all, they are rarely crowded.  And finally, they are at the top of the park and have a splendid view.", "author": "T-Bone L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-06", "description": "As my favorite hill 2 blocks from my house, Buena Vista Park has got it all.  Ass-kicking stair climbs; a lovely, sort-of well lit sometimes creepy road that makes me run a little faster once the sun goes down; amazing views from all around; tennis courts; a playground that can be fun to venture into at night; the Haight Street wanderers and their dogs; and, from what I hear (though thankfully not literally) plenty of eager men looking for some lovin, and um views?...  I love living near here - the loop is my favorite place to blow off steam from a frustrating day downtown.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-07", "description": "Great views of the city.  I wandered into the park off Waller Street while walking around Haight Ashbury one afternoon -- it was just the little woodsy escape from the city streets that I needed.  Also park provides a shortcut, albeit steep downhill, into Duboce Park area and Church Street/Market Street shopping area.", "author": "Ed M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-02", "description": "This park has a wild quality to it that can be very beautiful and fun to explore.  I'm slightly scared of it though and wouldnt wander here by myself after dusk.", "author": "b s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-19", "description": "Love it!  The views are stupendous.  Day or night, rain or shine...this park has attitude.", "author": "Elan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-03", "description": "even though it is a short, non-exhausting climb to the top of the hill, the view is clear especially on a bright, blue day. if you're ever to be walking around aimlessly, then buena vista is surprisingly close to corona heights, so visit that hill also. \n\none time i was walking to buena vista with a group and a gardener told us that the gutters on the side of the trails are lined with tombstones from the cemetery on masonic and geary [when masonic and geary WAS a cemetery, way back when...] evidence of the tombstones are that not all of them are print-side facing the dirt, so some of the tombstones display lettering... and the text is pretty interesting. searching for tombstones with print facing up is a nice treasure-hunting game if you're every wandering in buena vista.", "author": "Court L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-20", "description": "the views are really beautiful but it's kinda dirty .\nand you smell like dog/cat pee afterwards.", "author": "Angeline Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-29", "description": "I've heard a lot of horror stories of vampires in the bushes sucking loudly for a liquid reward... oh wait, vampires or gay guys? I can't remember.", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-07-14", "description": "what a dump. a haven for drug addicts and sexual deviants after dark. during the day you will see unbathed hairy people, throwbacks or timewarpers from 1967. the only positive note was the time I peed by the stairs on Buena Vista East. I hope a hophead slipped on it", "author": "Prima D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-13", "description": "it's a nice workout to walk to the top of this park and the view is really nice from there.  it took a good 15 to 20 minutes to reach it.  i was all sweaty, but seeing the city below and the golden gate bridge from there was well worth it.  i wouldn't wander through here when it gets dark, as there were some shady characters in the bushes on a few of the paths.", "author": "Immer E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-07", "description": "To call this place a \"park\" is perhaps a misnomer... more like a scrubby peak in the midst of the city, criss-crossed by haphazard trails. There are trails that make you feel lost in a good way; slightly bewildered, out of the ordinary loop, outside the well-trodden paths and leave you feeling flushed with your own sense of adventure and youthful ability to still surprise yourself and to break away from comfortable routes.\nNot this place.\nAlthough I walked up here in the middle of the day in the company of a strong partner, it did not surprise me to read warnings from other yelpers about not coming here alone or at dusk.\nThis place is frankly creepy, and with very little to offer to off-set the danger quotient. A bunch of poorly-maintained scrubby overgrown dusty trails climbing up, up, up, to.... nowhere. A little patch of grass at the top with OK vistas. Nothing to write home about. Not to mention, the creep factor. Did I mention the creep factor? Sleeping bags and makeshift campsites littered the hillside. \nThe next time I want to climb a bunch of slippery steps to nowhere while looking over my shoulder to make sure I'm not being followed, I'll make sure to find my way back here.\nOr I could just go to a really nice park.", "author": "Rebecca P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-17", "description": "this place is vile. i imagine the cops decided to let the bums and addicts have this park in exchange for not setting foot in golden gate and bothering the tourists. seems to have worked, since this place is littered with them and golden gate harbors those high class ones with a broken down RV. Buena Vista park is like the TL with trees. crackheads, heroin addicts, illicit sex, etc. \n\nand for all those who say the view is great, take a walk over to corona heights, where it's relatively clean and serene. and the view is better.", "author": "Saikat P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-29", "description": "this is a cute little park to stomp through after a hectic day of window shopping in haight (seriously, i ain't about to drop $20 on a mousepad!?). there are a lot of dogs roaming about so keep your mace out. just kidding! but, if you plan on taking a breather to enjoy your pb&j sandwich, watch out for lurking doggs. there are some nice views of the city from up here.", "author": "Diane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-06", "description": "peaceful, beautiful views, mellow. but beware the cruising after dark! and the werewolves (just kidding, kinda).", "author": "T O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-30", "description": "Played tennis here today.  We had to wait about a half an hour until we got a free court.  But it was ok because while we were waiting we met three cool new people. And we met this guy who felt compelled to tell us these stories of when he used to play with his buddies back in the 60's.  He said he was \"really good\" and was the best \"in the state of...the state of...(insanity)...California.\"  He told us he moved up from playing there, at Buena Vista, to..Golden Gate park.  Wow, that made us smile.  He also told us, though, that all his friends have since died and that he is scared.  He looked ravaged.  We didn't know quite how to respond.  He just wanted to talk.  Well, the place has a history that you can feel.  Surrounded by the city, on a clear day, you feel like you are in a special place.  At least, I did.  I had never been here prior to today.  I felt lucky to have been here this afternoon.  A Buena Vista, indeed it has!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-03", "description": "i love this urban park. i hike from the lower haight all the way up to the very top with my dog, and let me tell you, my ass cheeks are tighter for it. man, those stairs are a killer, but it's great cardio. you can take the long windy road up or take the stairs, but either way, you'll feel the burn. i might be an idiot, but it took me like a year to find my way around this park. there are so many paths, both paved and wooded, and nooks and homeless camps to stumble upon. minus one star because my dog occasionally stumbles upon poopy gifts left behind by homeless campers, and she loves eating shit. this means i have to wash her mouth out because i don't want diseases or parasites. but breathtaking views and cute little benches tucked in woodsy corners *almost* make me forget about how much that sucks. not really though. it's vile. fuck that.", "author": "Mary V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-06", "description": "This was the first park I took my puppy to.  It's a great place to get your puppy socialized to other dogs and people, as there are a lot of great dog walkers that go here.  It is also where I met my current dog walker.  It is a safe place to have your dog off-leash for the first time as it is away from the street and busy roads.  I would give this park 5 stars but I can't because of the following two reasons.  One, there is poison oak here as I have so unfortunately discovered!  So try to keep an eye on your dog when they run off into the sections of dense foliage around the paved trail.  The oil from the poison oak can rub onto their fur, and then onto you and everywhere else the dog rubs up against.  Two, I was told by a friend, and I quote: \"people come here to f**k, so be on the watch out for what your dog picks up\"; which would explain the condom that came out of my dogs bum a few weeks ago....  Well, at least I know people here are having safe sex, ha ha!", "author": "Billy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2004-10-12", "description": "Great off leash park.  You can forget that you'er in a city in this park.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-25", "description": "Best park in the city! I have a Siberian Husky who loves to run, but has no fear of cars, and this is one of the only places in the city where I can let him off leash to run like a mad man. The whole walk is beautiful. There are many paths to choose from, some more of a workout than others, but the end result (the top of the hill) is always the same and beautiful. This has to be one of the best views in the city. As for Prima D.'s review, It must be tough to have such a crappy attitude towards everything that you can't even appreciate the beauty that's right in front of you. I am in this park every day, sometimes twice a day, and I have never seen anyone doing drugs or \"needles and little bags filled with white powder\" (Jennifer S.). And I don't think peeing on the stairs is doing anything to help the scenery of the park, or the enjoyment of others. For all of you newcomers, please don't listen to people like Prima D and Jennifer S, and go check it out for yourself, you won't be dissapointed (unless you don't like dogs, there are always a lot of well behaved dogs running around).", "author": "michele k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-26", "description": "Nice park to stroll in. I sometimes like to walk through it when I need some cheering up. The view is nice on the way up, although you wont have a view at the top because of the trees. As many places are in San Francisco, it is very hilly, and there is lots of noise from the traffic near the bottom.", "author": "Tedster H."}
