{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-09", "description": "Great place for a quick Mexican fix. Great carne asada burrito and el pastor quesadilla. Nice and quick working workers.", "author": "lisa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-25", "description": "Ask for 1/2 and 1/2 pinto and black beans.  Get charged double mysteriously and get ignored when you complain.  The kid with the glasses taking orders needs to not be such a shady rude robot.\n\nCame back, asked for a partial refund, got told to come back six days from now.  \n\nRidiculous.\n\nEdit:  They didn't even make it right either. I threw it away.", "author": "Sean H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-16", "description": "This place is good but it lies about about their hours. They are not open until 9, they in fact close their doors at 9:40. Like just change your hours to 8:30...", "author": "Casey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "Nothing to write home about.\n\nSmall hole in the wall burrito joint with daily specials that seem to be burrito centered.\n\nThey have happy hour tacos.\n\nFirst off let me say I thought the burrito was small for the price I paid.\n\nI'm a big eater so a small burrito isn't going to fill me up.\n\nThe meat was kind of bland and so was the rice. I think everything needed more seasoning.\n\nThey charge extra for chips and salsa which I don't understand for such a small place. \n\nI'd skip this place with all the other better opinions on this street.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-21", "description": "Rarely take the time to write a review. Live in the area and finally decided to try this place bc little guy was hungry and craving a burrito. Got him a bean and cheese burrito. Easy enough, right? Wrong! Burrito completely fell apart, beans ran out the sides. Inedible. Never again and someone please put a proper tacqueria in WP.", "author": "Atlas Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-15", "description": "For the shady manager that tried to scold me with his pointed finger, saying \"don't ever cause a scene like this again...blah blah blah\" how about you pay the employees their checks regardless if they quit!\n\nWent to collect my sisters check after she had to fly home for a family emergency. The manager said checks are given on the 5th and 20th of the month. She quit in July, its August... still no check.\n\nHe didn't believe me that it's against the law to hold an employee check... so this is for you! \n\nhttp://www.dir.ca.gov/dlse/faq_paydays.htm.", "author": "Raquel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "Good burritos. Large. The steak in my California burrito today was a little salty, but otherwise flavor is usually solid. Hub loves shrimp burritos\nAnd the watermelon agua fresca. La Niña likes the chicken burritos, quesadillas, and even just the chips. Pico de gallo is good. \n\nBeing at West Portal makes this location an easy stop for us, whether taking the train (it is right next to the station) or a convenient stop on the way home. Staff is super friendly every time!", "author": "Lani S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "The food was really bad! I ordered a burrito with retried beans, rice, cheese, guacamole, pico de Gallo, and jalepenos \n\nThe jalepenos were cut so thick I couldn't it eat it. Besides that they charged me 1.25 to have them in there. \n\nThe burrito itself was 8.80 which is pretty out there for something with no meat. \n\nThe burnt the tortilla\n\nThe \"Spanish\" rice was white, no color. The beans were basically paste. \n\nThe tomato's and onion in the pico de gallo were so thick! They didn't even dice it. \n\nI couldn't finish it. I threw it away\n\nThe girl behind the counter was very nice. She asked \"how was your meal\" and I just said \"good\" because I didn't want to stress her out. \n\nShitty food, nice people.", "author": "Maddy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "Burrito was good. Not bad. Fast and efficient. Went there because another restaurant was close. People complain to much. It's a burritto place not a high class restaurant.", "author": "George B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "Found this hole in a wall and decided to give it a try. \n\nI ordered the Super Burrito with Grilled Chicken - no beans or cheese. There ended up being some beans inside (no big deal). The skin was super crispy but what shocked me was that since it was made fresh, the burrito was cold. Ordered the Cheese Quesadilla for my son so you can't really go wrong with that but it was hot! The portion size was perfect since I couldn't finish the whole burrito. \n\nWait time was a bit long since there was a few people ahead of us - not a bad place, but I would like my feed to be at least warm or hot if it was prepped fresh.", "author": "Nancy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-15", "description": "I've lurked passed this place quite regularly when I've had to wait for my ride home from the muni station. It's conveniently located next to the West Portal station. It didn't get the highest Yelp reviews, but finally decided to grab dinner one night on my way home, and there was some weather. I was really impressed with the really friendly and helpful customer service. \n\nThey are very generous with their serving size. I bought burritos to go for the SO and I and they were huge and heavy. Good to share or save half for later. I ordered a regular burrito with shrimp and refried beans. It also came with a generous helping of tortilla chips (gotta love a free side of chips you don't have to pay for!), and up to four containers of salsa. I also love that they grill the outside of the tortilla. My SO really enjoyed his chicken burrito with black beans. You can get a super one with with all the works if you want to put more goodies in your burrito. Wish I didn't postponing trying this place out. It was great spot to pick up something to go or quick to eat. There is a limited amount of seating. They also have some drink selection including fruit flavored Jarirtos bottled drinks.", "author": "Nova P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-14", "description": "I've been eyeing this place for a while since it's right by the West Portal Muni Station. I entered and was immediately concerned once I saw the white-washed menu. I left thinking I was ripped off after paying $10 for 2 beef tacos to-go. The carne asada left me speechless. It was well-seasoned, high quality ranchera meat. I either need to go back (which would not be anytime soon) or find out what is the name of their carniceria supplier. \n\nCredentials: I'm from LA  and Mexican.", "author": "Daisy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "We came here a few years ago and weren't impressed. Decided to give it another try and I'm so glad we did. It was absolutely delicious and the staff was so nice. The chips are light, super crispy and had a great amount of salt. Great salsas. The carnitas super burrito was enormous. Glad to be so pleasantly surprised", "author": "Christine H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-16", "description": "There was a rock in my friend's burrito... I got the chicken super burrito, which was fine. My friend got a super shrimp burrito and there was a rock in it... Like how....????", "author": "Steven L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-18", "description": "Usually I like this place but I got a super veggie taco and all I got was veggies and some guacamole on it which was kinda depressing for $6 which is pricey and they don't really have their prices posted either so generally confused and sad about my taco", "author": "Hannah j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "One of the best chicken asada quesadilla ever... and I'm from socal. We will definitely be back when in town!", "author": "Barbara V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "I went here last night and ordered a veggie burrito. I have to say it was the best veggie burrito I've had anywhere. The tortilla was fresh, not the kind that are rubbery and never seem able to be cut through if you are using a fork and knife. The chips ... wow! crispy and warm and so nice when you dip them in their divine tasting salsa. The veggies within the burrito were flavorful and grilled to perfection. I had half of my burrito for dinner and the other half for lunch today. A co-worker happened to see me cutting into it and when she saw bits of it's filling, she begged to know where I had ordered it. Looks like Loco Burrito has a future customer. I will be returning here often. It's hard to find a great tasting veggie burrito.", "author": "Clare H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-04", "description": "Yikes. bizarre cashier experience, kooky pricing, one overpriced burrito was cold when we got home (10 min later) and the other was completely wrong (wrong meat, no toppings).", "author": "Jenn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "Didn't feel like waiting and paying $12 for Submarine Center so I moseyed over.\n\nThey have daily burrito specials for $6.75 which can can upgrade to \"super\" for an additional $0.75. The staff is nice and although the menu is small, it's gives enough choices to satisfy your tummy.\n\nOrdered the taco salad w/ fish and it was a smidge under $10. Comes w/ chips and salsa. At first glance, I thought they forgot my fish but it was just buried underneath. Comes w/ 3 pieces which is quite generous compared to other places. Tostada bowl was airy and crispy while the flavors paired well. Fish was meaty. Salsa was incredibly fresh and their other hot salsa was spicy! Overall, it was a good lunch. \n\nJaron was helpful and so was the efficient staff behind the scenes.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-15", "description": "The worst burrito I've ever had. They must have poured the whole thing of salt into it. What should have been a tasty lunch, turned out to be just salt. If that's all I wanted, I could have just gone to Safeway and gotten a Morten for two bucks versus a $10 burrito that ended up in the garbage.", "author": "D G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-09", "description": "Sorry, not so great. Grilled steak burrito was full of fat and cartilage. $4.50 for guacamole that came in a small salsa container. Booo!", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Always great. I'm surprised by the low rating. We order burritos from here all the time.", "author": "Hilari V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "Having learned from past experience with carne, I decided to try them out again and do went back and ordered chicken burritos; they charge every little thing!  Was told I could swap the beans and cheese in my burrito for guacamole but was charged for the Guac (thats not really a sub/swap then, is it?). 10 chips in the little bag that comes with each order, and you get 2 small containers of salsa; any more chips, salsa or anything at all you'd get charged.  2 bad experiences in 1 week were enough to convince me not to come back again.  I should also advise my friends to avoid the stingiest taqueria that is Burrito Loco!", "author": "J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "My favorite Mexican place!! Their carne assada it's BY FAR the best I've ever had in California.", "author": "Bruna D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-09", "description": "BEWARE OF FALSE ADVERTISING:  This place advertises on its website http://burritolocosf.com/ that they have a special burrito every day for $6.75 and details it on the website.  It's the main on the website.\n\nWhen you arrive and ask for it they say \"We don't do that anymore\".  I even pulled out my phone and showed them and they just shrug  their shoulders and say they are not doing it. \n\nI left and went someplace else as I felt deceived and tricked.  I can not recommend a business with such deceptive practices and refuse to honor what they advertise.", "author": "San Francisco D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Hole in the Wall Mexican restaurant and still has better customer service than most dine in spots in the city! \n\nSeriously, the Super Burrito with the Carne asada is my favorite and they Jorritos soda and the Mexican Coke...in the one liter glass bottles! Stole my heart right then and there! The Habanero salsa is scorching hot and is a sneak attack too with the taste of sweetness in it, so be careful! \n\nThe fact that when I order a meal and have a seat in the small seating area they bring it out to me and they happy and cheerful and even the cooks who are cooking over the hot stove they seem happy as well! \n\nIt seems that it is rare to see anyone really cheerful and happy while working in the city it seems so seeing that here, it means a lot to me! \n\nI moved here from San Diego and the Burrito Game down there is pretty competitive and all over the plac. In San Francisco you have to go hunting for a Mexican food place that makes a good quality burrito or taco. \n\nThis place being right next to the west portal trolley/muni station makes this spot easy for me to get to and to find. \n\nI keep coming back and I love it here! Please, don't change a thing and I will be by again for my next Super Burrito and Mexican Coca-Cola!", "author": "Adam G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "would be a 5 stars because my boyfriend and i love the taste butttt.... \ni always order a super no meat burrito (veggie right) and i wanna say maybe on 5 occasions i pay 8 bucks for this and get home and its literally just rice beans and cheese, no works :( disappointing \nsometimes i just tell the cashier what i want specifically because I'm jaded and i don't wanna get home and it only have 3 ingredients in there. \nalso don't order jalapeños in ur burrito because they come from a can and they will give u dried leaves in ur burrito lol my boyfriend was pissed\n\notherwise they are suppppperrrrr friendly great staff and again love the taste just sometimes i don't get what i order.", "author": "Emma T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "This place is pretty amazing. Such a hidden gem! Also easy on the wallet. They have daily specials with burritos under $7. The burritos are fairly large with free chips and salsa. I come back here almost every other week. My favorite is the super grilled shrimp burrito. The staff is pretty friendly and they bring the food to you if you dine in. I've been other places where the service was terrible, chips cost extra and the food was overpriced. Definitely one of my favorite taquerias in the city outside of the Mission.", "author": "Andy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-02", "description": "Been eating at this place for the past two years. A year ago it was pretty whatever but in the past few months they've changed a few things. The carne asada is honestly pretty great as is the al pastor. The other meats aren't as good unfortunately. Love the cantina style chips but the salsa is pretty forgettable. If you like spicy stuff, ask for the habenero. It'll test your spice tolerance for sure! Def try the carne asada and you won't be disappointment. \n\nP.s . I lived in SD for a few years so hopefully that gives me a little burrito-cred.", "author": "Jeffrey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Burrito loco  was smacking, great quality and taste, super fresh, chips were amazing and to be honest with you everything was good! And the service was super friendly which I like the most! I think el burrito express is a thing of the past!", "author": "Jose B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Good place burritos are huge and I love them goood services same cooks all the time so u can say u get consistent food that is what u get every time one bad thing I have to say is salsa they give you 2 per person which okay what happens when you ask for more ? They charge 1.00 per EXTRA salsa so that is a big downfall 25. To .50 cents ok but 1.00 really ?", "author": "Karina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "Hey honestly this place used to be going downhill but the primary, disgruntled employee seems to have moved on.  The taste here is delicious.\n\nGo for the roasted chicken!", "author": "Sam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-02", "description": "I think this place has gotten better as compared to when they first opened. The burritos are good. Carnitas is normally my first choice of meat, but I've tried their spicy chicken too and it's delicious. I especially like that you can request the extra spicy habanero sauce - since I love spice even if I regret it later. \n\nWhat would be great is if they had seasonal agua freacas!", "author": "Angelito R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-22", "description": "Despite the poor reviews, I think this place isn't bad. The staff was quick and courteous and the inside of the restaurant was clean. There is a counter space to eat and a couple of small tables as well. \n\nI had the regular carne asada burrito to go. It came with super thin chips and salsa (pico and chipotle?) The burrito was pretty bland so I'd probably recommend going with the super. The steak was good quality, there just wasn't a lot of it & a bit too much rice. \n\nAs this is a new spot, I am giving them the benefit of a doubt to tweak the things that take a business from so-so to good. You guys are on the right path, but don't skimp on the good stuff. Make the burritos smaller if you have to, but put more beans and meat in there!", "author": "Nina M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-18", "description": "Friend ordered a shrimp burrito last night and is sick today. \nUnable to get off the toilet - order wisely.", "author": "Christine V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "First of all, I am Mexican, so I believe my review on this restaurant is legitimate. Having had grown up eating Mexican food, I know damn well what good Mexican food tastes like. That being said let me state my opinion....\nI don't understand why there are negative reviews on this spot because Burrito Loco has the best grilled chicken burrito I've ever had! And I am not exaggerating. \nThe staff were super friendly, the restaurant was very clean, and my food was neat, cooked just right, the favor was amazing, and the guacamole was superb! And the prices are fair. \nI give this spot 5 stars because I was very happy with the taste, quality, price, staff, and atmosphere of this place.", "author": "Edith G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-17", "description": "Only burrito I haven't finished in the past 5 years. Literally taste horrible. I dont know what batch of meat I must've ran under, but I will never go back. Please improve significantly.", "author": "Nicholas V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-27", "description": "So I going to this place this afternoon to get a couple burritos one a el pastor the second a beef burrito. 1 burrito was decent then comes the beef burrito which was a nightmare. How are the on earth are you going to have sand in your ground beef burrito which can only indicate to me a serious health inquiry.\nNeedless to say I'm never going to be going back to this place ever again or for that matter thinking twice about having a beef burrito. I would like to go so far as by saying if this is the same place from Park Merced please one and all do stay away.!\nYUCKTOWN USA in their kitchen.. ohh and as a little side note; Disgruntled workers make horrible food.", "author": "Cheryl F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-17", "description": "The burritos are unusual. I use to go here periodically but after awhile I stopped. There is something about the food that makes you feel somewhat uneasy. I often felt like I was going to fall asleep after eating the burritos here and that's not a good thing. I felt like I was being forced into a food coma with minimal food consumption. The burritos are not that big but there is something that gets put into them that makes you sleepy. That's not cool. It sure is a BURRITO LOCO kind of feeling. Consider yourselves warned. Burrito lovers beware of their ways at this establishment.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Definitely the best tacos I've had in the city. Simple but delicious. Generous portions of perfectly crispy but moist meat (I had the chicken and carnitas) with onions and cilantro. Just like So Cal!", "author": "Hayley K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-13", "description": "Wow so i ordered a super burrito  at 4:53pm, paid and waited for my food. Looked up and seen a sign that said 2 tacos for 5 bucks from 3-5, i went over and asked can i buy that. The Caucasian girl said no its 5:01. I showed her my phone and it said 4:59. She said sorry its to late now. Well i guess you lost this customer and a few more after I get it going viral on yelp...", "author": "J W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-19", "description": "I feel really bad writing this because the guy taking my order was really nice.  The worst burrito in S.F. I can say this because I was born and raised in the mission so I've only experienced great Latin food.  I thought I would try this place out and was excited when the guy said they grill the tortilla. My husbands steak was fatty which could happen, but the flavors of both the carnita and steak were a weird flavor. NOT at all Mexican.", "author": "Jeanine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-27", "description": "Use to order their shrimp taco every week, up until last week.  I found a piece of metal wire in my taco. I almost swallowed it too. Never coming back. Too bad they actually have decent food.", "author": "April Rose C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-26", "description": "I was looking for Mexican food and driving by I found this restaurant in the corner of ulloa st. Place is very small but I was planing order to go, the guy who helped me was friendly and polite. \n\nThe reason of one start rate is because the food. I ordered a regular burrito (Asada) and one drink. Burrito was meh and didn't have good flavor, the meat was very dry, rise was a lil hard and overall not a good burrito. Perhaps you can deal with not being a quality burrito if price was correct (low?) but I paid $15 for regular size and a drink. Definitely not coming back to that place.", "author": "Issac R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-11", "description": "The roaming cat found himself looking for something fast and quick, and spying the little burrito joint on the corner by the train station looked like it would be right up my alley in terms of what I wanted. \n\nTiny tiny place. Not much seating there, looks like a super small operation with one cashier and a cook. \n\nMenu here is small, not too many different options, but good enough for someone who wants something quick. \n\nI ended up getting a veggie burrito with pinto beans. It came quite quickly and I must say that this thing was LARGE. Served with some chips and salsa, this was going to fill me up for sure. \n\nAbout halfway down the burrito though, somethin odd happened. I bit into something VERY spicy. There was literally nothing else spicy in the burrito but that one bite! Not sure what that could have been, but I feel it must have been some kind of mistake. \n\nI will say that the rest of the burrito was a bit on the bland side, but not terrible, and was quite filling. \n\nI was a little bothered when a pigeon walked into the restaurant, towards the cashier, and helped himself to the random scraps on the floor. Not to judge a pigeon, but they tend not to be the cleanest of animals. \n\nLots of room for improvement, probably would have given another star if by for the bite of spicy death and the neighborhood pigeon, but it is what it is. \n\n*chirp*", "author": "Jei C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "Service is ok, it's not bad but it's not top of the line either. They knew what to get.\n\nThe Food is well... generic and doesn't have something that other places like Ocean Taq or El Farlitos have but it's good enough. \n\nLocation, the next closest burrito place for me is on Ocean Ave and it's either take muni, walk a decent distance (except on rainy days), or a short drive. This is pretty convenient to have on West Portal for me. \n\nPrice is ok, Although online ordering not visible (I'm guessing this is on Eat24/Yelp's limitation and not entirely the shop's fault)", "author": "Atsushi E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "I really like this place! Each time I've gone in, the staff (specifically the register people) are very sweet. The burritos are rather large for a decent price with fresh ingredients. Additionally, they have daily specials! They also have a really yummy and very very spicy habanero sauce that I love.", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-13", "description": "I wanted to like this burrito joint, I really did. It is close to my house, in my 'hood, and the family that owns it is really nice. I got the super carne asada burrito with pinto beans. It was large, I'll give them that. And the habanero hot salsa is kick-ass hot.\n\nBut two separate bites of the meat had major gristle in them - unchewable, spit it out gristle - which is one bite of gristle over my limit. The meat was bland, the sour cream was extra thick, and as a whole it was a rather mediocre burrito. \n\nIt would do in a pinch, if you absolutely had to get something to eat and the Sub Shop two doors down was closed. But the next time I need a burrito, I'm hopping in the car. Unfortunately.", "author": "Greg Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-03", "description": "Probably one of the best carne asada burritos I've had since moving to San Francisco! Went here for the first time and got the regular carne asada special and it was delicious! Definitely coming back with friends!", "author": "Lola M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "I stopped by here for the second time today. The ingredients are fresh, they're not stingy with the fillings and it's very tasty.\n\nMy favorite thing is they have thanked me for coming in both times. My old standby taquerias have been treating me like work lately and I've gotten home with the wrong order - not here! \n\nIt's right next to West Portal Muni station so easy to stop by if you're coming or going through the neighborhood.", "author": "Larry R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-05", "description": "Got the super shrimp which tasted pretty good. But I swore, I only counted eating a total of 3 pieces of shrimp!!! Imagine, the super burritos is pretty long. I finished the burritos, but it's more like eating a grilled veggie burrito rather than a shrimp burrito....lol.", "author": "Forrest G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "We really like the burritos here. The ingredients are fresh and they are generally fairly quick when making our food. They also included chips and salsa as part of an order. The chips are very light and tasty and they give you a bag full. I get the grilled shrimp burrito and love it. The shrimp is big and plump unlike many other places that make burritos. They will either grill or saute the shrimp. \n\nThe staff has always been friendly and helpful. It's a good value and a great location right next to the West Portal Muni station.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "This place has to be 1 of the best burrito joints around! Their a little on the pricey side but the food is so worth it. The cashier Daniella i believe her name was so sweet and very helpful. They have different deals throughout the week and lunchtime specials. The cooks did a excellent job. I am so pleased wit this restaurant. I will definitely be coming back.", "author": "Jasz S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-07", "description": "So crazy.\n\nAmount of food: This was a jam packed burrito filled with huge shrimp (special on Saturdays for $5.95), lots of seemingly freshly grilled strips of chicken for $2 extra and black beans.\n\nAmount of sour cream and guacamole: There was a bit of each which was surprising considering none was ordered. Unexpected ingredients are one of my least favorite things.\n\nStill a delicious burrito that was 90% what was expected. Good enough to be four stars if the $8 price wasn't a special. Normally it would have been closer to $10 which is closer to three stars.\n\nIt's crazy enough.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-10", "description": "Loco is our go-to local fav. That guy at the front, he's nice. Friendly but not in your face and always polite. It's a small shop with a couple of tables and a counter and they always have the game on when you run in for your take-out. Carnitas is good, guac is good. Sometimes that grilled chicken gets a bit crispy or something. Generous with the chips. Very good value.", "author": "Na m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-29", "description": "The food is not particularly bad but not particularly that good either. It's decent and the prices are under $10. It's more like fast food really. Small place, good if you're in a rush or eating alone. Not a good place for groups as there is only a bar and then one table of two chairs. All in all, it's okay if you're alone and need a quick bite.", "author": "Jamie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "I love this spot! I always get the super shrimp Burrito and it never disappoints! It's a perfect friendly and quick little taqueria. Their complimentary chips and salsa are also really tasty :)", "author": "Jasmine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "Pretty good burrito spot for the neighborhood. I come here often for lunch and usually get the daily special burrito which is different everyday and such a good deal. You can also upgrade it to super and still get the deal! The employees are also nice.", "author": "Nicole V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-18", "description": "Its an alright burrito. Had the daily special-carnita super burito. Just enough to fill my stomach.\nFlavor of meat was OK. Salsa vegies in the busito was good.\nGuadalajara on Mission is still the Best in my book, way bigger, juicier, and warmer.\n\nStaff was nice and prompt.\n2 dollar extra for shrimp, maybe that will jazz it up.\nNice long bench out front.\nBut its cold outside cuz its Frisco.", "author": "Hung L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-11", "description": "Came into this place, ordered a burrito.  didn't want the beans but asked for extra rice in its place.  So I'm gonna assume the beans are more expensive than the rice. . . but got charged $1.25 for the extra rice even though I'm missing the beans???  And it doesn't show up on the receipt as a separate charge-had to ask for an explanation why the burrito was more expensive than the listed price!    \n\nIt's not that great of a burrito either-the meat has no flavor, the rice is bland and they wrap the burrito so tight there's a double layer of tortilla around half the burrito!  Looks big, but isn't what it seems to be.  And where's the salsa fresca?  Was it that little bit of small diced tomato and maybe a bell pepper or jalapeno or something before the last bite? If you're subbing rice for beans, shouldn't I get the same amount of everything else and add a bit extra rice for the equivalent of the beans?  Total ripoff, and they don't serve what they describe on the menu.\n\nAmigo, you gotta do something to generate some good PR at your place cuz your burrito ain't worth $10!  Any other burrito shop I've gone to doesn't charge extra for rice that's substituted for beans and they're burritos are much better than yours.\n\nEsto no es bueno para los negocios!!!", "author": "Joeblow L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "I don't quite understand the poor reviews (not sure it is Yelp food-snob-itis in action) but I'm glad I didn't pay attention when I came to Burrito Loco. This place:\n\n-is super convenient (literally right next to train stop)\n-inexpensive\n-has great service, friendly workers\n-most importantly, good food\n\nOn that last point, I got a burrito with half chicken, half carne asada and it was yummy, large, and had good flavor. I also give them bonus points for having wheat tortillas. I also got the watermelon agua fresca and it was superb and refreshing. The only point I'd subtract one star for is that there isn't a salsa bar (like a Pancho Villa for example) but that's my only ding for this spot. I'd definitely go here again.", "author": "Rick P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "I like this place the meat always has good flavor, there reasonable on prices and close to the house. Everybody that works there is always friendly.", "author": "Scott J R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "*This place gets an extra star because I go there a lot and the workers are good people running a good local business.\n\nBurritos here are pretty good -- nothing spectacular, but still pretty good. Flavorful meat and generous portions, and free chips and salsa on the side. Tacos are just ok, in my opinion -- theyre a little bland. I havent tried anything else on the menu.\n\nFriendly service and the price is right -- $6-$10 for a burrito. Super convenient to West Portal station and some outdoor seating for people watching. I like this place.", "author": "Joe F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-01", "description": "Look, this ain't no Mission burrito spot. But this is West Portal.... Considering that a sub sandwich a few doors down will set you back $10, it's nice having an affordable option in a nice but overpriced neighborhood.\n\nGranted, the food is nothing special but it's solid and gets the job done. Honestly I'm a little shocked at all the negative reviews.\n\nWhat's there not to like about $6.50 burrito with chips when your other options are overpriced subs and ridiculously overpriced crepes??", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-06", "description": "I was psyched when a new burrito place opened up near where I work because I haven't found a really good one in the neighborhood yet. Went to check it out and had a BAAAAAAAD experience. I normally eat vegetarian but will get seafood on occasion, usually if I'm someplace fancy or if nothing else on the menu looks good. The veggie burrito had \"steamed squash and mushrooms\" which often means they heat up frozen veggies in a microwave and throw them in a burrito (not sure if that's the case here or not) so I opted for the Shrimp Burrito. It didn't come with guac or sour cream so I added those which made it, like $10. That was kinda lame but wouldn't necessarily deter me from coming back. \n\nGot halfway through the burrito, it was OK, nothing special but not bad. Then I took a bite of something tough... I pulled a six inch piece of plastic out of my mouth. EW!!! I took it up to the counter and the guy apologized and I asked for a refund. He thought for a minute and said \"yeeeaaahh\" begrudgingly. He asked what I had and then asked to see the burrito. I showed it to him and he said that it was $9 (no!) and I ate half so he would only give me $4. NOT OK! Do these people realize their brand new business could be done for if a health inspector found out about this... I really wanted this place to do well but I'd be surprised if they last. 3 of my coworkers went there before me and none of them had a good experience either.", "author": "Stephen F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-28", "description": "Good: Free chips n salsa. \n\nBad: Store bought salsa is much superior  to what they serve here. \n\nMy Yelp tip to you all - keep walking. In our beautiful and diverse city of San Francisco the eatery like this is just nonsense. \n\nThey will burn very fast... And the reason for that is simply a complete cluelessness of what they are doing.\n\n Armature people at its worst.  The food they have put out defies the word \"crappy\".  \n\nThey don't know a simple concept of salt and pepper. \nWacky, tasteless, rubbery chicken. \n\nInferior food products used. I think the cheapest they can buy and I can taste it in every stale  bite of it. \n\nThis unpleasant taste is still in my mouth. \n\nGreat location but what a lousy food.\n\nI don't wish an evil upon anybody but they might be better off to start learning new skills. \n\nAs a restaurant - there is nothing there. \n\nJust Loco, minus the burrito.", "author": "Xela H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-10", "description": "I tried the vegetarian burrito and it was not bad.  Next time I would limit what I want on my veggie burrito.", "author": "Liz D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-21", "description": "I am pulling hard for this joint as I love clean Mexican food as it is so close to my home.  This place is really a 2.5 star joint (for now) but I am rounding up to their benefit.  Please add a salsa bar with super spicy salsa and do a better job of steaming your tortillas.  Otherwise, the chicken and rice tastes pretty clean, it's just a tad dry and bland without some bomb salsa.\n\nI know/hope they will get this right in the long term.", "author": "Joe P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "Is it the best taqueria in SF?  No.  But is it tasty, are the people nice, and are the prices reasonable?  Yes.  And for less than a week in biz, I think they're doing a great job.  I'd give it a 3.5, but since that's not an option, I'm rounding up because they were so nice.\n\nI got a super burrito (with no meat).  Flavorful--and huge.  Plus, extra points for all bean choices being vegetarian.  Chips were fresh and yummy.  Plus, someone else complained about no spicy salsa, but I found the habanero salsa to be quite hot.\n\nThings I'd like to see:\nJunior (small) size burrito option\n\nVegetarian \"super burrito\" with all the same ingredients minus meat, at a lower price (should be cheaper since there's no meat) \n\nA marinated tofu \"meat\" choice so vegetarians can add protein to their burrito", "author": "Lyn R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "This is place is literally a couple steps away from West Portal Station. Price is fairly good....a bit more expensive than most burrito places. They also give free chips and salsa (no salsa bar though). I usually get the veggie burrito which costs a bit under $10.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-25", "description": "chicken burrito and shrimp burritos are great. \nthis place is clean, fast snd friendly. \nWe go weekly", "author": "Alice X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-23", "description": "A mexican food joint without a salsa bar... weird! \n\nThis place is really tiny, so it's a great place for a quick bite. I ordered my food to go and it was made super quickly (3 mins tops)\n\nLoved the rice in my regular carne asada burrito, very authentic mexican rice. The meat and the salsa  in it were super flavorful!", "author": "Lissette V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-17", "description": "This place was a great deal on a Monday afternoon for me! I ordered a quesadilla with a few add-ons and my friend ordered a simple steak burrito and our meal was under $11. Our meals also came with free chips and salsa. The seating area was small, but there was only one other group of two in the restaurant at the time, so if seemed fine! There were seats outside as well. I don't love overly spicy food so for me it was perfect! The workers seemed really friendly and quite casual. The only bummer was my friend asked for no cheese (preference not allergy) and noticed some in his burrito. Overall though, it really was a great deal and a tasty lunch! \n(Also there were outlets to charge my phone - which was super helpful!)", "author": "Laura M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-23", "description": "Thought we give this place a try, turned out to be a bad decision. I got the super nachos with Carne asada and the chips were so salty, and barely any meat. I wouldn't recommend this place to anyone.", "author": "Jesse L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "Simple, no frills. There are a variety of salsas behind the counter. I had the red, verde, pico and habanero. All were fresh and tasty. My wife had a veggie burrito which was good. The real stars were the carne asada and pork - fabulous! I also had a fish taco which was really tasty. The meat coupled with friendly staff clinched the deal for us. We'll definitely be back.", "author": "Graham W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-25", "description": "Wanted to like it and have had two okay experiences here before - this time server grudgingly gave me cheese and said that he couldn't put on side ( which I did pay for!). Everyone seems busy which is good but they could work on their customer service!", "author": "Alison M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-06", "description": "I came into this place with an open mind. I read the reviews, reminded myself that I do not live in or near the Mission, and ordered the daily burrito special (sauteed shrimp). I don't know what it was about the burrito, but something tasted off. I can't identify it still, but something was definitely weird. The burrito came with tortilla chips (which were pretty decent) and a salsa of choice. I asked for the hottest they had, and while it definitely had some heat, it also had some sort of weird undertone and aftertaste. I really wanted to like my burrito, but it was just kind of lacking.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-23", "description": "I see a number of reviews that have dubbed Burrito Loco 1 star.  While I can only speak for myself I believe 1 star to be very harsh.  Yes we live in a city with fantastic food but that does not mean good/average food needs to be abused.  Recently opened (quasi), good prices, always very accommodating as far as adjusting ingredients,kindly people working, easy location right outside the MUNI.  I would absolutely eat here again and I have.  Roll back your judgement and stuff a burrito into your mouth.", "author": "Philip M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "Best burritos in the area! Love this place!!! Everyone inside is very nice and I got my burrito within 4 minutes of ordering!", "author": "Grace B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "I have been looking for a good burrito place out here and have had yet to find one until I found burrito loco, it's like a better, cheaper version of chipotle and the chips are super good. I had the steak burrito and I was pretty satisfied.", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "They give you a nice big burrito with free avocado and sourcream and a bunch of chips for just over $6. Good burrito too. \nThat is awesome.", "author": "Spenser S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "Burrito Loco's Daily Burrito Special is one of the best deals in the City, seriously. $5.95 for a burrito (the meat varies each day) with sour cream and guacamole, plus chips and salsa? Yes, please.\n\nDon't come here if you're looking for a romantic dinner or fine dining. It isn't those things. Come here if you're looking a quick, good tasting burrito at a great price.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "Burritos are really good, I was honestly surprised. They have good options on what kind of meat you'd like if any. But are a little limited on Mexican food options. If their building was bigger, it would be a great place to take a date, but I suggest you just go with friends since you almost always have to take it go. I always grab a spicy chicken burrito before hitting up one of the local bars.", "author": "Tommy F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-05", "description": "Gross. I've always said West Portal needs a good burrito joint. It still does. The food at Burrito Loco lacks any flavor. The service is lackluster. The decor is depressing. While I was there I was subjected to a crappy flatscreen tv playing an infomercial at full volume. Not going back.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "The shrimp burrito I got was good. It's hot, saucy but not spicy. I am not a fan of their chips and salsa came with the meal though. Chips were old and salsa was watery and I couldn't tell what's inside.", "author": "George C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-15", "description": "Couldn't wait for this place to open as the previous sandwich shop never really made sense next to Sub Center.\n\nThere aren't a lot of fast options in West Portal and this place fits the bill.\n\nIt was their first day open and my chicken burrito was great.  Might just be all the fresh paint, etc but it seemed fresher than El Burrito Express on Taraval which we hit up a lot.\n\nSimilar prices to other taquerias and similar offerings.  I'll be back!", "author": "Brian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-23", "description": "The worst experience ever. They screwed up my order and never had a chance to eat.  If you can't take the order don't be in the food business.", "author": "Hiroshi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-05", "description": "The burrito was really tasty and came with free chips and salsa. My only complaint is that it will run you about $10 if you get a drink and there aren't any combo deals. There are however some really good daily specials where you can get a specialty order for the cost of a normal order. Definitely a fan of this place!", "author": "Jacob A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "Me and my girlfriend were going to eat at squat and gobble. Let me glanced over and saw this little restaurant called Barito loco. We decided to try it out let me say OMG! Hands-down best nachos I've ever eaten in San Francisco highly recommended to go to the staff is friendly and nice way to go !!!", "author": "Thomas S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-04", "description": "I feel really bad writing such an awful review because I was so excited that there was going to be a burrito spot in West Portal. I went in maybe a week or two after they first opened the doors, and let me tell you... I haven't been this disappointed in a burrito, or my food in a very long time. It was so bad, I threw out more than half of the burrito after having a few bites.\n\nI ordered a carne asada burrito (I mean, you can't go wrong with carne asada, right? Who could screw that up? Pffft). It came with a side of chips and salsa. The salsa had a weird chemical-ish taste to it, I couldn't pinpoint it but it tasted really weird. The chips were bagged, store bought chips, nothing special. The ingredients: Not fresh. They had the food ready, and the guy in the back would put the ingredients inside the tortilla and BAM (in 3 mins or less you get your nice, cold burrito). The carne asada was very bland. It tasted as if it were boiled, season, then thrown on a grill to sear for a little just to make it appear as if it were grilled or even cooked over a fire stove. I don't know!!! It pains me to even describe it. I think the only decent thing in my burrito was the small slices on guacamole. Eventually, I ended up dissecting my burrito. I opened it up and just slowly inspected everything. I was so disappointed. It was a sad day. It was a sad lunch. \n\nI know Burrito Loco is a new establishment and there's definitely a lot of room for improvement. Hopefully the can take some of our reviews into consideration to help with the business. I mean, I'm not writing this to bash on the business because I wanted to like this place. Seriously! I live down the street!! But I'm just being honest. Warning all of my innocent yelpers out there to try with caution...As this place isn't all that great but who knows, they could get better.", "author": "Cat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "The enchiladas are super yummy! The tortillas are hand made fresh as you order and the sauce has a good flavor to it not spicy but got flavor. The young guys that work there are really nice they work quickly and are very attentive. Great spot to stop in or order out if you have a caving for good Mexicali food.", "author": "Selah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "We've been here a few times now and I'd say they have decent food. We get the Burrito Mojado (wet burrito) with Carnitas. The food can be inconsistent: one order we got wasn't hot - perhaps due to the sour cream/guac they put on top? However I'd cut them some slack since, as other folks have mentioned, the area lacks good burrito places. The order comes with free chips and salsa too. You get a lot of food compared to other places nearby and the cashier is friendly.", "author": "Aaron P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-12", "description": "Aside from the food being decent, not amazing - their quality is just unreliable... more towards poor. The first time I got their nachos I was really pleased; hot and tasty. Since then, every single time,  (Yeah I tried ~4 more orders of nachos. I echo the other locals, I really wanted to like this place) the nacho chips were cool. Not warm at all. Therefore the whole meal tasted lukewarm.  I had to toast the meal back up myself every time so it wasn't very enjoyable. I used to get their veggie burrito a lot too every other week but eventually stopped because it began to taste like hardly anything but rice, and dry. :-/ not what I paid for.\n\nGet better, loco! I hope the owners are reading. Just fix up the taste.... so much promise.... :-(", "author": "Kimberly J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-01", "description": "Yeah, unfortunately it's just not that great. My chicken burrito just tasted kind of flat, the salsa was thin, and the pico was bad -- it just seemed like chunks of tomatoes with no real flavor. They're friendly, clean and nice, but the food just isn't good enough. I hope they up their game soon, because a solid burrito place would be a nice thing to have around West Portal. I wanted this to be good. :/", "author": "Matt C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-17", "description": "Ehh its okay. They were skimpy on the nacho toppings and the roasted pork was just OK. Nothing too fancy.", "author": "Mau T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-12", "description": "$7.80 for a bean and rice burrito with guacamole ?  No thank you.  When questioned they said \" yeah, that's right\". \nNo, that can't be right, but I'm not gonna stick around while they figure it out. Just kept on walking.", "author": "Steve O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-02", "description": "This was my first time visiting here and I have to say I was impressed. The customer service was exemplary and so were the carne asada tacos as well. I love that they fry the tortilla and make it crispy and double stack it too. So good. It you like it hot ask for the habanero sauce. It was the hottest sauce I've had since I lived in Texas!", "author": "Ian H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-07", "description": "came here and ordered a carne asada quesadilla. \n\n1.) carne asada was bland. it was probably the worst meat I have ever had.\n\n2.)chips were a little thin but pretty good.\n\n3.) salsa was actually good but it was a really small portion.\n\n4.)the price of the meal was not bad. 6.24 including a canned soda.", "author": "Mohammad A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "Portion size is good and worth the price. The chips for the nachos is perfect!! Thin and crispy and the presentation was beautiful!! The staff was kind and courteous!!", "author": "Julie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-18", "description": "So Toasties has revamped itself as a burrito place and nothing has changed. The food is bad, the layout is atrocious, the service is rubbish, the hygiene is non existent and the health violations are countless. Will someone please call the health department ASAP. The receipts even still says Toasties.  If you were familiar with Toasties, the layout is unchanged. The front counter is still so low you fear throwing your back out signing your cc receipt. That ghastly drinks cooler still eats up a third of the width of the restaurant. The salsa is the constancy of mouth wash and the burritos tastse like low grade building plaster. And did I mention the filth? Food to be served sitting on the floor, the pot of  refried beans were sitting underneath the dish cleaning sink, and the entire place is in a general state of disarray. Will a real restauranteur please come and take this place over and do it right?", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "excellence  the best burriots in west portal. they are very generous and not stingy like other places. u sspoill u and put a bunch of goods keep up the good work -  good luck to best success thank u", "author": "Abigail S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "WOOT for good burritos in West Portal!  Staff absolutely could not be friendlier.  Super nice folks, all of them.  Their carnitas is actually some of the better I've had, with a nice flavor and not greasy.  Not a tortilla steamer in the place -- they're grilled like they should be.  But gringos take WARNING: their picante sauce is NOT TO BE F#@KED WITH unless somebody you know calls you \"Carnalito\" and you've been to at least one quinceanera.  You know that habanero sauce you bought at Safeway that you tell your friends to \"go easy on?\"  That stuff's as spicy as a chocolate milkshake compared to what I'm calling their \"Salsa del Diablo Permanente Inferno en me Boca, O Dios Mio.\"  Great food here; my favorite lunch spot.  Pollo asado rocks every time.", "author": "Sid B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-10", "description": "Big burrito, free chips/salsa. Pretty standard.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-01", "description": "Seemed to have gone downhill fast.", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "I had one of the best taco salads here, very flavorful and the serving size wasn't overwhelming like a lot of other places. The price also very reasonable.", "author": "Tina X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "One of the best shrimp tacos I have ever had!  Everything made fresh to order.  Went back the next day and tried the beef taco and chicken taco which were also very tasty.  We are thinking about using them to cater our next big party.  Very reasonable pricing, nice people.  Will definitely be back for more sampling!", "author": "Robert D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "Wow! I have to say how surprised I am by all many negative reviews. For our 1st time here is was super delicious and great customer service. Hopefully the reviews will improve here on out, as they just opened Jan. 14 of this year.  There is always a learning curve when a new business opens and usually I wait about 6mos so businesses can iron out any problems that arise. However, I was craving a burrito and since I am not a fan at all of El Burrito Express on Taraval, I  was happy to give this place a try. I had the Shrimp Super Burrito and my husband had the Steak Burrito. OMG... really really good. I have eaten all over SF & the Peninsula and both my husband & I agreed that we thought it was super tasty. Was it the very best, not quite, but it was pretty damn good and we will certainly be back. I gave a -1 star due to not keeping their tables outside cleared.  Customer came in and had to bus someone elses dirty dishes to sit outside with her family...YUK! Our burrito was to go, and it was prepared with 10min.  Stop by and check out their menu, I think they have a good thing going and its just a matter of time till they get some of the new kinks worked out.", "author": "J G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-20", "description": "nothing memorable, except the weird service, broken chips, lack of salsa and big tasteless burrito.  like most food on that strip, mediocre at best.  good luck.", "author": "King E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-24", "description": "I really want this place to succeed. Mexican food is my comfort food, on par with meaty lasagna. I hope they are listening and taking notes. The flavor really wasn't on the food. I have had a number of items including a wet burrito, super burrito, enchiladas, tacos, and nachos. There seems to be a lack of salt and/or flavoring. The carnitas super burrito was pretty good though, mostly because of the natural saltiness I suspect. I do not like their chips though, they seem store bought and really thin and light. The red sauce for the mojado/wet burrito was not very flavorful. The nachos did not have enough cheese. The tacos fell apart in 5 minutes due to being too soft and mushy. The enchiladas were better, but still lacked the flavor bang. They do not need to give two different salsas per order, that just wastes money, I think. Not sure if there is room for a salsa bar, but ask the customer if they want one or the other, or both. One star each for good prices and friendly service.", "author": "Wilfred B."}
