{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "I come here every Sat before work for chocolate croissant, breakfast biscuit sandwich, quiche, or galette. With a homemade chai! My boyfriend loves the ham and cheese croissant, so flaky + HUGE. This place is our go to!\n\nThere could be a line if you come later than 830-9ish. If you order a chai it'll take extra time to warm it up.", "author": "Taylor W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-19", "description": "I was walking by this place when the sign outside said that \"one does not simply walk past Butter Love Bakeshop.\" Okay, fine. I had to go in. I'm weak. \n\nI ordered a breakfast sandwich that had bacon, egg, and Gouda between two buttery biscuits, and ordered a treat for to go. More on the treat later.!\n\nThe sweet woman working behind the counter warmed up my sandwich and when she brought it to me, she told me she can warm it up more if I'd like. I had to ask for it to be warmed more. Not her fault. Just the way the biscuit crumbles. Am I right? Anyway...the sandwich was good! She warmed it up for probably 4 minutes total but the egg and cheese was still a little cold. I blame Karl (the fog). Looking past this minor dilemma, the breakfast sandwich was good! I say 4/5. \n\nSo this treat was a beer custard filled donut. What?! I'm crazy like that and had to try it. Even though it the beer was cooked down, I waited until work was over to eat it. I...was not into it. It was a strong beer taste, which should have been cool, but it did not work for me. I would much rather have a beer and a donut together by not as one. Also, I found the pastry part too bready instead of light and fluffy donut, which totally bummed me out. 1/5 for this. Heartbroken, really.\n\nI am willing to give another one of their sweet treats a try, but I need some time o get over this donut situation.", "author": "Jess G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "We discovered Butter Love one day when we were in the area testing another bakery when butter love's scent drew us in.  I love their cowboy cookies with coconut, nuts, chocolate and cinnamon.  The real crowd pleases are the pies!  I love that the pie pan is environmental and they collect a $2 deposit on the pan so after buying a whole pie you take the pan back so they can reuse it.  Their crust is amazing - the recipe is actually published in The NY Times (for their butter pie).  We had an apple pie for a birthday party and it was unreal.  Since discovering it 3 months ago, we have gone 4 times and will continue to support them! \n\nThere is also a cute back patio to enjoy your treats at!\n\nThe weekend mini chicken pot pies happened to come out of the oven while we were in there so we indulged - and it was #worthit. They are $8 but a nice treat. And again, the crust is so flakey!", "author": "Alexandra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Gosh 2 years went by from my last review. .  They now have small chicken pies for $8 each only on fri, sat, and sun.  $28 for a big one.  Big yum.  Crust is outstanding in itself.  I had to buy another one to share.  They have seating out back.  I love Butter love.  May you stay un the neighborhood forever.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-28", "description": "2.5 STARS\n\nI was in the area having lunch and decided to check out Butter Love Bakeshop afterwards. My friend and I arrived on Saturday, January 20th around 12:15pm.\n\nI ended up getting a few donuts: Lemon curd, Sugar, Glazed and a Banana fritter. I grabbed them for takeout, so I had the lemon curd doughnut when I got home. I liked the flavor of the curd, but I found the donut to be way too bready. And it wasn't sweet enough. I think it would have benefited from a sugar coating to give it that sweetness. I felt the same way about the banana fritter. Good flavor in the center with the fresh banana, but still too bready. The sugar and glazed were more of the same.\n\nI feel bad giving this spot such a low rating as I love my neighborhood spots. But their donuts just weren't up my alley. I like mine light and fluffy and these were dense and bready. One of my friends raves about their pies. Especially the buttery crust. Perhaps I just ordered the wrong items? If I find myself back in the area, I may come back to try those pies. My friend does make them sound tasty.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-28", "description": "The young lady helping was sneezing on her arm \nI did not see her wash her hands etc afterwards \nCould barely hear her when I asked about the different types of items out for display", "author": "Gene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "This lovely shop is located in the Outer Richmond neighborhood. It is a smaller shop, but there are a few tables to relax, do some work, or chat with a friend. There is also some backyard patio seating on a nice day. Apparently all the pastries are made in house. They all looked delicious. I was craving a chocolate chip cookie, and was pretty satisfied. I am pretty particular about my chocolate chip cookies, and can say this is the best one I've had in the city of SF. Overall a cute bakeshop and would def come back just for their cookie! :)", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "I'd first heard about this place during a breakfast meeting. We have this routine that as an ice-breaker, we talk about our favorite eatery or most recent discovery: Butter Love Bakeshop was one of my colleague's favorite bakeries during our most recent August meeting. Fast forward one month: I've been to this place three times now and that even though it's not at all near where I live nor work! It's that good. \n\nMy favorites so far have been the fritters; one time they had a strawberry banana fritter and that was just so yummy. The other time I tried their savory scone, which was zucchini and feta...also amazing and spicy!\n\nIt's a tiny place and I have a feeling the people who run it are a bit overwhelmed. Just this morning, I arrived at 7:20am (they open at 7:30) and shortly after me a horde of about 30 cyslicts arrived: colorful spandex galore! Luckily I was first in line!", "author": "Uli B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Great local bakery. The sweets are great, but the Chicken Pot Pie was extra impressive. One of the best crusts I've had.", "author": "William W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "Jamie W. and I stumbled upon this charming little bakery because there just happen to be an open parking space when we arrived in this little neighborhood. We had no itinerary for our Outer Richmond field trip but a sweet nosh sounded good, so we lived in the moment, or more like a \"moment on the lips, a lifetime on the hips\" moment. Gee, I didn't know that owner Esa Yonn-Brown was the pie half of the late, not all that lamented Pig & Pie in the Mission. I mostly gorged on the pig side of menu but had a slice of her Butter Pie once and it was indeed buttery and quite delicious.\n\nPaula Deen was wrong about so many things but not about the butter. Once we entered the space, we saw several content-looking consumers amid the many delectables spread out in a tidy fashion on the counter (photo: http://bit.ly/2nDipDG). The sweet and savory galettes looked good, so did the seasonable fruit buckle and of course, the large scones which I understand were a legacy leftover from the previous occupant, another bakeshop called Nibs. We settled on a couple of the $3 Cowboy Cookies which looked fresh, thick, and most inviting (photo: http://bit.ly/2mePrwZ).\n\nWe only found out about them when we were up in the woods of Cazadero at Raymond's Bakery and tried a most luxuriant one (photo: bit.ly/1PL5pVx). This one was also really good with a hodgepodge of classic cookie ingredients - chocolate chips, coconut, pecans, rolled oats and presumably a whole lot of butter to keep it all together. It was like the greatest hits of homemade cookies packaged into one. With picnic benches and lots of well tended foliage, the casual back patio was an idyllic setting to nosh on our cookies and plot out our day (photo: http://bit.ly/2nlrfJ1). I can see why regulars come here in a constant stream.\n\nCOOKIES - 4 stars...the classic cowboy cookie, well turned\nAMBIANCE - 4 stars...quaint inside, bucolic outside, very \"neighborhoody\"\nSERVICE - 3.5 stars...nice\nTOTAL - 4 stars...a small business serving quality baked goods is always worth supporting", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "GUYS, JUST PRE-ORDER A WHOLE PIE AND COME PICK IT UP. I see a lot of negative reviews and it honestly hurts that people don't know about what makes butterlove bakeshop amazing.\n\nI had chicken pot pie from butterlove bakeshop more than 6 years ago when the owner only delivered and operated out of her home. You had to place at least 24 hours in advance or depending on how busy she got. \n\nI'm so happy there's a storefront now because her site was not operating a while back and I thought I had to say goodbye to the chicken pot pie forever. But no! I can still have that delicious amazing chicken pot pie. \n\nHer recipe is her mother's and it's so absolutely delicious. She's also a sf native. Support natives!! There's too few of us actually left in the city. \n\nGet the pies. I can't speak for anything else but get the pies!!", "author": "Becca W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-07", "description": "I've been to better bakeries.  I had a donut here, and it wasn't the soft and fluffy kind.  A bit hard actually.  The breakfast sandwich was decent tasting but I wouldn't get it again, although the biscuit was nice and flaky.\n\nI might come back again though.  It's more welcoming than Marla a few blocks away.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-17", "description": "It's nice to have a neighborhood bakery. I want to give more stars but there needs to be more consistency. Been going since it opened. Glad they have revolving local artists' works on display/sale.\n\nChicken pot pie is delicious.\nCookies are pretty good.\nNutella donut is da bomb but as noted by others, the dough is just not fluffy enough (too thick). Also there's too much dough versus filling.\nCroissant is inconsistent: sometimes not fully baked through inside. Many times, there's barely any ham or cheese. When it's done right, it can be yummy. I like to add my own fillings in them at home sometimes. (Arsicault really has my fav croissants, hard to beat such a high standard)\nScones are a nice size. I love the variety.\nGalettes are good.\nQuiches are so-so.\nI've had good cakes as well as dry ones.\nPies are quite good so far!\nChai is delicious when made correctly plus needs to be perfectly hot. Owner makes it just right. New employee needs more practice.\nService is good. It's comfortable. They're welcoming, you can just sit, relax, enjoy. They never rush you out.", "author": "s t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Great quality baked goods, also with sandwiches. Accepts credit cards. Nice seating area", "author": "Olivia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "I'm a regular here and I just wanted to leave a review with some constructive criticism (and compliments). The chicken pot pies are amazing, however I feel like a lot of the time they're inconsistent. Sometimes it's dry inside with not enough gravy and waaaay too much chicken. Most of the time it's under seasoned. There are a amazing flavors going on, but they're not being elevated enough because of the lack of salt. It just needs a pinch or so more. Other than that, I'd recommend anything they make here, except for the donuts. They have a strange texture that is kind of a let down, considering how interesting their donut flavors are. Nonetheless I LOVE HAVING YOU GUYS IN THE NEIGHBORHOOD. Yummy stuff.\n\nP.s. Maybe get some simple syrup for iced coffee and tea?", "author": "Shana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "This is a bakery worth visiting.  Free wifi. Delicious savory and sweet baked goods. Friendly service. Good regular coffee. Affordable prices - what? Everything a simple neighborhood bakery should be and a little bit more!", "author": "Virginia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "We just tried their lemon meringue cake. It was heavenly. It tastes just like a pie but it's a cake!  The bottom of the cake is crunchy too. Someone in our party had the chocolate graham cracker cupcake. There is a really strong coffee flavor to the cupcake. It was delicious. The chocolate cake was also good!", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "What is love?\nAnswer: Butter Love Bakeshop\n\nWhen Butter Love first opened, I stepped in purely because of its name. Before I could taste anything, the smells and sights told me that I wouldn't be disappointed. Sure enough the goodies lived up to the expectations one would have of butter AND love!   \n\nMy favorites are the savory gallettes which are easy to eat while driving. I live in the Sunset but occasionally drop off my son at Wash High, which is the perfect excuse to grab breakfast at BL. From pies to quiches, to choc chip cookies and ham/cheese croissants, BL never disappoints.\n\nInitially, I was annoyed at the limited coffee selection since there is only one kind and one size coffee. What you do get is a cup of flavorful, medium roasted joe. In time I came to realize that the coffee actually showcases the baked goods. I really don't need another Starbuck experience, and BL does it right by offering one simple, quality cup of coffee. Another issue I initially had was spending what seemed too much at a bakery. I don't think I've ever walked out having spent less than twenty-something dollars. Then I looked at what I actually purchase on any given visit. In fairness, it can be two gallettes, coffee, hot chocolate, a slice of cake, a ham & cheese croissant, and maybe a cookie---of coarse I'm going to spend money! It is all well worth it.\n\nSo even if I try to find something to complain about (and believe me, I always find it), Butter Love can do no wrong!\n\nYet, I wouldn't be myself without at least one complaint:  some Mondays, I forget it's the day they close and I head over. At the locked door I realize my mistake and my heart breaks. No Butter Love for me that day.", "author": "Angie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-15", "description": "Having just moved out to the Outer Richmond, I've been on the hunt for my new study spot!\n\nButter Love's interior is pretty cute, but not painstakingly cookie cutter hipster! It has a lot of Outer Richmond charm by keeping it simple, charming, and kindaaa rustic? There's a back patio, but it looks like it needs a little TLC.\n\nThe coffee is straight forward and simple, and iced coffee isn't more expensive than regular coffee! I'll try a latte in the future, and it would also be cool to see the coffee get more fancy but still simple (??) in the future! But this is a BAKERY not a coffee shop...\n\n..the pastries. Goddamn. I'm so happy that they have a ton of savory options! I believe the selection depends on the day, but there was a quiche, savory bread pudding, sandwiches, pot pies, and some other savory thing I never heard of. The sweets look great too! I tried the bread pudding made out of their ham and cheese croissants. It was SO tasty. Not overpowered or salty by the ham, still maintaining the integrity of the croissant, but with added moisture from.. IDK how bread pudding is made! But I'm definitely coming back to try more - my only problem is having to pace myself so I don't gain weight!!\n\nThe owner and cashier were very nice and answered all my questions. They seemed a little nervous for whatever reason, but I promise y'all are doing great! The prices are not cheap, but they're not crazy expensive either! It really depends on what you get, but I believe they range from $2.50-6? I hope that this place does well, but somehow stays under the radar still! With how delicious the pastries are, I can see it getting busy and selling out!\n\nSome suggestions: music was a little loud when I came, so the other customers were kinda shouting at one another to talk, which made it hard to study lol. There's room for improvement in terms of the coffee and pastry menu. If I didn't come in wanting coffee, I'm not sure I would have seen the menu! Maybe put it at the register? I understand that the pastries change daily, but it seemed like there were things that weren't marked and the cashier had to think and question herself when I asked her about items and prices.", "author": "Jacquelyn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "Little mom and pop place with zero pretension. You can sit and chat a while. Nice people. My apple cup was tasty, like grandmother's house!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Ordered some of the hand held pies and cookies.  The people at the bakery were so nice and accommodating.  They accommodated a rather last minute order for a party we were having.  They were perfect, and so delicious, tasted and looked home made.  Everyone asked if I had made them! They were a huge hit and every last morsel was gone.  You can be sure we will be back for more.  Thank you Butter Love Bakeshop!   So glad we found you!", "author": "Linda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "Exceptionally good local bakeshop with plenty of Americana stuff. Best ricotta cake in a 10 mile radius. Everything house made, plenty of coffee, excellent price point, most decadent chocolate cookie. \n\nA terribly underrated spot for this little neighborhood shops, perhaps it's because it did not have a full breakfast menu. There are five coffee shops next to one another, and that are more tables in other places.\n\nThe back patio requires immediate attendance for it to become more physically appealing. The baked goods, require absolutely none. It's as good as it gets. Skip Marla, come here instead. Your sweet tooth will thank you.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "We stumbled across Butter Love after lunching down the street, I'm glad we did. The raspberry pie/crumble was delicious, as was the gingerbread. The staff were very friendly and the food very well priced.", "author": "Rory E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Just found this place today.  It's one block past the Balboa Theatre, and I'm very sorry I didn't notice it sooner!!!\n\nWe bought 4 types of baked goods - \n\nThe mixed berry gallette was utter perfection.  How did they do the crust so perfectly?  Nicely tart flavor.  My European husband was thrilled with this one, because American baked goods are often too sweet for him.\n\nThe chocolate cherry scone was soft, not too sweet, and the tart dried cherries were a perfect compliment.  We all agreed we would have liked a few more cherries, though - a little cherry per bite would be ideal.\n\nThe parmesan and rosemary scone was perfectly balanced.\n\nThe savory ham bread pudding was great - the texture was divine.  We just thought it needed a bit more bite to it - just a slightly sharper flavor would have added to it  maybe scallions or onion or sharp cheddar...\n\nThe customer service was great:  friendly and quick.  The place also looked very clean, too.\n\nI was also happy to see a 9-person-long line; it's great when local businesses are thriving.  Nice bench out front, too.  \n\nSUGGESTION - make it easier to know what's on offer with little flags or an easy-to-read menu board (you can't see it before you get to the register).  I hated holding up the line to ask questions, so I probably would've bought more had I known what else was there. \n\nGood luck Butter Love - our family is really glad you're here!", "author": "Cassie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "This is our favorite bakery in this neighborhood, my son loves the chocolate chip cookies ( big chunks of chocolate and the right amount of sweetness).\nMy husband's favorite, fruit buckle. \nAnd me? Croissants!!!", "author": "Nadia J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "This is a small local bakery, makes delicious baked goods right out of the oven.  Customer Service is good.  A bit pricey though.", "author": "S F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Such a cute neighborhood bake shop with amazing food. No espresso, but drip coffee and amazing baked goods. Make sure to check out their back garden... Perfect for reading a book and enjoying your coffee/ food. A favorite local spot in the Richmond!", "author": "Kayla G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-29", "description": "Butter Love Bakeshop is a nice, pleasant, new bake shop in the Richmond district. Prior to this shop opening, I had never heard of Butter Love Bakeshop or tried any of their baked goods (as some of the other reviewers had). I only saw this opening on Yelp and decided to check it out. The actual shop was pretty hard to find since there is no awning or large bold sign. You can easily drive by and miss it (which I did). When I walked in, the shop was empty with bare yellow walls, wooden tables, and light blue chairs. It resembled a homey cottage, except it almost looked like they hadn't finish decorating. There was an elegant display of their baked goods on the front counter, which was mostly out in the open. \n\nI tried the chocolate chip cookie ($2.50), which was large, sweet, and delicious. I also had their apple cheddar scone ($3), which was good, but a tad on the bland side. I probably would have chosen another flavor, but that was the only savory flavor they had available. They also offer a variety of pies and baked good including chicken pot pie, filled donuts, plain and savory croissants, breakfast sandwiches, and many more. They also serve Mr. Espresso coffee, which is a local, Bay Area coffee roaster. Majority of their baked goods were room temperature, but they can heat it up for you upon request. \n\nButter Love Bakeshop is definitely a nice addition to the local neighborhood. It's family owned and operated and the products are offered with much butter and love. There is also additional seating outside on their back patio. If you are in the neighborhood and looking for some baked goods with coffee, this would be a great local shop to check out.", "author": "Jean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Put this place on your list of True To Their Name. Suggest you start right with the plain croissant. From there, it's sweet or savory. Don't miss the fruit fritters, change daily.", "author": "Harold H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Three years ago, I had a foodgasm...\n\nIn public. \n\nMultiple times. \n\nIt was love at first bite: http://bit.ly/1PPerjG.\n\nI don't even like sweets but I fell head over heels over Butter Love Bakeshop's pies. They're incredibly delicious with an sinfully buttery crust. \n\nDon't believe me?\n\nAt the time, their pies were only available at selected shops in San Francisco or by delivery. \n\nI'm all about spreading that butter love, so I use to send Butter Love's Chicken Pot Pies and Shepard's Pies to an old (ex) boyfriend's work (old review: http://bit.ly/1PVLR2a).\n\nOne pie can feed 8-10 people--they're huge and bursting with filling.\n\nEach time, he demolished the pie by himself...in two sittings. \n\nYup, he ate for a family of four. That is HOW good Butter Love's pies were.\n\nThen, he blamed me for not being able to see his wee wee anymore when he goes pee pee.\n\nOops.\n\nAll that butter love is now available at their brick and mortar in Outer Richmond! \n\nButter Love Bakeshop softly opened this week so there's only about 10 savory and sweet items ($2-$4) like croissants, galettes, small pie cuppies, scones, and cookies. There's no whole pies yet but if you order online, Esa, the owner will have it ready in her store for pick up. Cc's accepted.\n\nNow, go spread that muffin top, I mean butter love...", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-19", "description": "We saw this bakery across from Gus' Bait and Tackle. We got the donuts. Not good. There were other items that I am sure are good. We had a few items and loved none.  Ask what is popular and get that.", "author": "Nettie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "Finally got to try this place...and they were open. I usually end up around here when this place is closed (at night.) \n\nFood = good. Very homemade. Lots of butter love.\n\nEgg salad sandwich = delicious. Egg salad with fresh dill on their house made white bread. $7.00\n\nFruit galette = apple.  Perfect pastry ergo crispy, flaky and just enough stickiness. Oh and buttery. Apple filling was delicious, too. $5.00.\n\nDrip coffee = $2.50.\n\nSeating = a few 2-tops in the front. But there's patio seating in the back, too! \n\nService = friendly.\n\nPrices = reasonable to moderate. Lunch for one with leftovers came out to $14.50.  Yes, they accept plastic, too.\n\nI may or may not have returned a couple of hours later for another apple galette...because I didn't want to share the first one. ;-)", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Butter Love Bakeshop makes me feel so happy! I love freshly baked goods and this place has them. \n\nI adore the rustic decoration. Everything is really lovely. \n\nSince they try to sell fresh pastries, the selection is small by the end of the day. Also, they always have different things every time I come by. I like the surprise aspect, but for those who have an specific pastry in mind that they want to buy, beware: you might be setting yourself up to some disappointment. \n\nSo, just come here to try one of their lovely baked goods. Everything tastes wonderful, so it is gonna be a great experience no matter what you buy. \n\nI have also ordered a whole pie with them and it was delicious. Next on my list is ordering one of their breads.", "author": "Andréia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Best pies in San Francisco and they don't charge $40 like other pies shops for an entire pie. \nThe pies have a ton of fruit filling and taste delicious.", "author": "Angela K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Came in on a Sunday, not too busy. Filled with some scrumptious baked goods. Sweet and savory. Prices are moderate.", "author": "Cherry Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "This is the best bakery in the city! I can't believe I randomly stumbled across this place in my neighborhood but I'm so glad I did. Everything they bake is entirely from scratch and seasonal. This means the menu changes everyday and the talented who work here get to experiment with the freshest ingredients possible. I like to stock up on pastries for the week because there isn't a single thing they make that I haven't loved. My favorite is the biscuit breakfast sandwich. Ladies, if you read these I hope you know how incredible your little shop is. I love nothing more than to start my morning out on the back patio with a coffee and a cuppie.", "author": "Julie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-08", "description": "Welcome to Roundup (tm) Love, the bakery where the owner's bottom line is more important than using organic flour. When asked about it, she said \"I cant afford to use [it]\". Hmm... I guess all those bakeries that use organic flour are doing so because they want to go out of business. Like Marla's, one block away. They seem to be going out of business because they use organic, local ingredients.", "author": "Grizzle J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-11", "description": "Smells so good passing by here with all that buttered pastries!! Intoxicating!! \n\nStop by a number of times to get coffee, and yes, cost more than Starbucks or peets !! ‍ a few times I bought pastries, too, as I was either Too early or too hungry before/after my appointment nearby. Limited hours and I must say I was horrified and shocked when I looked at my receipt after buying a few pastries. I bought a \"chicken pot pie\" which was mostly all crust and 2pieces of smallish meat really ...thought it'd be 4$ at most considering there was hardly any filling but realized i paid 8$!  that's a full meal ... had I known the price could hv gone to a number of nearby eateries for a proper meal...on occasion I still go in for coffee simply bc my appointments nearby but I think I'll pass on everything else.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "So yummy! Had one of the last had and cheese croissants of the morning with a regular coffee. Walk to the back and enjoy your pastry under some sunshine or the big tree on their back patio.", "author": "Sara B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-21", "description": "*** In Short ***\n\nNext time, I'm trying the pies instead.\n\n*** In Depth ***\n\nAfter taking my mom to brunch at Cassava, and in search of some sweets for the week, we end up venturing into the nearby Butter Love afterwards, picking up a number of classic baked goods, including:\n\n* Raised Sugar & Cinnamon Doughnut - Raised though they were, I found their doughnuts to be a bit harder and less fluffy than I typically like. Though, to be fair, my gold standard is the fresh-out-of-the-fryer doughnuts from Kingpin in Berkeley, and that's hard to beat.\n\n* Brown Butter Snickerdoodle Cookie - I'm not really a huge fan of snickerdoodle in general, so I may be biased here, but at the recommendation of the staff, and hearing that this wasn't a flavor they usually do, I picked up one. And, while nice and soft, I found the overall flavor to be a bit lacking and bland.\n\n* Chocolate Chip Cookie - Like the snickerdoodle cookie, this too, was fantastically soft when it was fresh. And, while not too sweet, as chocolate chip cookies tend to be, it had the opposite problem of being a little too bitter for my liking.\n\n* Mango Brown Butter Scone - By far my favorite pastry of the batch, with that nice crispy crust, strong mango flavor, and just a hint of sweetness to top it all off. While not as good as the ones at Arizmendi, it's definitely something I'd stop in for again.\n\nNow, we had also been eyeing all the various pies, both sweet and savory, that they had on display there, ultimately not picking up any of them. Apparently this was a mistake, according to other reviewers, so I'll reserve further judgment until next time.\n\n***Accessibility Info***\n\nVenue - While not exactly small, the part of the bakery that's open to the public is only about the front third of the shop. Seating is a bit limited, so I'd suggest stopping in, picking up your goodies, and leaving. Both the counter display and the register are around your typical dining table height, so neither visibility nor getting and paying for your pastries should be an issue.\n\nBathroom - Didn't try them.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "So glad this bakery is in the neighborhood.  It smells delicious whenever I walk by.  My favorites are the buckles, savory galettes, and chocolate chip cookies.", "author": "T T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-10", "description": "my boyfriend and i ordered a chicken pot pie, banana cuppie, strawberry lemon shaker pie, blueberry pound cake and monkey bread. overall, the items were bland, tasteless, dry and seemed over cooked. the cuppie was especially dry and hard. i don't think i'll go back.", "author": "Fina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "After lunch I always a have a tendency to crave sweets. Always. It's an inevitable habit that has me searching for new bakeries to try. I've tried Marla's and yes they're good, but Butter Love Bakeshop is definitely going to give Marla's some competition. Located in Richmond district it Butter Love Bakeshop blends in with its surrounding with its minimalist exterior. \n\nThe inside of BLB is awkwardly spacious, as if they forgot to add furniture or decor. Maybe it's the new hipster way of decorating, who knows. At the front counter, their baked goods are on display; I could almost count the number of pastries on display with my fingers. There was such a low supply which made me wonder if they make fresh batches once the ones in display sell out. Not sure. As far as their inventory  they had: croissants, donuts, chocolate chip cookies, blueberry cake and some cheese Danishes. \n\nAs soon as I saw the blueberry cake, I went in for it. Their slices are pretty big, which makes up for the $4.50 price. The pastry itself satisfied my sweet tooth; it was spongy but not overly moist which is always one of my pet peeves when eating pastries. I was pleased with my blueberry cake slice choice. I also tried my coworkers chocolate chip cookie and it was fine. I like that it had coconut flakes (I'm obsessed with coconut anything). \n\nI'd say this a good place to pick up goodies during a sweet tooth craving. Def not a place where I'd go to sit and have coffee with a friend. The interior needs to be more welcoming and cozier for me to want to hang out here, but hey the baked goods are yummy!", "author": "Stefany Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "A awesome coworker shared a box of pastries from BLB and I picked what I thought was a crumble top muffin. It is actually a mini pie made in a muffin tin! One of the best things I have devoured! Ever. This bakery is no where near where I live or work but I'm going to figure out how I can get a regular fix of this happiness.", "author": "Kat A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Cozy cute bakeshop in the neighborhood, amazing desserts, best pumpkin pie I've ever had!! They even have chicken pot pie on the weekends!", "author": "Vivienne M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-25", "description": "Butter Love Bakeshop didn't have much pastries showing or it's been sold already. most pastries priced and labeled, although labels/prices may be placed on the wrong item.\n\nolder female and female child cashier. seating just a few tables. wasn't paying attention so there could have been more. looked for menu, didn't see any. fruit gallete looked interesting, grapes deterred me.\n\neats: ham and cheese croissant (?)\n-flakey, buttery, nice flavors/texture\n\nbrew: mr. expresso(?)\n-semi-harsh tasting, not mr.'s finest.\n-better coffee available at fog cafe down the street.\n\ntake outs:\n-total 6.5 for 2 items.\n-not much parking available, saw meter vehicle down the block.\n-fresh taking croissant.\n-not much display area...or didn't look in the right places.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "A good croissant is hard to find. Here in this hidden little gem, more than one good croissant found! \n\nLoved the chocolate croissant: super flakey and shatter-crispy texture infused with a mouth-watering buttery aroma. The insides of the croissant was also fuller and relatively chocolate-filled than some of the disappointing airy ones I've had. One of these yummy croissants + a fine cup of coffee = divine. \n\nThe ham and cheese croissant was intensely cheesy and buttery. Feather light interiors, not too doughy or greasy. Golden brown skin baked to perfection. This is a very filling croissant and I only managed to finish half on an empty stomach (but I also have a small appetite.) Great value for the price: two croissants for just $7.75. Will definitely return again and try everything else! I have something to look forward to now every morning :)", "author": "Vega N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Love this place! everybody who work there are so nice and they show great hospitality! \nAnd their pies are amazing!", "author": "Mao I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "Had the breakfast sanwhich which was very good. The were velvety and bacon not microwaved, a pleasant characteristic absent for the norm unfortunately. Also had the blackberry fritter which was also awesome. Nice fluffy donut texture. Wrapped around, get this..... actually blackberries. It was great to have the tartness of the blackberries  alongside the sweet dough. For $7.25 it was a great experience and great to support a small local business.", "author": "Jared D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "I can't even!!! These pies are amazing\nWe've gotten them for Thanksgiving and Christmas and everyone has raved\nBest pie in the City!!!  And I haven't had a chocolate scone that good since Paris! So super happy they are in my hood", "author": "N M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Best breakfast biscuit anywhere. Flaky biscuit wrapped around egg, bacon and cheese combo that is hard to beat. Donuts are light with just enough sweetness. Get here early before they run out.", "author": "Judy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "My guess is the descriptive terms \"cute\" and \"adorable\" and the like have been slapped on this place, and to a certain extent these words do apply to Butter Love. However, Butter Love is up to something more important. They make DELICIOUS baked goods, and they let you enjoy them in a place that bespeaks peace. So go to Butter Love, order a tea and a glazed sprinkled donut whose consistency and flavor are perfect, and watch the afternoon drift by.", "author": "Nick D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "I love this shop!  They have a wide selection of savory and sweet baked goods.  Quiche, donuts, scone, breakfast sandwiches, cuppas (cupcake sized pies), and pies galore.  Awesome hidden gem.", "author": "Chelsea D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "This is a wonderful bakery and cafe in the Outer Richmond that serves strong coffee to go along with their delicious savory and sweet treats. I occasionally stop in for a cup of coffee, a cookie or a savory scone and it's a generally quiet place to enjoy some time to myself. Most of the time, I'll get a pie and I have always been pleased - whether it's when the pie has been pre-ordered or just to get a slice to go. The pies are seasonal, so bear that in mind - this is not a place where you want sticky, sweet stuff in the pie -- these pies showcase the fruit and the crust is amazing. My personal favorite is their peach pie.  I have ordered pies from this shop for awhile, right around the time they first opened their doors and love their variety of pies - all made with love and talent. Try Butter Love if you haven't before - you won't be disappointed.", "author": "Grayson E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "My wife and I are visiting San Francisco and staying at an Air BnB in the Richmond area. We were exploring the neighborhood and stumbled upon this cute place. Its decorated like you are in a stick of butter. The food is soooo good and made fresh everyday. We've had the bacon egg n cheese biscuits 2 out of the 3 days we've been here thus far. We made the mistake yesterday of trying this other bakery called Marla, up the road where they charge $8.50 for a bagel and cream cheese. That was a waste of money and time. \n\nBack to this review. Customer service is great and everything they make here is fantastic. When I came back this morning, i was there when they opened the doors. They were just finishing making the biscuits i came to get and the service girl offered me a free cup of coffee while I waited. Wow that was nice. I got four different types of pastries for only $15. Now that was a good deal. Beats Marla's or Starbucks any day. I highly recommend.", "author": "Matthew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "YUM!!! Strawberry rhubarb pie heaven. Great place to grab a pastry and a coffee before heading to the great Cabrillo playground with my toddler. They have a little back patio too. The breakfast sandwich was super tasty too.", "author": "Haley J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "Before Butter Love Bakeshop, there was another bakery.  A bakery that made the best ham and cheese croissant until I discovered human hair in my pastry.  And then there was Butter Love!   I had the ham and cheese croissant minus the hair and it brought back the joy and satisfaction i have for this simple but delicious pastry.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "A cute little bakery in the Outer Richmond with the most delicious everything. I kid you not, I have loved everything that I have tried there. Mmmmmm the Cowboy cookies! If this place makes me fat, it will be worth it!", "author": "C L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "Driving past this spot until I had a chance to pop in for a coffee. What a great vibe - bright setting with delicious lemon pound cake and drip coffee. Their back patio is adorable & they're planning to renovate for even more of a kitschy setting. I'll be back!", "author": "Sierra H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "Another pretentious San Francisco fail.\n\nReally wanted to like this place. I love supporting local businesses, especially ones that put their roots in neighborhoods with less activity. But I left this bakery with a very bad taste in my mouth (figuratively speaking, because they clearly didn't want to sell me a pastry).\n\nIt was not busy when I arrived at 8 am, and since I'd never been, I asked the man behind the counter what some of the items were. WOW, you think I'd ask him to remove a wart from my foot. NO smile, ZERO friendliness, and acted like that was the last place in the world he wanted to be. He has to ask the baker a question at one point so she came out to the counter, and she was the same way - totally apathetic as though they were doing me a huge favor by identifying a few items to a new customer.\n\nThat's exactly what I don't want when I'm overpaying for a couple of pastries - a side of scowl. \n\nMaybe this place should rethink its attitude toward customers if they want to survive in the Outer Richmond, a close knit neighborhood where a smile goes a long way.\n\nWhat a disappointment. This marks the second pretentious fail of a bakery on Balboa St (I'm talking about the notoriously overpriced Marla Bakery, which does not mix with the Outer Richmond vibe AT ALL).", "author": "June L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "I have been here several times and each time, I swear I'm only going to go home with one thing, but it never happens. Once I see what they have that day, I can never decide on one thing. \n\nThey have a nice balance of sweet and savory items and their selection changes from day to day. My favorite so far has been their Nutella donut. \n\nYou can taste the love they put into every item!", "author": "Janet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "When Butter Love's sign first went up, I cringed and expected it to be another hipster place, like Cassava and Marla's Bakery.  However, friends often returned with glowing reviews about Butter Love.  Curiosity piqued, I finally made my first visit a month ago and have to admit, THIS is finally a new small business I would love to support!\n\nMellow ambiance, awesome service, and freshly made savory AND sweet offerings, which vary daily.  Some of my favorites: spinach/feta scone, chocolate chip cookie, biscottis.\n\nWe regularly stop by in the afternoons now. It has been a pleasure getting to know the owner and her kids, who frequently can be found doing their homework there.", "author": "M G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "I was wondering what's going to happen after Nibs, the former bakeshop in the same location. \nMay be the rent went up too high for Nibs, because the idiot Mayor we have.\n\nhttp://votealix.com/tag/ed-lee/\n\nNibs had such a good scorn and killer ham and cheese sandwich.\n\nI do hope the new bakeshop will stay for a while because I like what they are doing, simple but more spaces, tables and chairs, service was nice. \nBut to keep the business for a while, we must kick the dirty jiveass and jackass corrupted, corporation-oriented Mayor Ed Lee out of our City Hall. \nHe is neither good nor helping for SF small businesses, period.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "Saw that Butter Love was open yesterday on my way to Purusha Yoga Studio next door.  Decor is fresh, clean, and welcoming. Joshua and Isa had an array of scrumptious-looking baked goods on the counter.  I selected 2 spinach & parmesan scones, a savory beef & cheddar hand-held pie, and a PB&J donut.\n\n--scones: tasty, but admittedly, my heart still pines for Nibs' (the former bakery in this location) spectacular scones.  \n--beef & cheddar pie: Hot out of the oven, this was great.  The crust was a little crisp and not too doughy, and the beef/cheddar/pea filling was generous and well-flavored.  At $5, I considered this a pretty good deal; it's certainly a lot bigger than the empanadas sold at a certain well-known SF empanada shop.\n--PB&J donut: this was not consumed until about 6 hours later, shared with my husband and son.  The donut has an appealingly complex, yeasty flavor that I much prefer to the standard donut shop.  The dough is also a bit denser/heavier than typical donut shop donut. The PB&J was piped in through the top--standard PB&J.  I like this and would try other flavors.  It probably would be even better if eaten fresh at time of purchase.\n\nFor anyone who is curious about what happened to Nibs:  The owners told me that it wasn't the rent of the business space, but rather, the rent of the house they were renting.  Single homes are not rent control-protected, and their owner jacked up the rent something like triple what they were paying.  Since they have dogs, finding something equivalent they could afford seemed impossible.  They told me they were moving to Placerville.  Big loss for our city and our neighborhood.  I'm happy that Butter Love Bakeshop is here, though.  It's a good alternative to those who find Marla's prices too high.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "With the deliciousness of their products, I can't believe it took them this long to realize to open a bakery! Then again, they were perhaps waiting to perfect everything. Because everything I've tasted on 2 different visits have been just that: perfect, homey, comforting, scrumptious. I've had the chocolate chip cookie (oh my) softball sized croissant, savory moist scone, apple hand pie, coffee. Based on quality and size, you are getting a deal compared to other bakeries I've been to in the avenues in both Sunset and Richmond districts.\n\nAnother great thing about this bakery is it's timeless feel. Very welcoming and unpretentious, somewhat like you are in the suburbs stopping off during a roadtrip. AND NOW THEY HAVE OUTDOOR SEATING ON BACK PATIO FOR THOSE OF US WITH TODDLERS! Although, the owners were so welcoming we didn't feel like we were imposing with our wee one.\n\nNext week I'm going back for the crazy big looking blueberry cruller thingy. Me, hubby, and daughter give it 6 thumbs up!!", "author": "Dani F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Yay! Looks like they added pricing and signs for their pastries, so now it's even better. Also I love the homey feeling with all the locals chatting at the tables.", "author": "Vivian K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "This place has the best baked goods, I find myself buying the whole store as I can't make up my mind what to eat.  Not only is the pastry baked to perfection, coffee is really good too.  I bought 4 pastries combo of savory and sweet with coffee for $13.  Although I also like Marlas their prices keep me abay.  For the same amount of pastries I would have paid $30 at Marlas.   I'm a loyal customer to Butter!", "author": "Kelli M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "The hours weren't posted on yelp yet and I didn't really try to look for it either, so I decided to stop by before heading home because it's near by. Just my luck, they were already closed for awhile. However, the owner had her kids there and her son noticed us outside. Unlike most people, they were still welcoming and we were still able to get whatever was left. The prices are decent for a family owned business, which always makes me happy to support these types of shops. The kids were absolutely adorable as they were trying to help, which I have a big heart for kids because I was a babysitter. The pastries were pretty good in my opinion and I could see myself coming back. Their site is posted, so you could learn more about them and check them out!", "author": "Maggie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "I'm so glad that this bakery opened on Balboa! Coming here right when it opened made me a happy camper because viewing all of the delicious pastries made me want to buy all of it. Ordering the savory scone and the two types of croissants which were the ham and cheese plus the chocolate! They smelled amazing after getting  these for breakfast and was reasonable price, but I have to say the scone seemed to be a little small for me haha.  I would recommend for people to come and try!", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "The gentleman business owner overcharged me for a chicken pot pie. I paid $12 instead of $8. (This occurred last year.) I am certain he knew it. Also, for goodness sake, they need to work on their customer service.", "author": "Yelper .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "I love, love, love this place. The main ingredient is in the name \"BUTTER\". So rich and delicious. Had a banana fritter this morning and it was melt in your mouth slap you mama good. Just wish I had taken a picture to show you how good it looked. But alas I gobbled it down to fast. The owners Josh and Esa are the nicest couple to boot.", "author": "Rebecca N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "I special ordered 18 star-shaped plain sugar cookies for my daughter's class to decorate for her birthday. \n\nEsa delivered! She got the perfect size cookie cutter for 2-3 year olds, made a tasty cookie that wasn't super sweet (we added icing and sprinkles) and was so flexible with the timing as a stomach bug made us delay pick-up from Monday to Thursday. \n\nWhen we picked up the cookies I treated myself to a chocolate chip cookie and that was magnificent...super chocolatey and chewy.\n\nI highly recommend going to butter love because it is delicious and Esa is so easy to work with!", "author": "Kaitlin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "This is a little gem. A great place to grab some coffee and pie.  Their pies are AMAZING (buttery and rich) and I also had the chocolate cake which was also delish.", "author": "Toni N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "My first taste of Butter Love was at a friend's baby shower. De-frikkin-licious butter pies. I have no idea what comprises a butter pie (besides butter, that is) but I kinda want to bathe in it. \nMy second taste was Esa's Chicken Pot Pie. A friend dropped one off at my house by surprise one day. I ate it for dinner that night. It had big pieces of chicken and the gravy was just the right amount of seasoned.\n\nFlash forward to today - Everything is just as delicious as it was the first time. On my first visit to BLB, I was feeling a bit cinnamon-y. Esa set me up with an oatmeal cookie; totally hit the spot. Since then I've had little quiches (perfectly fluffy and eggy with just the right amount of filling to crust), PBJ donut (Like a Jelly donut, but w/ PB), a cheese scone of some kind (so perfect) and a nutella topped donut. OK, the nutella topped donut was for my 3yo daughter, but I am assuming she liked it a lot because more went in her mouth than on her face and she wouldn't let me have a bite.\n\nSo, go to Butter Love Bakeshop. Order one of everything.", "author": "Andrea L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-29", "description": "I love butter and I love pastries and donuts so I was super bummed that the goodies at this litte bakery so missed the spot.  I ordered a simple glazed doughnut and a crawler and they were so overly laced with icing that i couldnt even enjoy the inside of the doughnut.  I had to crape the frosting off in order to even taste what the doughnut should have tasted like. Having said that, after the scraping, it was pretty tasty.  \nBut net net, if I have a doughnut craving, I can't say I would treck all the way there for a doughnut I have to scrape to enjoy.", "author": "Noe V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "Yumminess galore!!! I have tried almost everything this bakery is putting out and everything has been delicious! (I need to step up my SoulCycle classes since finding this place!) \nMay be the best chocolate chip cookie in the city! The buckle muffins are heavenly-perfect crisp top, not overly sweet or dense-perfect! Croissants remind me of being back in Paris--and the pies seem to be their signature dish-reminds me of what grandma would make! Obviously everything is handmade with quality ingredients--now if they would just add an espresso machine so I could get a latte with all this deliciousness it would be perfect!", "author": "Kim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "Hands down, the best croissants I've ever had. A coworker of mine brought these in to share and try are the most buttery, doughy, and flaky croissants I've had. Ever. If you love croissants, you definitely need to give this place a try.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "Butter Love has successfully transitioned to a brick and mortar bakery in terms of food.  The chicken pie is still the best I have ever had.  Croissant was excellent, and the chocolate chip cookie I took home for later was wonderful. No crowds here (yet).   Nice to enjoy breakfast on a late Saturday morning without waiting in line.\n\nParking was a breeze right outside on the street, but be aware that the meters are grouped together in one spot.  This is not free parking even though it looks like it.\n\nSadly, the ambiance of this place doesn't match the quality of the baked goods or the price point.  The interior suffers from a bad paint job and hodge-podge furniture.  The back yard seating area has junk in it (Butter Love's) and the view is primarily of the wall of the deteriorating adjacent building.  They can't help the view, but they could fence off their garbage area (or at least pick up the cardboard boxes) and do some landscaping.  \n\nWe sat inside, and there was a constant, loud, horrible buzzing noise that nearly drove us out of the place.  I don't know how anyone can work with that noise.  I believe it was coming from the florescent lights.  A row of about a dozen tubes line the center of the ceiling, but only two of them were illuminated.  The burnt out ones probably cause the buzz.  This place is lucky to have several skylights in addition to the front window, and there was so much natural light that the electric lights were not needed.  I don't know why someone in charge here didn't turn them off.  The buzz was so bad it may keep me from returning, but I would still highly recommend the baked goods.\n\nIf the owner is reading this, please fix the lighting (which looks hideous in addition to being a noisy irritant) or at least train your staff to turn the lights off when they aren't needed.", "author": "Bay G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Our new favorite place.  Just moved back to the neighborhood after a 3 year absence.   so happy this place has opened.  The food is divine, sinful, delicious and addictive.   Bravo!", "author": "Justin Thomas A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-13", "description": "I bought a cherry pie from here because I read the reviews that they had good pie. It was expensive so I was hoping it was good. I was SO disappointed!!!!!!!!! Not only was the pie dry and jelly-like, we found over 20 cherry pits inside the pie while my kids husband and I were eating it. Not cool!! When I brought the pie pan back and told the bakers what had happened with the pits they shrugged it off and told me they had just begun using a new pitting tool and 'may have missed some'.  They said 'sorry about that' but no real suggestion was given about how they might prevent the pits from being inside their pie again.  I told them I would not wish a child to choke on one or crack a tooth should someone else buy one.  This week my husband went to the dentist and they informed him he had cracked his tooth when he bit down on one of those cherry pits and now he needs a crown!! REALLY not cool Butter Love!!!!!", "author": "Marina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "Amen to this place, Amen.\n\nI am so glad that Butter Love has come to the Richmond! Marla's great and all, but competition is always a good thing. And I'm doubly glad that they took over Nibs' (that place was goddamn awful).\n\nPros: friendly service, amazing baked goods.\nCons: Not really any, but the inside seating area could be a little cozier, to encourage in-cafe dining. but WHATEVER, because the food is bomb dot com.\n\nBest croissants I've ever had! Perfect combination of flakey and soft, and it was warm. The day my husband had his first Butter Love croissant, he said he thought about it the entire day. The savory scone thingamajigger was really yummy, too. I can't wait to order an entire pie! I love that they can make so many savory options.\n\nButter Love, so happy you guys have joined the hood! Stay forever pls, kthnxbai!", "author": "Nami S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "How cute is this bake shop! Delightful Balboa street find, located in the heart of the outer Richmond. Delicious and buttery egg, bacon and cheese biscuit - definitely lives up to the name! Kind service and cute tables!", "author": "Martie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "!!OMGPIES1!!!!! whew. Ok. I have tried almost every pastry in there, brought my friends and made them try them and EVERYTHING IS GREAT. And then I ordered a pie yesterday, an apple sounds plain enough, you think how is a plain old apple pie going to be amazing, but it's fall so there's not many other fruits around so I went for it......WHY OH WHY DIDN'T I GET A SECOND ONE SO I COULD EAT IT ALL BY MYSELF?!?!?!?!?!? Filling was simply flavorful apples, thinly sliced so they cooked perfectly and the crust!!!!!!! It was like a layered flaky croissant made into a pie crust. It was flaky and light and hearty at the same time.", "author": "Susanne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "Outstanding! I crave their homemade biscuits with cheese and bacon every week but need to make sure I get over there early before they're sold out. I always get a cowboy cookie for later and a galette for the husband.  Unfortunately for hubby, the poodle got to the galette first and really enjoyed it ;)  I'll have to make sure the goodies are not in the dog's reach next time! The scones are great as are all of the cookies. Highly recommend!", "author": "L H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-15", "description": "Wanted a little something sweet after a walk on the beach with my pup. Yelped this place and it was closing in 5 minutes but I made it in time. They had their chocolate chip cookies, which look amazing, in a big glass jar, but they also had some fresh on a cookie sheet. I asked for four cookies and requested the ones that hadn't yet gone in the jar because I wanted them more crisp (they soften in a closed container). My request for something sweet was met with a sour response of \"No these in the jar are left from yesterday and we need to sell them first.\" I politely asked again but more pointedly, and explained my reason, and she refused.  So, brilliant baker people, not only didn't you sell the old a$$ cookies baked yesterday (seriously? I thought bakeries sold day old stale items at a discount anyway!!), but you didn't sell any cookies at all. Not to mention. I will never come to your lame bakery again. Clearly customer service is not a priority at this weak establishment.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "Hidden gem of a place, it's conveniently located on the same block as Bank of America.  Cute shop to enjoy a bite, esp. on a rainy day.  Bought an apple galette & a buckle (you read that right): the galette pie crust was made by the owner's 10-year old daughter, and it's pretty good...flaky & buttery.   Buckle is interesting: a little denser than the galette, but the milk chocolate chips with kumquat peels inside give this pastry a nice balance of sweet and citrus tartness.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "If you are a sweet-tooth, please try Butter Love Bakery - just opened in my neighborhood 3 months ago. My family and friends, are big fans of her fresh baked croissants. It's burst witth crispy layers but soft inside and you can feel the taste of salt REAL butter.\nThe sweet lady owner, also the baker, discounted 50c to me this morning  YEAH finally we have a good bakery near home h ,", "author": "Bo B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-21", "description": "Just finished eating at Pizzetta 211 (3 1/2 stars) and was in search of a good dessert place. With a name like Butter and the reviews, I expected more. \n\n1. Chocolate chip cookie - eehhhh, nothing to write home about. Anthony's Cookies in the Mission is way better. \n\n2. Fresh Marshmallow - Im not a big fan of marshmallows so it was a pleasant surprise. Pretty good\n\n3. Apple Galette - Flavorless", "author": "Quang W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Best quiche (the cheddar jalapeño one) I've ever had in my life! Hospitable service, came in just to check out the shop cos I frequent the shops in this neighborhood often. The guy working the counter (Josh) gave me a complimentary coffee since it was my first time in. A+ I love supporting outer Richmonds quirky small businesses. Am glad to have this new addition nearby and am excited to try more of their treats! Also kinda scared Ima end up eating delicious buttery pastries every day and gain some lb's, but oh well!", "author": "Jessie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Four stars for the baked goods! Coffee is decent, nothing fancy but gets the job done. However, this neighborhood spot doesn't deliver the warm environment you would expect. I frequent here and never have gotten a response to my good morning or thank you! But it's convenient the price point won't gouge you and like I mentioned the goods are tops.", "author": "Megan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Just passing by and got a lovely coffee and granola with fruit. Fresh blackberries were just what I needed. I didn't get any pastries but that took all my willpower-- they look and smell great!!", "author": "Margaret P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "I love this place!  Friendly service and a nice place to sit and watch the city pass you by. \n\nTheir granola has no gluten ingredients, although it's prepared in the kitchen where they bake all the gluten.  I have Celiac and have never had an issue eating it, but obviously everyone is different so keep that in mind before trying.  \n\nThe staff are awesome too!  Super friendly!", "author": "liz s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "My favorite croissants are here! Fantastic breakfast sandwiches with biscuits... fruit buckles/crumbles... cheddar scones... everything is delicious and made with love! I work in this awesome neighborhood and come to this bakery as often as I can.", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "I tried Butterlove bakery for the first time this morning.  We went looking for donuts, but discovered an array of amazing pastries.  The ones we settled on were each delicious, and we're high quality in ways specific to each of their kind.  I will be going back as much as my waistline can afford.", "author": "Brook F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "So glad Esa has a new, permanent spot. Her seasonal fruit pies are amazing. I love stopping by the new shop, but I've even requested custom orders from her for parties. She's super accommodating and has always come through.", "author": "James T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "This place has AMAZING! baked goodies. If you want savory, sweet, (or both like me) then come here! They have everything from mini hand pies, to savory scones, and peanut butter and jelly donuts. I had the chicken pot pie and a slice of the buttery bundt cake. Both were delectable. The chicken pot pie had perfect, buttery crust and a rich and creamy filling packed with chicken and veggies. The bundt cake was simply delicious. I love that this place is simple and just about the food; and it shows. The owner and her husband baked everything from scratch and I love getting to support a small business like this!", "author": "Autumn D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-22", "description": "$3 coffee really!! Is the outer Richmond becoming downtown? Pastries are good but not mind blowing Marla is still setting the bar out here and the price but BLB is not far behind in price but quality", "author": "Ron B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "The name caught my eye! Glad I checked out this place. I tried their peach ricotta cake and berry pie. Both were delicious! The pie crust was flaky and crunchy. Friendly service! They have a patio too.", "author": "MC C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "I finally ventured in here after Nib's closed and was worried the new owners would be hipsters. None of that! They are super friendly, down-to-earth SF locals. I picked up a few cookies and scones  (irish cream chocolate chip scone) and wow, they are delicious. They are flakey and have great flavors. The ingredients taste fresh and are very well balanced unlike some other pastries I've had at other local bakeries. I don't have a lump sitting in my stomach after eating these items. I can't wait to try the pies!\n\nCoffee is also excellent!! I hope they add an espresso machine in the future :).  They really are a neighborhood family and I hope they will stay for a very long time.", "author": "Elena R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Ham & Cheese croissant crusty layers of flaky warm gooey in the middle Christmas Dinner ham-itis.", "author": "Ryder H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "Best cookies in the area - cowboy, chocolate chip, and poppyseed. Esa knows what's up!", "author": "Laurie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "Holy yummy!! Stopped in for a black coffee and couldn't resist the lovely pastries! Crispy flaky and buttery crust and perfectly ripe and sweet fruit in the middle, I think what I got was called a pear tart. It was almost like a croissant-type crust. Anyway, it might be one of the top 3 pastries I've ever had in my life. The coffee is really nice too, not too dark of a roast to drink without cream or sweeteners. This is definitely my new favorite bakery in the neighborhood. Not to mention I spent about 3$ less than I would have at the bakery up the street!! Can't wait to try this spot again!!", "author": "Jessica E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "Amazing scones and muffins. The pineapple buckle is heaven. Must get item. Found my new love!  Danger for my waistline.", "author": "missy d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Omg gotta try the BLT sandwiches they sell!!! Best sandwiches in the world!!!! I'll definitely come back!!!", "author": "Claudio D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "I can't even count how many times I've been there already and it just opened recently. My go to is the ham and cheese croissant. Basically all of the pastries are amazing. The coffee is outstanding too. I usually prefer espresso drinks but this coffee hits the spot. Great atmosphere. We love bringing our kids and enjoying a quiet, tasty pastry-based morning there.", "author": "Ami B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Our family has been here five times -- and loved everything we've eaten. My favorite is their apple pie -- thin apple slices, fabulous crust, nice cinnamon taste. Chicken pot pie was perfectly seasoned, filling moist without  being mushy, and perfect crust. The chocolate croissants are great. My husband likes the scones. Some might consider it too dry or dense but he likes them that way. Great addition to the neighborhood!", "author": "Sabrina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "AMAZING little gem on balboa st. everything is freshly hand made by the owner and her husband and soo good! had the most delicious quiche and donut! support this small business!", "author": "Emilie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Just simple great bakery items... Croissants that are crispy the way they should be, which is hard to find... Although they don't have an expression machine, they more than make up for it by making a good cafe au lait...", "author": "Ivan T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-30", "description": "For Thanksgiving I was at a gathering during which one guest humorously \"unveiled\" a beautiful pie (from ButterLove). After much \"ooo\" and \"ahhhing\" everyone was served was turned out to be fruit filling surrounded by cardboard-esque crust! Since it was a friendly, neighborhood party everyone felt comfortable enough to begin openly hurling insults, snarky comments and criticisms about the pie. Sadly, the piles of undercooked dough had to be thrown out. In addition to the inedible pie and embarrassment for the person who bought it, we attendees are now reading the owner's response in which she gets defensive and questions whether they were even puchased at her establishment! Bad product, bad business practice leaves me with a BAD feeling about ButterLove!", "author": "Kim B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-24", "description": "My assignment was to bring dessert.  So I bought 3  pies--apple, pecan and a pear crumble for three different parties.   The consensus was that the filling was tasty but the crust was terrible.  The edge was so thick that it didn't cook through.  For $30 highly disappointing!   And embarrassing since I brought them.", "author": "jackie i."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "SO MUCH BETTER THAN MARLA'S!!! Good food, good attitude, good all around. Just Say No To Marla's!", "author": "Scott D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "Love! Apple pie is the best that I have EVER had! I'm not even a pie person. Ordered it in advance and it was ready for us at pickup. Husband (who is somewhat more pie-obsessed) agrees the apple pie is the best he has ever had. Highly recommend! We will be trying some of the other pies next. Can't wait!", "author": "Karen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "so good!!!  if you love butter, then go here.  i mean, that's why they named the store that, ya know?", "author": "Miss P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "Wow, we ordered a whole quiche with zucchini for family brunch--it was so delicious! The filling was smooth and creamy, the veggies tasty, and the crust! The crust started crispy, and proceeded to melt in your mouth.\nThe small galettes and the chocolate croissant also yummy.\nI love pies, and am choosy about them--Butter Love made me very happy!", "author": "Helen w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-26", "description": "Cute store, but still a little cold because not much decor. Decent baked goods for sure, but I miss the prices of Nibs, basically everything went up 50% a regular cup of coffee $3 seriously this is not some fancy late!. But, that seems to be the general trend in this neighborhood now that Marla started. Not really sure why because I frequent other bakeries all over town such as Cinderella, Le Marais, Mission Pie just to name a few and they all charge way less for the same pastries at the same or better quality, kind of sad that you can't take your kids anywhere anymore and get a cookie and a cup of coffee for under $5", "author": "Alan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "So after all these years I now know what an apple pie should really taste like. The crust was perfect. It was not too heavy and had a nice bit of crispiness to it. The apple filling was just the right amount of sweetness. It did not have that syrupy flavor over it masking the flavor of the apples. I could taste the apples which were thinly sliced and cooked just right. I'll definitely be back.", "author": "Gerry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "We stopped in to see how the new space was after our old favorite Nibs closed (still so sad about Nibs).  Happy to say new owners seemed really cool, and nutella donut was delicious.  Was worried some awful spot that belonged on Valencia was going to pop up... you know a place that's expertise was in artisanal chicken feet or something... but happy to say it's just a lovely bakery.  And they live in the Richmond!", "author": "Bianca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Everything in the shop looked great,so  I had a hard time deciding which baked good to go for. I took home one of their fruit galettes, warmed it in the toaster oven and it was so delicious. The pastry is perfectly crisp and flaky and the fruit filling was just the right amount of sweetness and moistness. Perfection. I'm looking forward to trying out more.", "author": "Kareen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "OMG...I LOVE LOVE LOVE this place! pastries are SOOOOO GOOD! I picked out a couple of different things to try out, a couple of croissants and a fruit tart with a crumbly topping...delicious! You can smell the buttery goodness in there! I can't wait to go back and try their pies & hot chocolate next...yay!", "author": "Jag F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Amazing, amazing bakery. Croissants, plain, chocolate or ham and cheese are perfectly flaky, made with butter I'm sure, other pastries are delicious. Issa and Josh are doing a terrific job at bringing high quality and honest work in the neighborhood.", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "The ambiance is a little lacking, particularly compared to the very cute Marla down the street, but the pastries are excellent -- probably a little better at Butter Love than Marla's (which is also excellent). Neither place quite matches Tartine -- but the Outer Richmond croissant scene is very well served by this pair of bakeries on Balboa. Enjoy!", "author": "Slip E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-10", "description": "Ahhhh! The chocolate chip cookies. Like a chewy macaroon with chips in it. Addictive.", "author": "j r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "The apple fritters are AMAZING!!!  Such a nice, friendly neighborhood place. Reasonable prices, great coffee, the owners live in the area... It's all good!", "author": "Vicki A."}
