{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "Good selection of craft brews, and the chicken sausage dog from nearby DNA lounge was good. Would avoid the overfried (albeit generous) order of tots from DNA).\n\nOwner's visibly uptight, but don't let him kill the mood. The rest of the crew is nice, as well as admirably organized (and funny on the intercom) while juggling food and drink orders on game days.\n\nI like how the front is open so it stays airy, never stuffy.\n\n*Best response from a business haha!", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "Went there last Sunday, met some cool folks. I love this bar and am becoming a regular there.", "author": "Dennis L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-20", "description": "This spot is so great, I ended up here twice back to back on the same weekend! First of all, the bartenders are awesome! On my first visit, the bartender recommended a couple drinks for me and I found one of my new favorites: Boochcraft Grapefruit Hibiscus Heather ($7.50 for 10oz). If you like a fruity cider type of drink, this is a must! On my second visit, the new bartender I had remembered me to close out my tab without even mentioning my name --very personable.\n\nThe other perks of this spot is their huge space and high ceilings. They have two pool tables upstairs for $1 per game. It was so much fun to play on a date night and with a huge group of friends. There's also a row of arcade pinball machines, but those were a bit pricier at $2 per game.\n\nLastly, they also have some food options for you. I tried the Joe Thornton ($6) and Stephen Curry ($7) Hot Panini from my friends. To be honest, I'd skip on the paninis as they were just rather okay. I did really enjoyed the Chips and Queso ($3), which was a crowd favorite that we had to make another order.\n\nOverall, super fun spot to hang around with some drinks and games. For more food options, it's walkable to SOMA StrEat Food Park with a rotating group of food trucks after some drinks.", "author": "Cindy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "Sports bar with huge selections of beers on draft and in bottles. Pretty big space with high ceilings. They have a second floor with tables and pool tables. They have a good amount of tvs to watch games. They also have a couple of pinball machines by the entrance. Their food menu consists of nachos, sandwiches, hot dogs, and food from DNA pizza. They have a partnership with DNA pizza which is right next door which offers pizza, tater tots, appetizers, breakfast, sandwiches, salads. They will deliver it over to your table. The loaded tater tots are good! Overall good place to grab drinks with your friends and watch games.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Whilst walking back from Soma StrEat Food we stopped in here. The place is massive and instantly realized it would be a great place to watch football for fantasy heads, or for March Madness. They have a lot of beers on draft and even more in bottles. Upstairs they have pool tables and pinball machines throughout. \n\nMy one gripe was the menu for the beer is on the Tv and it rotates so quick it's hard to scan them all. Yes, first world problems, but have a static menu (i.e. paper) for me to peruse too. \n\nOkay, off the soap box. Cool place to grab some beers and play pool or watch the game.", "author": "Willard J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Even though there is a strong Kansas City presence in the bar, I appreciate them having a ton of TVs for the rest of the NFL games going on. We ended up finding this spot because we were looking for a legit sports bar that had a great set-up. Thanks to handy dandy Yelp, we were able to see that this was the type of sports bar that we were searching for.\nUpon entering, we were kindly greeted by the bartenders and had our drink order taken quickly. Since we were also hungry, it was awesome to find out that they have a partnership with DNA Pizza, which is right next door. I appreciate that there was tons of seating, pinball machines, some arcade games and a pool table.We ended up sitting upstairs so that we could get a birds eye view of all the TVs. The pizza was quick to come and it was definitely delicious. Overall, if you're looking for a legit spot to watch your favorite sports games in the City then definitely make your way here.", "author": "Cristal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Great sports bar with a lot of space and lots of great draft and bottle beer options.\n\nThere are a ton of TVs and 2 levels so almost whatever you want can be on (I assume). It's often low-key, and you can show up in a Spurs t-shirt and not be harassed.\n\nReally the biggest draw for me when it's not NBA playoffs is the pinball. They've got some excellent \"classic\" (Guns N Roses, Star Trek) and newer machines like Ghostbusters (based on the 1984 movie). Six of them total.\n\nYou can order food made inside or outside (slight surcharge). The Joe Montana panini is very solid - I think it's just cheese and bacon and bread on a Foreman grill, plus a pickle, but it's good when you're hungry. Warning: the pretzels in the pretzel and cheese dip are not hot and soft, they're hard pretzels.", "author": "J.P. M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-19", "description": "Was here on Saturday, 4/14 in the afternoon with a group of 5 people. The bouncer made racist comments to my friend as we went in. After we were inside, I let the bartender know that we were leaving because the bouncer was unacceptable. He said that the bouncer was just drunk and that they sent him home. Appreciate that he was sent home, but it seemed like his actions were brushed off.\n\nNot okay in my book, definitely will not be going back.", "author": "Neha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Beer heaven at a bargain!  In SOMA, next to SF happenings ie., shows, concerts, clubs, hangouts, trendy bars, not-so-trendy bars, gentrified restaurants, you will find your beer here ranging from $2.00 to $15.00 and it doesn't even need to be Happy Hour!  So if you're on a budget and love beer, look no further.  Free tastings too. There is what seems to be an endless beer menu listed on the walls and chalkboard avoe the bar area which could be overwhelming. Overwhelmingly good that is!!!  Table top menus also boasts snacks like nachos and pizza.  Food generally ordered from adjacent  establishments.  Had the pizza that complemented the beer.  Yumsters.  Had the Warrior Game on that complemented the beer.  Awesome.  Had more beer.  Heaven.", "author": "Theresa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "40 beers on tap.\nDNA pizza delivered.\nAttractive bartenders.\nPinball and pool tables. \nFlabongo.\n\nGet your ass over there.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Great selection! We really liked how the menu was organized by styles ( IPA, Sours etc.) with the price and size of glass. Fast service and clean bathrooms.", "author": "Rashni R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "Ed jr have a XX to.c we can show aihja hei I have it g to do da wetdee is d you riskss.s", "author": "Aldo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Stumbled upon this place just a few months after Buzzworks opened on a random Thursday afternoon-ish. College ball was on the many tv screens displayed at this place, with a row of pinball machines to play from, and a nice hefty lists of beers they have on tap - is this heaven? \n\nSat down and looked at the nice lists of beers they had on tap. Alfredo helped us out and even gave us a sample of what he was enjoying drinking at the moment. It was great. I love the conversation between everyone and it just felt very welcoming. I played a bit of pinball and had a few beers while I enjoyed watching the game. Alfredo definitely made the experience that much better as he was attentive to all his customers and joked around with us while we were having a couple beers. \n\nDefinitely a place to check out!", "author": "Victoria K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Came here to watch a warriors playoff game. Very fun! A little small and very packed but has a great vibe and a great beer selection. \n\nIt's one of the few places I've been able to find DogFish Head 120 minute IPA. It's a 17% beer. But it's damn good.", "author": "Nick D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "Big TV's, Big Beers, Big fun!  I love the 'rotating' guest beers!  A great place to watch a game.  I've never tried the food there, but part of their menu is delivery from DNA pizza (which is terrible) so skip that, but you can bring in your own food so its all good!\nGo with your friends and enjoy a few pints!\nSee ya soon Buzzworks!", "author": "Jim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Can't believe I haven't written about this pace yet. I've visited so many times! This is a sports bar with a huuuge selection of beers. I'm not talking like 15 im talking 30+ the place constantly switches out their beers too so there is always something new to try. \nAlso a really good selection of ciders. Such a chill place to come and have a beer or 5.  Haha this place is really rad and I'd recommend it to anyone. Really amazing bartenders too and really amazing service.", "author": "Michelle P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "They have a BUNCH of taps here, and the service was great. There are pool tables in here, a bunch of TVs, and lots of seating. Gotta check this place out to watch the Warriors!", "author": "Michael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Had a good glass of wine and could easily order food from the companion restaurant. Had some spicy buffalo wings. Cheep pool and a foosball table upstairs!", "author": "Matt S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "My friend and I were in the area and randomly stumbled upon Buzzworks as we were trying to look for some brews.  It's a pretty big place in a warehouse like building with two stories and a wide selection of drinks to choose from. \n\nThere are also some snacks you could order as well. Check in on Yelp to get $1 off any drink or wine. The guys that work there are super friendly. There's a variety of drinks either on tap or in a bottle / can. \n\nThey even gave us complimentary pretzels. We went in the mid afternoon so it wasn't busy at all. Def a place to come and check out and grab some drinks!", "author": "Yinja L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-04", "description": "YES! THIS is the bar I've been looking for!\n- not crowded\n- great TVs, showing tons of sports games\n- INCREDIBLE beer selection on both draft and in cans / bottles\n- entertainment: arcade games, foosball, pool\n- hipster but not pretentious beer drinking atmosphere\n\nGo Buzzworks! I kinda want to spread the word, but I do love that this place wasn't crowded during the OKC-GSW game last night... NBA Finals spot, anyone?", "author": "Kerry G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "A gem of a bar occupying a surprisingly gigantic space in SoMa. \n\nFirst, and most importantly for me, is a gigantic selection of craft beers on tap, curated among both California and foreign brewers, and covering many different styles. I'm a beer aficionado and the fact that the large majority of offerings here are ones that I haven't tried yet earns bonus points with me, as the establishment is clearly making an effort to avoid the same old beers you see at bars everywhere these days.\n\nSecond, this place is fantastic for groups. There's a large amount of space, and despite the fact that they've filled it with amenities like pinball and billiards, there's still enough room for large groups to spread out on either the lower or upper levels. There are also TV screens everywhere so you can socialize, have fun over some games, and still pay attention to the game.\n\nThird, there's a casual, no-attitude atmosphere here. The patrons here don't seem anywhere near as full of themselves as those in more exclusive places in the West Bay nowadays, and the servers are a pleasant bunch, even reading my mind by playing hits from my college glory days in the late '90s from folks like Mariah Carey and Destiny's Child. \n\nWhile the food offerings - like nachos and panini - might not be haute cuisine, they're rather cheap, and you get what you pay for in terms of quality. They're all good ways to soak up the booze, and besides, this place is more about the boisterous, social atmosphere instead of fine dining.\n\nThanks to Yelp for another great discovery!", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "BuzzWorks is a decent place to spend your time if you have a couple of hours to kill in the SoMa area. For about $6-8, you can have a great pint of beer and watch a ball game. If you're into classic arcade games or pinball, they have that too. However, food is super limited, and even an order of chips and salsa will set you back $7. Bring some dollars and quarters, and relive your childhood with some pints. If you're feeling DNA pizza and their food, you can order it at the lounge, but it will be an extra $1 on top of what the regular DNA price is because they charge when you bring in outside food. At least it's acceptable-ish?", "author": "Danny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-14", "description": "Lots of beers to choose from and other drinks as well. Plenty of tv's to watch sports on. Upstairs are a couple pool tables and other seats and tv's to hang out at. \n\nWas only here for a quick beer but I would come back if I was ever in the area again.", "author": "Kait P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-16", "description": "They've only opened up a month ago, so I hope with time Buzzworks makes a few enhancements to their business model. On the positive front, they offer an excellent selection of beers. I like that the menu categorizes the selection as being hoppy, selection, sour, strong and so on. For those of us that enjoy beer but are not aficionados, it makes it easy to try new things. \n\nThere's a ton of space here to be social with friends. Bring everyone! Loads of room at the bar to watch folks line up for the mash-up next door at DNA lounge. If people watching gets boring, head upstairs to compete in a foosball tournament with your buddy. Promptly followed by an annihilation game of pool. Not that I am speaking from experience. But I did win. If watching sports with beer in hand is more your speed, there are T.V.'s on both levels in practically every corner.  I could watch a poker competition, the Men's & Women's Olympic competition and the Olympic men's soccer game without moving a muscle.\n\nOn the potential feedback for the owner. Dude! or Dudette! $2.00 for a pool game?  I mean.. why? My friends played a single game then walked away. As did the other group of folks that played on the  table next to us. Lower your prices to .75 or be wild and drop 'em to .50. I guarantee you will draw a bigger crowd upstairs and make more earnings at the pool tables. Also, the spacing is entirely too close! You have signs warning players to not hit the T.V.'s on the wall. Hmm, maybe a better option would be to move said T.V's a bit higher or move the tables further away from the wall. You definitely need more spacing in between the tables. \n\nAdd more games. At the entrance there are 5 or 6 pinball machines. The end. Wait. What? Where is Ms. Pacman, King Kong, Galagga!!! If you are advertising as an arcade/pinball spot, there needs to be more of a selection. A lot more. You have the space.\n\nLastly, are your bathrooms for the public? Because everyone standing in the long line for the club next door were coming in to your spot. Your door man didn't seem to care. What is the point of a bouncer if he ain't gone keep yo' place exclusive. Keep that in check!\n\nI'd come back. I love a good selection on tap. Only with the hopes that there will be additional arcade games. I'll be looking for the spot where I can stand, place my beer next to me and level up with double spaceships on several rounds of Galaga. Especially on Challenger round!", "author": "Jaylena P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "I threw my husband a surprise birthday party here (on Halloween weekend) and it went so smoothly thanks to Vlad and the team at Buzzworks. From the moment I entered my information in the inquiry form while researching event spaces, to the night of, they were very responsive. Vlad actually called me to discuss my event needs, which were pretty basic - ordering food & covering the tab (up to a certain limit) for the guests' drinks, while having reserved space for us to sit. The second floor was perfect because it was large enough for our group and away from the rest of the bar. We ordered an assortment of pizza, wings, and tots for the group - you get a good amount of food for the price, in fact we ended up taking home leftovers. And the staff was good about checking on us throughout the night, if we needed water and to clear away any empty glasses. \n\nThis was actually my first time being at Buzzworks and I definitely plan on going back. And for any sports fans, you'll love the number of tvs they have!", "author": "J B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Super chill vibe with a huge variety of draft and bottled beers. Selection of finger foods perfect for enjoying a sports game on TV. They split up the 9 screens into separate streams to serve the wide audience. Loved this place rip to bottom", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "Been going there again lately, and the bartenders are better at greeting people who don't have beers now. \nService has definitely improved, so another star added to my previous review. \nPinball games are all in good working order, I will continue to hang out there after work!", "author": "Adrian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "I tried a beer here that was 17 percent . I didn't even know beer percentage gets that high especially to be that high percentage and still be tasty.  The bartender was super friendly and even funny. The guy even let me taste hella beers. The place is huge . They have lots of pinball machines. The location is great. I wish they were open a lil later . There were a good amount of hot women. The bathrooms are super clean and that's a def plus.", "author": "Luke S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "Went there for the national championship game for NCAA men's b-ball and they had like one or two guys working in the whole place. What's up with that?! I think there aren't enough restaurant staff in this city... yet there are bums all over the street lookin for work. I'm not sure on my stance yet but I think hiring bums to work in restaurants might be a genius solution! it might be better to have to scan my food for needles before eating rather than wait an hour and a half for a gd pizza. I'll have to think about this one over a few more Sierra Nevada hazy IPAs", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "This place is awesome! Justin and Justin were great. So knowledgeable about the beers on tap and great conversation. We will definitely be back!", "author": "Justin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "Fun place. Food situation was interesting (they get it down the road), but the staff made it seamless.  Was cool watching the game and fun time with the group.", "author": "Ward B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "My boyfriend and I have been to this bar before. It was a random encounter in the fact that we just randomly walked by the place and saw the fun games and the large beer selection.\n\nTonight we went back to watch the Warriors game and probably had he best customer service I have ever received from an establishment. \n\nWhen we walked in, we were \"thirsty\" and hungry. We ordered off the expansive beer list, then ordered our food. Since the work with the DNA restaurant next door, they have no control over the food service. They first foods we ordered were not available. Then we found out that the DNA staff had all called out. We had to switch up our order, which wasn't a problem at all. Due to the mix up, things got messed up. That being said, the guys at BuzzWorks were SUPER accommodating. \n\nI have been at a lot of restaurants and bars where things got mixed up or didn't work out and I have never been treated as well as I was tonight with BuzzWorks. They were super spot on and accommodating. I will DEFINITELY go back just based on their customer service. Of course the ambiance and drink selection are great too, but I am all about companies who treat their customers well! \n\nI would give them 10 stars if I could!", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "This place is great! Came here twice to watch the Warriors finals games. Both times were packed of course but nevertheless, they had plenty of TVs, a TON of beers on tap, and I loved how big and spacious this place is. They also have a couple pool tables upstairs.", "author": "Dara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "Large space, plenty of seats, plethora of beer, good eats, TV's along the walls, pinball/pool tables, and friendly staff and customers.  Buzzworks has it all.  \n\nTheir endless supply of beer displayed on the TVS and printed on the menus was a bit overwhelming.  \n\nMe: Do you have 805?\nBartender: We might have it... (looks through iPad/fridge/menu/pockets) \nCustomer:  Hey 805! That's from SLO\nMe: (GASP) You know 805?! Even he doesn't know what it is (points to bartender)\nCustomer: Hi, what's your name?\n\nFunny how one can make friends from ordering a not so well known beer.  I opted for a pilsner that the bartender recommended which was fine.  We ventured upstairs by the pool table and a few minutes later, my chicken apple sausage arrived.  The sausage and pickle on the side had a nice snap to it.  \n\nGreat alternative from my usual sports bar to grab a beer, watch a game, or hang out.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "I had read about Buzzworks in a weekly article not long after they opened and was intrigued. A beer bar in the heart of the crazy club scene on 11th? Sounds good to me! So I scheduled a small work outing here on a weeknight to check it out.\n\nFirst, I was super surprised that it wasn't crowded. Maybe because it was a weeknight, or because there weren't any big sports games going on, but there were just a few different people inside. Though the space was quite big, with an upstairs area, so it would be able to fit a good amount of people and still be manageable.\n\nSecond, and more importantly, the beer choices were quite good and plentiful. There was many to choose from in any beer category you could ask for. Among those that I tried, the Laughing Monk selections were particularly good as well as the Berryessa DIPA.\n\nDefinitely a place to check out if you're into beer, and especially if you are someone who gets very disappointed at the prospect of spending a night at a club with shite beer. Stop here first and then spend less at the club later.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "The best place to watch sports in the City! Truly one of the only \"sports bars\" I have been to that has a good beer selection filled with local independent breweries. They also have pinball machines and a couple pool tables. The layout is fantastic and the atmosphere appropriately raucous for big games.", "author": "Devin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "Pros: \nGreat beer selection \nFriendly bartender \nCool interior/ ambiance \n\nCons:\nworst panini I've ever had. Don't order the panini. Some random dude that clearly wasn't a cook went back there and slapped together the sorriest panini ever made and he didn't wear any gloves. Nothing could have saved that sandwich. The food here is basically airplane quality food.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Great workers!! Very cool laid back owner and very friendly bartenders. I loved how spacious it was in here and they have a wide selection of beer on tap . I had accidentally left my bag here last night and they were gracious enough to keep it safe for me and let me come get it the next day", "author": "Thang S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Met up with a friend here because we both happened to be in the city at the same time. I've never heard of or been to buzzworks before so didn't know what to expect. I thought it would just be your typical bar scene. \n\nI was pleasantly surprised by the arcade games, foosball, and pool tables (again I wasn't expecting this, and didn't have time to check yelp when my friend told me to come meet her here). It was a really fun experience as we played 3 games of foosball!! The atmosphere is super chill. I would definitely come here again and recommend it to other friends and family. This is more of a beer establishment, but they do sell wine as well (which is what I will be sticking to). I did have a little of my friend's cider which was really good as well.", "author": "Deepti N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Stopped by for a beer after work and had a great time!\n\nGreat (and extensive) selection of beers on tap and a ton of TV screens. There's plenty of space and a decent amount of seats but it gets packed quick! Folks are generally not pushy and are pretty friendly though. Staff is friendly too!\n\nThey offer food from their kitchen but it's not the highest quality of meals, but more of a quick, bad-for-you bite to go with your beer. Still appreciate that it's there though because who doesn't crave a bite to eat now and then? \n\nOverall, pretty chill. Would go again just for hangouts.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Had an event here for 60-70 people and it was perfect! Justin was our contact and he reserved us the back of the upstairs which included the pool tables, foosball, and TV screens. It was a wonderful and spacious area- plenty of place to sit/ stand and they gave us some wristbands that we were able to use to identify our group. Justin was great about letting me know where the tab was at various times during the night in case I wanted to cut it off.\n\nThe drinks were great! So many varieties of beer and wine for the non wine drinkers. They even made it easy on us and just sold us wine by the bottle instead of glass. When our caterer was super late, it worked out really well that they had some food options there as well as at DNA across the street. \n\nWould definitely use the space again for a different team.", "author": "Kajal G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "New fav beer place in the city! They have 40 draft beers on tap and once they're out of one, they switch the tap, so if you visit again, you might not see the same beers. When they say rotating.. they mean it!\n\nFound our new favorite beer: a white mocha stout. Probably won't see it there next time, but excited to see what's in store for next time.\n\nFair prices, friendly and attentive bartenders, PLENTY of seating and parking, and tons of TVs so you can catch any game you want. AND pinball machines and games!", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "this bar was amazing! The beer selection was unique and great. The bartender was nice enough to give us his recommendations based on my preference in beer. He actually mixed two types to make an amazing concoction. Definitely a cool place to visit", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "One of the better sports bars in SF. A very strong beer selection with over 40 beers on tap and if that's not good enough they also have several fridges of beers! Ask the bartenders for suggestions if you're not sure what to drink. They are super friendly and will also let you try the beers your interested in.\n\nA great place for big group gatherings. My friends and I have been able to come here and play board games upstairs while watching sports. The tables are large enough for big group games.", "author": "Elaine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Spacious!! Pool tables!!! TV's!!!!! Awesome place. Places to sit everywhere! Love how the upstairs has them pool tables. Beers on beers on beers! So yea that don't serve hard liquor but it's a good pre game joint or a place to just chill with your friends.", "author": "KB B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Lots of beer options,lots of Sours which is why we went and also had a few cbd beers which where also very tasty  . They also have a full menu of good food . Very friendly, attentive employees.", "author": "Ash D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "As a true beer fanatic, I LOVE the amount of beers available. Add on games and bar snacks and I'm sold! Love that you can have some fun with pin ball while drinking and move the party upstairs for a low key vibe to chat and chill. Not to mention awesome coupons you can redeem when you check-in on Yelp. My new 'go-to' when I'm in town visiting. And ask the bartender to meet Justin M while you're there. Dude is SUCH a character! He's a blasty blast! Don't worry - if you can't decide on a beer...try a flight!!!", "author": "Hayley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "This place has a great assortment of beers on tap as well as pool tables, a foosball table, and a few pinball machines.  We can easily kill a few hours here for a chill night.  It didn't get too crowded either, even on a Friday night.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "Very cool bar! Lots of taps! Lots of bottles! Lots of (sports) TVs! Lots of (6) Pinball machines! Seriously, this place is amazing!", "author": "Christopher M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Mic check, mic check.  Hey, is this thing still on? \n\nI'm dusting off the good old Yelp account three years later to write a long-overdue review for one of my favorite new watering holes.  Buzzworks is, hands down, my vote for the best taproom in the city.  \n\nThey have 40 rotating taps, and a huge screen that lists all of the current taps, divided by beer style.  Find one that sounds intriguing, but you're not sure you want to commit to a full glass?  No problem, your friendly bartender (and they are ALL friendly, no snobs here) will gladly pour you a taster and give their personal opinion on the brew.  They will take your preferences into account when giving recommendations too.  With over 100 bottles in their massive refrigerator, you're sure to find one of your favorite standbys if you're not on the adventurous side.  \n\nThey've branched out a bit, food wise, with their new NFL brunch menu, and I couldn't be happier.  Previously, they only had small bar snacks: nachos, a meat and cheese platter, etc.   My North Carolina style pulled pork bbq slider was fantastic, heaping with pork, a vinegary coleslaw, and served on a brioche bun with chips on the side for only $5.  I had a delicious soju bloody mary to wash it all down, garnished with a spicy pepperoni stick and half a salad on the celery. They only have a beer and wine license, so vodka was not an option.\n\nThey were my headquarters for the Olympics, and you'll likely find me parked at the bar every Sunday for football. - look for the girl in the Broncos hat!  You'll find some good natured football fans cheering on their teams (and lightheartedly ribbing others). They show as many games as possible on their gigantic screens above the bar. I think I counted 7 games being shown all at once.  \n\nGet out of your comfort zone, and give this place a try.  You won't regret a moment of it.", "author": "Suzanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "A really good sports bar. A huge selection of craft beer and screens everywhere. Food options are very limited. Great supporter of local sports teams. Friendly and helpful staff.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Love this bar! I can enjoy a different variety of beers and wine. I had no idea that beer could have such a high alcohol content which can totally get you pretty buzzed just off of one glass. Lol you learn something new everyday. Buzzworks has been my go to ever since they opened up in the neighborhood.", "author": "Stefany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "Cool location, huge TVs, large selections of local beverages l, cool metal pipes/urban aesthetic, and pool table.", "author": "Vibhu K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Special thanks to Vlad, Justin, and Patrick who helped me host my 30th birthday at Buzzworks - it was easily one of my best! They were all very helpful with the planning process, and were receptive to some special requests that I had in the audio/video departments. My guests were very impressed with the beer selection, ample space (a rarity in SF), bar games, easy accessibility from BART, and great atmosphere. \n\nThey're (relatively) new on the block - go check them out before everyone else finds out!", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Great brews and friendly staff perfect before hitting Slims for a show. Love this spot will def be back", "author": "Matt S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "So good!  Buzzworks has such a great fresh new spin on the beer bar!  They have a huge beer and cider selection, fantastic and knowledgeable staff - all packaged in a really well done environment that will appeal to any demographic.  They have also done a great job for the sports viewers, and they have loaded up the place with screens you can see from any angle.\n\nI'd recommend this spot as a great place to meet friends after work, to watch an event, or a fun place to hang out on the weekend.\n\ncouldn't recommend more or more highly!", "author": "Natasha K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Great beer! \nGreat TV's\nGreat atmosphere!\nBest bartender! (Christopher)\nI will definitely be back to try some more of those amazing craft beers! \nThanks Buzzworks!\nThe only thing that can possible make this place better is when they start accepting Bitcoin!", "author": "Mark L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "I am absolutely going to pre-rage here every time I go to the DNA Lounge. Beer tap rooms are about a dime a dozen in the bay now, but this one checks off all the requirements and adds a few goodies. The tap selection was great, the fridge was also heavily stocked, and I like any place where I can order a triple IPA and then a tall boy of Coors and not get pretentious looks for it.\n\nThe place is very large and open for its medium. It was slow when I went. There are enough TVs to qualify it as a sports bar, they mentioned it gets pretty packed on Sundays and I believe it. The selection of pinball machines and arcade games are just a nice extra touch to what was already a cool thing.\n\nCool little watering hole.", "author": "Blake H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "Stopped in for a few beers before the Zakk Sabbath show next door at Slim's.  Very cool bar (huge beer selection) and they have some killer Pin Ball machines!  I was partial to the Guns n Roses one!  Great place to pre-game before you head to Slim's for a gig!", "author": "Jeff F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Holy Crap I freaking love this place Beer! Pool! Tv's! Pinball! 100 game Arcade machine!\n\nnot exactly in that order ! Please stay open forever !!! I've tried the Sierra Nevada Otra Vez and the Heretic Tartuffe.", "author": "andrew a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Buzz Works is open!\nWhat a great spot! I loved the seemingly endless selection of beers on tap - so many that even your hop snobby co-workers will find that epic micro brew to satisfy their needs. I loved the coffee stout!\n I really liked the decor - bikes bikes bikes! Hundreds of abandoned junker burningman bikes went into the decor - all cut and welded frames make up the upper railings and the counter-tops are lined with sprockets galore! \nYou can play pinball, pool, and foosball too, but I think most folks will find this is a great place to catch a game! It's a sports bar after all - lots of sports on some serious screens!", "author": "Robert B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "Fall - one of my most favorite seasons of the year.  There is something about this weather that also makes beer come to life. \nBuzzworks right here in SoMA SF brings my beer tasting buds to life with 40 something beers on tap along with bottles & cans, wines & of course those crisp Ciders that pair well with the city's cooling temperatures.\nOctober is a special time with momentous Baseball games along with tasty beer. \nAt Buzzworks the Pumpkin beer was one Fall beer I really Really like Liked.  Oh & the spicy sweet chicken wings so good (Yes I ate with my hands after tossing away my fork & licked all my fingers & no I did not feel guilty one bit) So good with that cold delicious Pumpkin Beer. \nWatching the games here is a full bonding experience the open airy space has a cool garage feel & it is with this nostalgia that takes me back to those house parties where most ended up gathering outside in the garage anyways, coincidentally where all those beer kegs landed.\nWhat also stands out at Buzzzworks is the honed long deep marble bar where sitting (or leaning) provides an ambiance pleasured with the long row of crafty taps.\nArcade games, Pinball, Hi Def screens, Pool Tables, & Foosball all make for an \"experience\" here at Buzzworks.\n\"Beerstein\" Lyle is a cornucopia of knowledge & experience when it comes to beers to put on your \"Must-Try\" list\nIt's the season - & spending it with friends, a variety of craft beers, sports & games makes Buzzworks the place I want to be.", "author": "JC S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "The beer selection here is massive and there are televisions everywhere on two floors. There's plenty of space for large gatherings and a lot of fun games to play. The staff is super nice and extremely knowledgable about beer. \n\nIt would take almost half a year just to try a new beer every day on their menu. That's how large the selection is and they have food there as well. I'll certainly be returning for more good times here.", "author": "A O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-08", "description": "A newish addition to the 11th Street scene, Buzzworks fills in the void with a hippish and accessible Sports Bar. The bar selection is outstanding and can feature guest brewers rotations. Games are played on the TV and if you get lucky there may even be a trivia competition. The open setting and large, garag-like entrance create a warm ambiance and allows for singles, couple and groups to mingle freely and with ease.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "The atmosphere was comfortable and friendly during my first visit to Buzzworks. There are games to play: fussball, pinball, arcade, and pool. There are also tv's everywhere; it's a terrific place to watch televised sports. \nI saved the best for last: the beer! I had the best stout, ever!!! It was the Stone Farkin Wheaton Woostout. Creamy, cold, complex, and a little chocolate. Yum! There were lots of other craft beers to choose from, including the ever popular IPA's. I prefer porters and stouts, and I was not disappointed. I'll definitely be back.", "author": "Rayleen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "I'm a neighbor in the area and rode by on my bike with the bf. Looks like a great place to chill enjoy GOOD beers and play great arcade games, pool and fooseball.", "author": "Flora R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Randomly walked in during the grand opening. Huge beer selection (I'm a fan of sours and they had 5).\n\nTelevisions EVERYWHERE.\n\nPinball machines, arcade games, foosball, and 2 pool tables (that you can pay for with your phone).\n\nA huge open area upstairs with tons of seating. This place is excellent.", "author": "Jake F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Buzz Works is the place to be! Girls, beer, and sports playing at all times. Before I get to the girls, let's get to the beer. 40 beers on tap 120+ bottles and a beer cicerone that is fun to talk beer with! Okay back to the girls..... Sports, beer, and girls... dammmmm! Just get up off the couch and get down here!", "author": "Shawnacy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "Great beer and pinball! The machines are operated by a nearby operator who is focused on making sure they work well and he was there on the soft launch and fixed up Ghostbusters as well as some smaller issues on the other machines.  I am thinking of hosting Super Selfie Pinball League here and the beers on tap are great too so far.", "author": "Gene X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "I like this place! Butters line was out the door and $5 cover Nah. We found this place and loved it. It got super busy with in 30mins of us being there it's pretty huge. We had so much fun my boyfriend left his atm card. Beer and video games what more could you ask for? Plus, the security guy is a sweetheart.", "author": "Sasha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "What a great bar!! 150 different beers. I went I for 1 beer and stay for 3 and a bratwurst which was delicious. What a awesome bar. The best bar inSF. I'll come here everytime I'm in SF.", "author": "Heath R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "Copper copper, beats, beer and pinball! Built by a master builder, served by master brewers. This is my favorite for a fri/sat night chill.", "author": "Gregory P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Love this place! Beer selection is amazing and the bartender, Christopher, was actually cool and friendly. Will definitely be back.", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "I'm pretty picky about my institutions of consuming alcoholic beverages. But this place ticks all the marks: good food, great beer, pinball machines, a very warm and welcoming atmosphere, and very attentive bartenders were all fantastic as well!", "author": "Linhbergh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Went in to watch a Warriors games, they had the game on a few TV so you can always see the game, plus they also had all the right sweet 16 games.  Ordered a pizza from next door which wasn't to bad.  Oh yeah and the whole point of this place, they have tons of beer on tap and in bottles, the bartenders was great and picked a few beers for us that I might not have normally picked.  I'll be back for sure.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "I've now been three times, and while Super Bowl was admittedly over-crowded, the other two times have been very pleasant weeknight experiences. There are two levels, with the top level sporting two pool tables, a foosball table, and plenty of tables, chairs, and TVs. Sports fans should definitely scope out a seat during the March Madness early rounds. The menu is digitalized, with about three dozen mostly obscure, mostly local taps, mostly in the $6-9 range for a 10- or 16-ounce portion.", "author": "Randy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "Just needed a minute from life, a drink & a slice of pizza. Christopher helped me with all three of those things.... It was amazing. I will come back to Buzzworks.", "author": "Asif H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Enjoyed the beer and the food. The bartender was fun and engaging. Lyle was charming.", "author": "Diane G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "I really like the ambiance at Buzzworks - they have a wide enough selection and knowledge of beers to be considered \"snobby\" but they certainly don't act like it! Friendly, welcoming staff that seem to want to go out of their way to make sure you leave happy, and willing to educate and sample beers to make sure you find what you like. Prices on par with SF bars, maybe a little less.  Food is pretty tasty, can also order pizza from next door which is a cool option.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Tight spot, big, spacious, two floors of seating and sports viewing! The bar has a great selection of beer and wine. The taps are great, the beer menu, is insane!! Love the pool table on the 2nd floor, and sitting. TV's are mounted literally everywhere so your sure not to miss a play. The arcade machines are a nice additional too. They also have food! DJ was playing music, the vibes where just right. Butter, DNA, and holy cow are right in the area. Great location and easy access to late night action.", "author": "J M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "Perfect place to go and relax, have a beer and play a few games to unwind. Kinda like being back in High School. Great Place Great People. Always fun\n                                                   CC", "author": "Cary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Love this place and convenient location. They're wide selection of brews insiders on top is tantalizing, I want to try them on. Christopher behind the barwas especially kind and helpful in choosing. This place is rad", "author": "Austin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Buzzworks is a great place to grab a cider and hang with friends! Christopher is also a phenomenal bartender. Great vibes + great service = a place I will return and recommend to friends!", "author": "Stephanie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "My wife and I hosted our pre-wedding happy-hour/rehearsal \"dinner\" at Buzzworks.  It was AMAZING.  Honestly, I had walked in on a whim while we were looking for places to host the event, thinking it might be a fun casual venue.  Then I met Justin and Vlad.  Justin and Vlad were like brothers I did not know I had.  They were such a pleasure to work with that we can't imagine having hosted it anywhere else.  They treated us like family.  \nThe venue itself was also a gem.  We used the upstairs, which had ample room for all our friends to mingle, eat, drink and even play some foosball and pool :)\nThe prices were great, the drinks were superb, and the people were happy.  We could not have asked for a better night. \nI highly recommend Buzzworks!", "author": "Uri L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "Cool bar and the service was good. Nice beer selection and some food options so you can snack while you have a drink. The bar tender was very friendly. Atmosphere and vibe was good. They have TV's and had football on. Later in the night there was a DJ (Friday night when I went), which I liked.", "author": "Christina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Good beer selection. The grilled cheese was solid. Pinball machine ate my quarters. I'd have liked it more if they served food later or given a warning that the kitchen was closing so i could get another grilled cheese order in.", "author": "Dakota S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "Really cool environment. There is multiple TV's and the views inside the bar are pretty solid. It has a cool balcony where you get a birds eye view of the bar and huge tv's. I watched football there and I have no complains. It was pretty full though, which made it kind of stuffy and hot inside. It's only beer that you can drink, no liquor. Hope this helps. Cheers!", "author": "Chris V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "Great beer selection and solid service. The only negative for me is they're a bar that plays the Tour de France on the big screen and speakers over the US men's team soccer match. I'll be back for a beer but not when a sporting event is happening.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "This place is a GREAT spot for grabbing a beer. The selection is wonderful and there aren't enough nice beer spots like it in the area (some but not enough). The pinball was fun, though overall games are a bit pricey. I realize they have a vendor come in and set them up (from the labels on the machine I'm assuming) but they are probably twice as much as they need to be.\n\nI'd play the occasional game of pinball and drink beer here no problem any day.\n\nThe only thing keeping me from giving it a 5 star review is the \"food.\" The $4 pretzels are a few medium size HARD pretzels that came out of a tub I'm sure you can buy at the store for $5. The markup must be INSANE and I'm surprise anyone could possibly serve them to a customer with a straight face. Especially when they give out mini hard pretzels for free. They could at least grab the \"Super Pretzel\" that you microwave. They'd still make money on them and they are actual soft pretzels that taste good.\n\nDO NOT order food at this place it is a complete rip off. Sad because they actually don't need to do much to make \"snacks\" profitable for them and worthwhile while not sucking for the customer at the same time.", "author": "T M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "5 stars for beer and sport lovers. Don't expect hard liquor or cocktails.\nFood below average. Same quality chips and salsa can be purchased from target. 90% sure their salsa is the Tostitos salsa you get in a jar. \nI do like the pool tables upstairs and the amount of TVs set up.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "FINALLY !  A  new and I mean \"New\" sports bar with a great  beer selection --  This is not some old failed bar with a new owner -- its fresh and new and everything sodding works from the toilets to the doors !  You lot know what I mean ..", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "Beer bar, super new. Great, airy, open space. Perfect for an afternoon drinking with your peeps. Nice selection of taps plus refrigerators of bottles. Can't go wrong!", "author": "Zach M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "This is the one of the best bars in the city! Exceptional selection, staff and atmosphere. Best place to catch the game and grab a craft brew!", "author": "Jeffrey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "What a great place! Excellent selection of beers on tap and a fantastic atmosphere. The food is really good and reasonably priced. Hang out and watch the game, or play a few yourself. Pool, pinball, this place has it all. Check it out if you can!", "author": "Damon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "honestly my favorite place - so many bomb beers. draft bottle whatever you wanna drink! games too - pool, foozball(??) anyways its great they totally want you to love beer. at least one. something's different and awesome", "author": "Taylor N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Super cool spot. Tons of beers, TVs, and games. If you need help picking your next. beer ask Lyle.", "author": "Bryan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Great place to chill and enjoy your favorite sports teams, inviting atmosphere, ambiance and decor on point, and the service is amazing.", "author": "Keyatta S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Fun vibe! Great place to come to watch a game or try a new beer. I love the foosball table! The staff is attentive and friendly. I'll def be back.", "author": "Jena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Man this place has got some great beer selections. Was super happy to stop in and grab a cold one and man it was like frosty cold was so perfect. Bartenders are super nice and know how to keep a good balance between keeping the conversation going and the glasses full. Love the look of the place as it is comfortable and love the old school games too. Met the owner who was really chill and treated you more like family then a customer. Will definitely be stopping by again soon.", "author": "Nathan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Great selection of beer and a great place to watch a game. Unique decor with custom welded bicycle frames is a great tribute to the industrial history of the area. The old school pinball machines are great!", "author": "Miles B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "I finally had a chance to stop by this fantastic new place. As a frequenter of their other bar, Butter, which I love for its trashiness, I was pleasantly surprised by the far less than trashy industrial feel. I'm not a big sports fan, but the video array there is top notch. The beer selection is unparalleled and the staff is perfect.", "author": "Jeremy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Variety is key at this place, lots of beers on tap and a great place to meet up with friends. Lots of activities, pool tables, video games and pinball. Best part are the screens, the huge screen over the bar is perfect for any game. Also plenty of tables to gather around and hang out.", "author": "Edgar C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Stumbled over here after hanging out at the SoMa StrEAT Food Park. SUPER cool place. All the employees are really nice and accommodating. And the bar itself is really cool, with a great beer selection. There pinball machines at the entrance and two billiards tables and a foosball table upstairs. Great bar, definitely worth checking out!", "author": "Vernon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "This place is amazing! 40 beers on tap and God knows how many in bottles.  They also have wine and champagne which of course I loved.  This place is the perfect place for football with 30 TVs with  plenty of room upstairs and downstairs to hang out comfortably for hours.  Staff is phenomenal and very knowledgeable.   I LOVE this place!", "author": "Jacqui D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-03", "description": "Great beer selection, cool games and an interesting layout.  \n\nThe suasages were ok and the service was very slow.", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "Found this place on the sports bar finder because we wanted to watch football without fighting for a seat. They have every game possible showing. They also have tons of beer on tap and the bartenders are friendly and knowledgeable. Upstairs they have pools tables and they also have a bunch of pinball machines which are really fun. I gave 4 stars instead of 5 because I have not tried the food so I don't know what that is like:", "author": "Jac E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "If you are a fan of fun and beer then this is heaven.  Amazing list of great beers on tap as well as a huge bottle lineup.  Is it NFL season yet?  I cannot wait to spend Sunday's here watching all the games.  Halftime?  Plenty more to do: pinball, pool and foosball!\n\nWhere have you been BuzzWorks?  Thank you!", "author": "Brendan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "This place is nice!!!  Love the pool tables, love the pin ball machines and lowdy lowd soooo manyyyy beerssssss....", "author": "Mark R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Great beer selection, good service.  Really liked the pin ball machines.  Would definitely recommend this place.  Will come again soon with friends.", "author": "Steven L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "New spot. It's super shinny. Lots of cold beers. Stuff to do and hella TV's. I can dig it.", "author": "nic c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "Pinball Pinball Pinball. It's the only reason I went there and the only reason I'll go back a hundred more times. It didn't hurt that they played DnB during the commercial breaks of a Giants game - that was a welcome surprise. Cool place.", "author": "Helmut R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Good times. Good beer. We found this place last weekend and totally love it. Staff is friendly but not so much that they are in your face all the time. Great selection. Things that you can't really find anywhere else. Thanks guys!", "author": "MixMaster W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "Glad it's finally open, great spot to meet new people. So happy it finally open, way better then all the hipster bars around the area.", "author": "Johnson W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "This place is super cool. Great selection of beer and fun environment. Definitely recommend coming by here for beer and snacks.", "author": "Maggie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Excellent bar, great food, beautiful women, great service...\n\nPerfect atmosphere!", "author": "Jade S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Buzzworks was a perfect venue for an event I hosted. The beer selection is awesome (tons of local beers on tap and an even larger selection of bottles available). Justin was very quick to answer any question I had and the staff was very accommodating.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "Very friendly bartenders who are on top of their game. They can recommend a beer for you whether you're a first time drink or a seasoned vet. Sports are always on the several tvs in the bar and I'll call it lounge spot on the second floor. They have the old school pin ball machines plus an awesome 'old school arcade' game. This place is a major plus in the SF SOMA area. Great service and great people. If you like sports grab a seat.", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Definitely fills a void in the neighborhood. Nice change of pace from fancy cocktails. Can be noisy, but people seem to be having fun and kicking back.  Really great energy from the staff - totally welcoming environment.  Plus, since there are so many beers to select from, they take the time to educate you.  Pretty new joint, but I think it's going to be successful.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "Had a really good experience here. This place just opened up and so far I'm loving the environment..I invited a bunch of friends to meet me here and they out drank me lol they loved it here! So many beers on tap..bottle beers..cans..Wine...and TVs every where...love the pin ball machines they added when you first walk in..there is also an upstairs we were excited to check out..pool tables and a fuse ball table..We will definitely be back here...it's baseball season now sooooo this is a go to spot for us", "author": "Stefany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "I like the spacious, well ventilated feeling here.  Nice bathrooms and the sinks are on the OUTSIDE, all bars should do this!  I go here mainly for the pinball, and sometimes watch the olympics on the plethora of screens they have up.  Everyone that works here seems really friendly, it's a good spot! (It would be nice to know what their hours are, I think they're still working that out...)", "author": "Mike A."}
