{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "I recently moved further down the block from this cafe.  During my move, it was my go-to lunch spot because it was along the way to my new apartment.\n\nI took my mom out here for lunch as she was helping me move.  She was pretty amazed that a tiny coffee shop would have good sandwiches, at a good price!  I've had several of their sandwiches, and I have never been disappointed.  The breakfast bagel sandwiches are standard, and a fast way to fill up if you're on the run.  They have other snacks available, like knishes and pastries.\n\nThere's plenty of places to sit, and there's many places to be able to plug in your device.  It seems to be a hangout for college students and writers, so it can be on the quieter side, which is a nice environment for studying.\n\nService has always been fast and friendly.  And they have free wifi.  If you want to support a local business, you should buy your next sandwich and coffee here.", "author": "Vira P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Great sandwich spot! I came here a few good times and never had any complaints. \n\nThe San Francisco Sandwich - It comes with turkey, bacon, avocado, lettuce, tomato, onion, pickles, Swiss cheese, mayo, all on a soft roll. I've never really met a sandwich I didn't like and this sandwich was no exception. Yum! Hits the spot and definitely gave me what I was looking for. Savory with a good balance of sour puckering from the pickles and onions. This is their most popular sandwich, btw. \n\nYou will pay about $8-9, but this is the city so it is to be expected.\n\nService was extremely quick and they do offer free wifi. The Café is large and very open. I usually get my order to go so I don't spend much time inside. The bathrooms are clean and they do take pride in making sure the café has a clean appearance. There is ample seating to choose from, so if you want to sit for a while to do some work on your laptop, it is a perfect place to chill. Parking can be a pain if the meters in front are unavailable. If I am in the area I like to visit this place before the local high school lets out. It can get a little overcrowded for a short period.", "author": "Ann S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-26", "description": "Terrible terrible place; got to the register to pay, there was a roach running around so I naturally screamed lol they looked @ me as if I was delusional even when I said \"there's a roach here please kill it, I can't\". The cashier was a young girl the fact that I had seen a roach did not seem to even phase her! Then the older guy wearing glasses came by, \"trying to look for the roach\" but every time I would point at the terrified roach he would move things around & be like \"where, where, I don't see it\".Finally, I got offended to have them ignore my concern as a customer. I said, you know you guys really have to catch it and kill it, specially since you serve food here  I walked off saying \"sorry, I just can't eat here, you can cancel my order\"", "author": "Celine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Cafe Enchante and its sister cafe, Cafe Promenade, are both great coffee / sandwich / work on your laptop spots. Good and very reasonably priced food, friendly staff, consistent wifi, and they're both open until 10 PM. I prefer the size and layout of Promenade, but it's a bit further out in the avenues.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "This place is so spacious and has lots of options for breakfast lunch and dinner or just dessert for a cafe. \nThe mocha I had was delicious. They have good service. This is my place to read a book and have a tea.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Amazing atmosphere for someone who likes to work out of a cafe. The prices are super reasonable, the food is delicious and there's always enough space.", "author": "Lucas T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "Help! My local Starbucks has taken out all their outlets!! My go to, Home Cafe is always crowded and I need to get work done! Enter Cafe Enchante. \n\nI remember stopping by this cafe on my way to do my first hike in San Francisco. The cafe had comfy sofas, lots of tables and wasn't crowded. It was such a pleasant space, a great pit stop for my tired feet and I knew I would return. Fast forward two years, here I am, right now - Cafe Enchante is saving my butt yet again. \n\nWith coffee and food offerings, outlets aplenty, and lots of tables/sofas - this is an ideal place to sit down and be productive. It's so rare to find these cafes nowadays. I really, really appreciate an establishment like this, and it feels welcoming for every type of person since there are different open spaces, high and low tables, quiet corners, sofa chill spaces etc. You can even play chess on some of these tables. But the major thing is - you can do work here. The coffee is pretty decent. The staff are welcoming and on top of everything. It definitely is a place to be enchanted by because spaces like this are getting to be more and more rare! So glad this exists!", "author": "Deanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Cafe Enchante is a great go-to neighborhood cafe. The bagel sandwiches are all delicious, the coffee is good, and the service is quick. This is a great place to grab a coffee and chat with friends or get work done if you need to. Casual and no pretension.", "author": "Josh P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "I've been working around this area for four years now and bare discovered this place! It is so cute and perfect to get work done.\n\nThe Menu offers anything from hot to iced coffee/tea, smoothies, breakfast, specialty sandwiches, veggies sandwiches, and wraps. They also offer cereal, bars, ramen, cookies, and other baked goods. The prices are also very reasonable. I ordered the Smoked Salmon Specialty Sandwich, which is probably the most expensive sandwich on the menu, and a large iced vanilla latte. It was $13 !\n\nThe environment is definitely a working place. Many many tables and sitting areas to do work in, have a small business meeting in, etc. There is music playing in the background, but it's not very bothering (at least not to me).\n\nThis place includes free WiFi, clean bathroom, and tons of charging cables. The staff is super friendly and amicable. They really make you feel like you're in someones home and that they will take care of you.\n\nSo happy I found this cute place, and will definitely be back!", "author": "Kassie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "Great selection of bagels and sandwiches, at a still reasonable price for the city. The coffee and drinks menu is what you expect in most cafes, but the London Fog is especially delicious! The real highlight of this cafe is the calm and cool atmosphere accented by the lovely french village charm of the themed decor. I can definitely see myself here often catching a quick meal, or staying a while to get some work done in the comfortable seating areas.", "author": "Adam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Love this neighborhood spot! Free WiFi means it's hard to find a seat sometimes if you're actually here to eat and chill but the made to order food is great to go as well. I recommend the smoked salmon sandwich, veggie wrap and all of the smoothies and coffee drinks. \n\nMy favorite part about the food is that any of the breakfast sandwiches can be made veggie style! \n\nThe staff is super friendly and remembers my preferences which gives it a welcoming feel from order to exit.", "author": "Natalie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Looking for somewhere to pick up food to take to the park, we happened upon this place. It was relatively empty for a Saturday afternoon which meant fast service. I got the San Francisco sandwich which was pretty big for such a decent price. We also got some slices of carrot and banana bread which were super soft and yummy. They have a huge selection of sandwiches and pastries so I'd love to come back to try more; their coffee too!", "author": "Pooja C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-08", "description": "A very cute hole in the wall coffee show located on Geary. A great place to study and do homework. The interior painting is spectacular and adds a very modern, artsy feel to it.\n\nWhen I walked in for the first time I got a ice coffee with vanilla and a French soda with peach, both of which were so good!\n\nService was very friendly and helpful when I asked them about what a French soda was and other details about their menu.\n\n\nTheir sandwiches are also very good and at a good price also! The breakfast bagel with cheddar and sausage is very good! I also ordered the lady lox bagel, and it had the most lox on a bagel Iv ever had.\n\nOverall a great,cozy neighborhood coffee shop with good service,food and drinks. Be sure to stop by for a warm drink on those cold San Francisco mornings!", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Great place to study, read, or work. Lots of space, generally not too crowded, and the wifi is excellent. Food is decent, not amazing, but also not expensive. I love this place because it's a good study spot.", "author": "Easton A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "I like this bright cafe. It has relatively large space with many small wooden tables. It has reasonable amounts of power outlets, decent home coffee and sandwiches. I do suggest it if you want to work for several hours out of your office/home.", "author": "Reza T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-13", "description": "The cafe is mostly excellent. It's some customers who are destroying the atmosphere and make some people uncomfortable. On regular basis a guy comes in with his kids. They take up both couches. They speak very loudly and then he is reading them some books and commenting on politics loudly. At least he and some other customers should see that most people are trying to read and study. It's just common courtesy. Some people just want to sit and relax and these kids and dad take up everything. Once again. This is not the cafe's management's fault.\n\nIn the evening you may often see various shady people come in and out. Watch your laptops.\n\nPlease make the coffee better. These days we know what coffee tastes good and what coffee sucks. Most of the time coffee here is ok. Not good but passable. It tastes like the beans weren't ground that day but instead tasted like stale old coffee from coffee that was ground days ago. Please, it's so simple. Just grind coffee beans in the morning or couple times per day. Otherwise everyone immediately know that the coffee is made from some week old ground coffee. If you charge full price almost like coffee chains then it should be little better. Sorry!", "author": "Monkey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "This is a great cafe for students. Prices are very reasonable. There is plenty of seating and plenty of outlets and extension cords. They have sandwiches, pastries, bagels, and the coffee is not bad. The ambiance is very calming, perfect for a first date. The area in the back looks like they turned the inside into an outdoor seating like space. Painted walls, a piano, chess tables, a fountain, like being in an indoor park area. Couches if you want something more cozy. They charge $2 for bathroom use to non customers though so don't come here if you just need to take a leak. Love it.", "author": "Tatiana T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Love this place. I stop by here every morning for a coffee and bagel. Super affordable and really kind staff. Great for doing work at too.", "author": "Taylor D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-31", "description": "One of my favorite places to study and eat. Sandwich selection is pretty good. It looks like it's run and owned by a family. Nice alternative to a chain coffee shops. Plenty of seating and really privacy oriented. I keep coming here for a few years and I see that a lot people work from here.\n\nPS Never order their cold wraps, flour tortilla was not fully cooked.", "author": "Sagdi F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-16", "description": "The coffee, sandwiches, and baked goods are all fairly decent, but what's best about this venue is the authentic neighborhood feel and vibe. There's lots of seating, colorfully painted walls, and the people who run this place seem authentically nice and cheery. Even if there are lines, they move fast too.\n\nCertainly a good independent alternative to a chain establishment.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "3.5/5- Rounding up because I do really like the decor of 80% of the room and there are a a lot of seats.\n\nWas looking for a place to study and decided to give this place a shot after seeing the gorgeous photos online. Unfortunately the photos don't necessarily show the corner you're more likely to end up sitting in (because of how busy this place gets) is poorly lit and looks like the inside of a janitor's closet. \n\nBut before I get into all that. This place does have plenty of street parking in the area, the service is not the nicest but they do their job professionally, there's plenty of seating, and there's free wifi. I didn't see any outlets in the area I was seated in (back, more dimly lit corner). And of course I love the atmosphere of the cafe. It has a whimsical pseudo-European vibe that lives up to the \"enchante\" name. The menu on the other hand is pretty straight forward. It has some sandwiches and pastries along with your basic cafe items. I ended up getting a matcha blended drink. It was fine. The matcha quality wasn't great but the drink was blended well and a had a good balance of sweetness. \n\nOverall, I do like this cafe. The drinks are nothing special but maybe I just need to try the actual coffee. I would love to eventually come back on a less crowded day.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Great location not far from Ocean Beach and Lands End, easy parking most days, very nice owners, easy on the Wallet, coupled along with great assortment of foods. \n\nPlenty of seats, couches and tables. I work in SF curtains days of the week so it is a normal stopping point for me to grab, coffee and log on to internet to get some quick work done.", "author": "Jonathan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Been here twice for some morning Bagel sandwiches. The lady behind the counter is always nice and helpful!\n\nBagel sandwiches are pretty good and filling! I usually get the Lady Lox which is awesome! Pricing is a little steep, but it's alright because it is convenient and tastes good.", "author": "James D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-28", "description": "The service was mehh for me. I placed my order and cashier kept talking and talking to her associate while the lady behind me was waiting to place her order and I was waiting for my latte. After they finally placed her order they continued to talk and forgot the lady ordered a baked good.\n\nFinally when I got my latte - it sucked. The latte lacked flavor and the milk was super dense. There was no love involved in making my latte, just talking.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "This is my favorite place in a town for tasty eat and spend friendly time . \nMy furniture store located in opposite street side and I business owner . During hard working day I would like to make a pause and I go in this Beautifull cafe \nI usually got Green tea and sandwich . \nAlso all my staff in business always go only there There is always all tasty , fresh  and quiet place with nice jazz music on a background , soft couches , and nice french oil paint  wall art with street in France picture on it   \nCustomer service incredible good , they all always smile and meet you like your part of them family !  \nI really recommend this place for Business meetings , relax tea or coffee time !", "author": "Marina S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-04", "description": "I've been here a few times now and it's a great local cafe but today I used their restroom while I waited for my food. It was recently cleaned and the floor was still really wet in places. I didn't realize this and slipped and fell fully on the floor. I'm fine so far, besides having a stiff neck and an achy torso from the fall, but someone could really get hurt. They didn't have a wet floor sign up in the bathroom and when I told both owners (I assume they are the owners) about my fall they both responded with \"ok\".  They didn't seem to care, so if you know people who go here, give them a heads up and tell them to be careful.", "author": "Molly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "One of the few places in the area that was open on a Tuesday afternoon.  There is ample seating, and the prices are very reasonable.  The sandwiches are delicious, and the bathroom was spotless.", "author": "Kathryn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "Busy, but still cozy and quiet Sunday night trying to do some studying. Clean. I didn't had to wipe my own tables. Coffee, hmmm, not the best, next time I'll order got chocolate. Power outlets for laptops, remember to bring your own extension. This might be my regular studying place now.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-10", "description": "Pros:\nGreat place to tuck away to get studying done. \n\nThey won't kick you out! You can literally hide all day if you wanted.\n\nGood mocha...very strong. \n\nLove the music - Michael Buble, Frank Sinatra and the like. \n\n\nCons:\nTables are small, can't fit a textbook + your laptop on it. You'll have to awkwardly juggle them between your lap and table.\n\nCredit card minimum of $5.\n\nNot the most trendy coffee shop in town, the newest, or beautiful. It is what it is.", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "Pretty decent availability of outlets for studying or working. Good selection of beverages and food. The prices were average.", "author": "Kristine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "First time here tonight. I recently moved to the neighborhood and was looking for a local place to do homework that also provides coffee, free wifi, plugs, and spacious. Cafe Enchante is a great place to grab a coffee and work. The vibe is chill, with eclectic decor that rings true of a local shop. Take the time to check out the place and support this local business!", "author": "Justin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "Had the breakfast bagel. It was okay and kinda dry. It lacked flavor. The cashier was nice.", "author": "Antonella H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "A real welcoming cozy cafe with free wifi, which is one of my favorite places to grab a quick breakfast or coffee at an affordable price. It's relaxing enough to check your emails and not overly crowded with stressed out people like you will find in other more mainstream cafes. \n\nI have tried their bagels and sandwiches and they are both excellent choices.", "author": "Melly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "My go to coffee shop now because it's right down the block from me and it's rather roomy.  Lots of plugs around the edges of the place and is relatively quiet for a busy place. The two others seem nice and keep a good smile even when they have to run around the whole day.  The furniture is a bit old but it gives character to the place.  I sat here one day for maybe 4 hours after ordering a chai latte and turnover, both good. They come around cleaning and wiping down tables when they aren't swamped with customers.  Ask them for the WiFi password because I didn't notice any signs and was too lazy to get up and ask so I just did stuff offline. Great place to escape to if you don't want to work at home!", "author": "Jasmine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-27", "description": "This cafe is cute in its own way with the different furniture, layouts, reading displays, and lights. The setting is calm and quiet, even when there are a handful of people sitting within different areas of the Cafe. When it comes to the quality of the drinks and the pastries, they are decent.", "author": "Stacey M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-23", "description": "I asked what brand they brew and the lady at the counter couldn't tell me. I asked and she gave me a blank face. I thought she might have not heard me and repeated myself. She replied \"coffee\". Duuuhh \n\nMy BF ordered a chia latte. The register said it was $4 but the lady charged me $4.30. I ask why it was more when the register read \"$4\". The woman said the register's screen was broken. What?!! I saw \"4.00\" but the tablet to pay w/ a credit card read $4.30. I immediately knew I was scammed. I get it, if you're going to charge me a convenience fee for a credit card - just be honest and tell me. Totally wrong and bad business practices.", "author": "Johan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "A neighborhood cafe with a lot of charm and personality! The walls a decked out with murals of French street shops and there are plants spaced all over. \n\nThere was plenty of seating, FREE wifi, and relaxing music to get work done. I felt really comfortable here and will definitely be back! There was a lot of options for drinks and light snacks, I only had the green tea while I was here but sure everything else is just as good.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-29", "description": "You can call it spacious, but it is a cell of coldness. I come here first time with my wife after dinner. We want to have some chat and rest and order a cup of coffee. I was too full and ask the only old lady there politely for a key to restroom. She asked, are you a customer ? Of Course, I said and pointed to the coffee we just ordered. She teased and said in a way you barely heard, You have two people but only one coffee, it doesn't count. \nOh my God. No comment for this kind of service. No mentioning the coffee is just so-so.", "author": "Wenhong X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-08", "description": "It's a decent place for study/work.  You've got plenty of tables and outlets to charge laptop/phones.  But the wifi is super slow (please upgrade) and ordering things can be a hassle.  So essentially this cafe provides a decent environment for doing your work but without wifi that works properly, it's kind of hard to do your work.  I use my phone's hotspot to connect when their connection drops which happens often.  Bottom line: if you've got your hotspot or are ok with dodgy connection, then this place will work for you.", "author": "Sami W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Great vibe in this spacey cafe. I met a good friend here, suggested by the high-rating on yelp, and it did not disappoint. Plenty of couches and room to relax or converse.", "author": "Eduardo P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "This is a charming coffee shop at Geary and 25th. Met someone here for a conversation and had a hot apple cider and a breakfast bagel with egg, sausage, and provolone cheese. It's clean and service is good.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-06", "description": "Super slow wifi, very unclean place especially the restroom, the elderly worker is very impolite... I'm not going to visit this place again.", "author": "Mel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-06", "description": "I really like this place. Affordable good sandwiches, great coffee, and really nice staff. \n\nMy only complaint is their use of the bug zapping tennis racket to zap the flies. Don't get me wrong, very clean place but have to think their is a better way to control the flies than exploding them over the food and coffee prep area. Hasn't deterred me from going here but thought they should know. My 2 cents.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "Great spot for coffee, and great customer service. All the staff are hospitable and kind.  Their espresso is strong and flavorful, perfect for my capp!  I like the hummus bagel, tasty, and its veggie friendly.\nFree Wi-Fi, spacious, and the ambience is relaxing.  Special thanks to Vanna for my mocha blend, and to Natalia who poured me a perf cup of cappuccino just the way I like: super dry!!!", "author": "Amerizza Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "Great selection, well priced, prompt, nice family that runs the place. The location is great as well, although can be busy in that area on Sunday due to church traffic.", "author": "Jeffrey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "I had the Chai Latte and it was really good. The service was really efficient and ambience is wonderful. It's the same as Le Promenade -- spacious, with couchs, different tables and many options of power outlets -- but somehow with a nicer atmosphere. \n\nThey were out of blended drinks, though. And there was a small fruit fly hovering over the pastries (no almond croissant for me). \n\npros: great for working, good service\n\ncons: out of blended drinks, fly on the pastries", "author": "Andréia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "Cute. Ok wifi and not the fastest especially if you do stuff like uploading. I like their russian cookies. Outlets arent bad but bring extension chord just im case", "author": "Jasmina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "PSA....please do your mouth a favor and order the San Franciscan sandwich!  It is one of my favorite sandwiches in ALL of SF, hands down. I used to live down the street from Cafe Enchante and would order this sandwich at least once a week.\n\nWhy are you till reading this-- you should be running there.", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "Very impressive. From first glances to customer service, it's the staycation spot I needed.", "author": "Angela F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-12", "description": "Decided to come here for a Sunday cup of coffee and wish I can rewind and never experience this place.\n-Staff speaks broken  English to the point of trouble with comprehension-I had to repeat each phrase two times\n-I said \"thank you\" after placing my order and staff did not give me the common courtesy of saying something along the lines of \"thank you\" or \"you are welcome\"\n-placed and order and one of the baristas clarified with me that the order is \"for here\". Then handler me  \"to go\" cups. No big deal. \n-Tables are dirty and no-one cares to clean them even once in a while. Crumbs, bits of avocado, droplets of spilled coffee. Polite request to staff to clean the table went ignored twice. No apologies or effort whatsoever to overcome this string of service carries.  \n-Cafe overseas a beautiful cathedral on the intersection of Geary/26th Avenue and yet all the windows are covered with some kind of plants that obstruct both the  view and natural light inside \n-this place has seating for 20-25 patrons and yet there is one single occupancy restroom that's perpetually occupied and requires and unsanitary key attached to a chain to gain entry.\nRespect yourself and do not come here if you want a cafe experience and not a run down coffee joint.\nCoffee was average.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Strolled in here for dessert on a double date with my husband and parents after eating at Jang Soo BBQ across the street. This place is absolutely adorable! I love how spacious it is and the Parisian theme is so pretty. We ordered chocolate mousse cake and dipped chocolate chip cookies with some decaf coffee and everything was delicious. The barista was very sweet and patient as well. 5/5 overall.", "author": "Hannah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-23", "description": "Pro: friendly service, pretty interior, nice music choice, plenty of seats, free wifi, lots of outlets\nCon: unfortunately coffee wasn't that good, my white chocolate latte tasted quite bland - too much water. \n\nOverall, I love everything else besides the actual coffee sadly (and I'm not a picky coffee drinker). Would love to make this a regular spot but I guess I'll just keep exploring.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "The people who work here are super friendly. There is a bunch of seating and ample outlets placed throughout. The wifi is speedy, craps out maybe a handful of times in the many times I've been there, but I think that's understandable for the amount of ppl in there, and it's been back up in a matter of minutes. There are sofas and tables for whatever you prefer. And the sandwiches are yum! So is the blended ice chai. There is rarely a good selection of chips however. Still love this place.", "author": "Fab E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "I love getting work done here. Lots of couches, light, chill atmosphere. Cafe is just decent- the food is like college food and you can tell they do the bare minimum but who cares? This is a fun, chill place to get work done. \n\nI like that the bathroom is clean and that people are respectful to each other. Very chill vibe without a super social atmosphere (unlike la promenade). \n\nI've had mostly teas here as that's what I prefer to drink when I'm studying. They have a decent selection.", "author": "Priya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "Cute little cafe right off the Main Street... love the internal  decor; Parisian vibes, high ceilings, a mixture of couches and tables. The music is very light and isn't overpowering which really allows you to work and study here if you wanted (plus they got free wifi!!!). They got food that's less than $7?!?? What place in sf can afford to keep the prices so low but give you so much?!! Bought a veggie bagel and added sausage (cuz I'm a rebel) and they did not skimp on the avocado. Mocha was really good too and they even nailed it with some foam on top! Best bang for buck in the area, for sure! I'll be back (like Arnold).", "author": "Kanoa U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "This place rocks!  Very difficult to understand how Vincent L can deem its sandwiches to be only \"fairly decent\".  The sandwich I just devoured was as good as any I've ever had - generous amount of ripe avocado, savory well-prepared bacon, cheese melted just right and the whole thing toasted to perfection.", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-16", "description": "This establishment is located on Geary Blvd and 26th Ave with only street metered parking that's fairly difficult to find (or if you're lucky enough to find residential parking). Very dim cafe with a pretty mural by the seating area. When you walk in, there's a sign on the center of the door stating that the restrooms were for customers only. For non-customers, there would be a $2 charge. That alone already made me hesitant to go in because it gave me a feeling that they would be a shop that is going to nickle-and-dime everything. I was in desperate need of caffeine though so I pushed my doubts aside and went in.\n\nMenu:\nCoffee Drinks: SML / MED / LRG\nHouse Coffee: $1.75 / $2 / $2.25\nEspresso: $1.75 / $2.25 / $2.75\nCafe au Lait: $2.25 / $2.60 / $2.95\nAmericano: $2.60 / $2.85 / $3.20\nRed Eye: $2.25 / $2.75 / $3.25\nCafe Latte: $2.75 / $3.25 / $3.75\nFlavored Latte: $3 / $3.50 / $4\nCappuccino: $2.75 / $3.25 / $3.75\nMacchiato: $2.25 / $2.75 / $3.25\nMocha:  $3 / $3.50 / $4\nWhite Chocolate:  $3 / $3.50 / $4\nCaramel:  $3 / $3.50 / $4\nVanilla: $3 / $3.50 / $4\n\nExtras:\nEspresso Shot / Mocha Powder / Vanilla Powder / Flavored Syrup +$0.60\nSoy Milk / Steamed Milk / Protein Powder / Breve +$0.75\n\nNon-Coffee Drinks: SML / MED / LRG\nChai Tea: $2.75 / $3.25 / $3.75\nHot Chocolate: $2.50 / $2.95 / $3.45\nHot Apple Cider: $2.50 / $2.75 / $3\nItalian Soda: - / $2.60 / $3\nFrench Soda: - / $2.85 / $3.25\nAssorted Tea: - / $1.75 / $2\nPot of Tea: - / - / $3\n\nBlended drinks: MED: $3.95 / LRG: $4.25\nMocha / Vanilla / Caramel / White Chocolate \nChai Tea\nGreen Tea\n\nSmoothies: SML: $3.95 / LRG: $4.45\nStrawberry / Peach / Mango / Banana / Pineapple\n\nGlass display stands next to the register with cakes and pastries which none looked fresh. There's a sign behind the cabinet advertising hot piroshki's but we saw them sitting in the case with an old grimy-looking microwave sitting on a small table behind the counter.They also have bagels and sandwiches (including paninis & melts) available for purchase.\n\nOur Order:\nBlended Mocha\nTriple Shot Espresso\n\nMy typical go-to drink is a mocha but since it was so hot that day, I wanted a cold drink. I should've stuck to my gut and got the hot drink because my blended mocha was a cup of sugar and hardly any caffeine. Should've just gotten that sundae at Twirl and Dip as it would've been a better use of my calories & sugar intake! =/ My friend had the espresso and poured some of it into my drink but it tasted like they burned the espresso and made the drink worse. My friend didn't care though because he can eat/drink nearly anything and doesn't know any better. ^^;;\n\nThe Chinese couple working behind the counter wasn't friendly or welcoming. Just there to work it seems. I have no inclinations on coming back.\n\n$5 minimum for credit cards", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "Great place to relax and get some work done. \n\nAnd, their sandwiches are simply amazing!!", "author": "Wayne A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-05", "description": "Good place. Comfortable. ATM. Take credit cards over $5. SF is a coffee city and the espresso drinks are not up to any North Beach standard. A tiny sliver of ice cold \"strudel\" didn't help. This is a cozy neighborhood spot to have a cup of drip coffee and hang out and know your money is not going to \"the man\" or \"the mermaid.\"", "author": "Brian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "Ok, I might be a little biased as this place is down the block from where I live but I come here pretty often to study and get my work done. I love their interiors and sometimes sipping my coffee here makes me feel like I am in Paris! :p\n\n They got descent speed free wifi, plenty of space, charging points and a regular coffee menu that you would find anywhere. I really wish they could have a more pleasant menu as I have to go out for lunch if I come here because my food experience hasn't been good here so far.", "author": "Pratibha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "this is one of my favorite coffee shops in the city. i used to come here a lot to study by myself or with classmates. the drinks here are cheap and there's free wifi. there's plenty of tables and outlets for you to use your electronic devices. there's also free self-served water. there's only one restroom but it's pretty clean. the staff is super friendly and nice. their hours are pretty good here. i've been internet-less for a while so i've been coming to this coffee shop to use the wifi. i'm not a coffee person so i usually order tea or something else. i ordered a medium size pomegranate & raspberry green tea which costs $2.01. i think that's a really good deal compared to most coffee shops. i definitely recommend this place as a good study/work spot.", "author": "Sylvia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-17", "description": "I had a veg sandwich called Monalisa. Tasted good. They could've done better in seats though, not so comfortable for longer hours.", "author": "Maulik S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Everything is pretty good food and drink wise. The place offers ample seating for groups and for when you're alone. Good sandwiches. They'll make all of their sandwiches into a wrap if you request it.", "author": "Jacob M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-31", "description": "The atmosphere is great for studying and working. Lots of computer outlets, tables and light. Drinks aren't good except the regular coffee. Veggie sandwich was ok, but the tomatoes weren't ripe yet. Service was quick but not overly friendly. Prices are good. Overall, not bad.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-26", "description": "Decent service. Mural inside was beautiful and WiFi worked fine. Minimum $5 for charge so 4 stars, but otherwise a great experience.", "author": "Bienvenido A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "I don't know how I ended up here or how I found this place- but this is probably the best coffee shop in San Francisco. Cheap prices, great food, really nice employees, tons of tables, tons of outlets, and really friendly people.\nSF secret bucket list for sure.", "author": "James H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "We all have off days, and perhaps that was true for both myself and the woman who messed up my order last time.\n\nToday she got it perfectly. A good lesson in how we should all be a bit slower with our judgements.\n\nBack to being my regular stop before heading to work.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "3.5 Stars. A neighborhood cafe that opens early, closes late, located conveniently on Geary Blvd, and has a pretty extensive drinks / sandwiches menu.\n\nThe cafe is spacious and comfortable. Plenty of seats/couches and WIFI for customers.\n\nLike some Yelpers suggested, they make a great Chai Latte! So creamy! Great Macchiato also. Good breakfast bagels and croissants to pair your morning cup of caffeine. This is not a destination coffee house but convenient to stop in if you're nearby.", "author": "Jing D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "I spend my life here studying. I've been to cafes all over the city in every single neighborhood because that's my life, studying. This place, hands down, has it all for someone who needs to get work done. Minus good food and quality coffee. Their food selection is pretty dull and the coffee is average, pre-brewed and sits in canisters. \n\nWhat they lack in quality food and drink, they more than make up in business as a whole. This place can stay surprisingly quiet even with 20 or so people, amazing. Outlets everywhere. Opens a lot earlier than most cafes in the city. There are 3 couches and 3 comfy lounge chairs. The music is always interesting and eclectic set at the right decibel. The staff can get a little flustered, they seem to always rotate like any other cafe. \n\nI wouldn't pick any other place to do work.", "author": "Elton F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-14", "description": "Had a bagel with cream cheese, tomato, avocado and sprouts.\nThe tomato was green (and it wasn't an heirloom) and the avocado was hard....as in totally unripe.\n\nLatte was fine.\n\nThe atmosphere was nice...this is a good place to study.  Next time I'll get a cookie or something. 3 stars for being a good place to study with coffee.", "author": "El B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "I love this place. Great to study. Really great sandwiches, like really great. I love the San Francisco. Coffee is only decent, but the price is right.", "author": "Julia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-12", "description": "Got work to do and can't make that happen at home? Enchante has your back. 10 stars for the couches and outlets and wi-fi, oh my! \n\nAll things considered and incorporated, a solid 3 stars for coffee, cheesecake, vibes, and creepy couch coverings. I like this place, but only because I can kick it there comfortably and indefinitely and not starve to death.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "My favorite place to work on papers and anything I've been putting off. I found this place off Yelp when I couldn't focus on my work at home anymore. Ever since I first came here, I've been hooked. Coffee is great (and cheap) they have yummy bites, which is great when you're here for a few hours typing away. Plus it's a super cozy feel, and it really is enchanting. The owners are super sweet, I've never had a bad experience. Another plus is that there's plenty of neighborhood parking, without meters or time frames, which is super helpful when you don't want to get up every two hours just to move your car.", "author": "Knar K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "Open early and closes late? Check (College Student plus)\nTable/Chairs or super lazy soft couches? Check! (My butt hurts after sitting in one too long)\nBathroom clean? yeah!\nSpacious Indeed! Probably 50 people could fit comfortably! CHECKK\nI loved their Vanilla Chai and that white powdered sugar Russian Tea Cake.\nFood and drinks seem fairly priced!\nGood music.\nFree WIFI.\nFriendly service.\n\nI'm lucky this is only 3 blocks from me :)", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "My coffee place, i go there twice a day, early morning and after work and its always full of people casually sitting and chatting or doing homework students or young professionals talking on tech meetings, in other words it's a great place to have a own \"Central Perk\" in San Francisco", "author": "Grigori E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-09", "description": "What more could you want out of an internet cafe?\n\nComfy sofas, many single tables for yourself and a friend, or just a whole table to yourself, cozy atmosphere, charming music, and a great menu with a bunch of tasty treats. I just moved into the neighborhood and I'm sure they're going to see much more of me soon!", "author": "Cara O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-07", "description": "Cafe Enchante has a nice rustic, old world feeling about it. seating looks comfy with the sofas, benches. saw pastry counter with pastries, bagels, crossaints, and pirosky someheres.\n\npour: la columbe dark roast (Lg, 2)\n-smooth with boldness, great coffee!\n-notice one can get  up to 3 refills for 85 cents?\n\ndrips:\n-nice older asian couple here\n-$5 coffee/bacon egg muffin.\n-regretted not buying anything  else\n-until i saw meter person just a few cars from my car.  (meter just expired).", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Found this hidden gem before catching the muni.  A family owned coffee shop that's clean, spacious, has free wifi, and a full menu of coffee and sandwiches.  What better way to spend my morning commute at this cafe just steps away from my muni stop.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "Good people work here.  Great service and friendly.  Good selection of food and coffee was ok.  I like the environment and there was a diverse crowd.", "author": "Bucky W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-25", "description": "Yep, the staff are nice enough, the red eye quite tasty and the room itself is quite spacious as pointed out by other reviewers.\n\nThis is certainly and rightfully a local gem but not a destination unless one has at least 2 other errands that bring you to this barrio.", "author": "Jay D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "I really like Cafe Enchante. Aside from the convenience of it being just two blocks from my house, the service is really quick and the people that work there are very friendly. I unwittingly went in there once 10 minutes before close, realized it as the woman was making my drink, apologized to her for being one of \"those\" people, and received a very pleasant smile and conversation from her, saying she was happy to make my drinks. Sweet lass. There is one woman who is always there when I go in for my Iced Caramel Latte (which is delicious) and she's very difficult to understand. But fear not! Once you become a seasoned patron like myself, you will understand this woman and your past miscommunications will seem so far away.\n\nAnyway, the food is pretty good and the portions are fairly large, especially for the price. My friend once got one of the smoothies and she has confirmed that it was very tasty.\n\nThe one downside to the place (if you want to eat in or drink your coffee on one of the many couches) is that the furniture has seen better days. Some of the couches look a tad on the dirty side and I've definitely changed my mind about seats that I've chosen because, well, who wants to sit on a dirty looking couch? Not this lady!", "author": "Stephenie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Best coffee shop around outer richmond. Coffee and sandwiches, cakes are good. Staffs are very friendly and place is very comfortable.  Love the jazz music that playels not too soft nor too loud. Love the place and best of luck to their business!", "author": "Stacy U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-28", "description": "Mediocre coffee but for the most part good service \n\nThe food is below mediocre and I was scolded for bringing in outside food despite purchasing a drink from them.\n\nPlenty of study space, good wifi, tons of wifi, and new furniture.", "author": "Cara J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Very cool coffeehouse with an awesome interior, cool jazz playing, and a piano. Outlets to charge up devices is very cool. Coffee is delicious and great selection of breakfast items", "author": "Dave G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "I love it here. The coffee is always fresh. The main reason I go here is because you can get a large iced green tea for $2!\nStarbucks always adds syrup to theirs even when you ask them not to. Enchante is far better than starbucks!", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "Staggered in at 9:00 AM jonesing for coffee. Super comfy place with couches, chairs, work tables with outlets and power strips everywhere. Excellent coffee and a really relaxing place. I could have easily fallen asleep. Good looking sandwiches and breakfast dishes. Good desserts.\nOnly negative was the stains on the fabric couches and chairs. Very good people watching place. I will return!!", "author": "Carol m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "It's only about time I give my favorite neighborhood cafe some Yelp love. I live in the area, and always come here when I need to get some work done. Its clean, spacious and has plenty of tables and outlets. WiFi is reliable. They don't play their music too loud (thank goodness).. Most importantly, I love their chai tea. I'm not much of a coffee person, but I've had plenty of teas from various cafes. Oprah Cinnamon Chai from Starbucks is definitely one of my top, but Cafe Enchante's Chai tea (Vanilla or spiced) is a true competitor. If you like chais--hands down,  you've got to try it here. Not into drinks? Their veggie sandwiches and bagels are pretty delicious too.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "Decided I was going to get some coffee before I went to work and get some work done. Never been here, but I'll probably be back. Ordered a Vanilla Chai Latte, and its very yummy! I brought debit so beware 5$ is the minimum so I ordered an onion bagel with butter. It was good, but they did over do the butter. It was dripping off the bagel, so I had to slightly undress the butter from my bagel. Other than that, there is plenty of seating, and the barista was sweet. :)", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Tea time tables.  Grand daddy desk.  Charger cord conundrum.\n\n \"Bay clubuh wis abocado!\"  Oh,that'd be me.  \n\nCollege 'study buddies', softwareprenuers,  backpack bookies.  \n\nElderly sidewalk evangelist, \"everybody loves me!\"  \n\nStill stalking my seat.  Sipping green tea.\n\nMy new office:)", "author": "Eric V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-04", "description": "This place has the worst service. The language they are speaking is not English for sure. I was barely understanding what was this old lady asking me. After I said \"excuse me\" for a couple of times this lady started repeating and shouting in that english of hers. I will never go here again.", "author": "Deepak S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-15", "description": "Coffee is not that good. They said it's free wifi and it took 15 minutes to load my email, super slow. Would not recommend for anyone who need high speed wifi or want to productively finish online works!", "author": "Tu Anh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "An unpretentious, sunny place for an unpretentious, foggy neighborhood. I love that Café Enchanté serves simple, fresh fare (like their delicious avocado BLT) and only a small sampling of complicated coffee drinks (frappés and dessert-like beverages). Their dark roast is sublime, their snacks are a great range of savory & sweet, and the staff couldn't be friendlier. I'm enchanted and this will be my neighborhood spot as long as I live around the corner!", "author": "Linnie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "This is a great place to study.\nThe person who was working, who seemed to be the owner/manager, was very nice.\nIt wasn't crowded and the place was clean.\nIt has that Outer Richmond/Geary vibe if you know what I mean.\nI liked it.\nThe drinks were good.\nThere's a sign that says it costs $2 to use the restroom if you're not buying anything.\nI saw a piano in there and was tempted to play it.\nI like how there were these 3 desks tucked away in the corner facing the wall. I sat there so I could really concentrate on something.\n\nBottom line--good coffee shop away from bustling SF.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-15", "description": "Chill, airy somewhat bohemian coffee shop in a neighborhood that doesn't have many other options. Cafe Enchante lets you fill up from the coffee thermos when you order a regular coffee. Relaxed atmosphere. My morning coffee and newspaper was only slightly marred by a schizophrenic woman who started rumbling through the cafe, fortunately the workers knew how to deal with her. I could see myself coming back if I lived in the area to get some reading or work done.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Great corner coffeeshop. Lots of seating and teas as well as Russian pastries (sweet and savory). Decorated in Parisian decor.", "author": "Susan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "A lot of cafes in San Francisco are small and a little cramped, just like the city itself. However, Cafe Enchante is expansive and comfortable. The walls are painted beautifully and it seems like there are plenty of places to sit.\n\nI got a pretty simple snack: sesame bagel with avocado, cream cheese tomatoes. Done great, but, not hard to mess up.\n\nWill definitely be back.", "author": "Sam D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-29", "description": "Charging more than what is in the board. The house coffee is almost empty while sold it without reminding anything plus dark stuff in the container which is very gross. Then my hubby was refused to use the restroom for not being the customer! Totally bad experience.", "author": "Winnie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "Really nice, asian-american family owned, quiet coffee shop good for working. Cheap prices. Great coffee, and not this acidic third-wave bullshit either. A++++ would be productive here again.", "author": "Steve Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "There are not many cafes on Geary that are spacious with LOTS of tables/seats, but Enchante is one of them so you won't feel claustrophobic, cramped and nearly pushed up against someone else.  There are also many electrical outlets so you can work on your laptop.  There are also sofas if you want to be comfortable and talk to your friends there.   It kind of reminds me of a french cafe if you see the decor on the walls.   The noise level is quiet to medium.  Their bathroom is decent and usually well-stocked with soap/tissues/towels.\n\nTheir wi-fi has always been good when I've been there.  Unlike Peet's also on Geary, Enchante doesn't limit your wi-fi to 2 hours before you get the signal that you have to buy more stuff to get another code which limits to you to another 2 hour block of time. \n\nI love their bagel sandwiches (esp the Le Jardin Bagel) and regular sandwiches the best along with their smoothies, various coffees, and cold blended drinks.  They have a LIBRARY of just about any type of tea you would want.  I like non-bitter coffees which is another reason I hate Peet's.  I prefer Starbucks sweet coffees, but when comparing beverages and food selection/quality with Starbucks, I find Enchante on par with, if not better, than Starbucks.\n\nThe only thing to beware of is of the various pastries inside their glass counter.  I don't know where they get their various pastries, but sometimes, they can taste pretty off like the ground beef piroshkies.  Also, there is a $5 minimum to use your CC, but they do have an ATM inside.  \n\nI wouldn't go out of my way to go to Enchante cafe, but if you're near Geary & 25th Ave, it's a great place to go to relax and use the wi-fi and get a good brunch or lunch esp since they open early 6am (7am on sundays) and close late 10pm (9pm mondays/sundays).", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "Nice Euro style cafe with sweet treats and pretty good coffee. Their Espresso drinks are better than in Starbucks. Well, it is not just a tall order. Pleasant service and atmosphere too.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-06", "description": "Great neighborhood gem and very nice owners and workers.  I've been coming here for years to do work on the laptop, free wifi and the food/drinks are affordable.  I usually stick with hot tea, ice mocha or chai... breakfast bagel or salmon sandwich and they are good.  The interior is nice with a parisian style and I learned that husband did most/all the murals.  The have a few sofa's and many small round tables (which can make it crammed) and recently added large community table.. plenty of outlets.  I do agree with a few reviews about bugs flying around which can be annoying but it doesn't stop me from coming back.", "author": "Patrick W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-02", "description": "Very good coffee, nice service, average breakfast sandwich.\nBig space, mixed crowd.\nUpholstered furniture is dirty and looks gross.", "author": "Bert V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "I haven't been to Cafe Enchante for many years. It's been so long in fact that I forgot I  used to come here to study.  I stopped by today to get some reading in and it's exactly the same :) Same owners (I think) who were friendly and had smiles on their faces for me. I also love their plush seating choices.  I just wish you guys were closer to me but that's no fault of yours.  A+", "author": "Katherine P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "I was so impressed with this little place it's so clean on the inside and the food is delicious and fast I highly recommend the turkey and avocado sandwich. If I lived in the area this place would be my only stop for sandwiches.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "Our home away from home. Love this place. Want it to get good reviews, so that their business continues to do well. Don't want everyone (except the locals) overrunning the place.", "author": "Lineka D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-03", "description": "It's not bad, it's not great. The coffee is scalding, the tuna melt was frozen in the middle but they do have ample seating, and free wi-fi, and lots of street parking. \n\nIf you want to get some work done in a cafe, this place is alright.", "author": "Tatyana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "To be fair, I haven't explored the menu beyond my usual hot chocolate or strawberry smoothie, but Cafe Enchante is a great place to go if you want to sit down and stay awhile. The couches make for a cozy spot to lounge with your laptop - or your friends - and in my experience, there's always seating available at the tables. The WiFi is fast enough to get work done and I've never felt pressure to leave before I'm finished. Enchante is the Geary Street's version of the \"Friends\" locale, Central Perk!", "author": "Vanessa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-07", "description": "For the UCB alum, while Cafe Enchante is no Cafe Milano and has a definite lack of freshly made salads and yummy red velvet cupcakes, their mocha is a definite thumbs up. \n\nSo, if you're in need of a caffeine rush like a crack addict feels they need that hourly dosage of crack, look no further, Cafe Enchante has your back. \n\nPS - You won't need to fight for a table and even more importantly, there's enough room that you can sit a table away from any non-desirables (creepers, loud music players, etc). Happy studying!", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "I like this place! Cozy, warm, mellow non-obtrusive but groovy (seriously, it's like the 60s up in here) music, lots of seating (I'm in a Lazy-boy!), great sandwich (the \"Golden Gate\" with hot pastrami). No loud talkers. Clean bathroom. It's a great respite from the frigid temps outside. I never think to come out here because it always seems foggy and cold, but an unforeseen upside is that it's perfect for getting work done because you have no desire to be outside! I was just going to pop in for an hour or so but since they're open til 10pm, who knows?? I might be checking out the Outer Richmond more frequently...", "author": "Ms. E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "$5 dollar minimum credit card purchase \n\nThey have an ATM\n\nTONS OF FLAVORS\n\nbreakfast sandwiches a plus!", "author": "Jorge D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-11", "description": "BLT sandwich is great! Fresh lettuce +1.\n\nTheir Latte is better than Cafe au lait.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "I just moved in the Area and my neighbor told me about this place...VERY NICE!\n\nI had the Ice Coffee and The Chicken Grilled Sandwich and my friend had Coffee with cinnamon and nutmeg with the Apple Strudel. \n\nCoffee Section is Great and the Chicken Grilled Sandwich was DELISH!\n\nStrudel looked like it came out of a box, but my friend loved it.", "author": "Franziska G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "We were going to go to Joe's for breakfast, but the line was WAAY too long and we needed coffee stat. Saw this place across the street and decided to stop in. \n\nFirst thing I noticed - the inside is WAY bigger than the facade lets in. The inside is very spacious with tons of seating, adorable paintings on the wall, free wi-fi, and awesome people. I immediately fell in love. \n\nThey have a variety of coffee's to choose from, as well as a ton of bagels and breakfast sandwiches. I had a perfect Vanilla latte, and a plain wheat bagel with cream cheese, but I guarantee I'll be back here for more. It's the perfect place to sit, sip some coffee, and read a book or catch up on work. A must do if you're in the area.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "Their ice coffee is just ok. It tastes like the coffee that I brew by myself. The wildberry cake is good. I like the atomosphere. It is good for studying or chatting. \nNice coffee shop, but I like to try others next time.", "author": "Ted C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "One of the nicest cafes in San Francisco.  The owner put some care into this place.  Couches, nice European bistro tables, Wi-Fi, well-thought out decor, well-lit, lots of space, and even a (working) piano to boot.  Sizable drink menu with fair prices.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "Cool place. Lots of tables. Sweet couches and couple of desks. Very spacious. Nice food options with a mix of Russian piroshki, bagels and noodles. No background noise or loud music. Most ppl are working / reading \n\nBut espresso is not great but much better than chains", "author": "Irina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "WHAT CAN I SAY... I'm a cafe dweller\n(3.75 stars)\n\nHave to appreciate good cafe's out there... sure beats Starbucks (sorry Mike if you're reading this, i'm just over your employer).\n\n- Food, yum\n- Coffee, meh decent\n- Prices, affordable\n- Service, good\n\nI've been here on several occassions and all have been satisfying. Working from home can sometimes suck and a new scenary is needed. I'd take my work laptop and come here to get stuff done. It's away from the normal loud cafes, it's spacious and comfortable, FREE WIFI, and everybody here is either studying, browsing the internet, reading, or simply just sipping coffee.\n\nHEFFER-STYLE STATUS.\n\nCHICKEN SANDWICH/PANINI  ($7 -i think) - Wasn't sure exactly what was ordered. But one time my friend and I dropped in here to grab some sandwiches before a hiphop festival at Golden Gate Park. I wasn't expecting it to taste good but it turned out to taste REALLY GOOD.\n\nLATTE ($2.50 - i think) - meh. had better. reminded me of gas station latte\n\nPASTRIES - The pastries here are really good. I've had a few kinds and all have done me justice while sitting here slaving away behind my laptop.\n\nWill I be back? I come here about twice a month to just get things done.", "author": "Jane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-05", "description": "I stumbled upon this cute Cafe in the Outer RIchmond while walking from the Golden Gate park to the Legion of Honor.\n\nI was impressed with the quality of the food. I did not have high expectations since coffee shops tend to specialize in the drinks.\n\nThe chicken sandwich came on the freshest roll and packed lots of juicy chicken and veggies. \n\nThe bagel enchante was pretty good too, but I recommend the sandwich.", "author": "Nina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "This is a nice, comfy, roomy, chill place to quietly hang out and do your coffee-drinking-web-surfing routine in the middle of the bustling city! \n\nYou can enjoy a couch, table and chairs, even bring your own chess pieces to play on a chess board table. If you get hungry, buy a nibble from the counter. \n\nAnd if the internet is boring, you can watch Chinese families argue outside the picture window, both from May Flower on the corner or from Kirin Chinese Restaurant next door. \n\nAiiyaaah!", "author": "Wanugee N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-30", "description": "This is a great cafe. They have a lot of seating and they have spent a lot of time to make it feel homey. The paint job on the back wall is adorable and very inviting. There are three large couches as well, which is always a nice change from hard wooden cafe chairs. Pre-made snacks are delicious. (I had banana bread that was wrapped in saran wrap as well as a turnover type pastry filled with mushrooms and cheese; both were very tasty.) \n\nThe only thing that is making me write a 3 star review instead of 5 stars is their use of the Executioner. (This is an electric bug swatter that looks like a tennis racket.) The Executioner definitely works (I know someone who uses this at home and it works like a charm), but it makes me avoid purchasing any of their pastries that aren't wrapped in plastic wrap or anything they have to prep on the counters. They wave the device right over the unwrapped pastries to zap any flies that have gotten into the pastry display. Yes, it's better to have a zapped fly than one that is alive on your food, but the idea of powdered zapped bug all over a croissant isn't very appealing either. I assume they are coming in through the door that is left open (probably for ventilation since the large picture windows don't open). If they could just keep that door closed, they would probably not have to use the bug zapper. It emits a loud zapping noise too, which is distracting, especially when you realize what is going on.\n\nI hope they read this because I think it's an easy remedy to fix by shutting the door. The staff there have all been very pleasant and I have seen them cleaning the tables off when they are vacant, so they strive to keep the cafe sanitary and clean.\n\n(I just realized that I had already posted a review before with 4 stars but wanted to downgrade to 3 stars since I recently saw them wave the zapper directly over the pastries.)", "author": "Judith D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-20", "description": "Could have been five stars except for the non-free WiFi. The good-sized blended mocha (not too sweet, not too bitter) hits the spot on a hot day.\n\nOverall a nice atmosphere, what with the French-themed murals and friendly staff. This place feels cozy due to the layout; two separate rooms with small chairs and tables. You can go in a group, but there's really no big-group seating.\n\nPlus, the infamous Geary Avenue parking. Yet, I will still return.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "I ordered the Big E with ham and Swiss cheese and a hot apple cider. Cost about $8. It was well worth it, great sandwich and the cider was delicious. Be careful with any hot drink. They make them quite hot, so it could stand to cool off for a few before sipping.", "author": "DeAnna U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-20", "description": "I might be biased because I only live one block away but this is my new favorite study spot! There are plenty of outlets and tables around so you'll probably have no probably finding a place to sit. There are also some couches for you to hang out at. I have noticed that some people come to just meet up with people for conversations too. That's usually fine because there's enough room in this cafe for you to distance yourself from people who may be distracting. \n\nThe coffee is fine for a neighborhood cafe. I'm simple with my coffee. I just get a small iced coffee, no milk with vanilla flavoring. A little less than $2.50 and I'm set for a long day of studying!", "author": "Connie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "A cute Parisian inspired cafe!  \n\nBesides being on the way to the Planet Granite climbing gym, there are a lot of things to love about Cafe Enchante.  It's the perfect little cafe/coffee house to get some serious studying done.  If laptops at coffee houses annoy you and you long for the days when people went to places like this to chat it up, then this isn't your place.  Everyone here is working away on their computers.  \n\nThat being said, this is the place to be if you need to get out of the house to get some work done.  They have a free wi-fi connection with none of those silly time limit rules, plenty of open spaces and tables for you to set up a workstation (or a few couches if you just want to get comfty), the coffee and sandwiches are tasty and affordable, the ambiance here is nice with the European touches, and the music is soft and unobtrusive.  Also, compared to most coffee houses in SF, it's a good size, and the layout is such that you don't feel cramped or overcrowded.", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-24", "description": "Mona Lisa makes me smile. This is their vegetarian sandwich piled high with sprouts, pepperoncini, red onions, roasted bell peppers, cucumbers, tomatoes, cheese of your choice inside bread of your choice. A couple times, I think during training a new hire, they put avocado in it.. I'd order it with the sandwich any day. I usually get the sandwich with provolone cheese on rye bread that is nicely toasted. I come here for the sandwich a lot, even skipping the coffee sometimes. Turkey wrap is good too but they could use better quality turkey and maybe provolone or instead of I think American that isn't that great with the hummus.\n\nCoffee is decent, not sure how often they change the dispensers but haven't had terribly burnt coffee from them. Get their chai since they use Big Train which is sooo good dirty (w/ a shot of espresso). Big Train is more like a sweet chai powder rather than a chai tea concentrate.. so don't expect the latter. It's the same brand used at Nordstrom espresso bars, which is delicious and they often sell it there.\n\nIt's a good space to study, lots of outlets and tables and big windows for natural lighting. All the good sandwiches/food/coffee/beverages can fuel you for hours, even all day. I just wish they were open late to serve all the students living in the Outer RIchmond. I'm not one anymore but it sure would've helped when I was. Also, beware parking.. This place is best to walk or bus too since meter parking is expensive and hard to find, unless you score a residential spot on 26th. Another plus is after a day of studying you can walk across to Tradr Sams for your reward. :)", "author": "Rachelle F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-28", "description": "It was one of those days... you know the ones.... its 2pm, your morning coffee has worn off and you're convinced that if anyone could see through your makeup into your soul, you'd look like something resembling the Walking Dead. \n\nno Starbucks or Peets in sight for 20 blocks..... so I decided to give this place a try. The interior is suuper cozy, and much larger than you'd think standing outside looking in! But on to the drink... I got a caramel latte, and crossed my fingers that it wouldn't be sickeningly sweet. She rang me up for something like 4 bucks (for a small!) and since all i had was a debit card, and they only accept those with $5 charges.. I grabbed a slice of banana bread. .... which was like another $3. \n\nBasically... the 4 stars includes interior, the vibe, the speed, and the taste of the latte which was BOMB. knocked a star off for the price.. for crying out loud, they're not some cute little hip shop in the middle of Financial District.", "author": "Alana V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-05", "description": "I think I must have ordered the wrong drink (white chocolate mocha) because it was super sweet and kind of artificial tasting.  The chocolate chip cookie could have also used 25% more chips to get to an appropriate chip to dough ratio (not a generous one, but an acceptable one).  \n\nThe other experience that made it 2* instead of 4* was that ... a crazy lady came in from the street and started berating me!  Total stranger, clearly not with it.  The cashier came over and shooed her away after a few minutes, but it was the longest few minutes of my life!  \n\nI did like that there were plenty of tables, plenty of power strips, and free wifi.", "author": "Olivia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-12", "description": "I came here to meet my friend while she's studying away for her midterm. I'm glad she introduced me here. I absolutely love the interior of this cafe! The French themed mural takes you to a whole different place. Very nice and relaxing cafe, with tons of couches and cute tables.\n\nHad three pots of jasmine green tea, a grilled cheese sandwich, and an absolutely delicious french soda :)", "author": "Linda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-20", "description": "Cafe Enchante has become my favorite cafe/coffee spot in my neighborhood.  In looking for a good place to work that gets me out of the house, this place has it all!  So far, everything I have tried has been great.  Whether it is a simple cup of iced coffee, a hot chai, or even apple cider, I have been happy! Finding a good cup of coffee in Outer Richmond can be touch-and-go, and this place is a go, Go, GO!  Enchante's foods and treats are also awesome!  I have tried sandwiches and wraps, and am gearing up to test some of the most \"authentic\" euro-themed treats.  \n\nNow, most important for me on a weekday is, can I work here?  The answer is a super-loud YES!!!! Cafe Enchante has free Wifi that actually works!!! I can even *gasp* open more than one webpage or play a video if need be!  In addition, there are plugs EVERYWHERE!  Grab a spot on one of the couches and put your feet up, snuggle in at a table for two, or partner up at one of the larger tables!  Also, the music isn't blaring or distracting.\n\nBasically, this place has it all!  And what's great, is the ambience doesn't come with a huge price-tag.  I love it so much I stop by on the weekends just to grab food or read a book.  Woohoo!!!  Thanks for existing in my side of town!", "author": "Sara W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-26", "description": "ambiance was nice.  great to study, people watch, or group meetings.  open till 10pm as well for the late studiers.\n\ndrinks.....hmm I mistakenly ordered a vanilla chai, which they use powder.  it was not mixed well and the undissolved particles slowly collected on the bottom of my cup.  \ni was not even able to drink 1/6 of it...\n\nmaybe next time ill get a cup of tea.  tea bags shouldnt be bad.", "author": "Linda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "great study spot with lots of tables and outlets. \n\ndirty chai and hummus veggie bagel was delicious.\n\nstaff is nice and welcoming", "author": "Nicki B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-06", "description": "This place is cool. A good study spot I guess. They have a good array of items and drinks but their food isn't something you crave or really want to run to either. It's more of a convenient neighborhood spot to grab a quick bite. It's just an average place really, worth a try.", "author": "Anonymous ?."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Hummus veggie wrap was alright. coffee is hard to mess up. but i loved the couches and chairs and overall great environment for reading...lovely", "author": "Alexandra R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "This review is for the chai latte: bomb. I mean, wow this is the creamiest most flavorful chai I've ever had at a cafe/coffee place. Thank you!", "author": "Cristina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-11", "description": "Potentially my fav cafe in the Richmond! Nice and spacious, quaint European-esque decor, comfortable seating choices, friendly service, original menu. Excellent place to grab a satisfying bite and chill with a laptop for an hour or two.", "author": "Brook R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-10", "description": "Enchanting.\n\nNice trick creating a Parisian themed cafe in what is often one of the foggiest parts of the city. Murals and fountains certainly add a whimsical touch.\n\nLikely holdovers from the previous Euro Cafe incarnation. Ambiance of course can only go so far. Enchante needed to deliver on everything else.\n\nThey do.\n\nExcellent coffee. One of my favorite cafe caffinations. Yes I just made the word up. Smooth and potent. Americano is less than three bucks includes your choice of syrup.\n\nMorning bites range from bagel creations to granola. No parfait available but you can build your own cheaper than elsewhere.\n\nLunch warrants another use of the word excellent.\n\nPlan was to take a sandwich bite, do some email, sandwich bite, email, etc. Turkey, veggies and hummus on wheat got my undivided attention till the very end.\n\nHappened on a comfy couch. With WiFi. Plenty of outlets nearby. Huge windows are a reminder of what outside looks like.\n\nOften it's enchanting fog inside a rather enchanting cafe.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-11", "description": "Cafe Enchante: it's becoming a second home for me. I don't care what people think of me vegging out on the couches. This is my chill out spot for me time.\n\nThey play good music. No teenage baristas playing Lady Gaga on their iPhones over the speakers here.\n\nF*ck yeah, free wifi! It's decent! Seriously, I tell all out-of-towners (couchsurfers, hitchhikers, the travelers who aren't tourists) to come to this place when they need to rest their feet and figure out their itinerary.\n\nThe coffee is not decadent, but decent for the price. Hey, it's cheaper than Starbucks by a dollar or two. F*ck it. 50 cent refills all day!? That makes it worth not buying a large if you're not sure you can handle the caffeine. Also on that note, the food is good. They make the sandwiches when you order them. Again, cheaper than Starbucks with more options.\n\nI like the plaaaaants. I like the faux European cafe atmospheeere. I like the cookiiiiiies.\n\nThe bathroom is a bitch to get into. I'm not a fan of that. You need a decent bathroom at a coffee shop. At least it's unisex?", "author": "Sterling D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-07", "description": "(deep sigh)... I was studying..  All of a sudden these two workers started asking me if I purchased  something.. I was going to buy something later on bt these two kept coming and asking me to buy something right away ..  I had been there for only like 20 mins.. Come on man!  Been there many times but was the first time this kinda shit happened .. made me upset n was huge turn off.. It should be up to customers when to buy food or drink..right? esp at the cafe..  They were keep saying that if ppl don't buy anything while merely using free wifi, then their business won't be successful. I was like DUH..totally understandable. But from my point of view, even those who don't buy anything but come just for the use of the internet might turn to be a positive influence and ultimately boost the sales of the store. For instance, what if those guys recommend this place to their friends for a studying place, or what if they write the positive reviews on Yelp which would be seen by many other ppl. They might not be buying anything at your store at the moment in a particular day, but they are bringing more customers in a long run. Business is all about word-of-mouth. Look at me, although I was really a fan of this place and used to recommend here for my friends and even wrote a positive review on Yelp the other day, now I'm writing a negative review and won't recommend to nobody!  Alrit ima off to Starbucks.", "author": "Ryoji T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "One of the best neighborhood cafes ever. LOTS of seating to accommodate any sized group or just you and your computer/book/thoughts. They have 6 different types of coffee (decaf, light, medium, and dark roasts as well as a hazelnut delight and a french vanilla). \nYou may need to take a minute to decide what you want to eat because they have such a long list of options !! The breakfast croissant is amazing, as well as all of their bagel sandwiches. Im also a sucker for their panini pressed sandwiches. Great smoothies as well!", "author": "Sara S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-17", "description": "Decent espresso, nothing special.  Clearly a place for those who enjoy 'chilling' at coffee shops, as the place was packed at around 7pm on a mid-week evening.  I'm not a coffee shop 'chiller', but I enjoyed the convenience of this place none-the-less, and I'll be back from time to time when in the area...", "author": "Andy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Very quaint and charming cafe. Nice staff with good coffee and decent breakfast food items.", "author": "Edwin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-03", "description": "I came here a few times and it's a cute, quiet coffee shop. Lots of seating and people busy studying or on there laptop or tablets. They have coffee and a variety of espressos, pastries, bagels, and sandwiches. I ordered a Caramel Macchiatto and it tasted good, but maybe I should of ordered an extra shot espresso to make it perfect. One time during lunch I ordered a made to order toasted turkey sandwich and it was hot and pretty tasty.", "author": "Anna P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-24", "description": "Ordered a macchiato and they served it up in a 10 or 12oz mug brimming with foam.  This is not a macchiato...I mean yeah I guess its espresso and foam, but it should be like 3 or 4 sips.  A star for effort I guess.\n\nInterior is nice though...", "author": "James Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "Have yet to find a better cup of hot chocolate then right here at this cafe :) I order it all the time. I've had the BLT here and it's good, it is thin straps and probably microwaved but I wouldn't expect much else from a cafe, the sandwich is still tasty. This place is great to sit and study, and has a calm environment! Only complaint I would have is I feel they could use just a few more outlet or extension plugs in a few areas to make it easier but usually I'm able to find a spot near an outlet", "author": "Terilyn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-26", "description": "Quiet, layed back coffee shop with plenty of room, polite and fast service. Pastry selection was limited. The coffee skill required to understand what you're ordering is medium to high. I'm no coffee aficionado,  so I ordered some strange coffee concoctions that was bitter. Overall nice.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "Friendly, low key place. Relaxing music. Nice mix of people- looks like everybody belongs here!", "author": "Mary M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-07", "description": "Ever since I've moved back from Berkeley, I've had trouble trying to find a place to go to whenever I needed to study. While there are plenty of cafes in the area, this is probably the best place to go to if you need to get your study on in the Richmond district.\n\nWith free wifi, plenty of tables as well as couches to lay, you really can't complain about this place. After my four years at Cal, I've been so used to trying to compete for a space at a cafe that it's actually kind of strange being back at a cafe where there's always going to be a spot available. \n\nAlso. There are lots of outlets available. *GASP*! \n\nI have bittersweet memories with this place as, I spent almost everyday here during the summer while I studied for the MCAT. blah. \n\nTheir coffee isn't bad though I didn't really like the strawberry smoothie. It was pretty watered down.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-18", "description": "This little cafe The Richmond epitomises what one would expect of a typical San Francisco style cafe:\n\nA nice selection of coffee, baked goods, bagels, and warm sandwiches\nFurniture for every occasion! (couches, coffee tables, armchairs, four-seaters, two-seaters)\nFree WiFi\nKind and relaxed staff\nGood crowd\nQuiet enough to study or do work on the weekends\n\nCouldn't ask for much more of a coffee shop!", "author": "Victor R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-01", "description": "PROS\n- The best part about this cafe is the layout. It's really big with several different sections that you can sit in. Also lots of different seating arrangements from couches to stools and high tables to individual cafe tables to desks. \n- The cafe has a lot of drink and food options. I've only ever gotten coffee so I can't really speak to the quality of the other items. \n- The staff is friendly and helpful.\n\nCONS\n- The worst part about this cafe is the internet connection. I had to leave after 30 minutes because I couldn't get online and that was really the only reason I was there.\n\n\nEnchante is a great place to come if you're planning to meet a friend and chat or if you want to read a book or do a crossword in a relaxing place. However, if you are going to a cafe to use your laptop, forget this cafe. Unfortunately, because this is my sole reason for going to cafes at the moment, I won't be coming back anytime soon...", "author": "Car C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "Trying to wrap up my thesis has made me a proud cafe worker. This is one of my favorite study spots. It's decorated in a really tacky way and it makes me feel cozy. Let me list all the positives for you:\n\n1. It has a million places to sit and plenty of outlets, I don't think I have ever come here and wasn't able to find a place to work, even on the weekends!\n\n2. Large windows make me feel less like a prisoner\n\n3. The food is actually pretty good for a cafe, I really like their Mona Lisa sandwich which is packed with veggies and is delicious\n\n4. The customer service is usually good. a handful of times I've experienced so-so service from one young girl but usually that is not the case. \n\n5. They don't try to kick your ass when you sit there all day working\n\n6. It's big so I don't feel trapped or like someone is constantly hovering over my shoulder\n\nThe only thing I wish was different was their hours...I work late and I'd love to be able to stay here beyond their closing time. But I guess some people like to sleep. Oh well.", "author": "Vanessa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-04", "description": "AWESOME spot to study, look at your mail or surf the net.\n\nThere's a lot of seats, a whole bunch of outlets and free WiFi! YES!\n\nIt's also really cozy in there. \n\nI got a BLT sandwich and a white chocolate mocha.  Both were good. I especially liked the mocha though! Grade A.", "author": "Marisa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "This cafe will always hold a dear place in my heart! I'm here whenever I need to get some work done on my laptop and I adore sitting in the corner by the window, listening to the pleasant french or classical music in the background with a veggie sandwich and hot cup of mango tea. The atmosphere and decor take me back to Paris. The staff is always really friendly as well.", "author": "Marina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "There, I feel like home! The owner is very nice, wonderful people! \nMy favorite sandwich : the Golden gate! \n\nDelicious!!! \nA place to visit for sure!", "author": "David A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "I wish we had more coffee shops like this in Los Angeles. I'm usually drinking either a double cappuccino or black coffee (sometimes sweetened). Their drips are served in big thermos dispensers (the kind you'd take to an outdoor event or picnic) so if you order a regular coffee, they're only going to hand you a cup. They have brown sugar which, IMO, is better than any other sweetener. The brew is strong and flavorful. Last time I got an amazing cappuccino which I swear I can still taste. The environment is very relaxed with plenty of seating. It reminds me an old library. We scored and sat on the couch, which probably could have been cleaner, but hey, it was still comfortable.", "author": "Armen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-04", "description": "I don't particularly like the look of the food that is served. \nThe couches are a little dirty looking.\nSometimes it gets a little too crowded/stuffy but clears out eventually.\n\nBut the hazelnut coffee is good.\nThe place is not expensive.\nThere is a ton of room and tables for you to get lost in your studies in.\nIt's a neighborhood gem, not your blue bottle. \n\nJust don't come here and bum off their wi-fi. I see you. I'm always there and I will kick your chair. Buy something you cheapo.", "author": "Jane T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-09", "description": "This coffee house changes names & ownership all the time.  Café Enchante doesn't seem that different from its predecessor, Euro Café, though it looks nicer now that they've painted a French street scene on the walls and added an indoor fountain (a little odd).  They also added some fake plants and replaced most of the furniture.  They kept the free wi-fi, ample number of power outlets, leather couches, bathroom and the ATM.  The wooden chairs aren't padded but they're not that uncomfortable.  \n\nThe menu seems similar (sandwiches, bagels) and the pastry and deli cases seem to hold the same items it used to (e.g., piroshky, cake, croissants).  The sandwiches didn't look bad.\n\nThe latte is good ($3.25 for a medium).  I wouldn't say it's amazing but it's solid (could use more foam/milk), fairly strong and not too bitter/burnt.  \n\nThe morning crowd seemed older and Russian.  One guy with a long beard and flowing black robe was probably a Russian priest from the church across the street.  Later the laptop crowd appeared.  The atmosphere is relaxed and quiet - good for work - plus some interesting characters show up.  I'm usually able to find unlimited free parking in the area (side streets).", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "Many a study dates here with friends and the boyfriend. A cute little place in the neighborhood. When you order custom drinks and the owners wife (small Vietnamese lady) works the bar, make sure you wait for your drink because she is so hard to understand! \nAnyways, wifi signal is great. Lots of seating. They have an ATM if you don't have cash!", "author": "Deanna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-08", "description": "I stopped in here for a quick bite on a Saturday morning and got the impression the community likes this cafe a lot. Folks were doing work, studying, reading, browsing, relaxing, etc. It seems well-loved and frequented. I got a latte and a pirozhok so I hung around while they heated the food. The women who prepared the order were pleasant and quick. I can definitely see myself stopping here again.", "author": "Yolanda Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-28", "description": "A very Euro feeling cafe with good coffee and lots of different snack good too, free wifi as well. I like the couches too, cool spot.", "author": "Christopher Steven O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-30", "description": "I'm at Cafe Enchante at least 1-2x a week since I work from home and only go to my office 1x a week. While I've been laying off coffee and caffeine for health reasons, I still frequent this place SO often for a nice calm place to work at.\n\nThe owners are great, I love the lady there she is sweet and cute and makes the BEST mocha's, I always look for her when I come in since her drinks are the best.\n\nThe other girls I've had at the counter are super cool too,  it's a great laid back spot with a nice ambiance, speakers with jazzy-alt music, a little waterfall, some plants and pretty murals on the wall that make you feel like you're in a European cafe (I've been to Europe, I can say this honestly).\n\nMy favorite thing to get? An iced mocha (or iced green tea) and a BLT. But the bagels are good and so is the Ham and Swiss cheese sandwich on rye/wheat.  What I like is that there is free wi-fi and you can sit for over 4 hours without them kicking you out or getting made you are using their plugs (my computer dies quick!) Plus there are chairs with tables, a few desks, fridges full of soda and juice and some sofas to sit and relax in too. The only thing I'm not a fan of is how you can obviously see a lot of people sitting and working/studying and some people give their kids free reign of the place to run around and scream. I understand you have kids but if you see it's silent inside, go away or at least get your drink and tell your kids to be quiet. \n\nAnyway, great place, I love it!", "author": "Diana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-13", "description": "THIS is what I'm looking for in a coffee shop!  Comfy couches, tasty coffee and treats, beautiful murals in a cozy, put-your-feet up atmosphere.  I love this place to study, journal, or meet pals.  The owners are also very kind and are involved in the cafe.  \n\nSo why not 5 stars?  It's kind of a pain to get to if you don't live in the Richmond and you take public transportation.  I would LOVE it if the owners would open a similar cafe in the Sunset. (hint hint, pretty please!)", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-15", "description": "Super cute cafe with a decent menu. The owners hardly speak English but it's cool because you somehow understand them and all the goodies are delicious. The only reason I give this place 3 stars is because one of the male owners/employees kept staring at me like I was stealing or something after I came out of the restroom. He suspiciously eyed me for about 13 minutes (I kept track) while I sat and did nothing. Made me feel uncomfortable. Good thing I'm only visiting town.", "author": "Auriel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "Thanks to Yelp, I came upon this charming hint-of-Euro-Disney-meets Friends' Central Perk cafe (the D-word might invoke a negative image to some, but it really is a comfy). This place is relaxing with large couches, a nice array of tables and chairs, lots of elbow room and a calming fountain.\n\nGood selection of savories and sweets - piroshkis, sandwiches, bagels, etc. Muffins, cookies, strudels - really good apple-brandy cake, coffees & teas.\n\nFriendly, neighborhood vibe - a good, casual place to study or catch up. Large windows to observe the Kingdom of Geary.", "author": "Cathy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-25", "description": "I like this place. But, for those of you with a keenly developed sense of coffeeshop vibe, it feels more like a downtown-SF corporate style place than a homey, local, college style place. For that reason, I only come here when I'm seeking that. There are definitely alternatives in the neighborhood. \n\nAs far as the actual comestibles go: the coffee is cheap and good-ish, although the staff always seems to get a bit disoriented, and the carafes are often empty. Pastries are so-so and best left unpurchased.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "I love this place ,  and overall it's a great place to study. It's chill, large, and full of seating and outlets. I'm no caffeine connoisseur, but every drink I've had here has been good. The food is also pretty good if basic, sandwiches and the like. It tends to be busy on weekends, so get there early if you're planning on studying.\n\nIn the negatives, it does have a $5 minimum for cards, but there's a grocery 1 block away that gives cash-back. The internet can also be slow and spotty, so it's probably best not to work on projects that require fast reliable internet here.\n\nOther than that, I would strongly recommend this place to anyone in the neighborhood. It's the best cafe for working in that I've found in the Richmond or even the city.", "author": "Ned D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-12", "description": "pros: hidden gem in inner richmond near the beautiful seacliff/china beach, lots of space, really quiet, really good hot spiced chai tea\n\ncons: the english muffin with egg, turkey, and cheese was bland and nothing to write home about. \n\nthis is my new study spot. huge fan.", "author": "Siva M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-18", "description": "Amazing coffee, delicious food, friendly staff and cool atmosphere.\nThey make great caramel macchiatos and mochas...they're my favorite bc they don't taste syrupy like starbucks drinks do!\n\nFood !!! the mona lisa is ssoooo good. and so are the bagel sandwiches. they do a great job and i have to say, the mona lisa with hummus is my favorite vege sandwich! \n\nthe staff is super friendly!  today, they didn't make me pay extra for hummus bc i opted out of cheese. i usually get charged extra even when i subtract things from the sandwich at other places. \n\nthe cafe is spacious with couches and cute round tables. i like the french themed wall paintings too.\n\nyou should definitely check this place out if you haven't yet.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-31", "description": "Lots of tables and couch options to camp out and hit the books for schoolwork. Very cool wall paintings too. A major plus for me is that it's near my apartment. There are so many outlets within distance of all tables.", "author": "Zard A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "I gave this spot four stars because you can really get some work done here. That said, it's not a cafe in the usual sense of the word. Sure, they serve coffee, they have those plastic wrapped pastries that seem to last forever. BUt last night, (Saturday, Nov. 22, 2014, I happened in here because I wanted to chill sans booze for a moment. Yikes. It was like that scene from Stardust Memories where Woody Allen gets on the wrong train, looks out of the window, only to see the then unknown Sharon Stone blowing him a kiss from the train on the adjacent track. So Allen gets up and tries to get off his train and onto that one. Only to find that he barely misses doing so as the trains pick up speed. Great for working. Do not come alone unless you are on deadline.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-04", "description": "I dwelled here during my days of unemployment.  Staff was always friendly and accommodating.\n\nThis place has a good buzz and is a comfortable place to hang out.  I'm not accustomed to talking to strangers in coffee shops, but I met some cool people here.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "This neighborhood haunt is roomy and sometimes busy, but it's good for socializing, reading a book, or browsing the web with the WiFi. Believe it or not, before it was even bigger - but the current size is just about perfect.\n\nToo often, the espresso drinks are somewhat bitter - a warning sign of inexpensive coffee beans. Drink a latte or macchiato here if you're not picky about taste.\n\nThe eclectic selection of edibles will have something for just about anybody. The interior is adequately lit, and the faux French wall decorations make it roomy and inviting. There's three couches...and even a small fountain.", "author": "Thirsty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "I LOVE this place, the staff are so friendly and always greet me warmly. I get the BLT or Bay Club on sourdough bread and they're both delicious - generously filled and yum. I come here pretty often to work and on weekends for lunch, and spend a lot of time in the cafe as it's homey and comfortable. Free Wifi is a plus too :)", "author": "Meg D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "Studying has always been a struggle for me, I have never really liked school but the reason i keep at it is I know that i need my degree in order to climb the ladder even higher. I never really developed good study habits but i find that i get more done when i am out of the house and at a cafe or the library. Cafe Enchante's location has changed ownership many times and i hope Enchante will be here to stay. They have decent coffee and drinks, lots of tables and free wifi! Cafe Enchante is very spacious and super clean. \n\nI recently started going here to study and find that it is a very good place to study since majority of the people in here are studying. You will find me here at nite, studying away or tapping on my laptop.", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-13", "description": "I've been stopping in here on occasion for a while now (at least the last three name changes), and I love the new look.  The tables are painted and decoupaged to go with the new theme, and the mural is georgeous!  There are many small tables and chairs and a few big comfy couches and armchairs.\n\nThe coffee is as good as any other cafe, and they have bagels, sandwiches, cake, cookies, soup, and sweet and savory pastries.\n\nWiFi and a few computers as well.", "author": "Miriam G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-23", "description": "Very chill atmosphere and music isn't so loud that it's bothersome. Their coffee is great and affordable and it's not your typical Starbucks that want to get you out the door unless you buy more of their stuff. I study here often and they offer free wifi to anyone who buys something off their menu.", "author": "Moses D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "Plenty outlets! A few coffee shops in the area either do not have working outlets or do not have enough. It's very spacious with different sitting options. And the coffee is pretty good too!", "author": "Morgan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-14", "description": "Sorry guys but I have to give you 3 stars, here is why, I ordered a macchiato which I never ordered before, the girl told me it's going to be a shot of espresso with foam and I assumed that is what goes into a plastic cup of different sizes but it came in just one very small coffee cup ( not plastic), what i really wanted is a coffee drink in plastic cup medium size, so I told her I'm sorry I guess I didn't understand you correctly can I order something else? she said sure, so I ordered another drink and she charged me for 2 items. I don't think starbucks or peets coffee would have an issue with substituting free of charge, well not at this place, girl said sorry I can't take it back ... O_O why not?? is it going to be a huge loss in money value to you? well you definitely just lost a customer. One more thing, their spinach turnovers are sooo greasy I could only eat half which I regretted later. The variety of food offered was almost gone when I got there by around 3:30pm, it had bunch of price sticks without much food left to offer.\nThe place itself is not bad, very specious and have nice soft couches, not crowded and the music is not loud, i liked it and if not for the service I'd come here more often.", "author": "Natalia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-04", "description": "Wow.  I really wished I lived closer to Cafe Enchante, namely for the reason of how open this place is for working/studying -- in fact, there were probably 25 people in there this afternoon, and it was nearly completely silent, and low music was in the background.  Amazing!  It's a student's dream to find a cozy, quiet cafe like this.  The coffee is good, too.  Hopefully I'll be able to come back sometime soon.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-24", "description": "Hey Buster K, her name is Briget. I asked because it was awesome being treated so warmly and attentively. I felt I should give praise where it is deserved. I'll go out of my way to grab a latte if I see she's working.]\n\nThe internet service is always working for me. It's too bad that one time someone came on an off night. Whoever you are, you might give Enchante another shot?\n\nThe coffee is great, as is the food. After trying the pastries a number of times, I say they're okay to pretty good (not great). In fairness, I come at night when the pastries may not be fresh. \n\nI LOVE the business hours and tables with room to really get to work. That's worth four stars. Briget earns the fifth. They will serve me latte's until the very last minute they're open and I love that! These are the main reasons that I come 1-3 times a week.", "author": "S S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-07", "description": "I've been coming here 4 days now and it's truly is wonderful.  They staff is very sweet and makes a decent vanilla soy cafe au lait.  It's sounds very LA but at the same time let me clarify I'm lactose intolerant and espresso gets me a little jittery.\n\nThe couches and heat are worth it alone but the faint pleasant music is an added bonus.", "author": "Ashley I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-13", "description": "This is one of those places that you wonder why you have never come to before.  It's spacious, clean, quiet and friendly. And there is free wifi.   The coffee here is very good, and the veggie bagel i had definitely hit the spot. \nWith the French Cafe album playing the background, really how can you go wrong.  The girls behind the counter are super friendly and the pastries looked really good too, even the vegan ones, which is usually an oxymoron.  Tasty Looking=Vegan?  Not in my book.    \n\nNothing goes better with coffee and a bagel than a little Georges Brassens, am I wrong, dude? Am I wrong?\n\nThe couches and big comfy, CLEAN armchairs definitely make this a place to come back to.  There are plenty of outlets and you get an interesting crowd.  Job hunters like me, older retired guys, and even the neighborhood Russian Orthodox priest.\n\nI'll definitely be coming back to this place.", "author": "Adam E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "Great place for working.  The coffee isn't single origin or anything but they make it rich.", "author": "Bob O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "The cutest coffee shop! Plenty of space, great to relax and study or read. Great coffee too!", "author": "Arye R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-01", "description": "Decent cafe, especially to work.  Large and open.\n\nLots of seating of various types (wooden chairs, couches, and even saw a comfy office chair) and tables (including a desk, in front of that comfy chair).  \n\nGood tea selection but haven't tried their coffee.  They had a good amount of pastries and quick bites.   Waitress was cute but apparently not enough to compensate for her rudeness that my friends experienced.  Maybe she was just having a bad day?\n\nPlenty of metered parking near by at night.\n\nDownside (to some)  is it closes at 10.  Upside... there's Trad'r Sam's across the street for after work/study drinks.", "author": "Young K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-14", "description": "I was expecting a crowd in the late afternoon but there's plenty of seating available. It's a little impersonal (the employee working that day started mopping around my seat soon after I got my order), dark, and the hot chocolate was the powdered kind.", "author": "Ericka V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "Greatest place every.  I always forget the wifi password, but the staff always reminds me what it is.  Plain understandable english. Not that hard to decipher \" SanFrancisco\". =)", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "Quite nice, honestly. I Iike how they painted the place. They have nice sandwiches too. I deducted 1 star because they always forget to refill the coffee and milk containers.", "author": "Juliana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-24", "description": "The first time I came here, the lady at the counter worked really slowly. Perhaps it counts as being very 'thorough' but I guess I'm more used to the fast-paced Starbucks service when they herd your through the shop. \n\nThe coffee was okay (if it was soley based on coffee, I'd give it 3 stars) but what did it for me for the tiny cafe was the decor. I absolutely love how the cafe is set up. You have to come here to see. There are sofas, couches, tables, desks, etc... so whatever setting you want to relax in, they've got it. And it's free wifi. Extra points for those who just want a nice local cafe to go study.", "author": "Andy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-20", "description": "Cute, corner coffee shop in the outer Richmond area\nHangout for students; there is a Wi-fi connection\nGood coffee/non-coffee drinks\nBagel and regular sandwiches; loved the Enchante bagel with cream cheese, turkey, and apple\nCool French/European motif\nSmall tables and lounge chairs\nFriendly service\nClean bathrooms", "author": "Rosquete B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-12", "description": "Don't know much about the in-cafe atmosphere itself because I always take my coffee and breakfast sammies to go, but two words, \"Big. E.\"  ok, maybe four: \"Big. E with Bacon.\" Affordable and yummy breakfast egg muffin sammies.", "author": "Geralyn Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-04", "description": "Best dirty chai latte I've had in the city hands-down. If you have a lot of work to get done or just wanna kick back and catch up with friends, this is the best place to go. The owners are adorable and sweet. I wouldn't want to give anyone else my money.", "author": "Stefani R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-03", "description": "Quiet, good music , descent coffee, wifi, good morning SF.", "author": "Gerry F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-13", "description": "Major plusses: \n* Abundant all-day (not even 2-hour) street parking, power outlets and wifi\n* Super friendly staff\n* Inexpensive menu items (I got a chicken sandwich for around $6)\n( Plenty of spots to camp out for long periods of time to get your work done\n\nOn the not-so-plus side:\n* Out of the way if you usually do biz downtown or in SOMA\n* A bit \"homey\" on the furniture side...as in, not sure what other creatures may be camping out in the musty couches with you\n* Food is worth exactly what you pay for it if not less (not even dark green lettuce with the sandwich and no accompanying salad or fries)\n\nBut they are so nice and it's so easy being here that I have to be this way and get some work done, I'll definitely consider returning.", "author": "Diane B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-29", "description": "I decided to stop by here because it was 20 minutes until the next 29 bus towards home, and I was freezing and a bit hungry too. I ordered a hot apple cider, then kicked myself mentally right afterward because according to most coffee places, apple cider means \"pour some apple juice into a cup and microwave it\". \n\nSo there I was, regretting my decision of ordering something that's already kind of unpopular and also out of season. I took my first sip. I wasn't expecting warm, almost creamy appley goodness in the cup. I opened the lid and looked in: three WHOLE cinnamon sticks at the bottom! DAMN GURL!! Also, I swear they put caramel in too, but I didn't see any.\n\nThe interior looks really nice. Comfy chairs, couches, and looked more like a big living room than a cramped chain coffee shop. I'll be back to enjoy it more when I'm not completely burned out from work.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-08", "description": "We came here because we were visiting the Holy Virgin Cathedral across the street. There were a lot of signs up that suggest that the average customer is perhaps not thoughtful - signs about bathrooms being for paying customers only, signs about refills, and etiquette, etc. I can't remember them in particular. The coffee was decent - standard fare in airpots. What we came in for was the wi-fi, which was strong. The ladies at the counter were nice. I got a rugulach which was yummy. If you plan on only buying a coffee, I would bring cash. I think they charge a fee for a small transaction. There were many folks there working on laptops. We sat on the couch facing the window, which was shabby and filled with crumbs but not dirty. I love the cute Parisian murals. Overall, this place is spacious, has free wi-fi and bathrooms with good service! Thanks Cafe Enchantee.", "author": "Nancy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-03", "description": "I have finally found a cafe that is conducive to my needs. It has lots of study space, free WiFi, your standard array of cafe' beverages, yummy chai, a good choice of munchies and above all else...piroshkis !!! Now, I don't go out of my way for these things, but when I had the beef and mushroom piroshki, I knew that this place and I were kismet. I know this because ever since my first one, I had to have another one. \n\n   I stocked this place for three weeks whenever I got a chance to pass by for another bite at this piroshki that I had to have a second take at. Each time they were out. There was even one time when I asked the nice Asian gal that was working that day,\" Where have all the piroshkis gone?\" She replied with a smile, \" The piroshki machine is broken!\"  Shucks!!! But finally, today was the day. Must have been the luck o' the GIANTS !!! I had one warmed up in house, two to go, and one for Mom. They are that good. So for a cafe that offers all that I mentioned with piroshkis, this is your place. \n\nC'est bon Cafe Enchante' !", "author": "Granolia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "Friendly service, slightly on the quieter side for atmosphere (maybe to accommodate the estudiantes who are estudying?), good coffee, and a good selection of snacky eats.\n\nNot only did they have the conventional types of table / chair setups, they had two full-on 3-person couches facing each other, separated by a coffee table.  I don't know about you folks, but I think that's pretty neat!\n\nWhile I can't say that the coffee was better than Philz, it definitely held its own... and being that it's a small mom and pop style shop, I give them credit for stickin' it to the MAN!", "author": "Johnson N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-20", "description": "this is one of my favorite cafes ever...and I go to cafes all the time\n\nI love love love their vanilla chais! I live right down the street and I come here almost every day to get one. \n\nprices are pretty standard for the area and their free wifi is fast even when there are 10 people in their on their laptops.\n\nAlso try the rasperry strudel....only 75 cents and absolutely delicious!", "author": "Chelsea C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-05", "description": "Enchante is one of those coffee places that won't steer you wrong. It's owned by a Vietnamese husband and wife. The wife is very sweet and friendly. The husband... not so much? He doesn't speak much, but he pretty much walks around the place and does frequent rounds to wipe water stains off your table. Don't mind it.\n\nTwo reasons why I really like Cafe Enchante: endless amount of seating and power strips. The coffee isn't the best, but it'll do just fine given the fact that I'm guaranteed a comfortable, clean, quiet, and great place to study for hours and hours. I like it here, but I wouldn't count on a great cup of Joe from Enchante. The coffee is mediocre, but I suggest coming here to get lots of work done for the day.", "author": "Linda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-19", "description": "A very comfortable atmosphere, it's a decent place to talk or bring your laptop and study. The prices are average and it's a very unpretentious vibe. The WiFi is reliable and there are plenty of electric outlets. The hours are fairly decent for San Francisco (it doesn't close early in the evening) but the background music, chatter, and refrigerators don't make it a calm place. If you bring ear plugs or headphones, you'll be able to concentrate better but you can make do without.", "author": "Al S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-10", "description": "I loves me some Enchante. This is my neighborhood cafe.\n\nIdea of bliss: vanilla latte, almond croissant, couch, book.\n\nEnchante has all of these things. And it is good.", "author": "Raymond P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-22", "description": "The perfect cafe. They use their space beautifully. I've sat in this cafe with a book for hours without feeling like I was taking up too much room. They make damn good cappuchinos and I adore their la panini (grilled cheese sandwich). The staff is professional and quick. Oh and my boyfriend and I have waxed poetic about how perfectly toasted their bagels are as well as their ability to always put just the right amount of cream cheese.", "author": "Angela S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-07", "description": "This place has a long overhaul history of owners from cafe euro to the enchante. Cafe enchante has made it at the top. Owners are friendly and so as people working there. I mostly see that beard man with black gown dress having good times. This cafe is for the diverse people. One complaint is that their wifii is like constipated at times. Other than that good ambience and good coffee.", "author": "Ogen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "10 Ruminations from \"Paris\", San Francisco\nLocation: Cafe...On - Sean - Tay\n\n1. cRaZy thorough mural of the Rue de la Paix in Paris complete with functioning lion water fountain.\n2. That clock on the top of the mural is not totally painted. Look again, that's the accurate time! Blew my mind balls when I realized it (3 hours later...)\n3. SEVERAL seats w/ mini tables for us 1 seater folk needing to finish that damn thesis, homework, etc. (There's even a couple office desks with those wheeled, leather chairs!?!)\n4. Big comfy couches for the socialites. \n5. Good for them for leaving power strips out so we all can plug in. \n6. Throw-back big band music with subtle notes of the shouting woman with the Chinese accent behind the counter (hahaha...Current song: \"Baby, it's Cold Outside\"....in June)\n7. Little passive agressive signs around reminding customers that life ain't free: Like: Refills: 0.85 cents...only 3 times per day! Bathroom, customers only..if not..\"TWO DOL-LAH. \" \n8. Coffee...look: it's got caffeine...it's definitely no blue bottle...but not bad!\n9. A bit \"bu hao yi si\" this afternoon with the loud arguing between owners and disgruntled patron in front of the crowded cafe...\n10. Great avocado sandwich with whatever else you want!\n\nIn Sum: I don't hate it. Great for studying...and making awkward observations. \n\nAll right, back to the damn thesis.", "author": "Patty Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-07", "description": "This place is nice!!!\n\nI didn't get anything from here, but Cafe Enchante made a pretty big impression on me!\n\nI love the decor; on one side you feel like you're out on a patio in Italy and the other side is like a regular coffee shop.  The walls have murals on them, the cafe has a piano, many couches, and computers in the back.\n\nTheir also a lot on the menu; coffee and food wise.  They have the usual espresso drinks (Lattes, Flavored Lattes, Capuccinos, Cafe Au Laits, Red Eyes, etc...) and the food choices were plenty too (Bagels, Bagels with cream cheese and tomato, etc...)  I wanted to get a bagel but their credit machine wasn't working =(.\n\nBut my friend did get a drip coffee and she said it was pretty good.\n\nThe atmosphere was very cozy and quiet.\n\nWill go again next time!", "author": "Tanya T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-23", "description": "Quaint and cozy, great for studying or a relaxing afternoon. Tall ceilings, art everywhere, and couches or tables to sit/lay on.\n\nEnchante offers incredible pastries, decent coffee and a great casual environment. The chai lattes (vanilla, sweet but spicy)  are phenomenal, but the brewed coffee comes from spouts on those massive thermoses you see at continental breakfasts. In all honesty it's pretty GOOD coffee, brewed regularly, you might just have to shake the container a bit before pouring to get the best flavor out of it :)\n\nBut a word to the wise, try the strudel (.75 a pop). omg.", "author": "Luke F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-12", "description": "This is a great cafe if you want a quiet place to study. They seem to cater to the laptop/wifi set, but they also have big comfy couches with ample space for bigger groups. Lots of beverage choices and sandwiches and snacks, too.\nIt is also half a block from several bus lines, which is nice.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-11", "description": "For a number of years, a friend and I have met here to play chess. We had no idea it was changing owners, we always thought it was comfortable, and now with new furniture, it is even more so.\n\nThe place is really spacious, lots of areas to sit and compute, couches, chess tables, good coffee (my latte was starbucks quality, yay!) and pastries (strudel was scrumptious) a clean rest room, friendly barista, self serve water, it's a good place.", "author": "Sharon J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-07", "description": "Rude, rude, RUDE!\n\nThe problem with first impressions is that you only get one.  I'm new to the city/neighborhood and have wanted to check this place out since I moved in because it looks really nice and I need a place to get a semi-daily coffee.  I finally did today.  The decor inside this place is really nice; it looks like some fancy hotel lounge from the 1920's.  The menu looks appetizing enough.  I decided on a small coffee and a breakfast sandwich.  When the redhead taking orders (who, mind you, has been mentioned several times in these negative reviews) waltzed up to the counter, she gave me no \"good morning\", no smile, no friendly look; nothing even in the vein of customer service or acknowledging my right to come into this establishment and be treated like a human being.   But, um, okay, whatever.  Start ordering.  Told her I want a breakfast sandwich.  \"What kind of bagel\", BARELY even came out of her mouth.  \"Plain bagel\".  \"What kind of cheese?\" she asked acidly.  I told her I wanted cheddar.\n\nNow, at some point during this transaction I became so insulted that I actually started to mock her voice.  I don't know what possessed me to do this, but it was a compulsion I could not control.  I'm not going to be treated like this and not do SOMETHING to fight back.  And it definitely was not lost on her because she stopped dead in her tracks. She must not be challenged very often.\n\nThe girl actually making the sandwiches was RIDICULOUSLY nice! I mean, maybe it was just by comparison though.  Because again, redhead obviously doesn't want to be there, thinks she's better than everybody else, and even wants you to KNOW that she thinks she's better than you.\n\nThe food and coffee itself weren't too bad.  A little overpriced for what it was.  The sandwich was made with care and I appreciate that they use qualitly ingredients and don't microwave everything.\n\nAgain, I'm looking for a REGULAR place to go to.  So if it hadn't been for the fact that their cashier (and, by default, face of their organization) hadn't made me want to slash my wrists, I'd be coming back on a regular basis.  But nope, I'm gonna go someplace else that actually treats me like a person and appreciates my business.  She needs to be fired.\n\nMaybe reverse roles of barrista and cashier?", "author": "Eric F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-02", "description": "I'm taking away 2 full stars because of the nasty redhead who works there.  Everything else is fine- friendly people, good sandwiches and drinks, plenty of comfy seating.  But that redhead is so sour.  She slams your drinks down on the counter and scowls the whole time.  When you approach the counter she doesn't even say hello, she just stares until you order.  I wonder how the owner tolerates such unpleasantness.", "author": "Theresa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "So let me preface this review by saying my experience today was 5 star but I am averaging it with a couple of my previous encounters with this cafe. I almost walked right past it today like I have done many days since my last visit where I was treated rudely by the young asian girls who normally work in the morning. I feel like they would be perfectly happy not to serve anyone who comes in. The are always sitting down behind the counter talking which is fine but please don't look so put out when a customer comes in. Its your job.\n\nThis morning was a whole different experience. I wish I asked the girls name behind the counter but she was a breath of fresh air big smile very attentive and helpful. I will be back come now. So to the redhead thanks for making me feel so welcome.", "author": "Buster K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-30", "description": "Pretty cute cafe! Went here this morning and tried the \"elvis bagel\".. it was really tasty!! My experience would've been more enchanting if the lady at the register were nice and there was more selection in pastries. I asked her what was in the turnovers and she looked at me like i was weird and said, \"jam!\" Geez!! Will i go back? Sure.. as long as she's not working..", "author": "Mertani G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-04", "description": "Came here late night for a coffee craving.\n\nPretty cool place with a great atmosphere. Lots of big comfy seats, free WiFi I believe and also wall murals.\n\nNice menu which makes it so you can have funky coffee drinks. All in all a cool little experience was had here. I will be back. I still want to try a banana latte.", "author": "Anthony S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "Cafe Enchante is my home away from home - I live a couple blocks away so its very easy to get to. Everyone who works there is friendly and if you like and its not busy will even chat for a few minutes. Like in \"Cheers\", they \"know\" my drink before I get up to the counter. \n\n I usually sit in the front on the tall round tables, so I don't get quite as much of the \"were in Europe feel\", but the decor is very cute. (I like those front seats if I'm going to be sitting for awhile).  You can sit there for several hours and no one minds  (we want the place to stay in business, so make sure you are refreshing your drinks as the time passes.)  There is plenty of seating, lots of outlets and free wifi.  They have food, maybe not brilliant, but good for cafe bagels and sandwiches. They even offer a few options beyond the usual coffee house wheat fest.  The restroom is very clean and the music options are often entertaining... \n\nI find I can get a lot of work done here and highly recommend as a nice, clean (important to me), comfortable  place to come.", "author": "Debi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-11", "description": "My favorite cafe so far. The new owners really spiced the place up with their wall paintings. Looks excellent. Great vibe. Good atmosphere and the owners took effort in supplying more plugs for us old laptop owners who have batteries that don't last longer than 10 minutes. I frequent this place a few times a week. \n\nI've seen people get yelled at for not ordering anything and just sitting around soaking up the free internet. Well deserved. The \"customer\" buys a bottle of water, never drinks it and leaves it there when he leaves. Making a statement? He should know better. Cafe seating is for customers only. Duh. I usually get up every couple hours to buy something else if I plan to be there awhile.", "author": "Brian Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-17", "description": "Cafe Enchante serves good coffee and pastries in the Outer Richmond.  I think this place has changed ownership a couple of times.\n\nNot wanting anything too complicated on a Sunday morning, I order a drip coffee plus blueberry coffee cake.  The drip coffee was better than average, not great but good enough.  Their coffee cake was surprisingly good as it was more crumbly top than cake (the way I like it).\n\nYou should know that their used to be a cellphone store adjacent to the previous coffee house owners.  It was a strange setup, but to each their own.  Today, the space is more seating for the coffee house but with a special twist.  The areas has walls that are nicely painted to give the feeling of being a French cafe.  Whoever the artist was did a great job painting the walls - a must see!  \n\nCheck out Cafe Enchante when your in the Outer Richmond - 3 stars for food/drink plus another star for the wall paintings.", "author": "Janet H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-12", "description": "I loved this place when I was studying for my lsat. The coffee is good and so are the sandwiches. My favorite one was the golden gate?? Turkey and deliciousness. One of the best sandwiches I've had in sf thus far..really! Too bad I don't live in that area anymore :/", "author": "Cesie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-28", "description": "I was irritated from having to drive around the block two or three times in the rain so having been texted, \"meet me at the enchanted cafe\" made for high expectations. \n\nAnd...they were met!  This cafe  is a delight!\n\nIF I lived in the area, I would be here writing Yelps or working from Cafe Enchante because it is quiet, cute and spacious.  The coffee was good and if I'm in the area again I will definitely return.", "author": "Sarah Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "I absolutely love this place!  I went here almost every morning during my vacation to visit my  brother and sister-in-law.  They live on Balboa, so it was a nice walk.  The coffee is excellent and strong, even the medium roast!  Cafe Enchante is very clean and the workers were nice!  The atmosphere is great and relaxing.  Also a great place to do some work or meet up with friends.  I miss my trip to the cafe now that I am back in New York.  San Francisco knows its coffee!", "author": "Virginia W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-16", "description": "Awful chai latte.\n\nThe interior is pure cheese.", "author": "Jack K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-12", "description": "It was Saturday morning in the Richmond district right before \"dim sum hour\" starts. I barely had to circle the block and almost immediately found a parking spot two blocks from the Enchante. That, I must say, is amazing. \n\nThis was my first time visiting Enchante. As I walked into the big open space inside, I was happy to see that there were plenty of tables to sit at, power strips a few feet from each table, and wide windows that brought in natural lighting from outside. Good interior, Enchante!\n\nCoffee was just \"ehhh\". It tasted a bit... sour. Not sure if I've ever had sour coffee, but perhaps it was just the type of coffee I chose that morning. I'll give the coffee another go or just get a hot apple cider next time. \n\nExcellent staff. Restrooms were okay.", "author": "Teresa Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "Really great cafe for studying. There was tons of seating and it was very quiet and easy to concentrate here. The decoration is really adorable and very cozy. Free wifi was a little slow but other people didn't seem to have a problem. Really good selection of drinks and food. I got a pot of tea and it was really big so I got my moneys worth. I also tried the Mediterranean turnover they had in the case next to the register and it was really yummy. Service was a little slow, but workers were really nice and I like the place so much I won't dock a star for that. Great place, I will be coming back!", "author": "Julie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-07", "description": "Will not return. Ordered a latte but the person obviously didn't know anything about coffee. She got me something between a latte and cappuccino instead. The foam was horribly made too. I came here last year and it was totally different now. If you just need free WiFi and a place to sit, you might like this place. But not for coffee lover.", "author": "Vic L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-07", "description": "removed 3 times, about the redhead, mental case.\n\n1, The food is not so good, and the customer service is terrible. \nThey will blame customer for their own mistake.\nI'm taking away 4 full stars because of the nasty redhead who works there.  Everything else is fine- friendly people, plenty of comfy seating.  But that redhead is so sour.  She slams your drinks down on the counter and scowls the whole time.  When you approach the counter she doesn't even say hello, she just stares until you order.  I wonder how the owner tolerates such unpleasantness.\n\n2,Will not return. Ordered a latte but the person obviously didn't know anything about coffee. The nasty redhead who works there, she got me something between a latte and cappuccino instead. The foam was horribly made too. I came here last year and it was totally different now. If you just need free WiFi and a place to sit, you might like this place. But not for coffee lover.\n\n3.Rude, rude, RUDE!\nThe problem with first impressions is that you only get one.  I'm new to the city/neighborhood and have wanted to check this place out since I moved in because it looks really nice and I need a place to get a semi-daily coffee.  I finally did today.  The decor inside this place is really nice; it looks like some fancy hotel lounge from the 1920's.  The menu looks appetizing enough.  I decided on a small coffee and a breakfast sandwich.  When the redhead taking orders (who, mind you, has been mentioned several times in these negative reviews) waltzed up to the counter, she gave me no \"good morning\", no smile, no friendly look; nothing even in the vein of customer service or acknowledging my right to come into this establishment and be treated like a human being.   But, um, okay, whatever.  Start ordering.  Told her I want a breakfast sandwich.  \"What kind of bagel\", BARELY even came out of her mouth.  \"Plain bagel\".  \"What kind of cheese?\" she asked acidly.  I told her I wanted cheddar.\n\nNow, at some point during this transaction I became so insulted that I actually started to mock her voice.  I don't know what possessed me to do this, but it was a compulsion I could not control.  I'm not going to be treated like this and not do SOMETHING to fight back.  And it definitely was not lost on her because she stopped dead in her tracks. She must not be challenged very often.\n\n4.Ordered grilled cheese sandwich and got food poisoning. REALLY bad, Up-All-Nite food poisoning. Terrible. But a decent enough place to do some work. Will be bringing bottled water and eating packaged granola bars from this place from now on, though.\n\n5.I have been to this cafe multiple times foolishly thinking ( or hoping, maybe) that their poor service was just a matter of circumstance on that particular day- I was wrong. The chinese lady behind the counter creates a confused and chaotic energy because she doesn't know english and can't understand and provide what the customers need. The cakes are really old and dry and the cookies were moldy- no penicillin for me thanks!\n\n6.I live near this cafe and I love going here to do some homework or research when i'm sick of being inside my house. It's so near. I've been here to get drinks, and it was great. But not until today, that all has changed for me. I only give this 1 star because of the great homey interior feeling. I ordered a chicken sandwich and as I took a bite and lay the sandwich back on the plate, I saw on the other half of my sandwich there was a long strand of hair. I walked disgustedly and unimpressed and told them that there was hair on my sandwich. They took the sandwich and said sorry and smiled. I'm cool with getting a new one, but as I walk away I hear them laughing at the hair while they play with the strand and see how long and what color it was. It was gross. If this was a great establishment, they would've accommodated me better like other places. BUT NO! I don't think I like the service that was provided here today.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-02", "description": "Came here during The baby shower Ricci threw at our house.\n\nGreat little place to have some good coffee or tea and read quietly.  Free wifi and comfy seats make it a great place to spend a few hours in the neighborhood.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-02", "description": "It used to be Cafe Mono, then it was Cafe Europa, and now it is Cafe Enchante.\nI did not frequent this place in the past so I can write an unbiased review not comparing it with the past establishments.  I guess Cafe Mono was okay..don't remember much about it anymore though.  \nAnyway, Cafe Enchante is a pretty nice spot to chat or study.  It's located at the corner so it's convenient too.  Mochas are pretty good here and the servers are nice enough.  I like that I can study here all day too!  The place is spacious and clean. Clean bathroom and nice ambiance in general.", "author": "Tu L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-20", "description": "Why would ANYONE operate a \"coffee house\" and serve crappy coffee? I just don't get it.\n\nI keep on trying this place - in the unrequited hope that I will actually get a good cup of coffee here one day. It just doesn't happen. I \"beef-up\" a coffee with a shot of espresso, just to get it decent enough to drink.\n\nMakes no sense to me.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-04", "description": "Roll out of bed and\nCome here almost everyday\nCafe Enchante\n_____\n\nThey've been through three names in three years, it seems, but each iteration of this Cafe is a little better than the previous one.  I used to only pop in on my way to work while waiting for the 38 Geary, but lately I've been their best customer.  They have free wifi, and since I'm funemployed and without internet at home (and I don't cook), I roll out of bed around noon, come to Cafe Enchante and get coffee and food, and spent the next 7-8 hours applying to jobs all day long.  The staff are nice and don't seem to mind at all that I'm a total internet mooch.  I also haven't had anything stolen yet, even though I walk away from my belongings to go to the potty all the time.\n\nTheir food and coffee are pretty good and reasonably priced, but nothing worth driving all the way across the city to try.  The main draw is that their internet is truly free and fast and there are always a few empty seats with a nearby electrical outlet.  They also play decent elevator jazz to soothe my nerves as I type in my employment history for the Xth time of the day.\n\nThanks Cafe Enchante.", "author": "Jin D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-11", "description": "Don't order the hot apple cider.\n\nIf you choose to do so, you can look forward to drinking store-brand apple juice, microwaved, with a cinnamon stick dropped-in.\n\nOh, and if you mention to the manager that the \"hot apple cider\" was actually just warmed-up apple juice, they'll let you know that that iiisss apple cider. Well, gee thanks for the clarification. I'll just spit out the hot apple juice now.", "author": "Meg M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-06", "description": "Coffee is okay. Asian Baristas are cute, nice and friendly. Love their selection of Tea's and Tuna Sandwiches.  Internet can be slow sometimes - owners should buy a new/better/stronger  router.", "author": "Craig H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-03", "description": "Cafe Enchante -- I'm enchanted.\n\nThis café is adorable.  And spacious -- a rarity in San Francisco.  I've been coming here as an alternative to Simple Pleasures Cafe, which has a very different vibe.  The crowd here seems a bit more studious and less chatty, at least during the daytime.  I like the decor, the European-looking mural, and the eclectic (but not too eclectic - aka chaotic) assemblage of furnishings.\n\nI'm pretty discriminating when it comes to coffee after living in Seattle, but I'll admit to occasionally drifting back to my Midwestern roots and I'll go for the lighter, flavored stuff; Cafe Enchante has Hazelnut and Vanilla Nut as drip options, in addition to the more standard grounds.\n\nThey also have a good assortment of snacks.  I usually order a bagel with cream cheese, though I've had my eye on the savory turnovers and piroshkys ... yum.\n\nMajor brownie points for the clean environment.  I regularly see the staff wiping down tables and sweeping the floor.\n\nThe only thing this cute coffee house is missing is a certain buzz that I seek in a cool neighborhood shop.  I think Cafe Enchante just needs time to generate a stronger identity.  Hopefully, it will get the chance to establish itself.", "author": "Jamie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-04", "description": "I like this place. I've gotten the brewed coffee and iced tea. It's a good place to meet people and sit and chat. Free wifi makes it so some people stay forever and then finding a seat is hard. It a nice and chill place with friendly staff. They have comfy couches and chairs. They also have a few tables outside.", "author": "Annie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-03", "description": "Their coffee is definitely NOT a reason to come here. The outlets and power strips ARE. \n\nI frequent this coffee shop to study and quickly meet some looming deadlines. Resulting in me having lots of coffee, meals and cigarette breaks. By the end of the my 8 hr stretch this place feels like home. \n\nIt is ALOT better now than when it was \"cafe euro\", the workers are nicer, their bathroom cleaner, and the couches without pee (always a plus). \n\nPS. the lady today wouldn't sell me an iced macchiato and says that Starbucks makes it wrong. This is the 2nd local coffee shop to refuse to sell me an iced macchiato. Starting to think my favorite Starbucks drink is a fabricated corporate drink =(", "author": "Jane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-12", "description": "Nice cafe with good offer, coffee and sandwiches are good.", "author": "Andrea K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-05", "description": "I came in Saturday morning for a coffee and a breakfast sandwich, and although the place was sooooo busy, the girls working behind the counter were super sweet and accommodating.  Considering how crazy it was, the service was quick and friendly, and the coffee was sooooo delicious and the sandwich was fresh and awesome--worth the wait as it was tailored to my fussy needs regarding toasting, etc.  The place has a comfortable, pleasant ambience, and the free wifi was perfect for me to finish some school projects I have been working on.  I'm not sure why other Yelpers are complaining about \"the redhead\"--unless more than one redhead works there?--because I indeed was happily helped by a girl with long red hair, and she was so sweet and friendly to me (and everyone else), that it's hard for me to imagine her being as rude as Eric F mentioned below.  Out of curiosity (and, frankly, procrastinating from my project), I looked at some other reviewers--specifically, Eric F since he seems driven to suicide by his experience--and it seems like he thinks pretty much everyone is ueber rude--even his only five-star review noted the unwelcoming staff.  And seriously--a Domino's Pizza review that complains about the temperature of the pizza?  Maybe Eric can review McDonald's next and complain about the quality of the meat in the cheeseburger.\nOverall, this place is great.  I would suggest that the sandwiches be priced about $1 or $1.50 less expensively (if I were to make this a regular haunt that could seriously add up), but good work / coffee / food station for sure.  I would give the place the full five were it just a teeeeeny bit more affordable for regular visitation.", "author": "Kennau K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-04", "description": "Whatever happened in here, is awesome.\n\n  Whoever removed the staunch, uninviting, tiny tables and replaced them with comfy armchairs, I thank you.\n\n  And whoah, to the muralist(s) who created the masterpiece that is now your walls, I salute you!  Amazing work, makes me feel like I've taken a sidestep to a French rue.\n\n  Lastly, thank you for retaining some of the same staff from Cafe Euro (the nice ones).", "author": "Lea N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-09", "description": "I really enjoy this coffee shop! The employees are kind and helpful, and the coffee and smoothies are great. I spend a lot of time here doing homework and the atmosphere is great for studying, working on projects and simply browsing the web. I really appreciate the free wifi, and the self serve ice cold water. My favorite employee is Bridgette. She always greats me with a smile.", "author": "Erin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "I can't help but feel like I'm sitting in the n Paris Las Vegas because of the interior decor.  Really, it's just like the hotel!  Which makes it all kind of cute.  \n\nI visited for the first time today in the afternoon so there were plenty of tables open.  I chose to sit right by the window which helped me focus on my task at hand rather than the ambiance of the place.  I ordered a medium Americano ($2.45) and was surprised at how good it was.  The coffee was not too dark and bitter.  \n\nI really liked that this place was calm and quiet but it was a Thursday afternoon.  I'm sure it's not so mellow on a Saturday.  Regardless, a nice place to sit and read.  I will definitely come back!  The only thing that weirded me out was when I asked the owner for the internet  password.  The whole scene was very mafia-like.  She just looked at me, flipped over a piece of paper with the password, then returned to working. Okay...........", "author": "Helen V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-18", "description": "I've lived near this convenient, relatively friendly café for a little more than two years. There is, in fact, no other place that I go to for a local cup of coffee. But I can't sit for more than 5 minutes in this place without being creeped out by the herd of slightly off-putting people wearing headphones and typing on laptops. Essentially, it's a laptop farm - with decent food (vegan blueberry bread!) and coffee, some fancy lighting, and a bathroom. Service has always been okay, but I've had a few unpleasant/confusing  experiences - usually at night - when there's only one employee. Overall, it's not bad but it certainly isn't anything exciting.", "author": "Eva J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-08", "description": "I'd give four and half stars if I could.\n\nComfortable armchairs & couches, plus desk and table areas for all of those out there who need flat areas to work.  They have fairly good background muzac that serves as a distraction, but not distracting.  Their food and coffee drinks are well-priced and decent, and they have an amazing tea selection.  Every time I've come here it's been quiet, even when there are children present.  It is a good place to get work done.", "author": "Margee B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-21", "description": "The only somewhat decent part of this cafe is the how spacious it is.  You can easily get work done.  But I believe a cafe should not just have a good ambiance, but it should have decent coffee and  fresh snacks.  Cafe Enchante lacks both, though I like the space I will not go there again as I have found many a cafe with not only a comfortable atmosphere but good coffee and somewhat fresh food.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-08", "description": "Since all the other cafes we tried to go to were closed by the time we wanted coffee, which was 7 pm, it was such a delight to find this place. I love how it's open generally late!\n\nThe barista was very friendly. I was torn on what type of chai tea I wanted and he kindly recommended the vanilla. I loved my choice! It tasted like a light cinnamon roll, kinda reminding me like Christmas! The other beverage we had was the iced latte. It wasn't your sugary latte like they make in Starbucks, but how a latte should be, coffee!!!\n\nThe atmosphere is very inviting. Basically two sections, one for relaxation on sofas to carry out conversations, and a section the the back that holds mostly table seats. The mural is beautiful, surrounding a indoor fountain. \n\nWe had a wonderful type talking and enjoying our beverages.", "author": "JQ V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-07", "description": "Coffee & food are the usual fair, but this cafe is clean, well lit with plenty of seating and free wifi. Staff are friendly and includes a lady who is Khmer...offers an excellent opportunity to brush up on my Khmer. I certainly can't ask for a better neighborhood coffee shop.", "author": "Garlic B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-20", "description": "I can't say enough about this cafe!  Tranquil ambiance coupled with decent  coffee.  (Wish they had individual drip brews, however)\n\nThe proprietors are very lovely and their French background makes them very appealing.\n\nThis place makes a mean breakfast bagel!!!", "author": "Steve M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-15", "description": "This is a really cute cafe and the Enchante bagel, hot apple cider, and lattes are delicious.  It's in a great location (about a block from routes 29 and 38) and the bathroom's clean, too.  The only downside is that it can get busy and a little stuffy in the cafe.", "author": "M. N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-11", "description": "If I were still a student, I would probably come here. Looks like a good place to settle in for a couple hours and get some work done. For just stopping in to get coffee, though, it's not that great. The coffee is just ok. The hand-made signs that tell you how much it will cost you for a refill, or that you will be charged $2 to use the bathroom are a little off-putting.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "Wow what a neat little cafe! My friend recommended us coming here this weekend to study and it was a great choice! The ambiance is just perfect and depicts what a real cafe should be. It's not loud at all, with light soothing music in the background, it's easy to get lost in your books. There's also plenty of seating whether it be couches or tables. And the french vanilla coffee is just delightful!", "author": "Sharon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "This place is awesome! The background sounds are good for studying (waterfall, random music playing at low-volume) except for when the roudy come in herds and talk up a storm, and the interior design is rather endearing (European cafe-esque). There is plenty of seating and outlets for laptop charging, FREE INTERNET, good fare drink selection (though i don't recommend their french soda), and computers for use.", "author": "Lana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-31", "description": "Great coffee, great decor. Came here before going to Jang Soo BBQ with my cousin. I can only vouch for the coffee, since I didn't want to stuff myself, but the price and setting made me want to return - this just might be the spot to wait for movies at the 4-Star!", "author": "Marcus M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-30", "description": "I am self-employed and I have to change it up and get out of the house to work on a regular basis.  I often meet my great friend here to work and study together.  I end up spending approx. 6-8 hours here working.  There is free unlimited wi-fi, the cafe is immaculately clean, and the staff are extremely friendly.  I've gotten to know most of them and they are always welcoming.  The food is good too, if you like bagels and sandwiches.  There's always an outlet to use nearby the tables, and the ambiance and music are very enjoyable.  I highly recommend this cafe for studying and working.  It's light, with plenty of window lighting, and convenient as it's located right next to the Geary 38 bus line.", "author": "Sylvia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-24", "description": "Loved the blended green tea latte and the breakfast bagel was very good too, had a nice local vibe and unique decor. \n\nSuper friendly staff topped off my sunday afternoon lunch here.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-19", "description": "The coffee wasn't very good and I had a really bad customer service experience.  Pretty much I wanted a double latte in a small cup.  The cashier charged me more for it than their medium latte which had the same amount of espresso and more milk.  Granted, it was only $.35 more, but it's pretty ridiculous to be charged more for less.  To make matters worse, when I tried to ask the cashier about it, she stared at me blankly until someone stepped in to help.  Maybe it was her English proficiency, but I got the feeling she was trying to brush it off.  She spoke English well enough otherwise.  She could have also been in training, but no one mentioned it, so I will assume she wasn't.  Anyway, I'll go to Art Bistro from now on unless I'm dying for caffeine while in the 20s (did I just borrow a Manhattanism?), and maybe then I'll just go to Royal Ground.", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-10", "description": "Hands down, my favorite place to go for coffee and get work done. Everyone is very nice and there's ton of comfortable seating.", "author": "Kyle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-23", "description": "The white chocolate, hands down the best I've had. You can actually taste the white chocolate more than Starbucks. Plus, this place is affordable! Sucks that it's out of my reach and I have to take at least a 30 minute bus ride there but I'll be back!", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-06", "description": "Really cozy place that does not feel stuffy. Free Internet.  Provides comfortable tables as well as lounging couches. Not too packed. But may be after this post it will be. Oh well.", "author": "Arthur K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-05", "description": "I love coming in here to study! The barista has always been super nice and offers to adjust my latte to my taste (since I have no complaints about the coffee this hasn't been necessary, but I appreciate the offer). \n\nI don't eat meat and was pleasantly surprised with their willingness, and suggestions, to make substitutions on their breakfast sandwiches. The Mona Lisa veggie sandwich is delicious! In fact all of the sandwiches I've had here are good. Haven't tried the pastries yet though. \n\nThe atmosphere is pleasant and great for getting work done. You can't beat the free wireless either.  I'm psyched that this is my local coffee shop", "author": "Kat O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-10", "description": "This place is great!  I've always had excellent service and whenever in the neighborhood I always stop in.  Being in a wheelchair makes it hard to access many places, but at Cafe Enchante it is vey friendly.  Try the large hot chocolate with a double shot of coconut.", "author": "Robert G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-17", "description": "This is a great café for sitting down and getting some work done. Quiet, lovely atmosphere, great decor. Food's reasonable - nothing special, but the important part for me is that I can sit down and get some peace and quiet. No tourists, no loud yuppies.", "author": "Brighid M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "Not everyone can make iced coffee yummy! Cute decor, nice & open. Love the decor. Will be back!", "author": "Dana S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-07", "description": "It's basically a study hall with free wi-fi. Food and drinks are institutional. Nothing special. Looking for a place to work for hours? This might work well for ou.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-08", "description": "This place saved me when I moved here from Boston in March. It was always raining we were in a furnished rental I hated and this place let me come, work on the computer have some yummy hazelnut coffee and a great veggie sandwich. Everyone that works here is so sweet.", "author": "Noelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-14", "description": "This is the place-unusual and strange!\nI had two times bagels and tea, I always had problems with my stomach.\n2 times I had to call emergency after I had very bad pain in my tummy!\nAlso, I had business trip via 10 states.I did a lot of visits in a lot of places.\nSo, I have experience: this place Cafe Enchante-not hospital and owner, she always complains on some customers that  they did t  spend enough money to be so long in this place(though always as I noticed some even gave tips around 10 US dollars).\nI would NOT recommend anybody place with such strange energy.\nI have over 12 years experience in food service, as well.\nI always recommend to owners pass special classes of hospitality and public service.\nGod Bless San Francisco,\nSteven Jackobson\nformer Law enforcement agent\n10/13/11\nI heard as a Lady,seems she is owner:yelling! You have hot water, but no honey. What happened, the very respectable person (can t mention his name) once in a while buying coffee+hot water(for medicine).I asked him.The owner stated: u can t have extra honey!\nB.sh. THIS IS USA! YOU HAVE TO RESPECT AND TREAT EACH CUSTOMER NICE.\nASIAN PEOPLE DON T LIKE EUROPEAN ONES. SEEMS LIKE...ALAS\nGOD BLESS YOU....BUT LEARN! YOU NEVER KNOW WHO WILL BE YOUR CUSTOMER:MAYBE UNDERCOVER AGENT? (PUBLIC, FOOD SERVICE):)", "author": "Rita J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-06", "description": "Great place to:\n-Sit with your laptop and work all day (free wifi!). Plenty of seating and outlets.\n-Have a conversation with a friend\n\nTried the Chai latte, and it was good. Nothing extraordinary - I actually prefer Starbucks' Tazo Chai Latte.\n\nBut, for the ambience, I keep returning =)", "author": "Sooji H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-28", "description": "This is what a coffee house should be...\n\nComfy\nClean\nCheap\nFree Wi-Fi\n\n\nYes, the food isn't all that great, the coffee is just average, the atmosphere is a bit cheesy, but who cares?  The owners are really nice and they keep their place running really well.  I like how unpretentious the place is.  Now I've never been to France and I'm pretty sure this place looks nothing like France, but hey, at least they try.  (Owners are Vietnamese, but they speak fluent French).  I look forward to doing work and studying at this place every Friday for a couple of hours after I get off of work.  \n\nThe only reason I give it four stars is because their food isn't that great.  It would be awesome if they served pho.  I should patent that idea.  Pho at a coffee shop would be awesome...\n\nAnother knock is that it could get noisy.  A lot of idiots come in there, talk hella loud on their phone, and bug everybody inside.  But that's not the owners fault.  Go outside you freakin' hipsters....\n\nThe couches also remind me of the old seats on a BART train.  Old, discolored, squishy, and probably filled with all sorts of vile diseases.\n\nIn my mind, it adds to this place.  The fact that they're cheap, they aren't trying to be hip or cool, and they know what they're doing keeps me coming back each time.", "author": "SAS Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-16", "description": "its a great place with a lot of tables and a water fountain inside so its nice and peaceful! i love this place but the coffee is not the best. It definitely is not bad, but not my favorite. The place is family owned so its nice to support them. Very friendly too!", "author": "Himali V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "I like the ambiance. Lots of space to sit and relax. The mural looks really nice. there are many choices for  regular coffee. I usually stop by for a quick breakfast before going to work. Nice people working there. I will keep going back for sure.", "author": "Nil G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-12", "description": "Went here todo some work while waiting on someone. Lots of space and outlets for people. Coffee was good and crumbcake was tasty.", "author": "Minh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-26", "description": "5 stars for being my daily study/work spot since its so close to where I live. Free wi-fi, good coffee, and plenty of electrical outlets. I stay here for hours to do work.", "author": "Trish P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-10", "description": "Ordered grilled cheese sandwich and got food poisoning. REALLY bad, Up-All-Nite food poisoning. Terrible. But a decent enough place to do some work. Will be bringing bottled water and eating packaged granola bars from this place from now on, though.", "author": "paul b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-05", "description": "Coffee totally blah. Espresso drinks a bit pricey. Atmosphere spacious but tacky. Service a bit abrupt.", "author": "Geoffrey U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-07", "description": "The chai latte here is amazing if you like it sweet. This is a good place to spend quality time with your laptop and eventually order a sandwich when your stomach starts making conversation- but there are hovering  Mediterranean-scape murals everywhere you look.", "author": "Lyrica T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-25", "description": "Plentiful outlets for computer usage, a lot of tables, and one unisex bathroom.  I am not sure if this cafe is owned by Asians or not but they seem to be running the cafe.  A lot of the baked goods are from outside vendors. I got the white mocha (small size) for $3.00.  Overall a good place to go if you live around here or if you score a parking spot with no hourly limit.  I did not feel very enchanted in the cafe but there were some couches. Wifi speed was pretty decent during the mid-afternoon.  A password is required to use the wifi and there is no hourly limit.", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-13", "description": "Why all the haterade?  I work AT a coffee shop and I come to this place to get my coffee and drinks.  I haven't actually tried any of their drinks besides a chai latte (which was just not flavored enough for my taste) but oh their savory pastries!  I've had the french provencal and the broccoli/cheese and they were both delicious.  The wait staff is nice (aka they are friendly at the register and leave me the hell alone once I sit down no matter how long I stay), the music is soft, the chairs are comfy, and the wifi is free!  If you don't consider that awesomeness well then...you suck.", "author": "Mailah G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-23", "description": "I'm a big fan of this place. However it does have a couple minuses in my book. I love the ambiance of the place, and it's crazy convenient for me. The smoothies are bomb! And the coffee has yet to be anything but fresh. Please don't get me wrong I do love this place but.......\n\nThere is always a line and a longer than average wait for your order. The staff is never happy which is probably to do with the fact they are under payed and over worked. \n\nDefinitely give em a try and I'm sure you'll find this places worth. As in all aspects of life nothings perfect.", "author": "Lexi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-27", "description": "A wonderful place for a hot drink, a snack, and some peace and quiet. There are plenty of small tables for you to do work or study, and nice comfy couches for reading. Not the kind of place you'd have to fight tooth and nail to get a seat. Also, the food and drinks here are relatively inexpensive.", "author": "Cathy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-31", "description": "This is a cute cafe, but they get one star off for not really knowing anything about French.  For example, they write \"la panini\" when panini is masculine. It is your business -- educate yourself!", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-08", "description": "I love this cafe. It's the closest one to my new house, so I went there first. I tried the other cafes in the neighborhood, Art Bistro, Simple Pleasures, and Cafe Zephyr, and this is still my favorite. The coffee's good-not great, but good. They have lots of stuff for sale-bagels, croissants, Russian tea cakes, cookies, candy bars, ramen noodles (no idea why) and sandwiches. Kind of a \"throw everything at the wall and see what sticks\" approach, but given that the cafe is fairy new and in an area with three other cafes, I can understand. I go here to read or do homework-it is undoubtedly on of the more comfortable cafe's in the city. The couches are new and clean and firm, not dirty and sagging like in many other cafes. The whole place is kept very clean, including the bathroom. You'll see the owner and his wife walking around in the afternoons sweeping up and wiping things down. They have a huge, executive-style desk with a leather-bound office chair set up in the corner, complete with power strip, the perfect location to get work done. I jokingly say I'm \"going to the office\" when I take my laptop there to write a paper. The food is pretty good. I usually get the Bay Club sandwich, made with turkey and bacon. I always get it on sourdough. It's not as big as some other cafe sandwiches I've seen but it feels you up. It comes with a goodly amount of mayonnaise, which I like, but others might find it too \"wet\" for their tastes. \n So, the food and coffee are good, not the best, but more than passable. But where this place really shines is the ambience. Most of the cafe is filled with a Parisian street scene mural. There is a small fountain installed into a side wall. French accordion music plays on the radio. The place can come across, initially, as cheesy theme restaurant, but they keep the French theme sufficiently restrained. The staff doesn't wear barrettes or speak in fake accents or anything, and sometimes, when the owners aren't around, the staff changes the music to more standard Indie-rock fare you'll find in most cafes. There is a very eclectic mix of people there- college students doing homework, Chinese couples arguing with their children, old men playing checkers at one of the many checkerboard tables, even the black-robed priests of the Russian Orthodox cathedral across the street are a common sight. It's a very comfortable and relaxing place and is one of my favorite spot to chill out.", "author": "Eli H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-21", "description": "Well was a regular customer here (key word being \"WAS\") I will never feel ripped off by giving that place another cent! 1st they CHANGED THE COFFEE to this cheap watered down crap. Way to save a buck cheap skates.  And what almost made me vomit was the LONG STRAIGHT BLACK HAIR I found in my sandwich from that asian lady who made it YUCK!!!!! It's called a HAIR NET look into it!", "author": "mike g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "Cafe Enchante is a nice place with decent coffee and free wifi. A variety of seating is available (tables, sofas, chairs, even a few small desks), and the staff seems very friendly.", "author": "C G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-19", "description": "Place looks really nice inside. But a chai latte thats 25% liquid and 75% foam for $3 something. No thank you.", "author": "M M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-24", "description": "I live near this cafe and I love going here to do some homework or research when i'm sick of being inside my house. It's so near. I've been here to get drinks, and it was great. But not until today, that all has changed for me. I only give this 1 star because of the great homey interior feeling. I ordered a chicken sandwich and as I took a bite and lay the sandwich back on the plate, I saw on the other half of my sandwich there was a long strand of hair. I walked disgustedly and unimpressed and told them that there was hair on my sandwich. They took the sandwich and said sorry and smiled. I'm cool with getting a new one, but as I walk away I hear them laughing at the hair while they play with the strand and see how long and what color it was. It was gross. If this was a great establishment, they would've accommodated me better like other places. BUT NO! I don't think I like the service that was provided here today.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-21", "description": "parking was pretty easy around the corner. sat morning it was quiet. we met here for a group meeting of 10+  and were comfortable in the couches. nice space and the staff even cleared our tables while we were meeting so we could have more room on the table which was nice. I only had tea so can't comment on the food/drinks.", "author": "Win H."}
