{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Order: sausage, egg and cheese muffin. \nThe picture doesn't do the taste justice, but this is a great muffin! It's juicy and warm and taste great, perfect for a cold morning in the bay. \nCafe Coco is a great place to stop by for breakfast. The staff is very nice. They made all the order as they come so it's fresh.", "author": "Yuan Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-06", "description": "I come here like clockwork but like every four months when I have an hour or so to kill. That's why I can't be considered a regular, but hey, at least I'm consistent. What gets me here is that I get my car serviced at the Toyota service center on the next block and I'm not about to drink the caffeinated swill in their waiting area. What's so special about Cafe Coco that it warrants my repeat business? Nothing in particular when it comes to their coffees and teas. All of that is pretty standard grade. I haven't tried any of their food either, but what does stand out is the service. Yes, I said the service. I don't necessarily expect people to be helpful and friendly at a place like this at such in godly hour.\n\nNow I'm sure the staff has to greet all sorts of characters who come in after they get off a crowded 38, but on a Saturday before 8AM, it's as still as a tomb. The server was a young man who really made a point to ensure my need for morning libation was met in a most positive, unpretentious way. I simply ordered a $2.25 cup of the Mighty Leaf Bombay Chai Tea without any accompanying baked good (a tower of strength I am) or even one of the sandwiches with the clever literary references. The tea was a soothing balm of orange, cinnamon, cardamom, and clove in a potent black tea (photo: http://bit.ly/2xOErZz). Bzzzz. Oh good, it looks like my car is ready. See you in four months.\n\nTEA - 3 stars...nice elixir as you wait for your car\nAMBIANCE - 3.5 stars...relatively spacious when it's empty\nSERVICE - 4 stars...friendly but not unctuous\nTOTAL - 3 stars...not extraordinary but solid for what it is", "author": "Ed U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-27", "description": "So, I enter in the cafe yesterday. In sort of popular around town due to gossip mongers and felt the tension before I ordered my egg and cheese English muffin. Things seemed to go smoothly. The asian male took my order, but made random comments. Alot of people dont know what I go through on a day to day with random people seeming to know who I am or what I've done. I didnt realize that the Latina who works at this cafe, had an altercation Wed when I was headed to the sushi spot on Cornwall st off of California. I overheard chacita speaking of a massa. Which has bee roamed I was a con if some sort and many other things people have said and dont even know me. I called her out when I noticed she was actually referencing me by looking over at me. I go into the cafe Friday morning July27th 9:20am and found my sandwich being delayed 2 customers who came in after me got serviced . One with 2 bagels and another with some sort of sandwich. I dont know if the delay was because I tried to tell her she need to know what she talkin about. Or she got thrown off from my cool demeanor when she placed my order. I'm actually quit ghetto and can't be hype and loud all day to show you I'm not surely not to be fucked wit. Now service was horrible due to what ever was on the workers minds that day and they dont know me at all. I'm the truth and hella yall haters is really speaking on shtlit yall have no idea about. My name is LaRae and I'm not to be fucked with...Calm or Loud.", "author": "La-Rae A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-16", "description": "My chocolate croissant was good but the guy forgot my drink. 15 minutes later I had it.. Then I got attacked by like three mosquitos while I sat to eat/work for an hour AND I had to kill a spider next to me. Gross! This place needs to be deep cleaned. Super noisy corner with the traffic and bus, won't be back.", "author": "Diana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "Cute locally owned coffee shop at 6th/Geary conveniently located where the 38 and the 44 meet. If I'm going from home to work or GGP, I usually stop here for a coffee or pastry. Their bagel breakfast sandwiches are delicious and very reasonably priced. It's not a hipster place by any means but the inside has large tables and is very clean. They also have a big variety of baked goods and pastries as well as drinks, chips and wraps. Service is great and they take CC with a minimum. Try the bacon, egg and cheese on a seeded bagel. Coffee is just okay-nothing fancy.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-20", "description": "I was waiting for the bus that was taking forever, damn you 44, when I decided to go into Coco's yesterday and ordered a hot chocolate.  When I got my drink I noticed it was coffee and when I told the lady I had ordered a hot chocolate, not a coffee, she had the nerve to say she had already poured it and that it would be $2 more on top of what I'd already paid for a hot chocolate.  What the hell is that! \nI'm guessing most of their business is because they are right by the bus stop.\nShe didn't even apologize for her mistake! Too many coffee shops in the city with to have to put up with bad business practices and rude behaviour.", "author": "Tasty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-17", "description": "Came across this place since my car was getting serviced at Toyota right down the street. I had no problem with the customer service here and the place was fairly empty since it was around 8AM on a Saturday.\n\nI ordered the Egg, Ham + English Muffin and Hashbrown and was really impressed with the quality of it! Further, I expected the hashbrown to come on the side, but was happily impressed when it was added inside the muffin.\n\nWould definitely come back!", "author": "James D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Cafe Coco is the perfect place to go have a cup of coffee, get a bite to eat, and do some work on your laptop. As a college student with tons of homework to do, I love getting out of my room and finding a comfortable place such as this one to bust out some assignments. There's plenty of seating, the service is very fast, and the staff is always very friendly. They also make THE BEST breakfast sandwich in the area! Definitely visit this place to either get some work done or catch up with a friend!", "author": "Coral G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-25", "description": "Cafe Coco has always been a \"go-to\" spot, purely for location and consistency of the coffee. Their lattes, when made correctly, are some of the best that I've had in the city. It's a local hangout that constantly has soccer on the TV and no particular vibe about it. It's also conveniently located next to the 44 & 38 stops, which can be great if you're not in a hurry.\n\nThe food definitely leaves something to be desired. I've ordered the breakfast sandwiches and a couple of salads, all of which made me feel like I should have just thrown something together at home and not wasted my money. The workers are mostly friendly but as mentioned earlier are in no hurry. \n\n3 stars seems appropriate -- A-OK.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "When I'm craving a sandwich or even soup I come here ! \nNot only is the food good but the customer service is too . Sarah is awesome :). Whenever I order a sandwich she's patient and she makes it the exact way that I like it .\n\nThey have a nice seating area with a cute fireplace and lounge chairs . They also have wi-fi! The menu ranges from breakfast food to lunch . Also coffee is served here . \nI usually go around 2pm it's not busy then . I'm assuming the busiest times are mornings and right before they close at 5pm . Overall I will continue to come here for my sandwiches :)", "author": "Sjauna J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-01", "description": "I was walking down Geary and in need of lunch and some coffee. Cafe Coco looked like it hit the spot, but I was sadly mistaken. The cafe smelled like cleaning product, so overbearing it gave me a stomach ache after being in there in just enough time to eat my sandwich and finish my coffee. Speaking of the sandwich - it was mediocre at best. They didn't have all the options available for the vegan sandwich - hummus was included and not even sure it made its way. Overpriced and low quality food and coffee. The service was fairly poor too - treated like they could take or leave my business... which is odd given that there were only 2 other customers. Just keep walking by this cafe.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-09", "description": "I've been here several times and the service is mostly poor. This is specifically speaking about the morning crew, they have no sense of urgency when attending to costumers. I often wait for the 44 bus around 7am and each time I make the decision to grab coffee in the morning I end up buying nothing and walking out. This is mostly because it takes the staff several minutes to stop chatting in the back and come to the front to take my order. There's never a greeting when I walk through the door, I honestly don't even know I was in the store to begin with?? \n\nMaybe they should place a bell above the door to signal that there's a new costumer. There has only been 1 person (a young woman who looked like she attended USF?) that has quickly attended to me as I walked in. She even acknowledged that I was waiting for the bus and quickly took my order. It's a shame because I probably would've spent a lot of money here in the morning if I was, at bare minimum, greeted when I walked in. \n\nI also think most of the espresso drinks I've tried from here are weak and need an extra shot. I would only recommend the regular coffee.", "author": "Quel H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-01", "description": "Nowhere moves slower than this place's coffee line on a weekday morning. As many people have noted.", "author": "Larkin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "I love the ham and veggie burrito that is so generous i have the other half for lunch.  The house blend coffee is unique and flavorful.  Served up fast by the  smiling girl at the counter.", "author": "Meagan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-02", "description": "Service is slow and unfriendly... it can take a long time until u are able to place your order and if u are in a rush to catch the bus u better don't get coffee here. \n\nThe quality is good but please bring some time!", "author": "Amelie E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-27", "description": "Ordered an espresso drink, didn't actually drink it, here's the reason why:\nSaw the barista making my drink, instead of using a tamper to pack in the grounds, she uses her hand/fingers. I thought, ok, maybe she had washed her hands before making the drink. BUT THEN.... another customer comes in while she is making my drink, she pauses to take the order, customer pays cash, she takes it (with her bare hands) and hands back change. She proceeds to make another espresso drink again she using her hands instead of a tamper. So grossed out, could not get myself to drink the coffee. So much for cleanliness.", "author": "T K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-01", "description": "I really wanted to like this place because its a small business but the customer service in this café is consistently off.  The cashier always seems as if customers are an intrusion to her work.  If you're competing against Starbucks or other neighborhood cafes, customer service is the thing that sets you apart.  Unfortunately for Coco, customer service sets this place apart in a negative way.", "author": "Re-pley Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-10", "description": "This place is convenient and has a decent variety of food and drinks. The staff is friendly but the prices are a little high in my opinion. FYI - There's a $5 minimum for credit/ debit card use.", "author": "Miguel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-17", "description": "I get a mocha here every so often but it's always inconsistent.  Sometimes the cup is half full, sometimes it's full.  I didn't know I get charged additional $0.50 for whip cream.  Sometimes the change I get is wrong. And they are almost always slow to make the mocha. I guess this is a reminder to myself to get coffee only at this place. Otherwise it's a clean cafe with nice enough group of people running it.", "author": "Larry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "I stopped in here today for a tea, to keep my hands warm since it's so rainy and cold. I left my phone in the bathroom without realizing it, and left. I had walked two blocks already when the barista came running up to us, because he had my phone. He literally ran 2 blocks to return it to me. How he even saw me is amazing! So 5 stars goes to the barista, who is the most thoughtful and generous person I've come across in a long time! Thanks, buddy!", "author": "Dana J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-10", "description": "I don't Yelp often because I honestly don't have the time to, but I felt the need to write a review this morning.\n\nBack in 2013 when I lived in the area, I came here a lot to do some work and have a quick coffee. Today was my first time back. Ordered a coffee and a bagel to eat in while I worked.\n\nWhile furiously trying to connect to their wifi (theirs is down for some reason), I noticed 20 minutes he passed, and I still had my number at my table since they didn't bring my food yet. I look around and realize a lot of ppl are sitting and eating who weren't there when I first ordered.\n\nI walk up to the counter and ask the cashier (young Russian girl, I think) why my food was still not ready after 20 minutes, and then she gives me that, \"What are you talking about?\" look. I show her the number I'm holding and tell her I still don't have my bagel.\n\nShe then tells me to have a seat and it'll be ready in two minutes. She proceeds to bring me TWO poppy seed bagels filled with cream cheese and NONE of the toppings I ordered along with it (I ordered a plain bagel with cream cheese, cucumber, tomato, sprouts), but both plates came with one skinny strip of tomato and cucumber. Sorry, but one little strip is not worth 50 cents.\n\nI bring both back to her and tell her that I paid for each of the toppings I requested, and told her I didn't want that extra bagel. She takes my bagel to the lady in the back and instead of slicing the cucumbers/tomatoes thin, she sliced them thick like what you put in sandwiches. Also, still no sprouts!\n\nI feel pretty ripped off, especially since they nickel and dime you for every little addition to your bagel (they don't have bagel specials for a flat cost). If you're going to charge ppl for extras, then PROVIDE the extras. Geez.\n\nNot once did she apologize for all of this. Had she been more apologetic, I would've been a bit more understanding. I mean, everyone has a case of the Mondays. But her lack of concern was very evident.\n\nYou had ONE job. It's a simple bagel request.\n\nI miss the young half-Filipino girl that worked here. She was always so sweet and professional.", "author": "Melissa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "This is one of my favorite stops for food . Easily located on the corner of 6th st. & Geary . The bus stop is right outside the door . The service is excellent & the food preparation is Percision . Just tell them exactly how you like your food order & you will be pleased . I love this place. They also have different snacks & drinks .  The chairs are super comfortable & the have wifi , too .", "author": "Angela G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-25", "description": "The coffee is probably the only reason to come here. One would think after ordering sandwiches thinking they'd come out like I'd ask for? They don't.  Ordered an egg salad sandwich with Swiss Cheese on toasted sliced Sourdough. I said no mustard and the sandwich was for here:  the sandwich came with mustard and the cheese was grilled, and sandwich was made to go. Who puts grilled cheese on a cold sandwich?  I saw the guy put in no mustard.  How can someone put mustard on when it says no mustard? Arrogance.", "author": "RJ G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "What I appreciate about this cute and well-rounded cafe is the abundance of outlets available.  Whether you are a freelance writer, journalist, student, or any other identity that requires a substantial duration of lap-top time, you can count on Cafe Coco to give you what you need. I walked from Spruce to 6th Ave on Geary as well as Clement searching for a change of venue to study since the school library was boring me. I walked into Cafe Coco and saw plenty of seating with outlets everywhere!\n\nThe staff is friendly and there's plenty on the menu for a hungry or thirsty customer.\n\nI stuck with my usual and ordered a chai Latte. It was delicious! \n\nSome of the decor was a little odd and didn't fit the scene, but the upbeat music made up for it. Also really liked the art work above the cashier.", "author": "Elisha Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "I stopped in here because it was close to my nail place. There was no line when I arrived. The lady that took my order was not polite or welcoming but did get my order together quickly. I ordered an iced mocha and a blueberry crumble \n\nThe iced mocha was good, the espresso was easily detectable in the mocha (which isn't the case at all places) the mocha itself was not sweet, which is fine with me. \n\nThe blueberry crumble was good the topping was a little too sweet but I liked the bottom of it a lot so it was good.\n\nI will definitely stop in here again when I'm in the area.", "author": "Jody L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "I loved their banana nut muffin. Their customer service is good. They just need an third person behind the counter.", "author": "Sayeeda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "I live right around the corner from this cute cafe and it's always my go to spot for coffee or a healthy lunch option. The food is good, the drinks made perfectly (thank you AJ and Bri!) and of course quick and excellent customer service. A few names to mention.. Bri and AJ are great baristas and always very friendly with all the customers. Marta in the back makes artisan sandwiches made with care. It's a cute cafe and I definitely recommend it to start your morning right.\nMy referral for lunch: \nThe quinoa salad (my favorite) Fresh large salad, well made and balanced. Healthy and hearty.", "author": "Bryce M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-15", "description": "I stopped by to check out this cafe since it's a block from my parents' place and I need to use the Internet. However, I couldn't connect to the Internet! I double checked that the wireless password is correct and even switched spots, but I still couldn't get a connection. The weird part is the signal looks fine but it says no internet connection. The other weird part is there are two networks- CafeCoco and Cafe Coco with a space. When I asked the cashier which one to use, she said both works but they didn't work for me. Only Gmail and Yahoo.com worked. I suspect that the internet connection is really slow here. I couldn't even complain because my email is working but I couldn't login to Salesforce or the online tax website I need to file my taxes. You shouldn't advertise that you have free wifi and provide many outlets if the connection itself is minimal...\nEven the small coffee cost $2 so I felt ripped off when I couldn't connect. The only good thing there is they give you a real mug.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-07", "description": "I wish I read some of the negative reviews before coming here. It wasn't busy today when I came in, yet the lady taking my order seemed rushed and barely listened to what I asked for. I got tea and a falafel sandwich. When the tea was brought out she told me to be careful because it was really hot, even with the sleeve. Holy crap. I took my first sip -5 minutes later and I still burnt my tongue. Not only should a drink never be i drinkable hot, but boiling water kills tea leaves... On to the sandwich. I wish I didn't spend basically $8 on this. I had high hopes for whatever reason. The ratio of salad to falafel was disappointing, but the worst part? The falafel was still frozen in the center... Not fresh, and they couldn't even hear it up right. I'll look for another place next time I'm in the area.", "author": "Shira S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-01", "description": "The coffee is undrinkable because it's BOILING HOT. Like, way beyond acceptable coffee temperature. I couldn't even hold on to it with a cup sleeve, and it's almost impossible to get the lid off to put cream in it without burning yourself. Also, they are almost always out of half of their bagel selection. Uhh hello? Order more bagels! Supply and demand!\n\nMy last straw was the last time I went to Cafe Coco, when the woman working at the counter charged my card for more than what I had ordered and was incredibly rude about it. My order was $4, the card minimum was $5 or have a $.50 charge. She told me just to buy something else so I could make the minimum--umm, last I checked, it's MY decision whether I want something else or pay the extra charge. Not yours. So she charged me $5 anyway and told me to take a piece of candy that I didn't want! \n\nI wasn't going to go back anyway, but their terrible health score solidified my resolve. I'll go somewhere cleaner where I don't get overcharged.", "author": "Lindsey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "I don't give a hoot if you think the food is meh or the coffee isn't as good as you think it should be. I think it's fine. \nI come here because my internet at home takes 6 hours to load a 2 minute video and it takes only a few minutes to load it here. The tables are big, it's spacious, music is kinda loud, but no one bothers you. This is a good place to get stuff done if you can stand the loudness of the music.\n**UPDATE**\nOwner messaged me and told me she would turn down the music. Sure thing the next day I went in there to see and it was turned down**", "author": "Stacey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-20", "description": "My friend and I had taken a bus down to the Castro looking for a shop. Once we'd found it, looked around, we decided we wanted to find a place to get a drink and have a bit of food.  \n\nI'm a terribly picky eater, so in a city that has food every 100' feet, I was turning my nose up a lot. Finally, we got to Cafe Coco, and I said it was OK to eat here.  We both opted for specialty cheese sandwiches, my friend chose a grilled cheese and I chose a capeprese salad sandaich. Both were tasty, the service was alright and we left quite happily!", "author": "Dianna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "It's truly the little things you take for granted.\nWith Cafe Coco - it's definitely that. \n\nLaw school requires a lot of my time & being that my school is downtown, it's sometimes really annoying to have to go all the way down there just to study.  My boyfriend & I live just a few blocks away from Cafe Coco & it has proven itself to be probably the best study cafe in the Richmond.  The lighting is perfect, big windows = lots of natural light.  They have outlets spread throughout the cafe for all the laptop users, which in my opinion, is a MUST for a cafe these days.  \n\nThe drinks & food are better than your average.  Reasonable prices & reasonable portions.  I think what's been the most important to me is the service.  Everyone is incredibly friendly.  Sometimes when the internet is down, they gladly reset the router & try to fix the problem right away.  \n\nCafe Coco, thanks for taking care of all us Inner Richmond residents (:", "author": "Sylvia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "Cafe coco is your good ok neighborhood cafe offering various warm drinks , sandwhichs, salad etc. I ordered the chai latte (large for 3.53) which was tasty (though be careful, it's hot) \n\nYou have your skinny men with scarce working on the novel, student with table scattered with the entire contents of her bag, lady on conference call, introspective high school etc.\n\nLong story short great place to grab a warm drink to sip in a comfy chair.", "author": "Marcus T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-04", "description": "Ordered falafel sandwich. Barely perceptible presence of the advertised humus and tahini. Stale frozen falafel and semi damp lettuce. Sucked half the moisture out of my body after two bites. Deeply unsatisfying. Like a salty sand burritto.  Asked them to fix it. Waited 10 minutes. No perceptible change. Suppose there is wide latitude in what a cafe may interpret a falafel to be or seem like but this was really senseless. Would give it one star but my friend liked her Zola sandwich.", "author": "Noel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-17", "description": "Laptop camper. One of the newest coffeehouses in town, Café Coco has a vaguely Middle Eastern décor but standard coffeehouse menu that didn't have Mediterranean items. The sandwiches are named after famous writers (Proust, Kafka, Zola, Balzac, Tolstoy). The food is affordable, e.g., sandwiches start at $3.99 and salads are $5. I saw a sign for hot piroshky.\n\n* Bagel with egg and cheese: The bagel was small and the cheese tasted like pasteurized cheese product, pretty sad\n* Latte: overroasted, not horrible but not good either\n\nThe wi-fi is free, secure and extra fast. However, it's a noisy place with terrible loud music (the first song I heard was from Journey and I heard Journey more than once so I was in pain). The ambiance leaves much to be desired. Chairs aren't comfortable. \n\nYou know you love me. X0 X0, laptop camper.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-01", "description": "Don't come here to use the Internet. It doesn't work even though when I asked they said they have WiFi and tried resetting it, still doesn't work.", "author": "Breee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "Love this place! I'm here every Saturday and Sunday morning to get my coffee on the way to the dog park. The staff is super friendly!\nThe sandwiches are really good too.", "author": "Kristen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-03", "description": "Free refill on coffee.\n\nFriendly service and great location (for me) but the coffee is horrible.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-13", "description": "Friendly service, a delicious spinach and strawberry salad with poppyseed dressing, and getting avocado and pecans added seemed to be no big deal at all. Tried a non-fat mocha in the morning with extra shot, and it was on par with the big coffee players. Free wifi (password is \"welcomecoco\"), ample seating, roomy interior with warm decor. Prices reasonable for city fare, and it's nice to have a cafe option right next door to Kaiser French Campus. Hope they stick around!\n\nAnother tip: bus stop right outside. Stop in for a quick bite or beverage to go!", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "When visiting the Golden Gate park, this is a good stop.  \n\nCash only and they have an ATM machine.", "author": "Pam S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-25", "description": "Although the cafe offers a super comfy study place and the coffee is ok, the customer service is terrible. The employees are never welcoming, they're always in a rush and they never have a kind way of closing the business. It is a shame to see a place with such potential go to waste because of something as simple as good ways.", "author": "Paulina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-28", "description": "Cafe Coco sits on a corner, has bus stops on both sides of it's frontage, losing  some. an 1/2 block away is a police substation, another sleep disturber.\n\ncoffee shop is small with just a few tables.\nmenu: sammies, salads, coffees, pastries, ultimate cookies\n\npour: costa rican organic (L.2)\n-robust, semi-smooth, brew.\n\ndrips:\n-smiling, energtic, alert service (even for 1/2 awake patrons waving $2.).", "author": "Victor G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-17", "description": "The  barista came to my table and asked me to order more if I wanted to stay there after I was there two hours. It is rude. How much I should pay if I be there 3 hours, 4 hours, 5 hours...? It is simply ridiculous.", "author": "Aichi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "Great coffee! Great food! The staff is friendly and helpful. Also, a great place to watch soccer games. It is my go to spot in the neighborhood. Perfect place to get a latte and a bagel for breakfast. Highly recommended!", "author": "Peter Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-06", "description": "The coffee was good but very upset with customer service. \n\nThey gave me coffee in a defective cup and the coffee got all over my papers. I threw the cup away and went back to ask for a new cup of coffee. They said I needed to bring the cup. I explained that I had to throw it away - no nuts.\n\nI went back already perturbed expecting an apology after I dug it out of the trash brought it back, instead they made it out to be my fault saying that it wasn't leaking when I had taken it out of the store. I left saying I didn't want a coffee anymore and I will never come back for another.", "author": "Neil G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-20", "description": "This place annoys me. I go here because it is right at my bus stop. I stop in for coffee or a quick breakfast item occasionally, but so often I leave frustrated.\n\nThe downfall is the service mostly. The baristas/cashiers usually are not friendly or attentive. If there is a line, the situation is always a confused mess. The pastry selection is not good or fresh and it is over-priced. They run out of stuff often. I once asked for a toasted cinnamon raisin bagel, that's it - it took 10 minutes for them to get my bagel in the toaster, and it wasn't until I had missed my bus that they passed me a plain toasted bagel and mentioned that they ran out of cinnamon raisin. An EMT who was also waiting on a bagel said he was going to be late as well. It's just dumb, it shouldn't be this hard to keep up with coffee demand in the early morning hours.", "author": "Halley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "To me, this is one of the most underrated cafes in sf. they have everything you could possibly want in a cafe. good coffee, fast wifi, spacious area, fantastic atmosphere, and a really good staff. The food is terrific, they have a large arrangment of items such as fresh fruit salads, pesto and italian pastas, tabloui, yogurt parfeits, cheescakes, a slew of tasty pastries, half sandwiches, basically you name it.  there is a guy who works there, aj i believe, he is super humble and a really skilled and quick barista with amazing latte art and an outgoing server. really sick spot in love with it. thanks coco", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "Great spot for working or hanging... And the savagely beautiful and talented Brie the barista makes an outstandingly wet macchiato!", "author": "Rick R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Just tried their Vegetarian Hugo Sandwich and it's so delicious  I'm not a vegetarian, but this one was calling my name, very happy with my choice.", "author": "Darin V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "I was expecting coffee and pastries before walking in, but am blown away with how much FOOD they have here! Every kind of bar you can think of (Luna, kind, Lara, etc) tons of chips, pastries, bottled drinks...srsly. And they take card (for a surcharge)!", "author": "Suzie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "I love this place. It's comfy, the service is professional and warm, and the food and coffee are fresh & delicious. One of my favorite cafes.", "author": "Jessie E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-21", "description": "This would be my first Yelp update, and sadly its a downgrade.\n\nI still do enjoy the food and convenience of Cafe Coco, but service always seems ... off?  Snarky?  Rude?  And sometimes just plain dumb.  And in saying that, none of the issues I have, if isolated incidences, would have me yelping.  But when this type of service (or lack there of) is consistent, I feel the need to say something.\n\n+ On numerous occasions (5+) I was charged extra for specific choices (different type of bread for my sandwich or extra avocado etc...) I made to my order that never came with the changes.  One day, after having this happen to me four times, I politely asked to make sure that my order was written down with all of the specialties and changes that I wanted since the last couple of times I had asked for them, and had paid the extra charge but sadly it did not come.  The lady at the counter just cracked a snarl and said \"sux\".  Yes, in fact it does \"sux\"!\n\n+ From what I can tell, prices are fairly arbitrary, and solely based upon who is working the register...\n\n+  One very strange morning, when I was waiting for my bagel the lady in the kitchen, who took agonizingly long, finally came out to meet me at the end of the counter to give me my bagel and said \"here b**ch\".  Then turned and walked away.  Having said not one word to this woman ever in my life and having just smiled at her moments earlier, it came as a shock.  The only excuses my mind could come up with were: maybe I was standing in a b**chy way?  Maybe she said \"here list\"  \"here pitch\" \"here ditch\" and I heard wrong?  Either way... what?\n\n+ And finally this afternoon, when I stopped in before my lunch break was over, I got a large hot coco, and after the lady at the counter wafted back and forth for the price, $4 (I sincerely hope you import that chocolate from Switzerland on the backs of magical unicorns for that price) I was given a luke warm 3/4 filled cup of hot coco.  By the time I realized/noticed, it was too late to go back.  I wish I would've checked inside the cafe so I could've said something there and then but I didn't.  My loss I guess.  That being said, if I am paying a whopping $4 for a cup of hot coco, please ensure that you fill THE DAMN CUP UP!\n\nI waver between believing that the mistakes are due to: laziness?  Idiot-ness?  or just plane loathsomeness for paying customers?  But either way, not acceptable!  Get it together, Cafe Coco, you're running a business!", "author": "Pb J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "Currently sitting in this cafe right now as I'm writing this review. I just finished scarfing down my bagel + cream cheese ($2) and my hazelnut latte ($3.50 for small I think) and grand total including tax was $6.21.\n\nBagel is nothing special, but if you dine-in they present it to you toasted and sliced in half with a small slice of cucumber and tomato on the side. But I thought the hazelnut latte was pretty delish!\n\nContrary to others, I thought the service was pretty decent. The cashier was nice and the barista seemed pretty perky when I came in at 8:30am.\n\nWiFi password is posted by the register.", "author": "Tee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "An enjoyable place to have a coffee and study. This coffee shop is pretty spacious and there were several tables that were free around 1 pm on a weekday. A large latte with syrup set me back about $4. I wish this one lady didn't have to have a super loud and lengthy conversation on the phone, but it's not the coffee shop's fault and I was able to move away", "author": "Alisa Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-04", "description": "We came here after browsing a nearby bookstore. My husband needed to check on some work things (and needed a caffeine fix) and I wanted to dig into some reading. I don't drink coffee for health reasons, so I stuck with a ginger ale, which was tasty and unique, but says nothing about the cafe, I know. The staff was super nice and it seemed like the clientele was really agreeable as well, so the place attracts pleasant folks. I really can't say much else, as it wasn't much of an in-depth visit, but I didn't run into any issues.", "author": "Kaitlin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-18", "description": "After driving around and searching on yelp for a good place to park ourselves for a few hours to work, the BF and I found this place. \n\nIt was perfect for what we wanted to accomplish. Plenty of good sized tables to set up two laptops, the coffee was delish, the desert we had was just ok.\n\nI'll definitely be coming back here if I need a place to work and study.", "author": "Pauline T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-30", "description": "Delicious iced latte! The espresso drinks are to die for and the staff is super nice. Definitely a great cafe in this neighborhood.", "author": "Thomas P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "I've only had lattes here - but they've been expertly prepared.  The coffee they use is awesome!  The food is very good as well - I've had sandwiches and their fresh fruit.  Located right at several bus line stops and by Kaiser - French Campus.  I recommend Cafe Coco.", "author": "R F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "Best new drinks always! Also, there Chai latte is perfect--Not to sweet and with a little bit of spice. I always go to Cafe Coco for my favorite sandwich, the Zola, which is a caprese salad wrapped with a perfectly toasted ciabatta loaf. Delicious! I will be coming back for many months to come.", "author": "Maria P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "Some of the best sandwiches in the Richmond District at a reasonable price. I'd even consider them one of the better cafes in SF! I'm a frequent customer and I've always been very satisfied with the food, drinks, and service. The staff is friendly, the space is fairly large at the corner of Geary and 6th ave (which is rare for many SF cafes and coffee shops), and the WiFi is very fast with a download speed of 30Mbps and an upload speed 8.0. I'd highly recommend Cafe Coco for remote laptop workers and techies alike. A great place to study and just grab a cup of coffee too!", "author": "Richie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-12", "description": "Wow. Just, wow. If you are a cafe, how do you serve stale bagels and stay in business? There was a 50/50 chance my encounter with a coco bagel could have resulted in a very expensive dentist bill. In addition, the hot chocolate tasted like water. Like at this point why aren't you just buying Swiss Miss, Coco? I honestly didn't know it was possible to be so displeased with a bagel and hot chocolate - it takes some serious skill and dedication to mess up something so easy to prepare that well.", "author": "Liz F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-24", "description": "I have only had their coffee, but it is excellent. Only $2 for a 16oz and it's a very dark rich flavor. \n\nThe service is great, they know my drink and have always been friendly and very fast making it. I've never tried their food, I'm not sure why, it just hasn't happened.", "author": "Venus S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-05", "description": "I love this cafe! I have been here a few times now and each time I am pleased with the drinks and the service!\n\nIt's located right in the crossroads of the #38 and the #44 bus lines. This is great when I go from my place downtown to Golden Gate Park! I always try to make time to stop here... \n\nI love my lattes with some syrup, and Cafe Coco has Irish Cream syrup... Mmm. Reminds me of a Bailey's & Coffee!  The young woman working at the counter told me she didn't know what that was as she was too young drink. Her smile and charm was lovely! Everyone else I've come in contact with there has been very friendly also!\n\nI just had a \"Diderot\" under the sandwich menu. It's grilled ham with jalapeños and yellow mustard, topped with gruyere Swiss  cheese and all in a ciabatta roll. Filled me up, was a bit spicy, and very flavorful!!\n\nI'll keep coming back as long as there is good food/drinks and friendly service!! Thanks!!", "author": "Jordan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-15", "description": "A bright way to start the day!  \n\nLocated at the 38/38L/38BX and 44 transfer point, there is a lot of traffic here.  When I have a few minutes in the morning, I'll walk into the cafe instead of onto the bus.  The clerks are friendly, the music is upbeat, and the free wifi is solid.  \n\nA latte cost me $3.25, which is less than Starbucks, and it's served in a pint glass!  \n\nThe airy, sunny (huge windows, and it's going to be 71 degrees in SF today), clean, open (slate floors), space is a perfect day starter.  I sit at a 2-top, one of 8, not at the window counter, and let the easy listening vibes carry tropical memories to my ears.  I'll be working in a concrete box in OK-town later today, but for now this is a perfect way point on my commute.  \n\nP.S. they have halvah!  That stuff is addictive!", "author": "David D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-19", "description": "Bad customer service, waited for over 10 minutes for my sandwich. I asked for a refund because I have to go and can't wait any longer. Toner another 5 minutes for them to convince me to wait, yet no one is in the kitchen as they were all standing in front of me. Needless to say, I waited for them to decide to refund me by throwing cash back at me when I paid with a credit card and was told that I should just wait like everyone else. If I want in a hurry and having money thrown back in my face, I might have gone back.", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "At Coco Cafe you feel at home, with great service, pleasant smile and good products.  You would be treated special no matter how picky you are.  The location is at the heart of the Richmond District.  Say no more.", "author": "Ihsan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-13", "description": "Free wifi\nAwesome, friendly staff\nGreat cappuccino \n\nI am always nervous about taking calls in a cafe because there is always one person that keeps turning around and staring like they have never seen someone on the phone before. So yes, I had an audience with made me feel uncomfortable quick. Naturally, I got up and spoke to the managers about my predicament of needing to be on a call, but not wanting to disrupt other patrons. \"Go for it! As long as you aren't yelling, it's fine!\"\n\nTook my calls, basically swallowed the mouthpiece, and continued to have an onlooker. \n\nI would definitely come back here. The atmosphere is nice too. Small, but friendly enough people to share tables with.", "author": "Anisha G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-28", "description": "A coffee place right next to my doctor's office?  yes, please!  The coffee/lattes are great and the pastries are fresh and yummy.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "It's been a while since my last review. Things have changed and for the better!  My fave sandwiches so far are Diderot and Balzac. The spinach with strawberry salad is good too! I just had a mocha done by the new barista and he made it to my liking. Overall a big improvement!", "author": "GMahree J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "The coffee and service are very good.\n\nThe egg and cheese bagel...wasn't. The cheese was weird to say the least and the egg was a little too runny for a bagel. This may have been a fluke but I think next time I'll avoid the whole egg and cheese situation.", "author": "Brittany N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-20", "description": "Honestly, this place seemed really great when I started going here. The staff seemed nice, I never had any issues. The coffee is not bad (I never tried the food).\n\nBut I will not be coming back.\n\nThis morning when I was drinking my coffee I noticed that a homeless man came into the store and purchased a coffee. He sat down in the corner of the store, towards the back, and was just drinking his coffee (I was one of the customers sitting closest to him and he definitely wasn't bothering me) when one of the staff members asked him to leave. \n\nI understand that a staff member has the right to ask someone to leave if they are being disruptive. This was not a case where the customer was being disruptive. In fact, when the guy was asked to leave, he was really confused and asked why he was being asked to leave. The staff member said it was \"just because\" and she added that she \"didn't want to make a scene -- but he would have to leave.\"\n\nThis is not something that I can respect in a coffee shop. You ask one of your customers to leave for absolutely no reason and are completely rude to him when he was not being disruptive whatsoever. \n\nThe man left the store and crossed the street in order to sit on the sidewalk and drink his coffee there. This is NOT okay. \n\nI won't be returning here and I've already started telling the people in my dorm (literally a block away) that they shouldn't drink coffee here, either. This place should be avoided if you care about other beings' basic rights.\n\n**Edit In response to store owner:\n\nHe should have been refused service to the store if he was not welcome. This would mean telling him upon entry that he was not welcome there, not waiting until after he purchased his coffee and after he sat down (approximately a 5 minute window with no other costumers in line or waiting for drinks). \n\nI disagree with how this situation was handled. The barista should have at least stated why he was being asked to leave instead of saying \"just because.\" That sort of behavior is intolerable.", "author": "Krista K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-26", "description": "While waiting for the bus in the rain, I came in here to avoid the cold. I ordered a chai latte for $3.00 flat. It was perfect for the cold weather! However, it tasted way too much like milk after a while. The servers are quick and friendly. You can find yourself a seat at the bar (looking out the window) or the many small square tables. It is a very clean and nice looking cafe. \n\nAll the coffees are $2-$3 for 12 oz. the sandwiches are $6.99 each and the salads are $5.00. They also have $2 bagels. I haven't tried any of those besides my chai latte but I may stop by here to study sometime soon because it seemed like a good atmosphere to get some work done.", "author": "Connie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Cafe Coco is a great spot for an espresso or a tasty treat. Their baristas make great coffee drinks every time and the sandwiches are great. Would definitely recommend.", "author": "Robert N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-07", "description": "Prices are outrageous, wifi not working, and no raisin bagel.... ugh... not sure how this place has 4 stars... paid almost 8.00 for a snapple and a bagel with cheese and egg....", "author": "Marvin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-04", "description": "Had to wait for my car at toyota, so decided to do a little work at this cafe close by.  Ordered a hot mocha and a plain bagel with egg and cheese.  Ordered at the counter and then made my way to a table with an outlet.  They actually came out with the plate, announce the order, and just bring it straight to you.\n\nThe mocha was a bit more bitter than expected, but otherwise fine.  However, after a while, a thin film was skimming the top of the drink. o.O!  I think I let it cool too long. As for the bagel, the bagel itself was fine.  The added egg and cheese made it more greasy, which made it harder for me to finish it all.  Next time, I'll probably just take the bagel by itself.\n\nThe environment was quite nice, very spacious.  There is a TV that was showing infomercials the entire time, but it was amusing to stare at occasionally.  The wifi was very reliable, which made me very happy.\n\nIf I'm around, will stop by and do work here.  But be more careful with my orders.", "author": "My An V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "Been going here almost every day for the last couple years since I moved into the neighborhood.  Awesome coffee, great pastries, and killer breakfast sandwiches, especially the english muffin they recently added.  Super friendly crew as well.  Nobody makes a 4-shot latte like Bri!", "author": "Tim O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-19", "description": "The place looks great but the service is shit. No greeting and no thank you. The worker seems upset , like they don't want to be there in the first place. I ordered the cream cheese bagel with smoked salmon and a large bowl of soup. The bagel was alright, nothing special.  I wouldn't know how the soup tastes since it took about 25 mins to prepare. When question why it took so long, I received a rude and sarcastic remark. If you want an OK food with shitty service, this place is for you. I will never step foot into this place again.", "author": "Vera W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-29", "description": "Lou's is my favorite sandwich place but it was way crowded, but it was good because I ended up at Cafe Coco's instead.\n\nI had the Diderot - have them bake the chiabata -  Jalapenos are ever so delicious in a sandwich.", "author": "chio s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "Cafe Coco's make the best cafe au laits. So foamy and delish. The perfect cup.\n\nOther favorites:\n\nCaprese sandwich\nVeggie sandwich\nLox is the best I've had, too!\n\nThey also have a great selection of treats and drinks, too.\n\nYum,\n\nAngela", "author": "Angela T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-09", "description": "The worst experience ever. Like others mentioned, the cashier service is horrible (I had better experience from the DMV). Please improve how you treat your customers.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-07", "description": "Great atmosphere. Warm earthen wall with ample day-lighting. The empanyanas taste great. (Where else but the Mission can you find them?!) Plus, there are simply no other cafes on this particular stretch of Geary! Finally we have one right here at 6th. I come out of my way to get here regularly. \n\nFor a few weeks they played only delightful classical music, but then the rock keeps us coming back for more. It's all good, very good indeed. Keep it up, Coco.", "author": "Eckhart B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-27", "description": "The place is really cute and the staff was friendly.  I ordered the Hot Pastrami sandwich and all was going well until I saw the lady in the kitchen put the sandwich in the warmer.  She then went on to finish taking out the garbage, with her gloves she used to make my sandwich still on.  I was hoping she'd change them before she finished up my meal but sure enough she went right from the dumpster in the back to the line and finished up.  I will not be eating here again.  If this happens when customers are in the store I hate to see what happens during prep when no one is around.", "author": "Mark F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "i was happy to find this new cafe on this corner because I didn't think I would find a good cup of coffee nearby. I've eaten here a few times and it's been pretty good. They have good bagels and thinly sliced cucumber, good sandwiches and salads for a very reasonable price.\n\nThe quinoa salad wasn't so great though. I didn't expect the grain to be uncooked and the dressing wasn't interesting. Since the cafe just opened, the food service was a bit disorganized but you gotta cut a new place some slack. Anyway, I do.\n\nThe cafe is attractive, spacious and filled with light. Oh, and they have wifi too.", "author": "Susan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-11", "description": "If you are looking for a cappuccino that tastes like grass, come here.\n\nAlso, when I asked the cashier guy in a beanie for the restroom key (for the second time), he said \"yeah, when we have time\".\n\nGreat customer relationship building skills all around at this joint.", "author": "Pari M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-26", "description": "I had to ask the girls at the counter for the password after sitting there for a while and my latte was way to heavy on the milk. I think I'll pass on this place.", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "This was first time I visited here. I ordered Americano, Chocolate croissant and biscotti. Total charge was about $6.75. Staffs were very kind and food was delicious. This place has many large tables and long table that face to window. You can use your laptop here. Quiet and good BGM, that you can concentrate to your work.", "author": "Tammy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-20", "description": "The location is easy to find, Friendly staff, clean and comfortable environment, good coffee, free and stable wifi, they even have a high resolution TV!", "author": "Chester C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-10", "description": "Update from first review: I decided to give them another try since the owner contacted me to apologize and to give them another chance.  I just placed 4 orders of sandwiches today and we'll see how that goes. Cashier this time was better then the one I encountered with.  The male who took my order was pleasant and nice.  I'll review their food once I give it a try!", "author": "Alyce l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "One of my favorite sandwiches in the city, the toasted Balzac on dutch crunch. Very comfortable atmosphere, friendly staff, free wifi, and great sandwiches and coffee. A nice place to stop by for a cup, or to stay a while and talk or study. It's also conveniently on Geary and 6th Ave, so it's easy to get to. I've spent several afternoons here working, reading, or watching playoffs.", "author": "Jeff F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-20", "description": "I go to Cafe Coco quite often as a place to get work done.  It's exactly what the neighborhood needed: Open & spacious & plenty of seating and wall outlets for laptops.  The coffee & food are good too.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-01", "description": "A nice coffee shop with decent food. Their drinks are well made, and the place is nice to sit and chat or sit and study. However, the main knock against this place is the extremely short hours. It'll close at 6PM, preventing any post-dinner coffee drinks or even pre-dinner coffee. If you're an early morning person, this may work out for you, but if you wanna grab a coffee later in the afternoon, you may have to go elsewhere to get your fix", "author": "Oliver Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "I recently discovered Cafe Coco and I'm glad I did. So far all of my experiences have been great. Their prices aren't ridiculous either like other cafes. Simply put good food, good service, and a nice ambiance.", "author": "Jonanny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "Stopped by for lunch today and grabbed a latte and a sandwich and I must say I was really surprised by how good the coffee was. The sandwich was tasty and the customer service was very friendly. I would definitely recommend this place if you're looking for a coffee fix or a quick lunch.", "author": "Alex D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-17", "description": "The group I was with rented an Airbnb spot a few blocks away from Cafe Coco during a week long conference in San Francisco.  My buddy and I walked that few block stretch each morning, past other coffee shops, to get more of Cafe Coco's excellent coffee.  Their breakfast bagels are good, line was never long and coffee is a beautiful deep roast with more than just a hint of chocolate.  If I lived in the city I'd stop by as often as I could.", "author": "Kenny J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "There's no chai latte like the ones made at Cafe Coco.  The sandwiches are good too and I've only tried one salad which was ok.  Overall this place is cozy with lots of places to sit and is a quality breakfast or lunch spot.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-14", "description": "What a great place. I only walked in to grab a cup of coffee, but the woman with beautiful eyes behind the counter treated me as I ordered a big meal.\nShe switched the TV channel to cartoons for my toddler who otherwise would be bored, and she handed me the key with a nice smile when she realized I was moving the stroller towards the restroom. \nPeople like her can really make our day, can't they?\nThank you for your wonderful coffee COCO!", "author": "Vicky K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-01", "description": "From four stars to two stars why do you ask? I ordered a bagel here and it was pretty small for a bagel, it looks like they buy them at a grocery store and not order them from a proper place that makes bagels for example house of bagels. Their sandwiches have exotic names and doesn't taste anything special as the name of their sandwich. I told them that I wanted my sandwich hot and it turned out less than Luke warm. Maybe their oven is broken oh well what a shame", "author": "Lawrence F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-28", "description": "Excellent location, cheerful service, very clean and spacious. $1.75 for small house coffee of organic Costa Rican origin that pairs perfectly with chocolate! Sure ill give them five stars.", "author": "Libra J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-01", "description": "I just go for last minute coffees on the way to the bus, its decent. Have only had drip coffee. They have the biggest selection of meal replacement bars (lunabar, lara bar, zone perfect, balance) etc. outside of wholefoods. And tons of random snacks and chocolates/candies to cater any taste bud. The sandwiches look really good and are reasonably priced, but haven't tried them. I am intrigued by the 'balzac'. Cafe coco seems like it's here for the long run despite the lack of yelp reviews. I walk by it several times each day and there's always people in there from open to close. Check it out and keep up the good work coco, i need you for when I'm feeling too lazy to make coffee in the french press and you're the reason my roommate gets out of bed on sunday mornings. Thanks.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-23", "description": "Good coffee, good service, good sandwiches (decent pastries), friendly owners.\n\nThis has been a very welcome change to a dilapidated corner of Geary.", "author": "Debra H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "fast free wifi for customers.\n\nlots of snack options: pastries.  fresh fruit salad.  cold pasta salads.  dolmas.  and they sell food bars: Kind bars, Larabar, Uber bar, Clifbars.\n\ngood lighting.  tons of seating.  spacious.", "author": "George K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "This is a lovely place for lunch, coffee, and snacks. I came here for lunch on a Saturday, based on Yelp reviews. My husband and I got salads (the quinoa and the fresh corn) and espresso drinks, all delicious. The staff was super friendly and the atmosphere comfortable and aesthetically pleasing. Also, they have gluten-free baked goods (Wow brand), which was a plus for me being gluten-intolerant. I'll definitely come here again when I'm in the area.", "author": "Juli C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-02", "description": "I go here a decent amount because my bus stop is right on the corner of this cafe.  The smells of their food and coffee pretty much draw you in.  The staff have always been extremely friendly and talkative/attentive.  I really like that about this place.  It's never overly crowded like starbucks and their coffee is delicious!  What more can you ask for?\n\nWhat's also nice is the breakfast bagel sandwich looks just as advertised in the pictures on their yelp profile.\n\nI don't always buy coffee made to order, but when I do, I go to Cafe Coco!", "author": "Terence G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-14", "description": "It's 6:45am on Monday. I'm outside...I thought they opened at 630? Not efficient! Need to have better time management.", "author": "SF S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-24", "description": "Cute little cafe with free wifi. I normally get the iced coffee and sit and get some work done. The staff are nice and it is a pretty quiet spot between 5-7pm.", "author": "Camille B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-11", "description": "5 Stars for this cute little cafe based solely on friendly service with a smile.  It's been a long time since I've been to a place that actually appreciated my business.  Oh yeah ... the coffee's good too.", "author": "Russell D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-04", "description": "Came here with a friend to talk and grab a bite to eat. This is a new place because it used to be a shoe store. I ordered a coffee and a morning bun. The place is spacious and clean. There are lots of tables and chairs to sit. The coffee was fine and morning bun tasted average. My friend had a sandwich. I don't remember which one, but the cafe seemed to have ran out of the type of bread she wanted. I thought that was strange because I thought they would have been fully stocked since they are new. My friend wanted her sandwich on ciabatta bread, but settled on wheat instead. There were two people working there, and they both seemed nice. The only critique I have is that they don't seem to have anything that makes them stand out from the other cafes. It's probably a great place for people to study.", "author": "Anh W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-09", "description": "I love their snack bar. Not extremely comfy seats. But they have wifi.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-14", "description": "This is a great new location for a new cafe. While you're waiting for the bus, you can pop in and grab a coffee and a pastry. Their latest house coffee available was a delicious Costa Rican organic roast. They also have sandwiches and salads for sale that I look forward to trying.  The cafe is large and is a great stop for a quick coffee. If I wanted to hang out for a longer period of time I would head to Cafe la Flore or Blue Danube, but this is certainly a great new addition to the neighborhood.", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-06", "description": "Cafe Coco is a wonderful place -- warm and welcoming, beautifully redone by the owners.  The baristas Georgianna and Marcia are very nice.  The music is often good -- not your typical KOIT Light Rock Less Talk garbage.  Most of the tables have electrical outlets nearby.  When Javaholics closed, I found refuge here...and I like it better!  Javaholics was an icebox, and Cafe Coco is well heated.  \n\nA winner!", "author": "Vicky J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-02", "description": "This place is right next door to where I work, so it is my go-to if I want a quick sandwich or latte for a pick me up. I haven't tried their salads, which I heard were good, but I do like their vegetarian sandwhiches, especially the Proust (I order w/o sprouts and with sauteed onions) and the Caprese sandwich. They also have a good assortment of baked goods and vegan/organic cookies which is nice. Free wifi while you hang out there, too. It's right in front of the 38 bus stop, so sometimes you'll see some flavorful peeps hanging around, but they don't bother you while you're nomming away.", "author": "Marie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "Great cafe with lots of healthy options!  This will be a new favorite!", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-17", "description": "I love this place. Always good for a quick coffee and snack. I also routinely get their fantastic sandwiches (The Balzac or spicy Roastbeef special are tops) for lunch. Great vibe, and the staff is always incredibly nice and fun to chat with.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-24", "description": "Today, my friend and I felt like trying out the new cafe on 6th ave and geary. The worker there was really friendly and kind. I wasn't sure what to order since i don't really like straight up coffee. The worker suggested a white chocolate mocha. I took her advice and it turned out to be really good. The prices isn't bad and i love to have another cup of coffee there and also try out their menu. I hope they stick around geary so i won't have to go all the way down to starbucks to grab one.", "author": "Yannie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-04", "description": "I had tea there while I waited for a friend who was next door at Kaiser.  The menu looked good, service with a smile and they had gluten and dairy free snacks available.  Always a plus in my book.  There was limited space for working (and charging) but that's because it's a popular place.", "author": "Kendra C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-30", "description": "Wow this place deletes honest reviews.  Poor customer service and extremely rude staff. Kicked a homeless man out even though he paid for his coffer !", "author": "Steven C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-03", "description": "Stopped in to take a break from the rain and apartment hunting to have the turkey/avocado sandwich and a coffee. Both were great. The sandwich especially. Highly recommended. Wi-fi and plug-ins avail. Decent and clean atmosphere.", "author": "Ben K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "Loved the quinoa salad as it was huge and filled with fresh veggies! This was also a great place to watch the World Cup game. The staff was so friendly, helpful, and generously let numerous people hang out for the duration of the game. It also seemed to be a great space for people to work as many pre-game were working on their laptops.", "author": "Mandy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "Cannot go with the complainers. When i had a stomache problem and ask for a cinnamon bagel they had no left but made me a bagel with jelly, trying to figure out what is good for me. Very nice people.", "author": "Roseanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-15", "description": "Fantastic cafe!!! Awesome coffee drinks, friendly staff, great atmosphere .....Top notch! Try the Rabelais sandwich .....But be warned, I have found it to be addicting!!!!", "author": "Paul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-19", "description": "The best Employee there is Martha. She does mostly everything! She is awesome! She can make anything fast when really busy. All the other young girls seem upset & don't know what there doing. Ask for the Latina lady(Martha) she is the best, very friendly!! Good job to the owner on hiring her. Five stars for Martha & for the food & the ambiance!", "author": "Foodlover R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "I'm so happy that a cafe with delicious snacks, great tea selection and unlimited wi-fi opened up in my neighborhood! And a bonus, it's right next to the 38, and 44 bus stops! Service was awesome, this place is clean, spacious, light, with lots of plugs. Great place for studying or for a quick bite. Thanks Coco!", "author": "Marina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-18", "description": "This review is for the cappuccino! It is delicious!!!!!! I have never found smt better in SF.", "author": "LAURA D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-15", "description": "good coffee, tasty snacks, friendly service, glad this is here for all the times the 44 bus keeps me waiting forever and ever.", "author": "trum d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-24", "description": "I stopped by for lunch on Friday and was very impressed! The place was charming and has free wifi! I had the balzac which is a very delicious turkey, avocado and spinach sandwich with sun dried tomato! I don't usually make reviews for places but this is definitely a place you will want to stop on by and try. Staff was very friendly too! If you can, ask for sandwich maker Martha she's very friendly and funny and makes a sandwich to die for!!! I'm recommending this place to all my friends!", "author": "Kat M."}
