{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "Terminus, as in the final place you will remember being at...before waking up the next morning.\n\nThis place is so easy to grab a drink at; it feels like the bar is on the sidewalk since the front of the place is full glass and not very deep.  \n\nIt is a small place but it makes up for it in liquor selection.  \n\nThe bartenders make sure you get to where you came in to go...get drunk!  \n\nThere's seating outside where you can smoke the night away properly.  \n\nThere's only one bathroom so it can get stuck if somebody is too drunk and lost inside.\n\nThis is the after work, neighborhood get-drunk-quick-hang-out-all-night-meet-cool-people-and-smoke spot.", "author": "John M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-15", "description": "A tiny little bar known for their fancy cocktails that has wisely decided to offer breakfast and lunch during workday hours when people shouldn't really be drinking.  A limited menu and a bit hit or miss at times.  Quite reasonably priced for the FiDi though.\n\nBlueberry Muffin: Felt like something out of a Seinfeld episode.  The muffin top was pure heaven and the muffin bottom was kinda nasty.  The top was so airy and had a great crust on the portions exposed to the oven.  Only downside of the top was that not many blueberries rose in there.  Meanwhile, the bottom had a lot of blueberries, but the dough was off.  Like it was a tad under cooked.  I wonder if that's because it had such a wide circumference.  I only had a few nibbles before giving up.  Thankfully the large muffin top was quite filling.\n\nCiabatta Bread: I was skeptical at first.  It looked like a lunch sandwich that happened to have cream cheese on it.  Turned out I was being too bagel biased; it was delicious!  First of all the cream cheese wasn't spread, it was in thick slices that were just as creamy as a spread but in a larger portion.  The crispy bacon and ripe tomatoes were a very nice flavor and texture contrast.  And the ciabatta roll itself was chewy and had  a nice crunch, so it was bagel-like, except not as dense.\n\nRoast Beef Sandwich: Felt like there was too much lettuce on this and it wasn't even good lettuce.  The roast beef was tasty enough; better than Subway quality but not as good as joint that specializes in it (e.g. Top Round).  The bread was decent; don't think it needed to be toasted though.  I enjoyed the creamy horseradish, but felt like this sandwich was missing cheese (bleu would have been perfect).", "author": "Adam B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-14", "description": "The bar is great.  Bar tenders are friendly and funny, and tend to make really good cocktails.  It gets pretty busy here after work, but if you get there in time to snag a place its worth it. \n\nThe food is the reason for my low review. Had a lunch once and it was a tuna salad that literally had one piece of tuna that was one square inch large.  Went back and they gave me a new one, but still it was annoying. \n\nGot a breakfast burrito this morning, it was a good price, but pretty poor quality.  The tortilla, cheese, and bacon were just thrown in the microwave, and then some eggs that had obviously just been sitting there were thrown on top.  All the cheese and bacon grease that came out during the microwave just left you with a really sad soggy burrito.", "author": "Lily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Hubby and I came on a late night run! \n\nLove it! \n\nHip hop music!!\n\nCool bar and outdoor open seating. \n\nCool staff too.  Thank you Carlos!!\n\nAlagash white $8\nModelo $4", "author": "Miranda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Came in after work and you know it can get crazy and be like omg I need a drink!\n\nThis place has a very cool vibe but what made it best was Nicks awesome customer service.  It wasn't just a hey what's up, it was more of a hey how are you now was your day and get to know you so you can be a regular the next time!\n\nHe practically made the best old fashion ive ever had and that I've never said before!\n\nThe old fashions come with High west and yes that's the well.  Right?\n\nYou all need to come and enjoy, relax, enjoy the ambiance and music that their amazing speakers boom out.\n\nI know I'll be a regular, that's for sure.  So should you!", "author": "Edward S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "My friend and I were looking for a bar close to the Embarcadero Bart station on a Sunday evening and decided to check Cafe Terminus based on the yelp reviews (it is also one of the few bars open on a Sunday evening in this area!)\n\nIt is only a 4 minute walk from the Bart station, and the place is really cool. It looks like a cafe from the outside with chairs lined along the window, and a bar from the inside. Once you go in, there's music and a big bar with a great alcohol selection. \n\nCocktails are $12. I ordered El Cholo (with mezcal, pineapple, and lemon juice) and loved it! Some wines are under $10 a glass, which is pretty affordable. \n\nThe staff is welcoming and the ambience is chill (although the later it gets, the louder the music). Overall, great spot to hang out with friends!", "author": "Ángela J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-06", "description": "I came here a few weeks ago, and really enjoyed that experience. I thought this might be one of my regular sports.\n\nSecond time, it's 1:30pm this past Wednesday. I wait at the bar for a few minutes but nobody comes. So, I sit down with my friend who arrived a few minutes earlier. She told me her chai tea was extremely spicy. I tasted it, and, although I love spicy food, it was bordering on undrinkable to me. So, we go back to the counter, and, finally, the lady comes up from the back after I waved. I asked if we could get another drink that's no so spicy, and she refused. She said all customers prefer it that spicy. I have trouble believing that every other customer prefer habanero chai tea, but, okay. So, I asked if we could get a coffee instead, because my friend can't physically drink it. She said that they are out of coffee, and only had coffee for cold brew. So, I asked if we could replace it with that, and she said, only if we paid for it.\n\nSo, 1:30pm, no coffee, and no chai tea, not to mention being treated extremely rudely, we left. I thought I'd found another regular spot for our weekly coffee, but instead, I will never come here again. My friend's stomach was still hurting by the time we got to another cafe.\n\nSo, Cafe Terminus. To save on the price of 10 cents worth of coffee, you lost two customers forever. Great business.", "author": "masa s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-19", "description": "Came here for a last minute drink and actually thought this was a different place when I told my friend to meet me here. It was packed on a Tuesday around six and had to stand near the bathroom. This place is pretty narrow and gets really busy although I am not sure why because I didn't think it was anything special in terms of ambiance or decor or anything.\n\nI feel like it's just a simple bar. No fancy cocktails but the bartenders were very nice and relatively quick. Would only come back here if I had to as nothing stood out much.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-31", "description": "Not loving this place at all. \n\nDay drink on a Sunday with practically no one at the bar. \n\n1) Took forever to take our order.\n2) Took a while to make our drinks. No one was really even at the bar. Ugh!\n3) Stingy pour, like com'on now you lazy heffer!\n4) No Mezcal...out of stock.... blah blah blah!\n5) Service was DEFINITELY lacking. \n\nI'm in no hurry to come back to this place everrrrrrrrrr! I hope you DON'T give this place a try. Cheers!", "author": "Owie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-12", "description": "Tough to rate this one. All depends on what you're looking for. After work happy hour location is great but with both doors open, the cigarette smell got overwhelming inside. Wafts of green bud radiated through the establishment a few times in the 2 hours that we were there. Were they smoking in the kitchen or what? Dice game crowd got very loud to the point of annoying. Most folks in the crowd were nice and pleasant but the noisy ones made it tough to enjoy the overall experience. \n\nOn the bright spot, $8 happy hour pints, $12 mules - pricing is reasonable for the location. Makes it worth a second attempt in a few weeks. Maybe the air will clear by then!", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "Very good cocktails and very unassuming place where you can hang out with friends. Not really a \"scene\" place or a place for a date in my opinion. Prices were normal.", "author": "Stefano Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "The 4 stars are for the great service! Changed my cocktail to a rosé, but friend's cocktails were great! My initial cocktail was the jalapeño sour. Love spices and love sours, had a good initial flavor, however could not drink it after 1 sip cause the jalapeño wasn't just a flavor, but a burn! Couldn't take the burn on my lips, had to ice it and dunk it cold water for a bit. Would not get that again but would definitely try the rest of their menu. Looking forward to it.", "author": "Maritess D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "Nice list of cocktails, friendly service, close to Bart, and open Sunday mid afternoon.  check, check, check.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Great little spot for drinks (I usually get a mule or an IPA). I'd be cautious coming here during happy hour though. Terminus is TINY. With limited bar seating, and only a few small tables to spare, this place gets crowded fast. Hope you like drinking with your bodies packed like sardines, because that's about as much room as you're gonna get. \n\nComing here in the morning is a totally different story though (coffee house by day, cocktail bar by night). Definitely not as crowded, but with all the same fast and friendly service. It's right off a Bart entrance, so it's super convenient making a quick morning coffee stop before heading to work.", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-31", "description": "Interesting spot in downtown San Francisco to catch up with an old friend over nice cocktails. Despite its nice interior, it comes off as rather pretentious and hipsterish; the pseudo-intellectual rich boy types. The service was a bit slow and a bit stingy on their pouring of drinks, plus some of the employees were lazing around.\n\nHowever, it looks nice and the outside looks gorgeous at night with lights and rains drowning the city.", "author": "Vincent V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Great spot for coffee, oatmeal, pastries, and conversation.  The coffee here is just brew from a thermos, but its perfectly good.  That said, I wouldn't come here for the roast, especially with so many exceptional roasting places nearby.\n\nI would come for the oatmeal though...lots of berries and cherries and nuts.  Mine was a deep purple stew of oats and fruits.  I skipped the brown sugar, which was fine because the berries made it plenty sweet and brown sugar would have masked those flavors.\n\nThey also serve one or two egg dishes, which looked pretty awesome.  It looked like the egg brkfst options rotate based on what the kitchen wants to prepare each day.  You don't have tons of brkfst choices here, it is more of a \"hey, whatcha serving?...ohh, that sounds good!\" kinda deal.\n\nI would also visit Cafe Terminus when I'm looking for a little less rushed place to sit and have a coffee mtg with a friend or for networking.  There's no loud music and no one calling out, \"Duane, I have a large frozen haff-caff macchiato for Duane!\"  They have comfortable seats and nice little tables inside, plus you can sit at bar stools if you'd prefer.\n\nThe Yelp reviews show that Cafe Terminus is also a bar by night...will have to go back sometime for that, too.", "author": "Lanny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Great old fashioned cocktail. Quick service.\nCould of easily stayed and had 10, then crawled home, but had to keep moving.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-03", "description": "Solid 3. The drinks were okay but on the pricier side for what it was. And not much beer selection either. The ambiance in general was a bit strange with the tables.", "author": "Alissa B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-05", "description": "There was this creep that tried to go into the bathroom with me and my friend. I think he either works there or friends with ppl there. Beware. Not a safe bar.", "author": "Robyn N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-22", "description": "Brutal service, grumpy bartenders. Never had a good experience here on the numerous times I've went", "author": "Mike D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "I've only tried the breakfast so far but I really like this place.\nIt's a mom and pop menu with a nice modern cafe vibe . I like that the menu is limited and changes daily - very farm to table feel. \n\nThey bake muffins fresh every morning for breakfast - the apple cranberry one is so good. Hope they make this again soon. The oatmeal is pretty good as well - instead of just putting toppings on plain oatmeal - they cook it with apples, cinnamon, and blueberries.\n\nI tried the baked eggs which is similar to a quiche - delicious! baked with potatoes, tomatoes, spinach, bacon - I really like this one, a nice change of pace from the standard egg and bagel.\n\nPrices are on the higher side but for the quality and daily menu selections - it's well worth it for Fidi area. ($3 for a muffin, $6 baked eggs, $3.50+ for a latte, $5 for a cup of oatmeal) Not a huge place - few tables and bar seating. They take credit cards - not sure if there is a minimum but I don't think so.", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "Plan A was Schroeder's. Unfortunately it was packed. Thanks to Yelp for helping us pull an effective audible.\n\nCoffee in the morning that turns into a bar a night? It works. \n\nWent with an old fashioned. It wasn't anything fancy but it did the job. Plenty of standing room, a few tables and decent sized bar. Loved the fact that it was only a block or so from Bart.", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "One of the best bars in SF!!!! Bartenders are cool, environment is real cool and the people are extremely cool. Recommend to anyone who likes to chill and have a good time.", "author": "terry t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "Cafe Terminus can either be the first or last stop to grab a drink depending on whether you are headed to or from BART or muni.  It is located right by the entrance to the Embarcadero station.  The little bar is laid back and has a low-key vibe.  Among the hustle and bustle of downtown SF, it could very well be a sanctuary to some.  \n\nA friend brought me there for a drink on a Sunday evening.  There wasn't much of a crowd but a few patrons drinking alone at the bar.  The bartender was nice and poured me a good glass of pinot noir as my friend had a Manhattan.  The wall of bottles seems like it would satisfy all types of drinkers.  Cocktail prices are on par with other bars in the area.  Wouldn't recommend for a group since this place is small.  I'd go back with a friend or two though.", "author": "Liv A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "Food tasted funky, not sure if it was spices or something else.  Chicken tortilla soup was more like a brown funky gravy.  Smoked chicken salad had an off putting taste.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-03", "description": "You know you've hit that \"oh god, I feel old\" point in your life when you experience one of these things:\n\n1. You start going to bed earlier because you're tired earlier\n2. You'd rather stay home on a Friday night instead of raging at the club\n3. You enjoy going to Bed Bath and Beyond\n4. You avoid crowded areas\n5. You start to work out because your metabolism just isn't the same anymore\n6. You start to see all your friends get engaged, married, or have babies\n7. Throwbacks are songs that you listened to a few (I mean, hella) years ago\n\nAnd worst of all...\n\n8. It takes less alcohol for you to get buzzed/drunk now\n\nLet's be real, I've experience most, if not all, of these things... but I still try to find ways to trick myself into thinking I'm still that wild party child I was at 21. \n\nOnce we got situated at a table seat at Cafe Terminus, we looked over the menu and decided we should try their cocktails. Too much beer just means more miles I'd have to run afterwards! (See? It's happening...)\n\nThe bartender warned David C. that the \"drinks won't be kind to us.\" David questions our decision, but I tell him, \"That's good! ... Right?\" \n\nCocktails are $12 (pretty typical for SF) and totally worth it! The Metro (bourbon, pastis, creme de griotte) was refreshing and easy to sip on. After ONE drink, we were both feelin' it. When has this ever happened!? Next time I'm going to dish out $12 for a cocktail, which is basically anytime I'm drinking in SF, I wouldn't mind coming back here! Cheers!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-28", "description": "Overpriced, pretentious, and full of hipsters. They didn't let me bring my drink in from outside (it was just a Gatorade with some vodka in it). After I threw it away and went in, I had to order a $15 cocktail that tasted worse than my Gatorade and was probably less alcoholic to boot. \n\nI hate San Francisco.", "author": "Dylan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "Came here the other day for HH and it wasn't as crowded as I thought.  A friend and I walked in and it was a really nice crowd, nothing douchey or sausage fest like.  \n\nThe bartenders were really nice and very attentive to who is sitting at the bar and on the tables.  It's really close to BART which is great for getting back home or commuting.   I didn't have any of there cocktails but it seems like everyone was enjoying them as well as the atmosphere in the bar.\n\nI'd call it more of a bar than cafe since I didn't have any food, didn't know they served food until I saw the Yelp page", "author": "Cliff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "Came here twice on a recent trip up to the city. Once for breakfast, where they proved to have a cool and interesting selection of options, good coffee, and one of the better bread puddings I've had outside of Louisiana. Just no whiskey sauce.\nThat said, I came back that night because they have one of the better bourbon selections I've seen anywhere. One more time, just to get the search term higher: BOURBON. The bartenders knew everything about what they had too. I had one in mind, but I bet they have something really nice that might be your new best booze friend (an unknown bourbon is just a friend you haven't met).\nAnd that could be two reviews for two different places, but I love the concept of having it be a cafe for the overworked Financial District folks to grab the breakfast they don't have time to make because they can't afford to live close enough to have a decent commute, and the bar where they can all come to wallow away their sorrows about having to commute in from Hayward. And wallow, they do, as the place was pretty busy when I came in.\nI hope to come back.", "author": "Colin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-05", "description": "My friends and I had a bar crawl of sorts and this was our fourth stop.\n\nMarch 20th, 2015\n*Trumer Pilsner, 4.8%, Berkeley, California ($6)\n*Metro: bourbon, pastis, blackcurrent liqueur ($11)\n*Baroness: bierbrand schaps, gran classico, amaro, lemon ($11)\n*Citizen's committee: gin, pastis, orgeat, mint, lemon ($11)\n\nI was done drinking, so I just ordered a beer. Everyone else ordered cocktails which they seemed to enjoy. My friends like dark so they gravitated towards the metro. I thought it was just a tad too sweet for my liking.\n\nThe space is small, but we came late on a Friday night, so it was pretty slow. We easily found a table for our party of 7. Ordered drinks at the bar and brought them back to the table. \n\nVery chill spot. Good if you're looking for a simple, no frills place to drink.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "It's a small dark bar, but the atmosphere was still nice and our bartender \"Shane\" was great. My girls and I stopped in specifically because of the name and we're fans of The Walking Dead, dorks I know. Our bartender played along and we just had a good time during our short visit there. Would love to make a stop again in the future.", "author": "Nani V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "Cute little cocktail bar conveniently located to Embarcadero center. A bit loud when full. Good selection of hand crafted cocktails and fresh juices.", "author": "Beth P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-06", "description": "Whiskey/liquor bar that serves breakfast and lunch. Small spot with outside seating on corner of drumm street. The salads were highly recommended from co-workers is I stopped by and tried the seasonal squash salad. It didn't blow my mind and for $11 a little overpriced. I hear the sandwiches are good but probably I'll try other places before coming back. It seems like a packed place after work to grab drinks so probably best to come then.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-16", "description": "The ambience of a gym locker room, cocktails that arrive looking half empty for $12 which is seemingly the new norm for cocktails in SF. I give Terminus a big meh.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Chill place in the heart of San Fransisco. Great beer and awesome cocktails!! Outstanding Bartender and awesome customer service! Great place!", "author": "Ralph H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-21", "description": "Cafe Terminus has been on my list of bars to try out and I tried it today for...breakfast. Not a lot of places that do both.  \n\nThey have a fairly small breakfast menu, muffins, oatmeal, yogurt and a couple of hot items. Eggs and the item that I got, avocado toast. It was really really good! Overall it is a cool spot and I liked it and will be back for drinks.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "1st night in the city and wasn't quite ready to head back home so we stopped into Café Terminus. After checking out the wall of booze I was even more confused on what I wanted to drink haha. The bartender for the night was Soule and I told him just make something sweet and girly please, celebrating my birthday weekend early.\n\nHe made a great grapefruit type drink and it was even made with fresh grapefruit juice and it tasted perfectly sweet & yummy! Plus he had a few other juices ready to be mixed into other drinks too.  Starting mingling with some other patrons, wound up doing some birthday shots. Yes it was a fun time.\n\nThis is a fun stop to end the night or even start your night off, I know I had a great time.", "author": "Monica O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-01", "description": "This place is cool.  Good drinks and a good environment.  Not stuffy and a good location.  My go to place to meet friends for drinks.", "author": "Lynda M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-10", "description": "Visited Terminus twice this week and ordered the following:\n\nLatte ($3) - Just average\n\nCoffee ($2) - I had high hopes since they roast their coffee.  Unfortunately, I was disappointed.  After placing my order, the lady gave me a cup to get my  own coffee from the air pot.  That's not why I was disappointed though...I was disappointed because the coffee wasn't strong and it had a sour taste.  YUCK!\n\nBlueberry Muffin ($3.50) - I got lucky because the muffins just came out of the oven.  I don't think I've ever eaten a muffin that's still hot/warm.  It's reasonably priced too as the muffin is huge!  It was a tad too sweet for me, but otherwise, A-OK!\n\nHours on Yelp are still not accurate.  The girl who works there told me they open at 8:30 a.m., but the text I received from Cafe Terminus said 8:00 a.m.  To be on the safe side, I suggest getting there at 8:30 a.m.", "author": "Candice H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-01", "description": "Not sure I know what all the fuss is about over this place.  Drinks were ok, atmosphere was closetish, prices were astronomical.", "author": "Ken F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-30", "description": "Cafe Terminus is a bar located in the Financial District of SF right off Market street between Spear and Main. A co-worker suggested going here for a few drinks to end a long day.\n\nFREQUENCY: I've drank at this establishment once.\n\nFOOD: We did not order any food while at Cafe Terminus so I can't speak on it. I'm assuming they have a standard bar menu.\n\nDRINK: I actually didn't get a good look at a menu so I can't say much besides they offer fountain and alcoholic beverages. I had a craft beer and a Moscow Mule. I'm a big fan of Moscow Mule's and the bartenders at Cafe Terminus no how to make a good one. I'd definitely enjoy trying more of their cocktails in the future.\n\nATMOSPHERE: I also can't speak to much of the atmosphere since we drank in Cafe Terminus' outdoor seating area. It's fun enjoying some beverages while conversing with co-workers and watching pedestrians walk by. The inside did look nice based off my quick walk to the restroom. From what I remember it was a standard bar decor. The bathroom does have a lock on it so you'll have to ask your server for the password to get in. This can be slightly upsetting if the server is very busy.\n\nSTAFF: My co-workers took turn ordering drinks at the bar so I didn't get to speak to the staff much. The bartender was able to get me the key code to the bathroom quickly and was pleasant during the exchange so I have no complaints.\n\nPAYMENT: Credit cards or cash were acceptable.\n\nCafe Terminus was a cool place to enjoy some drinks. I was in a bit of a rush my one time there so I'd like to go back and visit the establishment again. That'll give me an opportunity to give some more details in this review. But based off my small experience I'd recommend stopping by for some drinks with either co-workers of friends.", "author": "Christopher D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-03", "description": "Convenient location if you find yourself at the bottom of Market. Otherwise, not a lot to say about it.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-21", "description": "Cool bar, so different than other ones I've went to.  Love the scene.  Since it's in the financial district there are a lot of people going there on their lunch break.  Drinks were really good.  My friend and I had a blast here.", "author": "KB B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-04", "description": "The service was hard to swallow. They were unfortunately rude when you want to ask about what's good and what're the recommendations. And of course, no coffee for you in the afternoon. It's understandable and some of the cocktails can look good, as well as the ambience. But the service... couldn't even talk more than two sentences with the staff.", "author": "Dilys S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "Terminus!!!!  You never disappoint!  (although - real talk - somebody better PLEASE order that red Cynar again!).  Thank you for letting me bring my snacks and keeping it real...  Ray and Carlos always keep me smiling - Tim - not gonna lie - killed it w my Mezcal, Amaro, Negroni and Tommy....  let's just say!  Way to make a girl feel safe and welcome in a big scary city!  Thanks Terminus - You Rock!yyy", "author": "Meg A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-31", "description": "Came here on a HowAboutWe date that included 2 absinthe cocktails, tastings of 3 kinds of absinthe, and a roast beef sandwich.\n\nThe sandwich was surprisingly and amazingly tasty with delicious smoke flavor.  The bartender was very professional and knowledgeable about his absinthe.  We watched him do this thing and he was eager to show off his skills.  We felt like we were getting a private tasting and were really entertained Top notch, fella! And man, that absinthe was intense.\n\nThere was some sort of tech company after party going on so it was louder than usual (according to the bartender). We got pretty intoxicated and had a great time.  Would love to come back on a quieter evening.  Parking could be an issue for some drivers.", "author": "Trish P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-22", "description": "Well, my friend and I went in for a cocktail after work and I was blown away by how shitty and rude the bartender was.  \n\nVerbatim, this is what happened: \n\nMe:  \"Hey how's it going?  I'll have a High West Double Rye perfect manhattan straight up with a twist\"\n\nBartender: \"You don't say straight up, you say up\".\n\nMe:  \"But you know what I mean?\"\n\nBartender:  \"No, you don't say straight up, you say up, so I don't know what you mean.\"\n\nMy friend and I look at each other, totally blown away at how rude he's being.  So I look at my friend and say, \"who's THIS guy?\" while we both start laughing.  \n\nBartender:  \"You know what, get the fuck outta here, and fuck off, I'm not serving you\".  \n\nLet's just say, I couldn't WAIT to write this review.  Owner, if you're reading this I'm happy to talk to you about it, or come into the bar personally and show you which one it was.", "author": "Ted T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-29", "description": "Its like looking forward to a birthday present from your man. You are looking forward to it, he even seems excited to give it to you, it is wrapped beautifully....then you open it, and it is a vacuum cleaner. A nice vacuum cleaner even, but it just isn't what you were wishing for or expecting.\n\nMaybe I'm still miffed about the closing of Canteen, and never having that stuffed french toast again. But this is another copycat Sentinel, with a 50% more limited menu.  I had the pork sandwich with citrus and mint. It was that same great roll he used with the black and white sesame seeds, the pork was good, it was a tasty sandwich from anywhere else, but I expect more from Denis (and my boyfriend - do NOT get me a vacuum cleaner for my birthday).\n\nSo 3 stars might be kinda harsh, but it does mean \"A-OK\" and it is, But every other review to day is a perfect score of 5 so we need a little balance.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-24", "description": "I dig the decor and the drinks are pretty solid. It's a scosche pricy but I guess that's to be expected in the FiDi. \n\nThe lunch foods look good and I'll def be back to try them.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Loud, lack of seating, and drunk young female.    Perfect.    This place is good for after work drinks if you me aged 18 (fake ID needed) to 30.    After that your the old person in the crowd.     Don't let the bums nearby effect you.    Just walk around them as they are harmless.     It's a basic good old bar for drinks in a lively atmosphere due to the customers.", "author": "Phil B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-24", "description": "I used to really love this place when it first opened, but the food and service the last year has really diminished. I stopped coming in about 8 months ago but decided to give it another chance today; I was terribly disappointed again!  My lettuce was wilted, they forgot to add dressing to my salad, portions are a lot smaller, and they totally skimped on the smoked trout and potatoes. It's such a shame because this place was really good at one point.", "author": "Kenya M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "Over the weekend, I sort of went on a Yelp search frenzy looking for non-chain coffee establishments.  Things got kicked off with going to illy, and then it sort of escalated into wanting to take on a new place a few mornings out of the week to find a spot that has the best latte.\n\nCafe Terminus happens to be right across the street from my office, and if you walked by, you'd never guess they serve coffee and breakfast items at 8am.  Terminus is basically a one-stop shop for people like me: coffee/breakfast in the AM, lunch items at 12pm, and cocktails/beer in the PM.  So basically, YOU NEVER HAVE TO LEAVE!\n\nI haven't gotten around to trying the lunch or been by for a cocktail, but their latte was delish.  They roast their own coffee in house, and advertise a delectable blueberry muffin and oatmeal in the morning.  This is definitely a great option for me since the Peets/Starbucks line is generally at least a 15 minute wait during coffee rush hour.  Updates to follow after trying lunch there!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "This place is known for its cocktails, but don't sleep on it for coffee and breakfast.  They have vegan options like a bomb oatmeal that's sweetened to perfection and includes delicious fruit (and I'm not a huge oatmeal fan) and avocado toast with tomato and basil.  I also appreciate that they don't charge extra for almond milk.  That drives me nuts at other cafes.  \n\nThe decor is gorgeous, staff is nice and not pretentious and everything tastes great.  What more do you need half-asleep on a Monday?", "author": "Alyssa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-30", "description": "I loveD their chicken salad! Is delicious and the bread they give along with it is so good too! LoveD? Past tense? Don't love it anymore? \n\nRight. I am not a huge fan ever since they started skimping on the quantity of the greens, nuts and raisins. :-|\n\nOh, and no more andes with the salad either! :(", "author": "Mrinalini K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "After walking from the wharf back to the embarcadero Bart station we decided we'd snag a quick night cap at Café Terminus since we were in no rush and wanted to make sure our guests had a good time in the city. \n\nThere wasn't a formal menu of any kind but I deduced from the plentiful spirits selection that I could kindly ask the bartender for something and he'd be able to whip it up with ease. I actually didn't know what I felt like having, but I made sure to mention that I was a bourbon drinker. After a few quick questions (Spirit forward? Sweet or Bitter?) I had a nice little old fashioned inspired cocktail of my very own. The guests ordered a glass of crisp white and a rye whiskey neat and my beau grabbed a pilsner. \n\nOverall Café Terminus seems to have something for everyone whether you're a craft beer aficionado, wine drinker, or just dig the craft cocktail thing.", "author": "Siobhan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-12", "description": "I'm embarrassed to admit that I had never been to Canteen, Denis Leary's popular Tendernob spot. Don't you get all smug with me. You try writing 2,595 reviews and living up to an unearned reputation for eating everywhere. Yes, everywhere. No, I haven't eaten everywhere. Now look, I've had a sandwich at The Sentinel a few times, especially since it's usually located near where I've worked the past five years (review: http://bit.ly/19jetbn). I've also tried Leary's other spot, Golden West in Trinity Alley (review: http://bit.ly/1gIE4U0), and of course, I've had a few libations at House of Shields because well, who doesn't have a drink at House of Shields? (review: http://bit.ly/1gIEaer) But Jamie W. made me aware of their new spot near where the California Street cable car begins...or ends depending on where you're going.\n\nHe and his partner Eric Passetti sure keep busy because they've already opened another spot in the Tenderloin, Trocadero Club, before I even got a chance to jot down this review. We decided to go there for an after-work drink which is not Jamie's usual way of spending a weeknight evening. So I figured I should take advantage and  treat us to a round. It's a pretty compact spot with just a couple of tables for groups and the bar and a couple of counters along the perimeter (photo: http://bit.ly/17SYuae). It was a pretty quiet scene that night and the two guys at the bar barely acknowledged us after handing us the paper with the cocktail listing on it. Jamie was by-the-book and ordered the Citizen's Committee, an apt beverage for him since he is so civically minded. It was a smooth mix of gin, pastis, orgeat, mint and lemon (photo: http://bit.ly/1hEMjlg). Very Mad Men, very white-collar with cufflinks-type of drink.\n\nI decided on my standby, a Pimm's Cup which they didn't mind making off the menu with a little ginger ale (photo: http://bit.ly/170UMbE). Cocktails are a flat $10 each. It was all fine except the tall ceilings caused an echo effect that made the unexpurgated guffaws of the portly woman fifty feet away from me sound like she was yelling in my ear. Still, I was so entranced by their simple lunch menu (photo: http://bit.ly/1aDVsks) that I came back two days later and ordered the $9 \"Salvador Style\" Pork Shoulder Sandwich with Citrus, Napa Cabbage and Mint. It was served in a soft kaiser roll slathered in mayo, so I was a happy camper (photo: http://bit.ly/19je4WA). With a $2 bag of kettle chips and a $3 glass of lemonade, it started to add up, but the pork was fork-tender like something you'd get at a barbecue takeout. So indeed, it is like The Sentinel meets House of Shields, and that's not a bad marriage if Leary is the justice of the piece.\n\nFOOD/COCKTAILS - 4 stars...decent drinks and even better lunchtime options with the Leary signature treatment\nAMBIANCE - 3 stars...a rather small space, not that inviting. probably crowds up quickly\nSERVICE - 2.5 stars...a bit of a ho-hum on behalf of the servers here, could work on treating everyone as nicely as they do with pretty girls\nTOTAL - 4 stars...this terminus doesn't feel like the end", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-17", "description": "Updating my review since I've been here a few more times and I have to say that I love the deviled egg sandwich.  Yes this is the same sandwich that one can get at the Sentinel as well but i had my first one here.  Yes it isn't cheap but it's also vegetarian so my coworker who is vegetarian can have lunch with me.  I always can eat the entire thing even though half of the sandwich is really filling.  \n\nMy biggest worry when I come here or to the Sentinel is that they sell out of this sandwich since this is always a backup in case the lunch option that I do want is sold out.  \n\nOnce you find something magical, you hold onto it as long as you can and the deviled egg sandwich is one of them that I shall pledge my undying loyalty.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-02", "description": "If you ever wanted to stuff yourself into a phonebooth full of quasi-hipsters this will be close. Several not-quite-ready bartenders in training making weak drinks with the wrong proportions. Poor showing for the location.", "author": "Cyrus M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "Such a cool (typical) spot for drinks in SF. It's a small, somewhat intimate space with a nice selection of spirits and beers and wines and coffee--even breakfast options in the morning. \n\nThe gf ordered a bourbon cocktail and I grabbed a pilsner. My friends from out of town said they were too tired and blah blah, but I went ahead and got them some fernet--it's important to note that neither of them had experienced fernet before. They hesitated at first, sniffed it, made a whoa-that-smells-strong face, then took a sip...and made a whoa-that-tastes-strong-too face. And continued sipping til it was all gone. \n\nA success for sure.", "author": "Jon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "My first time visiting for a meeting on Friday morning. There were couple of people enjoying their breakfast. Not too crowded. \nThe place is small but it's very cute. The staff is not very friendly but then she was not super rude either so I guess that's alright. \nThey have limited menu option but...\nThe bacon and cheddar muffin though... It's huge! And yummy! It's crispy and warm and the fact that they bake it in house is just superb. Love every bite.", "author": "Haryati S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-26", "description": "2.5 stars. Review is for drinks at night, not the food. \n\nStopped by this place a few weeks ago for one last drink with a coworker. Like most places in SF, it's a pretty small establishment. The crowd inside was packed with people who all had the \"thirsty Thursday\" mentality coming straight from work in suits. Man was it crowded; there was nowhere to move. The one restroom is located in the rear left side and held a steady line the entire time I was there. Bartenders were friendly, however, when I instructed one of them how to make this drink I learned how to make in Mexico, he took what I told him and put a spin on it and adding things I didn't tell him to add. Uhhh what? This is my drink.", "author": "Stanley S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-23", "description": "This is a pretty nice simple drink place. Not fancy ambience but Cody enough to go with a small group of friends. The drinks were pretty good. We ordered some strong and some light drinks and they were all pretty tasty. Good place to chill after work.", "author": "Qianqi L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-13", "description": "I used to love this place but I haven't been for about  6 months (work travel and paternity leave). I went today and all the faces were different. As was the food, prices, and quality of service. I will not be returning and I strongly recommend you don't either.", "author": "Thomi V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "I stopped going to this place just because of the bartender.", "author": "Hassan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-01", "description": "Best lunch spot/bar that's opened in a while!\n\nDennis and Eric did it again! Easily becoming one of my favorite places to go. It is simple yet sheek (I think the inside of the place resembles a train and the tile was imported from Japan, so  I hear) and the crowd is just about what you would expect in the financial. The staff is friendly and nice and Will and Eric sure know how to make a drink. The sandwiches are amazing! The roast beef with cabbage is my favorite and the Cuban is slowly making its way up there. The prices are about what you would expect and the location is prime, right in front of the Hyatt embarcadero and the muni station. Good to come after work with your co-workers or just come and chat with some good people. Again, Eric, will it really kill you to play some yeeezy??? Lol\n\nAlright, stop reading this and just go!", "author": "Javier G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-24", "description": "Being a super tourist in the city, I decided to take a cable car ride to the financial district for...whatever reason. I do t even know lol. I took the California St. cable car to the very last stop and hopped off. I had to use a bathroom so I walked inside this place. At first I thought walked into a coffee shop but then I saw all the booze and thought why not!? It was only 10am anyways. So I sat down for a drink and spoke to the woman there. Real nice lady. She found out what bus I could take to get me to Chinatown because I didn't know. Good place for a quick drink! They even have coffee which I passed on because I wanted bourbon instead", "author": "Harry M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-23", "description": "I've been here for coffee in the morning and drinks at night. \n\nI got an Americano and it was about $3. The coffee is alright, but expensive as most things are in the Financial District. \n\nIn the evening time for drinks, it's alright if you're just getting a beer. But drinks are pretty expensive and service was kind of slow. What kind of bar has just one bartender on a Friday night? \n\nAll-in-all, it's okay. I'd probably still come here again since it's near work.", "author": "Manami K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "Did a large event here this past week for a large computer company +/- 50 people with drinks & appetizers.  Was very impressed!  The evening event went over vey well; the drinks and the appetizers were outstanding.  Both bartenders were very accommodating and professional.  We were promptly greeted by one who's a dead-ringer for Ben Affleck.  One of my colleague's ordered an Old Fashioned and I ordered a Boulevardier'.  Both were perfectly executed - was impressed that he knew the recipe for the Boulevardier off the top of his head-but then they do offer some pretty cool cocktails.  Did not get their names, but appreciated the care & concern for how they accommodated all of our guests.  The hostess passing hors devours' was also very personable - my personal favorite was the roast beef & horseradish.\n\nEric took very good care of us and made the billing aspect pretty darn painless as well.  Went the extra mile - and he did not have too... I feel it worked out quite well!\n\nWould go back in heart-beat!\n\nThank you-  Tom From DFW!", "author": "Tom H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "Breakfast : Ordered the oatmeal w fruits, $5.  Good portion and I like how the oatmeal is prepared.  Fruits are cooked witht he oats and it's quite good on its own.  Ordered it with brown sugar on the side.\n\nLunch: got there around 12:15 on a Monday.  Place was still empty but after we ordered and sat down, people started coming in, mostly for To-Go orders.\n\nI had the spicy pork sandwich, $9.  It was a good size.  Imagine pulled pork w mango.  It was good.  Will recommended to try.\n\nMy friend had the Vietnamese BBQ Beef, $9.  Generous portion.", "author": "Margaret W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "Nice little spot.  Stopped here for a quick bite and some internet before a meeting.  Food overdelivered - I had a chicken salad made with kale, golden raisins, and goat cheese. I thought it would be typical coffee shop food (Starbucks/Dunkin makes me want to scrape my taste buds off with a potato peeler) but again, was very pleasantly surprised.\n\nThen, the coffee. That coffee, though. So so so so good. Rich, savory, and especially nutty (which I love). \n\nTwo knocks: 1) there are, no exaggeration, zero plugs for computer cords in the place that customers can use, and 2) they sometimes run out of menu items.\n\nOverall, great spot!", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "Fantastic Fidi spot! Met a friend after work for some cocktails and catch up.\nMy Bartender Will was spot on, his cocktails where excellent!  . The space isn't real big, but comfortable bright atmosphere with clean lines. I did not eat any food, however I would definitely come back for lunch.", "author": "John C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-19", "description": "Not what it once was.  Service and food quality have pretty much fallen through the floor.\n\nThe sandwiches used to be delicious, with premium meats and house made bread.  Now, the meat seems cheap and processed and the bread is underbaked, if even house made.  Somehow, they thought it would be smart to combine chipotle aioli (it's on EVERY sandwich) with pear chutney, which makes a flavor very similar to chewing tobacco.", "author": "Lester B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "Favorite bartenders in SF, and favorite place for a drink (or several drinks, as is often the case) after work in SF. The cocktails here will knock you out.", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "Best salty dog I've had in a long time. Fresh squeezed juice! Great spot. Friendly bartenders.", "author": "Kimberly J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-22", "description": "i've been wanting to try cafe terminus for a while now! and last week, dropped by to grab a quick bite with my mentee from work. the lunch menu is pretty small with about 4-5 sandwiches and the same number of salad options. but everything looked pretty nomsies, and all around for $10 a piece. \n\nwe both got sandwiches - pulled pork for him, and roast beef for me. mine was cold though! which was sad - but the bun was really well made, and i could eat carbs for DAYYzzzzz.  anyhoo, i thought the sandwich had a bit too much creamyyy sauce. and it was cold. and meeps.\n\nanyhoo, the bar is nice, and the service is friendly. will be back for drinks, not food.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-08", "description": "If you go to Terminus for lunch, and you order a Brussels sprout salad because you have heard that they're delicious, you will enjoy it so much that you will throw caution to the wind and eat about half of the giant container for lunch. It will be so tasty that you will definitely want to carry the other half home for later, and you will end up eating another quarter of the sprouts on the ferry. About six hours later, when almost a pound of Brussels sprouts arrive at your intestines, you will gain wisdom and learn the important lesson that sprouts must be eaten with dignity, restraint, and above all, respect for their ability to render the human body temporarily both inflatable and combustible. Having imparted this insight, I will extinguish all open flames, tether myself to something sturdy, and pray to the goddess Brassica for mercy. Good night.", "author": "K C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "ATMOSPHERE\ncame here for friend's company holiday party pretty cute and small cozy venue kind of perfect for events! Nice kind of atmosphere", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Child, this is the place to be after work, whether you slave away over a hot keyboard all day and need a stiff one before hopping the BART back to the East Bay or you run your little bum off waiting tables and slinging drinks in the FiDi or Ferry Building and close up between 9 and midnight. It has the best crowd, best bartenders and most honest drinks. They always got the game on, and they always got THEIR game on. Come & join us sometime.", "author": "LaShonda F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "The Ratatouille Salad at Terminus is AMAZING! It has chorizo and a fried egg and is a pound of food (the only way to fill up on veggies and meat). \n\nThey also have an awesome Chicken Kale salad, though I don't find it quite as filling as the Ratatouille.\n\nThe place looks pretty awesome, the folks behind the counter are super helpful and nice, and they use Square, which makes paying super fast. Not a ton of seating, so it's perfect for a grab and go lunch meal.\n\nSmall ammendment: They serve the Ratatouille in many forms. Sometimes you have to ask for it with chorizo. Trust me, it's much better with the chorizo. Also, they've now done an heirloom tomato and tuna confit salad, which was great, and a lentil, fig, shorizo, arugula, hazelnut salad that was RIDICULOUSLY INCREDIBLE. Check their daily  menu at terminussf.com to see if they have it because they change their specials daily based on available ingredients (the mark of a great place).", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "Some see this is as the end of the line, others will see it as the beginning. Cafe Terminus is the beginning, the end and the well-ridden line of bars, cocktails and cafes in San Francisco. Located right at the core of inner downtown is a bar cafe that captures the current times, along with an ode to the history of classic cafes in this city. Some cafes here are different than what you'd suspect in the name. It's not just about a place for a quick cup or a morning drop by, or a place where you pop up tablet and post up for three hours after spending three bucks on a cup. Instead, this type of cafe invites people to linger over a bar, over coffee & tea, too, along with being upfront about being a bar. \n\nOne aspect of the bar + restaurant industry in a major city to take advantage of is that the industry has serious professionals -- restaurant, hospitality groups and cocktail consultants. Cafe Terminus is from the Dennis Leary Group. You'll recognize them from the long-running, now-shuttered Canteen, the breakfast and lunch nooks of Golden West and The Sentinel, along with an upcoming bar Natoma Cabana, and the current Trocadero Club. Here they're capturing all aspects of their trade: breakfast, lunch, catering options, coffee, teas, and a well-crafted full bar. \n\nI can smell the absinthe. I can taste the Ricard and pastis. And the afternoon or lunch champagne. Or, all of it all at once.  The focus on afternoon aperitifs for their cocktail menu, including Ricard, pastis, absinthe and a drink called Death in the Afternoon, made for 4pm, keeps it straight forward with absinthe and champagne in a coupe cocktail glass. If you ask me, they're not trying to do too much, they're doing going beyond the standard, and executing it really well. \n\nA heavy-trafficed pit stop for tourists on the cable cars, and the suits on fly by lunches, and happy hours for all. The not so secret aspect of Terminus is they're open 'til 2am, and in this neighborhood that goes a long way when you want a classic late night in, of all things, a quiet downtown. Like 1964 Manhattan. One thing to embrace in San Francisco is that our population is in fact sparse for a major city. There are more bars per capita here than other major cities, which means sometimes you can find an establishment like this late at night to linger alone, on a date, after a late night of work. You can pony up here in denims or a dark-pleated suit. For the beginning of your day, for along the daily work train, or to end the days in a high ceiling-ed, dimly lit, modern space to begin it all over again.", "author": "Jon A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-01", "description": "Paid for a Trumer Pilser at 4pm with $20, got $9 back. Obnoxious bar tender that can't read ID cards either.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "Top notch bartenders here.  They're the same owners as Trocadero Club, Sentinel, and an upcoming bar called Natoma Cabana.  Great drinks - no cut corners.  The night I was here, I had a rye drink with honey and lemon zest.  They also had lots of little bites to taste - the spice rubbed beef and eggplant crostini's were delicious.  I look forward to coming back and actually trying the sandwiches.", "author": "Janet Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "My partner and I decided to drop by the place early this week for a late lunch.  While going over their menu, we both decided on a salad. Remembering Michael Bauer's review a while back about the scrumptiousness of their chicken salad and the amount of food on each order, I suggested that we share an order and I'm so glad we did!  They were so sweet to split the order when it was brought to us.  The salad itself is no longer as studded with chicken they way Bauer described it.  But it's still really tasty, with chopped up kale, toasted chickpeas, goat cheese, pumpkin seeds as well as golden raisins to cut through the acidity of the dressing.  They also cut the roll that comes with the salad in half.  Though the roll is somewhat stale, maybe from sitting around all day, we didn't really need it to round out our half of the salad, it's that filling.\n\nOne thing to mention:  They will serve you your food in a disposable container whether you eat in or have it to go.", "author": "Yvette F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-28", "description": "2 stars for location, probably should only be 1 star. It is right underneath my place of work. You cannot beat that in a happy hour spot. \n\nWhat you CAN beat is the snobbish attitude of the bar tender. A gentleman. I asked for a shot of fireball as we were celebrating a milestone. He replied, \"we don't have that here, its not that type of establishment.\"\nOh I am sorry - I thought this was a BAR, I guess it isn't. Apparently it is a snobby establishment with barely enough room to stand at the bar let alone enjoy a drink (its tiny, think linen closet).\n\nAfter being turned down a simple shot we asked what beers they had on tap, the reply, \"It depends what is your taste for beers.\" - How does it DEPEND? On what? You have it on tap or you don't.  \nI don't care I just want to know what you have on tap!!!\n\nWe did not order a beer and then asked what about their specialty cocktails. Again an annoying pompous answer from a bar tender who thinks their craft is excellent while they are really just helping me get drunk.\nHis answer, \"Depends on your pallet.\" OMFG STFU just give me a drink!!! \n\nWe then ordered three separate \"specialty cocktails\". They all sucked, in fact they were terrible. They all had no flavor besides an overwhelming Anis flavor (black licorice).\n\nNeedless to say this place is great.... I mean TERRIBLE. \n\nalso it is a little overpriced for a cocktail ($12 for a cocktail is too much, especially with happy hour prices around the area, the ambiance is not nice either).", "author": "Dakin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "Pretty cool new-to-me spot. Not many tables but we had no problem on a friday at 6pm. Bartenders are friendly, atmosphere is chill and not too loud. A nice change from the other Fidi bars like Royal Exchange,  Sens, Elephant Castle, and Schroeders. \nMy only suggestion, if you're going to keep the bow tie and white collar dress shirts, wear suspenders too; otherwise you look like a 50s ice cream shop or diner employee.", "author": "Guillermo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "Great Euro train station feel.   Amazing sandwich for only $9.  I ordered a vietnamese sandwich was was amazing.  Great lemonade.  Was fixin' for a beer but seeing as how it was only a Monday at lunch time, I refrained.   My friends loved their meals too.  Delicious, healthy, fresh.   Loved this place.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "Opening a top notch bar in the Financial District in the 21st Century takes chutzpah. Opening a bar that opens early for coffee and has a kitchen with a kickass lunch takes genius. Genius by way of Dennis Leary, Eric Passetti, and Will Herrera.\n\nI predict many a failed startup drunkenly launching here.", "author": "patrick g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-24", "description": "the fact that the guy behind the bar ordered the trout salad sans horseradish for me before i decided that i wanted the trout salad sans horseradish kinda makes me love this place. sure he was probably annoyed by my indecisiveness but so was i. \n\nhowever, had the salad been terrible (it wasn't), this review may have gone a different route. ;)\n\ni'll be back for the cookies. and that bottle of hendrick's.", "author": "Mayra S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-11", "description": "I liked this place because they had Matilda on tap. Never seen that before. But everything is overpriced here. Place is pretty dead on the weekend, I assume this place attracts the work crowd. Has a diner feel to it. Probably wouldn't come back here again.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "Ever see that movie Casino? Robert De Niro's character?\n\nAce Rothstein: From now on, I want you to put an equal amount of blueberries in each muffin.\nAce Rothstein: ...An equal amount of blueberries in each muffin.\nBaker: Do you know how long that's going to take?\nAce Rothstein: I don't care how long it takes. Put an equal amount in each muffin.\n\nI swear to god, Dennis (the chef) seems to pour cartons of blueberries into each muffin. YUMMMM.", "author": "Trinity M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "The stand up bar concept at Cafe Terminus is fun. It reminded me of the many bars found in Paris. Duck in for a quick drink and a coffee on the way to work and be on your way. \n\nWe arrived at 1:30, past the FiDi lunch rush. Unfortunately, all of the salads and the sandwich I wanted to try were sold out. So we opted for the Vietnamese style pork sandwich and the BBQ eggplant. We took our takeout and headed to nearest park to enjoy our lunch al fresco. \n\nUpon opening our take out containers, we realized we had been given the roast beef rather than the Vietnamese pork. I'm not sure how that miscommunication occurred, but it did. Instead of walking the few blocks back and demanding the sandwich I ordered, we decided to dig in and eat the roast beef, which was really good. Those smoked onions made it for me.  \n\nThe quality of sandwiches stands up to Denis Leary's other sandwich joint, the Sentinel. I was not disappointed, except for the fact that I didn't get the sandwich I had ordered.", "author": "Lee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-31", "description": "Wow!  fresh-made bread and pastries and fresh-roasted espresso for breakfast ... pure heaven.  Best espresso within walking distance of 1 Cal... by far.  Also the people are awesome!\n\nLunch - pork shoulder sandwhich was amazing.  Smoked trout was really good (maybe too much ginger) and everything tastes fresh and real ... no processed foods here (they even make there own mayo)\n\nThis is my new favorite place!", "author": "Ronan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-25", "description": "Great place! The sandwiches are delicious (I tried the pulled pork today) and it was great. It reminds me of a more Embarcadero location of The Sentinel on New Montgomery. Very nice staff, too. Check it out!", "author": "Mel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "I am a fan of everything that Dennis Leary has done and Cafe Terminus is no exception.  His muffins are to die for and it doesn't matter what flavor he has.  My wife always gets the oatmeal and has never been dis-satisfied.  I got the scrambled egg sandwich.  It is massive but oh so good..", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-30", "description": "Mad men.\n\nFor building brilliant roasted turkey and pear chutney on sweet homemade bread.\n\nFor creating delicious chocolate cookies the size of my Entertainment Weekly.\n\nFor offering companion approved homemade ginger lemonade and 2:30pm cocktails.\n\nWith a throwback '60s vibe we could easily been right at home in the Mad Men era. Only thing missing is a few more seats, but we made barstools at the table work.\n\nConsidering the friendly staff includes both men and women it's mad good all around.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "Nice fancy expensive sandwiches.   The time's i've been here the line wasn't too long.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-18", "description": "Wandered in here this afternoon. I saw the bottles going up, and wondered when this place would be open. There is still no signage anywhere, just a series of printed sheets outlining the simple menu, sandwiches and ceviche.\n\n I ordered the Cuban, because Cuban sandwiches are awesome. We got a 'take' on the classic Cuban, no press marks here. The bread was unbelievably light, fluffy, yet still rich. The pork shoulder was cooked well, the ham and cheese performed admirably, but the toppings is what makes this sandwich special. Mustard and horseradish provide a burning kick to the nose. Not heat, but that unique 'tear gas' burning sensation provided by horseradish and wasabi. Unexpected, and not wholly to the benefit of the entire package. The bread and butter pickles were an interesting choice over the more popular, snappy and sour dill, but it worked. They set the sandwich apart.\n\nWe also received complimentary brioche, or again, their 'take' on brioche. Imagine french toast with a crunchy, toasty outer shell, of course, dusted with powdered sugar.\n\nAfter being on an extremely low carb diet, I broke it here. Totally worth it.", "author": "Miguel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "Kind of a small bar but great selection of spirits and the staff is friendly. Love their sign about glutton and not being devil and that they bake their own pastries. Definitely recommend visiting if you are near by.", "author": "edward k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "I stumbled into this place and ended chatting with some great people who work here (Will is such a great guy!), delicious pastries (their house made blueberry muffin is to die for), and fantastic coffee. Really glad I found this place. Check it out yourself!", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "Finding a place to host an event in downtown SF can be tricky. The hotels are pricy and sort of dull. I was looking for a place to have an event close to the Hyatt Regency in the Embarcadero, my company is based in SD. My friend recommended Cafe Terminus, her company has held events at House of Shields in the past and spoke highly of their service. CT is owned by the same people so we thought it was safe to go with them.\n\nThey have a great selection of beer wine and cocktails, the decor is really nice and the passed appetizers far exceeded our expectations.\n\nLocation was perfect! Highly recommend this spot for people looking to have events.", "author": "Shirin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "I have yet to try the other offerings at Terminus, but I can say wholeheartedly that their freshly baked muffins are THE best I've ever had. The Apple Walnut is my fave and they're not available until after 9am. (Blame it on their small oven.) If you get there before 9am try the Blueberry. Another worthy alternative. They're so fluffy and have a great texture on the top. Best eaten warm!", "author": "Anna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-18", "description": "Amazing staff! Will and Michael are there to serve- they actually care!\nCheck it out before it gets crazy popular.", "author": "Je N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "Great bartenders - tho understaffed. Simple, easygoing spot.", "author": "Howe L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "Nifty little place. Had lunch here with friends on a weekday; could be hard to get a seat. The pulled pork sandwich wasn't bad; the mint gave it a somewhat nonstandard flavor. That said, it wasn't amazing either, and I wouldn't order it again. The steak sandwich was way better though. They also have a really great spicy sweet chai; 5 stars for that!", "author": "Linus W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "bartenders here are some of the most knowledgable in the city. Not to mention the spirit selection shows a high level of education on the owners behalf. Over 15 amarros, huge selection of whiskey, gin, vodka, rum. \n\nThis is the type of place where you can get a 3 dollar beer. Or a 200 dollar shot of some amazing spirits. as well as everything in between. \n\nCan't say enough wonderful things about terminus.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "Went here for the first time the other night. Good location and surprisingly was the only place open on Friday at 1030 in this neighborhood. Brian is a professional and knowledgable bartender that knows his whiskey. \n\nThere's no doubt that I'll come back to this place.", "author": "Rocky C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "AMAZING! Just flat out wow! I know I have a lack of bad reviews on yelp but thats because if it isn't good enough for me to log on to yelp and write a review, I'm too lazy to do it! \n\nAnyway, more importantly, I already love the set up and I've only been there for lunch but I've already tried 75% of the sandwich menu(only 4 sandwiches when I went which change ever so often)\n\nI ordered a deviled egg sandwich, steak(served rare) sandwich, and a pulled pork sandwich. WOW for alllll of those sandwichs! Surprisingly, I thought I would like the steak more than the pulled pork as I hate pulled pork but wrong again, pulled pork may have been the best sandwich out of them all let alone they make everything themselves(even the mayo and the bread). The BEST part of it all was seriously the bread, haven't had bread this good in a LONG TIME\n\nmust go to for lunch especially if you're in this part of the financial district!", "author": "Hubert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-08", "description": "Stopped into terminus café because we were staying at the Hyatt embarcadero and had some extra time to kill before dinner. Did not want to do the typical hotel bar thing in such a cool city. Bar tender was very nice and friendly. We noticed he knew all the patrons by name and a few people came in without ordering just to say hello and then leave. I had vodka martini (they did not have blue cheese stuffed olives :( which was disappointing, but the olives were on steroids and were delicious). My fiancé had a cucumber gin drink that the bar tender recommended as his favorite refreshing hot day drink and it was everything that was promised. We stayed, chatted, drank and enjoyed. Definitely recommend for unique pre-dinner drink.", "author": "Krysten P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "If you're in downtown, near the Embarcadero muni/BART station, and need a cup of delicious coffee, swing by here.  The cup o' joe was curiously tasty (forget which boutique roaster)... but the place is overall convenient, quick and serve up quality stuff.  Apparently, they can serve alcohol too, but seems like a super small watering hole (and which I've never been to.)", "author": "Dale K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-13", "description": "Yup, another hit from Denis Leary.  The Cuban sandwich (with pork shoulder, ham, Swiss cheese, mustard, and pickles) is sure to be another hit.  The focaccia-like bread (baked in-house) is amazing (slightly crunchy but light enough to keep this dish from being too heavy).  Worth the $10.\n\nLove the different assortment of meats (ham, different sizes of pulled pork) and also the pickles.  This will probably become another classic (like Leary's corned beef sandwich at the Sentinel).\n\nLooking forward to trying the roast beef with horseradish and smoked onions next time.\n\nCool space for drinks too (apparently they turn into a bar at night) although not a really a sit-down place because of its small space.", "author": "F. P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-17", "description": "Late night industry  spot for people working in the restaurant/ Hotels close by.   Walking distance to Embarcadero station.", "author": "Séamus C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-11", "description": "The bartender and two other girls working there on July 4th were extremely rude and unprofessional.  My friend was forced to buy a drink right as she was entering the bathroom and they still hassled her about using the bathroom.  Then they were mad at my friend for only buying one drink.  They were also giving the girls behind us a hard time who had also bought a drink for using the bathroom and demanded their receipts.  It is fine to have customers only use the bathroom but they don't have to be rude and childish about it.  Very unfriendly atmosphere.   We didn't even finish our drinks it was so unwelcoming.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "Came in here last year before, but it was uneventful, this time i came in afterwork and it was eventful, thanks to the excellent bartending by tim. Quick and efficient service, even remembered how our drinks were ordered.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "Awesome atmosphere and Tim is probably the nicest bartender in SF.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "Cafe Terminus is incredible! I thought the service and the food were simply outstanding! The location is so convenient and a great place to catch breakfast. So far I have had breakfast and lunch there and I'm looking forward to going to the bar this week to try that out, heard great things from my team.\n\nThe decoration is VERY upscale, everything is obviously brand new, clean and beautiful, but the service is remarkably professional and unpretentious. A rare combination for a financial district  restaurant. I will definitely be a regular here. HIGHLY RECOMMEND!", "author": "Rolf S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "This place does it right. Great Breakfast, seller lunch, and awesome cocktails.", "author": "Jordan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "GREAT FOOD at lunch for reasonable prices. We had a HUGE kale salad with chicken, nuts, oranges, etc. We also had the turkey, bacon, avocado sandwich with all the fixings. Both items were as fresh as can be, delicious, and very fairly priced.", "author": "Barry W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-03", "description": "I would give this place 5 stars for the deliciousness of their food but only 1 star for ease of use and success in getting food here.\n\nI have eaten lunch onsite once. I tried to buy a salad while out running errands one morning (at 10:30 am they told me I could come back at 11 because they were not done serving breakfast) consequently I bought lunch elsewhere. Today, I tried to call my order in but no one picks up the phone.  Then I tried texting in my order as the webpage suggests.  When I got no response I walked to the restaurant to see if my order had been received - it had not.  Turns out there is no phone onsite at the restaurant.  The phone number that is listed belongs to the manager and he was not working today.  Normally, he forwards texted orders to the cashier but that was not the case today.  The cashier agreed with me that it would be good to have a phone onsite.  She told me I could download the \"square\" app and place my orders that way.  REALLY?  I have to download an app to help them receive my order?  Believe me, I love the kale salad and am considering it, but really you should not make it so difficult for people to patronize your establishment.\n\nI am trying to be helpful here so please take this critique in the spirit in which it was written. I WANT YOU TO SUCCEED, but I can order from the Ramen Bar app in 5 seconds and it's ready when I get there. I should not have to try this hard to give you my money.  There is always a line out the door at Heydey and you could be experiencing the same level of success during the lunch hour if you didn't make it so difficult to patronize you.", "author": "Miki G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-16", "description": "Here's the lowdown: service sucks. The bartender is a jackass. He made my friend's drink, forgot to make mine, served 4 other people, still didn't make my drink, walked over chat up 2 girls who didn't care to talk to him, continued pestering them, they refused to high five him even though he stood there with his palm up waiting. Then went on break. Barstools are very uncomfortable. All in all, you're better off in the Hyatt bar across the street because its pretty and has excellent seating! Or go to Sens, or One Market. Or any of the many bars around the area. There's nothing exciting about Terminus.", "author": "Mick J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "I am fan definitely.  Never had the food, just the drinks.  Its a cool spot to hang with friends after work.  I have gotten annoyed a few times where at 5pm on a Thursday they have a private party and kick everyone out or dont let anyone in for a hour.  Overall, its a good place for Happy Hour.  I have to try the food though to get a full sense.", "author": "Raja D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "I have had the most amazing time in this place! They have amazing cocktails and the whole ambience is great!", "author": "Nupur S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "Consistently great food and terrific service. Their lunchtime kale salad with chicken is loaded with goat cheese, sunflower seeds and walnuts, and I believe the golden raisins are actually marinated in citrus vinaigrette -- it's details like this that elevate the food from great to tremendous. Worth the walk.", "author": "Marianne M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-16", "description": "Beef sandwich was excellent and on par with sentinel and golden west.  Bread roll was soft and fresh and their take on horseradish is delicious.  Beef was medium rare and soft.  Cinnamon coffee cake was included twice. Will go back to try other sandwiches and start happy hour at 2pm", "author": "Paul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-21", "description": "That chocolate chip cookie with walnuts was crazy delicious. Also the turkey with poached pear sando on (what seems to be) challah hits me right in the feelz and nomz. Will go for drinks. Great spot.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-05", "description": "I walk by here everyday & have never even seen this place, it's very subtle. Came on a Friday after work and it was surprisingly mellow for something in the Financial District around happy hour. The bartenders were quite nice. This is a nice low key place to grab a drink after work.", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-28", "description": "I've been here a couple times for drinks, and once for lunch. Delicious; every time. \n\nThey have a number of specialty cocktails with absinthe. I plan to try all of them at some point because the few that I had were unique and tasteful. They do have a couple beers on tap. \n\nRoast beef sandwich with cabbage and horseradish: win. \n(On this note: same owners as Golden West, another sandwich place nearby. The pulled pork and the short rib sandwiches are my favorite.)\n\nAnd the service is always great.", "author": "A S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "Great lo-key spot for after work drinks. Seating is limited but a good spot to go and take the edge off", "author": "Jonathan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-06", "description": "Had the ratatouille--pretty good, with goat cheese and poached egg, but it was a bit much as a standalone salad. Also had a Goose Island Matilda, fortunately poured into what looked like a brandy glass, as a pint would've made my afternoon very, very unproductive.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "Get the chicken kale salad. So delicious. Perfection. I'd like to come back for some casual catch-up cocktails with a friend after work. It's a pretty small venue. They only and about 3 2-seater tables and one 4-seater table, along with minimal bar space.", "author": "Adele A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-19", "description": "Came in twice for a sandwich that was featured on their daily menu only to be told it wasn't being offered.  Great place, but they still need to get their shit together.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "Terminus is right there, between Bart and work.  I like the place already because I go there sometimes for HH after work...sophisticated yet subtle design, cheerful bartenders, and comfortable/unintimidating setting.  One day I was running late, got out of Bart, saw a sign \"Breakfast\" in front of Terminus, and decided to give their coffee a shot.  I am a coffee snob and I know what good coffee is.  One sip into Terminus' coffee and I was like \"Hmmm..this is some serious gourmet stuff!!\"   And their muffins are soooo good!  Good coffee + muffin = go there 3x a week.", "author": "Sienna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "this place is awesome. I've popped my head in a few times but hadn't pulled the trigger until breakfast today. DAMN. Had a breakfast sandwich with some sort of pickled/caramelized onions and diced chorizo in scrambled eggs on a toasty sesame bun (which, I read on their sign, they made themselves). Browsed the bourbon selection at the bar while i waited (very briefly) for my sandwich to be made and they have one of my new favorite bourbons (thanks to a recent trip to Nashville), along with tons of other unique, high quality liquors. Would totally come back for a cocktail and to try out their lunch options. new favorite!", "author": "Jen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "Terminus is the best. Yelp needs to get their shit together + update the closed time because they're open until 2:00 AM everyday except Sunday (cause they're closed)", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-13", "description": "Vegetarian options are often flavorful, but lack a decent protein. I'd love to see them be more thoughtful about that.", "author": "S O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "I had the pork sandwich for lunch. It was pretty tasty and had a bit of a kick. I liked the fresh, homemade bread. My friend's steak salad was OK. I didn't really think the raw steak looked appetizing. She thought it was OK, but wasn't a fan of all the onions. I'll probably come back and try the egg salad since I read it's so amazing.", "author": "Noneya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "i just went to terminus for breakfast this morning and I LIKED it.  i had the scrambled eggs and cheese on the house made focaccia bread.  i also had their fancy shmancy coffee that's roasted there.  it was that smooth, low acid kind.\n\ni have to tell you, i usually don't care for  focaccia bread.  i do however, ADORE any bread that's home made so i tried it and YES, it was all that.  this is part of why i would consider terminus somewhat of a food experience.\n\nthey said the pastries were house made as well, and i can tell you the blueberry muffins (even though i don't really eat those either) looked very tempting.  \n\ni'm told they change the menu every day.  the chef writes it up in the morning.  the sandwiches and such they had on yesterday's menu looked delicious.  i'm also told you can view the current day's menu online, which i like.\n\nthe other thing i like is the service was impeccable and the place was empty.  oh yeah, and their prices were reasonable as well.  i do expect to be going there again, maybe for some GINGER LEMONADE (mmmmmm!)  or maybe some squash and brown sugar coffee cake, or a deviled egg sandwich (where else have you seen that on the menu?) \n\nthe only thing is, i wish their sandwiches were available in the morning so i can pick one up for lunch on my way to work.", "author": "lori s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "Fresh blueberry muffins and in-house roasted coffee, cool vibe, excellent customer service... What more could one want?", "author": "A M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "Have only had lunch here so far but the smoked trout salad is so incredibly good, I will have a hard time ordering anything else.  And the service rocks.", "author": "kilam n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-02", "description": "Cute place that just opened! Stopped in for a glass of wine and the bartender was friendly and attentive. It seems they already have a few regulars! I can't wait to get back and try some lunch there or some of their cocktails.", "author": "Amber M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-02", "description": "I'm rating this place solely for it's \"night life\". We came here New Year's Eve and it wasn't thaaaat packed yet service seemed slow. Too slow. And excuse me, but who runs out of ice on New Year's Eve? Don't most places expect to get slammed?? My friend was having a hard time getting drinks at the bar, I guess they were ignoring her. So then we got warm shots and warm chaser. Yuck. I haven't tried the food, but perhaps I might when I'm in the area.", "author": "Asia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "Service and cocktails are very yummy. It's a little too much of a scene for me but a nice place to meet up w people after work.", "author": "Poppy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-08", "description": "So, I really wanted to like this place since the staff was friendly, but unfortunately I was not a fan.  I asked if their breads have seeds on them, since I'm allergic, and was told yes.  I asked if all their sandwiches have seeds on them, and was also told yes.  So I ordered a salad.  It was fine, nothing spectacular.  One of my friends then sits down with the cuban sandwich - clearly without seeds.  That would have been helpful to know.  So, based on inaccurate information, I had a less than amazing salad for $11 and I'm still hungry.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-12", "description": "Enjoying one of the finest kale salads in town! Today's kale salad comes with roasted mushrooms. The dressing is delicious, the mushrooms are smokey and the kale is fresh and crunchy. Perfection! I'll be back for after dinner drinks some time very soon.", "author": "Steve J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "Went last night with a friend for cocktails. The bartender was extremely helpful with us decide what to order. Cocktails and service were excellent. They have a few very interesting drinks with Absinthe and Chartreuse. The location is really convenient. Decor-wise they try and have it feel like a euro train station feel with both coffee and cocktails with minimal smart furniture centered around the bar. I would definitively go back.", "author": "Jake T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-05", "description": "I was there once and my experience is following: The bartender is a snobby douche; the place is very small; the bathroom was nasty. The patrons there were ok (that's why I give 2 instead of 1 star).", "author": "H S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-01", "description": "I was there at 10:30 on a Friday and the bartender Brian could not have been bothered with being nice or pouring a drink.  He seemed less than impressed to make me a drink after after sitting there for 5 min waiting for him to acknowledge me.  Then I had to ask for a menu and he sighed... When I got the menu and asked for a drink he wasn't sure he could make it...I pass this place everyday and thought why not...now I know why not.", "author": "Meredith A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-03", "description": "I'm not a huge fan of the monster coffee chains. I prefer a mom and pop, but this spot...this spot right here has blown my mind. I work in downtown SF. I'm not going to spend $5 bucks a day in coffee, so I wandered down California to find a non imposing breakfast sign & I went in. Cafe Terminus is my new best breakfast/lunch spot of SF. The coffee is real good but what got me was the small but enticing menu. Everything is made in house & the egg sandwich with chorizo & caramelized onions on a sesame brioche bun was exceptional. I shared it with a co worker,who entail went back for lunch & brought back their roast beef sandwich. The mustard on it was spicy & flavorful. I haven't stopped in for happy hour yet, but there is always a crowd in there. Yes, they have a full bar as well. The space is not that big. They have a few tables( I think they can fit a bit more) that are normally full. You would never think that this full functioning bar had a simple but outstanding menu.", "author": "M G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-30", "description": "Brilliant!! Terminus reminds me of the cafés in Italy; walk in, grab a drink/coffee/snack at the counter, enjoy the ambiance, and go about your day. Such a great concept. Stopped in for breakfast and grabbed oatmeal-chock full of delicious fresh fruit and totally reasonably priced. Friend had the coffee cake, which was also delicious and fresh. As we left, they were hanging the lunch menus... honestly I wished I could stick around for lunch. I'll definitely be back!!!!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "This spot is a welcome refuge for service industry folks as well as throngs of thirsty young urban professionals downtown. The service is welcoming and professional; they hustle but remember your name and are quick to make conversation or give you a chuckle. The cocktails are inspired and reasonably priced. The drink menu is equal parts foreign delight, booze-nerd and old school classic. The location is comfortable and clean, the floor-length window/doors that open at either end of the bar create great airflow and the music is loud enough for you to hear and appreciate the eclectic mix without being obnoxious to the point of obliterating conversation. Terminus is a great spot that will no doubt become an institution in it's own time.", "author": "sarah s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-08", "description": "As someone who works downtown, I really appreciate the fact that someone is offering sandwiches with diverse flavors. I've been trying to go as frequently as possible before word spreads and they have a line out the door every day. The Cuban is top notch, as is the gin selection. Whatever Eric recommends off the menu that day (it changes daily), just go for it. He has yet to disappoint!", "author": "Sebastian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-10", "description": "My girlfriend and I purchased a HowAboutWe date for an absinthe tasting and sandwich and I specified the date I wanted 2 weeks in advance. However, Terminus never confirmed and HowAboutWe never notified me of anything so I show up thinking all is well and good only to find out that they don't have my name, but that doesn't matter. The owner was very apologetic and although the place was super crowded and busy they still were willing to give us the sandwich and the tasting, and also included a free absinthe cocktail which was really good. The service was really good also, there was only 1 bartender and the owner working in the front and they both periodically checked in on us to see how we were doing. Furthermore, the food was really good. I would definitely come here just for sandwiches on my lunch. Don't expect to come here and get a super divey drink like a long island though. They straight up told one person that they wouldn't make it for him. Twas funny.", "author": "Adam Y."}
