{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "I decided to order delivery from here and I have no regrets. The single burger with organic egg and bacon is amazing. If I had known it would be THAT good I would've ordered another one. Also the menu was so simple and straightforward. The only thing I forgot to get was a drink. :(\n\nAnyways, I also got the caliber fries which was also really delicious. I shared them with my mother and she rarely likes eating fries but she was impressed. \n\nOverall, If you're nearby or just want something good, try this place out.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-16", "description": "Patties were dry. Would recommend getting the single instead of the double.\n\nI ordered the double cheeseburger, calibur fries (cheese and grilled onions on top), and house ketchup. When my food came it reminded me of what I get at in-n-out. A new take on a classic with better ingredients perhaps. I bit into the burger and was disappointed. The beef wasn't moist at all, and there was barely any special sauce on the burger. I also  would've liked less onions on my fries. I really like the fries by themselves because they didn't have much salt, and the potato skins remained intact. The house ketchup was a blend that had a slight salsa texture to it, and tasted less salty. I've been noticing this new chunky looking ketchup around San Francisco, and I don't understand the appeal. \n\nI'd choose most fast food burger places over Calibur.", "author": "Keegan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "Story of my No-Burger Buddy and his Calibur experience in San Francisco's West Portal (*). I went with a friend who said he \"didn't like burgers that much\", and was, in his words, a \"I like my meats cured\" kind of guy. We order (I recommend the burgers medium well) and then have our burgers nicely delivered to the table. Thank you, Calibur team member, for bringing it over, sorry, I did have my nose in my phone as it was a website chat that came to my Slack, and I was checking to see that someone was responding (yep, I see that \"Paz is typing...\"). Back to burgers.\n\nWe start talking about \"activation\" techniques (he's a marketing guy), and I'm maybe 1.5 bites into my Calibur burger. I look at my buddy's basket and it's wiped clean, burger's gone, and he's surreptitiously licking his fingers. It's been like, 2 minutes since the burgers arrived.\n\nMe: (raising eyebrow archly) You're done...? Already?\nNo-Burger Buddy: (sheepishly) yeah...\nMe: I guess you were hungry.\nNBB: Well, you were talking more than me. So I was eating.\n\nI see what's happening, he's trying to say it's my fault he ate the burger so quickly. Like he couldn't get a word in. More like, his mouth was full.\n\nMe: We've been here, like 2 minutes. What are we going to do for the next 30 mins, since you're done?\nNBB: (eyeing my fries) You going to eat the no-tallow fries?\nMe: You bet your cured-meats-only a__ I am. You can have 1. Ok, 2.\n\nHe ate all my Calibur fries. Now I have to go there tomorrow to get the no-tallow fries, my burgery taste buds feel cheated of their birthright.\n\n* Calibur is an organic burgers fast-food restaurant in West Portal, been there a few years, super awesome on ingredients and taste. Calibur's burgers are so yummy and, surprisingly for a burger, super light on the tummy. And then there's the price: $6.99 for an ORGANIC burger, this delicious, this well made? Seriously? It's a no brainer. The no-tallow fries $3.50 are amazing. If you get to eat them because you have to share. Don't share, get your own, and put them in your basket and set little finger-sized mousetraps around it.", "author": "Vik C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "Burgers and fries are really good! Burgers are juicy but it's pretty pricy for a burger joint.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "This an awesome kind of hidden organic burger joint. Don't be fooled about an organic burger. I enjoyed it better than an in and out burger. The Calibur fries are much better than animal style fries. The milk shake was delicious. It was such a treat to find an organic burger that's so yummy West of Twin Peaks.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "This burger joint has been my favorite out of all. They never disappoint me. I typically order a cheeseburger with lettuce, and caramelized onions, an order of fries, and a chocolate milkshake. This may sound like any other burger place, but the one thing that makes me come back time after time is the \"Calibur Sauce\". I have no idea what's in this Sauce, but it is so flavorful and goes with any burger and fries combination. Service is great, they are quick and friendly. So, if you are craving a burger, go to Calibur.", "author": "Jello O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "We got delivery on a Wednesday night around 8pm and they came on time, food still warm. Love that their menu is simple and straightforward - they just do burgers, and they do them really well. \n\nTHE COST: About $50 total for 4 burgers, 2 fries - a filling dinner for four. \n\nTHE FOOD: \n* Single w/ Cheese, Red Onions ($7.74) - 4 stars\nTender, delicious patty, fresh ingredients. Good burger! My boyfriend added bacon and I wish I'd done that.\n\n* Garlic Fries ($4.50) - 3.5 stars\nTons of garlic. Generally their fries seem fresh cut, but could use more crisp! \n\n* Calibur Fries ($4.50) - 3 stars\nThis is a lot - and just not for me! These are probably better fresh, not as great for delivery. Once the fries get cold and the cheese/onion topping congealed, it's not the most appetizing thing.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "50's diner with all organic and local ingredients. Delicious burgers, fries, and shakes. They also have a veggie option. Seems like a lot of people order takeout and delivery here, but there are also inside and outside tables to eat in.", "author": "Lindsay L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "So I'm one of those people who rarely order burgers, but this place makes pretty damn good burgers!!\n\nLocated along West Portal, where you can find food and adventure in one street. \n\nPros:\n- Super straightforward menu, you customized your burger from the type of bun you want, to how you want your party cooked and the condiments. They also serve fries and shakes.\n- Service was good, the person working at the cashier was patient and helpful.\n- Simple interior with some tables for sitting.\n- Close to the West Portal Metro line so if you need to do afterwards, there you go.\n\nCons:\n- Parking on busy days is no bueno.\n\nLiterally the only place that cooks their patties the way you want it cooked. I like mine with a little pink (med well) and it came out juicy and oozing with flavors. My brother and bf both prefer medium and surprisingly both their burgers came out medium! Definitely try this place out if you want a juicy burger :)", "author": "Jerianne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "LOVE their burgers. \n\nTheir menu is simple, but the food is solid!\nI get the cheese burger with lettuce wrap, and I never leave with the heavy greasy feeling. \nThe fries are a must.\n\nThe owner is super nice and genuine... This is the perfect local business that everyone should patronize.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "We wanted something quick as we had our granddaughter with us. We ordered a salad with a burger on top. I added blue cheese & bacon. It was tasty and enough for a lunch portion. We also ordered chili & cheese fries. It was tasty I should have realized the chili would make the fries soggy; but still good. They carry  Alameda soda which had nice flavor. They charge $1 for refills; honor system.  I'd return! The person taking our order was very helpful and nice!", "author": "Terese C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "Burgers are delivered warm. Real thick meat patties inside, so a single would actually suffice. Not greasy, not soggy, just perfectly delicious. The loaded Calibur fries are delicious. Worth the money for what they charge. It's been too long since I've had a really good burger. It hit the spot. Calibur sauce is good, but the ketchup is off the chain. Yummy!", "author": "Gessa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "1/2 lb burger. Lettuce, tomato, grilled onion, Calibur sauce, cheddar cheese. Absolutely. Delicious. It would have had an easy 5 if things didn't feel a bit stingy. The Calibur Sauce (from what I noticed) was good except there wasn't nearly enough of it on the burger. They do give you house ketchup and let you know there's regular ketchup available if needed. (Kinda sweet but not bad,I'm a sucker for house made things) The cheese fries were meh, just a little cheese melted in top (I think more of a nacho type cheese is better than square cheese melted but just an opinion... the cheese was good quality so I'm not mad)The service was absolutely amazing! Liz took our order and was patient yet efficient when doing so. Offered to grill the jalapeños if I wanted. Then if I'm not mistaken the owner was the one doing the food running and it felt super genuine and homey. I don't doubt if I would have brought up my sauce or meat issue that he wouldn't have been happy to fix it... But again the food was good so I didn't want to bug. The refills for the (fun and delicious) sodas are $1. I would rather not feel the pressure and just have  you charge a $1 for the drink itself or keep the fountain behind the counter.. I do wish they would have asked how I wanted my burger cooked as im a medium rare typa' gal and they only served well done. The bun was what really took this meal and made it something tbh. Idk what the secret to it is but it's delish and held the whole thing together. All in all I will def be heading back to check it out again, maybe I'll get a bigger burger, extra sauce and regular or garlic fries.", "author": "Tommi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "I have had burgers here a couple of times and as burgers go, I think their burgers are made great. It tastes like an indulgence and has got all the right things going for it - meaty, juicy, & flavorful. \n\nI'd probably eat here more if I could burn enough calories daily - otherwise I'd be morbidly obese in a month - because they also make killer milkshakes. \n\nThe only thing I am not a fan of are their fries. They highly tout their tallow fried fries, but i think they are below average. They are not crispy enough and don't taste much different than non tallow fried fries.", "author": "Angelito R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "This place has a simple and straightforward menu for hamburgers. I liked the way the food was delivered to the table with the description of the burger written on the paper mat ( helpful if you forgot what you ordered between the counter and sitting down ) The bun is sweet and soft. The extras are good with a choice of cheeses. Their home tomato sauce was very nice.\nRefills on your drinks are $1. I didn't mind the sodas as they were not too sweet or syrupy.", "author": "Sue L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-17", "description": "Good burger, double wasn't dry like other reviews mentioned and they also have salads. Chicken is not an option and was difficult to find info on what Calibur sauce or Calibur fries were. Fries could be crispier. The average rating comes from the desire for more courtesy in the service. Tried to pick up my order and mr man-bun attendee acted like he was doing me a favor to hand me my order. What happened to \"how can I help you\"? Or \"I'll be right with you\"? Or \"thank you for coming\"? For the price, I'd still pick in-n-*** or super d***r but if you're in the neighborhood, they allow you to customize your burger and this is a decent option for good grub.", "author": "kiwi l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-09", "description": "Meh, the burgers here are as overpriced as they're over cooked. More than $15 for a double cheese burger and a side of fries at a no frills place? No juice whatsoever in the patties and they skimp on the lettuce and tomatoes. Never seen such thin veggies in burgers. If you have it the \"calibur\" way, get ready to slather on ketchup yourself because the patties are so damn dry. I could also barely detect any cheese on my burger.\n\nThe bun is a substantial brioche bun, which would be great for juicy patties to soak up juices, but alas, these burgers are cooked way past the point of being appetizing. I think they use good meat because I can taste the beefiness but the patties are too thick to cooked to medium well. I asked for medium rare but nope. If you're desperate for a burger, there's no other easy options in the area, unless you count bulls head, but it's more of a sit down. I guess when you're the only fish in the sleepy part of town, you can do well despite being subpar and overpriced. And the cashier was annoying and uppity. I've been here three times keep hoping that maybe the previous time was a fluke because the reviews are good but never again.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "I'm from sac came up to the city for the day and found this place on yelp. LOVE IT great customer service bomb food and excellent presentation\nI will be back next time I come to sf !", "author": "Melissa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "What a great burger! I had this bookmarked for months, and stopped by randomly on a Tuesday night and I'm so glad I did.\n\nThe place is clean, brightly lit, with a simple menu: burgers, fries, shakes, craft soda, salads. They also use local, organic, grass fed beef, so this is a bit more expensive than a diner burger, but so worth it to me.\n\nI had a single burger (1/4 lb) with pickles, lettuce, cheddar, mustard + mayo (although they recommend their house sauce), caramelized onions. The bun was toasted perfectly on both sides, so no soggy burger! I think the bun is pretty thick (also delicious - does not taste/have the texture of sliced white bread like in most casual burger joints), so next time I'll get the double patty to get the proportions of meat to bread to my liking. Anyway, I loved the burger.\n\nThe people working there were friendly and helpful. The restaurant wasn't too crowded and it looked like most people were regulars. I can see why. I can't wait to be back and try the fries, sodas, and milkshakes.", "author": "Nelya T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Ok I had to try this place out with grass fed beef cow .  Moo! Moo! This place is like hidden well in the West Portal district. I have never noticed it before. The M and K train  bus  lines pass by here.  I had tried another burger place just last Friday and thought about comparing it with this burger place as well since it's more of fast food gourmet burgers. Well I am glad I took a chance with this place because I can say more confidently that I will return here. \n\nThe burger was pretty big that what you normally see in fast food burger restaurants. They use real burger meat , meaning not like microwave patties. It's pretty thick, so I don't mind paying more for this burger. They grill it to medium or medium well. The beef is organic grass fed, so Holsteins cow  should have had a happy life eating natural grass at the Cream Co.. The bun is shiny and pretty and texture is different and I like it. If you open up the bun to inspect the burger, they use smaller red tomatoes  which I think tastes better.  Ingredients are fresh looking. Oh I forgot to mention that the brown paper wrapper on the burger was wrapped nicely and it caught the juices of the burger nicely.  Not oily burger or garlic fries. \n\nThey made my orders pretty quickly because I don't think I waited that long. It was nicely packed by the worker and delivered to my table.  I had ordered a single burger, double burger, garlic fries that came with fresh tomato sauce and Alameda Point soda fountain root beer. \n\nNot too busy on Sunday night at 5pm. There were take out drivers coming in to deliver burgers people too lazy to cook for the night or come in person. LOL  \n\nI would like to return to try a milkshake or soft serve  cone on hot day and try another burger with their Calibur sauce because they forgot to pack into my take out bag because I had order my sauces on the side.", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "The Calibur fries are great, the special Calibur sauce they put on the fries is very tasty.  I had the garlic fries and they were really good too. The burgers are good but I think the patties were somewhat over cooked which made the hamburger a little dry. Overall, I rate this place 5 because everything is very fresh and as you can see from the photo, the presentation is really about as good as it gets for burgers and fries.", "author": "Kim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Healthier, tastier, slightly less juicy In-N-Out (\"Calibur style\" is basically their version of it). I got the gluten-free bun, which was divine. And everything was super tasty without being too greasy. The handcrafted Alameda Point sodas were very flavorful and enjoyable, and the milkshake was heavy on the ice, light on the cream. Felt good afterwards in a way I normally don't after eating at burger places. Maybe because it was all organic? Can't wait to go back!", "author": "Omar Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-08", "description": "Not bad, actually pretty good. \n\nIn an area now overrun with the stroller mafia and overpriced meal choices, was confused by the window signs in this place showing $4.99 and $6.99 deals. Upon closer inspection, the \"deals\" were for a soda and fries or s milkshake and fries respectively. I don't know about you, but I usually go to a burger place mostly for a burger. But, I digress. \n\nHaving been disappointed by these types of places before, I cautiously checked them out recently. Burger and fries will set you back around $13-14 total. So, be prepared, this isn't In and Out. \n\nSeating is a few tables inside and a couple outside, I can see if it's busy you'll eat standing or make a friend. \n\nFood finally arrived, first thing that struck me was the excellent bun and a clear delicious dill pickle staring at me from inside. Looked fresh. And though I ordered a \"kids\" meal to test the waters, it seemed enough. Good size of fries but not much meat. \n\nTallow fries remind me of when BK and McD used to have decent fries, these were great, and even better with whatever that ketchup is that is on tap. And the kid burger was quite delicious despite the tiny patty, using fresh pickles makes a huge difference. I'll definitely splurge on a full burger someday when my appetite and Bitcoin balance justifies it. \n\nSo, all-in-all its a better burger than the silly \"deal\" signage and ambiance generally lets on. Looking forward to another visit sometime, trying to cut down on burgers but will keep this place on that \"when I do\" list.", "author": "T J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "A surprisingly good burger in what normally was a sleepy location. This type of spot is exactly what West Portal needs more of. Great food good pricing and super convenient if you need to grab a quick bite before jumping on Muni. They also make their own ketchup which is not only tasty but has less sugar and salt then the leading brand. It almost offsets the enormous Burger you get. But you're not eating a hamburger for health reasons so there you go.", "author": "ben R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-30", "description": "Calibur is a pretty decent burger place on West Portal, averaging ~$7 for a single cheeseburger without the add-ons (bacon, fried egg, or avocado). Despite the buns being too thick/dense and chewy, the burger itself was tasty. The beef patty was juicy, cooked to a medium/ medium-well. The fries were good too, crispy outside, soft on the inside. Order the fries \"Calibur style\", which is their version of a thousand island with mayo and relish blend with caramelized onions.\n\nService is quick and friendly, and the ambiance is very simple and bright. Limited outdoor seating is also available, which is nice option on a warm day.", "author": "Priscilla W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "Definitely better than the last time I was here. A bit on the pricey side since they use local and organic products. I got the single burger with an organic egg, Calibur sauce, onions, tomatoes with a side of fries and soda.  Flavors were just right and bonus is they had hot sauce!\n\nComing back here and is a good family spot as well", "author": "Me V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-15", "description": "It's was decent, but I Feel like for the price it just didn't shine enough to get four stars. \n\nThe meat of the burger was decent. I wasn't blown away, but definitely satisfied. \n\nAmount of toppings was fine, but not NEARLY enough sauce.  I got calibur sauce and mayonnaise and I couldn't really tell  there was much of any. Next time ask for extra sauce. Mushrooms were good.  My husband added an egg and it was way over cooked for him, so if you like it runny - make sure to specify. \n\nGarlic fries are standard. They were on the soft side and VERY oily. The house made ketchup was quite nice. \n\nThe artisan sodas were interesting. The black cherry wasn't too sweet. \n\nIt's a pretty small place, but was really not crowded on Saturday night. There is a tv which had sports on.  \n\nFood took about 10 minutes to come out.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "Pricey for two cheeseburgers, 1 garlic fry, 1 chili cheese fry and 2 shakes = $43\nTaste- excellent!!!  The homemade ketchup to die for!!  The staff were uber  friendly.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "Great burger place!! The buns are toasted, fresh ingredients, and so tasty. French fries are hot and crispy. House ketchup was yummy and their milkshake is authentic. I like their simple menu too which makes ordering very easy. Definitely will come back for a tasty burger.", "author": "Lena H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "Stopped here on a whim. The food was pretty good and they got my order right (I liked all the options.) I did feel like it was a bit expensive though. $23 for a burger, shake, and cheese fries, although I did add egg and bacon to my burger.", "author": "Estela M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Wow, what a great place. Once you find parking, this place is definitely a treat. Love the clean, fun decor and the friendly staff. The burgers are fantastic and so are the fries. We tried their homemade ketchup and Calibur sauce and wished we could take some home. We will definitely be back.", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-05", "description": "While visually appealing the Veggie Burger is bean based and it tastes more like a burrito than a burger. It has a very \"mushy\" texture.\n\nIf they added another non-beef option I'd give this place another try but for you vegetarians craving that burger taste, look elsewhere.", "author": "JeremyJT .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "Really nice burger! Got a triple. Greasy as a burger should be.\nFries with cheese were not so good. Fries was not crispy.\nGreat staff", "author": "Jens E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "First time that I've ate at this place. I'm very impressed. Very clean. Peaceful. Cool place to eat. Not that many menu selections but glad they have what I've want. The wait is not long. Food in good temperature and food taste delicious. Does not make you full or bloated but no longer felt hungry. I love that they have sodas that I have never tried before and shake was not sugary. Reasonable price and will go again.", "author": "C G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-30", "description": "A one-liner if you don't want to read: I would 100% rather buy an In-n-Out burger. \n\nThis might just be me, since I see a lot of good reviews, but I just wasn't impressed at all. \n\nThe place is quaint and fairly clean, and the staff is nice enough. But I didn't think the burger (and other items) were all that great, given its price point.\n\nWe got the 1/2 lb double (currently $8.99)The burger had decent buns, but I think it says something when the patty is literally half the size of one of the buns. The beef patty was just soooo dry and basically well-done since it was so thin, and not seasoned enough. Everything else was standard. Nothing really stood out. They actually forgot onions on both of our burgers, but they were nice enough to provide some when we asked.\n\nIt's not on the menu, but we ordered garlic cheese fries. DON'T BOTHER. It was $4.49 (?!) for the cheddar fries (aka a small portion of also not really seasoned, borderline limp fries with one slice of sad melted cheese) + an additional $1.50 (?!?) for some kinda weird tasting garlic barely mixed in and dolloped on top. Tfw you're actually more impressed with McDonald's garlic fries than these???\n\nAnd the soda. I sound like I'm nitpicking at this point but like c'mon. $2.25 for one of those iced coffee cups of your off-brand fountain soda and then $1 for refills? But if your burger turned out as dry as ours...you just might need it.", "author": "Katerina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Triple burger calibur style!\nThe melting cheese, the delicious juices over flowing.\nAmazing.\n\n15$ for this wonderful creation. (Cheese was extra, added jalapeños)\nThe reason why I didn't give this 5 stars is because they cook their burger medium to medium well.\nI like my burgers medium rare, pink throughout.\nAside from that. Great! P", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-31", "description": "Maybe, I'm just being a jerk. I just ordered this on caviar. This bun is way too much, Not feeling it. Truly disappointed. So many good reviews. If you really think this is good you've never experienced Roam burger. Ended up giving it to my husky.", "author": "Sasha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-27", "description": "Tried the veggie burger, sort of a mix of bean patty and garden burger. It was ok, seasoned well. Bun was tasty and toasted. Vegetarian fries were standard (other option is fried in beef fat). I didn't ask for it but came with chunky ketchup, a bit sweet salsa like. I'm glad there was a vegetarian option but as a vegetarian I probably wouldn't go out of my way to come here again. Lots of toppings to customize your burger...for additional cost.", "author": "Sam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "Solid spot for \"Mmm I'm craving a something that will stick to my ribs and is moderately comfort-y but don't feel like cooking\" kind of evening. \n\nGood burger with good meat flavor, nice soft brioche bun, lettuce wraps for the Paleo/Keto types if needed. Shakes are decent. Fries in tallow are  good though not as brilliant as I expected, but solid!\n\nExcellent selection of toppings and add-ons available. \n\nPretty quick, manages a call in order well, friendly staff. \n\nI like that I can browse in a favorite bookshop next door while I wait.\n\nMy top pic for a burger near where I live if you aren't making it yourself at home.", "author": "Susan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-14", "description": "When I first heard about Calibur (thanks, Cat C.!), I practically bookmarked them immediately.  Not only did their burgers look and sound great, but their location is so convenient - across the street from Empire Theater in West Portal, where parking is pretty painless.  So, in this case, I really don't have an excuse for not making it here sooner, unfortunately.  One of these days, I'm sure I'll get to one of these places as fast as I bookmark them.  Hopefully...\n\nFrom the moment we stepped in, even though I hadn't been here before, Calibur felt mildly familiar.  From the pure white colored walls, to the red accents, to the (relatively) narrow menu, it had a loose resemblance to In N Out, albeit a little nicer and without the uniforms.  Still, despite the absence of pre-set combinations, there are plenty of ways you can customize your burger, starting with whether you want a single or double patty and ending with your choice of garnishes, sauces, and add-ons, which do have up-charges (https://www.yelp.com/biz_photos/calibur-san-francisco?select=6xbcS_5-u8dqPX3ItGLPcg).\n\n-- GARLIC FRIES...$4.49\n-- CALIBUR FRIES - French Fries topped with Grilled Onions and Calibur Sauce...$4.49\n(https://www.yelp.com/biz_photos/calibur-san-francisco?select=GqNIQy6ns5lhqKbuQEPVBg)\nBoth varieties had me excited, but neither blew me away.  Of the two, the Garlic Fries were better; crispy and garlicky, though all that rosemary was overwhelming.  As for the Calibur Fries, they're kind of like In N Out's Animal Style Fries, but without the cheese. Not bad, and pretty interesting, but the grilled onions, while sweet, tasted a little bitter/burnt.\n\n-- DOUBLE AMERICAN BURGER with Bacon (+$1.50) \"Calibur Style\" (Calibur Sauce, Lettuce, Tomatoes, and Grilled Onions, though I subbed them out for Raw Red Onions)...$9.49\n(https://www.yelp.com/biz_photos/calibur-san-francisco?select=55tgsPzMDMYsXSd3CJN0ww)\nGranted, I got the double, but this was still one hefty burger!  The patties (cooked med well) were juicy and well seasoned and the strips of bacon just made it meatier.  At the same time, the burger didn't feel overly greasy and I liked how soft the bun was.  Too bad you can't choose the type of cheese, though you can sub for $.50 more per patty.\n\nEven though I've only had their burgers once (for now...), I'm definitely a fan of Calibur.  They may fall short of comparably priced spots like Super Duper, but they're definitely better than most of the other neighborhood burger joints I've been to, like Tower Burger or Jenny's on 9th Ave.  Tasty burgers, friendly staff, awesome location...I'm a fan and will definitely be back for more!", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "The burgers here were delicious! The menu is small, but with the offered ingredients you really can customize the burger into a variety of combinations. My friend and I both enjoyed our burgers, and we also shared garlic fries which were also pretty good. I definitely think the burgers win over the fries. You pay right after you order, and usually at places like this, it's pretty much self service. But to our surprise, the employees actually brought our food out to us, and we didn't have to get up to grab it ourselves. Our server was also very nice.", "author": "Z C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "A great burger and delicious fries. I compare all burgers and fries to Roam, and while this burger isn't quite as good, it still rates. I love that the meat is organic, their house sauce is great, and the staff is always so kind and on top of it. \n\nThere is always ample seating, including a couple tables outside for nice days. This is an easy place to take kids or a baby too, since there is always good music playing and no one seems to mind a little extra noise.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "So, this is maybe my 5th time here. Always polite and thorough service, let's add considerate and client conscientious ... chomping on my cheese fries not paying attention and this kind gentleman walked by noticed I hadn't taken more than 2 bites out of my burger, little did he know the burger was perfect, and offered to redo my burger. I told him the hot cheesy fries had beckoned my attention and my stomach. My husband and I appreciated the attention and the gesture, so nice. \n\nHe retrieved a take home container and a bag and bussed our table. We were even given free shake samples. \n\nLove this place.", "author": "elizabeth c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "Tasty, juicy and \"complete\" burgers. The burgers hold themselves together really well and every bite was great. Sometimes I have a burger and find something is missing or that half the burger is just some bread and lettuce but not at Calibur.\n\nWe came hungry on a weekday at 2pm and the place was empty. I didn't hold back and had a double American Calibur style with added bacon and egg, so good, just the right amount of everything. I also got the garlic fries, the fries were cooked really well, the garlic was solid but didn't hook me enough that I wouldn't try something else next time.\n\nChocolate shake was yum and it was interesting to see a non \"Coca-Cola\" soda fountain (the coke was good too)!\n\nOverall a simple burger joint that does a solid burger and fries!", "author": "Tristan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-23", "description": "The food was not good at all,but what's worst is the rude staff this place has. Never will I spend one cent at this \"ORGANIC\" place again.", "author": "Edgar M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-28", "description": "Three stars for the food minus one star for the grumpy server who yelled at my husband when he asked about the shakes we had ordered for our kids. My husband wasn't in the wrong to ask. The server had dropped off the burgers and never mentioned the shakes are coming. 10 minutes later when my husband walked up to ask, the server's body language and words both shocked all of us. Not only did he do that once, he stayed that way. He was frowning when he came to pick up the empty plates. My son took longer to eat and my husband took the place to the front which was not unusual since this was a self service restaurant. Instead of thanking him, once again the server was rude. \nIn a restaurant full of Caucasians, we were the only Indians and it's hard to not think of the obvious when your Caucasian server has an edge that that he reserved only for you. \nWe are never going back.", "author": "Ashima S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "High quality food and very allergy safe.  No\nNuts, seafood, sesame \nLove the shake.  Tasty fries.  Great spot.", "author": "Pauline C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-04", "description": "Horrible service!!!! We got the garlic fries and it was literally floating in oil.... We asked for the fries to be changed to a regular one because after seeing the amount of oil i couldn't eat it. The manager walked out of kitchen and was trying to proof to me that it's fine that the amount of oil that they put in there is fine. He finally agreed to bring us a regular fries but after a minute or two the whole staff walked out of kitchen one by one and gave us \"the look\". Seriously, my family left there almost $100.00 and that's what we got! Never ever again i'm going back to that place!!!!", "author": "Svetlana D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Do you guys have your own farm? The ingredients were really fresh. Ask for no salt on your fries, it was a bit salty for my liking. The meat pattie was a bit thin, next time I'll get the double stacked.", "author": "Annie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Calibur was awesome! I loved the fact that they grind their own organic grass fed beef daily and their ingredients are all organic. \nI had a group of 20+ and contacted the business if it was possible to accommodate us, the place looks smaller... Sean replied and was SUPER helpful! He explained the ordering process when I arrived and even took his tablet to our reserved tables and took all our orders. \n\nGreat ingredients + friendly staff = a returning family!", "author": "Liz N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "The chili here is amazing! Seriously! You have to go try it! Great customer service too.", "author": "Brittany G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "this update is long overdue.  we have eaten at calibur multiple times since my last review and it has been wonderful.  when they first changed their menu there was definitely a dip in taste, quality and experience but they seemed to right the ship and this is one hell of a great burger and for the price, you cannot beat it.  \n\nwe have tried a variety of different things from calibur including the salad, burgers, grilled cheese and veggie burgers.  the salad is plentiful, rich with fresh veggies, and whatever additions you ask for.  its hearty and large enough to be an entree or split.  the burgers are great...juicy, fresh, great quality meat, and the bun is delicious!  the grilled cheese will bring you back to your childhood...its griddled and yummy comfort.  the veggie burger was not the best i have had but certainly not bad at all...it was solid and flavorful,  the fries are great...i suggest having them cooked crispy.  \n\nin all honesty i have not eaten in the actual place because i always order takeout but i can say that the food holds up great with delivery and is really a great burger.", "author": "Samantha B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "I thought this place would be really great and I think it probably is but the delivery was pretty screwed up. I ordered and didn't get my food for about an hour and a half. Sure, they (grubhub) gave me a coupon for next time, but the burger was pretty dry and the fries were soggy. I'd like to think that the food there is way better than what I had delivered. It makes me wonder though, if I ran a restaurant I might not want to send an order out the door that was sitting there under a heat lamp for over an hour. Or might want to reconsider my options for having food delivered. There are a lot, and Grubhub fell down hard on this one. They just didn't follow through well. Caveat Emptor!", "author": "Debbie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Great food, always great service. Only bad encounter was when the cashier asked me if I wanted lettuce and tomato on my BLT. Lol", "author": "Audra H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-07", "description": "Not bad. Was looking for a nearby lunch spot at West Portal and came across Calibur. Friend and I came here on a Sunday around 1PM. There were a couple others at the restaurant as well. The cashier was nice and friendly.\n\nWe ordered two single burgers and fries. The fries came with housemade ketchup, which tasted good. My friend didn't like it and opted for regular Heinz ketchup instead. The fries were nice and crisp. The burger itself was alright. I was not blown away. Think it would have been better if it were juicier. \n\nThis is a good place to stop if you are nearby, but not to make a trip out of going here. It's a fairly big restaurant, so you can bring a group if you wanted. Prices are fair. Not super cheap but paying for better quality.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Amazing burgers for the first time me and my boyfriend went to try this spot out we drove from San Jose to the city to find this spot, the manager/owner ? Not to sure was the most helpful person n very friendly! Best burgers ever you have to try!!", "author": "Jessica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-26", "description": "Really great local spot with legit burgers and fries. Came on a weekend night and it wasn't too crowded, so got a table and got to enjoy pretty quickly.\n\nBurger was good. Would have loved it even thicker and juicier and maybe even a bit more salty, but overall with bacon and cheese was really enjoyable. Not sure how they are outside of burgers - one of our kids' grilled cheese was mistakenly served as a cheeseburger - so probably stay on the core of the menu.\n\nA bit disappointed in the beverage options (shakes and sodas), so drank water.\n\nOverall good, but not worth a long trip.", "author": "Bob K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "The burgers were excellent! I love the sauce on the caliber burger. The fries were nice and thick and the customer service was great. I really thought the owners was nice and accommodating  and we would go back next time we go to SF .", "author": "Susie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Awesome burger.. what More can I say..fresh ingredients..perfectly cooked.will definitely eat here again next time I'm in Frisco.", "author": "Louie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-29", "description": "After a long day at work I tried to order delivery from Calibur as advertised on Yelp. When I tried to start the order a message \"delivery unavailable appeared.\" So fine, I called to place an order to pick up. Someone hung up. Tried again. Got answering machine. Message on answering machine said do not leave an order on this machine. Tried again. Same result. Next try-busy signal. I give up. Apparently, Calibur isn't into taking orders. Guess they have all the business they need.", "author": "Barbara C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-24", "description": "Info for vegetarians: The veggie style Calibur fries (with sauce and grilled onions) were very tasty. The veggie burger, on the other hand, was a disappointment. It was a bean patty with an assertive cumin flavor, which overpowered the flavors of all the toppings, which individually seemed fresh and good, but I couldn't taste them at all.", "author": "Carol A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "Ma and Pa burger spot, with all the delicious and healthy options and fixins with a vintage 50's feel with a touch of 'modernness'...This was our first time here;  we definitely frequent organic food restaurants and burger joints when we have cheat meals off of our meal prep planning.  We definitely support Ma & Pa businesses nowadays especially with all the corporate companies coming in and making it a little bit more difficult for them to survive.  We'll rate on a few items:\n\nAtmosphere 5/5 - relaxed and calm, with some good R&B playing in the background.  It was actually a perfect atmosphere for my girlfriend and I.  Plus the place was VERY clean.  We walked up and we were greeted by the cashier who was very friendly and definitely took pride in the 'human experience' of taking your order, giving excellent customer service and also describing what you were buying and/or asking about.  Our orders are always complicated because we have certain food allergies and choices so we take note if the person serving us is kind and patient or rude and inconsiderate. They were definitely kind here.  \n\nPrices 5/5 - not cheap nor expensive; everything is fair and priced right in my opinion.  Grass fed beef and organic ingredients are expensive, and owning a restaurant anywhere in the bay area is expensive.  No complaints here.  \n\nFood 5/5 - Burgers- we got lettuce wrap burgers with everything.  Beef patties were delicious and good sized.  All the veggies on the burger were fresh and tasty.  I normally hate pickles in my burger, but these were perfect, and the tomatoes were Roma, so they have a different taste (better than regular tomato's) Nothing was too seasoned or over cooked/spiced.  The meat tastes like MEAT, the way it's supposed to.  Not too lean or fatty, just right. The oils trickling off weren't too fatty or gross, but just perfect. All delicious and fresh.  The house sauce is bomb too. FRIES - we got garlic fries caliber style- these were amazing.  The soda is quality craft soda, sorta like HANSEN brand.  Very good quality.  My lady and I shared a diet soda and it was definitely better than any Diet Coke/Pepsi.  \nThey have homemade ketchup and house sauce- try both.  I love ketchup but hate how there is so much sugar in Heinz and other organic brands.  This ketchup was the biz  everything was just really tasty and excellent quality.  \n\nOverall- 15/15 perfect score from us.  this establishment is about quality and high standards from the chairs and tables, to the staffs attitude and all of that trickles into the food quality and presentation. The food was wrapped perfectly in the wrapper and every detail was carefully looked over.  After ordering we went back up to get another item to go.  We noticed a kind gentleman training a new employee behind the counter.  I could tell this man took a lot of pride in the business and really made a positive effort for success and training his employees. Having experience with many types of businesses, i asked him if he was the owner.  He said 'yes' and we chatted for quick minute.  He later brought our food to us and was VERY kind.   Thank you Sean for a great experience, we will return and recommend your business.  We wish your restaurant a lot of success and positivity.  The only feedback We will give is maybe hang some photos up on the walls, if you're into that-we were thinking classic muscle cars.  But if the plain white is the 'look' that's cool too.  We live in San Bruno, and will make the trip back!", "author": "Dom G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "A lazy Saturday (January 2nd) led me to lunch delivery. I wanted burgers and the roommate didn't want to leave the house, so we placed an order through Caviar. We submitted the order at 2:05pm and it arrived at 2:43pm. (I live in Outer Richmond.)\n\nPrices listed below are what Caviar charges. Comparing this to Calibur's online menu, prices are the same.\n\n*Quarter pounder: 1/4 pound patty served with caramelized onions, lettuce, tomato, pickle and house made ketchup ($6.95), add Heinz ketchup (free), Dijon mustard (free), Jalapeno (+$0.50), Mushroom (+$1.50), Bacon (+$2), Cheddar cheese (+$1.50)\n*Half pounder: 1/2 pound patty served with caramelized onions, lettuce, tomato, pickle and house made ketchup ($9.50), add Raw yellow onion (free), Heinz ketchup (free), Mayo (free), Jalapeno (+$0.50), Egg (+$1.50), Bacon (+$2), American cheese (+$1.50)\n*Chili cheese fries ($5.95)\n*Tallow fries: fries cooked in beef tallow ($3.50), add Cheddar ($1.50)\n\nI got the quarter pounder. It was a little overcooked as I ordered my burger medium rare, but I was more bummed that they didn't put onions, lettuce, tomato and pickles in it. Both Caviar and Calibur's menus state they come standard with each burger. So where were my veggies?! I liked the flavors of the burger, but it wasn't the same without those ingredients.\n\nThe fries were good. Crispy on the outside and soft inside, but I wouldn't waste the money to add cheese. It was just shredded cheese melted on top. Most of it melted on the bottom of the paper dish, so it wasn't very cheesy. I wish they used cheese sauce instead. The chili fries were okay. I don't like beans, so I didn't really eat that much of this.\n\nI had a bite of the roommate's burger and really liked his half pounder. It was cooked medium rare as requested, so nice and juicy. And it was more flavorful than mine with the onion and egg. It made it feel more like a burger. Though his was still missing the listed veggies.\n\nGiven the burger prices add up with toppings, I was expecting to get the basic toppings. Turning what could have been a 4 star review into 3.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "Burger is very good! Fries are good but not great. I will definitely be back!!!\nBread, patty and are very good! Very fresh and not greasy at all!", "author": "Greg R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-15", "description": "Going down hill with the quality and flavor not sure what happened but dry And thin not thick and juicy anymore.", "author": "Keli D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Love this place! Very good burgers and fries and the staff is just so so nice! Perfect spot to pick up lunch if you are headed to Peek-a-boo or a movie.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Great food and experience. Tasty burgers and the best fries. Pleasant employees who keep the place clean. Love the 70s Rock-n-roll. Someone there has great taste in music. I'm glad I stopped in and will be going back soon. Parking all along W. Portal Ave.", "author": "She B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-08", "description": "So I saw the guy working there give an extra shake to a girl who ordered happy hour special... she wasn't finished with her shake but he gave her another one to go.  I also ordered the happy hour special and when my daughter wanted to take one to go he said \"$6.50\" I asked about the happy hour special and the guy said \"you're not finished yet\" I said \"you just gave a shake to the other girl who didn't finish her shake\" he turned around and started making a shake and looked back at me saying \"this ain't for you\". What's the point of happy hour if you only get 1 regular serving?? Btw he also gave the other customer a bag of fries to go!!!???!  But we were not given the same level of customer service.  We paid for our food as well.  Super rude experience and got ripped off as well! $26 for kid burger, 1/4 burger with fries and a drink!?!?!", "author": "Sheree A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-28", "description": "Most of the time when we make our trek to San Francisco, my hubby and I are pretty certain we will eat good food. So when our craving for burgers ignited, we decided Calibur may be the exact spot we had been searching for. \n\nWhile I love mostly everything about the city, the one thing I DESPISE most of all is the FREAKIN' PARKING. My poor hubby drove around the area for at least 40 minutes trying to find a free spot. Finally, the Gods of Parking felt sorry for us and gave us a spot that was about two blocks away. Normally I would frown at the distance, but I was too dang hungry to care. \n\nCalibur itself is a pretty small building that is longer than it is wide. Decorations are bare since they seem to rely more on simplicity than anything else. To order burgers, you pick the size of the burger (quarter pounder, third pounder, and half pounder) and any additional toppings on top of the typical tomatoes, lettuce, and pickles. \n\nWe both got the third pounder, but I added an egg and mushrooms while my hubby added cheese and bacon. We also got garlic fries to share. First off, the prices are EXORBANT here. The burgers without any add-ons are already about $9 and any additional topping is at least $1. The fries were an additional $6 and before you know it, the final price rang up to $30. For burgers!? Crazy... \n\nThe food came out fast and looked very impressive at first glance. The burgers were piled on like a mountain and the fries were long, thick, and crispy. I made the mistake of undoing the wrapper around my burger and ended up making a big, big mess. The meat in both of our burgers were hot and juicy, tasting great with the crispy bun. I loved having the egg on mine and my hubby said his bacon was fried well. But unfortunately, the hot meat was terribly cooled by the icy cold tomatoes and lettuce. I was so disappointed! How could they serve cold tomatoes on a hot burger? Absolute atrocity! \n\nBut their fries... WOWEE! They know how to make their garlic fries right. It just didn't have the taste of garlic, it was COVERED in actual roasted garlic and thyme that made for a mouth-watering side. Super impressed with those! It did come with a fresh tomato sauce, but that was cold as well. What a bummer... \n\nSo while Calibur serves gigantic burgers, for the prices, it really can't do anything less. The fries were phenomenal, but serving food with cold ingredients was such a shame. The verdict? I guess even San Francisco has its fair share of sub-par eateries.", "author": "Quyen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-06", "description": "Been here a few times over the last few months.  Usually go here b/c my son likes the burgers.  The burgers are average. If I would compare them they would be similar to an in n out burger except the buns at Calibur are much better.  The fries are also ok and not too greasy.  When I was there last they were short staffed but they managed to get the burgers I ordered to go fairly fast. Staff were  very friendly. Also, note they do have bathrooms and they are clean.  Overall, I would give them a 3.5.  Things to improve would probably be: slightly lower cost for burger, a juicier beef patty or maybe offering something else like a buffalo burger.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "I placed three separate orders with Caliber. Each time I was craving a good burger and fries. The burgers are consistently good, tasty, made well, and they don't fall apart or make you feel greasy and sick after. I'm glad there is a good burger joint near where I live. Can't recommend this place enough.", "author": "Christian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Visiting family in the Bay Area and they took my husband and I to Calibur, SO delicious! Very friendly staff and amazing food. Definitely recommend the Calibur ketchup!", "author": "Cortney M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Ordered two burgers on the caviar app. They totally hit the spot- we wanted medium rare so we ordered \"rare\" bc we thought they would cook in delivery. It was the right move!\n\nYou could really taste the quality of the beef; Them patties were juicyyyyyy!!! They were way bigger than expected, so next time probably won't get a double double. \n\nCan't wait to enjoy again!  Prices were very reasonable!", "author": "Shay K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-18", "description": "I'd only come here if I was really hungry and didn't have any other choices. The burger is fine. The fries are just okay. Nothing special about this place. They do have locally made sodas and gluten free bread. They also have their own rendition of animal style fries, which was the Calibur style, but it was just okay. The staff is friendly, but I'd only go there if I really just wanted a burger, was in the area, and didn't feel like going anywhere else. For how much it is, it isn't really worth it.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "When I saw all the reviews for Calibur, I was excited for a new burger place, but then I saw it was in West Portal, which is quite the trip from where I am.\n\nTHEN, I saw that they deliver. I swear this is probably the best burger you can delivered. There's a huge selection for customizing your burger, and the (both tallow and calibur) fries are amazing, too! The quality is amazing, and with a focus on organic beef, the price is perfect! \n\nI've even had their milkshakes, which are perfect! Not too sweet, which is my preference!\n\nI can't wait to eat here in person, soon, hopefully!\n\nFood: 9/10\nValue: 9/10\nOverall: 9/10", "author": "Evan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Love the burgers and the French fries.  My kids love the shakes.  The food is seriously good and my friends love the veggie burgers (I may have to try one myself sometime!)\n\nToday when we ate, my son dumped half his burger on the ground while eating.  The owner refused to have us clean it up, and instead cleaned it up himself.  He then gave my son a whole new burger.  It was totally unnecessary, but one of the nicest things anyone has ever done for me at a restaurant.  \n\nI should note that this type of service is the norm there.  Would recommend this place to families as the kids burger/fries combo is a bargain.", "author": "Jay G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Came here today at 5pm and got a single patty hamburger (7$) and a vanilla milkshake. The bill total was about 15$. Both were pretty good and definitely satisfied my cravings. Their milkshake wasn't too sweet like in & out which I enjoy. I would definitely come back whenever I'm in the area. Service was good. The place is filled with tables and chairs so there's place to sit if u decided to eat it there.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Calibur is really a great little place! Clean, friendly, using fresh local (and grass fed beef) ingredients. You can build your own burger, or opt for the Calibur burg, which includes beef, lettuce, tomato, grilled onions and secret sauce.\n\nTheir house made veggie burger is truly excellent. And to top everything off - their food is packaged in environmentally friendly materials that can go straight into the composter when you are done with your to-go meal.\n\nThere are a couple of tables outside where you can dine with your pup, if desired. And - the young people working there are really a treat - kind and hard-working. A home-run.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I ordered online via grubhub.  It is MILES above even McD's gourmet \"signature\" meals. I was surprised they came on time since I live in the outer Mission which is so far from West Portal. Their burger is big & tasty & warm and not at all artificial tasting.  Their Calibur fries was a mountain of oozy tasty melted cheesy sauce and tender marinated onions.  Their shake was not too sweet.  Ooooh....like heaven for lunch!!! If only they had burgers & fries like that in the Outer Mission!!! I'll be back to order from them!", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-13", "description": "Came here with my boyfriend. The burger was amazing!!! I ordered the kids which came with fries, and that was perfect!!! They also had ranch which was amazing! The ranch cost extra but the portion and the taste was amazing!!! The order came fast, there were a decent amount of parking. The fries were good, but could have been hotter. This place is great as you order the basic and then you can add on anything. There is a 4 dollar for any three extra toppings. I got the fried egg, cheese and mushrooms. For the kids burger the add ons were half off. \n\nThe music that played in the shop was great. It was a cozy little place. They also have great milk shakes with a special every month. For one 1/3 lb burger and add ons plus a kids burger with fries and add ons the price came out to be about 24 dollars.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "This place is everything! Order everything!  The shake is big enough to split between two people. The garlic fries are on point! Burgers are so good!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-19", "description": "The burgers are ok. Their Calibur sauce is basically their version of the In n Out sauce. Their ingredients are fresh, other than their burger patties. The burger I got seemed like it was a frozen patty. I could be wrong, but there was a taste difference for sure! \n\nWhat I did like was their garlic fries. Nice and garlicy! I also got their black and white milk shake, which was awesome! I mean, nothing special, but it really hit the spot! Not too thick, but definitely a little bit of work to get it through the straw!", "author": "Aaron Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-30", "description": "Good burgers, good fries, good service, good decor. Not cheap, but about right for what you'd find in the area. Besides, it's not a greasy spoon; it's a hipster's dream of a greasy spoon, and that puts a little premium on it.\n\nBut dollar refills? Fountain soda typically costs a restaurant peanuts to sell. The price the customer pays is 95% profit. I figure there's one reason this place sees sense in also selling Diet Coke by the can and it's because two cans costs the customer less than a fountain soda and a refill! Makes no decent sense.", "author": "Oliver K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-20", "description": "The interior is reminiscent of the old-style diners. I ordered the single burger w/ American cheese calibur style and my BF ordered the double burger w/ cheese & jalapeño. Both were okay but I wish there was more of the sauce, which the workers were nice enough to hand out more of. The jalapeños were so small (there were only 2) that we thought they forgot it. I don't think the sides are worth the money (0.75-$1.50) if they don't give you a lot of it..\n\nThe garlic fries were also just ok. The garlic should've been cooked thru a bit more to bring out more of its flavor.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "Calibur is one of the better burger places that I've been to lately. Burgers aren't hard to make, but while some places give you a stunning job, most fail miserably. Thank goodness Calibur did not fail.\n\nI can tell immediately if I will begin to like the burger by its bun. Just like a good laptop needs a good keyboard, a good burger absolutely needs a good bun. Thusly,\n\nSINGLE BURGER ($6.49+$0.50 for cheese)\nTHE BUN: had excellent volume, immaculate tan color with a slightly shiny exterior, and was dense (dare I say a bit too dense), but otherwise was very refreshing compared to many other burger places that I've been to.\n\nTHE MEAT: was a little boring, but seasoned with justice. I got the single burger so maybe I should've gotten the double burger.\n\nTHE CONTENTS: roma tomatoes and lettuce were fresh. Onions and melted cheese (adds a few dolla extra) weren't bad. \n\nALSO TRIED\n\nGARLIC FRIES ($4.49): kinda boring fries with a smidgen of fried garlic. I suggest that they add more.\nCHILI CHESSE FRIES ($4.49): the same boring fries with chili and cheese. Nothing special but it was OK.\n\nAMBIANCE: 4 stars cause it's a nice little place in West Portal with plenty of seats on a Thursday night.\nSERVICE: 4 stars they bring it to your table which is nice. \nFOOD: 4 stars since it was a solid burger.\nPRICE: 4 stars not bad for a solid burger!\n\nBottom Line: need a solid burger in West Portal? Here's your your place. I recommend it!", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Exceptional services! The waiter came around with his wavy iPad and ordered our food; especially, with a group of 20 ppl. The food was expedited profoundly well and my burger was made too my perfection! Most definitely, this place was the spot for some mouth watering burgers!", "author": "Teresa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Great burgers and love the online ordering from iPhone. Tons of add-on. The delivery was fast and the burgers were still very warm. Great fries as well.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "Looking for a good quality burger, look no further than Calibur.  The atmosphere is super chill and relaxed. The service is fast and friendly. It is a no frills kind of restaurant, but the food quality is very good. The menu is fun and offers great variety. Plus they have soft serve! Great spot for kids. They pretty much had me at organic beef and that delicious brioche bun! Seriously, the burgers here are better than at more pricey restaurants in the city.", "author": "Halima T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Their customer service is PHENOMENAL!  I had a minor issue and Jorge and Seán were so quick to get back to me and help problem solve which I really appreciated.  We've had to fly in and out of SF for personal reasons and we'd happily visit this establishment again", "author": "Jenna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-09", "description": "I passed by Calibur a lot and made a mental note to check it out later. I finally did. \n\nI ordered a burger with cheddar and caramelized onions and an order of tallow fries. My boyfriend ordered the same thing but with bacon. He probably should have gone with the $4 combo for toppings but didn't think about it. \n\nThe quality of the food was good, but the taste was not there for me in the burger. Ordering bacon might have been a good option for me to add some more flavor. The tallow fries looked appealing, but I would have wanted more garlic. What are garlic fries if you don't leave reeking of garlic? The sauce it came with was not bad. \n\nOverall, not a bad place. Food quality is great but I would not list this as a favorite burger joint. I'd like to try their veggie burger and a milkshake next time.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "If I need a good cheeseburger, this is my first choice. Great location right by West Portal Station, friendly staff, good music, and the burgers are of course incredible. I even hoarded their house ketchup for a while!", "author": "Shanks G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "A great post school lunch with our oldest 6th grader who LOVES burgers!  Burgers are very tasty, fries are delicious and the owners are great people.", "author": "Jarlath O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "I stopped by Calibur for the first time last week and I ordered a cheese burger with mushrooms + fries. Delicious! great ambience and really friendly staff :)\nWill repeat for sure!", "author": "Ferran T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "This is an exceptionally good, if not superb, burger restaurant. \n\nThis was our first time here, due to my oldest son.s recommendation. The owner persistently checked back with us to make sure we had everything we needed. \n\nThe Calibur fries were delicious, as were the regular fries. The burger's patties were cooked adequately with no red inside. If you want your burger medium rare or medium, you might want to ask about that up front. \n\nThe build your own burger manner of ordering produces a custom burger for each client. You can also order it for brunch with an organic egg. The hamburger meat is high quality and tastes great.\n\nDon't forget a shake or a malt. They are thick and delicious.\n\nEnjoy!.", "author": "Reyn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Tasty Burger. I would say 4 stars, however, I'll give it 5 stars because the staff was so nice. The Burger was cooked perfect. Very juicy. I really enjoyed the bun as well. I would definitely come back", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Ordered Calibur off Amazon food delivery and the food came right on time and the burger/fries were really great. Burger was delicious and not messy and the fries were a bit cold, but otherwise the meal was great. Will definitely order again!", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "The food is absolutely amazing and comes out really quickly. The burgers are juicy and large, the milkshakes are thick and not too sweet and the perfect size, and the fries are crispy and hot. AND all the food is 100% organic. The service is definitely 10 out of 10 and I have not been disappointed yet. After I stopped being a vegetarian, I still hesitated eating burgers, but these burgers make me crave them all the time. It's like fireworks on my tastebuds! And on top of that, they have pretty awesome T-shirt's.", "author": "Sky G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "I stopped by on a Saturday afternoon with my 12-year-old as he wanted a burger place in the area. We were there for a late lunch - around 2:30pm - although there were still several people inside. We decided what we wanted fairly quickly, and got sodas from their machine, which were from a local place, and were quite good - not as sweet as most sodas but quite tasty. \n\nOur orders arrived very quickly - the man who brought our burgers out to us said that as soon as we ordered, he started cooking. The burgers were perfect - all burgers are cooked medium (although I am sure you can specify otherwise) but this is exactly how I like mine cooked, with a little pink in the middle but still juicy. The only thing I added to the \"calibur style\" was pickles. We added an order of garlic fries, which is good for two. There's also \"calibur style\" fries, which seemed like animal fries at In-n-Out, but higher quality. \n\nI thought the prices were reasonable for what we got, and the service was excellent. \n\nMy 12-year-old loved his burger too. We will definitely go back for the shakes next time we're near West Portal.", "author": "Lori M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "Excellent Menu! So dee~lish! Owner & Employees are so nice! Very clean and modern with cool 1950's charm.\nBut 1 less star because I felt they prioritized Über-Food-Delivery-Orders over dine-in-customers.\nA tad pricey; $55.00 for 2 burgers, 2 fries, and 2 shakes.\nI will for sure return for their happy hour though!", "author": "You H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-12", "description": "3.5? - The burger was just OK to me \n\nI am a HUGE burger fan. I really like that they support organic movement. You can taste the freshness of their food. Freshness shouldn't replace flavor tho and mine was a bit lacking. I added bacon and avocado. The bread was a bit too sweet to my liking too. I think my burger came out to be $16 with regular fries which is steep for a burger. \n\nWasn't a fan of their ketchup, needed to load up on my personal preference Heinz.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Great burger and sincere customer service. Would definitely come back for a burger, fries and shake.", "author": "Raymond B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-28", "description": "Saturday 10/28/17 around 4:25pm. When asked if there it would take long if I ordered a burger, the tall y young caucasian male with longish blonde hair exhibited an incredibly condescending attitude.  Perhaps he was having a bad day but if I were the management at Calibur I I would be mortified.  It's bad for business and Calibur certainly didn't get mine because of it.", "author": "Jed S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "Pretty solid I thought.  Not as good as super duper, but better than other fast casual spots.  Interesting soda fountain with local drinks made with real sugar cane.", "author": "Hutch C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "Organic Cali beef with a retro diner feel. Who could ask for more? Caliber made my Wednesday night this week. Thanks!", "author": "Adam O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "From 4 to 5 stars. Just ate at Calibur again tonight with my family, and it's always great, every time. Service and food are top notch. Everything in my old review still applies, and I'm bumping it up a star, a rare 5--star review for me, because the goodness of this place is just so darn consistent. And really, in the beginning, I thought it was a bit pricey but now it's pretty standard prices for great ORGANIC fare and very attentive service -- and I don't have to suffer through some ridiculously prepared hipster burger! I'm so glad my family lives just a few minutes away from Calibur.", "author": "Jason G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "Tried it last night. Great customer service! The burger comes with the housemade sauce, pickles, Carmelized onions, lettuce, pickles, tomatoes. For $4 you can add 3 extra toppings, naturally I chose a fried egg, bacon, and cheese.  My husband got a gluten free bun that he said was good. \n\nThe tallow fries are really good! I didn't care for the housemade sauce only because I wanted the ketchup taste but the sauce is more like a marinate. It's purely preference because on its own, the sauce is tasty.", "author": "bree m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "I thoroughly enjoyed my juicy grass fed burger here. I gotta say it's one of the best burgers I've tried. And with the sauce and some mustard on the side. I wouldn't have done a thing different. The meat tasted clean and fed right. It was juicy and extremely succulent. The meat was the highlight of this burger. Great location. Friendly staff. This isn't a place where you'll be pampered with top notch service. This is a place that's a bit more laid back. Get your own napkins. And enjoy your burger inside or outside. Perfect for that day you're ready to cheat on your diet like I did. And I'll tell ya, I didn't regret a single bite. Still dont", "author": "Karina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "Decided to cruise down to the West Portal area since I usually don't have any business in this part of town, however I do know the strip is home to many good restaurants. Parked the ride, pulled out my phone and opened up this trendy little app that all the cool kids are using to find local businesses that we love to support. \n\nI figured I would give Calibur a shot. Walking in it felt like I was squeezing into a subway station that has the most amazing burger and garlic fry smells coming from the kitchen in the back and waft towards you while you stare at the menu trying to decide what you want to eat. \n\nThe menu is pretty cut and dry... Want a burger, great... How large of a burger would you like? Quarter, third or half pounder? They also have a veggie burger that I hear is pretty damn good as well. Then you choose your toppings, they have five options on the board for you to choose from cheese (cheddar, american or swiss, bacon,egg, mushrooms and avocado, ranging in price from $1.50-$2.00 with bacon being the most expensive. Or you can choose 3 toppings of your choice for $4. \n\nThey do have standard toppings that come on your burger that make it \"Calibur style\" those include caramelized onions, Calibur sauce (a homemade ketchup that tastes more like a marinara sauce), lettuce, tomatoes and pickles. I personally went with a third pounder with cheddar cheese and done up \"Calibur Style\" of course with the s.o.s. (sauce on side) please! Also ordered some garlic fries and took a seat. \n\nAbout 10 mins later there was a monster of a burger sitting before me and I thought to myself, let's see how far we can get with this one before its time to call it quits. The guy who brought the burger out reminded me to be careful as Calibur burger's are juicy and he was not lying about that. The burger was cooked to perfection, seasoned just right and all of the ingredients tasted fresh as could be, all stuffed between a light and fluffy brioche bun.\n\nThe garlic fries were crispy and were coated in finely chopped garlic and a rosemary and thyme seasoning that packed a punch. I read that they fry them in a mixture of beef tallow (a fancy way of saying beef fat) and rice bran oil. They did not seem greasy and they were definitely crunchy. \n\nI was over all pleased with this visit and will give it another try in the future as it was a pleasant way to chill and scarf down a burger (yes, I ended up eating it all) while watching college football on their flat screen mounted above the entry way. \n\nGreat service, and a tasty burger and fries... What more can you ask for?", "author": "Josh H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-26", "description": "Totally sucks. First they didn't put mayo on my burger and I asked for it. Second, I asked if they can cook the fried egg over hard. And the lady at the counter says they can. Nope! Not cooked all the way. The burger is supposedly be medium well. Burger was cooked well done. No taste in the burger and taste really dry. That's too bad. I was hoping to have a good experience. But sadly I won't be back here again", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-21", "description": "I suppose I should be disappointed that Ryan Scott's Market & Rye closed up shop for this upscale burger spot, but I'm really not. Don't get me wrong, I mean I think a place that serves full-portion artisan salads deserves to thrive, but I'm the type that can't be trusted at a salad bar. I don't mean I sneeze into the protective glass guard or anything, but I ladle on the unhealthy toppings like nobody's business. I'm lucky if I see a lettuce leaf underneath all the bacon bits, candied pecans and ranch dressing. That sorta describes my experience at Market & Rye. I single-handedly defeated its purpose, but I guess I can always find redemption at its surviving location in Potrero Hill. Anyway it's all about the burger now. It's owned by two young guys who obviously gave a lot of thought to their food.\n\nAfter all, they hand-grind the fresh meat and hand-cut the potatoes. They also use Three Twins ice cream in their milkshakes. And that's all they do if you don't count the chopped salad option. Which I don't. It's the In-N-Out model, and I respect it. I hate when fast food places diversify beyond reason. I call that the Jack-in-the-Box syndrome: offer too many things and do all of them badly. But no they stick with the basics, and I decided to go whole hog that evening. I ordered the &9.50 Half Pounder and added Cheese ($1.50), Bacon ($2) and Mushroom ($1.50), so that amounts to $14.50 and I haven't even left the burger yet. A Regular $3.50 order of Fries please. Y'see? I showed discretion by not going for the Large. But I did go for the $5.95 Strawberry Milkshake. I had to, it's a house specialty, right? RIGHT?? And so the wait began.\n\nI sat myself at a lone table next to the front window, and about 15 minutes elapsed. In the meantime, I found myself trapped by the hand railing and a bevy of fat-bottom girls who barricaded themselves with their iPhones at the next table. The food finally arrived. The burger was ridiculously huge and camouflaged by the butcher paper wrapping (photo: http://bit.ly/1sNBQa5). Pricey sure but juicy and delicious with all the right accessories. Next time I'm downsizing to the Quarter Pounder. The fries were hot and plentiful though a bit too oily for my taste, and I have oily taste (photo: http://bit.ly/1wnrn5R). The milkshake was thick and abundant (photo: http://bit.ly/ZFSSMK). Brain freeze ahead. They gave me a complimentary bottle of water when they saw me gorging. Egad, I'm full. Girls, please...I need to go.\n\nFOOD - 4 stars...juicy, pricey burger plus finger-burning fries & a thick shake with plenty of extra\nAMBIANCE - 2.5 stars...busy and hard to navigate, a poor layout for eating on your own\nSERVICE - 4 stars...friendly and attentive even if the wait was a bit long\nTOTAL - 4 stars...I probably should have an artisan salad but a big burger now and then would be forgivable, right? RIGHT?", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "It's harder to find a restaurant that will get the temperature right of a burger than a steak.  Calibur does it right!  We passed by and went in since he has been wanting to check it out since he heard of it opening.  And turns out they just opened today at 4pm.  \n\nCalibur uses all organic California products.  They keep it simple with only four burger options - 1/4 lb, 1/3 lb, 1/2 and a veggie burger.  Toppings are $1.50 each.  They keep the menu simple with chili fries or regular fries, one kids meal and a chopped salad and shakes.  Prices are slightly higher than most burger places.  1/4lb ($6.95) and 1/3 ($8.50).  We also shared a regular order of fries ($3.50).  Standard ingredients are lettuce, tomatoes, special sauce, & caramelized onions.  Cheddar, blue and American are options for cheeses.  \n\nThe bun was thick but enjoyable.  As mentioned our beef was cooked just right, medium and juicy!  You can tell everything is made fresh here. Loved the carmelized onion.  Nicely melted cheddar too.  The special sauce was ketchup like but slightly different taste and texture wise.  Fries were golden brown and well seasoned but the portion was small for the price.  He said if the meat was seasoned more the burger would have made a bigger impact.  \n\nDefinitely a four for the time being in my book.  He likes the simplicity of a good burger and sometimes I like the simplicity of not having too many options to choose from on a menu because I'm so indecisive!  Will be back!", "author": "Cat C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-24", "description": "Not impressed. With all the excellent burger choices in SF I was expecting something magical. No fairytale endings here. \n\nPros: \nOrganic food\nService was good\nLarge television\nExcellent house made sweet ketchup\nHearty chili \n\nCons:\nThe burger was tooooo juicy. Yes! Tonight I experienced that too juicy of a burger does exist and it's a negative quality. \nBacon was meager\n$6 milkshake had zero flavor. Zero. Tasted like sweet water. \n\nHere's the deal: if you're selling a $6 milkshake, it should blow me out of the water. Remember in Pulp Fiction when Vincent Vega asks Mrs. Mia Wallace if the $5 milkshake she ordered had liquor in it since it was so outrageously expensive? That's how I felt receiving this milkshake except in Pulp Fiction Vincent says \"it was worth $5 cause it's pretty fucking good\" - this milkshake I can say is not.", "author": "Rosalyn W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-25", "description": "They charge anywhere from 0.50-1.50 for each extra topping that is not the standard lettuce, tomatoes, onions. The burger itself is pretty so so. The bread is thick but doesn't hasn't much taste to it and feels sort of dry. The nice thing though beside each extra topping being charge is that they have a nice variety of extra topping like: sautéed mushrooms and eggs.\n\nWe ordered garlic the fries themselves were good but there was not much garlic on it. I'd recommend just ordering regular fries so you don't have to pay for the very little amount of garlic they give you.\n\nAlso note that they have great ranch, although they charge extra for that too. \n\nIn terms of parking it's quite hard, and you end up having to park in the residential areas parallel to the street which Calibur is on.\n\nOverall I'm okay with them charging extra for every extra toppings, if their burgers matched a higher bar.", "author": "Derrick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "I ordered from DoorDash, which can be a risk. But this was well worth it! The bun, out does super duper, the veggies, the meat were all so fresh! The the price is good! I will be back!", "author": "Cory T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "I really really loved my burger at Calibur! Having bookmarked this place awhile back after hearing how much my friends  loved here, I was pumped to finally make the journey out to West Portal for dinner.  Calibur has a simple menu, and I'm glad for that.  Menus that are complex and filled with options overwhelm me! Calibur serves up organic beef burgers, coupled with fries that are cooked in beef tallow.  I decided to go with the single burger, fully loaded with caramelized onions, lettuce, tomato, Calibur sauce. I also topped off my burger with avocado for an extra $1.50.  I normally don't eat a whole order of french fries on my own, but since I was \"researching,\" I went with the full order.  The burger was glorious, and I made sure I finished EVERY.THING. Leave no waste behind! The fries were amazing, and 100x better than anything I've had an In-N-Out.  The only part about Calibur that was so-so on was their housemade ketchup.  I can't quite put my finger on what's in it, but it's got an ovelry herb-y taste that doesn't correlate with french fry eating.  Heinz is still the best way to go, in my opinion.  I definitely will be back here when I find myself out in West Portal again!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-20", "description": "Tried this place twice, first time wasn't very memorable. Second time, meat was really dry and probably won't be remembered again. Looked like it was cooked well done and not medium well as stated.  I couldn't taste the sauce at all and the bun overpowered everything so I ended up eating the burger open faced. The extra star goes to the fresh veggies that went in it and the cheese melted on the beef patty perfectly.", "author": "annie w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "My wife and I love this burger spot. They use organic grass fed meat patties. We always order the burgers, garlic fries, and milkshake. There customer service is great!", "author": "PremiumShotz P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Excellent burger! Love the sauce and bun, caramelized onions on the burger. Tallow fries are yummy. No after taste either. Haven't tried the milkshake - next on my list. Definitely going back soon. Not cheap food but well worth the price.", "author": "Jamie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-02", "description": "was craving a burger so we tried this place out. I got mine calibur style with red onions instead of the grilled, it was pretty yummy except I agree the bread is pretty thick and a little overbearing. I think if it were more toasted or warm all the way thru it would be a bit better? the top of the bun wasn't warm so that was a bummer. my other half got the same burger with bacon and grilled onions that one tasted a bit better. they have craft soda machine from a company out of alameda; refills are a $1 on fountain drinks. they also have canned sodas and bottle ones as well and milkshakes but those run like $6 I believe. a little pricey but everything is organic and fresh.", "author": "E S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "First off the burger was amazing. It was so juicy. I got a single burger with american cheese, calibur style. It tasted really fresh and idk how to explain how amazing this burger was but it was amazing. Second the fries were amazing. I love fries, I am a fries person. These fries did not disappoint. Third, the soda was bomb. I never drink soda but I had a sip of my boyfriend and it was great, so great I finished his. The brand is Alameda Point Craft Soda so it's a local bay area company which is also great. Fourth, we came on a rainy day so it was pretty empty but the workers were nice and they actually check up on you which is always nice. As a bonus that day we got free cookies made by the manager (not too sure) and they tasted amazing. They were big, soft, and chewy which is always a plus. I would definitely come again and I will definitely reccomond this place to everyone. ^__^", "author": "Mary-Angeline L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-28", "description": "Just had fries. Ok. Crisp. \n\nWhy two stars? It's hard to give more. They cook it all in the back. Can't see a thing, I'm not saying it's bad. I'm just saying I want to see into the kitchen these days. Their website is all sparkle so I assumed this place would reflect it. It doesn't. It's fake 50's decor is done on the cheap which makes it look sad.  Bummer. Cheap Nostalgia it is.", "author": "Nik D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "So so so good. Classic burgers. Great taste. They keep it simple which is what I prefer. Get a single burger and ad bacon. I think of it as a higher-end in-n-out", "author": "Joe P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "yummy food, clean and spacious place!\n\nalso, staff are very friendly. Must try their sauce!", "author": "Albia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "House-ground, 100% organic, grass-fed California beef. Favorite side is cheddar fries. Homemade organic tomato ketchup. Draft sodas, fun flavors. Attentive service. Can sit outside.", "author": "Bronwyn G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "We order here a lot through Grubhub. I think it's a good solid burger and quite consistent. Fries are also yummy. We get the cheeseburger with our different toppings and have ordered the grilled cheese once- which I can't really remember. Anyway, we will continue to eat here!", "author": "Dbs B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-23", "description": "Was stoked to check this place out, but probably won't waste my time. Place closed early on a Friday night because they ran out of bread. There are two places to buy bread within a block from there. \n\nJust go to in n out, or bullshead if you need a burger within walking distance.", "author": "Alex P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "Amazing burgers at a reasonable price with excellent service.\n\nI had the single burger wth everything, fries and chocolate shake. \n\nBurger comes with special sauce that adds nice flavor. They give you a side of custom made ketchup sauce (different the Heinz) I really liked it. Chocolate shake was thick but not too thick great tasting. Overall awesome burger joint, will most likely be coming back!", "author": "Colby J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-14", "description": "I've never had a burger where the bread was so good that it overshadowed the rest of the burger. Also, \"house-made ketchup\" is always something that sounds good, but when you find that the regular ketchup thing is completely empty, that should tell you something.\n\nI came here with the best friend because I hadn't realized that I completely skipped lunch by accident. It was 4pm. Oops. They were also having a Harry Potter special: Butterbeer milkshakes. Obviously, this had to happen no matter what.\n\nThe staff was friendly and made sure to inform me that the wait time for this special milkshake would be 10 minutes. No big deal, since I needed actual food and not just delicious Potter-inspired dessert beverages. I ordered a burger with cheese and their house-made ketchup, no special sauce because it had mayo that I'm allergic to, garlic fries, and said Butterbeer milkshake.\n\nFood arrived quickly. As I mentioned in the first sentence...holy moly. Best burger bun I have ever had in my entire life. The rest of the burger...um...not so great. I don't know what it was about the house-made ketchup, but it was awful. Best friend also had the same reaction and we were both pretty bummed that the Heinz dispenser was completely out (but as best friends, I was given the last of the ketchup that could be dispensed. Seriously, best friendship right there). The burger was strange. It was...steamed? It was...cold? I don't know how it was cooked, but it lacked the wonderful grease that you order a burger for in the first place. It felt like Chris Traeger in Parks & Rec was trying to make a burger with Ron Swanson's advice, and then tried to make it \"just a bit healthier\". That is not what I want in my burger.\n\nThe fries were pretty good. Super garlicky af which is a necessity and quite delicious. The Butterbeer milkshake? Surprisingly good. I felt bad for them since it was obviously a pain to make. It had butterscotch pudding, Butterfinger bits, vanilla ice cream. Stuff like that. It was a nice thick shake, but slightly difficult to get through the straw\n\nAll in all, a good place, but I've never been so upset by a burger before. I'd only come back for a shake and fries. And maybe the bun on its own, if they'll give that to me.", "author": "Robbin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-03", "description": "+/- THE FOOD\nI had the quarter pounder burger, cooked medium rare, with extra mushrooms. The patty was actually fully cooked (or nowhere near medium rare) but still was juicy. Toppings included lettuce, tomato, grilled onions, and pickles. The grilled mushrooms were a great add on to provide a bit more flavor. The bun was nice and crispy. Overall, the taste of the burger was decent because it wasn't SUPER good but you could tell there was a lot of effort put into it to make it look aesthetically pleasing. The garlic fries were a bit strange because they added a whole bunch of rosemary on top. I wasn't a huge fan of the rosemary because it took away the garlic taste. However, the fries were extremely crunchy and fresh.", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "The best cheesy chedder fries ever! On top of that they were super kind and had amazing service! They even offered us the leftover of a shake that had just been made (they put it in it's own cup!) I will definitely be back for a burger!", "author": "Nate S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "Came here with the family on a Saturday evening.  I must say, their burgers were cooked perfectly!\nKids had the mini burgers which came with a good portion of fries, definitely shareable.  I had the veggie burger, and it was awesome!", "author": "April N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "Got this on doordash delivery and it arrived in perfect condition!  Really flavorful and juicy-- it really hits the spot. Veggies in the burger are really fresh and it makes a difference.  I don't think it is quite as balanced as Super Duper (they have a better bun-to-filling ratio there) but this is an extremely close second.  Next time I have a burger emergency and need a burger delivered to me stat, I will order Calibur!", "author": "Katie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "Great place, best ingredients, fast service, made to order. A lot of care has been put into selection of the best sides, presentation (clean and simple), menu and seating. Even great homemade ketchup. Easy for families. Singles and Twosomes. About as far from McDs as you can get. Nice neighborhood of small shops and a great bookshop next door.", "author": "Jacqueline S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "We thought we had great burgers and fries.  Choice of rice bran oil or beef tallow.  Cooked just right. Not greasy.  Good local colas.  Pleasant staff.  We ate in a Monday about 3 pm.", "author": "Yella W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Simply delicious! I've had a hard time finding a good burger with a gluten free bun that doesn't fall apart and I've finally found the spot. The burger was cooked perfectly and the meat crumbled just right with every bite. Sometimes burger patties feel stiff but not here. The gluten free bun held up to the juices of my swiss cheeseburger with caramelized onions and mushrooms. It had mouthwatering flavors. Steve very much enjoyed his regular bun American cheeseburger with bacon and caramelized onions. He thought the bun had good texture and the burger patty was juicy but not dripping wet. Neither of us got sauce on the burgers because we prefer to have it on the side so we can taste the juices and flavors of the organic ground beef. The Calibur Fries with their special sauce and caramelized onions were terrific. The Fries had the right crunch and the sauce was yummy. Calibur is in an awesome neighborhood with lots of mom and pop stores so you can make a full day  out of your visit.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "This is one of the best burger spots in SF - I've probably eaten here over a hundred times by now and it's been consistently amazing every single time. Get an egg, bacon, and calibur sauce on your double burger and you won't regret it. The calibur fries are on point too.", "author": "Akshay V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "Super good quality burger, a cut above whatever you'll get at a fast-casual place. Well cooked and juicy for sure. The fries, shake, and homemade ketchup all both bomb, unexpectedly raise the level of the whole burger and fries combo. The burgers are pretty expansively customizable, there are plenty of things that I left off my burger that I'd love to go try another time in varying combinations. The food came out promptly, and the decor was pretty fun 50's vibe. The people behind the counter were really nice as well. That being said, the cost adds up a little over ordering a full meal (with burger toppings, I wanted avocado and bacon so that's sort of my fault) for me and my date, which I don't really mind but it's definitely not In n Out costs. I think we tend to have an idea that burgers and fries are always going to be the rock-bottom of food prices, and this was a much better than average burger and fries, and the price reflected it. Maybe I'm just not used to paying SF prices.", "author": "Evan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Still feel the same about the food but adding a star because the order came so quickly through the caviar app, it was all prepared well, and they have a great health score which is so important to look at in SF when so many restaurants in the city have vermin infestations.", "author": "Emma M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-19", "description": "Pretty good chili cheese fries. I messed up order twice. The cashier was nice about it. I ordered to for there and didn't want a drink. Then I changed my mind and wanted to go and then added a drink after wards.Sebastian was his name. Props to you even though you forgot my receipt and had to ask for it.", "author": "Selby C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "The burger was great and the service was fenomenal. Honestly though, $1 for a coke refill is a little much.", "author": "Alan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "This is a review for delivery.  \nI thought it was a mistake at first but they do actually deliver.  It only took 30 minutes and a huge burger and fryers arrived at my house. The burger was awesome. The fries were What one should expect when having food delivered.  The food is pricey if you compare it to ground sludge burgers at Micky D's.", "author": "Corey Jace W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "Do I really want to enter into a space that charges $6 for a vanilla milkshake and $7 for 1/4 lb burger before fixings?  \nWell I felt brave today. \nI had the 1/4 lb beef burger aka \"royale no cheese\" burger and was able to walk away satisfied.  Only add on was thick sliced bacon.  4 stars is right on for calibur.\nPros- not a speck of gristle in the properly cooked organic beef patty.  First time ever in any burger place. Not even Hubert Keller's famous burger bar did this.  The food prep here is spot on because they hand grind the beef on site instead of buying pre packaged patties.  The beef was seasoned but not enough for my palate.   I am all about intense flavors and proper technique and temperature.  The bacon was perfectly prepped- crispy and thick. Lettuce tomato and grilled onions spot on. Nice buns Hun.  \nFreshly bought brioche.  \nCons- the tables were not self bussed or staff bussed properly.    Unsure on the policy here. If diners can self bus so the next diner up can use the spot it needs to be clearly indicated.  I had to wipe off a leftover chunk of beef on my table. The only clean and unoccupied one after I ordered my burger.  The staff was friendly and but not very engaging. \nIf you want to be high end, make it a total dining experience and chat it up folks !\n$6 for a 3 twins ice cream milkshake people. \nAnd with the extras you can easily hit $20+ for a big burger!\nJYW likes but I would say kick it up another level and make it a 5 star Yelp Elite approved dining experience.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "The burgers here are absolutely delicious, and the staff were as friendly as can be!  As an added bonus, they also have wifi and outlets which is more than you can say about many coffee shops!", "author": "Sean P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "Always happy to come across those who make a valiant effort to be organic. Food taste so much better and body feels great. Place is fashioned after old school burger joint. Keep up the good work. We will continue to come back", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "My boyfriend moved into San Francisco and one day we decided to go on a \"foodie adventure\" and I'm so thankful we came to this place. We've been coming here for almost a year now and within the past year, we've eaten here at least once a week. This place is AMAAAAAAZING! Everything about it is, whether it's the food, music, and the staff. I don't know how, but the food gets so much better every time we go, and we go a lot! Calibur is all I think about and I feel bad for my boyfriend but he's so kind enough to fulfill my food cravings. Thank you, Calibur, for creating an environment we always get so excited to come to.", "author": "Elizabeth V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-19", "description": "Decent burgers, decent fries - not great vibe. Kid friendly and they seem to like it so.....", "author": "Rex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "I had a burger and fries and it was tasty. I thought the portions were of good size and I liked the outdoor seating. The staff was very friendly even to my little one.", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-06", "description": "I had the vegetarian burger, and my roommate had the quarter pounder (well-done) . . . we both agreed to the fact that it was good, but that we have had much better food at other burger joints in the past . . . for example, she said that she would have way rather gone to in-n-out burger, and I personally think that I could have made a better vegetarian burger at the comfort of my home. \n\nthe music and atmosphere of this place is cool though, super chill place to just sit down and rest & eat.", "author": "Brooke W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-25", "description": "I hate being tough on new businesses but this place just sucks. \n\n1/4 pound burger, order of fries & a can of diet coke = $13.00.  I wanted to like this place because I live so close by and I usually give a 2nd chance, but, there's too many options on the block. \n\nThe burger is just a burger, nothing special and the Calibur sauce tastes like pasty old tomato sauce and the fries were just fries. \n\nYou can get a better burger up the block at Bull's Head or even La Boulange. And they both come with fries.", "author": "Bill L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "Today's review for the choc malt milkshake.  It's a hot day and it's national ice cream day, we headed to Calibur for their 3 Twins ice cream milkshake.  I was pretty disappointed compared to the vanilla milkshake we had here the last time dine in. \nThe guy had ice cream in a silver mixer cup and pulled it out of the freezer, it was pre-measured and he added the malt and milk.\nBut, as he was pouring it into cups for us to take-out, you could tell it just didn't have the thickness it should have for a milkshake.  It poured out like a thick soup, too watery.  The amt was way less than when I had milkshake there the last time.\nThere was enough malt flavor but too sweet and too watery.  Someone needs to give this guy an ice cream shake recipe, there should've been more ice cream, not getting my money's worth for $6.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-24", "description": "\"Rawr...\"\n\nMe: Whoa what was that? Food Kid (Ringo M.) did you just hear that?\n\nRingo M.: Hear what?\n\n\"RAAAWR\"\n\nRingo M.: Oh yea... What the hell was that?!\n\nTwas a week before Halloween and things were getting a bit dark, eerie, and weird.\n\n\"RAAAAAWR\"\n\nMe: Didn't those beastly growls n roars come from 2 different directions?\n\nRingo M.: Definitely...\n\nOut of nowhere a gigantic slimy hideous beast came quickly flying over to our table in the most horrific dominant presence... \"RAAAAAAAAWR!!!\"\n\nFood Kid and I was terrified as we tried not to look it in the eyes.  I courageously took a peek between the crevice of my fingers that were protecting me from the monster.  My blurred vision slowly came to focus as I forcefully calmed my pounding heart by slowly and quietly taking deep breaths.  \n\nI began to laugh helplessly tearing up.  I couldn't help it.  \n\nRingo M.: What is it?!? Why are you laughing?!\n\nMe: Dude... Take your hands away from your face.  Seriously...\n\nThe stunned look on Food Kid's face was more priceless than a Mastercard commercial.  Damn glad he didn't see mine.\n\n\"RAAAAAAAAWR!!!\" \n\n\"RAAAAAAAAWR!!!\"\n\nStartled once again, we stared at each other with a quick moment of paralysis but it wasn't long until we started to tear up with laughter.  The beastly sounds were actually coming from our bellies, monstrous with hunger, at the site of this gigantic yolky oozy slimy cheezy beefy burger equipped with mushrooms, lettuce, tomatoes, grilled onions, pickles, avocado, 1/3 lb patty, and one mean sunny egg sandwiched between 2 nice spongey fluffy buns.  As if that wasn't enough to make our killer appetites rip through us before our mouths even got to take its very first mouth watering bite... Every ingredient was ORGANIC and the beef was GRASS FED.  No... Cows don't naturally eat corn... They eat grass.  What put this amazingly nasty burger over the top for me was instead of going for the Heinz Ketchup, I requested for their ORGANIC homemade ketchup made with sweet fresh organic tomatoes.  \n\nThat first bite... life, as the burger knew it, was over.  It vanished within minutes as I licked the last of its remains off my fingers.\n\nThis burger was seriously dressed as the perfect monster for Halloween.  I'm so freakishly impressed that I'm going to have to dress as a Calibur Burger this coming week.  My IG post of that should get me an insane amount of likes in such an Orange October.\n\nMy YUMS stamp of approval for 5 stars.", "author": "Colin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "Really nice staff, great burgers- fresh ingredients \nNice addition to W, Portal area.  I like the black and white tile floor and diner style look. The menu is pretty basic ,  burgers, fries, milkshakes .  Some may find it a little pricey for a burger place , but I like it. I will be coming back.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-31", "description": "Incredible! These guys do it right! Organic. Grass Fed. Local.\n\nI love the menu, simple is best. I had the vegetarian experience tonight but will be back to sample the rest!  It's entirely too hard to find 100% organic menus in this city. Go here, support people doing it the right way!\n\nI was greeted with a smile, explained the menu, given recommendations and had an incredible meal. Also organic ice cream shakes?\n\nI'm going to be a fat fat man soon.", "author": "Mr. H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "This review is for Caviar delivery of our meal. The restaurant crew nailed it. We had three different burgers, with different toppings on each. We asked for buns on the side and Calibur called me to clarify (clear signs of intelligence there!) I told them to let the kitchen use their discretion when packing the order, to do whatever made sense.\n\nSo, they fully dressed each bun with lettuce, tomato, pickles, etc., as ordered, and then they packed the burgers with cheese and the wet toppings (like carmelized onions) on top of the meat, in separate boxes (wasteful, I know, but SO worth it!) The burgers were sitting very cleverly in little lettuce leafs, so all we had to do was lift the lettuce \"sling\" with the burger on it, out, and place it on the dressed buns. The fries were hot and nice and salty - duh, isn't that WHY people eat fries?\n\nBy the way, under the lettuce leafs with the burgers on them, was a TON of juice, which would have SOAKED the buns - for delivery, this is the only way to get an intact bun upon delivery and not a mushy mess. . .\n\nGreat job, Calibur! A++++ kitchen staff and smart cookies one and all. So refreshing to find intelligent people behind the scenes.", "author": "Chanel B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-06", "description": "It was good but I got egg and it wasn't runny. \n\nIt's good, pretty pricey. We got one 1/4lb and one 1/3 lb both with bacon, egg and cheese, one order of fries, a Mexican coke and a jarritos and it was $35. Just saying.", "author": "Katie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "This place is awesome. Just what my old neighborhood needs and well placed right near the theater. The staff was wonderful. I loved how nothing had high fructose corn syrup in it ( i.e. Ketchup and soda) The owners were very warm and welcoming. My mother was extremely happy with her milkshake and burger. I had the veggie burger. Both were excellent. So glad this place is in west portal!", "author": "Monica G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-26", "description": "This burger joint was just okayy... I had better. But the service was great! The burger was kind of plain in my opinion maybe because I didn't add enough toppings and the only option for condiments was ketchup. I prefer mayonnaise in my burger but it's an organic burger place so maybe that's why they don't offer mayonnaise. \n\nBut the chili cheese fries was good!!!", "author": "Monica N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-04", "description": "Once again I made the mistake of grabbing a burger from this place.  My burger patties were undercooked and gave me horrible indigestion and diarrhea all night.  Steer clear", "author": "Kimo K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "AHHH another place that doesn't know how to cook medium rare burgers T_T\n\nBUT at least the burger was still pretty juicy and not lacking in flavor. Defiantly preferred this over BullsHead :3\n\nTheir tallow fries are very rich and flavorful. We got their garlic fries which came with rosemary. Nice touch but I felt the rosemary kind of overpowered the garlic a little bit. Would request light on the seasoning next time. I also love that they make their own ketchup because it actually tastes like tomatoes! \n\nI didn't get one but they make their shakes outta three twins so you know it's good!\n\nService was extremely friendly. Would recommend this spot if in this area for a burger (3.5 stars).", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "Killer burger place, simply the best. \n\nBut the fires are show stoppers, cooked in beef fat.\n\nShakes are great too, and everything is completely organic.  \n\n\nThey also make their own ketchup which is delicious.\n\n\nThe best thing about this place, though, is how low key it is. The place feels like a regular burger joint. Usually high quality eateries can get pretentious with their decor, but this place is basically styled like a five guys (but with better music and a flatscreen tv). \n\nAwesome, we live around the corner and this is now our favorite spot.", "author": "Shane B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-15", "description": "Calibur is a nice hamburger joint near the West Portal muni station. I like that they use organic ingredients, and I love the options they have like bacon, avocado, and fried egg. I think the prices for the burger is very reasonable, but the options skew towards the high side. The fries are good and the calibur toppings like grilled onions, lettuce, tomato, and sauce fills in the burger nicely. \n\nBe aware that about 15-20 minutes before closing time, they are take out only. Jorge and his partner run a good business and I hope they succeed at this location.", "author": "James N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "So I just walked in here for the first time, because yes, I love burgers and as 25 year old male, I'm willing and able to slam a burger back as my first meal of the day. \n\nNew to California, I walked around west portal and chose Calibur honestly because I saw \"burger\" and \"$6.95.\" Everyone one was extremely friendly and accommodating and the owner was in and we talked burgers for a bit. He even shared the new menu which will add even more value for the buck.\n\nI ordered the 1/3 lb burger with cheese and the works which came out to $10 even before tax. The bottom line? \n\n-a very tasty burger\n-incredible value for the price (1/3lb)\n-I was a to choose the cook temp ! (Never happens with quick burger places)\n-Great bun to meat ratio, which the bun was bready and ironically at a different caliber than most quick places.\n- the fries? Whole 'nother level.", "author": "Gino S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-19", "description": "It's with a heavy heart that I am writing this review. I have eaten at Calibur several times and ordered delivery on many evenings. Their delivery has gone downhill and the quality of their food has as well. I ordered a burger and fries tonight from eat24. Shortly after, I got a text from eat24 that my food was on its way. So I waited. And waited. And waited some more. My delivery took over an hour and was delivered by a rude and unapologetic driver. He had someone with him, and it appeared he was more interested in socializing with friends than with how promptly my order arrived.\n\nWhen I finally got my food up to my apartment, everything was stone cold - nearly inedible. \n\nI paid almost $20 for this meal, with the delivery fee and tip included. I am disappointed that the quality at Calibur seems to be going downhill more and more. When they first opened, I was so excited to have an organic burger place fairly close by that also delivered. But it looks like I'll have to continue to look elsewhere if I want to enjoy consistent, quality food.", "author": "Christine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-04", "description": "The buns are really good, soft without being too soft. The sauce they use reminds me of what Big Mac sauce use to taste like WAY back in the 80's when it actually tasted good. The burgers themselves are delicious, and are nice and juicy. I've eaten in and I've gotten delivery through GrubHub, and every time I've loved my burger!", "author": "J B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-01", "description": "Ordered the veggie burger. It was fine - heavy on the beans.", "author": "Kayla M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Went in with my dad who is vegetarian so we each had a \"House Veggie, Calibur Style\". It was excellent. Burgers are great but this veggie burger was outstanding. Chalk up another great eating establishment on West Portal.", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "This burger place was absolutely delicious. I found the atmosphere to be very clean and neat, which i really liked. The interior reminded me of Five Guys. When we received our order, our burgers were very neat and juicy. I really, really enjoyed my experience there. Despite the great tasting burger, I found this place to be quite expensive. We ordered 2 burgers and and order of fries, which came out to be $25. I don't think the burgers were THAT good. Additionally, I thought the fries were just ordinary. Overall, this place was very good, but very expensive as well.", "author": "Amanda V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "The burgers are to die for. If you leave this earth without trying them at least once, you've existed but not lived. Only Dickens' could adequately describe the food here. The fries are crispy, the shakes creamy, the burgers savory. Ingredients are top shelf. From the produce to the buns, it's all fresh and carefully put together. I don't know how to describe the flavor but strongly encourage you to try this place and take the challenge to describe it. Be prepared though, no burger will measure up after this!", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-09", "description": "I'm a huge burger slut. I am typically dedicated to my favorite burger joint of all time (Hall of Flame),  but I decided to give this new, sexy place a try. I CHEATED on Hall of Flame and I am so sorry that I did. \n\nI got the half pounder with egg, bacon and mushrooms. Also got chili cheese fries and regular fries... No expense can be spared when getting it on with your mistress. \n\nBurger: I order medium rare because I expect it to come out medium (although I'm ok with either)... It came out medium well,  if not well done. This was hugely disappointing, but the most disappointing part was my egg was cooked solid... You order an egg on a burger expecting it to ooze and fulfill your delicious, yolky fantasies. No such luck. The bacon was okay -  not extra crispy as one would hope, but more of a thicker, chewier cut. \n\nFries: they sounded good in theory,  with the way they describe it on the menu, but they were nothing extraordinary. They give you a shit ton, which you think is awesome because you pay so damn much - lest we forget how cheap fries can be. \n\nWhen we got our platters, the chili cheese fries had that look they've been sitting for awhile - you know, where the cheese looks like it congealed on top? Taste - wise, it was alright...  But it tasted like a can of Trader Joe's chili with a slice of kraft cheese thrown on top.\n\nHubby and I ate here, with the entirety of the meal costing $40 before tip. Had it been the best burger in San Francisco, I would have gladly come back. However, with the overcooked patty, overcooked yolk and congealed cheese, I will not be back. I'd rather spend $40 somewhere else... Or better yet, $6 at In-N-Out or $10 at Hall of Flame, where their meals come with fries. \n\nAlso, the cashier was super friendly, but the younger teenage / college kid making milkshakes is lazy. Customer complains ketchup is empty, you should probably refill the ketchup, instead of sighing heavily, as if the world is against you. \n\nAlso, for all you organic fiends, you should probably do some research on what exactly organic means... Because that term is so loosely thrown around with everybody jumping in like cattle thinking it's super healthy. Companies price point their items higher because of the organic label hive mentality.", "author": "Christina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "The burgers here are amazing. Burgers are one of my top three favorite foods, so i consume them often. This place has very good tasting meat. Very authentic old-school vibe. Was my second time coming here and i teared up a little due to the enjoyment factor.\n\nDelicious. I will be back more often.", "author": "Moe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "Prior to eating at Calibur I didn't realize how GOOD burgers could be let alone service. Have walked by this place many times it epitomizes \"a hole in the wall\" gem that you're glad you came across. I got the American double which comes with two pattys and Two slices of cheese on an brioche bun. It was without question THE BEST burger I've ever eaten. To top it off I got some fries and saw their ketchup is also homemade (not the typical Heinz ketchup you get elsewhere). Also had the vanilla shake which was great just as their service was. Highly recommended, and worth every penny.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-11", "description": "Came here with my son who wanted to try it.  They had just opened for lunch and we were both very excited to chow down on some good burgers.  \n\nThe pluses:  very friendly staff, manager or owner came out to ask if we were ok, clean place, reasonable pricing for organic food.  Fries were good. \n\nThe minuses:  burger was luke warm and still had a raw smell, bun was not warmed or toasted.   \n\nAll in all, the burgers were not the best.  If they start serving the burgers hotter with warmed/toasted buns - it would be an A+ place with a line out the door.", "author": "n y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-19", "description": "Maybe it's better in person, but my delivery order was disappointing. The grilled cheese was nothing special. The cheese fries were cold and inedible.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "this place is refreshing because it's good, honest food, and some real comfort is given, in a nice, efficient, Eco-friendly little package. they care here. and they are hustling. you will often see the owner here, and I enjoy seeing how this place evolves to be the mainstay that it deserves to be.", "author": "Matt J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Calibur is my go-to delivery burger (via Caviar). Delicious! They also arrive super fast, which is always a plus.", "author": "Amy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-22", "description": "3/5 burger taste, 4/5 fries taste, but 2/5 total considering the fact that they wanted $10 for the burger. The bun and other ingredients of the burger were fine, but the meat was a dry and almost chewy patty that honestly reminded me of a public school lunch burger. The fries were pretty decent, but for the price you can do much much better in the city. Super Duper has similar prices but significantly better food, and In-N-Out is the undisputed king considering the price.", "author": "Neel D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-04", "description": "Just made my first visit. Ordered the veggie burger and was disappointed to find it was actually a black bean burger. Usually that's called out of the menu, since it has such a distinct flavor.  The patty was not very firm, and ended up oozing out the sides of the bun. Not at all a satisfying veggie burger experience. It's a bummer, because the bun, grilled onions, etc., were delicious.  But, without a good veggie burger option, I will not return.\n\nAlso got the veggie fries (guess they're usually fried in lard), and they were quite good. Wish they had a smaller order, though, because the amount was far too much for one person. \n\nOne other thing to note was how long it took for my order to be completed.  More than 15 minutes. Far too long to wait for a burger and fries. Don't know if it would've been shorter without the veggie fries.", "author": "Lyn R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "Great burgers and fries and great staff, somewhat on the pricy side but it's all organic meat so it's reasonably priced when you consider that. I have eaten at most of the top burger places in SF (fancy and hole in the wall) and this place can challenge or beat any. Don't pass this spot up if your looking for a new burger place.", "author": "Freddie Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "(Sam Jackson voice) Mmmm!! This is, a tasty burger.\n\nHigh quality all around from the meat down to the milkshakes. \n\nA bit expensive but definitely worth it. \n\nThis place will do well on west p.", "author": "Greg Poupon M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-11", "description": "Just tried this place out for the first time. Here is why I only gave it 3 stars:\nI ordered a 1/3lb Bacon Avocado burger, milk shake and the fries were a separate order.\nBurger was cooked to order, but the burger was falling apart while I was eating it, and the bacon was chewy. Although I did like the bun it was on. \nI was not a fan of the \"home made ketchup\" they had. Tasted like I had smeared marinara sauce all over. (3 over 5 stars)\nFries came out well, but I had to pay for it separately (4 out of 5 stars)\nMilk Shake was the savior here, but a little on the high cost side. (4 out of 5 stars)\nBy my self, ordering what would seem to be a basic meal, it came out to $25 with tax and tip. It was good to try once, but if I had to feed a family of 5, it's not worth it. Just my humble opinion, but there are other better burger joints in the area.", "author": "Adrian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "I am not one write many reviews , but this place is so good. The milk shakes are delicious, the fries are cooked perfectly, and the burgers are made from the tastiest cows on earth. Well worth it. But don't take my word for it. Go in and check it out. Friendly staff will help you and the hunger you had will melt away in a fantastic eating experience.", "author": "Amber L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "Had an hamburguer for dinner. Quarter pounder medium done filled with lettuce, tomato, caramelized onion, pickles and calibur's sauce and topped it with cheddar cheese by recomendation of the waiters who were really kind. You can serve yourself fresh water and extra sauce too!", "author": "Eduardo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "This is the best burger place I have found in the Sunset. The meat quality is excellent and I get the gluten free bun and it's way better then the one at other places nearby. The service is personable. The chef hand delivered our order and noticed we hadn't gotten ourselves napkins and he ran and got them for us. They have a good selection and everything is good quality.", "author": "matthew m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-18", "description": "Sorry, but there is nothing special about their burger. With so many great burger options in the city like Causwells, Roam, Chez, etc., I expected something amazing when i ate here.\n\nI was pretty annoyed that when I ordered, the worker never asked me about adding cheese. Like seriously? If you aren't gonna ask me what cheese I want, then it should be included automatically. There was no clear signage about cheese options. Definitely not visible on the topping list. So I had my burger with no cheese. So that sucked.\n\nEven without the cheese, there was a lack of flavor going on. Beef patty was just okay, seemed a bit on the dry side. And their \"Sauce\" tastes like a bland salsa. Only real flavors were the caramelized onions and mushrooms.\n\nI got the chili cheese fries, and that wasn't that great either. \n\nThe only bright spot of the dine in, was my vanilla milkshake.\n\nI wouldn't say this burger joint is overpriced. I think if the food is amazing, the price will be justified. So I guess spending $23 and change on a mediocre experience didn't feel that great.\n\nThe people here are nice, and I wanted to love this place because I live close by, but don't think I will be back anytime soon.", "author": "Charles L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "I came here with my friends for dinner. It is delicious and cheap. I would suggest the Garlic Fries, one of their burgers, and going there for lunch or dinner. I hope to return here.", "author": "Will D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Burgers are fresh and made from local ingredients! Fast service, neat place, fries are really tasty and the milkshakes are amazing. Serving is huge! You'll get the most from your money! Totally coming back!", "author": "Krizzia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-13", "description": "Delivery came in about 40 minutes. The driver was nice, even though he did not get out of his car and he handed my food through his open passenger window. Some people have a self-locking gate, door, etc and can't just leave the front entry open while running out to the street, so I was glad I had my house keys on me.\n\nFrench fries were so salty and they were soggy too. I would not have minded it being soggy. But the salt was so overwhelming that I tossed the fries in the compost bin.\n\nAdvice to restaurant owner: go lightly on the salt. And also, with hamburger delivery, if someone requests tomato, please have it in a separate container or separate it from the burger. My hamburger bun was soggy and soaked from the tomato slices.\n\nThe burger patty itself was good. I dunno, I just don't think I'll try this place again. Delivery fee was $5 and then tip was additional (I confirmed with eat24 that the delivery fee did not include tip) and if the food was good, I would not mind. I'll stick to Super Duper.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-09", "description": "This is my first time here, and I was expecting it to be as good as the reviews said. HOWEVER, I am extremely disappointed in their food and service. \n\nFirst of all, the cashier was rude and not polite at all. I ordered 2 quarter pounders, one with everything and cheese, and the other one with everything, bacon and avocado, and a side of garlic fries. The buns were too sweet which overpowered the whole burger. The meat was done medium rare like what I had asked for, but it had NO seasoning at all. Overall, the flavors of the burger did not complement each other.  \n\nSecondly, the garlic fries had a bitter taste because of the rosemary garlic mixture. NOTHING GARLICY ABOUT IT AT ALL. And also, it came with their \"homemade sauce\" which he said was ketchup, but as it turns out, it's just marinara sauce which does not taste good with fries. \n\nI spent $28 dollars, and it was SO NOT WORTH IT AT ALL. Super overpriced. With this amount of money, I could have bought 4 IN-N-OUT MEALS!! Never going back again.", "author": "Anna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "I was moved to write this review today after my fifth visit to Calibur. I'm getting totally addicted to this place and nothing would please me more than if everyone could experience what Calibur offers.  Most basic, the burgers are totally amazing, juicy, delicious with an old-fashioned beefy taste that I haven't encountered since my childhood.  I'm serious; these burgers are f'ing extraordinary. If you don't specify otherwise, they'll be cooked medium rare.  The first time I got one of these medium rare burgers I was alarmed, having grown used to gray over cooked patties because of the danger of pathogens in rare ground beef.   But no worries here; their meat is super fresh and local, from a ranch up in Mendocino.  If you're still worried, just specify medium when you order.  A standard burger comes on an almost magical bun, more like brioche than commercial bread.  It's topped with delicious griddled  onions, lettuce, tomato and sauce.  Today I added blue cheese to the burger, and that's the way I'll order it forever.  I wish I could accurately explain how delicious these burgers truly are. In Michelin Guides a restaurant with a star is described as worthy of a detour from a planned route. And so that's how I'll finish this review; Calibur is worth a trip from anywhere in the city - so today I anoint it SF's first Michelin Star burger place. Bravo Calibur!", "author": "Peter D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-06", "description": "This burger place wasn't bad but wasn't as memorable either.  I prefer the bullshead restaurant down the street.  It was nice to try something new from the neighborhood restaurants though.", "author": "Belle P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "Absolutely delicious burgers cooked to perfection and incredibly juicy. Fries made with beef tallow? Outstanding served with Calibur sauce, a homemade ketchup with fennel.\n\nI had a chance to talk to one of the owners, Sean. He's incredibly passionate about what he does. A former caterer, he had a vision for a burger place where friends and family can enjoy a fresh, simple menu of burgers, fries and shakes. Given the great food and the fact that he seems to have a bunch of regular customers he knows on a first name basis, it looks like he's done a pretty good job accomplishing that vision.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Hands down one of the best burgers I have enjoyed in a while. I ordered the Organic beef burger, with bacon, avocado and blue cheese. The bacon was nice and crispy, lots of creamy avocado, and the blue cheese was just right. I liked the house made special sauce too. Also, the gluten free bun was surprisingly good. I'd like to know what kind they use. I don't usually come across nice and fluffy gluten free buns. All and all it was a pleasant Door Dash experience with Calibur!", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "Found this place out of the blue and was blown away by their amazing burgers and kind hospitality. I did a little extra onions on my burger (which I didn't want at all) but they corrected it within a few minutes and even let me keep the burger instead of tossing it out (my nd will eat anything and was excited he got an extra burger). And people say this place is expensive but when you bit into the juicy burger you'll forget just how much you paid for it. You can clearly taste the high quality meat and ingredients of this burger. And coming from a girl who not only works at a burger joint but craves burgers on the daily, I've been around the block when it comes to which burgers are where it's at or not and I'm happy to say that Calibur will be on my list of regular places to get some great food. Keep going strong guys!!! :)", "author": "Holli K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "The food was fantastic.  The fries are a sin.  The homemade catsup, the bomb. The nice young man working there couldn't have been more helpful and lovely!   I'll so be back.", "author": "Stephanie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "3 stars for flavor,  extra 1 star for good quality ingredients.  \nI wanted to try this place because of the concept.  I like to support these kinds of establishments.  \nParking was easy,  came around 5pm on a Saturday before the evening rush.  Place was clean.  Customer service was great.  \nI order 1/3 pounds burger with everything and cheese for $1 extra.  Husband and I shared their tallow fries and cookies n cream shake.  Burger was really juicy,  veggies were good quality and pickles were good quality also.  They use their own ketchup,  i was a bit disappointed it didn't have mayo and mustard since i prefer mine that way.  I did overhear someone ordering with mayo though. Burger was ok for me though,  it lacked salt and flavor.  I know grassfed beef and what i like about it is that you can taste the beefiness,  if you know what I mean.  \nFries were cooked well.  I was a bit disappointed when I read that they use a mix of tallow and rice bran oil.  I know tallow is expensive that's why a lot of establishments use cheap oil and this place had to use a mix.  But it has its great health benefits and lots of flavor too. I was hoping I found a place that uses good oil when I don't feel like making my own fries.  I was even willing to pay the price.  \nI do like the direction they're going and it's a good place worth checking out.", "author": "Claire J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Been here four times. Cooked to order on the spot with fast service & great folks aim to please with a fair price. Consistently excellent burgers based on quality meat. Perfect fries. Excellent with a good, dark ale. We bring them home living nearby & give the fries an extra shot in the toaster oven adding a bit of malt vinegar. Burgers are crispy on the outside & moist inside. Buns don't get soggy like many places do. I like mine with bacon & sometimes avocado, my wife likes cheese. We've tried burgers worldwide - Calibur's are as good as the best.", "author": "Terry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "I've eaten here several times and have never had a negative experience. The co-owner Patrick told me that \"he wanted to make a burger he would feel good about serving to his family\" and that is exactly what he has created. Almost everything that goes into the burgers are 100% organic, but more over, the burger tastes better than any burger I have had in San Francisco.\n\nThe staff are all knowledgeable and personable thanks to the care that the owners put into training. Ask any question about your order and the FOH staff will almost certainly have the answer. While they are pricey ($7+) the portions are also massive and you will never leave here hungry. As a burger enthusiast, I'd recommend Calibur to anyone who considers themselves a fan of burgers/fries/shakes. Will definitely be coming back!", "author": "Jacob A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-06", "description": "A few weeks ago, the SF Chronicle had a big write-up of Calibur tossing around words like organic, sustainable, grass-fed, etc.  We decided to try it based on their review and were not satisfied.\n\nLocated near the West Portal Muni station, parking is rather difficult during the day.  We parked a few blocks away in the residential neighborhood and had a leisurely walk there.  It was lunch time midweek and it wasn't very busy.  We ordered a couple of 1/3# burgers and one strawberry shake ($5.95).  Our food arrived relatively quickly, but the sandwich was too mushy.  Too many soggy ingredients were in the burger.  It really didn't have much flavor, though it was cooked nicely.  The shake was thick, but was also a little flat.\n\nThis was an expensive lunch ($20+) for a couple of burgers and one shake.  Sometimes I think restaurants toss out descriptive words about the quality of their so call organic foods to justify the rather stiff prices.  It is not a burger place for a middle income family with modest means.", "author": "Robert J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-16", "description": "We found this nice little surprise in West Portal and had some great burgers. It really fits that 50s, throwback feel that west portal has (i'm not the only one that thinks that right?) but has a very millennial, organic focus to it. In the vein of old burger joints, It keeps its options pretty limited and focused. You can get a quarter pound burger, a 3rd pound burger and a half pound burger. The patties are all made at the site and that includes the vegetarian burgers. The burgers we had were really good, as were the fries (they make a great housemaid ketchup) and milkshakes. \n\nThey also get bonus points for great music. We will likely be heading back next time I'm in need of a burger fix.", "author": "Baron C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Great spot!! Came here while visiting family in SF and randomly picked out this place to eat. I must say DELICIOUS!!! I'm from LA and there are plenty of bomb.com burger joints and this place is one of them!!!! I recommend everyone to try this place out!!", "author": "Samira B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "This is one of the kind rather chain hamburger restaurants like the Roam or Super Dupe burger.  As for the independent one of the kind the price is not that expensive.  But a bit cheaper than these. \nDue to California drought the food cost has all gone up but the owner guy Shaun is nice enough to didn't raise the price.\nI think it can be nice price since I've paid 10.00 dollars for the organic ice cream and organic grass fed hamburger. \nIt has been five months old for this Calibur and I wish I can taste the its homemade sauce for the burger and fries.  I got fed up with all kind of corn syrup ridden Junki food.  Hopefully this place can be succeed so that be around for ages.", "author": "Piano B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Solid burgers, fries, and shakes. The simplisity of the menu is a bonus. I never trust a place with a novel type of menu.\nGrass fed, organic, local fa la la!! The burgers are perfect, the bun holds up but not too filling, thick patties from 1/4lb to 1/2lbers\nKind spirited owners,\nSupport local small businesses!!", "author": "ERICA E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "I have been a repeat customer of Calibur for a few weeks after having discovered them through an app. They have amazingly good food. The burgers are customizable for even the pickiest eaters and purists. The tallow fries are hands down the best in the City. \n  The amazing food is only to be surpassed by stellar customer service. My most recent order was seen to personally by one of the owners who went above and beyond to make sure my experience was great and that my business is appreciated. I cannot express how impressed I am overall with Calibur and it's amazing staff and owners. Definitely recommend and will be a faithful customer.", "author": "Tone G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-26", "description": "I love the idea of this place - organic food and simple menu.  The staff was very nice and welcoming.\nHowever, the burger was just ok.  there was supposed to be a \"calibur sauce\" on it and I didn't taste it.  The burger was bland.  Seasoning or a better sauce would  go a long way here. \nThe fries were very good.  5 star fries.\nThe chili cheese fries were disappointing to me.  There were green peppers in the chili.  I HATE green peppers.  They are not a normal ingredient in chili and this ruined it for me.  The rest of my family liked the chili just fine but I was very disappointed.\nOverall, this is a 3 star.  I would not go back for the burgers unless they changed the recipe or the sauce.  I would go back for the plain fries though.", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-11", "description": "I wish I had believed Robin A's review and not all the others before we went there. That review totally nailed it. \n\nIt's weird--everything is good except the burger patty itself, but that meat is nasty. 80s amusement park gross. Our stomachs remain in recovery.", "author": "William S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Delicious every time. I usually have Postmates deliver it and it's consistently good. I'm not a fan of the house made ketchup, but the burgers, shakes and fries are solid.", "author": "James R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Delicious organic burgers with amazing french fries! They have house made organic ketchup and milkshakes from three twins organic ice cream. A great place to come with the family in the adorable Portola neighborhood!", "author": "Tigris A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "If you live in the surrounding areas of West Portal (Parkside, Sunset, Ingleside, etc), no need to drive 15 minutes to in and out while having to wait 30 minutes for a damn burger. Super duper in downtown? No thanks, too far. Calibur is the place to go. It's nice to have a burger joint in our area!\n\nThey have quality burgers, their paddies are on point(request medium-rare), extra crispy fries are actually crispy and they even make their own ketchup. (It's the small details that count) \n\nIt's not a fine dining restaurant, so don't listen to these people expecting fine dining service. The employees are chill, their menu is simple, and whatever you need is right in front of you. They have ice cold water as well (yes I said ice cold).", "author": "Richie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "Oh Yea!!!!!! Yummmmmmm-y amazing burgers 3 sizes AND a vegetarian too! The most delicious chili fries - homemade yummy!  The standard caliber style - Carmelites onions, caliber sauce, lettuce, tomatoes and pickles! You can even add a fried egg!! This is definitely a place to visit if you want first class quality ingredients and fabulous burgers and sweet ice cream and milk shakes!!!  You won't regret visiting. Give a little extra time for parking, well worth it!", "author": "Teresa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "My husband and I decided to check this place out randomly on our way home from work. It looked like your average \"fast-casual\" burger place. We ordered quarter pounder burgers, fries and shakes.\n\nThe burger was cooked PERFECTLY, the beef literally melted in my mouth. GREAT quality beef and the Calibur sauce is delicious. The shakes were made with Three Twins ice cream, which is great since my husband is allergic to corn syrup and usually can't drink milkshakes. The manager was very friendly and came by our table to check on us. \n\nOverall we were very happy with our meal but YIKES is it pricey! Two burgers, two fries and two shakes = $38.00! The place looks like your average cheap burger place so we were surprised by the cost. SIX dollars for a milkshake is a little much in my opinion. \n\nHowever, the portions were very large and in the end we ended up with WAY too much food. In the future we will probably share an order of fries and a shake. \n\nWe will definitely come back again.", "author": "E V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-20", "description": "Not a cool spot. The burgers here are way over priced for the quality of the burger. The menu is way too small as well. On top of this the condiments are so small I can see why this spot is never busy. When I order a burger a expect a BIG JUICY BURGER not some shrimp sized patty. A change needs to come here so that the cost and quality of the food are equivalent to reach other.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-24", "description": "Service is so slow as to defy belief. 15 minutes and counting for a milkshake with the store half empty. Their logistics are terrible", "author": "Vijay G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "This place is the Bomb.com!!! Great Service, Awesome Food! Even the owner came out to greet us. I mean he really greeted us sincerely!!! If you are looking for an amazing local burger joint, this is the spot!!!", "author": "Kenneth C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-15", "description": "New burger joint on West Portal with 4.5 stars!? Sounds like a dream come true. When it comes to burgers (and burritos), I consider myself I foodie. I've had hundreds all of the world. So why the bad review? I really hate to do this, but I think this would help management. \n\nThe Good: Fries were unique and I enjoyed them. Organic items on the menu, simplistic menu which I'm a fan of and sugar cane coke bottles. \n\nThe Bad: I ordered a medium rare burger and it came extremely rare. Sadly, I took one bite out of the burger already and swallowed (and got sick shortly after). I never usually send items back, but this time I had too. The meat was so rare, the center was cold. I never order a burger anything other than medium rare (best flavors, imo), so trust me, I know what rare and medium rare looks like. The owner (I believe) agreed and apologized several times. He was really on top of it and I applaud him for handling it so well. He brought me another burger and followed up within 3 minutes. Sadly, this time it was cooked well done, but I didn't want to prolong my dinner since my girlfriend was nearly done with her food. As an FYI, her burger was medium well versus her requested medium. \n\nFOOD/DRINK: \n-Got the 1/3 pounder with cheddar cheese and avocado\n-My girlfriend ordered the 1/4 pounded with cheddar cheese\n-Large fries\n-Coke and Sprite (bottles)\nTotal Bill: 32 dollars\n\nAMBIANCE: Simple burger joint decor, not a whole lot of character or personalized. They had the giants game on though, which was nice. \n\nSERVICE: Unlike my fellow yelpers, the service was very good. One inconvenience is if you order a bottle soda, you need to grab it on your own, then walk back to the cashier to have them remove the cap. Often times, waiting for someone to finish their order. It would better to have a bottle cap opener on that utensils table, since the restaurant is self serve anyways. \n\nCREDIT CARD: Yes\n\nPARKING:  Meter\n\nOVERALL: No matter how good a burger is, if you don't cook it properly.. it can't be that great. It may be growing pains since they're new, so I hope to try them out sometime again. However, definetely not a good first experience.", "author": "Austin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "While walking here we were musing that for a new burger place in sf, they gotta deliver!!! \nWe went over what we had to compare it to...umami, roam, in n out, super duper....\nWell they got a great foothold here in our book! Big juicy burgers with everything on them (plus caramelized onions included!), house ketchup, crunchy fries... simple menu but what more do you need, really? Next time we are trying the shakes!", "author": "Kitty O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "I've been waiting for this place to open and finally went in and had a burger. The menu is simple, which is nice. Decor is cool. Very clean establishment. Burger? Hands down the BEST burger in sf. Meat is super high quality. Cheese is perfect. I love me a good bun. Condiments all fresh. Do yourself a favor and go there ASAP!", "author": "Mary V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Here's my dish on this new West Portal burger spot.\n\nThe good:\nI was a big fan of Joe's Cable Car. Calibur does a better burger, a MUCH better burger. The meat is excellent. The veg. with the burger is fresh and tasty. Great bun. The ketchup onion sauce absolutely rocks the burger. Flavorful and perfectly cooked. Hands down the best burger I've had in San Francisco, and I've been to all the supposed top spots. The fries are also very good, as are the shakes.\n\nThe bad:\nIt's a small place. However, so far seating hasn't been that bad. \n\nA few comments:\n- Calibur had kind of a rough start. I was there early on and service was slow + they were having problems with their fries. However, both problems have been more than fixed. The service is now very good and the fries are now excellent.\n- Their homemade ketchup sauce rocks on their burgers, but I like regular ol' ketchup on my fries... which they have if you ask for it.\n- Wish they'd put a condiment station by their water: ketchup(s), mustard, & hot sauce(s)\n- Wish they'd add onion rings to the menu.\n\nSummary:\nCalibur is now my favorite spot for a burger in San Francisco.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "Wow, amazing burgers. We ordered 1/4 pounder and 1/3 pounder, both \"Calibur-style\" and both with egg on top. They had Siracha and Tapatio to add, if you wanted - which completely made my day. \n\nHamburgers were super juicy and super delicious. Split one order of fries, and alternated dipping our fries between homemade ketchup and the amazing juice that dripped off from my burger. Topped off with Vanilla and Strawberry milkshakes. Whew. :-)\n\nFirst time here and plotting next trip back.", "author": "Theresa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-11", "description": "Something has CHANGED here!  We ordered what we always get but somehow it just didn't taste as good as it did in the past.  This was our go-to place for burgers but we may have to keep searching.  Also, they charged 75 cents for ranch dressing to go with our fries.  That's not right.....!", "author": "Donna R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Damn good burgers...delivered?  My dream has come true.  If only they would put the lettuce on the side, it is soggy by the time it arrives.  Fries are awesome too.", "author": "brett b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "Calibur has the best burgers in west portal and some of the best is SF.  They had some growing pains the first but have significantly improved since.   I have upgraded  my review score.", "author": "Jeff G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-26", "description": "Good food, but very slow service. After 30+ minutes waiting for very simple food we received no apology for the wait. Meat was not cooked as ordered. They ran out of fries... Not coming back...", "author": "Matthew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "My bacon dbl cheese burger was juicy and cooked to perfection. Surrounding it the was a moist buttery brioshe bun, the best I've ever tasted!The staff was super nice and i felt at home. Safe to say I will be a regular here.", "author": "matthew w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-26", "description": "Pretty good burger shop. The veggie burger will KILL you with spiciness.  Fries are awesome as is the bread on the veggie burger and the grilled cheese. Nice salads, too.  Great local part of San Francisco.", "author": "Amy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "Got the quarter pounder with 3 toppings: bacon, mushrooms, and egg.\nI have to wonder if the topping proportions are randomly sized or they just try to fit it all in. I did here this couple nearby compare bacon portions, and they seemed different.\n\nBurger was okay, got it medium-well, the juices pretty much could not contain themselves and made a mess. I was really surprised about how intact my egg remained. The bacon wasn't crispy, it was thick though, just not well crisped. Mushrooms were tasty though. Bun was what I expected, nice partially-shiny crown, something that will hold all the yummy...it did give out when I got more than half-way done, got all soggy on me :(\n\nAlso got fries to share. Really should have known better, for two people, a large order of fries is overkill and just an accessory to this meal I could have gone without. A bit on the limpy side too. Their house-made ketchup isn't bad, it's different, but you have to see it in the unprocessed light vs the standard ketchup they also offer. It's weird, and I haven't decided if I like it, but I don't hate it.\n\nMilkshake was really light. Flavorful, yum, yes, but if you want thick (and cold) this won't be it. If you don't want to fight your drink, then get this $6 shake, or grab a squirt soda, OR Mexican coca cola it!\n\nIt's still 4 stars because there is potential, and really for what they are offering, the price is on the mark. Can't really say what the \"special\" factor is. Maybe it's offering high-quality ingredient for your basic burger and accessories? I like to think of this as my fancier In-N-Out. Yes...that's why we shelled nearly $40 here for 2 burgers, a milkshake, and fries.\n\nAnd they really weren't as slow as some of the reviews made this place seem. It felt like an average wait time of 5-10 minutes for orders, and place was getting packed after we got there.\n\nSo food is solid 3.5 (noting botched, nothing really profound)\nI want them to do well...and amaze me next time, so I rounded up okay!", "author": "Carol L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-07", "description": "New Burger place on West Portal, FINALLY!  \n\nThis burger has great flavor, awesome bun and the burger to bun ratio is on point.  Very nice, thanks guys well needed in the area.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "Was looking for a good burger place that served gf buns, an me and my two friends came here and that was such a good call. I got so many toppings and Sebastian helped me out the entire way through. So many mods on my burger and not one mistake, nice job kitchen. Food was on point, and Sebastian kept checking up on us through out the meal cuz he knew we were a high maintenance group. Seriously, that guys is a restaurant natural. Spot is lucky to have him.", "author": "Lazer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "We love this cute little burger place and are so happy that it popped up in west portal!  \n\nWe visit caliber almost weekly as my son loves their burgers and the serving is just perfect for him and so yummy and juicy!  He literally knocks on the door in the mornings when we walk by because if he could, he'd want breakfast, lunch and dinner from here!\n\nGreat addition to the neighborhood!", "author": "Kristi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-23", "description": "This place uses high quality ingredients and you can tell through the taste. The beef tastes really good, the vegetables taste fresh, and the fries are tasty.\n\nOf course, using good ingredients comes at a little bit of a higher price, but I certainly don't mind for anything that is of quality.\n\nThe fries are really good. They have a nice texture to them. Mildly crispy on the outside but still a little soft. I found them to be seasoned really well.\n\nA couple things that I wished they did, as far as my personal preferences go. I'm a huge mayo fan, and I think that any really tasty burger will either have mayo or a mayo based sauce (like In-N-Out spread, Big Mac Special Sauce, Shack Sauce) to take it to another level. Here I think they only add their house made ketchup (which personally I don't care too much for, and thankfully isn't a dominating flavor).\n\nAlso, I'm more of a soft bun kind of guy. While you can take a look at their bun and immediately tell that they are fresh and artisanal, they aren't as soft as I like. I like burgers with soft buns because they kind of stick closer to the patty and holding the ingredients much better. Eating the burger here can be a little more cumbersome, and I think that's because of the bun.\n\nDespite my nitpicking, they still make a really good burger. Perhaps one of the best in the neighborhood and surrounding area. The service is friendly and attentive which certainly goes a long way in making me want to come back.\n\nAnother bonus is they serve Three Twins ice cream. Haven't had an opportunity to order it here, but would definitely come back to try a shake some day.", "author": "Jeffrey J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "My husband and I came here for a pre-movie bite. It's a very clean, bright casual place. We weren't super hungry so we decided to split a burger. We ordered a bacon cheeseburger, it was cooked really well and as a nice service they cut the burger in half for us and put it on two plates without us even asking. The fries we good, but we weren't partial to their homemade ketchup. The only downside is the prices, a little more costly than other casual places in West Portal, but I would come here again for the food and really good customer service.", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "Burger great. Chili-cheese fries perfect. Shake flavorful. Portions generous. Everything about the burger was just the right density and substance, if you know what I mean. Often, large burgers will have too tough a bun which squishes the ingredients between out the sides, or have a bun or patty that's too loose and falls apart under pressure, but this burger was just right. As the trays warn, it is very juicy and leaks a lot.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-13", "description": "High competence\n.\nPerhaps not in spelling: http://dictionary.reference.com/browse/caliber\n\nBut absolutely in burgers. Homemade veggie burger was a huge black bean infused patty of brilliance. Comes topped with caramelized onions, lettuce tomato and pickles.\n\nEach bite was outstanding especially when paired with Calibur sauce. Loved it was ketchup based instead of mayo.\n\nAlso loved learning ketchup will make the bun soggy so it's served on the side. For $9 the burger isn't cheap all the toppings are included plus insightful knowledge for free.\n\nMenu is limited and the space is sparse with nice vintage touches. They clearly invested where it counts as both the food and staff were of impressive quality.\n\nHigh praise all around.\n\n(including to Erica W. http://www.yelp.com/user_details?userid=GNDPGumn6Gy7c9a9xTk_mg who pointed out the name isa combination of CALIifornia and BURger - thanks!)", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "I eat here pretty much only for their fries. I get them extra crispy and they are incredible. Love that they are fried in tallow!", "author": "Jason C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-11", "description": "I'm sorry, but I simply don't understand what people like so much about this place. The ambiance is nice and the well dressed up hole in the wall is inviting and in a good area with lots to see, but other than that there isn't much else that shines for me. The biggest problem is the price, and boy for what you get it is high. A burger can run you anywhere from 8 bucks all the way to around 15 dollars. Toppings are WAY to expensive. $1.50 for your average slice of cheddar is pretty steep. Milkshakes cost almost as much as the cheapest burger and the veggie burger is your typical run of the mill patty. I get that this place is supposed to be organic and GMO-free but honestly it doesn't even taste that way. This reminds me of a more expensive, lower quality super duper burger. At least at super duper burger you can tell the food is high quality. \n\nThe people who work there are nice enough and they are willing to answer any questions that you may have, as well as bus your table for you (which was unexpected at this kind of place) but strangely enough one of the people working there (seemed like a manager type) was watching my company and I eat maintaining eye contact with me and then the second I finish eating he almost jogged over to the table to grab my dishes. Maybe it was a one time thing but the high price alone would make me not want to come back.", "author": "Nathan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-29", "description": "Great service! Very nice staff :D the best burger I have ever had! The meat is juicy and everything is fresh. Spacious inside and clean. It may be expensive but it is definitely something you might wanna try ;) although I asked for medium rare and my patty was well done, it was still delicious. No worries, practice makes perfect :)!", "author": "Karen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-22", "description": "15.01.06      First Visit\n\nFood --------------------- 4\nService  ----------------- 4 - 4 1/2\nCleaniness ------------- Very good\n\nHamburger\n   Buns from SF's Panorama Bakery Co.\n   Panaroma Beef\n   Grinds Panorama organic grass-fed beef every day.\n\nTwice Fried Fries\n   in house-rendered beef talon\n   organic potatoes \n\nThree Twins ice cream\nIn West Portal for roughly 2-3 month.\n\nIn an article ... co-owner Sean Patrick quoted:   \n   \"The menu's not 100 percent organic. \n    But for sure, all the time, without fail, \n           the meat, mushrooms and lettuce are,\" \n\nThey \"kick up a notch\" on everything\n   Bread\n   Beef\n   Fries (twice fried and talon)\n   3 Twins ice cream\n   Their homemade ketcup (have to ask them)", "author": "S.K. Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "This place has great burgers and awesome fries - very crispy. I love the house ketchup. The staff is very friendly and there were lots of smiles everywhere. I ate the double cheeseburger with a fried egg. OMG!!! Loved it. The yolk oozed out and all over the  geese and patties. So tasty.", "author": "Wilfred B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-28", "description": "I had the quarter pounder. It was pretty small and was about $8, if I remember right. Go to In and Out instead..it's just as good.", "author": "Karissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "We have been going to Calibur almost weekly for about six months now.  When we get takeout we only get the burgers.  The four of us have different toppings and they are all top notch.  The avocado always amazes me because it is the perfect ripeness every single time.  The best topping though is the caramelized onions and I think that is what really what pushes this burger to be my favorite.  The bun is the absolute best I've ever had. The burger itself is so juicy and has such a wonderful flavor.  \nWhen we eat there, we also get a shake and some drinks.  The variety of drinks is fantastic and the milkshakes are how I remember from when I was a kid.  \nThe staff is super friendly and they are really nice to the kids.  I hope that Calibur will be on West Portal for many years to come.", "author": "Christie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-20", "description": "So 19 dollars for a burger, Coke and fries is super pricey, tasty but the burger was somewhat bland. Nice staff. The biggest appetite  killer is the rampant children running and screaming in the doorway and a young father was changing a baby's diapers on the chair at an adjacent table.", "author": "Mark N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-23", "description": "Very cozy location.\nEgg on top of my burger cooked perfect\nthe special sauce taste like sweet marinara sauce.\nbacon was ok\nmilk shake was awesome\nchili fries ok", "author": "Justin I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-04", "description": "Food is good. Service, not so much. Called in a to-go order and the guy who took our order said 15 mins. We got there in 10 and the guy working the register was nice and said it'd probably be 5 more minutes. Perfect. After waiting 20 minutes and seeing others who came in while we were waiting get their food, the guy finally realized that one of the bags that had been sitting there when we walked in was ours. I complained that now the whole order would be cold and he tried to convince me that it had just been brought out. And then he got angry with us for wanting to check it. A simple \"sorry\" would have fixed it. But the rude treatment we got instead insures we won't be back.", "author": "deb b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "I don't know why I hadn't tried this place sooner - maybe because I typically have burgers for lunch, and am usually not in the area at lunch time. We decided to have burgers for dinner, and the manager made me feel welcome right away, explaining the menu, etc. \n\nI ordered the third pound burgers, forgoing the fries because third pound burgers sounded like enough, right? But as I was waiting for my order I watched the family at the next table enjoying their burgers and fries, and those fries looked really good. The manager must be psychic, because he came over and said he wanted to be sure he got my order right: \"You didn't want the fries, correct?\" I had to admit that that they looked pretty tempting...he said he would include a half order gratis, so we could try them. Sweet!\n\nWhen we got home, we found what looked like a whole order of fries included, and they tasted every bit as good as they looked. The burgers were also excellent: juicy and flavorful, everything you could want in a burger for a very reasonable price. We will definitely be back!", "author": "Meredith S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-19", "description": "3.5 Stars.  Solid burger, decent fries, weak shake.\n\nThe burger needs little, if any, help.  It can hold it's own against most challengers.  Wonderful patty, good bun.  The bacon I ordered was a little undercooked, but was of good enough quality that I didn't care.\n\nThe fries were the soggiest tallow fries I've ever had (they were delivered, but still).  Other than the sog factor, the fries were good and I would have eaten them all if the burger hadn't filled me up.\n\nThe shake, though.  Not that good.  It had a skim milk quality to it.  Maybe I've been spoiled by Popson's and their half n' half shakes, but this one seemed really bland.  \n\nOverall, a good burger joint with plenty to offer for reasonable prices.", "author": "Lester B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "I like burgers. I really like Calibur burgers. Their fries are fried in cow tallow... I dunno wtf cow tallow is but it makes fries taste amazing... And their organic catsup.... GTFO here... A lot of places make a burger with an amazing patty, but the bun doesn't hold up.... Not here... The bun is solid. And now you can get Calibur delivered??? Wtf. I'm not sure if Obama had anything to do with this, but thank you Obama, America is a great place.", "author": "Eucalyptus J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-25", "description": "Very bland burger. Fries were good but there are many burgers that are way better. Don't really understand why this place gets 4 stars. Kind of overpriced and nothing special", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "Pretty solid veggie burger. They offer gluten free buns and lettuce wraps but that's not very clear on the menus. Feels a little like in and out burger which I see as not a plus.", "author": "jonni s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "Perfect neighborhood spot for a classic burger and fries. The meat is organic and tastes great. I love coming here. The restaurant is unpretentious and makes a few items really, really well. Highly recommended!", "author": "Kenneth S. L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-10", "description": "Spent almost $20 for a quarter pound burger with avocado, cheddar, and mushrooms with a side of garlic fries. Good, but not a good value for the money. Super Duper is still my favorite burger in the City.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-16", "description": "I was really looking forward to this place after reading the reviews. The employees and the owner there are really nice and accommodating. That's why I gave them three stars. \n\nThe burger was a little disappointing though. It was under-seasoned and dry. The burger lacked flavor and a good crust. It was far too lean for my liking. But the egg was cooked perfectly- brown and crispy whites and a runny yolk. The drippings made a nice sauce for my fries. More so than the homemade ketchup. \n\nI like the idea of fries cooked in beef fat. But I gotta be honest, I've had better fries. People want organic and grass-fed beef, but it's still gotta be tasty. Go to NY and taste a Shake Shack burger. That's what a burger should taste like.", "author": "William B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-20", "description": "5 big 'ole stars for the service, seriously. No restaurant snobs here. \n\nHowever, I'm not a big fan of their burgers. I really, really wanted to be, but no. Their \"special sauce\", my friend and I agreed, isn't that good at all. And the beef itself wasn't even that great, especially considering the price. It's not terrible, but it's definitely 3 stars. I liked the fries, but c'mon, one can't judge a burger place for the fries.\n\nSide note: my husband dropped his Coke bottle on the floor leaving shattered glass everywhere. They were super cool about it and the manager cleaned it up. Thought that was nice. So thanks guys!\n\nUnfortunately, I have to say, head up the block to Bull's Head. They will hook you up with the best burgers in town. Order the mini corn dogs or chili cheese fries for appetizer...you won't regret it.", "author": "Shannon O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "Just ordered through uber eats. Food is incredible as always. Big shout out to Michelle for helping us with the onion situation. Thanks boo!", "author": "Gregory W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-04", "description": "If I can give no stars, thats what I'd want to rate this little place. The only thing bad about this place is the cashier. He was so rude! I was trying to help him out during payment, but he just cut me off as if I was taking up his time.  There was NOBODY in the restaurant other than me and this one other lady.  The food is good but sadly if that's how the customer service is, I can find burgers and chili cheese fries somewhere else.", "author": "Diane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "Amazing burgers great service! Fries are super good! Nice fresh ingredients and you can really taste the quality! If your in SF it's worth the trip over to calibur for an out of this world burger!", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-26", "description": "I was happy to see that an organic burger joint was popping up in my neighborhood, but I was very disappointed by the outcome. First and foremost, before a \"hello\" at the counter, the employee said \"We're out of fries.\" Well, good evening to you too... For just two burgers with no fries and no sodas or milkshakes, the total came to ~$25 dollars. Then we had to wait for over half an hour! They were serving others who had ordered after us! I noticed that two ladies near us complained to an employee because their meat was undercooked and I was worried about how our burgers would turn out. And after 40 minutes of waiting, we received our burgers and my well done burger was pink!! I ate it anyway because I'm not a diva, but that isn't right for an establishment to ever do this, especially if they take pride in individualizing every order and being whole-heartedly organic.\n\nYou are better off not coming to this restaurant.", "author": "Louise C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-22", "description": "The burger tasted like paper mache. Lacked any hint of flavor and came out suspiciously fast for one that thick (yet at best lukewarm). The fries were pretty decent.", "author": "G A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-21", "description": "Their veggie burger seems to be made with mostly onion. And it costs over $9. That's without a side of fries or anything. I will never come back here. Good thing the bun was good because that was all I ate, the veggie burger was that bad.", "author": "Suzanne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-07", "description": "My half pound burger and garlic fries were cooked to perfection. So delicious! Vanilla milkshake was great as well. Good to know that this place uses all organic ingredients. Will definitely come back for sure!", "author": "Dianne Jay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "Yay! A burger spot in the neighborhood! Organic Grass Fed California beef, and homemade veggie burgers (soy free!) everything was spot on here including the customer service. Really really great spot. Amazing food, not pretentious and affordable. THANK YOU for what you're doing! Will be back!", "author": "Lana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "One of the best burgers I've ever had. Also, the fries are 100% perfect. Fast service, friendly waiters and cooks, and amazing food. Give it a shot, you won't regret it.", "author": "Jules A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "HUUUGE burgers. Juicy. Taste is average.\na weee bit on the salty side\nan order of fries is enough to share between 2 people. Fries are good\nThree twins ice cream!\nSalted caramel milkshake!!! with Clover organic milk!!!\nThrilled there is a cute burger joint in the area if I ever need a fix.", "author": "Bianca Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "First-timers at Calibur today... brought my kids and some friends along to share the experience. The atmosphere was nice, customer service was great, and burgers were delicious. My oldest son said he \"demolished the burger\" while my youngest boy described the cookies and cream milkshake as \"happiness\"! We definitely enjoyed our meal and will visit again thanks to the warm and friendly owners, thank you guys! :))", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "I can't say enough good things about this place. Upon our second visit my wife and I were approached by one of the owners to ask who our meal was. We spoke with him briefly about the company and their mission statement. It was a very welcomed conversation and it mean't a lot to us that there was such a level of professionalism. Ok, we're headed out to Cailbur!!!", "author": "Daren M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-13", "description": "We got a cheeseburger with everything on it but the need patty was not the size of the bun. I probably ate like two inches of just bun nothing else in it. On top of that the lady at the cash register was not very friendly or helpful when we were ordering, and rolled her eyes at me multiple times when I was ordering and paying.", "author": "Tailor F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-26", "description": "Really nice people working here, so that's an A-plus!  The burger was just ok, in my opinion - It was missing something that I just can't point my taste buds on.  We both had the quarter pounder with cheddar and bacon (!) and split a milk shake (with my partner in crime) and the bill came out to be a little around $35. We both appreciated that they serve grass fed and organic beef, so I guess I can justify the price based on that - but sadly the taste was just not there for us to want to come back.", "author": "Grace K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Very glad to have another affordable place to have grass-fed, organic burgers in town.  Many cheese choices (liked the bleu), and the fries were plentiful  and tasty.  Liked that there was a flat screen TV for watching the NBA conference finals, and the staff was friendly and helpful.", "author": "G M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-04", "description": "This is the worst burger place, dont go, on Friday night, i order just one burger and one fries, i had to wait for 1 hour, whereas people who order after me get their burger, the service is bad, and the burger itself is burn, organic but not grass fed", "author": "jane s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "$18.38 for 1 good-sized quarter pounder (with three add-on's for $4) and 1 strawberry milkshake is steep, especially for the location that it's in.  I mean, West Portal is a beautiful neighborhood with a combination of chain (Starbucks, Peets, Squat & Gobble, etc.) and local, independent shops (Bookshop West Portal, Two Cats Comics, Ambassador Toys, Shaw's, Goat Hill, Spiazzo, Submarine Center, etc.), but Calibur needs to lower their price.\n\nI placed my order over the phone and the guy (Sean?) was very helpful; I was thinking about the 1/3 pounder, but seeing as I wasn't ridiculously hungry, I went for the 1/4 pounder, no onions and pickles, and adding on mushrooms, egg, and bacon.  I then thought about getting a side of fries, but when the guy over the phone told me the fries was a larger portion, I decided to hold off until next time.  Upon arriving to pick up my order, I found out that if you live or work in or around West Portal, you actually get a small discount off your meal; simply mention it (and perhaps show ID) to a staff prior to paying.  \n\nAlright, so after getting home and taking my burger out of the bag, prior to enjoyment I noticed there were pickles as I clearly instructed, over the phone, \"No pickles\".  Oh, and I do believe the guy mentioned the burger includes housemade ketchup, which clearly I received zero of.  I should've called to let them know, but didn't want to create any hassle since the guy seemed pretty nice.  Regardless of the errors, the burger was still enjoyable nonetheless; I did appreciate the different add-on's from your typical burger joint.  The runny egg makes for a messier burger, but that's what you get.  For a meal close to $20, I feel the patties could've been thicker (that is, if Calibur shapes their own patties) so customers are getting more of what they paid for. Then again, beef does shrink once they begin cooking on the grill so perhaps shape them larger prior to cooking.  And since people are paying a steep price, I'd suggest creating a more \"premium\" or original burger that already includes the various sides, perhaps Calibur's original variation on a mushroom burger or burger loco moco.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "Best burger in San Francisco. One of the only restaurants that understands the lettuce wrap concept, and executes exceptionally. I always eagerly anticipate a good Calibur meal.", "author": "Ali G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-05", "description": "Great service - attentive, friendly and efficient. Burger and fries were good. The place is clean and well lit.", "author": "Carmencita S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-04", "description": "The 1/3 lb. burger was cooked as ordered (medium), and their homemade sauce (ketchup) was very good with a little kick, plus generous bacon and skimpy cheese. \n\nThe tallow fries didn't meet my expectations though the portion could serve 2-4 people. Before McDonald's switched from beef tallow to vegetable oil for their excellent fries in 1990, it was the perfect recipe. Calibur's tallow was overwhelming. If there's a next time, I'll ask for the vegetarian fries. For the price and taste I'd go elsewhere.\n\nNearby Hall of Flame in Parkmerced and Blaze at Stonestown offer more satisfaction for premium burgers and fries. Hall of Flame is the better deal with delicious burgers and mediocre fries. Blaze has the edge on french fries, but be prepared for the burger's high ticket price.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-28", "description": "Great juicy burger.  Simple menu with a perfect focus on making the highest quality organic burger.  I highly recommend Calibur, and so does my 10 year old  :)", "author": "Charles T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "Excellent burgers, tasty tasty fries (mmmmmm), friendly service and the owners are front and center in insuring satisfaction in both service and food. Definitely moving into my heavy rotation list of burger joints. We've been waiting for a true burger joint in West Portal.", "author": "S C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "Good burger with pricey options to add. Fries ok...not noteworthy. Location clean and servers attentive. Overall a bit over average probably a 3.5.....but made it to 4 simply because store notably clean and it was late in day. :-)", "author": "Sharine d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-20", "description": "This place = not worth it. I can think of 7+ burger places way better. Super Duper kills this place & is half the price. The meat was not seasoned at all. The bun was weak. I asked for Medium it was more well done. 2 stars because the food came out really quickly, & the fries were piping hot. Milkshake was good. But overall the burgers are poor. Skip this place.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "QUALITY THAT SHINES! My new favorite burger place! Calibur does all the little things really well. Twice cooked french fries = a crispy exterior & a creamy potato.  House ground, grass fed, beef and carmelized onions on an awesome bun was juicy and hot.  AS I was half way through the burger I was already planning my next visit.  Good quality & attention to details means a very good burger you can feel good about.  Now I need to bring my family to turn them on to Calibur!", "author": "Fernando T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "I wasn't sure what to expect from the short menu and big line but man the burger was better than any place I've been in SF. I'd give it 5 stars for flavor but knocked it down one for the wait. worth it but I wished it was a tad bit faster. to be fair the they did say it would be 25 minutes for my order but man I was hungry and the food totally hit the spot. next time I come I'll make sure it's not busy.", "author": "G P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "An amazing new spot in West Portal.  The owners are super nice and accommodating.  Oh and did I mention the burger is delicious too!  Usually I prefer regular ketchup, but their special dipping sauce is great.  A very simple menu is all you need when the product is great.  There is probably be a secret menu too.  I am looking forward to eating there often.", "author": "Jeffrey P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "Service is great ! They were all quick run help us in the ordering process . All organic and home made . The burgers here great quality meat ! Didn't feel heavy and tired like you would after most burgers . The homemade ketchup tasted a little like cocktail sauce and made my bun a little soggy . I would recommend all sauces and Carmelized onions on the side of you don't like soggy bread .  Great place for the kids and service was quick and easy", "author": "S R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-09", "description": "Burgers up to a half pound cooked to order! You want rare? Got it! Well done? Done! Want an egg on that? Got it! Catsup made in house too ... Got to check it out! Local business and local owners .... Support!", "author": "Richard G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "Id say 3.5. Food is awesome, but I always have a hard time paying $15 for a burger and fries. If the prices weren't so high, I would be a regular! Worth checking out as its the newest spot in West Portal. Warning they close at 6pm. So if you are craving a burger for dinner after work, Bullshead is the way to go!", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-11", "description": "Service was great, but not impressed with the burgers. The meat was on the tough side for a gourmet burger joint. Maybe will give it another try.", "author": "Giovani T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-04", "description": "what i ordered... third pounder cheeseburger and fries\n\nbun tasted and textured like an oversized dinner roll, meat was ok... freshly cooked well done even though i told them otherwise, machine formed and gamy in taste maybe because it was really a grassfeed  beef.\n\nfries... well done and hard\n\nambiance... so-so (souped-up hole in a wall)\nservice... so-so (a bit cocky high schooler who think he's made it into a prominent cashier job)\ncost... $+ (a bit expensive)", "author": "Gors P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "Good veggie burger. Nice service. Casual.", "author": "jessica d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "There is nothing negative to say about this place. The hamburgers and fries are simply delicious and their milkshakes are simply unmatched. Their service is quick and the people that work there are very cool. Love this restaurant!", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "4/5 stars mainly due to its burger with fries and higher price. \n\nPROS:\n-they said everything (like grass fed beef, bread, tomatoes, lettuce, pickles, etc...) is organic except the outside condiments. A burger joint that serves ALL ORGANIC(NO pesticides & GMO) is VERY HARD TO FIND. This can be my go to place since its organic with no GENETIC MODIFICATION of the food that I am eating so I praise them for that. \n-nice staff since it wasnt busy at 5:30 sunday. \n-1/2 lb burger even with no toppings was very juicy!\n-tallow fries was fried twice in beef fat(not healthy) but does have beef flavor. To be honest I RATHER EAT BEEF FAT FRIED FRIES OVER FRIES THAT WAS FRIED IN GMO COTTON SEED/CORN OIL ANY DAY! \nAnd it is true that GMO in general can cause health related issues like unusual reactions from your body after consumption of some GMO foods since your body is not use to the food being genetically created in a lab by altering its genes. Also there is no significant long term studies done about eating GMO foods. But scientists speculate that GMO's might cause DOWNSYNDROME AND INCREASED ASTHMA. Also the government gives permission to the corporations/companies the task of researching and handling GMO's safety if you didnt know. Also if u can please support GMO labeling initiatives of your groceries in FUTURE VOTING BALLETS if you care about what u eat since voting is the least u can do. \n\nCONS:\n-The website does not state clearly that ALL their ingredients are ORGANIC. \n-The burger joint was clean and well lit. But the area where u order is narrow and have to move out the way for food to be brought out. \n-a little pricy. \n-needs more of their calibur sauce in burger. But i was asked if i needed more while eating.   \n\nBeing very generous i give it overall 4/5 stars based on food and price. Would give 4.5 if the toppings were cheaper and the fries a larger portion.", "author": "Organic T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-09", "description": "Ordered a burger with avo, blue cheese, onion, etc... it was horrible the bun was so hard and the taste of their organic ketchup is so gross. I did not eat it. Do yourself a favor and do not order the \"natural ketchup\". I also ordered the kid's grilled cheese, it was edible. Will not be going back.", "author": "Circuit D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Very good burger a little undercooked but they all undercook them a little..The price is a little high even for a \"gourmet\" burger. A good place to go once to try it. The Bulls Head is still the best burger in town or at least West Portal!!", "author": "Keith K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "great shakes burgers fries and chili fries just awesome!", "author": "Jan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "Simple, organic menu done right. Excellent burger cooked the way I asked, the caramelized onion really tops it off.", "author": "Max F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "I stumbled upon this place while strolling around west portal today. I was hungry but not quite sure what I wanted. I got the aroma from the kitchen walking past and The 1/2 lb burger was the right choice! It was delicious, cooked to order, a perfect medium rare, just the way I like it. Thank you guys, I'll be back, and I'll bring my friends :)\nGreat addition to the neighborhood", "author": "Shane D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-21", "description": "Just as I noticed I forgot to eat lunch, I've opened Postmates and looked for a quick burger I can grab. \n\nThis was beyond my expectation it arrived very fast, it was properly wrapped,  seeing the brioche bun immediately made me joyfully smile :)\n\nThe burger itself which I usually order medium ( for some obscure reason I stayed with the default option and ordered medium well) but even when it's medium well the burger itself is tender soft and flavorful. \nThe fries were nice and crispy . I devoured the whole thing pleasingly. \n\nExtra points (and tips) to the delivery dude that came to my front door.", "author": "Mar N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "Fresh, Juicy burgers, darn good fries and shakes made from Three Twins ice cream - When it comes to burgers, it doesn't get any better than than this!", "author": "Richie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "solid burger and fries, i'm never eating fast food ever again. good customer service", "author": "Livia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "It was good! The food tasted natural, like it's supposed to. Really enjoyed their homemade chili.", "author": "Violeta L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "First of all let's talk about the service... The owner was behind the counter work in the line and in the back like a real member of the team. I personally love to see that when everybody works together the experience is just so much better and you can tell that a place is going to give you amazing food when there's a real team atmosphere and everybody's working together. Now let's talk about the life alteringly outstanding crazy good burgers...... The meat was seasoned well cooked to the perfect temperature I requested all of the veggies toppings were really fresh the bun was toasted perfectly my french fries were amazing and not greasy perfectly seasoned!!! And best of all the food came promptly and at the perfect temperature to eat right then... Or after I finish current round of bingo bash on my phone lol !! All around not only would I recommend this restaurant I would say its a must try if you like good food , a great atmosphere and decor and a kick ass staff this is a place for you if you prefer bland cold food with rude service you definitely shouldn't go here!!", "author": "Shannon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "The wife and I ate here Saturday.  Burger and fries were awesome, service was great and the place was super clean.  Definitely going back again!", "author": "steve s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "Most delicious burger I've had in a long time. Fresh ingredients and you feel really good afterwards. Don't know why this place is empty all of the time, it has all of the elements of a great burger chain. Organic ingredients! Mexican coke! Prices a little high but you're paying for quality!", "author": "Mairin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "I've never felt so good after eating a burger.  The burgers here are organic which is awesome-It's so nice to fulfill a burger craving without all the guilt!  Ordering on Eat24 is super easy as you have many choices for toppings and extras.  This was our lucky \"winning meal\" twice now for the Warriors playoffs including the BIG Championship win last night!!!!!  Go Dubs!  Ordering for pick up went without a hitch on both occasions which really says a lot when placing a large order for 10-15 burgers with different meat temps, and various condiments & toppings.  I spoke to Sean over the phone the 1st time I placed our groups large order because I had forgotten to order a chocolate milkshake, plus I admit I was slightly worried as to how well they would execute the order!  After adding the milkshake and speaking to Sean briefly I learned they were new to using Eat24.  He was very genuine, friendly, and assured me that my order was received and would be ready for pick up in 30 min as I requested...and it was!  Not only that, each burger was neatly labeled on their containers in detail with a sharpie making it really easy for us, and my medium rare burger was a perfect med rare.  Score!  Bun to patty ratio was proportional.  Additionally you can just taste the freshness of the ingredients: the crisp of raw onions and lettuce, a juicy tomato, melted cheddar cheese with a bite, and a soft fresh bun with a spread of Dijon mustard and ketchup -can't get any better than that in my book!  Tallow and Veg fries tasted great, and probably excellent when it's served hot/ non take-out.  The only thing our group was not a fan of is the organic ketchup, mainly because it just does not taste like ketchup, doesn't particularly look like ketchup either consistency wise, besides being red (looks more like puréed organic tomatoes).  But they have regular Heinz ketchup too, so it's a non issue.  Highly recommended and will be back for sure!", "author": "Caryn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "Local, organic ingredients. Almost everything! A perfectly cooked, grassfed burger. A thick, frosty milkshake, and TALLOW twice fried fries. Did I mention the delicious house-made ketchup? I love this place. My partner loves it. My preschooler loves it. We love to take family and friends here to treat them. I would eat here every day, nay, MEAL! if it didn't have health repercussions, and drain the bank so fast!", "author": "J R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "Anyone who likes a really good burger has to try this place. Awesome fries with organic meat burgers. Great place -super clean, good atmosphere with friendly staff. I would recommend this place wholeheartedly!!!", "author": "Eileen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "Extremely attentive staff, delicious hamburger! Definitely coming back! :) The place is clean and has a nice background music.", "author": "Clarissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "Burger tasty and made correctly to order. So many times I order a medium burger and it comes out well done. This was perfect. The garlic fries were hot and tasty, but too salty and toward the end the rosemary also became overpowering. Overall good burgers. Not totally sure this will be my go-to joint though.", "author": "Pennan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "Great burger. Great fries. This burger rivals the awesome burger from Super Duper. It's juicy, tasty, and has that great beefy taste I remember as a child.", "author": "Joe B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "Good service, the person who took my order was very personable. Talked with me and was helpful when ordering. Burger was okay, not the best but still a good option if you're at west portal.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-01", "description": "The juiciest most delicious patty I have ever eaten. That it's all organic, fresh, and hand-prepared, makes the price completely worth it. The owners and staff are sweet as can be. The place is spotless - very important to me. I'll be back - often.", "author": "Marsha G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "Solid burger  even the picky eater ate it. Welcome to the neighborhood. Will see u again.", "author": "E. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-26", "description": "Sooooooo good. The burger had really good flavor, steak like or something. The fries are cooked in beef tallow and are awesome. It's definitely not the fastest burger in the city but worth the wait. Now if only I had a beer to go with my burger...", "author": "Heather S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Best burger and shakes in town!  And they're super nice.  My new go-to burger spot.", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "Amazing! Cheeseburger with fried egg and side of fries!! Friendly staff, perfect cooked juicy burger with house made ketchup and an oozing fried egg, all smashed between a toasted bun. I'll be back!", "author": "Elsa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "Hella good ! And they actually cook their meat the way you want it. Rivals  super duper ! Wish they had a special sauce though", "author": "Mel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "Solid burger choice in West Portal. Bf got the quarter pound beef burger. Tastes like real beef, not processed fast food \"meat\". I got the vegetarian burger. Flavorful house made patty. If you're looking for a hockey puck, buy a frozen Boca burger from Safeway. Vegan fries are good. The house made ketchup is not like the Heinz ketchup also offered, it tastes like crushed tomatoes. Prices are not cheap, $20 for 2 burgers and one order of fries; figure you gotta shell out for the organic stuff. 4 stars for the 2 owners who try really, really hard. They work their butts off to create quality meals for their customers. To us, they've succeeded because we've been twice and are regulars now.", "author": "Presto G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "My husband and kids are connoisseurs of good burgers and this one is at the top of the chart.  My family devoured their burgers and declared them better than Super Duper or any of the high-end burger joints we've had in SF.  The service was friendly, the fries delicious and the milkshakes were made from organic three twins ice cream.  The bonus was that we were able to watch the Warriors-Clippers game as we ate our food.  We will definitely be back!", "author": "Suzanne P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "Great tasty, fresh and flavorful burger! Yummy fries and amazing shake! Helpful, friendly and courteous employees. Perfect location and really nice addition to the neighborhood. Enjoy with family or friends or even take out.", "author": "T. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-15", "description": "I love burgers and Calibur makes a great one! They have fresh organic ingredients and quality meat.  You can choose the size of your patty so you won't leave hungry. They make their own ketchup which adds to the distinct flavor of the burger. I also can't get enough of their delectable fries and shakes. I have make the trek to West Portal from the Marina but for this burger place it's well worth it!!", "author": "Jon M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-14", "description": "Love the burgers and shakes. The fries are consistently soggy. They need to produce crispy fries and they will be complete. I'm rooting for them to get the fries right.", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "This rating is based solely on their veggie burger, which was the best I've had in a long time.  Everyone's preferences are different, of course (I see one recent reviewer could have made a better one \"in the comfort of her own home\"), and one person's five star veggie burger isn't necessarily another's, so I'll try and articulate what I liked about it without making comparisons to veggie burgers around town that I _do not like_ at all.  First, the patty itself was flavorful and just spicy enough.  Some veggie burgers are bland, and others rely - IMHO - too heavily on beets, and thus become too sweet.  I liked the texture of the patty as well.  It was firm without being too hard, and the contents were course without being too chunky.  If I had eaten the patty by itself I would have enjoyed it.  I found the bun to be just right: fresh, soft, and flavorful.  The lettuce, tomatoes, onion, and pickles both looked and tasted fresh - and were present in just the right quantities (personally, I'm always a little perplexed and disappointed when I end up with _just one pickle_ on a burger).  I got Swiss cheese and avocado and although I'm sure the whole thing would have been pretty good without these additions, the melted cheese really tied the whole thing together.  To each their own, but for my taste, this veggie burger rocks.", "author": "Marie M."}
