{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "What an experience! 19 courses of heaven!!!\n\nI came here with a group of 7 and were seated at the counter. It was so much fun seeing everything being plated with such patience and attention to detail. \n\nThe creativity of each dish and flavors went above my expectations. And I can see why. One of the only Mexican restaurants with two Michelin stars speaks for itself.\n\nI've never been much of a bean person but their bean dish with creme fraîche, caviar & gold flakes was phenomenal. Let's not forget about the esquite with lobster butter & lobster! Literally would kill to have this everyday of my life. \n\nThe wine pairing complimented each dish, flavor and wine itself.\n\nThis place is a must if you haven't been yet. I can't wait to go back and experience new dishes soon.", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-28", "description": "I had the chance to experience Californios recently and overall it was a great balance of Mexican flavors with California ingredients and touches. There were 19 courses, and due to the events of the day I did not arrive hungry, unfortunately. I still got through all of the courses, but I am sure I would've enjoyed them more if my stomach was a bit more empty. Still, everything was quite enjoyable.\n\nThe most delicious stands out for me were the yuca taco with uni, the soup with saffron and gooseberry, the barbacoa with wagyu beef cheek, and the plantain bread. The uni was very creamy, and the soup was warming and bursting with comforting flavors. I could eat the plantain bread all day.", "author": "James K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "This place is worth splurging on. Chef Val Cantu sure knows what he is doing here and has assembled a great team in creating and awesome eating experience.\n\nSome of the highlights of the meal were the mushroom tacos, corn mousse, and the bean dish. I posted the tasting menu photo to help. The chefs were all very knowledgeable and friendly to chat with and I learned a lot about the process of making specific dishes and really helped me appreciate the time and effort they put into each one! \n\nI definitely recommend sitting at the chef's table. The other seating is a lot darker whereas the chef's table is well lit and you get to see all the action!\n\nAnother recommendation is that if you plan on drinking, just go for the drink pairing which will cost an additional $120pp but is well worth it since I got two drinks and the tab already ran me $60 more dollars.\n\nFun experience and would recommend!!", "author": "Linda X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "AMAZING EXPERIENCE! It is definitely on the pricier side but the overall experience is so worth it. 3 hours and 16 course meal. You will be full haha and you have the option to pair it with drinks. Without the drink pairing, it's about $177/per person. \n\nYou will not be disappointed. Great service and amazing food!", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "It's worth shouting from the roof tops about the creativity of this chef and team. Not to mention, the out-of-this-world flawless service.\n\nCalifornios has perfected the art of timing, presentation, unique flavor combinations that is becoming harder and harder to find in most Michelin-star restaurants. Comparing to other experiences over the years with others that have made the list, you can almost always find the service lacking or under-compensating in some form. By that I mean friendly, humble people who pay attention to detail. \n\nThere was barely a moment that passed once a dish was finished or a glass was drained that the next form of cutlery or wine pairing was out to dazzle. From wiping the wine label clean for a better visual of the wine specifics to allowing us to \"pick our weapon\" for the lamb course, the staff made it feel like I was part of an exceptional experience.\n\nModern looks and music, no pretenses or fuss with stuffy decor. You'll go the first 7-8 courses without silverware, if you can believe it! It's precisely the way you should want every Michelin-star to behave.\n\nMoving onto the culinary excursions and the wine itself; the pairings were unusually delightful. A sour beer served alongside a rich broth? More please. Grilled asparagus to mate with a difficult Grüner Veltliner? Who knew there was such a match in heaven! (P.s. the bright green notes together tasted like Sweet Tarts or Gummie Bears and highly recommend you try this combo at home with dinner guests!). The famous tres frijoles is as stellar as they say and I still can't stop talking about my first sourdough tortilla with pigeon and mole. You stole my heart with a Rioja Tempranillo to go with the most exceptionally rare lamb chop and now all I want to do is go back to Spain.\n\nMy only advice, make sure you go wash your hands after the smoked hen-of-the-woods mushroom taco. It was a bit too smoky for my tastes and it will overpower the next few dishes that you'll eat with your hands.\n\nFull disclosure: I had a non-seafood adjustment and they were wonderfully accommodating. All you have to do is call advance after you book your reservation online if you have any allergies.", "author": "Alita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Several of my friends have recommended Californios and even with my high expectations, I was blown away. The 3 hour meal consisted of about 16 courses, each meticulously created and wonderfully delicious. And that is no small feat. Often at upscale restaurants, I find that there are a couple of courses that just don't taste good even if they look great and a couple of courses where the plating is pretty but insanely impractical for eating. Every single course here was fantastic.\n\nSince there are so many plates, expect the bites at the beginning to be very small. It does take a while before you start to feel full so I recommend making an early dinner reservation like we did. \n\nMy favorite of the night was one of the first - a mushroom taco on a handmade blue corn tortilla. The earthiness from the mushroom medley was beautiful and quite \"meaty.\" This was one of three taco presentations during the meal. Halfway through, we were served a delicate hard-shelled uni taco. Yum! And toward the end, we had a make-you-own-squab-taco course.\n\nCalifornios celebrates Mexican heritage and interprets it in its own way. One of the desserts was essentially a churro with Mexican hot chocolate but this is no ordinary churro, it is a decadent foie gras churro. Heaven!", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "If you have ever wondered if gourmet Mexican food was possible, Californios will make you a believer. This amazing restaurant earned both of its Michelin stars and will truly impress you and your guests with one of the best experiences I have ever had in a restaurant. The restaurant is on 22nd near Mission with little exterior signage near several dive bars and colorful characters. BART is close and a fun walk.\n\nYou need to reserve and pay online well in advance for dinner here. I was able to snag an early reservation and was somewhat surprised by the low cost of the meal, although the beverage pairing was nearly as much as the food. At 5:30, I opened the heavy door and entered an upscale speakeasy with an open kitchen. After a greet and check in, I was escorted to the chef's counter to begin my journey.\n\nIt is hard to describe the next two hours since the menu changes all the time. The dinner had 19 servings of various small plates, amuses, and cleansers designed to really push the envelope of Mexican inspired cuisine with a gourmet California theme. The beverage pairings included wine, beer, and several surprises which worked very well with the items. Pairing wine with spicy food is a real art.\n\nThe food was just spectacular. The scallop chicharron, torched mandarin, mushroom mole taco, and winter vegetable aquachile were very unique and delicious. The fried fish, wagyu carne asada, and smoked squab were true gourmet quality. The macadamia nut sorbet with fresh pear and dulce de leche was both real and spectacular!\n\nIt is no understatement to say that the best parts of the meal were the tamale, beans, and churro. Of course the tamale used specially grown corn masa ground for hours into a near fudge consistency stuffed with perfect beans and cheese. The bean dish is beyond words with cooked whole beans topped with puréed and whipped beans and caviar bringing the concept to another level. The churro is made with foie gras in the batter and in the icing and served with a small Mexican chocolate and coffee liqueur cocktail making this signature dish crazy delicious.\n\nOf course, the staff and chefs here are near perfection. Service was warm and personal with great attention to detail. Sitting at the chef's counter allowed me to see the care and skill of the young, fun, and inked chefs having fun watching me savor their creations. Everything was paid online in advance, so there was no bill or any fuss after the meal.\n\nCalifornios is a fancy gourmet Mexican restaurant that should be on everyone's bucket list. This is an excellent date night place or perfect place to take the parents or guests. It is intimate and fun with a unique and eclectic menu that really forces you to reevaluate your definition of Mexican food. These guys are really cooking up something special in the Mission.", "author": "Kristian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "I've only been to a few Michelin Star restaurants, but Californios has been my favorite so far. The food and atmosphere are exceptional and the staff are friendly and attentive. I came here with a good friend and sat at the counter so we could watch the kitchen -- this was an amazing experience and I would love to share it with everyone I know. The kitchen is so thoughtfully managed and quiet, almost zen-like. \n\nFor the price point, this restaurant is probably underrated. I plan to be back regularly and will try the vegetarian menu next time for fun.", "author": "Erika N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Super accessible \"SF chef tasting menu\" type restaurant. Ingredients common to California and Mexican staple dishes are combined and presented in a fresh but familiar way. Sitting at the bar the atmosphere was friendly and decidedly less stuffy than similar tasting menu restaurants. Watching each cook and sous chef assemble the dishes, and then having each explain the ingredients and flavors first hand was exciting and a lot of fun.", "author": "Nick J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "Mind completely blown by a wonderful dining experience that I can only describe as \"Mexican kaiseki\".  One of the personal goals I set for myself this year was to eat at all of the 33 Michelin-starred restaurants within the San Francisco city limits and Californios was number 30 out of 33. At this point in my culinary journey, I've become really, really picky but I'm glad to report that this restaurant is definitely in my top 3 so far (the other two are Quince and Atelier Crenn).  \n\nWhat I really love about this menu is that it was incredibly balanced and there was a great respect for ingredients and rhythm to the meal (similar to Japanese kaiseki) while also providing great desserts (to me, the weakest part of Japanese kaiseki meals are the desserts at the end).  Not everything was perfect but the combination of dishes and flavors just work. \n\n(1).  Canapés included scallop ceviche, crab tostada, black barley chicharron with smoked\ngoat cheese - served with a refreshing cucumber agua fresca (5/5) - damn good start to the meal.\n(2). Taco ensemble including uni (Santa Barbara), A5 wagyu, smoked mushrooms and squab (5/5) - amazingly, the mushrooms easily beat the others. \n(3).  Palate cleanser included guava sorbet with pineapple juice and bee pollen (5/5). \n(4).  The next three courses included kiwi, kampachi ceviche and asparagus with trout roe (3/5) - good dishes but not stand-outs relative to similar dishes at other restaurants in the city. \n(5.). Smoked chicken broth (5/5) - I really appreciate that they had a consommé in the middle of the meal to prepare you for the coming richer courses. This broth was just perfect. \n(6).  Next came their signature dish - tres frijoles with caviar (3.5/5) - the beans were great with the caviar but this is not the most memorable thing on the menu (other restaurants have signature dishes that are memorable like the ridged pasta with foie, black truffle and Marsala at Acquerello or the Kir Breton at Atelier Crenn).  \n(7).  White sturgeon grilled robata style with grilled cabbage (5/5) - the glaze on the sturgeon was unexpectedly perfect.\n(8).  Lamb with morels (3/5) - acceptable lamb dish but most of the Michelin-starred restaurants in the city serve amazing lamb dishes (the best one I've had was at Lazy Bear) and this was middle of the pack. \n(9).  I ordered the marshmallow tea with chamomile before the sweet courses (4/5) - this was nice and complemented the desserts well. \n(10).  The desserts included churro, strawberries and pecans (5/5) - these were inventive and great and not too heavy.  I would have loved to have gotten some mignardises but I was perfectly content with these three things. \n(11).  The meal started with proseco (great meals start with some bubbly) and ended with some agave (unique and nice touch).  \n\nThe outstanding dishes for me were the smoked mushroom taco, the smoked chicken broth and the glaze on the sturgeon.  \n\nService was impeccable and I am very grateful to have been seated at the bar.  It's like dinner and a show - it was a real treat to see the chefs meticulously prepare each course and chef Will was also very engaging (a treat for solo diners).  The place is immaculate and I really love the upscale but not stuffy vibe of this place.  It's also a tremendous value compared to some of the other restaurants at this caliber (Atelier Crenn, Quince, Benu, Coi, Saison). Highly recommended and I can't wait to come back here.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "What a fantastic meal.   Loved it.   There are no other Mexican restaurants with two michelin stars in the county, so it's the best you will get in the USA.   This past xmas, I ate at Quintonil and Pujol in Mexico City, and this is on par with those places.   I would still rank Quintonil as the gold standard, but Californios is better than Pujol imho.\n\nI like the space.   Kind of small, but intimate without feeling too enclosed or claustrophobic.   We sat at the chef's counter which is highly recommended if you are flying solo or a party of two.   I love watching all of the chefs prepare my food.   It's like tv!\n\nThe menu was roughly 18 courses, so I will not describe every single dish, so I will hit on some highlights, but all of it was great.\n\nThe openers they serve you are a great way to start a meal.   Scallop tostada, some crab and blood orange thing, agua fresca, and some weird chicharron made from barley and some other vegetative material.  All were fantastic.\n\nNext were the tacos.   Once was uni, one was mushroom and one was squab.   It's hard to pick a favorite, but the squab was served with this AMAZING mole dipping sauce that I am still dreaming about.\n\nThere was also this kampachi ceviche that was cured in smoked nopales.   There were pieces of the nopales folded into the kampachi, which was thinly sliced and wrapped into a butterfly shape.   The best part honestly was the juice/sauce which had hints of the nopales, citrus and celery.\n\nAsparagus in poblano sauce with roe.   Enough said.\n\nTres frijoles - This seems to be a dish that never leaves the menu.   Three layers of bean preparations and topped with caviar.   Really great (although cannot top the beans they served at Quintonil, of course)\n\nCarne Asada - wow!   Perfectly cooked piece of wagyu, topped with truffle \"mole\" and served with a confit aged potato all with shaved black truffle on top.   Really rich and luxurious.\n\nChurro with plantain - Great!\n\nPear dessert - one of the best desserts I have ever had.   Pear ice cream with dulce de leche served on top of macadamia nut butter.   Divine!\n\n\nService, of course, was on point (as you would expect) and the overall experience was impeccable.   The sommelier didn't exactly knock into the stratosphere, but the pairing was very nice and recommended (sorry to keep bringing up Quintonil, but their somm is a GOD, and i can't help but compare every pairing to that these days). \n Recommended if haute Mexican is your jam and you can't make it to Mexico City!", "author": "Christian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Best meal period hands down. 5 stars really isn't enough. I suppose if I was a more circumspect reviewer I would be able to give this place a truly stellar rating in my repertoire instead of giving it the same score as that tacqueria I was in that almost burned down.\n\nThe waiters are extremely attentive, pacing is spot on. I really enjoyed the wine pairings and especially the sour beer pairing with the squab broth. Which, by the way, was so amazing! It was broth + a few pomegranate seeds + cilantro garnish. V nice to sip on.\n\nAnyway, this place is expensive but rightfully so. Recommend coming here for a special occasion and expecting to spend close to 3 hours getting your mind blown by the food.\n\nI also recommend sitting at the chefs counter since you get to watch them prepare the dishes.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-16", "description": "Sit at the counter where all the action is. Some great dishes, some mediocre dishes. Credit their creativity with the fusion of California cuisines. Personable and friendly staff. Wine pairing pours are unsubstantial, only got a few sips of each wine. I'm happy to spend money on a great meal but in my opinion this place (as with many places in the gentrified Mission District) is catered more towards the tech crowd with money to blow.", "author": "D. T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "Exceptional experience: service, food, and wine perfection.\n\nI have a friend who is a regular here and I can see why. Their take on food is absolutely amazing. I love the mixture of California produce with Mexican cooking styles, flavors, and techniques. There were many stand out dishes that captured so many different notes in flavors and textures. \n\nThe menu is ever changing, but I believe the taco will be a signature that stays on the menu consistently. It's absolutely delicious. \n\nThe atmosphere here is also less stuffy than the Michelin rated spots. Chef Val Cantu definitely leaves a dinner party vibe. It's black, sleek, and sexy but noise levels aren't so low and energy is higher. Music is high key on point. \n\nWines. Get the tasting -- you learn so much and it's quite experimental as Mexican wines starting to take a place in the wine scene. I enjoyed learning as I tasted. They were paired so beautifully. I definitely have to give it up to the somm team there. \n\nI would definitely go back again. Selfish part of me wished that I could have kept this place to myself. But I'm extremely proud of Californios because they're breaking into the Michelin scene that tends to be mostly French and Japanese rated cuisines. \n\nI'll be back!", "author": "Tina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "A long overdue review of almost a year! Erick T. and I came here in July 2017 to celebrate our 3 year anniversary and were pleasantly surprised with our delectable meal. The tasting menu consisted of 19 courses and additional palette cleansers, lasting for a total of 3 hrs of your night.\n\nMy highlights: pretty much everything. I was really impressed with the innovation and creativity Chef Cantu puts into his dishes. He takes the flavors and ideas of the traditional Mexican cuisine and interprets it in his own way to maximize the purity of flavor and choice of ingredients. For example, a handmade blue corn tortilla taco, ceviche with coconut purée, even crickets!! You know my mouth was still watering for more at the end of the meal.\n\nHowever, many people question the price point for traditional Mexican food, including me and Erick T. We initially left the restaurant telling ourselves this, but I've come to realize Californios is probably the only Michelin I crave to come back to. I'm a picky reviewer and more often than not, I find myself disliking a few plates of tasting menus. My satisfaction with the total number of dishes is part of my scorecard, and I'm happy to say there wasn't a single dish I didn't like at Californios unlike other Michelins. If you love Mexican cuisine like me, it's definitely worth a try.\n\nOriginally a chef at Sons & Daughters, Chef Cantu scored a little spot in my heart. I'll be back again!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Made the reservation easily on Tock (after signing up for an account) about 4 days ahead for a Thursday night.  They only had the 5:30 slot but it worked out for us  Prepaid the $157 / person tasting menu plus the 20% service gratuity and taxes.  The wine pairing was $95 extra per person but neither one of us wanted to drink that much so we split one.  There was a slight split wine pairing fee but it was much better as we both got to taste the carefully crafted pairings which truly made the whole experience better without overdoing it. \n\nWe ended up having 14 courses but there was no way we could keep track of the number as the pace was perfect that we never seemed to waiting too long but also had enough time to savor each dish.\n\nThe food was Mexican inspired but the dishes were elegant that I often forgot that while I was enjoying the food. \n\nMy highlights:\n- Lobster taco, delicately sweet and topped with chili butter sauce.\n- Coconut purée with texture that was unbelievably smooth, matched perfectly with a Smaragd Riesling (Austria).  \n- Well seasoned crispy fried black cod, moist inside with a great verde sauce.\n- A5 wagyu beef from Japan combined with even more flavorful grilled mushrooms.  \n- Smoky squab with a duck like flavor but not as chewy texture.  Pure delight.  This was one of my favorites.\n\nThe 3 wait staff that circulated and introduced us to each dish were all so knowledgeable about the wines and the pairings were the best I've had in recent memory.   We were 20-30 minutes late due to SF traffic but they were so accommodating that they diffused our stress from rushing.  Loved our 2.5 hour meal and cant wait to go back again next time I'm in town as they change the menu every 3 months.", "author": "Michael Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "My favorite tasting menu in SF right now.  \n\nI have been patiently waiting to return during a different season - I don't think it had anything to do with spring versus summer, Cantu has perfected every inch of his menu.  \n\nTruly touched by the note on the table, no celebration, but a handwritten welcoming the return and gratitude for the support.  Started the evening on a high note - never see that kind of recognition until 3-4 visits and a note to commemorate?  Never!\n\nThe intimacy is further evident with the service throughout the evening, chef stopped by twice and the dessert was delivered by the brains behind it.\n\nSo impressed with the food - innovative and sourcing authentic ingredients from local purveyors.  There were four different types of masa served, all with a regional story and individualized nuances.  The vanilla ice cream was just created by the pastry chef days ago, super smooth and intense, best ever to pass these lips.\n\nReservations are through the Tock ticketing system, it was just under $600 for two including wine pairings.  Coffee is billed separate at the end of the meal.  Priced fairly for this level of dining and I surmise the cost will go up when Michelin gives them their well deserved second star.", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Wow!!! \n\nWhat a meal and what a fantastic experience!\n\nI came here a couple weeks ago and am still wistful of this meal.\n\nMy favorite bites / dishes were:\n\n1)  Smoked Mushroom Taco: I used to despise mushrooms and until a couple years ago would pick them out of food. Up until this meal, I was relatively indifferent to these fungi. This dish has helped to start to change my view and taste for mushrooms. Californios' mushrooms were smokey and meaty like beef brisket but packed with umami goodness. I'd stack this taco up against an assortment of the notable meat-filled tacos in the Mission. \n\n2) Mole sauce: Oh my goodness! The mole had so much depth and flavor. Despite it being accompanied by a wonderful bit of squab and my favorite tortilla of the night (sourdough tortilla), the mole stole the show. \n\n I enjoyed every dish and thought the sequencing of the dishes were on point. I also appreciated that amidst the business of the night, Chef Val took the time to serve and speak to a course. All in all, this was one of my favorite meals of the year thus far.", "author": "Brendan Edwin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "They knocked our socks off! Top five eating experiences of my life.\n\nNo signage on the building, creates a sense of \"special\" or mystery. Only seats about 30. Noir decor that's visually stunning, it's classy, seductive and again, a bit mysterious.\n\nService was spot-on, and made some beautiful funky weird wine recommendations that I absolutely loved.\n\n13-courses, I think? We were full at the end but it was doable. And although they don't provide you w/the detailed menu, they do provide the list of course names. Some to mention (all done vegetarian) include: chicharron-beets, calabazita-squash blossom, ceviche-coconut, tamale-black bean, and the fresa-strawberry.\n\nThis is expensive. We went for my birthday. Not sure about the grand total but I think it was around $700. Lasted for over 3+hours.\n\nLove.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "Great experience over all.  Service was attentive but not overwhelming, food pace in between coarse was perfect. All the courses are fabulously prepared. Although I think the uni could have been done better.  I think the pine nuts and Alvarado mash is over powering the uni itself but still great.  The sauce of the way beef is too salty but the meat itself is one of the greatest I ever had.  \nThe foe gra mousse are definitely Special.  Will definitely come back again.", "author": "Greddyv7 3."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Every moment of this meal was an unexpected delight! We opted for the chef's counter- it was fun to watch them work and being a crew of vegetarian, pescatarian, and cilantro-averse, we always knew when they were making our dishes. \n\nThe food was exceptional and perfectly portioned - there were about 12 courses and I left full but not in pain. It would be hard to pick a favourite dish - they were all remarkable. (Though if they opened a taco truck, I would be there every day.)\n\nOur waiter, Robert, was possibly the best waiter I have ever had anywhere. Charming, friendly, sincere and perfectly attentive. He really made the experience a lot of fun. \n\nWe prepaid everything so it was nice to be to just walk out after and not wait for the cheque. \n\nIt is a small space, so definitely book in advance - you won't be disappointed.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-17", "description": "Lovely atmosphere, feels fun and classy with the art on the walls, leather benches, furry pillows, and drake playing softly in the background. \n\nWe made a reservation a month in advance, which you definitely need to be seated. No sign out front which makes it feel even more fun. \n\nWe were served 15 courses- 30% which I would describe as small bites. 2 meat dishes, one I LOVED and was my favorite (the carne Asada), a few standard dishes, and two desserts (both of which were ice cream). \n\nFirst, all the food was lovely. It was definitely good with some big standouts. The staff cycle through, and we had probably 5 people come speak to us about the food, including one chef. Some were definitely better than others, and I think this is one of the reasons the meal isn't 5 stars to me. Something was missing... the person they sent over to help us pick a bottle of wine was... less than helpful... my favorite thing about prefix menus is hearing everything exciting about the food and the wine, and I think Californios can step up their game here. \n\nMaybe it's the fact that I'm paying for $200 Mexican food? I keep thinking about why I wasn't in love with this meal, and I can't really put my finger on it. \n\nYes the flavors were lovely. Environment is awesome. Will I go back though? Probably not. I would recommend to a friend with the caveat that it's good, but there are other high society Michelin star restaurants that I think do it better.", "author": "Steph D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "One of my favorite fine dining restaurants in SF at a reasonable price as compared to other peer restaurants. \n\nI'm normally not a huge fan of Mexican food, but was blown away by the 16-course tasting menu. Service was also impeccable. \n\nPortions are on the smaller end, but the ingredients are heavy so I was satisfied by the end of the meal. \n\nHighly recommend!", "author": "Christine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Mind blowing experience for sure! Everything was perfect. The beef cheek and mushroom were amazing and my favorite. They really put in time and effort to find the balance between all ingredients and beverage. I definitely will come back a thousand more times.", "author": "Zoey X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "Would be 5* if it was cheaper :) Great experience sitting on the bar looking at the chef cook, but if Im celebrating my birthday I should have chosen a nice table to match the expensive prices. Very delicately created dishes but lacks a grand ambience. For eg. Acquerello had both.", "author": "Ashutosh T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "OMG, amazing experience!! Must sit at the counter and watch the chefs prepare all of the mouth watering plates.", "author": "Paula Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Fantastic experience and everything that we ate was exceptional. Really bright and lovely flavors along with a very prominent Mexican slant to it. \n\nService could have been better especially for 2 Michelin stars but nevertheless an amazing experience. We did the pop up by chef Julio and I really have become a fan of this restaurant.", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "I enjoyed a great 16 course meal at Californios for my birthday. The restaurant exterior is nothing to look at, but I thought the interior was nicely decorated. The night we dined there, they were pumping in late 90's remixes. I felt like I just walked into my playlist, so that was pretty cool. \n\nThe menu is prefix, so the only thing to choose is the wine. The meal started with a lot of small bites/finger foods, so many that I thought I'd never see a utensil. Each one of the dishes were elegantly presented and featured a Mexican or South American ingredient. I also liked that they treated the veggies with as much care as the proteins, I thought the veggies were the bigger highlight in some dishes. \n\nThe service was relaxed, but definitely professional. The people bringing the food to the table were generally good about providing information about the source of the ingredients and some even provided tidbits about the people who produce the ingredients which was interesting. Only one of our waiters was a bit lacking in that department, only stating either the type of wine or the name of the winery, which we could have read ourself on the bottle. \n\nThe only awkward part was that a 20% service charge is automatically included (we were a party of 2). Only reason this was awkward was that he receipt still has a tip line, so it feels awkward putting $0 tip if you feel that 20% is already appropriate.", "author": "Angelito R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "To call this simply a \"Mexican\" restaurant would minimize (not that there is anything wrong about the Mexican label) its significance. The experience here was better than the French Laundry in service, food and value. I stopped counting courses because just as you thought it was over - there was more! I had so many favorites it is hard to choose - the wagyu beef with the fermented Peruvian purple potato and Perigord truffle dish was superb - savory, slightly sour, earthy umami - just ridiculous; the wine pairing of old Riesling with the smoked wild mushroom taco - heavenly goodness; the mole with the meat taco was also outstanding. There was certainly nothing remotely bad - everything was at least good - at best unforgettable. What are the experience even more pleasant was the overall friendly vibe from every single staff person - presided over by the amazing chef Cantu. This is an evening to remember, savor and reminisce about for years to come. My dining partner and I had a love affair with the entire kitchen crew.", "author": "Ludy V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-07", "description": "I started a dinner club this year, and Californios was VERY high on my list of places to try and ended up first on the docket for 2018. I went and there was a collaboration dinner on the menu with a chef from Oaxaca (apparently costed more than what I paid for so I thought it would blow my mind). Frankly, for $230 and 2 Michelin stars, it was very disappointing. I did a 6:30pm seating, and didn't end up leaving until 11:20pm, which was way too dragged out to the point where I was falling asleep at the table. \n\nThe service for our table was pretty bad, as I watched the table next to us that arrived 1.5 hours later finish before us. Some of the food was extremely salty (yet beautifully presented), but there's nothing worse than going to a restaurant of this caliber and having no interest in finishing most of the dishes, especially when its 2-3 bites/sips.\n\nI have been to several other Michelin star restaurants before (Lazy Bear, Michael Mina etc.) and did not think this lived up to it's rating. I personally think there are other restaurants in SF without Michelin stars that are better than this and not a $230 price tag.", "author": "L.k. K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Overall: This might be the most underrated tasting menu in SF. The price, staff and overall experience makes Californios a must-do.\n\nFood: 5 stars. I love the intersecting of flavors. The carne asada among many other dishes were delicious! I enjoyed every dish and left full but fortunately not uncomfortably.\n\nService: 5 stars. The staff are incredibly professional and friendly - everything you would expect from one of SfF's top restaurants.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Really lovely space. I loved the aesthetic and friendly reception. We had a reservation for a table at 9 (two people). We arrived at 9 and were asked to sit in their waiting area. Three minutes later we were told we could have a seat at the chef's counter...and that our table would be ready soon. So we went to the chef's counter/bar (PS the space is small- these areas are steps from one another aka, we should've just stayed put in their waiting area). Already situated at the chef's counter/bar, when our table was ready- like 5 minutes later, we asked if we could just stay there. The hostess said yes. How do I know the timing so well? Time stamp on food photos, duh. First photo was taken at 9:09. \n\nAs the courses were arriving we were asked if we wanted to move to a table. We said no. Midway through our meal we were asked to move our stools over to the middle of the bar \"for our comfort.\" Weird. Shortly after, we were asked if we wanted to move to a table again. I found all of that really off putting. Do you want us to move to a table? Were we being loud/obnoxious/distracting/too close to the food (did my hair fall into a sauce??)/having too good a time? :( \n\nAll of that said, the experience was most definitely EXCELENTE. Food was *awesome* everything was incredible and Chef Cantu (Food & Wine's 2017 Best New Chef aka Badass) was gracious in indulging our absurd questions. He also very kindly took photos with other patrons. Really cool vibe overall- front of the house was super friendly and attentive. My only advice, don't eat at the chef's counter/bar. :)", "author": "Maria F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Amazing food, drinks, and service.\n\nI'm not a lover of mexican food but my bf is so I decided to take him here for his birthday. The restaurant is small and I requested seats at the chef counter since other people recommended it in their reviews. They have a tasting menu with 16 courses and we opted for the drink pairing.\n\nThe food was unbelievable. I never thought I'd like beans and mole like I do now. Dish after dish was incredible (see photos). Chef Val was at the end of the counter and we chatted a bit with him and the the rest of the staff. Everyone was so friendly and really enhanced the experience. \n\nAmazing. I see their second michellin star in the horizon. \n\nCan't wait to come back!", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "Now that 2017 is underway, I can confidently say this was, without a doubt, my favorite meal of 2016. Sorry, Lazy Bear, Wako, ju-ni, and Liholiho Yacht Club. Compared to other famous Michelin-starred restaurants in San Francisco, Californios sort of flies under the radar so I hadn't heard much about them and did not know what to expect.\n\nIf you manage to snag a reservation when they open up a month in advance, that's half the battle. Our Uber driver dropped us off right in front, and had I not seen pictures of the exterior on Yelp, I would have never guessed the unassuming, dark building with covered windows was the restaurant.\n\nThe staff took our coats, warmly wished us a happy anniversary, and sat us at the chef's counter as my girlfriend requested when she made the reservation. From our seats, we watched in awe as each chef prepared the different courses in perfect unison. We watch enough Top Chef to understand the challenges of working in a small kitchen area and needing to prep multiple dishes at a time with pinpoint precision. You truly get the sense that the chefs are giving each dish their all. When a dish arrives in front of you, you get an explanation of its inspiration, where they source the ingredients, and the techniques with which it was prepared.\n\nWhat sets Californios apart from the pack for me is how they are doing their take on Mexican dishes - infusing traditionally Mexican tastes with fine dining. You just can't experience this cuisine anywhere else in the city. Each dish was a revelation, and I cannot remember another meal I have had where every dish was memorable and left me wanting more.", "author": "Olivia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "This is the best restaurant I've been to. Ever. \n\nThe pear dulce de leche thing is the best thing I've tasted in my life since maybe when I tried ice cream for the first time as a child. The flavor is out of this world.", "author": "Roneal J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "This restaurant is outstanding. \n\nI've been to a number of Michelin restaurants before (Manresa, Quince, Arzak, Akelarre, etc) and I can't help but feel like there was something truly unique about Californios. It's easily in my top 3 restaurants I've been to. \n\nI'll start with the ambience. The interior was small but roomy. There are no more than 5-8 tables inside, as well as a bar area where you can sit in front of the chefs.  The walls have colorful Mexican art adorning them, and in the background upbeat hip hop, rap, and pop are playing. \n\nThe result is a really unique feel - it's casual, fun, and lively, yet still has the professional polish of a typical Michelin restaurant. \n\nThe food was insanely good. They don't give you the menu until the very end, and as a result the entire dinner is a surprise, which I really liked. \n\nI can honestly say I loved every single item on the menu. Standouts were a wagyu steak cooked in a truffle mole, a crab and herb tostada, a squab soup, a foie gras churro, a make your own squab taco dish, and an after dessert \"cherry coke\" aperitif. \n\nBut, to be honest, everything was amazing. It is the most consistently good Michelin restaurant I've ever been to - at others I've often had one or two dishes which were \"meh\". \n\nThe food is also very unique. It can best be described as upscale Mexican, but in a way I've never really had before. This made the meal exceedingly interesting and delightful. \n\nFinally, the service was great. The staff were attentive, explained things well, and were very friendly. \n\nThe fact that you get all this at a price less than most Michelin restaurants in the city makes this a no brainer. I can't recommend this restaurant enough.", "author": "Davis T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "Wow. Just wow. The entire experience was lovely. A long, deliciously planned and well-executed fine dining experience was our pleasure on Friday evening. Warm, greetings and introduction by the hosts and hostesses, absolutely astounding courses, each beautifully and artfully composed. We dined in amazement, and left feeling satisfied, inspired, and cared for. This is a place I look forward to returning to. They really have the hospitality in mind when hosting people for dinner. Though it is not an inexpensive meal, it is worth it.", "author": "Jason P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "This place received 2 Michelin stars for a reason! Decadent food with even better personable service. I love fine dining sans pretentious feels. This place is exactly that! They even get your name and give you a card at the end. So personalized and thoughtful.", "author": "Ashlyn R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Words can't describe this restaurant nor would it serve any justice. Just think Mexican Omakase that is perfected in every aspect! Some of the wildest pairings explain how they earned their 2nd Michelin star. \n\nThe staff and chefs are knowledgeable, friendly and extremely down to earth. Just book your reservation if you can and make it happen! You will not be disappointed.", "author": "Dana T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "Ok, this restaurant is a one of a kind, truly extraordinary dining experience. It's pricy and darn well worth it. If you have to ask how much, forget about it, you can't go there. Seriously, expect to melt plastic at this establishment, all paid in advance. \nTruly great: can't decide, all 18 bites were delicious\nA bit disappointing: not one drop of extraordinary tequila \nThat said, the wine pairings were spot on and not any we were familiar with (meaning not California wines).\nWe were there to celebrate our daughter's birthday and she said she loved it, so that was good enough for her mother and I!", "author": "Fredric R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "Came here for my birthday. This place is by far and away one of my favorite restaurants I have been to. The presentation, food, ingredients, everything was spot on.\n\nThey were also accommodating to my fiance and I when we wanted to be re-seated halfway through dinner due to the men next to us loudly discussing the best way to create tax havens so that they could avoid paying any US taxes at all. Super classy gents...\n\nAnywho, hand down my favorite Michelin star experience to-date.", "author": "Annette D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "15 courses, 4 hours later. This 2 michelin star 'mexican' restaurant exceeded all expectations. Casually sophisticated through and through. \nBeautiful wine selection. A memorable experience.", "author": "Debi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "BLACK！BLACK！BLACK！\nBlack exterior，black interior，black plates，cool feeling all way through, beautiful food, brilliant service, excellent experience!", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "I went to this place before it got it's 2nd Michelin star.  What a treat.  It's a small restaurant with few tables.  Great ambiance and the staff was outstanding.  We did the tasting menu and the pairings were perfect.\n\nEverything from the presentation of each course to the amazing tastes were incredible.  You should go before it gets the 3rd star and becomes more pricey.  Highly recommend it.", "author": "Francisco I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "One of the top 5 meals I've had in my life...omgg.\nMy husband and I visited from Chicago. I booked us a spot for a late birthday present to myself (lol) for a weekday evening, and received a hand-written birthday card upon being seated, which was a lovely touch and just one of the may ways they demonstrated their fantastic service and attention to detail, which would become very apparent throughout the course of our meal.\n \nFood: 20 courses. Phenomenal!!! Even their so-called palate cleanser was amazing. The food, from standards including asparagus or carne asada, to more inventive dishes, were mind-blowing. Loved their creative combination of flavors and textures, which always came back to the main theme. Ingredients were fresh and thoughtfully chosen. The desserts were also fantastic. And of course, presentation was great as well. We received copies of the menu in nice envelopes with our names on them -- something I wish more places would do!\n\nAmbiance: Cozy and hip without being stuffy as some fancier establishments can tend to be. Bonus: there was enough light to see without affecting the ambiance -- what?!?!\n\nService: Service from start to finish was phenomenal. Everybody working here was genuinely friendly, without the air of pretentiousness that, again, is prevalent in some of the higher end establishments. Most importantly, the entire team was extremely attentive without hovering or being intrusive. If we needed a refill, or had any questions or requests, staff would magically appear without us even needing to ask. Their timing is so impeccable, it was almost like wizardry.  \n\nPrice to quality ratio: I'm a cheapskate who loves food, so I'm especially picky regarding quality of the food as the prices go up. I would say this was one of the few meals that was 900000% worth the price. \nAnd did I mention their attention to detail was meticulous? \nCannot wait to come back next time we visit the area!\nWould give Californios 6 stars if I could.", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "VIBE: Small & Trendy\nWHY: Everything.\n\nEverything. And I mean everything, was perfectly executed and delicious here. They totally deserve their 2nd star! Kudos!\n\nDo yourself a favor and sit at the chef's table for an amazing, personal experience. Because the tasting menu is so beautifully done, it's not worth ruining the surprises by telling you more. Birthday? Anniversary? Big promotion? Celebrate it here, you won't regret it!", "author": "Eve D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Exquisite dining experience with friendly and fun staff who take the already amazing meal up another level with the witty and fun banter. \n\nTruly unforgettable and so damn delicious. Totally 2 Michelin star worthy!", "author": "Jay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Took le boyfriend to Californios for his birthday dinner, and he was quite the happy panda.\n\nOn the reservation, I indicated that we preferred to sit at the chef's counter, and I was so glad that I did. I always like to see what is going on in the kitchen. All the people in the kitchen were extremely friendly and would react with us. At one point, we were talking about the big game that was going on that night (we kept them updated on the score). \n\nThe food, course after course, was on point. Everything was beautifully plated and tasted as good as it looked. \n\nWill definitely come back.", "author": "Carolyn Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "I'll keep it short and simple. \n\nLove the decor it's all black room with perfect lighting and let's you focus on the food and your company. \n\nFood was amazing, service was impeccable and fun. Robert who attended our table was so accommodating and created a divine experience.\nIt's really hard to find fine dinning restaurants that can make this happen.\n\nThe tables have the right amount of space apart from each other so you can really enjoy your conversation! \n\nNow Let's dive into the food: first bites were so creative and the flavor profiles were on point. In the rest of the courses the chef really showcases the quality of ingredients with a harmonious approach. \nI would tell you more but you should try it on your own .... Beans and caviar? yes please !\n\nI will definitely come back here and enjoy another lovely meal soon!", "author": "Alejandro S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Amazing Experience!  Highly Recommend!\n\nThis is \"a of the top places to go for a 'Michelin Star' experience in San Francisco\".  Will not disappoint. \n\nYou'll step into a elegant fine dining atmosphere that provides exceptional and impeccable service.  Seasonal food and wine pairings that will bring you back for each season. \n\nFor the wives out there that don't know where to go for a unique experience for Fathers Day \"alone time\" ;-D  I highly recommend Californios.   It was truly romantic.  It's an intimate dining experience with just the right amount of tables.  No yelling to communicate!  Enjoyable & Memorable!!\n\nTrust me on this one!  Summer is a long season have a bbq another time.  The boys (golfing buddies) and the kiddos will recover.", "author": "S C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "If you are ever given the option between a quiet table or a seat at Val Cantu's (chef/owner) counter at Californios, do not pass up the opportunity to watch the artistry in motion as the chefs prepare plate after exquisite plate of modern, Mexican-Californian cuisine.\n\nThe 18-course menu showcases the bountiful, seasonal and regional flavors  yet Japanese wagyu and fluke from the Tsukiji Market welcomingly punctuate the menu. The wine pairing is an elegant mix from our local Napa wine country with interesting European varietals. I was delighted that Charlotte Randolph (beverage director/owner) recommended a Riesling from Dr. Bürklin-Wolf, where I've gone on a wine tour during my first visit to Germany.", "author": "Rosella S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "The meal itself was wonderful, creative, and very well thought out from flavors to textures to presentation. The service was absolutely superb, and the staff definitely earn their 20% mandatory service charge. No complaints there.\n\nThe pricing point at $157 per person, though, feels a bit high. Though i understand the amount of work and technique that goes into each dish here that may often go under-appreciated, I still feel that the cost of many of the ingredients still shouldn't add up enough to justify the price point. If it was maybe $30-35 less, this place would easily be a solid 5 stars in my book.\n\nWith that being said, this was a special occasion dinner, and I thoroughly enjoyed my meal and my experience here. You won't get to experience things like a carne asada of A5 Miyazaki beef anywhere else, so it's definitely worth trying.", "author": "Kazu O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "3.5 Stars\n\nService - exceptional \nAmbiance - romantic, spacious, refined \nDrinks - only beer (limited unique offering) and wine (very robust selection)\nPlating - beautiful, playful, original\nFood - refined Mexican cuisine through a California lens; while a decent interpretation I felt it was too constrained in flavors and could have been bolder\nQuality - top notch, treated with respect and created unique flavor pairings to highlight the ingredients \nPortions - while small, the breath is enough to get you to feeling satisfied\n\nOverall Thoughts\n\nWhile I do have mix feelings about Californios, they overall showed why they deserved their Michelin star and for that I applaud them", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Great experience.  Staff friendly and tell you a little about each food and drink they serve you.  We added the food and wine pairing.  17 course meal.  Small portions.  You are full after eating for 3 hours.", "author": "R C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Just based on phone interaction so far: five star for customer service\nI asked for a reservation on very short notice and they didn't have any room unfortunately but... they called back super fast and were extremely nice and personal.\nI will be back and eat the wonderful food soon! :-)", "author": "FOO D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "Service was great. Food was great. When it comes to price I just feel like there needs to be something super special and memorable about the food in order to charge that kind of tasting menu price. A good experience for foodies.", "author": "Tracy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "I was really pleasantly surprised by Californios. Unlike some other Michelin-starred restaurants in San Francisco, Californios really stands out, with unique Mexican-influenced flavors and a really creative menu.\n\nThey did a great job of incorporating local Bay Area ingredients. For instance, they had a fun spin on a traditional quesadilla that was made with sharp cheddar from Sonoma, chantarelle mushrooms from Northern California, and fermented sourdough tortillas. The final result tasted amazing. \n\nAnother standout dish was the dungeness crab with hach pepper mole. The pepper (native to South America) added some great heat and bite to the chilled crab. \n\nI'm not usually a fan of tapas, because I always leave hungry. And, at first, I was worried that that would be the case here. However, after 16 rounds of tapas, I felt wonderfully content. \n\nEach bite was packed with flavor, sometimes subtle, sometimes bold. Pretty much every time though, delicious. \n\nHighly recommend!", "author": "Erick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "This is one of San Francisco's top restaurants. It is pricey, but much better value for that price point than many other fine dining options in the city. Why go to yet another French (or French inspired) restaurant when you can have something more authentic and local: a new take on Mexican and Californian cuisine. \n\nWe had a 15 course tasting menu (see photo), menu changes frequently, but my favorites were the lobster taco and the queso fundido with sourdough tortilla. \n\nThe staff was very attentive and impressive, and the founder/chef Val was really nice and humble. I like how they rotate through the whole staff to bring you each course, including the chefs.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "How is it possible that I enjoyed this meal even more than the first time? \nThis restaurant is killing it and is without a doubt one of my favorite places in SF. The service is astounding as usual, the food inspired, creative, and reflective of its Mexican heritage, and the pairings are still the best I've had in the city. Their somm is a freaking genius. \n\nAlready planning my next 2 visits.", "author": "Chad S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-15", "description": "One of the more unique upscale restaurants I've tried in the Bay. Creative. Variety of masas were fun to try. I think it's more of a Michelin 1-star than 2, but still highly recommend.", "author": "Keith P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-23", "description": "The Michelin Star that has been awarded to Californios is well deserved. As soon as the first course hits the table your senses are assaulted in the nicest possible way. The restaurant has been billed as a modern take on Mexican cuisine, but I think to most that will be left open to interpretation. I honestly don't know a whole lot about Mexican food, but what I ate here at Californios, I liked. Some dishes were really good, and others blew me away. Especially the dessert courses. Those were incredible. Unfortunately I left the menu behind at the restaurant and I can't remember the names of the dishes for the life of me. Be sure to check out my pictures though. \n\nAs for the service, I have to tell you that I had absolutely no issues. They were attentive, courteous, and explained each course with detail. These guys were absolutely spot on.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "You're reading the words of an oracle, because I had predicted Californios would receive a Michelin star after enjoying a fantastic meal here in August. And what do you know - one star for 2016! I'm always right.\n\nI came for a celebratory dinner, and was blown away by the experience (and I'm usually the one doing the blowing). The service was formal yet warm, and each dish was impeccably constructed. The flavors were familiar with a complex and refined twist. These are not your average taco truck taquitos. Some of my favorite dishes were the corn with uni, salmon, wagyu and foie gras dessert.\n\nPrices have increased significantly since the restaurant first opened - tasting menu is now $97 per person, which is still a good deal considering the number of restaurants that charge twice as much for food that's only half as good.", "author": "Suany W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-23", "description": "A food poisoning story. \n\nA girlfriend and I ate here last night and I'm almost 6 month pregnant. We told them there were few foods I had to avoid (like raw steak tartar, high Mercury fish, etc) and they were accommodating with substitutions. \n\nWhat had happened to me after leaving the restaurant, was pure hell from 10pm until 5AM. I had the worst case of food poisoning which involved throwing up over 20 times and nonstop bathroom trips. After 2 hours of cold sweat, throwing up, bathroom, we ended going to the UCSF pregnancy Triage to make sure our baby was ok. Since I wasn't able to hold down any water without throwing it up 5 minutes later. Certain food poisoning result in miscarriages and stillborn so we were super worried and not able to feel the baby kick by the time we got to the hospital. I was so delirious from water dehydration I felt as if I could faint at any time. \n\nAfter 5 hours at the hospital, and bags of IV later with anti nausea medication, I was discharged at 5AM and finally starting to feel like human again. \n\nI thought it might have been just me since pregnant people are more susceptible to food positing, but after talking to my friend, she also had diarrhea as well. So it's not just me. It may have just hit me 1000x harder since I'm pregnant. I would also like to add I never threw up the entire time during my pregnancy and I've also had food poisoning before (so I know what it feels like and this was 10x worse than ever). \n\nI have my hospital discharge papers if the restaurant need some kind of proof this happened.", "author": "Jean L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Outstanding execution and a game-changing display of the unexplored possibilities of Mexican cuisine. Pushes the envelope without falling into the trap of technique for technique's sake. Balanced and subtle flavors. Constantly evolving menu. Great service.", "author": "H S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "Received 1 Michelin Star (2016)\n\nThis review is super delayed, since I went to Californios right after they first opened. In any case, better late than never! My friends and I made reservations for a dinner on a weekday night, and were seated right when we arrived. Our menu consisted of:\n\nBotanas, Hielo, A-Chile, Papas, Caldo, Huevo, Halibu, Pato, Horchata, Piña, Dulces\n\n-Botanas/Snacks (Round 1: Oyster w/Nasturtium, Green Tomato Water & Chips and Dip: Yucca Chips, Smoky Goat Cheese, Trout Roe, http://www.yelp.com/user_local_photos?select=NL234_IAVqkRBK99-kd8ZA&userid=76vIFZcC7owykCBjMfGVXg): They oyster was super fresh, and the yucca chip combination was very tasty.\n-Botanas/Snacks (Round 2: Purple Haze Asparagus & Corn Puff, http://www.yelp.com/user_local_photos?select=vlej4TXY1bQ9OnTgQ65ssA&userid=76vIFZcC7owykCBjMfGVXg): The asparagus had a great char and was seasoned well, and the corn puff was crunchy and interesting. \n-Botanas/Snacks (Round 3: Granita, http://www.yelp.com/user_local_photos?select=JCkuKsTTiwR2zFf6sy3ICg&userid=76vIFZcC7owykCBjMfGVXg): I'm not a huge fan of granitas, but this version was pretty good, and very refreshing.\n-Hamachi Ceviche w/Serranos, Cilantro Blossoms (http://www.yelp.com/user_local_photos?select=a4UihLsRVjG5KLo-UmrKVQ&userid=76vIFZcC7owykCBjMfGVXg): Delicious- the hamachi was super fresh. \n-Poached Potato (w/Dill Pomme Puree, Chipotle Adobo (http://www.yelp.com/user_local_photos?select=rEie8YLbAp_RKKR5DcjFdA&userid=76vIFZcC7owykCBjMfGVXg, http://www.yelp.com/user_local_photos?select=vC3pjUa9qQYXIUn7S7PKng&userid=76vIFZcC7owykCBjMfGVXg): Yum- the puree was very smooth and creamy, and the flavors went really well together.\n-Bread (Buckwheat Sourdough w/Flax Seeds, House Cultured Butter, http://www.yelp.com/user_local_photos?select=kV7MGTIA52BHZk661F9NUg&userid=76vIFZcC7owykCBjMfGVXg): Solid bread and butter combination, and I liked that they toasted the bread.\n-Smoked Egg Yolk (w/Peas, Jalapeno Grits, http://www.yelp.com/user_local_photos?select=o9q-okzeG4COyrNVTJJAHw&userid=76vIFZcC7owykCBjMfGVXg): The smoked egg yolk added a great richness, and the peas were perfectly cooked.\n-Soup (Chicken, Turnips, Herbs, Chicken Stock, http://www.yelp.com/user_local_photos?select=gWwm1EWM9NHiCIJN4lBylQ&userid=76vIFZcC7owykCBjMfGVXg): Since this soup took 5 days to make, it's flavor was super concentrated. I'm not a big soup fan, so this was just ok for me.\n-Poached Alaskan Halibut (http://www.yelp.com/user_local_photos?select=sDxgDvXH5I8-OPZ-Cx_UgA&userid=76vIFZcC7owykCBjMfGVXg): The fish was cooked very well, and the flavors worked well together.\n-Grilled Gerard Farms Duck (http://www.yelp.com/user_local_photos?select=tl-aYfXuU0MKUVsiiD8vdA&userid=76vIFZcC7owykCBjMfGVXg): Flavorful, but it was definitely served on the rare side, even for me.\n-Horchata Rice Ice Cream (w/Strawberry Sorbet, Strawberries, Mochi, http://www.yelp.com/user_local_photos?select=cphnm2-Ja6l5H5I0qaTz2g&userid=76vIFZcC7owykCBjMfGVXg): Not my favorite since I don't like the cinnamon flavor in horchata or sorbet.\n-Dessert Part 2 (http://www.yelp.com/user_local_photos?select=cRHzxw1RrL1LkM4ZvwRIrg&userid=76vIFZcC7owykCBjMfGVXg): I can't remember exactly what this was anymore, but remember the top part was frozen. I didn't think it was anything special.\n-Mignardises (http://www.yelp.com/user_local_photos?select=03NDPY67qobpc1UdBLHlIg&userid=76vIFZcC7owykCBjMfGVXg): I LOVE when restaurants end a prix fixe with mignardises (unless its pate de fruit), and I enjoyed the caramels and cookies, but not the pate de fruit.\n\nService was great, and we thought it was a great meal overall. They raised their prices right after we went (it was an amazing deal when they first opened) but it's still reasonable for the quality and quantity of food. Highly recommended for a special occasion or fancy dinner with friends. Parking can be tough to find in this area, but there are spots on the street available.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "The wine pairing was spot on, and service was excellent too. Often conflicting tastes create something new and surprising.", "author": "Noel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "Amazing service - we came for a birthday and the staff was very accommodating with the birthday request. I initially booked an 8PM spot at the Chef's table, but I emailed the business to move the reservation up. \n\nWe were greeted with champagne and shared a wine pairing along with the September tasting menu which included a lot of beans & fresh fish. The A5 wagyu and salmon were my favorite dishes - however, they are hyper-local and hyper-seasonal, so definitely catch those two items this month! \n\nWe chatted with the chefs during the dinner (highly encourage chef's table) and took a picture with the head chef at the end of dinner. Everyone was so amazingly accommodating and we couldn't have asked for a better time!", "author": "Jennifer J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "i've had an exceptional dining year, and californios was probably my favorite experience, which is saying a lot, as alinea also happened earlier this year. everything was magic, starting from the moment i stepped into the understated and sexy dining room on 22nd street. highly recommend sitting at the chef's counter. interact with those who work there - everyone has really interesting background and wonderful stories and energy to share. joon was really great. chef is understated and humble. what a fantastic experience.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "Love everything about this restaurant. One carnivore and one vegetarian on a birthday dinner. Lovely evening, and the tasty food, great flavors and fast service were all wonderful. Thank you for the great experience! I will definitely be back!", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Best dining experience in SF. I asked my gf to take me here for my birthday dinner and it couldn't have been more perfect.\n\nI've sent many people here when they ask where to go for an anniversary, birthday or parent dinner.\n\nThis is a fancy restaurant with refined food but they hold the pretension, just how I like it!\n\nTheir service is 100. Charlotte and Carolyn (they run this ship) have created and maintained an amazing atmosphere. The decor is fucking TIGHT. So cool and chic and hip. The curation of every single detail is superb. Even the bathroom is chic.\n\nCharlotte is the beverage director and boy, as diners we are lucky for that because I had the most perfectly paired meal of my entire life. When I took a bite of each dish i thought \"this is the best bite ever,\" but then when I sipped whatever drink was paired with it it made it even better! Not only that but Charlotte explained each drink in layman's terms for me and it just made me feel so comfortable and not like I was out of place in such a nice restaurant.\n\nChef Val is a fucking genius. Or an alien. His ability to elevate and refine Latin cuisine is something I've never ever seen on Earth. Every single dish was from another planet, in the best way. I can still remember the familiar feel every dish evoked. Each bite had that eye-closing mMmMing taste. \n\nHighlight: birthday bubbly on the house. Made me feel SO SPECIAL! Also, the foie gras ice cream dessert was basically booshy cookies and cream. Best dessert. Best dinner. Best birthday ever.\n\nI'll be back for our next special occasion for sure.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "I had no idea what to expect coming here on my last trip to the SF. My friend made the reservations on a recommendation from his friend. Previously, two other hole-in-the-wall eateries, this hidden gem shouldn't be passed up!  I had the vegetarian tasting menu and was very pleased!! The texture, flavor and visual experiences were leaving me wanting more. Mexican inspired and very inspiring indeed. I love the fact that they source from local farms as much as possible. Some of my favorites were the bites at the beginning. Highly recommended!", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Amazing interesting dishes with great flavor. The wine pairing was spot on, and service was excellent too.", "author": "Ada F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Unforgettable meal. It was definitely different than your usual tasting menu given it's goal of elevating Mexican food to Michelin-level. \n\nThe three beans with caviar completely changed what I thought of beans. It can be used in haute cuisine.\n\nThe salmon preparation was also completely innovative which is impressive how often you probably have salmon. \n\nThe nectarine with a Japanese snapper fish was also very fresh and innovative.\n\nIt definitely is a very expensive tasting menu but if you're looking for something fresh and different this would qualify. The staff was very friendly and on point. IF you ask for the chef's counter you get a first hand view at what it takes to make your dishes so beautiful and flavorful.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "My dinner at Californios was one of the rare meals that wowed me from beginning to end. I can't believe that this place isn't more well-known! \n\nThere is a single menu that costs a reasonable $125 per person. I'd been meaning to come here for the longest time and finally convinced a friend to come with me yesterday. We were seated at the chef's counter and got to watch the magic happen. Is it embarrassing that I kept fawning over their teeny tiny pots and pans? I swear, the stuff that these chefs produced from that small kitchen is nothing short of magical.\n\nThe service was very friendly, polite, and attentive. They described each dish in detail as they brought them out - sadly, I didn't bother to take notes because I was told that we would receive a menu at the end of the meal. (spoiler: it's not helpful AT ALL :c )\n\nOur dishes, as recalled by my awful memory:\n- Pea Sprout Tostadas\n- Agua Fresca with a Shiso Coin\n- Fried Pork with Pickled Cucumber Taco\n- Fried Fish (?) Taco\n- Ceviche with Fish Roe and Avocado\n- White Strawberry Helado with Olive Oil\n- Yerba Buena (grilled seasonal vegetables)\n- Beans 3-Ways\n- Broth with Lime\n- Sous Vide Egg with Salsa and Caviar\n- Monterey Abalone with Tomatillo Broth\n- Trout with Tamarind Sauce and Peas\n- Sourdough Tortillas\n- Lamb with Charred Ramps\n- Mt. Tam Cheese Empanada\n- Wild Strawberry and Vanilla Flan\n- Yerba Buena Mint Ice Cream with Mexican Chocolate Sauce\n- Flautas with Dehydrated Apples, Foie Gras, and Crushed Peanuts\n\nEvery single dish was outstanding, but my favorites were the pork taco, beans (whipped beans!), trout, strawberry flan, and flautas. Trust me, the beans were transcendent.\n\nThis was my first exposure to Mexican fine dining and I'm hooked - I'll definitely be back for another meal!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "I like that there's nothing but a very subtle \"C\" on the door of this place. You feel like you're part of a well-kept secret. We had a fantastic dinner here; almost every course (11 total) was a total hit, but there were a couple misses. Boy was it pricey too--you really have to justify spending like this! Worth it for a special occasion but I wouldn't make this a regular go-to spot.\n\nOnce inside, Californios feels like your distant rich uncle's Upper East Side living room, complete with bookshelves and real books. It's dark and it's plush. A little sparse, but they are new and still seem to be finalizing the look (I commented on a gold skull they had at the entrance and they'd just gotten it the day before). \n\nTHE WAIT: None at 8:00pm on a Thursday for four. They don't crowd the tables and give you plenty of room, so even with the large space, there were relatively few tables compared to some restaurants that barely give you elbow room between tables.\n\nTHE SERVICE: Great! The staff were friendly, knowledgable, and made the vibe more casual and comfortable (the price tag and the decor would otherwise have pointed to a more pretentious place). \n\nTHE COST: Pricey! $100 for the tasting, $45 for the drink pairing, all before tax/tip.\n\nTHE FOOD: There's no pressure of looking at a menu and deciding. The tasting menu is set every night, and they save each course as a surprise (though they will ask about dietary restrictions, allergies, etc). Once your party is settled, the courses start coming out and gradually work their way up into richer, more filling small plates. It's meant to be an 8 course, but you have your amuse-bouche and extra desserts at the end, so the 11 courses works out to a perfect amount of food in my mind.\n\nTHE BEST: Huevo (sashimi), Pollo (in farro broth), Sable (swordfish in garlic sauce), Pato (steak), Foie (ice cream).\n\nTHE WORST: Papas (custard), Dulces (cookies).\n\nCourse 1: Botana (nachos and salsa) - 4 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#OH-TTEC7t0MHFYsVUZ8AwA\nA bit oily on the nachos, but thick with a subtle crunch, comes unique flavors on top.\n\nCourse 2: Hielo (oysters) - 4 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#aCy5hb6Cq6e6TgLrVbg4GA\nFresh & tasty!\n\nCourse 3: A-chile (celery pudding) - 4.5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#CtlnT2CR7ZBo9YGS5zGHag\nI usually hate celery but liked this! A good mix of salty and refreshing fruit flavors.\n\nCourse 4: Huevo (sashimi) - 5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#sVGQb9Sd530_DoBtMvhdog\nThe most fresh sashimi I've had, with great subtle flavors, hints of savory and spice. \n\nCourse 5: Pollo (chicken in a farro-infused broth, with bread) - 5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#I6CwqPm5sypOy2rB8ishVQ\nbread: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#BGn6f1c_0cWycByTyrp1nQ\nWe LOVED the flavor of the broth, and the chicken was incredibly tender. The bread was thick and grainy but could have been \n\nCourse 6: Papas (custard) - 3 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#2VUHvXOBnTTOt-PQkqc8cQ\nThe least impressive dish of the night. The custard was flavorless and the texture too stiff.\n\nCourse 7: Sable (swordfish in garlic sauce) - 5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#N1Yo_pQ7T0XkW5ShiVDTbg\nAmazingly strong garlic sauce!\n\nCourse 8: Pato (steak, with tortillas) - 5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#MoiZ2lw1cH_Bqhww3FotVA\ntortillas: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#E38D8nkrxNdXKJBqLaDiKA\ntortillas cross-section: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#-quf2HBx78O8FVOwTEL9Kw\nFantastic in all aspects.\n\nCourse 9: Verbena (their version of tres leches) - 4.5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#HciyXd8zfmiJopU_K4CJmg\nRefreshing, light, tasty dessert. But the scoop on top is a cream and not ice cream as we thought.\n\nCourse 10: Foie (foie gras ice cream, caramelized banana) - 5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#gFZ3g3UY7Yy3xUQBZDUApA\nThe best savory ice cream I've ever had. Texture and flavor all work flawlessly together.\n\nCourse 11: Dulces (biscuit, passionfruit, toffee) - 3.5 stars\npic: http://www.yelp.com/biz_photos/californios-san-francisco?select=gFZ3g3UY7Yy3xUQBZDUApA#03xm2ODHYFjYrqAaU6CO7Q\nNot the best way to end the meal. None of the three cookies were very impressive, but it was a nice free last dessert.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-08", "description": "My party of 4 came on a Saturday night at 6PM and there was only one other party present. By the end of our meal, the place was basically full. This place is tiny and only seats 30 people so be sure to make a reservation. They said the tasting would take 2.5 hrs but we were done in 2. Also, had I not know that this was a Mexican restaurant, I wouldn't have been able to tell considering a number of the dishes were heavily Asian-inspired.\n\n$75 tasting menu, $45 6 wine pairings, mandatory 18% tip. \n\n-Tortilla chip w/ roe - too salty\n-Oyster - fresh\n-Asparagus w/ yogurt - i wish there was more of this\n-Celery granita with pop rocks - refreshes your palette and definitely gets you excited for the following course\n-Smoked hamachi - haven't had this before. twas delicious!\n-Potatoes - potato puree, baked potato, potato chip. what a versatile ingredient\n-Tortilla - think pupusa with no filling. meh\n-Duck + Fennel Salad - duck was cooked to perfection.\n-Dessert - easily my favorite part of the meal. 3 courses!\n               Goats milk ice cream and citrus - light and smooth. acidity of the citrus cut through the creaminess of the goats milk well.\n               Foie Gras Ice Cream - you can't taste the foie gras but it definitely enhanced the creaminess of the ice cream. \n               A plate of bite-sized sweets: cookies, guava gelee, caramel. The portions were so tiny I didn't even feel guilty after\n\nWhen it was originally $57, it was absolutely a steal. At the current price of $75, it's definitely pricey. At the end of the meal, I was content, which means my guy friends were still hungry so we made a trip to El Farolito 2 blocks away. Overall, excellent quality, but quantity needs work.", "author": "Lucy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "This is my husband and mines favorite restaurant in San Francisco. We've been here 4 times over the last 3 years - it's our go to spot when celebrating birthdays, anniversaries, any special occasion really. \n\nThe food is wonderful and the staff are amazing! All of the cooks are friendly and kind and happy to personally answer any questions you have.\n\nCarolyn and Charlotte who run the front of the house are warm and inviting and super thoughtful - they make you feel welcome and comfortable the minute you walk in.\n\nI love the wine and beer list - it's always has something interesting and different to try.\n\nThe menu has been different each time we've gone but some dishes that have stood out are a lobster taco, the trefrioljes, and mole.\n\nI recommend this restaurant to everyone.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "I had been looking forward to this meal for weeks and it did not disappoint! From the moment you enter, you are treated with amazing service. The background music was some well thought out 80's and added to the experience. The place is very dark with just a few tables and a bar that faces the chefs. The courses included amazing abalone, crab and avocado, King salmon with a tamarind reduction, tuna crudo on a micro tostada. All 12 courses came out timely with no long periods. Once this place gets into the groove, it will certainly get more recognition. I suggest you get here soon before word really gets out!", "author": "Lorenzo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-26", "description": "I discovered Californios via the Eater Map and was mildly curious to see what they had going on there...particularly that foie gras vanilla ice cream everyone takes photos of.  When the opportunity presented itself, my husband and I wandered out to the Mission to give it a shot.\n\nAs you may already know, Californios has a set menu of 12 dishes that range from sweet to savory to heavy in protein, but sourced with all local and organic ingredients for $75 per person (the price just recently went to $75 from $65).  The menu seems to change quite frequently in terms of what's in season, so to make this a little bit more meaningful, I'll just highlight some of things we had that night.\n\nFavorite dishes:\n- Celery root apple granita with kiwi\n- In-house made sliced bread with flaxseed served with a house made chicken stock soup aged 5 days with parsnip and turnip\n- Sourdough tortillas with house made butter\n- Sonoma duck served with a shiso reduction and pico de gallo\n- Foie gras vanilla ice cream served with peanut brittle and banana\n\nAll five dishes completely nailed it.  My husband was a big fan of the granita and duck, and I was seriously drooling over the bread and tortillas.  The duck was served Japanese robata style and had a delicious smoky flavor to it.  And let's talk about the foie gras ice cream.  Absolutely no over-the-top foie gras taste, you get a SUPER rich and buttery vanilla ice cream taste instead.  It's pure genius.\n\nDishes that we were \"meh\" on:\n- Yellowtail with serrano chili oil\n- Oyster with jicama\n- Chawanmushi with caviar and blue corn tortilla chips\n\nThe yellowtail wasn't cut evenly and in fairly large pieces, so it was a little bit more than a mouthful when trying to eat it.  The oyster and chawanmushi weren't over the top, and the caviar on the chawanmushi seemed to overdo the umami taste I think it was going for.\n\nService wise, Californios did an amazing job with spacing out our dishes in a even way, and the person in charge of the wine program (my husband had the wine pairing with his meal) did an amazing job explaining each glass that was being poured with the upcoming dishes. Sitting at the bar was also a good experience and we got to see how hard the guys in the kitchen were working to put together some beautifully plated dishes.\n\nAt $75, Californios is definitely on the pricey side (more when you add in the drink program), and it's definitely not going to be the type of experience where you'll feel like you need to be rolled out of the restaurant from eating too much.  The plate sizing is delicate and meant to give you a solid few bites which focuses on quality and not quantity.  I definitely enjoyed my time at Californios, especially how much creativity and hard work they pour into each dish!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "I was really pleasantly surprised by Californios. Incredibly mix of local, taste, flavours and fresh food. The wine pairings enhance the dishes without getting in the way.", "author": "Giavanna F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "We really enjoyed the food and experience here. Imaginative cooking that melds multiple flavors in every dish.", "author": "Romina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "I absolutely loved Californios! If you are going to splurge, this is the place to do it! The food was absolutely delicious, soo fresh and just the perfect amount! They also have amazing wine and beer selection. We did the vegetarian tasting menu (let them know you are vegetarian when you make dinner reservation) and it was incredible! The service is above and beyond as well! We had something very special to celebrate and we are soo happy we chose this place to do it! I would go back in a jiffy!!!", "author": "P P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "4.5 STARS\n\n*After dinner at Californios*\n\nMe: \"Mmmm, I can eat like this every day.\"\nMr. NSS: \"Of course you can, IF you don't mind pushing around a shopping cart with your belongings.\"\n\nDamn, that got shut down quick.\n\nOpening on 1.2.15, Californios took over the old Manos Nouveau spot (http://bit.ly/1Bqqrly) in the Mission. Californios calls themselves \"Mexican fine dining\" but I found the food to be more Californian with Mexican influences. There's two tasting menus (meat or vegetarian) for $57 pp and wine pairings are an additional $35 (I received 4 pours). There's an 18% service charge that's shared among the entire staff. \n\nSimilar to omakase, the chef (formerly Sons & Daughters) and his sous chefs prepare a series of gorgeous dishes using the best seasonal ingredients available. The portions are small but it's not any different than the portions I've had at Saison, Manresa, and Atelier Crenn; and their tasting menus are $185-$298+. Did I contemplate on stopping by Escape from New York Pizza down the block afterwards? You betcha my fatass did but we didn't. But for $57, this is a super reasonably cost tasting menu which I doubt they're making much profit from.\n\n~ * ~ T A S T I N G  M E N U ~ * ~ \nSince we didn't get to see the menu until the end of dinner which has a vague one word descriptor, my descriptions may be a little off or incomplete: http://bit.ly/14pFcc6.\n\n(1) Chips & Salsa w/ trout roe: http://bit.ly/14ds3SB\n(2) Huckleberry Granita w/ \"pop rocks\": http://bit.ly/1Faspul\n(3) Foraged Salad: http://bit.ly/1rXBpgs\n(4) a. Smoked Torched Mackerel: http://bit.ly/1xutwQr\n(4) b. Kampachi Crudo: http://bit.ly/17df2dB\n(5) Chicken Soup w/ pomegranate seeds: http://bit.ly/1xKwi5O\n(6) Lengua Mole w/ avocado mash & cipollini onion: http://bit.ly/1BAvRbi\n(7) Romaine Granita w/ tea broth: http://bit.ly/1tJVW9s\n(8) Blood Orange Ice Cream & Chocolate Mousse: http://bit.ly/17dftoj\n(9) Foie Gras Ice Cream w/ apples & crumbles: http://bit.ly/1BAwd1V\n(10) Mexican Wedding Cookies w/ chili mango gelee: http://bit.ly/14duqVw\n\nNot being a fan of Sons & Daughters, I kept my expectations low but I was blown away with Chef Cantu's tasting menu especially for the price. Of course there were a few missteps (the granitas) but they're still testing things out so that's to be expected. \n\nThe fancy play on \"chips & salsa\" with a burst of saltiness from the trout roe was lovely start to the tasting menu. Loved the deliciously smoky and meaty mackerel, and the kampachi crudo was amazingly fresh. Loved the plate it was presented on which gave it illusion that the crudo was smoking. \n\nThe chicken soup was the best damn chicken soup I've had. The broth had some serious depth of flavor going on with a pop of sweet tartness from the pomegranate. The sous-vide chicken breast? Incredibly silky and tender. \n\nMr. NSS and I are lengua whores. The lengua mole was deliciously satisfying and oh so tender. Don't knock it until you've tried it because lengua is one of most underrated cuts. \n\nThe only thing I didn't care for were the intermezzo granitas. Maybe because of the cold weather?\n\nThe blood orange ice cream and chocolate mousse was decadent yet light. And, my eyes glistened when I heard the \"F\" word. The forbidden fruit in ice cream form savory sweet goodness in a scoop. Mr. NSS' know how much I love the \"F\" word and gave me his share. \n\nBoth the crumbly Mexican cookies with a drizzle of dulce de leche (instead of powdered sugar), and the sweet heat from the chili mango gelee were addictive.\n\nMy only suggestion is to add a bread course as a filler. I remember the best part of Sons & Daughter's tasting menu were their bread courses. Dat pretzel bread doe. \n\n~ * ~ S E R V I C E ~ * ~\nFor the second night of opening, I thought the staff was on point and very well polished. From the hostess to the sommelier, everyone was really amiable, warm, and attentive. I just read that the front of the house is a French Laundry alum which all then made sense (love that place to pieces). \n\nWe sat at the chef's counter which started off really quiet but as the night progressed, the chefs were a little more engaging. \n\nFrom start to finish, the tasting menu took about 90 minutes. \n\n~ * ~ A M B I A N C E / D E C O R ~ * ~\nCozy and romantic, Californios is a great date place. There's only seating for 25 and seats at the chef's counter so reservations are a must. I appreciated that the counter seats were very comfortable (read: wide and cushioned) for my tush. Growing up in the 90s, it was nostalgic to hear Boyz II Men and Usher playing in the background. \n\n~ * ~ P A R K I N G ~ * ~\nDifficult. Nearest parking garage is 3 blocks away on 21st and Bartlett. \n\nOverall, a fantastic grand opening and I think Californios may be a good contender for a 2016 Michelin Star.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Great experience from the reservation to the dessert. Wife and I decided to see swan lake in sf at 8pm and dine at Californios before. I called about the timing and the hostess assured me we will enjoy our dinner and in time for the show afterward. \n\nWe arrived at 5:30pm and amuse bouche was served timely with wine recommendations. All 16 courses came perfectly timed and prepared. Superb dining experience with amazing preparation and presentation. Friendly and knowledgeable staff made the whole experience memorable and most enjoyable. Compliments to the chefs with creativity and flavors.  Needless to say we finished the 18 courses in one hour 45 min and made good time at the ballet. \n\nOne of my favorite restaurant in the city now and we will be back soon. Will ask for the chef counter next so we can see the actions", "author": "Ray C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "Just like a lot of reviews, Californios is a great surprise. It's a small dimly lit place that plays really close attention to its diners. There is no menu, and you go in blind, hoping for the best. It's kind of nice not having to worry about it actually. They do ask you for any dietary restrictions and accommodate. The palate cleanser was actually the biggest surprise as it had pop rocks in it. Each dish was unique and delicious in its own way.\n\nSo why not the 5 stars? I noticed that the table next to us got 2 extra dishes- when all you can do is a set menu. Upon talking to the host, its basically upto the chef, who gets what, and when. So if you're a regular, you may get more...but for the first time, you get less. That was kinda off putting, but I will be back I suppose. Also, the hardcore rap that sometimes plays with their mix is so out of place. I have nothing against the music, in fact I was shazzaming it to get it later, I just thought it was out of place for such a upscale joint.", "author": "Bevi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "Still my favorite restaurant in SF. Thanks, Chef Cantu for continually surprising me with creative and innovative takes on classic dishes!", "author": "Chad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "Imaginative cooking that melds multiple flavors in every dish. The wine pairing was spot on, and service was excellent too.", "author": "Parker G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Wow!! Amazing food, service and atmosphere! Definitely one of the best restaurants we have been to! \n\nWe were lucky enough to get the chefs table. And it was a treat! Great food and wine. \n\nCharlotte was amazing. The Chef and rest of the staff were super fun! \n\nBtw - love the 90s music!!", "author": "W W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Incredibly well-done. Great for special occasions of for those who live on the tip of the spear for foodies, hopefully on someone's expense account.", "author": "Nicolas B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "This was the most precious meal I've ever had.  I don't know how else to describe it.  Like, over the top fancy / frou frou.  Don't get me wrong, it was all delicious, the restaurant has very cool décor, and the service was top notch....but it's a laughably over-the-top dining experience.\n\nFor our meal, we had a whopping 12 courses....it used to be fewer, and honestly, we were all STUFFED by the end.  We literally couldn't finish the whole meal.  Not even the 200+ pound former football player at our table.\n\nThe menu is ridiculously vague - botanas, campechana, nopales, ybfc (???), frijoles, langosta, tamal, Caesar, asada, queso, pina+pina, foie, and calabaza.  That's more than twelve....and there was also an amuse-bouche and (sort of gross) little takeaway candies with the check.  I honestly can't remember the details of every course, but the notable items:\n\n(1) Frijoles - To my excitement, they use Rancho Gordo beans for this, which I buy at the Ferry Building for my red beans and rice and other dishes.  This was RIDICULOUSLY good.  Basically the best mashed potatoes and gravy you've ever had, except all made from various beans and bean broths.  I can't do this dish justice with words.\n\n(2) Langosta - This lobster soup was excellently spicy and contained big, luscious chunks of lobster.  Really liked this...\n\n(3) Caesar - Best Caesar salad of my life.  Plus, I learned the origin of the name!\n\n(4) Foie - Ok, so I'm not sure if this course was actually Foie...but we had squab.  I never thought pigeon could be so tasty.  Although some people at the table were really freaked out, eating pigeon...\n\nAs I said before, the service is excellent.  Perhaps a little too pretentious but certainly very refined.  The way they serve the food is also beautiful but totally over the top.  We had different types of dishes and utensils with every course.  Golden spoons, tiny wooden spoons, two-pronged forks, vintage marble chargers, tiny tea plates with gilded skulls. It's not BAD, it's just so silly!  We were all giggling over the ridiculously specific utensils.  I don't know if all that is necessary - it takes the focus off of the food in a sort of unwelcomed way.\n\nThe restaurant is beautiful and funky.  The main dining room has an open kitchen and is decorated sort of in a fancy, masculine 80's throw back sort of way.  The bathroom is totally trippy with changing color neon lights.  If Patrick Bateman from American Psycho was going to eat somewhere, it would be here.\n\nNow that I've dined here, and it was one of the most expensive meals of my life, I don't think I need to come back....but I'm glad I tried it!  I fear that may be the downfall for this place.  It's an experiential meal, not a place you make reservations just to have a nice dinner on a Friday night.\n\nP.S. Not entirely sure why reservations are impossible to get.  We were one of TWO tables and our reservation was at 8:30pm on a Saturday night.  By the end, we were literally the only ones there.", "author": "Tay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-11", "description": "I really like Californios.\n\nBite-sized dishes of deliciousness. Each and every dish was exploding in flavor and was made ever-so-delicately. The cuisine resembled Mexican food with a fusion twist and was all beautifully presented.Favorites included their version of the \"Caesar Salad\" and \"Tripe\" - super flavorful and unique.\n\nI was a bit saddened I didn't get to taste any Uni dish like my gf Suany W. nor Foie like Cherylynn N. I was very much looking forward to either of those! In addition, I have a huge sweet tooth and can't even recall what I had for dessert anymore. I remember dessert being ok and not overly impressive.\n\nStill - the service was impeccable, the dining room was quaint/dark and romantic, and the food was refreshing and tasty.\n\nWe did have some sticker shock when the bill arrived and it totaled to just under $1K for about 4 people (4 tasting menus with wine pairings + their added service charge). I'd like to return here for date night and opt out of the wine pairing (and opt for a bottle or a few glasses instead) and see what their menu has in store next time!", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-02", "description": "I have only been blown away by 2 meals this year and Californios was one of them. I had the pleasure of dining here on Halloween night. As soon as we arrived, our table was ready and we were immediately seated.\n\nWithin 5 minutes of sitting down, they came over to pour us a glass of champagne to celebrate my birthday which was such a nice touch. I was at Al's the night before and the fact that we were celebrating my birthday was completely ignored. They didn't even verbally wish me a happy birthday.\n\nThen they came out to check if we had any dietary restrictions. This was even AFTER they went over the menu with us on the phone to make sure that we were ok with all of the ingredients. Did I mention that we had a 9 pm reservation and since someone canceled their 8 pm reservation, that they actually called us to ask us if we wanted to eat earlier!?! of course!!!!\n\nAlso, they were very considerate when they designed the restaurant. The tables for 2 are about a third wider than your average 2 top and there is actually space between tables. He could easily fit another table and have us all sitting on top of each other but he didn't. Don't you hate it when you're practically sitting on the person next to you and you can hear their conversation better than your own? Well, you won't have that problem here.\n\nThrough out the meal, it was truly nothing short of professional, friendly, informative and patient. With every dish came a change in table settings and with a complete explanation of where the ingredients were sourced and if there was some story behind it. For example, did you know that the Caesar salad was invented in Mexico? I sure didn't. There were also a lot of nice thought out touches. For example, I ordered coffee at the end and the cream that came out with it was actually heated up to prevent it from cooling your coffee down. \n\nThere was also not one bad dish. Everything was super delicious including their version of frijoles (beans) and I absolutely hate beans. I almost didn't eat it but everything had been so darn good that I just had to try it and I'm glad I did.  \n\nOverall, the entire experience was absolutely amazing. It's rare where the food AND service are just as good. They just got a Michelin star and trust me when I tell you that they are one of the places to watch. They WILL be getting a second star the next round. It's a must try. You will not regret it. I can't wait to go back!", "author": "Diane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "Food was great but what blew me away was their service. Service was one of the best I've experienced. I've dined at many fine dining restaurants and while service is attentive and on point, it usually feels fake and stuffy. Not at Californios. They were extremely professional but at the same time laid back and genuinely friendly. Their attentiveness even started before we were at the restaurant. 3 days before our dinner reservation they called to confirm and offered an earlier time for us since the only time we were able to get was 9:30. They asked if we would like to dine at 8pm instead since a spot opened up. On the same phone call they went over the menu with me to make sure it worked with our dietary restrictions. \n\nWhen we got there, they knew exactly who we are and remembered our dietary restrictions AND started us off with a complementary glass of champagne for the birthday we were celebrating. What a nice touch! \n\nSpace is small but it didn't feel small. Unlike most restaurants in SF, there is space between tables. You won't feel like you are sitting on top of the person next to you nor you will run out of space to fit all the dishes and glasses on your table. Their attention to detail goes as far as having wider tables for their guest to have a better overall experience.\n\nI am truly impressed.", "author": "Andy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "So happy that Val's restaurant is officially open! I've been patiently waiting for this day since hearing about his goal to open his own restaurant. There had been some pop up meals here and there but I have not been lucky with timing and missed out on those events so I made sure I jumped on reservations ASAP when I caught wind of the soft opening.\n\nVal and his team put together a very fun and creative menu with delicious flavor profiles. The dishes were described to me as modern Mexican cuisine although I thought only a few of the items subtly reflected that. Yet, I was very happy with the taste of everything that was put before me and found the wines to pair extremely well with my courses. I think I just about died and went to heaven over the perfectly grilled beef tongue alongside an Argentinian Merlot. Drooooool! Another favorite of mine from dinner was a very rich soup broth (I think it was duck?!? Maybe chicken...Too much vino, I forgot!) which my friend and I shamelessly lapped up every single last drop in our bowls.\n\nI'm looking forward to returning to Californios once their doors officially open starting Jan 2.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "My review is way overdue!  I love this restaurant.  It's so unique and amazing, that you will never forget it.  The food is impeccable.  The service is amazing.  Book ASAP!", "author": "Christina Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-17", "description": "Went here for nice meal with my husband since we live in the neighborhood. Maybe it was a bad day to go? My eyebrow game was not strong that day\n\nService: 3 stars\nThe staff was excellent - very nice and attentive-but they have a number of service flaws to fix.\nWe were asked multiple times about our drink selection from 3 different staff members. 3 times by 3 different people to take our initial drink order, about 4 more times from 2-3 different people for refill orders and this was usually one person asking and then 2minutes later another coming to ask and then 2 minutes later another coming to ask, and 2 more times taking our drink orders for dessert. I think you need to stick to one person per table... being asked for drinks that many times feels very interruptive.\n\nWhen we got up to leave there was a guy at the front holding out a coat to us...it was really awkward walking past him because the coat did not belong to my husband. The restaurant seats maybe 20? When we left there were only about 4 patrons left aside from us...very weird since we were the only ones walking out to be held a coat at the door that wasn't ours...\n\nAtmosphere: 5 stars. \nBeautiful decor. Dark navy walls and romantic lighting. Very cozy and chic feeling. Cool artwork on the wall. Amazing musical playlist = A+ (almost as good as the music at Saison).\n\nFood: 4 stars\nThe food here is pretty good but not phenomenal. It fluctuates between too light and too heavy of a hand. The flavors are clean and tasty. One of the dishes being the quail with the three sauces. The quail was good on it's own coated in the mole (?) but the three additional sauces were overkill. I want to know what is on my plate is good and not have too much choice. We had wagyu too (I think it was A5?) and while we heard other's raving about how it was the best steak they have ever had I can't say the same (the best I've had is A5 from 5A5 in the city. It's interesting when a roast quail from Atelier Crenn (to be fair their A5 Wagyu isn't great either) and a leg of Lamb from Lazy Bear have double the flavor of A5 beef. Amazing tacos though! I also love their desserts- very refreshing and interesting.\n\nThis place has very rich WASP feeling. Down to the undiverse wait staff. Sure a lot of the male serving staff looked like your typical white male abercrombie models but...it still feels weird at a place that is boasting california/mexican inspired flavors. It isn't welcoming or comforting. It feels formal which is a little weird for San Francisco. It's beautiful but a little cloying...more so from some feeling in the air that you need to be uppity to eat here.", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-08", "description": "This place is awesome. Saw some Yelp friends check in and decided to give the place a try. A friend and I came in for dinner around 7pm on a Thursday night. Place is pretty small but also was pretty packed especially given that this is their first week being open! The place definitely gives off an interesting vibe. It's got a dark/romantic/intimate atmosphere with interesting RNB/rap songs playing in the background. I love it. So Mission. It's also very much in line with this new affordable fine dining SF scene (i.e. this place reminded me of The Palace--great food, small place, though this place is definitely more aesthetically pleasing)\n\nIt's fine dining in the sense that the food is so top notch, but service sometimes feels a little awkward and not super natural yet--I'm sure it'll get better as the waitresses get more comfortable. My friend and I didn't order any alcohol and our waitress expressed some very noticeable disapproval/sadness which was a little awkward lol.\n\nI'll let my photos speak for themselves, but here's a brief rundown of the dishes we had:\n\nChips--yummy crisp sweet tangy tortilla chips that went super well with the fish roe on top! truly a burst of citrusy goodness\n\nHielo--huckleberry & lemon lime ice with pop rocks!! such a fun dish\n\nCrudo--basically tasted like Japanese sashimi but better. the jalapeno added a nice pop of flavor, the base of the dish was also tangy and citrusy. I enjoyed it! Super fresh fish\n\nGrano--my friend's favorite and I loved as well .whole grain chicken soup! chicken was a little dry and flavorless but the soup was yum yum with pomegranate seeds!\n\nBistec--YES. My favorite. my god it was amazing . The lengua mole was so soft and tender. Came with a caramelized onion that went really well with a citrusy avocado thick sauce\n\nChoc--blood orange ice cream with chocolate and coffee flavored stuff; pretty good\n\nFoie--foie gras ice cream with apple pieces and crumble--felt like a deconstructed apple pie. The ice cream was really good but honestly if you lied and told me it was caramel ice cream I would have believed it\n\nDulce--Mexican wedding cookie was super soft and yummy & the mango gummy was an excellent end!\n\nAt $57/person, I think this place is a huge bargain. They do automatically tack in the 18% service tax into your bill so be aware of that when you're paying. I'm not typically a fan of Mexican food, but this didn't even feel like Mexican food. Honestly such a phenomenal experience. Each dish was beautifully created and so, so creative. It's been a long time since I've had such an exciting, interesting meal. I left feeling full enough, though I could see how someone might still be hungry since the only entree is the beef tongue. \n\ntldr; super cheap tasting menu why wouldn't you go? get in before they get big! service could be better but food at the price is amazing.", "author": "Jasmine X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "If you ask foodies what the best fine dining restaurant is in the San Francisco area they'll likely respond with the usual places: The French Laundry, Benu, Saison, Lazy Bear, Quince, etc. All of these will provide you with truly exceptional meals but personally I think the new champ is Californios because it combines fine dining techniques with Mexican/Californian cuisine in a truly unique fashion that is prefect for the city and neighborhood in which it is based; fine new American and French cooking is a well-traveled road but I can't name another Michelin-rated restaurant that is even remotely like Californios.\n\nWhile I love the interior of the place it won't immediately suggest anything about what your experience is about to be like. It almost feels like a throwback to more traditional fine dining spaces but the classy understated primary colors, table settings and service are balanced with secondary modernist art, design touches, and music selections that give away the true spirit of this establishment: this isn't Gary Danko - this is a very modern, very San Francisco creative collective ready to run wild on your palate.\n\nThe food and wine at Californios is outstanding. As you've probably read, every dish comes from a tradition of Mexican cooking and those flavors are absolutely present in big, bold ways in the dishes. Some dishes are eclectic takes on more traditional comfort food classics like Queso Fundido and tacos, but each is exploding with flavor that will make you rethink what great Mexican preparation is. Wagyu steak here is always cooked to perfection and served with the most delicious accompaniments, my favorite of which was a grilled tomato that had such a perfect smoked, slight charred preparation. The most eclectic of the dishes is always the frijoles with caviar - I know you think you're getting some traditional pinto beans here but instead they are whipped into a very soft, almost potato-like texture the likes of which I've never enjoyed before. Every time I've been one of the desserts has been a banana ice cream complimented with dulce de leche that is just otherworldly.\n\nYou will also not leave here hungry - the tasting menu is extensive and, at the moment, still very reasonably priced around $150-$160.\n\nGo here NOW before it becomes even more popular because there's no way Californios stays a local secret for too much longer.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "AN overall excellent and interesting meal. The decor was unique and moody in a tiny space, but very classy. The food was hit and miss between all the courses. Some were fabulous, some good, and some I didn't like at all. I would still rate it excellent because of how beautifully everything was presented, the quality of ingredients, and how unique of an experience it was! A great meal experience indeed!", "author": "Jen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "For great food, people, prices and home cooking, nothing beats this place. The staff is friendly and attentive.", "author": "Aubree M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "Amazing tasting menu with wine pairing. Attention to details were well executed. But more importantly were the brilliant and thoughtful food combinations that made each bite an adventure and decadent treat. This place is a hidden gem in SF!", "author": "Claire M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "I learned that only a week before my dinner reservation at Californios, it received a Michelin star. Cool!\n\nDinner here is more about the experience than the food. We got a 5:30 reservation, and walked into a lovely, cozy, dark, masculine room. There was only one other table seated.Throughout the whole experience, our wait staff was friendly and attentive. You don't get just one server, as it was explained to me, whoever is available brings and explains your food. They started off by asking if there was anything we didn't eat. I actually don't eat cheese, and as it happened, the restaurant's cheese supplier was there when I said this. Apparently, he's a doctor that just makes cheese randomly as a side job. He berated me a bit for missing out, but it was all in good fun.\n\nShockingly, the wine list had some very affordable wines. My friend and I split a $40 Riesling that was actually one of the best Riesling's I've had. \n\nThen comes the food. 12 (very) small plates. Overall, it's enough to leave you satisfied, but not totally stuffed. All the food was good, but only a handful were excellent, which is I why I say that the experience here is more about the service. Dinner lasted almost three hours, and it was relaxing and fun to see plate after plate arrive. It was very much worth the $150/person after tax/tip (fyi, an 18% tip is automatically added to the bill). \n\nThe food standouts on the evening I went were the bean soup, Californio's take on a ceasar salad, and the lavendar honey ice cream.", "author": "Jenna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "Californios completely exceeded all of my expectations!! I guess I didn't really know what I was getting myself into. I was thinking this place was more of a The Palace and Mr.Pollo, Perbachu type of fixed menu, grunge meets high scale type of place but NOT AT ALL! The decor is simple and classy. The service was superb, and to top it off, the chef was at Sons & Daughter in a former life. \n\nThe 11 dishes + small bites were all so tasty and well thought out. I loved the fish dish as well as the uni corn. There's a slight play on Mexican cuisine but this is definitely a high end new American type of place with a Mexican influence. I highly recommend this place! Celebrate something! They serve champagne to you when you arrive. All the wines are well priced, and dish after dish was impressive and the perfect proportions. \n\nOh, one last thing. I love love love the bread. It was cilantro with green onion sourdough bread that they pan sear a little and made in house. It was delicious and comes in between one of the middle courses. I highly recommend this place and we all think they will get a Michelin star soon. It looks like they have raised the prices quite a bit, but with this quality, I would still say it's great value. $97 a person for the tasting menu, 2 bottles of wine, 18% tip between 5 people was around $160 a person just to give you a price point because it's not really clear on the website when we booked.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Quite possibly the best tasting I've experienced in SF. Exceptional food, service, ambiance. $500 for two tastings, three drinks, service (20%), and tax... But if you're looking to splurge, this one is well worth it.", "author": "seema s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Wow. I've had many tasting menus and this one really impressed. Loved the intimate venue beautifully decorated as if you were in someone's apartment in Paris. Service was warm and welcoming. Food was served at a nice clip...I hate it when tasting drag on in between dishes. The star was of course the wonderful flavors of modern Mexican cuisine. Kudos to the team here. Love to revisit.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "We had a wonderful experience at Californios, and they did not disappoint! A common question -- is $97 worth the tasting menu? YES\n\nUpon arrival we were greeted, and shortly after recommended a couple wines that would match the tasting menu -- white recommended. \n\nEvery single dish seems well thought out -- and I highly recommend sitting at the chef's table to watch them carefully prepare each dish to order. \n\nMy favorite dishes included the soup, rockfish over grape sauce, wagyu beef ( cooked perfectly medium rare), frijoles, and the cactus sorbet. The entire dinner took a little less than 2 hours -- about 1.5 hours.", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "I wasn't living in a cave and I heard about people raving about this place. When I stepped into the restaurant, I was surprised by its sophisticated dining room as no one told me about the nice ambiance. Uh oh - I felt underdressed. The attentive staff seated us at our table and the fine service continued until the end of the meal. Instead of having one waitperson, the restaurant employed a team approach. Different people were bringing us different dishes. At one point the chef brought out the plates himself presumably to ensure optimal serving temperature. \n\nThe menu was a $125 prix fixe and an optional $75 wine pairing was available. They didn't even publish a sample menu so I was completely in the dark when I showed up. I'd call the food seasonal with Mexican influence. The ingredients spoke loudly of spring and the flavors were fresh. All dishes were thoughtfully composed. It kind of reminded me of Meadowood in terms of their seriousness of the ingredient selections. While not every course was memorable, they were all interesting in its own way. My favoritea were the tacos and the sandwiches.\n\nOverall I find Californios an outstanding entrant into the SF dining scene. Given its seasonal menus, it will be an easy place to come back.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "4.5 stars. \n\nI thought the food was good. It didn't hit the spot EVERY time, but it came pretty darn close :)\n\nThe atmosphere and service was top notch. It was intimate and cozy without feeling like you're in a shoe box. It was nice, but not snooty. The service was warm and friendly, but still very professional... they really stand out for all of the above. I was thoroughly impressed with the balance they struck with the atmosphere and service. \n\nThey played a fun blend of different songs from the 80's 90's and early 00's keeping the energy lighthearted while enjoying great food.\n\nThanks-- WE LOVED YOU GUYS! :)", "author": "Sau y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "My boyfriend and I really enjoyed the experience at Californios.  The decor is lovely, with a quiet and intimate dining room, and the service is impeccable.  Our only notes were that 11 courses and 4 bites was quite a bit of food for us, and we would have preferred a few less courses.  They also had an excellent beer - a belgian white from Japan - that we particularly enjoyed. Our favorite courses were the crudo, chicharrones filled with goat cheese, and fig and cheese, but our favorite was the homemade sourdough bread with cilantro and home churned butter. Sooo amazing and I could eat an entire loaf of it.  It is served warm and crusty.  If they sold loaves of it separately, I would keep it constantly stocked in my kitchen!", "author": "Christina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "What an amazing experience! The food, service, and drinks were amazing. The ambience was stylish and romantic with an upbeat and eclectic soundtrack playing in the background. The wine pairing is a must. Definitely a pricey experience but incredibly memorable and worth every penny. Highly recommended.", "author": "Carter H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "From start to finish, what a amazing meal! One of the better and exciting tastings we've had in a long time!\nThis is the type of special meal we look for when we eat out- try new interesting flavor textures and profiles we've never had before..with high levels of food execution and creativity we obviously cannot prepare at home \n\nFor 75pp...a steaallll! I'm reluctant to post this,review as like the others I want to keep the secret to myself!\n\nWont go into every dish as by the time one goes, they will change the menu as it changes daily per the chef\n\nOf the predinner snacks served, hot, cold fish, meat n dessert courses everything was prepared with much thought and with the highest ingredients.\n\nWe Sat at chefs counter which I felt was best seat in house, you get to interact with the chefs and see the preparation..what a treat!\n\nHighlights of the meal was the smoked buri--3 year old young yellowtail crudo with the most delicious sauce. our first time having such young fish, it was beyond toro like butterry. Orgasmic!! We were savoring piece by piece....\n\nThe 5 day slow boiled Pollo soup with berries, herbs with garbanzo miso was off the hook! Richness of the broth was devine, paired with their yummy most delicious in house made thick bread n butter. Omg\n \nThe Alaskan halibut and 24 day aged baby lamb were also uber delicious \n\nThe horchata n sorbet dessert with pistachio n meringue was also a pleaser \n\n18% gratuity automatically added service was fantastic", "author": "Petri Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "Amazing and one of a kind gem in Bay Area!\n\nI went alone and was a little worried as to how it would be sitting at the chefs bar with no one to talk to however they guys are very outgoing and involve you in the experience.  I did not to the wine flight but opted for a glass of Pinot.  I was disappointed that they were out BUT was then recommended another that I was assured was the same quality.  It turned out to be perfect and was given a taste of another wine to pair with my salmon.  \n\nThe entire staff went above and beyond to involve me in the process!\n\nThe food.... Wow!  A few reviews said that you leave a bit hungry, not at all the case with me.  I was actually starting to wonder how many courses I had left only because I didn't think I could handle many more.  Side note, I finished it all and it was the perfect amount!\n\nThe wagyu beef \"tacos\" were amazing with two sauces for dipping and tacos that looked more like biscuits.  This was perfect because I always feel there isn't enough taco for the meal!\n\nThe butter, made in house, could have been a course all on its own!\n\nI will for sure return when I find myself in the area again!", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "A friend of mine well-connected to the SF dining scene told me \"Californios is doing some of the most exciting food in the city right now.\" High-end Mexican in the Mission? I'll admit I was highly skeptical, only to be thoroughly floored.\n\nWe sat at the bar for a wine-paired tasting menu and proceeded to be absolutely blown away by every course that arrived. The flavors were pronounced, thoughtful, incredibly well executed. My husband has already been back a 2nd time with family, and said that the team continues to up their game.\n\nIn a town full of Michelin-starred restaurants that can be underwhelming upon dining there, this one is worth the hype.", "author": "Jevan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-11", "description": "Just stumbled on the printout of our menu from Cinco de Mayo. Oh, memories. \n\nMuch to our excitement, my friend was kind enough to treat us to dinner here, after reading excellent reviews and hearing friends rave about it. \n\nI'm not one to write a review below 4 stars: I don't bother because I would rather praise local businesses versus dwell on less satisfying experiences. However, over a month later, I am still thinking how surprised we were by our meal and that as area residents who love and follow food, we have a responsibility to share the good and bad, especially when a meal costs $150 per person not including drinks or gratuity.\n\nWe arrived on time and were greeted by friendly staff. They offered to take our coats and seated us right away. Our primary waiter was quite effusive, clearly enthusiastic about what was about to unfold. He asked perhaps a few too many questions about us and why we were there, how we knew each other, where we were from originally, etc. but we politely answered anyway. \nThen he explained the set menu and pairing options. \n\nWe began with spicy margaritas and we were off. \n1) an agua fresca to awaken the palate\n2) an uni tostada with delicate greens and edible flowers balanced beautifully on a blue corn vehicle to deliciousness. \n3) The lechon or pork belly that followed was one of the most memorable dishes of the night. Perfectly seasoned with a cucumber-creme fraiche up top, the morsels of meat were savory and satisfying. As in, don't talk to me while I am enjoying this.\n4) Ceviche was a generous cup of fresh ikura with avocado crema. Those pearls of salmon roe were extraordinary and burst in the mouth with incredible flavor. \n5) Hielo was a refreshing, iced berry palate cleanser. Not too sweet, and still icy, kind of like a nice granita.\n6) Fruit Cup of assorted fresh local vegetables hand selected by the chef. It was fantastic -- some raw, some lightly grilled or blanched and bright. \n7) Frijoles, presented as a type of chawan mushi, and rather salty. The problem with a savory custard like that is you expect real treasures in there, and get less excited by beans.\n8) Lima, the lime-infused broth was one we all said we wanted to recreate. \n\nSounds glorious, right? Unfortunately, here is when the salt really set in.\n9) Huevos featured a delicately crafted egg coddled \"like the chef's grandmother used to make\". However, the dish was so salty we could barely taste the other ingredients, let alone the caviar on top. \n10) Abulon or abalone was a good recovery, balanced in a nice broth with simple veggies. \n11) Tamarindo was a wonderful surprise because it was all about the sauce yet accompanied by a slice of fresh trout, the skin crispy and flesh medium rare -- altogether perfectly prepared, with sugar snap peas. \n12) Quesadilla was a let down, a salty, grilled stomach-filler of carbs and mushrooms. I didn't even finish it.\n13) Cordero - lamb - was the biggest letdown of all. It arrived looking fabulous, a short cylinder of meat prepared as if for a culinary magazine of the first order. A dollop of mole sauce beckoned, as did an mound of freshly grilled green onion that had a slight char. But the lamb, alas -- what was to be the highlight of the meal -- was salty verging on inedible. 3 of the 4 of us returned this dish without taking more than one or two bites when it was meant to be the \"piece de resistance\" according to our chatty waiter. The green onions were delicious, but it is bad when the best part of a dish is the side. \n\nThe rest of the courses were desserts -- \n14) Berry flan, tight and not too sweet.\n15) Platano was a flavorful banana ice cream, and fresh caramel sauce added to your liking, my favorite of the three closers. \n16) Pastel, a white birthday cake with frosting and sprinkles seemed like a novel way to finish for novelty's sake. \n\nOverall...\nWas it a good meal? Sure, pretty good. Would I go back? Probably not. I found at least 3 of the dishes too salty, 1 unnecessary.\n\nWhen 3 of us didn't eat our lamb and the chef or senior staff didn't come ask why not was surprising. This isn't a large restaurant, we could see the chef a few feet away.\n\nPerhaps we were there on an off night. It is clear the team is dedicated to providing a refined meal  and unique experience here in our vibrant neighborhood. I wish them luck.", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "We requested to be seated at the chef's counter to watch the chefs in action. The dining room is tastefully decorated, very cozy.\n\nEach course was well explained and the transition was very smooth for our taste. We loved most of the dishes. We were surprised by every dish, from the use of the ingredients to execution, to the presentation. It was a pleasant journey for our eyes and stomach! \n\nThe only improvement we can think of is to have a red meat dish. \n\nWe will have to come back with friends.", "author": "Danielle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "I've been wanting to come here for awhile since it was recommended to me, and I was thrilled to come for my birthday dinner.  We had an excellent meal.  It's a relatively small restaurant, with some seating at the bar and then about 8 tables (we were able to sit by the front window in the corner which was nice). \n\nThe food was delicious throughout.  We also enjoyed the wine that we ordered - Lost and Found's Russian River Pinot Noir.  They accommodated my lactose intolerance beautifully.  There were a ton of courses, including two dessert courses, but most of them were tiny.  We were a bit nervous we wouldn't end up full but we were fine by the very end.  \n\n- agua fresca\n- chip - tacos with red peppers and a grain that tasted like cereal.\n- lingua - wagyu beef tongue braised for 16 hours with masa (really tender)\n- hielo - raspberry ice with sorel sauce\n- ceviche - dungeness crab with smoked trout roe and pepper (refreshing)\n- abulon - agua chile which was made as a gel with Monterey abalone and seaweed and cherry tomato\n- Yerba Buena fruit cup, which was a combo of pickled green beans, carrots and spring greens, goat cheese mousse, sunflower seeds, beets, cabbage, and interestingly no discernible fruit. (We learned something new here - turns out Yerba Buena used to be the name for San Francisco!)\n- frijoles - a bean soup \n- caldo - lamb broth with fresh mint and raspberry (very solid flavor)\n- arroz - beef with pea tendrils, sushi grade rice, salsa, preserved tomatoes and roma tomato broth\n- ciruela - lightly seared king salmon with stone fruit fennel and habanero \n- quesadilla - like a mini panini with green tomato salsa with porcini mushroom and queso oaxaca \n- cordero - single lamb chop with cherries -  perfectly cooked \n- platano- a meringue like dessert on a soft taco \n- pastel - frogs hollow apricot with cow's milk cheese on a pastry \n\nAnd then they sent out an extra bite of cake with a candle at the end...\nOverall, a really excellent meal and wonderful birthday dinner.", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Californios was excellent overall. We were able to sit at the counter and watch the chefs work throughout the evening. The kitchen is a well-oiled machine and the food is excellent. I was most impressed with the persimmon dish, wagyu steak, squab tacos, and the bean dish. The desserts were fantastic, too. Service was excellent, of course. We felt it was worth the money.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Fine dining with Mexican food, why not?  \nThis was one of the best dining experiences I've had in a long time.  Multiple courses of delicious, imaginative dishes, artfully presented, perfectly executed, plus thoughtful wine pairings (with truly amazing wines, like a sparkling gruner veltliner/riesling, and a memorable red Rhone) -- flawless service, all in a beautiful comfortable space.\n\nI have only two tiny quibbles (neither of which lead me to remove any stars):  \nfirst is the added 18% service charge WITH a line for you to fill in a tip.  I am *totally* fine with service included -- but I hate, hate, hate that moment of indecision:  I'm spending loads of money, almost $100 for the tax & tip, and still I feel like a stingy cheapskate because I didn't tip any EXTRA on top of that 18%.  I don't like feeling like a stingy cheapskate at the end of an otherwise lovely evening.  If service is included, then it should be included.  if 18% seems low, then make it 20%.  (((rant over)))\n\nsecond is the last little dessert-snack, a carmelized squash or pumpkin ball, was just weird & nasty tasting, and should definitely not be your last taste-impression.\n\nbut overall:  this should be high up on the list of places to consider for a special occasion.", "author": "Jaina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-12", "description": "Correction: the price per person is $57, plus tax and tip.", "author": "Abby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "The dishes came marching out one by one. \n\nVal M. Cantu and his experienced and talented staff have something special here. Val grew up in Texas cooking Mexican food in his father's kitchen. He's ever since had a dream and a vision to create a Mexican inspired fine dining restaurant. It's certainly fine. \n\nEach dish is thoughtfully prepared. First came three small dishes and palate cleanser with something resembling pop rocks. Then came three larger dishes each better than the next. We finished with two desserts and a plate of small candy-like treats. \n \nI cannot dive into every course but I can tell you that one of the small plates was a multi layered potato freak phenomena including one delicious Klamath potato, some spicy potato purée and topped with a delicate potato chip. One large plate was a piece of perfectly cooked and salted duck with long fermented tortillas. \n\nSome other highlights included the simple, fresh and in-season halibut and the oysters which launched us into this culinary experience. \n\nUnfortunately I cannot share with my thoughts on the drink menu or wine pairings. Sober April prevails. I can attest to the Moroccan style mint tea and vinaigrette Chardonnay non-alcoholic wine. \n\nThe service here is impeccable. The staff loves to talk about the food so ask questions. I learned a lot and enjoyed the company as well as the quirky playlist in the background. \n\nCalifornios, where the dishes came marching out one by one.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "Had an outstanding meal, actually event!  The food was fastidiously prepared, served and presented.  We spent 3 hours and enjoyed every minute and mouthful.  Had the wine pairing too ( when going all out, may as well go all out) and they were carefully thought out and generous. I highly recommend for a special evening out.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "I'm into it. After hearing about the restaurant opening, I made reservations for opening night (1/2). With minimal information available about the menu other than it being upscale Mexican food, my curiosity was piqued.\n\nUpon arrival, we were given the option to sit at a table or the bar -- we opted for the bar to sit closer to the action. Service was slightly awkward at first (3 different people greeted us, no offering of drinks right away though water was given immediately, delayed explanation of the menu and courses), but extremely friendly and certainly warmed up. We were told that there was a choice between two 4 course meals (meat or vegetable) sort of omakase style, with the option of a wine pairing. We chose the meat course and selected a bottle of the sparkling cab franc. For food:\n\nChips and salsa - reminiscent of a fried corn puff with fish roe and fermented chili sauce\n\nLime granita with homemade pop rocks (which I spilled all over)\n\nSmoked kampachi with fish sauce, chopped cilantro stalks, radish and chili \n\nChicken soup of reduced chicken broth mixed with faro starch water mixed with more chicken broth; tender piece of chicken cooked sous vide, pomegranate, pickled turnip/radish with chilis\n\nGrilled beef tongue (lengua) in mole sauce, avocado purée and grilled onion\n\nMeringue, chocolate creme de pot, and blood orange sorbet\n\nFoie gras salted ice cream, crumbled tortillas \n\nMexican wedding cookies \n\nThe chicken soup, grilled lengua, and foie gras ice cream were my favorite. I've never had tongue that tender and the soup was super hearty. \n\nWe bugged Chef Val and his staff with plenty of questions which enhanced our experience. For the first night of being open, I'd say they managed quite well and will certainly like to return to see what else Chef Val comes up with as a play on Mexican cuisine!", "author": "Johanna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Ate here last night and it was absolutely amazing.  All of the wait staff was on point and wonderful.  The food was ridiculously good, the setting was romantic and the wine was delicious.  It's the most I've ever paid for a dinner so I won't be able to become a regular but I've been wanting to try it for months and happy I did.  \n\nMy ONLY suggestion would be possibly offering an 8 course menu along with their 16 course menu.  Towards the end we were becoming so uncomfortably full but there was no way we couldn't eat what was put in front of us.  Definitely arrive hungry!  I'm writing this the next morning and I'm literally still full.  \n\nHighly recommend!  \n\nThanks everyone at Californios for making our evening lovely!", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "Californios - the restaurant - is a lot nicer than it looks in pictures. The place is dimly-lit, and has a noise level that is not too loud. They also have a good air-conditioner. The restaurant's kitchen is an open kitchen, which I think is awesome. Service-wise, the staff and chefs were really nice and very knowledgeable. They even pronounced all the spanish names of the dishes authentically. Also interesting references to harvests and seasonal crops, with an emphasis on sourcing ingredients from a farm near sonoma. The a5 wagyu steak was really good - one of the best steaks(perfect medium rare) I have had in the US. The quail mole was a close second - they broke down the ingredients on the side and gave us some of the cherry compote and chocolate on the side. I felt the tasting menu was a bit on the expensive side but thoroughly enjoyed my dining experience here.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "I went back and forth on whether or not to give this place 5 stars and decided on 4. It was a very very good meal, and the service was great too. However, I continued to be stumped by what we were eating. Each of the different chefs or servers who brought our food talked so fast, and when I asked if I could get some sort of menu at the end so I knew about all the cool stuff I was eating, I was informed I would. Then, as you may have seen in other posts, you get an highly stylized \"menu\" with one-word descriptions of each course. That is NOT what I wanted. I wanted to know WHAT was in the fish course and the sauce for the duck, etc. That left me pretty disappointed.\n\nThat being said, I'll try to piece together the courses from my memory and others' posts:\n\nCourse 1: tortilla chips with fish eggs and maybe some spicy sauce (a little dot on the edge of the chip)?\nCourse 2: oysters in a half shell\nCourse 3: Celery granita with kiwi pudding (palate cleanser) and pop rocks!\nCourse 4: some type of fish crudo with chili oil (excellent - one of my favorites)\nCourse 5: chicken soup with pomegranate. The chicken had an interesting, almost steak-y texture. Perhaps sous vide? I loved the rich broth.\nCourse 6: three potatoes - something pureed, something in a chip form and one other variant. \nCourse 7: Duck breast with shiso sauce, fennel and served with \"sour\" tortillas and some type of butter/spread. Very good.\nCourse 8: I'm a little hazy on this, but some type of ice cream I believe, with a goat cheese/goat milk? foam. Delicious.\nCourse 9: Foie gras ice cream with hazelnut crumble and caramelized banana. Yum!!\n\nThey finished off the meal with three small candies/treats: a pate de fruit, a cookie and a caramel.\n\nAll in all, a great tasting menu for a very reasonable price.", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "Excellent options. I come here with my my nephew and he loves it as well. I wish the music was better but I really enjoy this place overall", "author": "Michael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Date night with my lovely other half and we had a perfect time!  \n\nService and food were both on point---- very expensive since we did the wine pairing as well, but if you can splurge- well worth the experience.\n\nThey know how to do desserts! By far the best part of the meal, but all equally delicious.", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "A very interesting menu and fresh ingredients. It was nice to hear from where the ingredients had come. I wish it was written in the menu, though, as I can't remember all that information. It was cool to see the chef standing next to us managing the diners' meals. \n\nThey probably have the quesadilla every time. I really enjoyed the chewiness of the bread. I had a great crab ceviche dish with trout roe on it. The dishes were all beautifully and artfully plated. \n\nIt deserved the Michelin star and is probably one of the best Michelin one stars in SF. I wouldn't be surprised if a second way comes along.", "author": "Ellen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "Rude condescending owner. We called to check availability but they do not answer the phone nor call back. Having been recommended by a great foodie friend we bit the bullet and showed up very early. The restaurant was totally empty (not one customer). We were finally contacted by one of the many workers and they said they would check to see if it was possible to serve us (my bride and me). Note we were dressed well but I was not in a suit.\n\nAfter, a few people looking at us from behind the curtain in the back left of room a lady approached us a told us that they would not serve us \"...they were too busy\". Please remember there was NO CUSTOMERS at all. I asked how a reservation can be made and she said call. When I mentioned that I called and nobody answered the phone she laughed and then suggested I e mail them.\n\nWell we drove from Santa Cruz to be rudely treated. No Thanks. \n\nThe building inside is nice but the area is horrible. I would NEVER advise anyone to go unless you want them offended.", "author": "Thomas R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "My husband and I celebrated our 14th anniversary at Californios and we felt so fortunate!  What an amazing evening we were able to enjoy.  The staff and chef were lovely people who made us feel comfortable in a very special way.  I never once felt the atmosphere was pretentious; and yet their superior level of excellence and professionalism was demonstrated to the very end of the night.  The wine pairing was impeccable...including a beer that I would never have tried otherwise (so pleased I did)!  The tasting menu was thoughtfully developed with flavors that represented the depth and complexity of true Mexican cuisine.  Watching Chef check all of the food prepared was so interesting.  Both he and his wife are a fine example of what it takes to run an amazing restaurant.\n\nI loved everything about our time at Californios...including the Chef's throwback playlist! :)", "author": "Bebe G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "From the start to finish, I think it was an amazing meal!   I love their food and the price was decent too. I am a big fan with lemon, so I found they had the best Lemon that came with hot water. Overall, our group loves their food and the wine pairing too. We will go back sometimes later.", "author": "Meichelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "I would eat here everyday if I could!  Every aspect of the experience was spot on, and we've already starting planning a return visit next month.  \n\nLet's start with the graciousness of Charlotte, one of the owners.  My friend who was flying into town (and we booked this 30 days in advance), had a delayed and then cancelled flight.  Charlotte was so nice and understanding...even when my reservation of 3 turned to 2 people and 90 minutes later after our scheduled start time.  \n\nUpon arriving, it's a gorgeous spot and very intimate.  The staff is very friendly and knowledgeable.  And then the food...oh wow!  I wish I could say there was a standout dish, but it all was so delicious that I couldn't pick just one or two things.  There wasn't one thing we ate that we didn't LOVE and finish!  Getting the beverage pairing is totally worth it too.  It's worth noting that I'm a gluten-free diner (not by choice! by necessity), and they are able to accommodate that.  \n\nWe'll be back again in May and can't wait for another amazing dining experience!", "author": "Steph A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "My beau took me here on a \"date-night\" and boy, were we blown away! From the service to food and wine pairings...we left in a food EUPHORIA!!! The tasting menu got better and better which each dish as did the wine parings. \n\nAll staff and chefs were warm, friendly and one the owners even came up to chat it up with us towards the end of the amazing experience and shared some of the history of the place and the fun wine hunts she goes on. \n\nWe've been to other tasting menus in SF and hands down, this was out best experience yet! We will be back very soon! Thank you for ALL you do! We LOVE you guys!", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "Amazing dinner in a beautiful, sleek atmosphere.  I'm usually not a fan of multi-course pre-set menus, but this one was beautifully done with a staff that was really down to earth.  They even joked with us about how the wine pairings weren't worth it and then recommended glasses that were more affordable and totally went with our meal.\n\nDefinitely recommend if you're looking for a special occasion dinner!", "author": "Aisa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "Wow, this is one of SF best restaurants, and I have tried them all.  Call it Mexican or just call it great food, but each of the 20 plus dishes ranged from good to outstanding with most in the outstanding range.  Service here is excellent too.  There is great attention to detail.  Lots of interesting flavors and food on this surprise menu.  Even the $150 price -- given the amount and quality of food -- is moderate and certainly worth every penny.", "author": "Tony R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Baby doesn't need her meds this month.  Take the cash and head towards Californios (with reservations - small and intimate)  Food innovative, ingredients top quality, theatre quality presentations and elegant and personal service.  Food inventions work.  This is not a taco truck (as other reviewers had hoped for), though you might recognize some of the flavor.  This is a tweezer joint, get over it.  They are looking after you and feeding you from the moment you walk in.", "author": "amnnor n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-14", "description": "PROS: \n1)The Greeter and servers are EXCELLENT!!!! Make you feel at home and super sweet!! I LOVED THE SERVICE!!!! Probably the BEST part of the night!\n2) One of the courses had a delish cilantro sourdough toast with probably some of the best butter I've ever had. I LOVE BUTTER!\n3) Since I am pregnant, I couldn't eat some of the raw dishes, so they would do a cooked version or an alternate version of the course. Very thoughtful and I felt they sincerely cared!\n4)Small, quaint place, you never feel rushed and you really get to enjoy your meal.\n5) Fresh ingredients!!!\n\nCONS:\n1) Some courses fell a little flat for me. Too many ingredients and flavors at once, felt like they were trying to do too much. \n2) This is not Mexican food! It's like a French take on Mexican but way far from Mexican food. The only thing that had some semblance of Mexican was the bean puree which was very YUM!\n3) A bit overpriced. If I am going to pay this much, I want the food to overtake the experience, not the service!", "author": "Cynthia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "I don't ordinarily review restaurants, but Californios was so good I am motivating myself to do what I am normally too lazy to do.\n\nFirst off, the service is impeccable. The staff is on top of their game 100%. I loved our stylish and clever waitress, who always seemed to appear at the perfect moment but otherwise would be out of site. The other folks were equally professional. Notably, all this happens without an air of stuffiness - the place still has a chill vibe.\n\nI was nervous about going in for an 11-course tasting menu because normally those types of meals can take forever - but they had their timing down pat. The courses, perfectly sized, arrived in relatively quick succession. No unnecessary waiting, which I loved.\n\nThe food itself was super creative. My favorites were the dish with the hen's egg and roasted avocado and the desert that was cucumber themed. They sound strange but were awesome in the most unexpected ways.\n\nThe restaurant decor itself had some nice surprises. We were seated next to a bookshelf with well-selected items that ranged from a Mapplethorpe photography book to the Anarchist Cookbook. The bathroom had great art, including a neon sign I stared way too long at. And the menu they hand you on our way out had one of those old-school images where if you blur your eyes you see a hidden image. None of this was pointed out, just sort of there for you to discover. Smart.\n\nAll in all, Californios is a fun and delicious meal. I could not recommend it more highly.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "The entire experience was amazing. We were in town for a dental convention and wanted to splurge on a epic meal. The food was beyond extraordinary. Every dish was prepared, played, and described perfectly. The service and staff were amazing. If only I could transplant the entire establishment to Seattle! \n\nIt is definitely on the pricey side, but between the food and service it is well deserved. It is a small setting with limited seating so be sure to have reservations.", "author": "Christopher A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "We came here on the recommendation of a coworker. I'm usually not a huge fan of Mexican food as I can't handle a lot of heat. But to my surprise, while some of the dishes have some heat, I thought the heat added to the taste of the dishes and made them even more delicious (and not too spicy that I can't handle them). They start taking reservation 14 days in advance, and I grabbed the last 4-people table on a Saturday night. My friends and I came for what I described as \"haute Mexican-Californian cuisine\". The food definitely did not disappoint. On top of serving many dishes that I traditionally would not like (such as mole) but turned out to be stellar, the dishes also provide many flavors that you typically would not find in French/Italian/New American restaurants. The overall portion size was great, and my boyfriend has noted it as now one of his favorite restaurants in the city. I would recommend anyone who love trying out new food to give this place a visit as I'm sure it's only going to become even more popular!", "author": "Sharon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-08", "description": "Came with a friend and was surprised at how tiny this place is. Anyway food and wine pairing was delish, but not much of a razzle dazzle. Sorry for the 3 stars, it was good but could be better.", "author": "Danny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "This place is perfect!\n\nThe warm greeting upon walking in the front door sets the tone for the well-executed service and amazing food we enjoyed tonight. The team is friendly and attentive. We sat at the chef's counter and interacted frequently with the talented chefs. The atmosphere is casual and comfortable while the quality of the food and service is what you would find at any upscale restaurant in SF (without the pretension). \n\nWe loved every single one of the 8 or 9 courses of food. The chef's point of view is very strong, yet every dish was unique and complex. The wine pairings were also really perfect and complemented the food in a way that brought out flavors of the food in a different way than just eating the food alone.\n\nAs far as restaurant ambience goes, the bar stools are really unique and comfortable, the soundtrack that was playing was really good (we were quietly singing along to vintage Madonna), and the bathroom is clean and smells really good (scented towels!).\n\nI can't think of a better dining experience that I've had in SF recently. This meal was spot-on from start to finish!", "author": "Chad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "Californios brought a über fresh perspective of contemporary Mexican cuisine that left Cosme (NYC) and Topolobampo (Chicago) far behind with its creative expression, technique and originality. Will come back anytime.", "author": "Istria L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Mexican cuisine made with extreme care and detail. Loved the dessert, sorbet with tequila caramel! Too good.", "author": "Eve C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Hands down, the best of my fine dining experiences to date.  Over many visits, Californios has been consistently remarkable in dish and ingredient quality and creativity.  The service is precise and attentive without being intrusive, and offers the perfect measure of knowledgable interaction.  The understated atmosphere supports, rather than distracts, from the dining and conversation experience.  The only element thankfully lacking at Californios, is the pretense found in like establishments.  Make a reservation immediately.", "author": "Sandra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Wonderful meal with numerous highlights.   Both the innovative dishes (Lobster Tacos - yum!)  and the incredible takes on classics (Queso Fundido) made both of us smile.   We loved the wine and cider pairings as well.    Worth a detour in our opinion.", "author": "Jared B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "Love this new restaurant. Beautiful and intimate space.  Food was amazing and service at a much higher standard than other SF establishments.  Look forward to coming back!", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Easily one of the top 10 new restaurants in the Bay Area for 2015. Bf and I loved our first meal so much, we made a reservation to come back two weeks later. After another spectacular meal, we will be coming back again next month. \n\nDecor- sleek and elegant, reminds me a bit of a NYC speakeasy or lounge. \n\nFood- consistently delicious...mind numbingly delicious. Very innovative with creative use of unique ingredients. The oysters starters have been some of the best small bites I've ever had. The smoked fish dish (fish changes frequently) was delectable. Red meat dishes (we've had duck and lamb) were cooked perfectly. The potato dish is perfect for the starch lovers, packed of potato and butter flavor. I mean, how can you not love that?! I love their bread and butter. I don't think I need to explain why. Oh I also love one of their palate cleanser, the one with jasmine essence and Pop Rocks...so much fun! Oh their desserts are pretty spectacular also! \n\nDrinks- I have to say this though...as much as I enjoyed the food, the alcohol pairing is what and will keep me coming back. Their sommelier...she's just a genius. She finds very unique wine/champagne/beer/sake that I usually have never come across and have opened my eyes to the vast array of options out there. Each beverage pairing  consistently elevated the flavor profile of each dish. I was astounded. \n\nI have no doubt that a Michelin star is in their near future.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "Well thought out dishes and wine pairings! Each dish seemed to only surpass the previous but also tie in the taste and flavors that really make u stop and think about each bite you take. Amazing!", "author": "Byron N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "I'm actually a little conflicted about writing another glowing review of Californios. On the one hand, it's one of my favorite places to eat in San Francisco. On the other, the more popular it gets, the harder reservations will be to come by. I'll try not to be too selfish and share the wealth.\n\nThis was my second visit to Californios, and it was even better than the first (which was tremendous). The menu was much more substantial - whereas the first time I left satisfied but not stuffed, this time I couldn't even finish every course. All for the same price!\n\nDinner was also much longer, over 3 hours. And each course had a little surprise in it. Flavors that don't normally get matched up (like blueberries and chicken broth), textures that delight (crunch, crunch, creamy), and Mexican influences that are a little more pronounced than in the past.\n\nIt's really a wonderful meal and a relatively good value ($113/person including tax, gratuity, and a drink or two). I still predict this place will get their first Michelin star as soon as they are eligible.\n\nPROS\n- Best dessert I've ever hard.\n- Service is top notch\n\nCONS\n- Only beer and wine, which they try to address by getting creative with cocktails. I'd stick to just beer or wine (or try the pairings).\n\nTIPS\nSave room for dessert, because it just might be the best dessert in the city.", "author": "Drew P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-18", "description": "Great Service, Nice Place, Tasty food, TINY portion and Expensive.\nWe had a 9 curse diner or something like that and we spend like almost 3 hours there mostly drinking and chatting. I'm Mexican and i've been in a lot of restaurant from Fancy one to simple ones and I'm always looking for tasty and well done food. I think this place was a little to inventive and pretentious in terms of the food.\nChips and salsa was ridicuisly small and not chips and salsa at all. The asparagus with a drop of dressing or whatever was a delicious Joke. \nI felt like in a taste room. I must say the Gordita was the only Mexican thing.\nI'm looking forward to find I high end Restaurant with Mexican Cuisine, this is just not there. Too bad employees were great.", "author": "Yuri N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Ah, a serene and lovely menu, from start to finish. My client and I came to Californios for dinner last night. It's located on 22nd St in the heart of the Mission, don't let that scare you away - look for the black wall with the door in it and walk-in (with reservations, of course). We had the 17 course chef's choice ($185 pp incl tip) paired with 8 champagnes, wines, and beer ($115). The pairing was perfect and so much more interesting than pairings that I've had at other top restaurants. To the sommelier - excellent finds! Another point of interest is that they do not give you the menu until the very end of the meal, as each course is served the waiter tells you what you will be eating or drinking. On one hand, that's great because I could never remember the menu and you don't really want to pick it up and read it with each course; on the other hand, if you are trying to have an intimate conversation, this might not be the perfect place. That said, each course was a little treat with a wonderful swirl of flavors. Mexican food in theory, but really haute cuisine with a nod to our South of the Border neighbors. The chef intermixed the heavier meat and cream dishes with fruit sorbets, or vegetables. Thank you chef, this is the way that I like to eat. My favorites: chicharron with caviar (OMG!), aguachile, fruit cup, and wagyu. This is one of the best meals I have ever had.", "author": "Virginia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-18", "description": "Amazing, and great for my vegetarian hubby!  They brought out freshly foraged veggies for him and \"just dug\" potatoes were also served.  I love these adjectives and the flavor of everything was just amazing.  It's not often that you find a place great for both vegetarians and meat eaters and where the veggie meal is thoughtful and tasty and not just a bowl of risotto or some veggies on a plate.\n\nmy favorite was the sashimi, the warm tortillas, and the buttery fish that was so delicate.  Totally worth the price!  We ordered a bottle of pinot that went well with everything, but next time we might try the wine pairing!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "This place is outstanding! \n\nChef Val is doing incredible work. He is spearheading the direction of Mexican cuisine, and taking it to a level of creativity and class that it always deserved.\n\nThis place truly is a special gem in SF. From the colorful yet dark themed paintings, to the ASAP Rocky & Yeezy filled playlist, it really is a remarkable experience.\n\nGet the wine pairing! The beverage director is fearlessly creative and selects some awesome wines and beers to go along with the dishes.\n\nI'll be back soon!", "author": "Robert H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Wow - a big 5 stars for this place. Loved the atmosphere, loved the people (Alex, Carolyn - you guys rock!!). But none of it would matter if the food wasn't so spectacular. Here is what we had that I can remember: \nBotanas - 8 one bite dishes. Best was the Pineapple Goat Cheese mousse.\nHielo - very interesting and delicious palate cleanser. \nCrudo - 3 pieces each - best was the scallops and I don't even like scallops \nFrijoles - so good I wanted a massive bowl, which Alex did not recommend for obvious reasons \nSwagyu - best beef with yummy sauces \nQueso - what made this is the Pluot Tepache made in house\nDesserts - cucumber cake with Foie Gras ice cream (sounds weird but was great), a chocolate dessert plus homemade chocolates.\n\nWe also had a corn dish, a salmon dish and a soup. All were quite good along with a wonderful grilled bread and house made butter.  I was actually amazed as each dish was light because they use very little butter and cream except with the bread/butter serving.  We will be back as the season changes to see what other inventive dishes are served.", "author": "Deb R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "All I'm going to say is that this place was excellent. The food was sooo good. I'm not going to critique every dish one by one. All you need to know is that you won't be disappointed. You're in for a treat. The quality and attention to detail they have at this restaurant make the high price worth it. The only dishes I did not particularly enjoy out of the the 12 course tasting menu was the chilled gazpacho and the fruit dish. I'm not a fan of cold soup so the gazpacho while flavorful just wasn't my cup of tea, or soup in this case.  The fruit dish was okay but what killed it for me was the goat cheese. Just kinda ruined the whole flavor of the dish.  There is only one bathroom but the wait staff will actual tell you when the bathroom is free so you don't have to just stand around and wait. Also the bathroom has ambient lighting that changes every 30 seconds or so, so that's pretty cool. All in all great restaurant. Very well deserved of a Michelin star.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "Do yourself a favor, and go. Now. Before it's a difficult reservation. Before it's so pricey you can't afford it.  It's an incredibly personal restaurant with amazing staff and absolutely lovely decor. All the little touches are amazing. The food was brilliant. If you're someone who can completely turn the reins over to the chef and allow yourself to be surprised, you won't be disappointed. Was every dish perfect? No, but most were. While not inexpensive, the tasting menu and wine pairings seemed a bargain for the quality. I absolutely loved it!", "author": "Marie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "It is *extremely* difficult to pull off cuisine that is both conceptual and delicious. Daniel Patterson pulls it off at Coi, and Josh Skenes at Saison, James Syhabout at Commis also come to mind. Conversely, there are others that fall a bit short too -- Central Kitchen, Commonwealth, and Sons & Daughters just don't do it for me personally (even though I understand the chef here had worked at the latter). Flavor can take a backseat to the concept or, the point of view can get lost among too many forced techniques. Regardless of which ones we prefer, we're lucky to live in a part of the world with so many of these kinds of restaurants to experience and choose from.\n\nCalifornios does beautiful, personal, heady cuisine -- most importantly, that is also delicious -- that also prioritizes challenging those who dine there (down to the sign outside, down to the imagery on social media, etc). I can understand that might not appeal to some people, but I think it's important to have restaurants that can push boundaries in a real way without sacrificing flavor. What is Mexican food exactly? What can it be? Why do we put so many confines on it? If it becomes something unfamiliar, does that not make it Mexican food?\n\nI love that Val Cantu calls it Mexican food by the way, and I think it's fucking bold that he opened it in the Mission too. Is it Mexican food though? It's certainly fine dining with an eye on a Michelin star, but I would certainly say it's Mexican food. One slurp of the chicken soup broth will take you back to your abuela's house, but then you bite into the pickled turnips in that same bowl and you're transported somewhere else entirely. As for the beef tongue -- obviously it's not your late night lengua taco, but if they didn't tell you it was tongue, I guarantee you would never notice because it's that delicate -- and *that* good. The plating and presentation is all gorgeous, almost deliciously geometric on some dishes (never thought I would say that).\n\nAs I mentioned before, you get the feeling that the food is personal too. It's a cozy small space (love the black interior, btw), so the sense is that you're one of only a few others making similar discoveries. That's the perfect backdrop for what is going on here.\n\nI went on one of the first nights and apparently they will have an expanded tasting menu soon, and I can't wait to get back.", "author": "George C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-10", "description": "Very underwhelmed by this place. I was excited to try a Mexican tasting menu but the \"seven course\" tasting we had failed to satiate my palette and stomach.\n\nThe entire meal felt like an appetizer, and I would gladly pay more for the many other better tasting and filling menus or omakase in the city. Chef may have been trying too hard in trying to establish dominant flavors into single bite size courses.\n\nIn addition, there were two waitresses that would rotate and ask me the same question every 15 minutes. Probably due to a lack of communication and being a new restaurant.\n\nSuggested improvements: Your value proposition is very unique in that you are probably one of the very few Mexican tastings in the area. Would really work on finding the correct portion size and/or expand your course offering. Would recommend even just having your staff try your tasting course and have them give their anonymous honest feedback.\n\nI like the concept, but a lot of work to be done.", "author": "Alan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "Quite possibly the best meal I've ever had. Phenomenal service, super cool ambience--the decor is cool, comfy and chic, and the food was incredible. Went to celebrate my fiance's birthday, sat at the chef's counter (only six seats up there and it's long so you're not crowded) and we had the best view in the house! It was so cool to watch them painstakingly prepare each beautiful, thoughtful and creative course. We did the wine pairing as well, which I thought were decent pours but I didn't walk out stumbling drunk either. Really delicious and unique wines, so well paired. I'm glad they gave us the menu at the end, I want to see if I can buy some of it myself. I wanted to take photos of each course but I knew it couldn't possibly do them justice. This is definitely not a cheap meal, but soooo worth it!", "author": "Courtney F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Great food. Very tasty with unique flavored. Very creative. Good service. Had difficulty understanding the servers description of the food. Very thin wine list skewed toward very expensive wines. Overpriced beer.", "author": "Alfred S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "I'm Pescatarian. I am so happy with my meal tonight. All other michelin star restaurants that i've been to have replace at least one of my meat dishes to vegetarian (lazy bear replaced all!!!!) which really irritates me. Californios is the only one exception. Every single meat dish was replaced with an amazing seafood dish (from fish to abalone).  Not to mention how delicious every dish was and now friendly everyone was. Can't wait to be back and see their progress in the years to come.", "author": "Tiff H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "Very accommodating, they let my date and me in almost at the end of the night with no reservation. Their tasting menu was lovely, their wine was excellent, and the ambiance was perfect. Definitely a wonderful date experience, and one that I'd return to.", "author": "Josh H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-06", "description": "Deserves a 1/2 Michelin star for clean bold flavors. Wine list lacks depth and uneven. Some use of simple chili edged flavors lacked imagination (mission fruit cup for example) and could use some incisive complex spice flavors. At $158/person + wine, I expect to come away inspired. That didn't happen. Not even close.... And oh they overcooked the abalone. and served it - a double sin. That dish should never have passed a chef's hand to the table.", "author": "r s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "Absolutely a great restaurant. Just finished a celebratory dinner that could have tasted no better, nor been more beautiful , or been more graciously served. Can't wait to dine there again.  If you're on the fence, get there soonest.", "author": "robby m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "Incredible meal paired with incredible service. We walked in expecting a couple of bumps along the road (seeing how it had 'just' opened) but we ended up receiving a whole lot more. You can consider this kind of eating \"elevated\" Mexican-influenced California food. My mind kept oscillating between, \"gee this tastes better than my grandma's....\" and \"damn this is good....no, wait...this is brilliant!\"\n\nThe plating is beautiful. The portions are spot-on. And the flavors/ingredients are masterfully put together to give you something to think about.\n\nOur table immediately noticed the effect of food contrast throughout the meal. It started off light, colorful and zingy. Then turned darker, earthier and rich. Our pairing of a Barcelonian Beer maintained it's versatility and relevance throughout most of the courses; it was so tasty we ordered a second bottle.\n\nIn addition to great ambience, music, service...I found the menu to be surprisingly delightful. No, really. The actual menu you get to take home to brag (I mean, share) with your friends is quite the treat. Like I said, folks. Put on your best foodie-cap. This place is worth several visits. :)\n\nOf particular interest for our pre-fixe was the chicken soup and \"os\". The chicken soup is not simple and requires a bit of navigation with the spoon. Reckless slurping of this dish will result in missing out on some of the wonderful hidden gems within (eg. the pomegranates, citrus \"caviar\" and umami-rich broth). Please, take your time with this dish. \n\nThe last dish I want to commend is the \"os\". I have no idea what this is actually, or what it means or even the impetus behind it. Avocados! California! Right?!. Imagine a grilled avocado, topped with farro, which is topped with pan-roasted mushrooms (oyster & morel) and garnished with very crispy, slightly charred rice puffs. This dish, despite having no protein, had all the right elements to make me feel like I was enjoying something wholesome. We almost raised the white flag, but couldn't resist the BBQ Lengua or the foie gras ice-cream. :)", "author": "Chris V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-30", "description": "Yup I'm doing it...5 stars!  What an impressive LITTLE gem!  Round of applause to the staff all the way from the front of house to the sommelier to the chefs.  Service was impeccable and the food was creative, delicious, memorable and we can't wait to come back!\n\nDon't even look at the wine list and go straight to the tasting + flights as the sommelier from the FL does an amazing job choosing what you need to compliment your meal.  Enjoy!  \n\nCalling it now, this place will do very well!", "author": "Jackie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "I've been here twice in the past week for the tasting menu, and I am going to come here as often as I can before they get a Michelin star and the prices go up. You cannot do better than their tasting menu and wine pairing at $75 and $45 respectively. The ingredients and preparations are amazing, and I think it's only a matter of time before they are on par with 3-star restaurants like Benu, French Laundry, and Meadowood. Service is also extremely good, with the chefs bringing out the courses and providing in-depth descriptions for each.\n\nI usually do not get wine pairings, but I think that it is critical here. Each pairing was perfect; I have never had a succession of such flawless wines, beer, and sake. The price is insane.\n\nIn closing, I'd say that I preferred this place to Saison and found it to be on par with the likes of Lazy Bear. It actually reminds me a lot of Saison when it opened as a pop-up 5 years ago (and was charging $75 for the tasting menu). Trust me, go now.", "author": "Ray N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-09", "description": "You get the feel of a fine-dining restaurant without having to pay that high of a premium. Don't get me wrong, it's still not cheap, but it's not as expensive as the benus and saisons of the world. When we first walked in they gave us complimentary champagne since we were celebrating a birthday which was awesome. Then they started the first of 12 courses. All the dishes use fresh and locally sourced ingredients. They do a good job of explaining each dish as you don't have a menu next to you to go off of. Overall the experience was great, and you end up leaving satisfied and full.", "author": "Derrick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "Note: we are not friends/family of the restaurant - we are regular people who walked in right off of the street on our way to our dinner reservation at a different place around the corner. We were curious because of the frosted windows and the fun music that we could hear...so we went in...we enjoyed a glass of sparkling wine and learned it was opening night. Because of the nice vibe, we made a reservation for the next night to find out more...this is what we discovered:\n\nCalifornios is a hip spot in the Mission with a different twist on traditional Mexican food. The menu is surprising, presentation is impeccable, and the flavors are new -- but grounded in tradition. A true shining star is the chicken dish that the chef pours a fantastically well-executed broth over, with the surprise of a nice pickled vegetable - resulting in truly great flavor. Wine pairings are off the beaten track and thought provoking. We also enjoyed the play on chips with salsa, and the end of meal ice creams which were creative and delicious.\n\nThis is a brand new place - the staff are warm, welcoming, and open to feedback. They have a highly trained staff with impressive backgrounds resulting in food that is conceived and prepared from the heart and served with grace. Give this place a try and experience something new in the Mission.", "author": "Nancy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "My mind was blown. Every dish is truly unique and inspired. This restaurant completely transcends the Michelin formula. The flavors are strong and unexpected. The food errors on the side of fun over pretentious.\n\nStaff is delightful and upbeat. Something about the restaurant reminds me of Commis back when Commis first opened, but less formal and the dishes at Californios are more audacious and creative.\n\nThis is my new all-time favorite restaurant. At the end of the meal, our entire party made reservations for the next week.\n\nYou must go.", "author": "Mike I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Honestly, as good as it gets. This tasting menu was perfection, and sitting at the Chef's Counter was a HUGE plus. Highly recommend!\n\nI literally licked my plate clean for 15 out of the 16 courses. And for the 16th (salmon in a broth), it was good...just not my favorite. \n\nThe service was impeccable, the interior was so chic, and the food was amazing! \n\nDefinitely come for a special occasion and sit at the Chef's Counter for a night to remember.", "author": "K. D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "Amazing food, good service in a classy restaurant. \nBut the music !!!! : very bad choice : loud and boring music.", "author": "Arnaud M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "I'm absolutely floored by the dining experience here!\n\nThis is the kind of food that keeps you thinking about it days after the meal is over.\n\nIn my mind, next to Saison, this is possibly the best restaurant in SF at this moment.   \n\nI cannot recommend Californios highly enough.", "author": "Fred X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-16", "description": "It was a pretty fun experience. We've done a few other tasting menus (commis, four seasons, aziza) and this one I felt was excellent individually but not as a cohesive whole. I couldn't hear the waiters say what was in the dishes and when they handed out menus at the end it was just single words - not descriptions. Would have been nice to hear more about the dishes instead of now forever wondering what we ate.\n\nCute bathroom. Pretentious in the slightest but no too unapproachable.\n\nLove love loved the beef tongue we were served it was fantastic.", "author": "Kate K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "Wow!  Definitely on par and perhaps even better than many of the premier tasting menus I've had, including Per Se and Daniel in NY.  I can't believe it's only $75 for the entire tasting menu, but that's bound to change as soon as this place registers as it should.\nThere wasn't a single dish that I could pick at in terms of preparation or the taste being somehow off.  The SF chronicle was whining about \"lack of passion\" while admitting the food was superb, but either that's changed or the critic has been taking his support for legalization of herbs too seriously and hitting the pipe a bit too hard.  There is so much going on in every dish, even snacks, that it's hard to imagine that it was executed so well.  Some of my favorites were the yellowtail, potato purée, halibut with charred greens, asparagus and the sorbets.  Left feeling more than satisfied and only wishing I could come back the next day.  Well done.", "author": "Daniel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "Amazing!  Blind tasting and we loved everything we got!  Do get the wine pairing with the six course meal.   The service was impeccable and the food was scrumptious!  The space is beautiful and relaxing.   Fun treat to try now!  You deserve it!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "We loved this place. The host and waitress were very welcoming with a genuine interest in our well being during the entire dinner. The tasting menu was well thought out, demonstrating delicate textures with lovely flavor profiles, each dish having their own personality. Not to mention all tastes were beautifully plated. Wine pairing was spot on. And, at fifty seven dollars per person for 8 tastes, this is a phenomenal value. \n\nThe ambiance was perfect: dark, romantic, white table cloths, tufted leather banquettes, interesting art hanging on the walls, juxtaposed with fun/upbeat rap and 80's music playing in the background.  Love that.\n\nWe had a fantastic evening and are excited to return again. Thanks Californios!", "author": "Brooke S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "Let me just preface my review of Californios with the face that I haven't written a Yelp review in over 7+ years, but I definitely use it (and Foursquare and SF Eater) to reference any restaurant that I'm down to try. So writing this review for Californios actually means a lot to me, and here's why:\n\nThe head chef Val and sous chef Joseph have been long time pals, working together in their days at Sons & Daughter, which I coincidentally had tried for the first time two weeks ago. Let me just say, Sons & Daughter has nothing on Californios. Nothing. Californios had a soft opening back in Dec '14, and was officially opened earlier this year in January. I can't fit my entire review here due to character limitations, but if anything, you MUST come here.\n\nThe place seats about 10 folks at the Chef's counter (I ALWAYS recommend folks to sit at the counter if at all possible. It gives you the full experience of seeing how your food is prepped and gives you a chance to chat with the chefs behind it all), and a few tables that seat maybe a little over 20. From the outside, Californios is unassuming and would probably easily walk past its frosted filmed windows on 22nd, and it's unique restaurant sign out front. \n\nWhen you walk into the restaurant, the look and feel of the place has lots of black and white tones with glassware stored in a bookshelf to the left, right by the Chef's counter.\n\nThe dining experience is through a pre-fixe menu and I highly recommend that you do this with their wine & beer pairing (trust me, you'll thanks me for it when you get to the potato dish in your meal). It's pretty much a seasonal menu of items that the chefs find during their forage or of things that interest them and, honestly, I feel like Val's passion for food could not come in a more playful and eclectic way than through this tasting menu. Oh, and FYI, I had dinner here last night, and I'm still daydreaming about the experience.\n\nSo for starters, I tried the Sangria and Margarita drinks with a friend I was with. The sangria was something new that Chef Val said they were trying and it was spankin' delicious. With it being strawberry season, the sangria definitely was infused with strawberries and apples and oranges and some pineapples I think. The taste was delicious and definitely one of the sweeter red sangrias I've had, but the smell! Oh, it was so fragrant and fresh -- it was like eating strawberries but through your nose. Haha, I don't know how else to describe that in a more eloquent way. \n\nFirst dishes were 4 small bites: oysters with green tomato sauce and a small little radish on top, yuca(?) taquito stuffed with goat cheese and topped with trout roe, then a corn puff with creme fraiche and pureed black beans and something else I believe, topped with a bit of caviar and a purple flower for garnish, and then a plate of two slices of Buri sashimi (young yellowtail - this one happened to be a 3 year old yellowtail) that was garnished with EVOO and two thinly sliced serranos; it tasted something like a combo of fish sauce and tamarind (these were not the ingredients in them, but it was a really good mix of flavors). \n\nThoughts on oysters: Totally thought they'd be regular oysters at first bite, and then the more you savor it, the more it just melts in your mouth and tastes like butter. It's definitely meatier than any other oysters I've had and it pairs so perfectly with the 2014 Scholium Project Blowout sparkling wine. \nThoughts on taquito: I told the chef this and the girls who were sitting next to me at the chef's counter and I'll tell you all: I wish I had a big, gigantic plate of these. These were so, so, so good. Like curl my toes, I-wish-my-mom-made-this-for-me, good. \nThoughts on corn puff: Tasty and delicious. Creme Fraiche goes a long way.\nThoughts on Buri: So, disclaimer, I love yellowtail. It's one of my favorite types of fish, especially since my go-to at most sushi places is Hamachi. And Chef Val does wonders to this dish. The dish takes on this aromatic serrano smell, but without the heat when eaten. It's magical!\n\nThen there was an ice dish. Think of it as like your childhood shaved ice dessert, but this is more of a tart, palate-cleansing type. The ice on top is of a strawberry & rubharb ice, and then there's a kiwi hielo at the bottom, all topped with a bit of minced basil and, what they don't tell you: pop rocks. It's such a surprise for your palate and brings you right back to childhood memories. I don't think I've had so much fun eating and enjoying what I was eating until last night. \n\nAfter the 4 small bites, there was potato dish where it was basically potato done in three ways: pureed, boild and fried. So basically imagine it like a bowl with a creamier, smoother version of really good mashed potatoes, with a small fingerling potato in the middle, topped with a housemade potato chip on top, and around the outside ring of that mashed potato there's some amazing chipotle sauce.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Second time around, and it was just as awesome.  The first time we were pretty blown away by the creativity and quality of the food along with the super reasonable price. Though the price has gone up, it's still totally worth it ($98 for 12 courses + lots of extras). \n\nBonus: if you buy a bottle, they'll waive corkage on one bottle.  They're still beer and wine only.  They started us with a sparkling wine that wasn't quite a sparkling rose, and it was nice to start. \n\nFood:\n1. Agua Fresca with basil, jicama, cucumber, celery, fennel. Light and refreshing, not particularly sweet \n2. Squid ink tostada: one of the memorable dishes from last time.  With sautéed Monterey squid, serranos, and house made guacamole\n3. Sope: a black bean and chickpea fritter topped with smoked cotija, trout roe, and watermelon radish \n4. Sterling white sturgeon caviar on super sweet scallop crudo (marinated in a chile citrus broth)\n5. Sorbet: refreshing and citrusy. It was made of mandarin orange and jicama, topped with chia seeds, pea sprouts, and jicama slices \n6. Yerba buena fruit cup: a traditional chili pepper-lime juice-lemon juice marinade over local greens, fruits, and vegetables \n7. Frijoles: three types of beans including cranberry beans and white beans. The textures and flavors were so rich and hearty you can't believe it's vegetarian. I don't even like beans, but this was my favorite dish \n8. Green onion and cilantro sourdough: house made, with Strauss butter \n9. Lobster soup: caldo with lobster, Chinese celery (a thinner, more flavorful type), and Mexican cucumber \n10. Menudo: Amazing! Hen of the wood mushrooms and piccini mushrooms, goat cheese, and *drumroll...\" fried tripe. This makes tripe so much more appealing\n11. Grilled sword fish: seared on one side, served with a ginger habanero sauce, fried leeks, acorn squash, and habaneros\n12. Squab broth: with chipotle pepper and huckleberries - super fragrant. It's a tease for the next course\n13. Roasted squab: grilled and smoked, with persimmon mole and goose berries \n14. Fermented sourdough biscuits: flaky, not dry, very flavorful\n15. Masa tamale: with Hudson valley foie and cherries\n16. Arroz con leche: with poached apple, candied almond, and horchata - way more interesting than regular rice pudding \n17. Goats milk sorbet with cocoa and caramel: surprisingly light, a bit tangy, really good \n18. Calabasa pine nut and ginger crisp: lots of textures, a great way to end\n19. Final bite: a thin mini crust with a white chocolate bonbon\n\nService was friendly but not intrusive.  Again, each course was impressive and kept us excited for the next.  I can't wait to come back.", "author": "Marilyn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "AMAZING! Ended up being close to 16 courses... They say its 12, but you get a few other snacks along the way. \n\nGot the drink pairing (I think $65?), which was mostly white wines. Don't think i'll get that next time.\n\nPricey, but worth it.", "author": "Greg E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "Californios is a truly stand out dining experience in the Mission. It's a small, intimate space with impeccable service - some of the best I've had. These people really know how to make someone feel welcome. The tasting menu is about 8 courses, and you absolutely have to do the wine paring. I found some new favorites here. I don't often review but was prompted to get on yelp and give this a full 5 star review. Delicious.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-06", "description": "A very good experience at Californios...\n\nThrough my palette, I enjoyed a culinary journey with about 9-10 courses...\n\nThe stand-outs for me were the following:\n-\"Chips and Salsa\" - a single, gourmet chip with a surprise of roe \n-Intermezzo - Kiwi granita with Pop-Rocks...subtley sweet with a surprise, this was great for cleansing the palette\n-Fish, which was prepared in a ceviche-style, with bright and vibrant flavors.\n-Potatoes-Three-Ways: Potato puree, with a baked potato and then topped off with a potato chip   \n-Duck and Fennel Salad - the duck had a fantastic flavor, more like beef and definitely the best duck I've ever had in my life (that's coming from someone who doesn't even like duck!).  The bright flavors from the fennel was a balance to the richness of the meat.\n-\"Bread and Butter\" - this was a \"sour tortilla\", which was almost like a griddle cake with good flavor from the char...the house-made butter was very good.\n-Dessert - we had three courses of desserts:\n                First course:  Hazelnut Flan with Goats Milk Foam and Seasonal Citrus - I really liked this since it was almost like a palate cleanser with its smoothness and subtle flavors along with fresh touches from the fruit.\n                Second course: Foie Gras Ice Cream - wow!  So amazing - this was rich and decadent with perfect texture...it was perfectly sweet and the bit of chocolate sauce added a hint of additional richness and earthiness to the flavor...a caramelized banana piece also completed the dish.\n                Third course:  A plate of Dulce: 2 Coconut Cookies, 2 Mango Gelee, 2 White Chocolate Caramels - everything was very good and well done.\n\nI really appreciated the thought that went into each plate, whether I liked it or not.  There was a course of oysters, which I'm not a fan of (but I assume if you love oysters, you may love it) and there was a course of chicken soup with pomegranate that I really didn't like...the texture was a bit tough and seemed as if it were raw.\n\nOverall, I enjoyed my experience here and would visit again.  Considering the tasting menu was a bargain compared to most others, it was another reason to enjoy this place.\n\nThe customer service was excellent!", "author": "Ken G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "16 courses + wine pairing = 3 hour dining extravaganza. Ambience was great, service was very good. Overall I really enjoyed the food, particularly the abalone, the puree soup (forgot exactly what was in it) and the desserts. So why not 5 stars? Luck of the draw, our last savory dish was duck. I'm just not a fan of duck. The wine pairing was OK, too much white (only 1 red pinot at the end). Was expecting a little more balance between white/red. Maybe luck of the draw again, since another night might have seen more meaty dishes that would have seen one more red? Finally, I wished the printed menu they gave us at the end was more detailed with the dishes.", "author": "Tinou B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Man this place blew us away. My wife and i went here for our anniversary. Food was out of this world, but more than that was the whole experience. Beautifully designed small space. Very creative plating, and great wine pairing. But the place was not stuffy and uncomfortable like other restaurants on this level. Seemed like majority of the food was locally sourced and staff was very attentive and knowledgeable. Will definitely be back next time we are in SF!", "author": "Philip N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "The atmosphere in this restaurant is extremely pleasant. We have been delighted by the food and the creativity of the Chef. \nCalifornios has adapted the menu for my guest who is pescatarian and we really didn't feel it was a last minute veggie dish thrown just to fit a particular diet as it can be done in other restaurants of this rank.\n\nI didn't give 5 out 5 as I was slightly disappointed by the wine pairing even though there were some nice wine to discover but maybe I was expected another caliber for such a great tasting menu.\n\nOverall it was an amazing experience that I hope to renew very soon!", "author": "Skander L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "Who could possibly give this place less than 5 stars? One of the sublime dining experiences of my life. The amazing tastes and aromas..the superb wine pairing...the impeccable but down to earth service. Worth every penny and then some. I'll be thinking about my evening at Californios often when I'm back home in Massachusios", "author": "Moe B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "Food was unbeatable, also the service.  Recommend to go with wine paring to have the full experience.", "author": "Yang H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-04", "description": "Love the concept of this venue; cozy, dark interior but nice decor, very comfortable, not too noisy and great vibe. I recommend requesting the counter seats on the other side of the open kitchen; definitely enhances the experience watching the chefs preparing the cuisine in front of you (and the chefs as well as the front-of-the-house staff were quite personable). \n\nThe food however appeared to be a bit of a work in progress - not bad by any means, we enjoyed all but a couple courses, just not much that wowed us compared to other Michelin starred venues in this approximate price range. Dinner consists of a tasting menu and runs just under $100 per/person before tax/gratuity; elevated, creative, interesting modern Mexican cuisine with a farm-to-table emphasis. With some notice the restaurant will accommodate reasonable allergies and even aversions. The best dish was the final savory - a delicious smokey tasting squab; truly showed the Chef's style of cuisine and his skill. The meal consisted of approximately a dozen courses and was a bit heavier than we expected with several of the courses being large for an extended tasting menu. Despite being a vegetable-centric menu, some of the courses were quite rich (especially the fish course where butter overwhelmed all other flavors). A couple courses are paired with some delicious homemade bread (different style of bread for each of these courses). You definitely receive a lot of bang for your buck and I recommend arriving hungry! \n\nDesserts were the weakest with the main dessert being cloyingly sweet and the components better when eaten separate than together. I opted for the wine pairing here (only $65); really generous pours (left quite a bit of wine which is unusual for me) but unfortunately I was not impressed by the wines. Most were decent, but none tasted great on their own and the only pairing that worked excellent when consumed with the course interestingly was a beer pairing; a wonderful Saison paired with a spicy soup and really enhanced one another. All but one wine was a white and the sole red wine a Pinot - I tend to prefer reds (and especially big, bold reds) so that was a bit disappointing, but more a personal preference than necessarily a ding on the restaurant. \n\nService is relaxed, warm and friendly; Chef Cantu, his wife, and sister-in-law all own the restaurant and Chef's wife and sister run the front-of-the-house and the beverage program while he leads the kitchen. We were warmly greeted when we arrived and well cared for throughout. Instead of a primary server, expect to interact with the entire staff at some point during the course of the evening - even the chefs serve and present some of the courses. The only pitfall of this style of service is sometimes there can be miscommunication (i.e. I have an aversion to dessert wine that I expressed while ordering the wine pairing and arranged for an alternative beverage, however this was not relayed to the staff member who brought my pairing for dessert - though it was quickly remedied). Pacing was perfect; just enough time between courses to relax and sip some wine before the next course arrives - amazing how efficient they are with a tiny kitchen and small staff factoring in the complexity of the food and number of courses!\n\nCalifornios has a fantastic concept, wonderful people and features interesting (mostly good) cuisine - while I feel it has a bit of work left in order to ascend to an upper echelon restaurant there is tons of potential. A meal here is not just a dinner out, but a true dining experience.", "author": "Erick N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Lovely local neighborhood gem. Terrific service. Creative and delicious food. Loved every minute.", "author": "John C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-01", "description": "Dear Californios, I know you're new, but shorting someone in your wine pours every single time is not ok. Came here in a group of three, we all did the wine pairing. Strangely enough every single pour was uneven, and my glass was significantly less full than all the others. Is it because I'm a girl? Is it because I'm Asian? Whatever it is, you should probably stop doing it. Also, your pea tendrils dish was so salty none of us could finish it, and I know that your medium rare lamb shouldn't be served hot, but it certainly shouldn't be served cold. All that said, your horchata ice cream dessert is probably the best dessert I've ever had in my entire life, so at least you've got that going for you.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Pricey, hard to find, hard to get a table, and worth every bit of it!  This is the best meal I've ever had.  The food was incredible, the service was attentive and not too formal, and the limited seating meant that we weren't crammed in with other diners.  They did a great job working with my wife's dietary restrictions.  The only complaint we have is that we can't afford to eat here every night.", "author": "Eli L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "just a quick review.\n\nsince when you go the menu might be totally different and to be honest i can't remember all 12 items of the tasting menu that were served so i won't go into specifics. what i can remember is how great the whole experience was, the food, wine pairings, service, ambiance. its a pleasure to be on the receiving end of a commitment to excellence.  \n\nthis was our second time dining at californios and it definitely won't be our last.", "author": "Sanil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "Incredible first class dinning experience!!!  Everything we ate plus the wine pairings where delicious and so unexpected.  \n\nChef Val is truly talented and a major star in the culinary world!\n\nThe restaurant is beautiful and the staff were professional and very attentive.  My advise is book it soon before it's impossible to get a reservation!\n\nParking is hard to fine but certainly worth it.", "author": "R B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "I had one of the best meals of my life at Californios. Spectacular, inventive food, perfect pairings, lovely service, and a beautiful room. If I were made of money, I'd be here every week. All things considered, Californios is actually kind of a bargain, especially when compared to other top menus in town.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "We had an absolutely amazing experience at Californios last night. Chef Val Cantu and his team bring a beautiful contemporary interpretation of Alta and Baja california cuisine, with technical mastery, subtlety and minimalism.\n\nThe service was amazing too, from the Maitre D's warm tone in describing the dishes, the engaging sommelier that helped us make an excellent wine choice, and the finesse and rhythm of the staff.\n\nThere is no doubt that Californios will impose itself as one of the best restaurants of its kind.", "author": "A G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "Mom and daughter night a Californios was a meal that we'll remember for years to come.  A testament to the inventive, playful and aromatic cuisine of Chef Val and his team along with the sublime wine pairings by Charlotte and truly gracious service executed by the front of the house.  To captivate an 18-year old throughout an eight-course tasting menu is a feat in itself.  Thank you!", "author": "Deborah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "Food at Californios was spectacular-each dish was a taste treat-\nThe staff was as good as the food-they couldn't have been nicer or more efficient\nThis is an amazing eating delight", "author": "judith f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "Inventive, fun, delicious!\nI was SO in-the-moment, that I don't have a clear picture of all the plates. All I know is that I loved every second of the experience and am still full almost 24 hours later. \n\nJust try this place! We did the tasting menu with the wine pairing. Everything was fantastic. It was a great way to celebrate an anniversary. :)", "author": "Jaime M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-04", "description": "We ate there last night and first of all the place is beautiful! We have heard such wonderful things about the pop ups we wanted to give it a try! First.... We were under the impression that this concept was going to be Mexican food. Sadly it's not, it's better described as moderne California cuisine. \n\nIn San Francisco it's common practice for most of the restaurants to cross over to other cultures to complete a dish and/or to give the dish a modern twist by adding in an ingredient such as a chile or fish sauce, however the essence of each of these dishes at Californios had more modern technique as the center peice than the flavors and soul of Mexican cuisine. We are both from Latin America and one of us is from Mexico. Yes, there are some chile peppers on the kampachi and lengua as the place of beef, three black bean dots,  mexican wedding cookies at the end of the meal (which were delicious! and the only thing with the heart and soul of Mexico)...but we were hoping for a breath of fresh air with a homage to Mexican cuisine..but instead I think we got a lower version of Commis in the mission district. \n\nThe food plating is impeccable and the flavors are great but the Second let down of the meal was the portion size. I love the chef's tasting menu concept:  to try what the chef believes is important to eat at a given moment durning a particular season ...but the literal meaning of tasting is ridiculous. We've just eaten at 11 Madison park and there too ordered the tasting menu.....huge difference! Look at the pictures posted previously and you can see the lengua & dessert off set on a plate. The plate is not oversized but about average. \n\nI would recommend this place for a light modern meal with great wines and beautiful atosmphere. The music sounds like it came from someone's iPod and the service is great. All in all, another hipster joint in the mission.", "author": "maria a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "Very different take on mexican cuisine. The staff was excellent and the wine pairing was the highlight of the experience.", "author": "Miles T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "This place is destined to get a Michelin star. Incredible flavors, beautiful presentation, and excellent service. Just wow. It's now my top recommendation to guests who want to splurge.", "author": "Jeremiah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "Hands down, in my top 5 restaurants for SF.\n\nI love everything about Californios. The ambiance, the FOOD, the hospitality, the bathroom!- it's evident that Chef Val and team put careful thought and consideration into all that they do.\n\nMy boyfriend and I sat at the Chef's counter and it was a wonderful dining experience because it's very inclusive. Chef Val talked to us, explained where he sources his food from, etc. I truly felt like we were in his home, \"mi casa es su casa\" style. \n\nIt goes without saying that the food is delicious. But what separates Californios for me is the fact that when you dine here, you truly are getting an *experience*.", "author": "Stephanie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-26", "description": "I am truly on the fence about this place. On the one hand, everything we got was tasty... on the other, it wasn't so fantastic that I'm planning another trip unlike other tasting menus in the city that I can't wait to get back to again.\n\nOverall, it was a good night.  The ambience is nice.  The staff is truly friendly.  The sommelier was the best of the lot - very informative, professional, and made some interesting pairings.  We really enjoyed the wines and her service.  Our main waitress was very nice, though felt somewhat unprofessional and too casual for this place.  The dishes were mostly described by the kitchen staff who brought them out, and it was always clear for us what the dishes were, unlike some comments here.\n\nThe food was very good and beautifully plated, and while I enjoyed it, there wasn't really one dish that made me feel that I must have it again... the soup likely came closest. The tongue was interesting and I love mole so liked the seasoning of it, but still not likely something I'd feel the need to come back for (neither does it make me want to come back to see what the chef will do next). The dishes were exactly as described by others and pictured so I won't describe each in detail, but unlike some here, I just wasn't wowed. In addition, though I rarely rate a place on quantity as I think restaurant portions are absurdly huge, because this was a 6 course tasting menu, I had eaten light that day, as I do whenever I do a tasting menu because I want to make sure I do not get too full and miss the opportunity to enjoy the full \"x\"-course meal.  This is the only time I have left a tasting menu not feeling completely full.  That isn't necessarily a bad thing, as I stated, I don't like feeling stuffed or wasting my money paying for too-large portion sizes. However, I just wasn't fully satisfied after this meal.  I think that was probably a combination of the portions and partly just not feeling really satisfied palate-wise.  Maybe my expectations were just too high after the media build-up.\n\nRe cost: It is a good price for a tasting menu in the city - $57 + another $35 for the wine pairings, gratuity is added on automatically at 18%.", "author": "Kathryn E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "Delicious meal! I walked out STUFFED because I couldn't resist any of it. I had to eat every last bite even though I was stuffed before the 2 entree dishes and the 2 desserts. Two desserts! Plus little sweet nibbles which were amazing.\n\nI went with a friend on Cinco de Mayo and had the sangria. Not sure if it's a permanent option or just a festive addition but it was the best sangria either of us had ever had - full of strawberry and grilled pineapple flavor. We sat at the bar and the chefs are true artists. They are very friendly and open to questions about their dishes. They forage!\n\nI can't say I remember what I ate but I literally ate every thing they gave me. Completely. Each dish was meticulously and beautifully plated. Flavors were incredible with different textures.\n\nService was excellence and agree with the prediction that this place is destined for a Michelin star. My friend said it was the best meal she's ever eaten! It's definitely in my top list but I was too much in a food coma to think straight.\nWould highly recommend!", "author": "K C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-12", "description": "They don't give you a menu and then pass off tongue as if it's regular beef. Avoid at all cost.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "After the 3rd course I told my wife that by the end of the night I predicted I would think they were cheated of a second Michelin star. After the meal I said \"yep\". Truly wonderful take on Mexican food elevated to fine dining.", "author": "Ray T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-10", "description": "I had a very good meal at Californios but overall and given the expectations that a 1 star Michelin can bring, the experience was very underwhelming. \n\nIngredients were excellent, and plates look very good, and overall each meal was enjoyable. But it fell a bit short in terms of creativity. With a Michelin star restaurant I want to be wowed at every tasting. In comparison, I can still remember every dish I had at Coi and that was 6 years ago, this was really a memorable dining experience.\n\nService: very good, not too pretentious.\nAtmosphere: Ok, good decoration/design but I was cold and I'm not sure about hip hop music in this context.\nQuality of ingredients: top notch, each of them was tasty\nPlating: very nice\nWine pairing: I didn't drink but my husband really enjoyed it.\nMeals: underwhelming: \n       Appetizers: I can have a tortilla with Oaxaca cheese and chanterelles at home, that was not a very good start\n       I think there is more to Mexican food than cilantro, beans and lime. I was expecting way more \"risky\" and truly Mexican flavors in each dish. Again each dish was very good, but at $600 total bill I want to \"feel\" things I haven't felt before, while being brought down to memory lane (I used to live in Mexico)\n    The beef itself was an amazing piece of beef, probably the best I have ever tasted, but why ruining it by putting too much salt on it?\n   The poached salmon on its was great, but the dish overall was underwhelming especially in terms of texture, I was expecting some crunchiness somewhere to counteract the smoothness and tenderness of the salmon\n   The fruit salad was very underwhelming too, ok \"17 ingredients in it\" (quoting the waitress), but this is not a contest. I can have berries and cantaloupe every day with chile flakes on it.\n    The bean dish with caviar was probably the best for me, a bit more creative and \"fireworks\" in your mouth sorta dish.\n\nIn summary, enjoyable meal overall, but not worth the price/hype/Michelin star in my opinion. \nI really like the concept but there is work to be done. Some up scale restaurants in Mexico City do a much better job at finding very interesting combinations of \"only in Mexico\" ingredients.", "author": "Alice Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Best place in term of food, ambience, and service. Very well thought out menu that took us on a journey of new discovery. Our 2nd time and was as amazing as the 1st time.", "author": "Trevor T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "Amazing food and an amazing experience. Great for a special date. They provide a set menu of many tasty courses and prepare each item right in front of you. Sit at the counter to get the best view of the kitchen.", "author": "M Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "Exquisite. This is hands-down the best tasting menu we've experienced from NYC, London, to SF- amazing flavors and spot-on wine pairings. Service was fantastic and the sommelier was so knowledgable. Very cool modern decor & ambiance. Highly recommend.", "author": "S R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "Great dining experience! Started by a nice greet at the door. Great small bites to get the palette going!!! No menu, it's setup ahead of time. The wine pairing was amazingly done! The food was full of flavor. Salmon was least favorite. Overall I would highly recommend!!!!", "author": "Corina E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "Wow!  What an unexpected and wonderful experience. Food, wine and service were impeccable.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "Best food, wine, and service I have ever had. First off the food is beautiful, elegant, and tastes amazing. the ambiance is romantic and sweet. I love the lighting, it just makes me feel cozy and comfortable. The food tastes amazing and is something I've never tasted before. The wine paired with each dish was honestly to die for. the girl who explains the wine is amazing at explaining the taste and history of the wine its just so good! the host is sweet, she will help you take your coat off and help you put it back on. shes always checking up on you and making sure everything is okay. I love the idea that they give you a menu at the end of dinner rather then before. the chefs behind the bar seemed to work really well together and it really shows on the food they serve.  The restaurant is definitely not Mexican food BUT Mexican food inspired. In my opinion i think they are doing a great job at getting the Mexican flavors in and i cant wait to go back again.", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-23", "description": "Cool concept and the food was delicious. Inventive dishes with great flavors. I thought the poached salmon dish was the  of the best salmon dishes I've ever had. \nI get that they are trying something new with the no menu, no ordering thing but we would have preferred a little flexibility. 11 courses was just a bit too much for us. After 7 or 8 courses we just sort of wanted it to be over, even though we were enjoying the food.  \nService was ok. No major flaws but was a little more casual than we were expecting. \nSpace was really cool but the restaurant was empty when we were there-- so the vibe was a little weird. First time I have eaten in an empty restaurant in while and it just felt kind of odd, especially when you're there for 3 hours or so. \nOverall the food was great but at over $400 for two people for food + wine we don't have a desire to return. If they switch to a more traditional set up would like to go back and enjoy the chefs food.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "Absolutely fantastic in every regard. Food, decor, service, wine list (Pinot from Sta. Rita Hills - yum!). Even the noise level was perfect - so many restaurants are way too loud these days. Among the very best restaurant experiences of my life - seriously.", "author": "Cooper M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-10", "description": "Starting on a good note: wine choices were good; desserts were tasty and interesting.  \nThe rest was very under-whelming.  And Mexican?!  hardly.  I can think of so many ways that they could've created cool, modern Mexican cuisine ...and they didn't.  Was the only restaurant meal that I've ever had where I was craving a taco or hamburger afterwards!", "author": "Deanne D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "My partner was celebrating a birthday and I wanted to treat him to a special dinner. Originally I had booked at one of the classic top dining destinations in the city but as the day drew closer I thought it might be fun to try a new place. In the end this was a good instinct as he (and I) were extremely pleased about almost every aspect of our experience at Californios. \n\nTo be honest the evening did not get off to an auspicious start. We arrived by car on a Saturday night at 8pm and finding a parking spot was time-consuming and stressful. We called the restaurant and they gave us a few suggestions but we definitely wished we'd taken an Uber. Once inside, seated on the gorgeous caramel-colored leather banquette we ordered the tasting menu with wine pairing and the evening was smooth sailing from there on out.\n\nThe space is intimate but warm and sophisticated at the same time. The service is personal yet not intrusive. The place is run by a husband and wife chef/front of house team along with the wife's sister who has chosen the exquisite wine list. The food was a parade of small plates with a Mexican theme but very contemporary and Californian. It changes according to what's in the market so I won't go into detail about each course. Suffice it to say it was all delicious and very fairly priced. I think they are barely breaking even on the wine pairing.\n\nMy final word: eat here soon. The prices are bound to increase and it's anyone's guess if they can maintain these high standards. We had a wonderful evening and recommend the restaurant very highly.", "author": "S. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "Omg this place is amazing! My husband and I have been lucky enough to live in Paris and enjoy great eateries such as Chateaubriand and Frenchie.. This place shares the same ambience and passion as both of these. We had the opportunity to sit at the chefs table and watch the chefs assemble great dishes right before our eyes. The whole team is impeccable, it is a small group of young professionals,  driven and humble, giving it 110%. AMAZING!", "author": "Daria M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "I can't say enough good things about our experience here. the food was fantastic - just consistently excellent. and the service was arguably even better. go. get the pairing. do it now.", "author": "Erica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "Wow this is the Best restaurant I can recommend to all my friends and visitors ,food , service is superb..its a very good price Pre-Fixe dnner plus Wine paring ...incredible price. You cant beat  the price for a fine dining experience in San Francisco ...amazing....it s a wonderful experience to have considering that most Top Michelin Restaurant are enormously expensive but this one is just unbelievable ...very affordable I highly recommend it to all my friends and family.", "author": "Clarence S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "wow, Val and team really REPRESENTED. The tasting menu subtly built upon itself. As simple as some of the items may have been, the magic was found in the details. He really makes flavors go a long way. The service was perfect and everyone was very knowledgeable which is extremely important in good table service. I recommend Californios to everyone.", "author": "Liz B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "A wonderful experience.  From the moment you step through the doors you know you are in for a treat.  The room is elegant, lounge, and hip.  The seating very comfortable and offers room to breathe, relax and take your surroundings.  The surprisingly calm open kitchen, the Wes Anderson Book, the conceptual modern art all of these remind you to pause, reflect and open your senses.  The whole experience challenges you to move away from the rush and engage in the moment.  It is akin to a rabbit hole that invites you to partake in a Mexican meal that is highly conceptual and very delicious.  \n\nOur meal began with a reimagined nacho.  You might be saying to yourself that \"nachos aren't really Mexican\", and you would be 100% correct.  By placing the nachos up front in his tasting menu chef Cantu is letting you know that he's thinking about the flavors of Mexican cuisine.  He is not confining himself to the expected.  He raises your hopes that he will engage your senses, emotions *and* intellect.\n\nThere is always a risk that the intellect will overtake the emotional and sensual.  On the night we were there, watching as the balancing act played out from course to course was exhilarating and almost entirely successful.\n\nChef Cantu is a man to watch and his Californios is a Mexican restaurant unlike any other in the Bay Area.\n\nThis is a must go.  Get there before the crowd does and get in before the buzz.", "author": "S S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "What an amazing dining experience!  I could go into all of the wonderful things about this place, but truthfully it's an experience that you should have for yourself.  This is a complete dining experience.  The food was wonderful, the service, the decor, a wonderful meal meant to take your time and enjoy.  I feel like today, so many people eat and run - people are so busy photographing their food rather than tasting it and enjoying it.  At Californios you feel like you are having a private dinner party- enjoying your food, your wine and your company. If you don't want to take the time to sit back and relax and take it all in - this place might not be for you, but you will absolutely be missing out!  BRAVO Californios team! I will be back and I will recommend to my friends and family.  A new SF restaurant not to be missed.", "author": "Teri A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "We had an amazing dinner there. This place is wonderful--a great, intimate setting, delicious inventive food with great wine pairings (definitely get the wine pairing with your tasting menu!), but the real standout was the amazing service. Nathan not only took great care of us while we were there, but when he heard we were visiting from Boston, he gave us two written itineraries of things to do with restaurant recommendations etc. Above and beyond on all fronts!", "author": "Abby B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Food and wine pairing were both excellent. Definitely a different and good experience with the Mexican twist, creative and surprisingly delicious. Only downside is the room/ambiance isn't great. But the food and wine are worth coming back for.", "author": "Amjad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "Amazing service. Great food. Could not have had a better experience. Loved every single dish except the \"main dish\". I thought that one was a bit bland. Overall, had an amazing night.", "author": "Pramod D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-04", "description": "Without question the best meal I've ever had!\n\nFOOD\nUnlike other fine dining experiences I've had in SF every dish here was something special and was incredibly well executed. There's not a single dish that I wouldn't have again in a heartbeat. The meal was roughly 2 hours but well-paced and if anything a bit faster than I would have wanted.\n\nIt's hard to pick favourites but a few things really stood out: charcoal roasted asparagus with celery root pudding, chicken soup with blueberries (!!), halibut with green radish, pico de gallo, avocado puree and the fermented tortilla with house butter.\n\nATMOSPHERE\nWe ended up sitting at the chef's counter which was a lot of fun. The chefs were very personable and engaged with us throughout the night. They even indulged me in questions about how they prepared their halibut!\n\nSERVICE\nThe service was very good overall, especially for a new restaurant, although the host was a bit awkward and our waiter seemed disappointed that we only decided to have one glass of wine and not take the pairing.\n\nWhile it may be a bit pricey at $75 for the tasting menu it's a huge bargain for the level at which this restaurant is operating. I would strongly recommend coming here before prices go up and they get their inevitable Michelin star.", "author": "Gavin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "I'd really like to give 3.5 stars, but I'll err on the high side.\n\nFirst the pluses:\nFood was great\nService was great\nExperience was great (we were there for almost 3 hours)\n\nMy one drawback which we keep me from recommending this place (unless I heavily caveated on the following):\nThe portions were ridiculously small\n\nI get being inventive, I get fine dining, I get highlighting textures and flavors, etc., but one course had a single head of asparagus, another had 1 chip, another had 1 small potatoe.  The duck was fantastic.  Too bad it was 3 small bites (and I was cutting the pieces small to stretch out the food).\n\nI think the chef felt sorry for us (2 guys) and sent over an extra sourdough tortilla for us (which was excellent by the way) because we had tore into the one they had brought.\n\nIn the end, and in keeping with the Mexican theme, we got a mexican hotdog on the corner of Mission and 22nd after we had left the restaurant.  Delicious...", "author": "Dan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "Came on Valentine's Day and had a fantastic experience. Highlights were the foie gras ice cream and the hamachi...even the \"chips and salsa\" were great. Nothing truly knocked our socks off, but it was really good.", "author": "Dan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "This is a SF treasure!   The restaurant is tiny which allows an intimate evening of fine dining.   You can actually hear and carry on a conversation.  The food was innovative and delicious....You will not leave this restaurant hungry.   The service was outstanding and the sommelier was very helpful and knowledgeable.", "author": "Alice L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "Definitely one of the best-tasting, most creative and -- thanks to the great service and ambiance -- most genuinely enjoyable meals my wife and I have ever had in SF, comparable in our experience only to Sons and Daughters. Thank you to the team at Californios for making our evening so special.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "We chose the chef's selection, and I think I'll do that every time.  Each part of the meal that came out was inspired, fresh, and well, basically amazing!  We also had the wine pairing which was perfect for each course.  They were (I think 4) full pours, so I think I might share it next time with my husband.  The staff is all very knowledgable but not pretentious at all.  All in all, I can't wait to come back!", "author": "Mary K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-04", "description": "Yes I agree it's not Mexican food and a little pricey for the food you get. I probably will not eat there again.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "My husband & I really liked this place. There were some lovely dishes and flavor combinations.  I have a hard time calling this place a Mexican restaurant though since many of the techniques were decidedly Japanese or more reminiscent of European haute cuisine.  But regardless of what you label Californios, it's a great addition to the SF food scene.  I love the fact that the bill is \"all-in\" as well.", "author": "Missy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "I guess I could be a purist and never give 5 stars to any place, but if a restaurant deserves 5 stars, this is certainly among them.  Note that this is definitely a \"foodie\" place so don't take your friends there who are not into finely prepared and beautifully executed tasting menus, with small bites of outrageusly good food.  I would not know how to describe all the different dishes and their flavors but let's just say that the celery granita had pomengranite seeds that burst in your mouth along with \"pop rocks\"....and it was heavenly!  A beautiful piece of Muscovy duck that trumps most steaks you have had.  A delicious foie gras ice cream that most people would love if they did not know that foie gras was in the preparation.  And the menu changes every night but takes inspiration from Mexican cooking, although you will not recognize this as any Mexican food you know.  The wine pairing was only $35 (it says $45 online) and well worth it!  Definitely take Lyft Line there since parking is difficult.", "author": "James T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-17", "description": "While the dishes were technically executed well, the progression of the meal was confusing and erratic leaving us somewhat disappointed. Michael Bauer was accurate. In describing an overall lack of passion for the food.", "author": "Anne M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "I was blown away by our recent visit.  Both the food and service were exceptional.  The chef does some nice twists on both traditional and lesser-known Mexican dishes.  We did the pairings with dinner and each one was terrific.  Although small, the space itself has a great vibe.  I also really liked the music being played, whoever created that playlist is a genius.", "author": "Erik K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Excellent.  Run.  Don't walk here.  I may regret saying this since it will only get more difficult to get in to the wonderful restaurant.  The food, service, execution, decor, and wine pairing were amazing.  I am so impressed with this group of Chefs, servers and wine professionals.   The night was truly flawless.  It's fairly  priced for the quality of food and great wines on the menu.   This experience far surpassed my meals at French laundry, benu or Michael Mina.   The chef was right in front of me and his very talented and hard working team pulled off a spectacular meal.   Congratulations and I can't wait to return.", "author": "JEFF B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "I don't usually write reviews unless I have an exceptional experience. Californios is a gem of a restaurant. The food was nothing short of art and every dish surpassed expectations. It is an intimate experience that is sure to please. The wine was perfectly paired with every course. If you haven't been already, go as soon as possible.", "author": "Hugh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "Great food with an awesome atmosphere. The chefs have big name credentials (Sons & Daughters, Noma) and the food takes a unique and surprising turn throughout the tasting. You'll be blown away by each course, and the wine paring was an excellent addition. We'll be back again soon - thank you!", "author": "Sean M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "Great tasting menu with a very interesting wine/beer pairing. The beer was delicous and the menu offered was unique. It was a good experience and great service. My favorite was the dessert and the atmosphere.", "author": "M. F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "Bravo to this creative, original and artistic group of chefs led by Chef Cantu for this gastronomic experience! Courteous and professional service too! The bites of food were each a burst of deliciousness, surprising, refined and unique. Everything was extremely clean, well-executed with attention to detail. My favorites were the amazingly flavorful and complex smokey refreshing hamachi with a touch of heat, the chicken consomme with juicy bursts of pomegranate, the \"who knew potatoes could taste so fantastic\" soft potatoes, and the succulent, rich duck  breast savory reduction with pickled fennel. The desserts were interesting and super refined and delicate. The ONLY downside was we were still hungry (we are women with normal appetites) after the meal. We would like this restaurant to succeed and urge them to increase the portions just a tad. For $75/person + wine you should not leave hungry! With this critical change, this restaurant will please anyone who decides to spend their evening here and a 5-star experience.", "author": "Hwei-Chen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "We were a part of 6 celebrating some shared birthdays.  We were greeted at the door with complementary sparkling wine and it set a tone of exceptional service throughout the evening.  The food was wonderful;; creative and prepared with such nuanced care.  All 8 dishes were different from one another and quite novel.  A terrific experience and great value for the quality and care of both food and service.", "author": "Milton S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "We were all set to absolutely love this restaurant.  The ambience, spot on.  The service, dead to rights.  And the first three courses, perfect:  the play on tortillas light and airy with a bit of caviar; the citrus ice with pop rocks, whimsical in a good way; the flavorful meat broth with bits of chicken sous vide and herbs, memorable. The jarring note was actually the main course:  a browned whole tongue that was tough and unpleasantly chewy.  It was an arrogant choice for a restaurant that gives you none of your own.  Many people, including me, just can't abide the texture of an entire piece of tongue and it looks disgusting sitting plopped there on your plate.  This one dish made the otherwise delightful evening one from which nightmares are born.  My mind cringes at the image of that piece of meat (with only a dab of guacamole and a bit of onion to distract the eye).  The three desserts that followed, including a glorious fois gras ice cream could not resurrect the evening for us.", "author": "Cecelia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "I had dinner there this past Saturday, and man was it great! The food has been described as \"Modern Mexican,\" which should give anyone pause for possible deconstructed culinary douche-dom (especially when you only have the choice of a tasting menu), but what I had here was evocative of true Mexican flavors, even if the form was something else. Take for example the wagyu dish, which is their take on fajitas, which was lusciously grilled steak, caramelized onions, and the amazing \"tortillas,\" which were fluffy and biscuit-like, owed to the innovation of adding yeast to masa. Also great was the \"Posole\" which was made with a concentrated double chicken stock, rather than the typical version you see in many \"traditional\" restaurants that usually start from some commercially made chicken base - a revelation! However, I thought the best part of the meal was the wine/beer pairing, which was adventurous, thoughtful, and on point, both taking into account matching flavors as well as serving at the proper temperatures. The service was attentive without hovering.  Overall another great fine dining experience from the Mission!", "author": "Gong K."}
