{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "I come here multiple times a week and have never had any issue with my orders or the staff. Prices are very reasonable, and the real draw of Casa Mexicana are all the extras! You can get pickled jalapeños, 6 different kinds of salsa, extra cilantro... all in one burrito.\n\nThere are a few vegan options, though for burritos just make sure to clarify \"no cheese\"! Otherwise they'll melt some cheese on the tortilla.", "author": "Morgane M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-19", "description": "Terrible costumer service \nI order a veggie burrito with cactus ( nopales ) and I asked if i could have it done half cactus and half tofu which I often order at other burrito places in the city and it was a no we can't - they would charge extra for that. When I ask why they say it was the rules.. Really??\nWell there you go you lost a client for a stupid rule.", "author": "Gabriel Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "This is as generic a Mexican cafeteria as its name suggests.  The menu is fairly extensive, but if you order a chicken mole plate, the server will dig a big spoonful from one of the containers in the cafeteria counter of shredded chicken breast in a nondescript sauce and put it on your plate.  The rice and beans, also from such sources, survive this kind of treatment better.\n\nIt's perfectly adequate food if you just happen to be in the neighborhood and need something to eat.", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Authentic and underrated. Our default spot for burritos, platters, chile rellenos and more.", "author": "Allison Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "I like there chicken mole burrito. It is rare to find chicken mole burritos at most taquerias in San Francisco. The salsa is also tasty. Good fast place to get a good burrito in Noe Valley.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "This place should definitely have five stars. The food is really tasty the meat is tender and the people that work there are really kind.Everything is really reasonably priced, and they have huge portions", "author": "Anne S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "Great neighborhood Mexican restaurant. All the ingredients are fresh and authentic I am always satisfied. The cooks make the food in front of you like chipotle which I love because it's easier to customize. Nice family run place too!", "author": "Miranda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "I was going to a potluck party and got takeout:\n\nA small side of pollo asado\n\nA small side of Refried beans with cheese on top\n\nAnd a small side of sautéed veggies.\n\nThey threw in 3 bags of chips and salsa.\n\nI was the hero at the party and I spent $13.50.\n\nAwwwww yeah.\n\nAnd it was fresh, clean and yummy.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-29", "description": "Always surprised there are people eating here - I had the worst burrito of my life here - it was made with each ingredient as a blob instead of lengthwise so each bite is a mouthful of 1 ingredient, some hot, some cold - it was truly awful.", "author": "Leda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Great local, amazing food, and really good prices. I ordered a Chicken Mole burrito, simple and delicious! My bf went with an Al Pastor platter. So much food on there for a really good price, and he is loving every bite. Cant wait to come back here", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-18", "description": "Casa Mexicana is a solid little place in Noe Valley that somehow is surviving the steadily rising increase in snobbery and cost that this neighborhood oozes. I guess it is comforting to not have to leave your cushy, very gentrified neighborhood to get Mexican food?\n\nTHE OVERVIEW.\n+ Good variety of meats and dishes, although the shredded chicken was bland, bland, bland\n+ Open salsa bar, although you're limited to 3 varieties (salsa verde is good, though)\n+ Credit card or cash, works for me\n~ Decent number of tables, if you're not doing take-out, but they are super sticky and kind of gross, really\n\nNot super authentic or spicy, but makes sense given the neighborhood.", "author": "Claire S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-19", "description": "Apparently they don't know their own menu? I just got over charged for a burroto I didn't want- I wanted a different one. I let her know that the order and process we're wrong and she wouldn't charge me the correct price. \n\nWouldn't bother with the rude people here. Save your money and just go down to the mission", "author": "Lief B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Delicious, fast, well priced Mexican food with friendly service.  Perfect for a quick pick-up/takeout meal.  The menu on the board is extensive, so it's best come back to try a few different options, which is what I did.  I had a great burrito with cochinita pibil, which is a deliciously braised pork with yummy spices.  I asked for mine to be spicy, so they put some extra hot salsa on it.  I asked for the mild salsa as well (pico de Gallo). This was the largest burrito I've ever had and the ingredients were perfectly portioned for the size!  There are also self serve salsa which is awesome!  The quesadilla I had here was deliciously grilled and had yummy flavorful al pastor.  Perfect little Mexican restaurant.  I will be back for sure.", "author": "Kara C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "Have been coming here for 7 years with a 90+% satisfaction rate. Normally at Mexican places I don't feel comfortable varying my orders too much, but everything from here is usually good. My wife has indicated that there has been once she got unexpected shells on shrimp, but otherwise we usually are happy to go here. Reason I don't go 5 stars is because I never left saying \"Wow, that was the best I have ever eaten.\"\n\nI go with the chimichanga, super burrito, or enchiladas and never complain. Like many mexican places, you can see everything right in front of you, so if the refried beans aren't up to your standards today then just skip it. I like the refried beans and the guacamole is usually pretty good, too. \n\nThere is plenty of variation in spiciness, but I would venture to say people more mild or medium in their salsa preferences probably like it more than the extreme spicy customers.\n\nI only once saw a customer get into an argument with the staff and that was 5 years ago. It was over the fact that she wanted a kids menu shrimp taco which wasn't really a choice for adults. That has since been corrected and I have observed several customers getting the single shrimp taco for $4.50 in the last few months. \n\nAnother place we have no problem sitting and eating at, but usually bring our grub home or to one of the local bars.", "author": "David A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "We love this place and come here at least once a week. Their burritos are tasty without being too greasy, and I like to order their chicken mole dinner plate. My bf loves their super veggie burrito, and their unlimited tasty salsa bar is a huge plus too.", "author": "A A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "This is probably my most favorite Mexican food in the neighborhood.  Great food, great staff!", "author": "Mateo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "I ordered the super veggie burrito! It was so good! But if you're vegan; their veggie burrito does have cheese on it and you have to tell them before you order because they melt the cheese on the tortilla warmer before they put it on the table and ask you what you want. Ps the prices here are great!!", "author": "Keriane K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-16", "description": "The lady at the register will add on charges that you didn't order. I've caught her two times over charging me for a burrito. Is that really how you want to treat your customers? The burritos are alright nothing special but why you trying to add a dollar on to my burrito when the price is on the board behind you? You better believe I called her out and she tried to play stupid and tell me the price changed. I'm done eating here I can't support snakes in the grass. Karma comes back tenfold. Bandita", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "This is my favorite Mexican place in San Francisco. The food is incredibly authentic and the staff is extremely friendly. The quesadillas are unrivaled, but I can also recommend the burritos.", "author": "Stephan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "We came in tonight craving some greasy, overstuffed burritos and because we had a BOGO coupon which was going to expire today. After reading the reviews on Yelp, we knew to come in with lower expectations, especially in light of TLC and all of the best taquerias in the Mission nearby. Our lowered expectations were not even met.\n\nI ordered a Cochinita Super Burrito sans Sour Cream while the boyfriend had a Carne Asada Super Burrito. With our BOGO coupon plus 2 drinks, the meal came to ~$12. The order came with free chips and salsa which is also nice. The issue is not the price, clearly, but the food quality. Both of our burritos were so bland that they were a drag to eat. Like other reviewers mentioned, they were also super messy/watery but heavy at the same time. Each bite was a struggle. The salsas were also distinctly terrible. One of them tasted like it had cleaning fluid in it. Plus, the final straw, the place was dirty. Clearly none of the tables had been wiped down recently which is just nasty, especially considering the volume of customers.\n\nI would not come back, even if i had such a big craving for a burrito. I would rather walk to the Mission or pay double the price at TLC and get a MUCH better meal. Stay away.", "author": "Carrie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "We are regulars. Always here for the Veggie Burrito in a Spinach Tortilla. I also buy the Horchata.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "Wow! Surprisingly good. Delicious Carne Asada Taco. I can't wait to return to try other food. The Chile Relleno looked amazing, too.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-03", "description": "For a Mexican food in Mission, this was so-so. The quesadilla was fair. The serving was a lot but there wasn't any flavor at all. There weren't any hot sauce or any other salsa choices. There weren't many options also for the drinks.", "author": "Jan Carlo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Super fast and friendly service.  Delicious and reasonable portions for the price. Lots of seating and soccer playing.  A great spot for a meal.", "author": "Lynn G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-03", "description": "Not that much taste for their tilapia and steak tacos. I ordered the grilled one but it wasn't warm at all when they served them. Price is quite expensive for the size", "author": "Krista D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-26", "description": "Mediocre Mexican, especially given how close really good and authentic places are in the Mission. Yumminess is nearby. Not so much here.", "author": "R M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-05", "description": "I live in Eureka Valley and love going to this spot for a casual dinner. I go here at least once a month. It's pretty easy to park on the street too. \n\nThe food is relatively cheap and good! I am a vegetarian so I haven't tried their meat but my husband likes their meat burritos. \n\n1. Cheese Enchilada plate (comes with 2 cheese enchilada, lettuce and tomato salad, Rice, Beans, Guac and Sour Cream and any other topping you want) ~$8.75\n2. Super Veggie Burrito  ~$5.50\n\nIt's a great place for vegan or vegetarians. They have tofu as well if you would like Tofu burritos. \n\nTheir salsa bar is pretty good too (2 salsas). \n\nI believe there is a minimum for credit card.", "author": "Hiral P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "I walk on 24th street everyday. After my walk I like to eat dinner one of the local restaurants. Casa Mexicana is one of my favorites. Last night I had one of the best burrito in Noe Valley. Great value for the money!", "author": "Zeki O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-21", "description": "Typical assembly line Mexican food place.\nKeep stepping to the left while you say \"yes\" or \"no\" to whatever she is pointing to with a large slotted spoon.\nI usually get a spinach burrito with mild chicken and the works.  The server lady did not drain each selection well enough today and my burrito turned into a good tasting, sloppy mess.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "I eat here, often more than once a week.  The food is fresh and delicious, the folks who work here are very nice.\nIt's a very nice restaurant.", "author": "Charlie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-28", "description": "Not the best food ever but consistent. Good portions, great salsa, and speedy service.", "author": "Brittany A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Another Good Mexican Restaurant in San Francisco. If you like your steak tasty and tender this is the place to be.  The grilled chicken is also excellent.  This beats El Farolito in the Mission.", "author": "Francis A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-01", "description": "I'm a regular here! Love the convenience of having a cheap and delicious Mexican place nearby.\n\nThe staff are friendly and the food is tasty. I dropped a star because despite having several people filling orders, when the line gets longer than a few people you'll be waiting 10 minutes or so just to give your order. Annnnd the chips are not always fresh. But they're free, so can't really complain :)", "author": "Nick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "Casa Mexicana II is located just up the street from my friend's apartment.  Went here for the first time.  Ordered a massive vegetarian burrito with tofu in it.  Great deal, not over priced for what you get.  I asked the man at the counter if I could sample their horchata.  He let me, and I loved it!  Ordered a cup of that.  Very satisfied with my meal.\n\nThere are 3 style of beans you can choose from: pinto, refried or black.\n\nOMG lol, there was this one lady with a blinged out cap with the Guadalupe on it.   Also sporting some blinged out hoop earrings.  Go girl!!!!  Had to give her a shout out. \n\nGracias!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-24", "description": "Food is good.  But for a Mexican Restaurant to play Puerto Rican music and loud too.  I could not even speak to ny husband.  Ask them to lower it and that said yes but didn't!  Poor customer service!  Would not come back!", "author": "Grace M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "This is the place to go for a quick bite when you're craving Mexican food in Noe valley, also very easy on the wallet! They also have wheat tortillas which is a nice option. The people that work here always greet you with a smile :)", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-26", "description": "Been coming to this place for years. The food is consistent, not the best, but better than average with friendly people behind the counter and very reasonable pricing. I would have given it another star but the place needs a good cleaning. The table tops, even if they've been wiped off, are sticky. The front window table seating though is another story. Grimy, greasy. Don't look down at the floor or corners or the window sills.", "author": "Steven V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-01", "description": "5 stars for convenience and price\n3.5 stars for food\n2 stars for service\n\nI have been getting take out just about every week for the past 5 years at least, but the cashier is the only one who remembers me. Tonight they ran out of the chicken I always get so I decided to be bold and try something else. I asked if it was spicy and was told it was mild - got home and it is HOT. Not happy. Don't dare give up my parking place to go back to complain in person.", "author": "connie j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "I go here after school on half days. Delish! I personally don't like the carne asada but highly recommend the carnitas. For hungry teenagers the prices are great! Definitely not breaking the bank.", "author": "Marie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Although I am normally skeptical of Mexican joints outside of the Mission district, this place is very good and I highly recommend getting their tacos! Many people are burrito people, they are constantly in search of the country's best Mission burrito, so, to those people, I cannot help you because I am a taco girl. I love tacos, maybe because I don't care too much for the tortilla and would prefer to eat messily than have something completely wrapped and easy to 'eat'. \n\nTheir carnitas and chicken are flavorful, tasty and not too salty. I also enjoy the portions that they slab on for a taco. Two tacos are the equivalent of a burrito bowl and ends up around $7. Very good deal if you ask me.", "author": "Lillian C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-22", "description": "If the management of Casa Mexicana cared about their customers, the restaurant would do a better business.  I've been eating there once a week at least for several months now, often for brunch on Saturday or Sunday, and the place is usually empty.  I was one of two people in there this morning, which is pretty remarkable given how long the lines are for every other restaurant in Noe Valley that serves breakfast on the weekends.  For months I've been asking if they have breakfast potatoes, one the few items on their brunch menu, and the answer is always \"no.\"  \n\n\"It's been three months,\" I said, \"and you still don't have breakfast potatoes.  Will you ever have potatoes again?\"  \n\n\"I don't think so,\" she said.  \n\nLater I discovered that they had only prepared two of their three salsas before opening this morning.  I wanted the green salsa, their best by far, but the cooks were still preparing it.\n\nI'm surprised they can still afford rent.  When Little Chihuahua opens again, I bet they close.", "author": "Isaac C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "When you want a cheap burrito for lunch, this is the place. A regular burrito is 6.25. A super is 7.25 ( I think.... dont quote me, but damn cheap!). There's a vast array of filling choices, and the workers are really fast and super nice. \n\nTake that Zapata  (and actually La Taqueria who makes kinda meh burritos, but stellar tacos.) \n\nFree chips and salsa ( take that TLC who recently started charging for chips.) \n\nLet's recap the nearby burrito options:\n\nTLC:  awesome food, but pricey, and no free chips. \n\nZapata:  crabby workers, inconsistent food, expensive. Free chips.\n\nLa Taqueria: nice workers, great tacos, meh burritos, no free chips. \n\nCasa Mexicana: It's a pretty good cheap burrito and HUGE! Free chips. Nice workers. No line.\n\nThe winner? Casa Mexicana.", "author": "El B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-17", "description": "Three stars is just about right, maybe 3.5.... We came by for lunch while visiting the Noe Valley..\n\nThey have a wide menu, food was hot, tasted good.\n\nThe kids menu is nice and affordable.\n\nThe super nachos were really big and buritto was filling.\n\nThe negative was finding a place to park..\n\nWe will come back...", "author": "Joe B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-21", "description": "3 stars for the food and minus 1 star for trying to rip customers off. Beware when they add things on, they now charge for lettuce. What the heck, it's lettuce! I also got charged for extra salsa that was offered. She knew exactly what she was doing. I use to come at least twice a month. I won't be coming back, stop trying to rip your customers off, you lose way more in the end. I will be telling friends not to come too.\n\n*got terrible GI upset too. What a horrible place to eat.", "author": "Mike O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "I rolled in here for a late lunch. At first, I wasn't sure. Taqueria in Noe Valley? Is it really going to be good? But it was the best option for a quick bite. I looked at the menu, at first thinking tacos. Then I saw they had sopes and that sounded good. And THEN, I saw they had breakfast all day... very intrigued.... huevos rancheros sounds yummy right now! \n\nIt was 3:30, so I thought maybe I should just get a sope.. kinda a snack. I ordered the sope to a grumpyesque looking woman, she said they were all out. I quickly decided that it was a sign that I was meant to get the huevos rancheros. And without hesitation I said \"I'll get the huevos rancheros then.\" \n\nStrangely, the woman's face lit up. She seemed absolutely delighted by my ordering huevos rancheros. Not sure if she likes making huevos rancheros, or she likes to eat them herself, or surprised I ordered it. She got crackin on frying up the tortillas right away. \n\nI got a lemonade fresca and some chips with salsa verde and started my late lunch. Everything was delicious! I always tell myself I want to go to mexican breakfast, but we never do. The ranchero sauce was perfect. I had gotten refried beans which were really good... very flavorful. The perfect bite is getting some of that yolk with that ranchero sauce and tortilla and a little rice and beans all mushed together. What a simple and satisfying dish!\n\nI could tell just by looking at the salsa verde that it was going to be good. Some places you look at the salsa and it looks watered down - but this place it's thick and flavorful with a really good kick. \n\nAs I sat there, I was very happy with my choice. I myself was delighted by being able to walk into some place by chance and getting a great mexican breakfast at 3:30 in the afternoon. This is the life!\n\nThis is my first time being here so I can't vouch for any other food. I'm surprised I came on yelp to find it was only 3 stars. Everything I saw looked really fresh and delicious. I probably wouldn't come all the way down there for a burrito. But breakfast all day? Hells yeah! It was super cheap too... $5.95 for huevos rancheros... for some reason it seems more expensive at other places. Would definitely stop in if I'm around and want a quick bite.", "author": "Bonnie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-16", "description": "Absolute shit show. Somehow forgot my order when there was only two people there. Don't waste your time.", "author": "Joe F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "This place is my staple, am here far more often than I'd like to admit. Decently priced, consistent Mexican food. Is it super gourmet or \"authentic\"? No, but who cares. The staff knows their clientele; they are nice and give great service no matter what language you speak, and no judgy faces when the woman in front of you orders a broccoli and cheese burrito. Plus, free chips are always a win. \n\nI do a fair bit of takeout but dining in is a good option too; plenty of seats, some sporting event is always playing on the TV, and I always enjoy the Spanish language power ballads that are playing.", "author": "Katies F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-29", "description": "Food is fine. I've been coming here almost 3x week to get a small dish of meats and veggies for 7$. Today woman is super rude, just to me and charges 12$. In a city with an excellent taqueria on every corner there's no excuse. I don't really care about the $. It's the attitude.", "author": "Dominic C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-23", "description": "I ordered the super nachos but the lady barely put enough cheese compared to the amount of chips. The chips were stale and bland and the burrito was not that great.", "author": "Celli C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "QUESA freaking DILLA.  *two hands up*\nEither I was really hungry or that was one of the best quesadilla.", "author": "Joanne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "This is a 4 star place, but it needs to be above TLC which is trash.\n\nConsistent food, reasonable price, green salsa is awesome", "author": "Thomas P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-25", "description": "Good size burrito. AL Forno tasted great, and the chips on the side were unexpected. Overall good meal.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "I'm not usually a big fan of Mexican food, but I thoroughly enjoyed my super taco with beef, salsa, beans, lettuce and cheese. The tacos and ingredients were fresh and delicious, the portion is just right for lunch. This may have changed my view of Mexican food in general.", "author": "SJ L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "Chicken burrito was good. Some stuff like cabbage and pico I think were of extra cost.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "I eat here way too often to wonder why it only has 3 stars. Not accurate in my opinion. \n\nEverything is made to order and most of the time made fresh. \n\nIf this place was in New York it would have oh so many reviews and a long line. But it's in Noe Valley near some blockbuster Mexican places so it has unfair shoes to fill. \n\nI love stopping in here when I'm not feeling the whole paycheck across the street and cooking myself dinner. \n\nSuper burrito if you're feeling famished and the secret is to order two chicken tacos with salsa, super inexpensive. \n\n$10 minimum on cards.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "It's not super \"authentic\" but if you like High Tech Burrito, Chipotle, this is the same kind of Americanized Mexican food, but better. I usually get the super burrito with refried beans, charbroiled chicken (yay, not soggy like at other places) and fresh avo. Quick, friendly service, it's my go-to burrito spot in the neighborhood.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "stop what youre doing and go get a burrito from this place immediately.", "author": "Button L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-11", "description": "Bad Mexican food. \n\nThis place is not very good. the meats are fatty and the atmosphere is lacking.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-06", "description": "I ate chicken here last night for dinner and I woke up this morning feeling disoriented and very strange. It wasn't food poisoning, I had no nausea. My only conclusion is the chicken was so packed with antibiotics and other hormones that my microbiome is now a dead-zone. Also, my breasts feel bigger than normal. Good good.", "author": "Avo I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-13", "description": "Cheap and Easy with decent food.  We've come in here a few times and have learned to ask them to take it easy on the liquid-y salsa.   They pour it on the tacos and then they are way too wet to even pick up.  Also, they microwave to re-heat things like chile rellenos - but, its still pretty good.  All in all a pretty good spot to get a quick bite or take out but, not worth a trip to the area (especially when Little Chihuahua is right around the corner).", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-18", "description": "After I moved away from Noe Valley, I miss the super burritos from Casa Mexicana II. \nThere is no mexican restaurant near me that makes it so good and so big like them at all. My son likes their rice pudding. I like that I can select a tomato or spinch tortilla. All their meats are great especially the spicy chicken and the chicken mole. The steak is a bit dry though. If I go anywhere else for a super burrito, I feel cheated.", "author": "IM P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-23", "description": "My review is just like the other reviews with it being DECENT. \n\nIn a desperation for some food we came into here and ordered a burrito and nachos.\n\nIt's a typical Mexican resto. With salsa tables as well as loud colorful decor. It's like a canteen.  \n\nI ordered the burrito which ended up turning into a rice place because the burrito just didn't hold well. Sort of upsetting but I was hungry...\n\nThe now rice plate tasted so unsatisfying. It was bland and messy. A fly also decided to join in my meal around me which added to the dismay.\n\nOverall... Stick to taco trucks", "author": "Ladonna A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-04", "description": "Used to be the best burrito in the neighborhood. I dont know the history of ownership, but the place changed radically maybe 10 years ago when they seemed to expand the menu and streamline the operation. Quality of ingredients suffered or maybe everyone else just does a much better job preparing the fillings to make it interesting. My steak super burrito was more like steak soup in an tortilla. The quac and black beans were a runny mess. None of that would have mattered much if the ingredients had real flavor. I wish the place the best because 24th doesn't need another Nail shop. But they really need to step up the food. The old kitchen sink burrito days are over.", "author": "k m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-25", "description": "I come in here all the time because it's close to where I live and very convenient. The food is decent and quickly made. The spicy chicken is my favorite and they have a good seating area in back.", "author": "Nicholas F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "We grab burritos here at least once a week for an easy, reliable weeknight dinner for two. Can't beat it for $15. Hubby gets the chicken super burrito and I get the tofu ranchero super burrito. Lots of options: tortilla flavor, type of beans, types of salsa, and add ins like pickled onions and cilantro. Ladies who work the line are nice enough, and they have burrito making down to a near science. A line of 10 people moves along quickly and you'll have your burrito within 10 minutes. With free chips and salsa!", "author": "Sahar B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "Yum.  This is a delicious burrito.  I am in noe valley weekly for my daughter's tutor appointment.   I run here and get burritos to go.  They are super delicious.  I love that they have kids burritos too- great deal.", "author": "Pauline C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-19", "description": "This place is good. Got the super burrito with grilled chicken. The chicken was awesome and the burrito was big.\n\nThey give free chips and their salsa is good. I'm giving this place 4 stars only because I am from San Diego and I have had much better Mexican food. Nothing bad to say about this place, I've just had better.", "author": "Rob L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-16", "description": "Been coming here with my family for at least 6 years. Authentic Mexican cuisine. Fresh ingredients. The green sauce and salsas are served in molcajetes; al pastor grilled at time of order; veggies are all fantastic (i enjoy substituting cactus for meat in my super burrito). The staff cater to your individual preferences and construct your plate in front of you.\n\nMinus one star for the new woman working on the line... I've seen her be rude to multiple customers, and she rushes the order not allowing people to pick the ingredients towards the end (e.g. cilantro, onions, green sauce). Everyone else is superb.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-08", "description": "Got a carnitas super burrito. \n\nMeh. \n\nWill walk to the Mission next time. My fault for being lazy.", "author": "Joseph L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-11", "description": "Personally, I find that the food here, in general, tastes decent.  It's not bad at all - and in many cases, it's pretty good.\n\nHowever....\n\nTacos - generally, you're supposed to pick up the corn tortillas with your hands to eat tacos.  Yes, sometimes it's messy.  But here at Casa Mexicana, they put SO MUCH on the tortillas, they really are on the plate just for show.  You cannot pick up the tacos to eat them - must be done with a SPOON (no, really).  And when you're done, you have a wet, soggy, nasty set of what could have been tasty corn tortillas.  That's not a taco - that's a pile of meat, beans, and rice with a corn tortilla garnish.  Yuck.\n\nThe burritos suffer from a similar problem - because they don't take the time to make sure the beans are properly drained, nor do they take the time to WRAP the burrito properly, after a couple bites it just falls apart into a pile of - wait for it - WET SOGGY NASTY MESS.  Again, here comes the spoon.  \n\nThe people are nice, service is fine, food tastes OK, but the prep is TERRIBLE.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "Good place for big cheap burrito. I like how you can customize your burritos. Good service and good food. Try it for yourself.", "author": "George L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-15", "description": "I had the breakfast burrito. Tortilla was average, as were the rest of the ingredients. Composition was good. Salsa bar is a huge plus.", "author": "Tom F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "This place is wonderful. It's quick, it's convenient, it's cheap, and it's delicious. Since I am vegetarian I can't vouch for the other items on their menu, but they seem to use fresh ingredients and their food is always hot. The burritos are cheap and the serving size is very big and filling. The workers are nice and the restaurant atmosphere is casual and comfortable. Really like this place.", "author": "Jazzy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Great place to get some good comfort food at a cheap price.", "author": "Drini C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "Bend over and get ready for a burrito, this place is bomb!!! If you like mexi-CAN food, this place is da bomb!!! It's delicious, fast, and priced right!!! Most other places in SF are mexi-can't w/ their outrageous prices!!", "author": "Steve H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-02", "description": "HORRIBLE FOOD SAFETY PRACTICES\nOn 1/30/15 I went in for a quick burrito, however, it turned into a horrible experience. The food server finished my a la carte burrito wrapped it in foil and placed it on the counter where it rolled off the counter on to the floor and rolled 1-2 feet on the dirty kitchen floor. She picked up the burrito and put it on a plate and gave it to the cashier.\n\nAfter I asked the cashier to make me a new burrito because it had rolled on the floor, both she and the food server took up an attitude and proceeded to yell back and forth between them in Spanish saying \"in this restaurant we don't waste food!\" This made me wonder what other food items get recyled back into inventory.\n\nThe food server began to make the second burrito, with the SAME GLOVES she had picked up the dirty burrito. She didn't change her gloves, handled the tortilla, and all other serving utensils.  At that point I asked that they stop making the burrito and told them I no longer wished to purchase it.  As I walked out of the restaurant, they contiued to make negtive remarks in Spanish about how I had rejected the burritos. They proceeded to place the burritos under the hot lamp, my guess is that someone was going to eat those filthy burritos later that evening.", "author": "L H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-06", "description": "In Denmark I am known for being the biggest Danish expert on this particular restaurant. I have eaten here 100+ times over the course of eight months back in 2011-2012. I have not been dissatisfied one single time.\n\nI am from a country with zero Mexicans. So I am no expert on their food culture. I have basically no idea how this food is supposed to taste. What I do know is that this place can serve you a predictable and tasty meal EVERY day ALL year around.  I almost got the same custom made super taco every time I went here. \n\nThis place is perfect if you return tired from your work and just need to sit down, relax, and eat some tasty food.", "author": "Asmus O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "I've been coming here at least once a week for 18 months and have loved it every time. Everything is freshly made and you generally get a masterclass in butchery in the background. Nothing from a packet here. It's delicious and inexpensive. I'd wholeheartedly recommend the super burrito.", "author": "Paul P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-31", "description": "One really must wonder why such an expensive and bland burrito is the best that can be done here.", "author": "Jim M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-15", "description": "Ordered carnitas, got carne asade, asked for salsa and the lady called me a gringo asshole in spanish to her coworker.\n\nI know mistakes happen, as do bad days, but it was pretty obvious malicious.\n\nNever going here again.", "author": "Nate K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "Good Mexican food that keeps busy. Always people in line. Good price. Lots of options. It's set up like a Chipotle so you see them making the food. You also see a lot of people eating here by themselves.", "author": "David H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "Great choice for quick, cheap Mexican food. Steak Super Burrito was good and big, couldn't finish the whole thing. Plus free chips and salsa. I liked the green salsa. I've had better, but for this price I thought it was great value.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-20", "description": "MY PALATE HAD A DORA THE EXPLORER MOMENT.\n(3.5 stars)\n\nThe Dora was in me (but not in THAT way).\nReally enjoy exploring SF's Noe Valley neighborhood, boutique shops, bars, and restaurants. It has a little bit of everything for everyone. Walked into Casa Mexicana because it was one of the only restaurants open late in the neighborhood and all the locals were pouring in to grab a bite. \n\nThe menu was overwhelming and I wasn't sure exactly what to order. I like Mexican food but I'm not a die-hard mexcian food lover, i just like the food from time to time. Keeping simple as I'm exploring a new restaurant is always the best strategy to give it a try.\n\nCHORIZO TACO ($3) \nAL PASTOR TACO ($3)\n\nI'm not sure what lead me to try these to tacos, but its something new my palate hasn't tried. I almost ordered the TOFU TACO but switched up last minute.The preparation took a few minutes because they cook fresh on the spot so the wait is not my worry. Meat, veggies, flour tortilla all fresh.\n\nCHORIZO TACO - mexcian sausage with salsa. I went ahead with the rice, black beans, mozerella, cilantro and pico de galla on the side to add in. I've never had a chorizo taco and was pleased of the abundance of flavor and the crispiness of the burnt sections of the chorizo. And the flour tortilla was great by itself. \n\nAL PASTOR TACO - bbq pork with salsa. I went ahead with the rice, blackbeans, mozerella, cilantro, and pico de galla on the side to add in. the tenderness of bbq was succulant - those can be hard to find. I think i enjoyed the Al Pastor Taco over the Chorizo Taco. \n\nMaybe having the rice and black beans was a little too much for this tacos. I'm not a fan for their pico de galla, i'm use to chunky pico de galla but there pico de galla was kind of mushy. I was full after eating just one taco and when i had 2 tacos it covered the entire plate with food to eat. Definately portions are generous so do come here with an empty stomach, you get your money's worth. \n\n* Ambiance - clean and spacious\n* Prices - affordable\n* Service - great service and everyone was friendly\n* Portions - ALOT\n\nWill i be back? Yes to try something new on their menu \n\nUntil the next review....", "author": "Jane A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-29", "description": "I eat here once a week and the staff is always super friendly.  The food is good.  I could walk to the Mission and get GREAT burritos.  However, thats the curse of living in burrito heaven...there is always going to be a burrito place...I'll stick with Casa Mexicana una vez a la semana", "author": "Kelvin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "I love this place and don't quite understand the two and three star reviews that others have written.  Are they biased because this place is in Noe Valley vs. the Mission?  Who knows.  I have been going here for a long time and can say their burritos are excellent.  I love the several varieties of chicken.....the chipotle chicken is my favorite.  Very friendly staff and they always give me extra chips when requested to increase the calorie count of my dinner!  Solid taqueria and a go-to place for me on a regular basis.", "author": "David M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-26", "description": "I went to Casa Mexicana last night, I was craving something spicy - as usual. It was just that kind of night, so I ventured out into the rain for a burrito at Casa Mexicana. \n\nI ordered a Super Chicken Asada Burrito with hot sauce and even asked for jalapenos inside. I was expecting some heat and was sadly disappointed. I did like the overall flavor of the burrito, but didn't need the shredded lettuce. \n\nSo, next time I know what to order and that if I need spicy, I might have to add that myself at home. It just doesn't have enough fire for this girl.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-09", "description": "Stopped in because I saw a parking space. Never again. Prices don't appear bad but the enchilada platter was so small--almost no filling in the enchiladas, and the sauce was really bad. Like a can of El Paso. The \"salsa bar\" has just 3 salsas and at least 2 of them are not good.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-14", "description": "Got food poisoning from the spicy chicken. They couldn't have cared less when I called to let them know (and protect future customers.) NOT going back!", "author": "Loraina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-05", "description": "super burrito.....DELISH!!!!! \n\neverything was great! except for the chips. and the guacamole portion size...... but i always think that", "author": "Christie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-04", "description": "It's no Mission burrito, but it'll do the job if I'm feeling lazy and don't want to spend $14 on a fancier Noe-Valley-burrito shop. Contrary to other reviewers, I've always had great service here- even when it's packed! The dining area itself is nice, really casual, free chips and good salsa bar. A-OK by me!", "author": "Rachel D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-08", "description": "I found a rock in my food. Oddly enough this isn't the first time this has happened to me at a Mexican food spot... As someone who makes tons of cheap bags of pinto beans I can tell you that they can come with some pretty weird odds and ends that have to be removed while they soak. That being said the staff is nice the veggie options are plentiful and its the cheapest thing with in walking distance of my job for a super filling lunch. don't go out of your way for this place especially when its blocks away from The Mission district.", "author": "Shelbie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "Good Mexican food for a good price in Noe Valley. It is not nearly as good as la Taqueria, but it is great for a local NV Mexican spot. Best Mexican in NV hands down! Way better then Chuwawa or what ever it is called.", "author": "zach B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "We were from out of town and were looking for a good place to eat.  The prices were great.  With a family of 5 we were able to get all of our food for under $40.  We ordered a super burrito and it was huge!!  My husband who is usually very picky said it was the best burrito he has ever had.  I ordered 2 chicken enchiladas, it was way more than I was able to eat and ended up taking more than 1/2 of it home.  But it was super good, the chicken had a lot of flavor and the sauce was wonderful.  The only thing lacking was the chips for chips and salsa, they were stale and too thick for our taste.  The horchata was out of this world, with lots of cinnamon and the Hibiscus drink was very good as well.  We will definitely visit again when we are back in SF.", "author": "D M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-08", "description": "Yum!\nHaving recently moved to the city, I am on the quest for great food in my area. Tonight I was not let down. At Casa Mexicana, the food is fresh, tastey, and super reasonably priced. You get the best of all worlds!\n\n I've never had Campancheros (sp?) before and man this will not be my last! Somewhat of the healthier side of their menu it has strips of beef and chorizo with onions and cilantro. Only 7.50. What a deal! \n\nThe workers were super nice and I was able to watch some of the game! Awesome restaurant!", "author": "Ezequiel R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-03", "description": "Great food for the price. If you want to pay $5 more for the same meal but a little better, it's easy to find. They are nice, quick, and cheap.", "author": "Brooke N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-14", "description": "Mexican food is usually pretty vegetarian friendly but this place has several options that cater exclusively to vegetarians. \n\nMy parents took me here this past weekend and I was pleasantly surprised to see the options of made-to-order burrito options; steamed broccoli, sauteed mushrooms, grilled vegetables, etc. There is also marinated tofu as well as other great combinations. \n\nEnded up getting the steamed broccoli with marinated tofu the first time with pinto beans, rice, cheese, and avocado on a spinach tortilla. Ended up going back and getting the broccoli with sauteed mushrooms today.\n\nI realize that there are tons of mexican food options and I have many others to try but this is a great option if in the neighborhood. Friendly enough staff and the price is right.", "author": "Heather L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-11", "description": "Looks kinda like Baja Fresh when you first walk in and the options on the menu can be a little overwhelming, but...\n\nGreat and fresh mex. \n\nHad the  tofu, veggies and black beans. Tofu is in a nice traditional Mexican tomato sauce, tasty. Good green salsa. Dining companions had spicy chicken burritos and loved 'em. The kid's bean cheese rice burrito disappeared in about 5 minutes -- and I even added steamed broccoli to it!", "author": "jennifer k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-19", "description": "Good tasty burritos in a casual yet friendly local restaurant. Burritos are consistently tasty with a great variety of fillings and spiciness. Quick service and friendly employees. Can watch them make your burritos, tacos or whatever you like. Lunch is usually a line of both local residents and many workers from local job sites and house renovation projects. \nAnd if you get one of their 2 for 1 burrito coupons in the mail you can have 2 people each eat a BIG burrito for about $10.00!", "author": "Armando H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "Surprised this place only gets 3 stars.  It's a burrito place.  Good selection, the meats are good, rices are decent.  They fry their chips in soybean oil so stay away from those, but otherwise I find their food to be tasty and fresh.", "author": "Rob H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-10", "description": "The food taste pretty good, and I have been going there for years, but they have become such a rip off.  I agree with the other reviewers about the fact that they charge you extra for everything, even if you substitute one item for another, they are very skimpy with the ingredients and they don't seem to have a set price for a lot of things.  When you check out there is an extra $1.30 for one thongs, $0.40 for another, and they blame the fact that they register doesn't have the right buttons so they have to change extras.  As a vegetarian, I like that they have good tofu as on options, but they charged me MORE for that today than usual.  They cashiers have no standards, they just charge for anything they can.  They really  make it a terrible experience, so I will not be going there anymore.  I wonder if the owners know how their system makes people feel cheated and annoyed.    Tonight the cashier told me that tofu was not a button she had so she had to charge me extra.  That is not the way to treat customers that you want to keep.", "author": "C D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-18", "description": "I got a shrimp quesadilla. It was okay, I would have liked it more if the shrimp were bigger... they used the kind of shrimp that are like 1 inch big, not my fav. My boyfriend got a burrito and liked it. They were really friendly. Good place to go for a quick bite.", "author": "Alexandra W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "For us Mission burrito snobs, Casa Mexicana is worth a trip up the hill to Noe Valley. Blurring the line between tacos and burritos, their Azteca taco with freshly grilled chicken, bell peppers, onions and salsa was priced like the latter but almost as big as the former.\n\nNot good enough to ever move to Noe, but good enough for a visit.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-07", "description": "EXCELLENT burrito and quesadilla. The chicken is awesome, the portions are huge. \n\nThis place is fucking fantastic.\n\nThey've got breakfast burritos, too.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-05", "description": "Doesn't hold a candle to Little Chihuahua, but it is easier to park at night by Casa.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-01", "description": "Place to go for burritos. Tacos are expensive. Great selection of meats and they have lots of drinks, beer, aguas frescas. They play NFL on Mondays.", "author": "Will D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-21", "description": "Standard neighborhood burrito bar/mexican restaurant. Had a chorizo burrito and was quite satisfied, but nothing special to leave your own neighborhood's equivalent over. If you're in Noe Valley definitely stop by.", "author": "Will S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-28", "description": "A fairly reliable Mexican joint in Noe Valley. Maybe it's the only one...nevertheless, I can count on this place to serve up a good burrito. My favorite is the chicken mole burrito. I like that they have the option to add onions and cilantro because this certainly takes the food up at least another notch.\n\nThe place is clean and although the lines can get a bit long, they move everyone along efficiently enough.", "author": "Art O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-02", "description": "taste - not much flavor\nuse of  spice - pretty bland\ntexture - carnitas (marinated roast pork) a little dry\ntemperature - properly hot\nsalsa - not much flavor, neither mild nor spicy\nreturn visit - not likely", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-16", "description": "let me preface this review by saying that I generally avoid all and any menu items that lack meat and/or chocolate.\n\nhowever, casa mexicana ii has an aaaamazing veggie burrito!\nwhy i love it?! -- they melt the cheese onto your burrito tortilla, it's loaded with rice, beans, sour cream, lettuce, guacamole & salsa. the sour cream and guac alone make it a top of the line burrito...and the rice & beans & salsa really make the burrito filling.\n\ni've also had their super nachos & chicken quesadilla.\nsuper nachos are definitely super and so large in portion that I would suggest sharing between two people.\nchicken quesadilla is also loaded and overflows off of the plate that they serve it to you on.\n\nfrom the salsa bar -- the green salsa is soooooo good. you can taste fresh jalapeno and cilantro and it definitely has a kick!  my type of salsa.\n\nonly problems -- seating for parties larger than 2 forces you to sit near the restroom, and they only serve you a small bowl of chips for your chips and dip, but it's still bottomless, you just have to go up to the counter and ask for it.\n\noverall -- yummy food, probably best to take out...unless you snag seats close to the front of the restaurant...oh and great location! street parking is all around the block and on neighboring streets.", "author": "Riana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-08", "description": "Great local place for Noe Valley. Big portions and friendly staff makes this place a staple. The big old tv in the back( which was showing a live soccer game) is a nice addition.  The location could not be better (right in the middle of the busyness of 24th street).\n\nWhat could take this place from great to amazing however would be working on their menu options. There are just too many. I would narrow it down a bit. Right now I feel like it confuses most people on their first visit. \n\nBut then again who am I to suggest how to run a restaurant business!  This is for sure a place I would visit again!", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-09", "description": "I really like Casa Mexicana -- it's such a quick and easy, inexpensive dinner option when I'm feeling lazy or not like grocery shopping (which is pretty much 7 days a week). The burritos are always tasty and fresh, and the staff is friendly. I usually do takeout, but I have eaten in on a few occasions, and it's been clean and pleasant. I always get the spicy chicken, which is really good -- it looks as if they make everything on-site, so it's always fresh, and the chicken seems high quality -- definitely not processed. The hot salsa (and spicy chicken) aren't really hot or spicy by my standards, but they are tasty. A+.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-17", "description": "I went in here with my mom and my 'oh so picky vegan' sister.  I ordered an enchilada and they made it fresh right in front of me.  My sister asked the lady to change her gloves (so that the dairy/meat products didn't get in her food), and the lady politely obliged.  I thought it was nice of them to put up with my sister's request (sorry margie haha).  \n\nDecent prices and good service.  This is an order your meal at the front and seat yourself, but they do a great job.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-24", "description": "It's a nice place.  Really.  I'm not so sure where all the hate comes from.  Here, the \"super taco\" is the deal you want.  Cheap and basically an small delicious open-face burrito.", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-24", "description": "Important to remember before entering the door...\n\n....you're not in the Mission District anymore, Toto.\n\nFor those seeking the quality of Mexican-inspired dishes this city has come to be known for, I advise taking a walk down the hill. However, if a long stroll is not what you had in mind, just be prepared to be served a mediocre, price-inflated meal, that will, at least, fill your belly.  If addressing hunger pangs is your only concern, (and you have time to sort through their confusing menu board) I supposed this place will do the trick, but, remember, you've been warned...", "author": "Lady D S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-23", "description": "If you are drunk and just need some burrito or taco fixing, then go here. Salsa is not that great and the charbroiled chicken was charred way over! Service is meh.", "author": "Manu M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-03", "description": "Decent burrito. Carne asade or al pastor super burritos are pretty good but nothing amazing.", "author": "Joshua S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "Man, this place hits the spot. Had the veggie burrito, and although it fell apart on me, it was delicious nonetheless. I'm a big fan of the refried beans option along with the black and pinto bean options you usually get. There is apparently an outdoor seating area, or a least a back patio, but it doesn't look like it's used. It should be!", "author": "Mike O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-19", "description": "This place used to be good but it's gone down the drain. The food had no flavor and I ordered a fish taco, filet taco and chicken quesadilla. Everything tastes the same. The service was even worse. People were passing me up in line. Custom made order that still tasted like ammonia from whatever they use to wipe the grill. Next time Chihuahua's up the street!!", "author": "Dian N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-05", "description": "This place fulfills its purpose - it's a decent, quick, clean place to get your Mexican food fix in Noe Valley.  The food is nothing special, but it's consistent and pretty tasty. The service is fast and they'll even entertain your sad attempts to order in Spanish.", "author": "Vicente G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "Came in here last week and was impressed. I know it has mixed reviews, but I can say that the super burrito with covered in sauce with some guac is worth trying. Brought back memories of El Tarasco in Manhattan Beach (not as a good, but close enough to spark a memory).", "author": "Jeff F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-29", "description": "Not exactly the best place to go to for mexican food... or in my case, a burrito. I came here once because I was hungry and I was walking down the street I live in during the summer... and because I'm a foodie. Came in, was greeted by nice people and had my order.\n\nThe burrito was averagely big and that's good for a guy like me. I took a bite into it and started to think about all the burritos I've ever eaten. This wasn't the best burrito in the world but it's a simple burrito that I would buy again when I get bored and hungry. Kind of worth the trip but a burrito of an averagely big size for a guy like me and with a pretty decent price... why not! Like I said, not the best, and not the worst.", "author": "Bryan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-05", "description": "I went back to re-read my post after writing my reivew of Little Chihuahua and it pretty much stands.\n\nIt's not great, but it gets the job done, though with Little Chihuahua up the street there is really no reason to go here any more when far better tastiness awaits just three blocks away.", "author": "Ennis O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-24", "description": "Went here for a quick din din before meeting a friend for festivities later in the evening. Was disapointed in the quesadillia. I got the cactus quesadilla (you know, I really like that word. quesadilla...sweet), which I would think would be yummers, but ended up being...gloppy. undercooked. blah. Hardly any cheese, way way way too much guacamoli, and just kinda...blah. blah blah blah. blah. \n\nPlus, the girl with lotsa makeup behind the counter didn't like me. I could tell. Either that or she has breathing and hearing issues, cus she kept sighing at me while I was deciding, and she could never hear what I had to say. Or maybe she just irritated me. Eh. \n\nOn the plus, its uber cheap and their supertacos are a goodly size. 2.5 for that.", "author": "Danielle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "I haven't been eating a lot of Mexican food lately but this is definitely one of my faves.  The burritos are DELICIOUS.  The people that work there are really friendly and even if there is a line, it seems to move quickly.  I like the ambiance inside, which makes it even more appealing to go.", "author": "Britt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "This place is wonderful because the food is quite decent, fresh salsa bar and people are SO NICE!!  I just love the people who work here. I've been going here for more than 15 years.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-07", "description": "This is my Neighborhood Taqueria, walking distance. I've been going here for the past 13 Years, but no more. Smaller Portions, Larger Prices, and debates on whether my Azteca (Wet) Burrito had Cheese, it didn't. The Person who made it argued with me on the Phone, It had been take-out. I used to be a frequent Customer 2-3 times a Week. No More business shall I give them. Took me a month to get the hold of the Owner. He offered me no apologies or explanation. This not the only issue I've had in going there. But No More. Consistently I've felt the staff unable to recognize a regular, I've been over looking the this and the many mistakes, less then quality due to the fact it was walking distance. I'll go to the MIssion or cook at Home instead.", "author": "Bill F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-19", "description": "Seriously good burritos.\n\n\n I've had many a different burrito, but I never enjoyed one much more than at my local joint, Casa Mexicana. It's been a few years, and so I forget the name of the burrito I always used to get, but I can describe it.\n\n\n Filled with steak, rice & refried beans. Wrapped, then sprinkled with grated cheese and put in the microwave for 15s to melt the cheese. Then covered 1/3 with sour cream, 1/3 with guacamole and 1/3 with salsa. Basically amazing.", "author": "Alistair H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-28", "description": "I'm a little stumped by the advertising claims of \"No Cans\" when row upon row of canned sauces can be seen in the stockroom.  Overall, the items that I've ordered are fairly authentic, minus the green and rust colored tortillas.  I really enjoy the photos of Mexico City of a bygone era, it makes me long to take a trip to the Valley of the Chilangos.", "author": "Rafael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-09", "description": "I've been coming here for several years for one reason and one reason only: the best burritos, hands-down, I've ever eaten anywhere, AND in my favorite neighborhood in SF.\n\nI've tasted their other food, which is good, but their burritos are the best.  You can custom-make them any way you like, and the ingredients are delicious: black beans, spicy chicken, and melted cheese in the flour tortilla.  I grew up here and always come back.\n\nGranted, burritos are not authentic mexican cuisine, but who cares.  These things are awesome and will definitely fill you up.  Those with smaller appetites can easily share one and be satisfied.\n\nYou must eat here, NOW.", "author": "Andres S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-29", "description": "Very good Mexican. Fresh, fast and delicious!", "author": "Eric H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-17", "description": "If you get one thing here, get the Alambre. Beef cheese and bacon. That's all you need right there and tortillas. For $5.50 it can't be beat!", "author": "Francisco O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-09", "description": "While the prices are decent, flavors are pretty bland. Lunch is the best time to go when the drinks and salsas are still fresh. There is salsa made fresh every day, but take-out containers are only given if asked. There's usually horchata and two other agua frescas. The strawberry and pineapple, two flavors that are usually super sweet, were not. There were steak and chicken fajitas options, but no carne asada or pollo asada. The super burrito is pretty big and I'm glad this place has refried beans. I like that the cheese gets steamed onto the tortilla before the fillings get piled on, instead of it being sprinkled in. This place even serves breakfast items even though I've only seen them open for lunch earliest. Service is slow in the beginning of the day as most staffers are doing prep work and only one person is managing all the orders. There is a mini fridge of bottled drinks, including beer.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-22", "description": "I eat here about 2x a month because its the only tacqueria in the heart of Noe Valley.\n\nWhy only 3 stars?\nThe food could have a lot more flavor to it.  The meat doesn't have enough flavor--maybe it's too cheap of ingredients?\n\nSalsa Bar:  They treat it like its gold or something--you have to ask for a container and then they only give you one.  You have to ask for a second.  The bowls in the salsa bar are usually only 10-20% full...I mean, c',mon how expensive could this stuff really be?\n\nThere is a lot better and I want them to get better. I hope they read these reviews.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-18", "description": "Not awful at all, and not \"oh em gee\" fabulous either.  It is good.  Consistent.  Sometimes a line, and sometimes you can walk right in and order.  You can almost always find a place to sit and eat if you want to eat in, and that is great.  \n\nThe menu is vast.  Taco's, burritos, mexican plates to choose from.  Lot's of meat options for you carnivores, and vegetarian options as well.\n\nThe owners have had this locations for almost 11 years now, and the only suggestion I would make is to add a bit more flavor/seasoning to pick up the meats, rice and beans.  Also, an upgrade to the chips could be in order.", "author": "Jason I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-12", "description": "I don't understand why this place keeps raising their prices. I know we're in a recession, but here's what other businesses are doing during this time-----actually lowering prices to bring in more business!\n\n$8 for a burrito is getting a little steep. I noticed the staff is cutting back on the amount of meat they put in as well. After being a loyal customer for many years, I don't think I'll go back. Something happened here with management change or something, but it's not working.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-19", "description": "This place is awesome. I have high standards when it comes to Mexican food due to my childhood in southern California.  This place is great. There are many choices of chicken moles i have tried, all of which are good, and the vegetarian burrito is also on point.  They have a salsa bar as well.  Definitely worth a try!", "author": "Michael P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-13", "description": "I really like this place. It's not authentic or anything, it's a total noe valley burrito, but it uses good ingredients, the chicken mole is excellent (i get them to put the sauce on my veggie burrito sometimes), I love the hot salsa. It's very satisfying, but the burritos aren't so huge as to leave you gasping. Just a really good, solid place.", "author": "Edmundo C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-04", "description": "I just love this place. The tacos/burritos are AWESOME! Fresh clean ingredients and you see them make your food right in front of you. They give you a choice of fresh guac or half an avocado. I also enjoy that their meat looks and tastes fresh. The best part is that the staff is super friendly, especially the cashier.", "author": "Tea F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-23", "description": "Here's a little lesson of why you should follow your instincts.\n\nI had been dreaming of a Papalote burrito all day - the craving even followed me into yoga class, where I found my thoughts wandering off the mat and up a block to where amazing effing burritos live.  I left class and walked straight up there, only to find a massive line...which is totally normal, but I felt it was the universe's way of telling me to continue up didn't even hesitate and continued up 24th, to see what kind of takeaway options my subletted Noe 'hood had to offer.  Here's where I should have slapped myself and said \"what are you thinking, opting for Strollerville Noe instead of Burritoville Mission, you doof?!\"\nAlas, inner monologue was not in my favor.\n\nSo I wander into Casa Mexicana where it all looks and smells proper and wait in line by some guy, placing a takeaway order for him and \"she\".  Like \"she does not want sour cream, no sirree\" and \"she wants just a tiny dab of guac...yes, yes, that much\" and \"she is going to kick my ass if I don't get this right so please help me out here,\" etc... \nI order the Burrito Azteca, which sounds like everything I want in a burrito - fully stuffed, with red sauce on top, cheese, salsa, the works on top.  I walk the two blocks home, slightly salivating on myself, open the container and dig into...nothing.  A big, heaping burrito that totally put the flavor on the side.  How is it possible to create such a beautiful assembly of meat, beans, sauce, salsa and so on and forget the effing flavor?!  The black beans were crunchy dry tasting to boot - boo.  \n\nTu Casa es no bueno, Casa Mexicana II.  No bueno at all.", "author": "Kati S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-31", "description": "Every time I stay with my friend in Noe Valley, I try to make a trip to this burrito place. It is hard to find a flavorful vegetarian burrito, but these veggie burritos are pretty amazing-  tons of sour cream and guac AND you can add cilantro and many different types of spicy salsa.\n\nDId not like their shrimp quesadillas- watery and sour tasting, yuck.", "author": "Maggie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-17", "description": "Cheap but I ordered two things because I wanted to try their flauntas, along with my Tofu ranchero burrito, so my meal was more than $10. Let's just say the only things I thoroughly enjoyed were the chips and my bottle of Dos Equis Amber. \n\nJust say \"NO\" to the flauntas, even though they look appealing on that platter behind the glass.\n\nThe burrito was basically a big tortilla with some rice, beans and about 10 pieces of tofu. Great if you're a vegetarian on a high carb diet. And as others have mentioned, it does have lots of options for all you vegetarians out there.\n\nNo worries, you guys enjoy the veggies out there in Noe Valley. Me? I'll truck my ass over to the Mission District for truly satisfying, heart attack inducing Mexican food. Bon appetit!", "author": "Cat T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-04", "description": "Hands down the worst burrito in San Francisco! Period.\n\nSoggy wet wrap because it come with lettuce! The beans were cold. The chicken was chewy like rubber. Rice was under cooked and there was absolutely no spice or flavor to be found. The chips were even stale!! Places like this puzzle me, how on earth do they stay in business?", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-27", "description": "They could improve on freshness and quality of the ingredients, but the tacos and burritos sure do have potential", "author": "Ricky L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-15", "description": "Whoa. Maybe I was starving to death but this place hit the spot! I usually go to Taqueria Cancun for some authentic Mexican, but I live in Noe Valley and this was super convenient. I got 2 \"super\" tacos and the girl piled on the ingredients until it turned into a taco salad..(couldnt see the tortilla's anymore!) I think I put about 8 different toppings on my tacos. Pretty generic and Chipotlesque but my tummy was happy so no complaints here! I think I will be frequenting this place quite a bit more often.", "author": "S. M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-17", "description": "Cheap. \n\nI like cheap.\n\nAnd for all you vegetarians, there are tons of options!\n\nI liked ordering the green spinach tortilla. It made me feel \"healthier.\"\n\nI had the conchita pibil as a regular burrito. Comes with free chips. Who doesn't love FREE?\n\nBurrito was less than $6. I was satisfied.", "author": "Misha F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "I was looking for an affordable place to eat on 24th st. and I found this place. I only tried the tacos here, which were mediocre. I like this place because there are so many meats to choose from so I usually just point to the meat I want. The tacos do not taste like authentic Mexican tacos but it stills taste good.The tortilla usually gets soggy from the meat. There is a good meat to tortilla ratio. Usually when I order tacos from other restaurants, they give me way too little meat, but at Casa Mexicana puts plenty of meat on the tortilla.", "author": "Eva L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-20", "description": "I have eaten here before and have always found the food to be at the bottom threshold of adequate, however this time Casa Mexicana really outdid themselves with suckiness.\n\nYeah,  this place is whack. They get away with sub-par service and food because they're the only Taqeuria in Noe Valley.  My burrito was warm at one end and essentially ice cold at the other. I'm not sure how they were able to create micro-climates within the food, and perhaps I'd rather not know,  either way the shit was no good. \n\nEven after micro-waving my food at home, things did not get any better. The various fillings in the burrito were straight up bland and watery.  I felt like I might have more success in consuming it if I drank it through a straw.", "author": "C P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-11", "description": "I've eaten here a few times and it's always awesome.\n\nI usually get a basic veggie burrito - beans, rice, guac, pico de gallo, salsa verde, cilantro and lime juice.\n\nIt's awesome!\n\nhttp://www.flickr.com/photos/ifindoubt/3910639704/", "author": "Garry C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-24", "description": "I do not like this place. tried it abt 5 years ago, not impressed. Got a neighborhood coupon - you know the ones sent in the blue envelope - for half off a burrito if you buy a drink.  thought I'd give them another try-what the heck. it's been awhile; maybe there's new cooks.  My standard order is a carnitas burrito with the works.  Just blah. I don't like their chips either. no flavor.  oh, and I'm Mexican American so I think I know what a good burrito is. Save your money. walk into the Mission. try La Taqueria, or pick another place instead of here.", "author": "Cathy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-19", "description": "I go here when I really want Mexican, but I'm too lazy to drag my ass down (and then back up) that hill that separates Noe Valley from the Mission since its pretty much your only option for fast mexican food in Noe.\n\nIts not very good, but it is cheap, and you do get chips with it. The worst parts of the burritos are the meat. I was much more satisfied getting a veggie burrito here than a meat filled one. So, if for some reason you totally can't leave Noe and walk the extra blocks to the mission, you can give this place a shot...remember stick to vegetarian and you won't hate your choice the next day.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-01", "description": "Wonderful food, great quality, and fantastic prices! If you like burritos, you'll love this place.  Fresh grilled vegetables available.", "author": "Sean T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-01", "description": "These guys get away with murder in terms of quality and price because they don't have any competition in Noe Valley. \n\nThe folks behind the counter are rude and will nickel and dime you for every possible substitution and addition, including their mediocre salsas with which you'll try in vain to drown the taste of the food. \n\nDrive, walk, or roll down the hill to the Mission and choose a place at random rather than settle for this place.", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-10", "description": "I went here based on a recommendation from Vegansaurus.com saying they loved it. I even got their recommendation, the tofu ranchero burrito w/refried beans and avocado. \n\nThe place was clean and good service but the food was just meh. I've had just as good at my local taqueria, Ocean Taqueria in Ingleside. Nothing bad about the food. Just nothing special.", "author": "Butch B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-03", "description": "This is probably one of my least favorite taquerias in San Francisco -- they only thing it has going for it is the location.   On my last visit I had a Super Burrito with carnitas.  I like my food spicy and went with refried beans and spicy salsa.   I think my Norwegian friends in Minnesota would find their burritos tasteless and boring.  I just didn't have any zing.   The Chile Releno was a soggy lump of dough with a tough pepper in the middle.", "author": "Ed J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-31", "description": "I've always passed by this place but have yet to eat here. The wait at Savor was way too long so we gave in and decided to finally pay this place a visit. As with usual taquerias, wait in line, order and pick up at the register. The menu is pretty much the same as others too. They have burritos, tacos, enchiladas, quesadillas and other traditional Mexican dishes. What this place has the most don't is a patio seating.\n\nBright terra cotta wall with wooden tables around. Feels like an actual taqueria in the middle of Mexico, I wonder if the lack of cleanliness is suppose to induce this feeling. With the \"authentic\" feeling to this place, the food really doesn't taste authentic. There's better places in the mission. Service is efficient and friendly. The prices are comparable to other  taquerias.", "author": "Lola L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-05", "description": "Muy mediocre!\n\nMy boyfriend got a steamed broccoli burrito.  The lady asked if he wanted sour cream and guacamole.  He opted for the guacamole, and so she wrote \"Super Burrito\" on the foil, and he was charged a full $1.20 more -- just for a dollop of runny guacamole!  (Why not just charge 60 cents for the side of guacamole, like it says on the menu?)  And this super burrito?  Was it super?  No, it was full of bitter, uncooked broccoli.\n\nI got the chicken flautas.  The lady plopped three into a take-out container, then threw some cheese on top and threw it in the MICROWAVE.\n\nI'm sorry, did someone just say \"microwave\"?  Yes, someone did, and it was me, because I went to a Mexican restaurant where they threw my flautas in the microwave.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-02", "description": "You know what... despite all the haters out there... (I mean really... dramatic much people?) I LOVE this place! For so many reasons...\n\nFirst of all, they are super close to my house... so the location rocks. Then... they are really friendly in there. One employee, I believe her name is Maria, is the best. Because I frequent this place so often... about once a week... she immediately knows what I want and can start making it as soon as she sees me. Even when the lines are long... you move thru it fairly quickly. The food is just like many of the other Taquerias in the city... so don't expect anything earth shattering or gourmet. Just expect good basic Americanized Mexican food at a decent price. My fav is the Azteca Burrito... but much of what they have is tasty. The chips are yummy and always worth getting. \n\nSo drop in, grab a burrito and a beer and enjoy!", "author": "Matt O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "I really like this place. I would give it 3 1/2 stars since it cannot compete with papalote burritos but certainly better than chipotle. The people there are so nice and friendly, and make authentic food that is fresh and served with love. Among an overpriced strip of noe valley restaurants, this is a great little place to grab a beer with a friend and hang out extremely casually. The chips are pretty good too!", "author": "Michael B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-13", "description": "I ordered two items a little while ago.  A grilled chicken quesadilla and a grilled chicken super burrito.  What I got was a very good quesadilla and a vegetarian burrito.  The problem is that I paid for the super chicken burrito and didn't get any chicken.  I've been here a number of times before but not when they were this buys.  I probably won't be back.  I miss Azteca Taqueria.", "author": "Douglas A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-13", "description": "This might be the worst excuse for Mexican food. I ordered tamales and the shell tasted like paste. It wasn't crumbly...just stuck together...like paste! I bought some tamales at Trader Joe's for about 2 bucks and they were 10x better. The chicken was dry and lacking flavor. I normally ALWAYS finish my food. I even finish other people's food. But I ate half of my food this time...that's how bad it was.\n\nThe guacamole was neon and watery and the sour cream was also watery. Give me a break, do you really have to water down guacamole and sour cream? You can probably get 5 lbs of sour cream at Costco for 5 bucks! \n\nCasa Mexicana II = yuck", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-23", "description": "Mexican food is by far my favorite.  I went here on a rainy San Francisco Saturday and despite my unusually high spirits and good company, I was quite disappointed with the actual quality of the food.\n\nMy quesadilla was better than my partner's burrito, however, it wasn't all that good. The tortilla wasn't cooked well enough, the guacamole didn't taste authentic, and the sauces weren't very good.\n\nThe service however, was incredibly friendly and I give them stars for that. The overall restaurant wasn't the cleanliest place I've been in.", "author": "JERK STORE .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "My go to burrito spot in noe valley. Great food, friendly staff and convienient location. Highly recommended.", "author": "Brad B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-09-03", "description": "I've eaten at this restaurant probably a dozen times over the past few years. In the beginning, I loved this place because the decor is much more charming than most taquerias. However, over time my opinion of this place has drastically soured. \n\nHere are the strikes against it that cause me to not return: \n1) chips taste like they've been cooked in month old fryer oil\n2) salsa choices are slim, they're stingy with it, and it's among the poorest i've had\n3) refried beans are watery and lifeless\n4) when they scoop salsa and black beans onto your burrito they don't drain properly leaving a dripping and soggy burrito\n5) grilled chicken and beef looks and tastes pathetic\n6) i ordered a grilled fish burrito and they mashed all the juice out of the fish trying to make it cook faster - ugh!\n7) i ordered the grilled steak fajita burrito and they mashed all the juice out of the steak trying to make it cook faster - double ugh!\n8) I've tried to ask them not to mash my meat while they cook it and they hold their arms up like there is nothing they can do about it and go on mashing. This is what they told me, \"sorry that's the way we cook it.\"\n\nIn the end, I conclude that this place is operated by and staffed with idiots who don't give a crap about the food they serve. My one star covers the decor and the fact that my girlfriend (who has not posted a review) likes their tofu ranchero burritos.", "author": "Griffin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-08", "description": "This place is not really that authentic, but it hits the spot when you are up on 24th street running errands.  It is not everyday I can find a place that will make me tofu enchiladas so really that is why I adore this place even if it isn't very authentic.  If you want real mexican food goto the mission, if you want to try something that is good and has somewhat of an \"american\" flare...check this place out!", "author": "Morgan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-03", "description": "Sorry folks, but this was awful for us.  And we were so excited to see such a promising Mexican restaurant in Noe Valley!  We had reluctantly given up our desire to eat Mexican in Mission because we did not see a single place to park after circling for about 20 minutes.  We should have kept circling down there.\n\nThe food took forever even though the restaurant was not particularly busy.  When the tamale platter finally arrived, the tamales were literally cold-- not room temperature, but chilly in the middle, and they the wrong type of beans were on the plate.  (Why ask the customer what kind they prefer if you are not going to make sure to give it to them?)\n\nThe pico de gallo had no jalapeno in it, so to me it was just a mushy tomato relish.  The tomatoes they used had that force-ripened flavor and texture, too.  We were given zero salsa on either platter and everything was bland.  The guacamole was totally ordinary.\n\nThe steak fajita was ok, but not particularly memorable.\n\nThis may be a place to go if you are hungry, not picky and are not in a hurry, but pass it by if you want really good Mexican flavors.", "author": "Donna K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-25", "description": "This is a really solid, reliable place for the standard taqueria fare when I want to stick close to home.  My stomach wails \"give me nachos\" and all I have to do is run across the street and get some.  And they're good, too!  Sometimes I wish they weren't so darn close, then I wouldn't be tempted to head over there so often.  But hey, does a place exist in this city where you aren't within arm's reach of a burrito?\nAnyway, if you're veggie (or even just a friend of the veggie) then give the steamed broccoli burrito a try.  It's an interesting take on the average burrito if you wanna mix it up a little...", "author": "Becca V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-27", "description": "What the heck was I thinking, eating Mexican in Noe Valley?\n\nI mean, El Farolito is right across from Bart, where I had just been. But I guess I didn't realize I wanted to grab dinner on my way to Bliss Bar for the LFN, until it was too late. I almost turned around, then I saw this place and said \"how bad could it be?\"\n\nWell, it wasn't really bad. I had the enchilada dinner, which was pretty good for $7. The rice was very gritty, and well, the \"guac\", I don't want to think what it was. Realistically though, this place is not bad.  It is nice inside, and there is lot of seating, and  a clean bathroom. It's just when you think of all the places just a scant few block away in the mission - eep.\n\nNext time, I will remember to try the Yucatan place just up the street, instead.", "author": "neil c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-31", "description": "If I've got errands to run in Noe, hit WaMu, grab some coffee, do some window shopping, and get a little hungry for some quick grub, I'll come here.  \n\nI know the Mission is literally down the hill but sometimes I'm that lazy.\n\nDecently priced with lots of variety, their burritos still hit the spot,  I always stick to the steak burrito.  Meat good.", "author": "Jenn A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-14", "description": "A decent taqueria. \n\nNothing extraordinary, but when you're in the mood for cheap Mexican cuisine, this place is up for the challenge.\n\nThe set up is slightly different than other taqueria's I have been to in the past.  It has more of a cafeteria style ordering system, mostly in the sense that your order is made right in front of your eyes (think Subway sandwiches but with a burrito).  It's nice to see how it's done.\n\nThere are more options available than most taqueria's I have frequented prior (for both carnivores and vegetarians alike) which is a huge plus in my opinion.  My friend had the marinated tofu in her burrito once and said it was delicious!\n\nI'm a simple guy in many ways so I stick with my traditional vegetarian burrito.  When I'm craving it, Casa Mexicana delivers!", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-13", "description": "I love this place!  Not many places offer full vegan burrito options.  Their tortillas have no dairy, rice is not cooked with chicken stock and the guacamole does not have dairy in it either.  \n\nThis is not a high end place by any means.  It is what it is, a great burrito.  I'm there at least once a week.  Freaking love 'em!", "author": "Bobby B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-01", "description": "This place has mastered the art of fast, fresh delicious Mexican food. Like a lot of other taqueria's, you can see all the ingredients and make your burrito, tacos, enchilada, etc just like you want them - a la carte or make a plate w/ beans and rice. They have a great variety of meats but they have grilled and steamed veggies for vegetarian meal and everything is fresh with the ingredients constantly replaced. They don't charge for their fresh made chips, prices are real good and they have Mexican beers in the fridge. \n\nMy favorite thing here is the Azteca burrito - It's a super burrito with just rice, beans and meat inside, topped with enchilada sauce and melted cheese, and then topped with sour cream, salsa and guacamole. Mmmm.... massive, wet and delish to the last bite. Their hot sauce is tasty and spicy and their to-go packaging is reliable.", "author": "Kristina A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-31", "description": "Food is ok but I have a HUGE pet peeve when it comes to taqueria's and their rice.  Why do they put peas in perfectly good rice???  This is a very strange practice and I do not understand it and I actually avoid places that do this.  Peas do not taste good in Mexican food.  No idea what they are thinking.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "I am a fan for the following reasons:\n\n1) Great Fajita Burritos with tomato tortillas\n2) Decent Taquitos - If I ever had company at the last minute, I would totally buy these to entertain\n3) Marinated TOFU!  This place is great for vegetarians.  Although, like almost any taqueria, if you are a strict veg then I wouldn't suggest dining here and i'm sure they sometimes use the same utensils for meat and veggies, but still, solid place, perhaps even for Vegans. \n\nI agree with the sentiments of another Yelper - the guac isn't great... I don't like it's sour-creamy texture... but everything else is pretty good!", "author": "Maulie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-30", "description": "I always head here for an affordable, filling lunch in Noe Valley. Of course it's not really comparable to the far better taquerias in the Mission, but it is good for a quick Mexican fix. They have an extensive menu with many vegetarian options. I like how you can pick what type of tortilla (flour, wheat, or spinach) you want went your order a burrito/quesadilla. I often just get a regular burrito which is pretty big for about 4 dollars. The carnitas and grilled chicken are always safe bets. I feel like their food is slightly less greasy than at other Mexican places which is plus. They also give you free chips and salsa if you ask. I wish their spicy salsa had more of a kick though. \n\nThe one thing I would not recommend is the fish tacos. They just give you a small sliver of tasteless salmon that they slap on the grill for a few minutes. It's totally not worth the money.", "author": "Bonita L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-08", "description": "Considering I eat here at least twice a week, you would think I would give it a better review, but my frequency is more of a matter of convenience and price. Overall the food is good, but just not outstanding.\n\nI will give a four star rating to my favorite dish, THE SUPER TACO: two soft tortillas (stacked) with rice, beans, meat, guac, sour cream, salsa cheese and lettuce. I usually go with carnitas and pinto beans here. The ingredients are stacked on a plate or in a to go box for the amazingly low price of $3.91 after tax. Oh, and that includes chips and salsa.\n\nThis is more than enough food for most people making it a great bargain. If you are on 24th (up in Noe) and want to stop in, you should. But if you pass through the Mission to get here, you made a mistake.", "author": "Kemp M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-23", "description": "good enough food but make sure to ask for the burrito in tin foil or something cus otherwise, it just comes out on a plate and is impossible to eat.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-09", "description": "We love this place.  It has been our favorite Mexican place for over ten years.  Wonderful burritos and tacos.  The meat is delicious, lean and fresh.  I love watching the meat guy grilling carne asada, cutting up grilled chicken...making everything from scratch.  We recommend the chile verde burrito.  The chicken mole and grilled chicken and beef are also terrific.  And we always end our meal with the flan and/or rice pudding!", "author": "Aki L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-28", "description": "The lenten season brings me to eat a little healthier: no soda, no deep fried foods. To top the cake, no meat on Fridays.\n\nLast friday, my boyfriend and I came here to gobble on their melt-in-your-mouth shrimp quesedillas and sort-of-alright grilled fish tacos. The great thing about this place is that they prepare the hot food in front of you, none of which was fried. The crappy thing was the bland grilled fish tacos. Oh, I crave for batter-fried fish tacos. Forty-something more days...", "author": "Ramona P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-28", "description": "Holy Relleno! i got a chili relleno on the side of my enchiladas and this thing was the size of my face! and i have a pretty big head. fairly priced and large portions will bring me back here to try their other items. the enchiladas were a bit on the dry side if i had to say anything but over all friendly staff and good food.", "author": "Matt F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-09", "description": "The ingredients are fresh. Lot's of options... TOO many options - the menu is confusing. The prices are, well, a rip. $3.80 for *one* taco with no extras. They let the salsa go sharp on the salsa bar. I'm being generous - 2.5 stars really.", "author": "Chuck S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-10", "description": "I came across this taqueria when I first visited the city for a two-week vacation. Since then, I've broken up, made friends, annoyed my boyfriend, and even fallen in love... all because of CM dos. \n\nI first visited with my ex who used to frequent the dos when he lived in SF. He said it was the best place to eat because if you're poor you can buy a burrito for 5 bucks or so and spread it out over two meals. This was hardly the glowing review I wanted to hear of the restaurant where I would be having the first lunch of my SF vacation. My snobbery was quickly dismantled when a burrito the size of my calf appeared on my plate. Sold!\n\nWhen I moved to the city, I did exactly as my ex suggested. Some might say \"oh, how the mighty have fallen\" in a snarky tone, but they probably don't have many friends. \n\nNow, I can't consider any friendship valid unless it meets one of two requirements: I've introduced them to CM dos, or they already love it. Naysayers need not apply for my affection. \n\nPerhaps CM dos had something to do with my taste for latino men, perhaps it didn't; we'll never know for sure. But I now have a Mexican boyfriend, and CM dos is a site of contention for us. It's not that he dislikes the food (see aforementioned passage on friendship validity), but he rather dislikes how I pronounce the name of the restaurant: using a hard x sound instead of the more correct h sound. I don't remember if I was embarrassed or angered by this observation, but it probably didn't end well, so I'll let sleeping dogs lie. \n\nBut alas, should he ever leave me, I have a backup plan. Yelpers, I have fallen in kinda-love!... with the lady who works in the CM dos serving line. Her hoop earrings were just picante enough to catch my eyes, and I have a hunch that her nimble hands and knowledge of how to make my chili relleno burrito juuuust right would satisfy me to the end of my days. To be honest, I would probably love her mole chicken and chili rellenos more than her, but all relationships have their muddy areas. \n\nI'm not sure what else Casa MeXicana Dos has in store for me, but its track record is astounding. Between repeatedly impacting my life and introducing me to the biggest and best burritos this side of south-of-the-border, my heart will always belong to the little taqueria that could in Noe Valley.", "author": "Brian K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-12", "description": "You know what to expect of a burrito this far away from the Mission. My salmon burrito was better than her steak fajita burrito.", "author": "Rob T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-08", "description": "Okay, so I was probably 10 or 11 at the time, but one day I was hanging out with a new girl who just transferred to my grammar school, and her mother took us here where I ate my very first burrito. That's right, my burrito cherry was popped here, and since then it's held a very special place in my heart. Sure, there are better burritos in the city, especially since the mission is only a few blocks away, but this is comfort food. \n\nI still remember exactly what was on that burrito, and keep coming back for more. \n\nSo now-a-days it's not as popular as it used to be, where you would have to wait in long lines, but it's still just as good. Some words of caution though, if the place looks pretty empty, you might want to avoid things like refried beans, they tend to congeal a little if they've been sitting there for too long. \n\nEverything is always fresh and well cooked, their agua fresca is also amazing.", "author": "Allyson S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-30", "description": "Lots to choose from. Full tummy for a few greens. Line moves quick enough to avoid any sighing or shifting of your weight.  Fresh Salsa.\n\nAverage experience for the tastebuds.\n\nRice could use a little more moistYness. Chicken chimi's were more tortilla than anything. Chips a little too hard.\n\nNot ecstatic about the experience, but not dissapointed either.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-16", "description": "Excellent breakfast burrito. Ordered mushroom and eggs. Added chicken and had the whole thing grilled to perfection. Yum! Inexpensive to boot.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-28", "description": "It's an okay choice if you're in the vicinity, craving a burrito or some nachos, and you're too lazy to walk down to the Mission.", "author": "Zell C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-08", "description": "The food here was thoroughly mediocre, although I appreciated that they offered grilled salmon (for your taco, burrito, whatever) and straight-up avocado instead of guac. Would probably only come back if I were in a pinch.", "author": "Elle B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-28", "description": "Mediocre.  My brother ordered a super carne asada and it was cold. The cheese was not melted and they threw in lettuce (yuk) even though he asked them not to. My regular chicken burrito was dull. What's worse is the sassy attitude behind the counter. I didn't enjoy paying for the food when it seemed like we were just a bother to them. (We didn't even ask for any substitutions) Nope. I'll take my  business elsewhere.", "author": "Carmen M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-15", "description": "We just moved to the neighborhood and need good Mexican food weekly so we thought we would give this place a shot.  Bad idea.\n\nWanting low fat, we ordered the tofu burrito and the rice and bean burrito.  We had different beans and salsas in each burrito to mix it up a bit but they were both a huge disappointment.\n\nIf you are really hungry and just need something nutritious to fill your gut, this will work, they even have whole wheat tortillas.  Otherwise, walk a few more blocks down 24th and you will hit the really good places.  Almost any where between Valencia and Portrero on 24th offers really good Mexican.\n\nMexican and Noe Valley just don't go together.", "author": "Brenda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-23", "description": "I will admit, this is my neighborhood Burrito spot, so  I love this place.\nGenerous portions, high volume so everything is always fresh.\n\nSome of the folks there make better Burritos than others, but I have never had a bad one.  The Fajita Burritos are especially yummy.\n\nI hear there are better taquaria's in the mission , but nothing beats my favorite local joint.", "author": "David R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-03", "description": "Okay prices, but the food was just okay. My tacos came with nothing but meat - which I think is pretty odd, and not especially delicious. The service was pretty poor.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-18", "description": "They not only serve tasteless Mexican food - which I didn't think possible - they serve it cold to lukewarm.\nAdd to that a dirty restaurant and you have a place that lacks any appeal.  \nSomeone should open a decent burrito place in Noe Valley.", "author": "Dixter D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-07", "description": "Very fresh and tasty. A bit pricey for Mexican cafeteria style food, but this is Noe Valley. A bargain is the flour Tostada. Free chips plus a variety of salsas, self-serve iced lemon water. Not very clean floors, utensils, and tables, but this is a high-volume convenience joint.", "author": "Lotion M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-06", "description": "Such a good taqueria! The food is 5 stars, and the chefs are really nice. They have a lot of variety as well as tried and true favorites (e.g. rice, beans, cheese burrito).\n\nThe space is fairly old, but it has a nice homey Mexican feel to it. Many people get takeout, so there is pretty much always seating.\n\nGreat for kids and adults alike. Check it out!", "author": "Catherine L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-20", "description": "Food was good, enough said.\n\nThe reason for the two star review was the pricing bait and switch, and the lack of explanation of the pricing, inconsistency between menu pricing and what I was charged.\n\nWe ordered a super veggie and a chorizo breakfast burrito.  The super was unaltered and the price somehow jumped from $5.50 to $8.50. On the breakfast burrito I asked for cheese, jalepenos, hot sauce, pico and a tiny bit of lettuce and the price also jumped up nearly $3.  I expect to be charged for cheese - even though a breakfast burrito should have cheese - but to be charged for lettuce!!! WTF!!!\n\nAt least they had the Giants game on.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-19", "description": "I've gone to this place many times over the years, simply for convenience and stomach fodder. You won't get sick, but you won't enjoy your meal either. I'd say this place defines mediocrity, if you want the real thing walk the extra blocks to the Mission... or convince someone to finally open a decent Mexican place in the Valley.", "author": "Tobias P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-30", "description": "Love this place. Really fast, really good ... never lets me down! I love their super burritos. With avocado instead of guacamole. Yum. Always have a good selection of agua frescas and love that they have breakfast burritos now too. \n\nIf you could give 4.5 stars, I'd do that because the one thing that could make it better? If they stayed open just a teeny bit later. Noe Valley sorely needs more options after 10 pm then the donut place. If they pushed to 11, I'd be there at 10:30 with bells on! \n\nIf you're not into the kid scene, beware this place is total kid so it can be a bit of a zoo after school or on Saturday afternoons. But then again, if you aren't kid friendly, you're not likely to find yourself in Noe anyways.", "author": "Isabel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-31", "description": "Good quick bite! Add guacamole and cilantro and I'm happy everytime", "author": "Alaina I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-09", "description": "don't go here.  i know, you're in that hood and are too lazy to go to the mission, but resist the urge!\n\nit smells like any other taqueria but they serve their burritos cold.  which means all that lukewarm/cold stuff is sitting there germinating some additional protein.  about an hour after eating there i got a sore throat and some kind of weird hacking cough that i couldnt shake for two weeks.  all my symptoms are gone now but still wondering what the hell that was (not a cold).   maybe the server had swine flu or something.   this is what i get for wanting a quick lunch between errands.\n\nif you must get something there, microwave the shit out of it before you eat it.  and make sure you get your hep-B shots.\n\nworst mexican place ever.  and disgusting.  the fda or whatever organization that is that checks food hygiene should check this place out.", "author": "X X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-26", "description": "1) Bad guacamole.\n2) Bad \"hot\" salsa.\n\na) Ripe avocados\nb) Better pollo asado than any mission taqueria\nc) Excellent salsa ranchera, which is plenty hot.\n\nSeveral of my friends hate this taqueria because of their gross runny guacamole. This is avoidable. You will awkwardly request that they construct custom guacamole on the burrito by way of ordering avocado, cilantro, onions, salsa, etc., and you will have excellence in foil. If you are a chickenatarian, it is better than any burrito in the mission.\n\nUnfortunately, they squish your burrito wrong when they roll it up, but this is survivable. If you care more about the tortilla crispiness, then stick to Taqueria Cancun.", "author": "Ben D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-25", "description": "I really like the burritos and they have a good selection of meats and the veggie options look good. I must admit, it's close to my house and if I have a little more time, I prefer Papalote.\n\nAlways friendly, fast service and good, fresh chips. I nearly always get the chile verde pork super burrito, but was VERY close to going with the chorizo today, which I haven't tried yet. I admit, this place is more like 3.51 stars, but that rounds to 4.", "author": "herf j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-06", "description": "A safe, well lit place for tacos.\n\nIt's like taking a field trip to the Mission with valet stroller parking and handy table-side access to the Noe Valley Voice.\n\nMy favorite taco in SF.", "author": "Jack K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-02", "description": "Ok...it's been a while since I've visited this restaurant but I still remember the lousey food that I got. Ok, first off this place really doesn't seem clean. In a place like Noe Valley you would expect something a little nicer. My food was not good at all. I had a chicken burrito which was given to me very cold....like ice cold at one part. Yeah the price isn't bad but I'd recommend checking out some of the other nearby restaurants instead.", "author": "Barbara O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-25", "description": "Best Mexican food in Noe Valley.", "author": "Joel W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-21", "description": "I love Casa Mexicana 2 and then 1, in that order, and have been to both. It's right next to Savor which is also one of my other favorite places.  I have never been disappointed with the quality of food @Casa Mexicana and everyone's nice too. A great place for lunch or a very very early dinner. There're many great Mexican places in the city and this is one of them. The only negative thing I would say is that their TV & music is too LOUD and can make your dining experience really miserable.", "author": "Marc N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-11", "description": "I would have given it a 3 star but the Lady's working there are pretty rude the food was OK I normally get the sope with chicken but the chicken has a lot fat and it was really chewy... The rice and beans are really good...", "author": "veronica n."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-08", "description": "BURRITO: The chicken in the \"super burrito\" was dried.  The burrito was small, the staff was more interested in talking to each other than serving their customers. \n\nGUACAMOLE:  I didn't know you could make guacamole that looks and tastes like green mayonnaise.  \n\nQUESADILLA:  Dried out and completely tasteless.  \n\nIs there any decent Mexican restaurant in San Francisco?", "author": "Mike O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-03", "description": "i know this seems wrong.  to give casa mexicana II 5 stars when a few short blocks away there are your el farolitos, your papalotes and your cancuns.  but let me explain my case in 3 parts:\r\n\r\npart 1)  they have outstanding tofu ranchero burritos.  this burrito is fantastic...the tofu is firm and slathered in a sweet, slightly spicy ranchero sauce and then piled into a tortilla with rice, your choice of beans (all vegetarian) and salsa.  I add avocado to mine and this burrito is heavenly.  you can also choose your type of tortilla...white, wheat, spinach or tomato.  that isn't that appealing of an option to me because it reminds me too much of california style skinny-fication of the delicious fatty burrito but hey.  maybe you are skinny and want to stay that way.  that's your business.\r\n\r\npart B)  they have other veggie options too which i have branched out and tried...grilled veggies and cactus are also delightful.  \r\n\r\npart III)  the last time i was there, one of the neighborhood homeless guys was in front of me ordering what sounded like a fairly complicated list of food.  they made it up for him on a big plate along with a glass of horchata and a glass of strawberry fresca.  they didn't charge him AND SERVED HIM AT HIS TABLE!  they don't even do that for paying customers!  when i offered to pay for the man, the lady at the cashier politely declined saying that she is happy to be able to help him.  i swear to god, it was all i could do to hold myself back from giving the cashier lady an awkwardly long hug in the middle of her lunch rush.  \r\n\r\nso for all of those reasons, 5 stars to casa mexicana II.  and heed the words of chris m...this is a place for veggie burritos, not meat ones.  i am totally impartial when i say this as i am just your average go-with-the-flow joe with no feelings about meat and the eating of it one way or the other.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-20", "description": "Everything on the menu - everything! - is less than mediocre.  From the stale and cold chips to the lackluster vegetarian options to the salsa.... it's either bad or just barely average.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-28", "description": "Dont even think about, hands down the WORST burrito place on the planet! I can't begin to describe how ripped off I felt eating here. NAUSEATING. Don't be fooled by the good reviews, probably written by their employees.  Read the real reviews below (the ones with 1 star)  'NUFF SAID.", "author": "C E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "Stars only for the surprisingly good nachos!!! Excellently fresh and with beans (yum). Been on a nacho trek around the taquerias in the city and this one is up there.", "author": "Eos d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-04", "description": "A healthy alternative to the greasy mexican joints in the Mission. The \"taco\" is more like a soft tostada, piled high with lots of fresh goodies. You have to eat it with a fork. They have a great tofu, and a yummy boiled spicy chicken. Recommend you start with just one Super Taco, they are huge!", "author": "Julie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-21", "description": "I'm a fan of the vegetarian burrito mainly because whenever I get any meat added, bad things happen.  I'll leave it at that.  They have about 5 choices for veggie people and quite a few more for carnivores.  Pretty good quality.  Decently priced.  I'd go again and not necessarily because it's only two blocks away from my place.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-06-26", "description": "Unimpressive and generic but it's clean which is more than I can say for the places down the hill.  They have great vegetarian options but other than that, it's just a run of the mill burrito place.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-23", "description": "Okay, I have to say that I don't really enjoy SF Mexican food. It doesn't really compare to the food down south. But this place is pretty good. The carnitas meat is flavorful and the have pretty quick service.", "author": "Tyrone B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "I LOVE Casa Mexicana!  We live nearby and have been going there every week or two for a few years now.  I like that you can see the whole kitchen in action and that all the food is freshly made.  The staff is friendly, recognize us and have been around since our first visit.  I'm always suspicious of businesses with high staff turnover.   Never been disappointed here and feel they have decent sized portions and prices.", "author": "Kirsten H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-16", "description": "I moved out of Noe Valley and I *miss* casa mexicana like you can't imagine.  I used to get dinner from here 2 times a week and was in love with their chicken tacos.  Their fire-roasted salsa is amazing, and you can add yummy extras like cilantro and avocado.  The people who work there are so nice, the place is clean, and the price is definitely right.", "author": "C J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-02", "description": "This place is such a letdown. We live close by and I was so hoping that I would be able to have a good Mexican option where a hill wouldn't be involved. Unfortunately, my burrito was not so hot - it was just very bland and tasteless.  The guac was that watery green sourcreamy stuff. *sigh* I guess I will continue dealing with the hills.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-14", "description": "This was my neighborhood burrito shop when I lived down the street. It was great to get a Mission-quality burrito and be able to eat it in Noe Valley. In any other city this place would be five star but let's face it, burrito competition is cut-throat in SF. Try the Azteca (wet) burrito. It's a real treat.", "author": "Aaron V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-12", "description": "I've eaten here many times but on our last visit we saw 5 roaches.  That pretty much trumps anything else I could say about this restaurant.", "author": "Dean P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-23", "description": "On a recent trip to San Fran, I went here with two coworkers for some well earned Mexican delights. I tend to have high standards for Mex, and I thought the food was pretty good, and I'd disagree with the complaints that this place is dirty. It's a simple taqueria, not Le Cirque. The prices were good, food looked and smelled good, and portions were generous.", "author": "Gerard S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-20", "description": "We love this place especially our 5 year old son. We tried to go to Casa Mexicana once week during the past 9 years (my wife 20 years). The food is always fresh, staff very friendly and relatively cheap. I really do not care for burritos being from DC and usually order the shrimp, chicken or beef tacos or other special entree'. It is always very good and I actually had a super burrito the last few times and they were exceptional! We have an annual tradition to have dinner here after trick-or-treating on Halloween. It was a treat again this year.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-01", "description": "Vegetarian burritos are awesome here!!! I like the nachos too. One of the best places to get Mexican food in the city.", "author": "Bernadette B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "Cuando yo quiero Taco Bell...voy a Casa Mexicana en cambio.  La comida es mas mejor, y no tengo que ir al bano toda la noche.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-03", "description": "Got a tofu ranchero burrito here with guac, plus a chicken tamale (banana leaf style). The tamal was better. And as I was walking home back to the Mish, right past Papalote, I realized that's where I should've gotten dinner. Good prices here, though.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-15", "description": "Noe Valley Taqueria...Not a lot of choices for Mexican food on 24th street, so I think they get a lot of business by default.  It is good though, and this is one of the few places I will actually get a vegetarian burrito.", "author": "Pele N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-13", "description": "Ehh. There are far better places to get Mexican than this place. I give it three stars because of their many choices of meat and my bf said the nachos were good. Yet, it didn't wow us. Very clean and lots of kids.", "author": "Katy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-19", "description": "Yeah, yeah, I know you're meant to go to the Mission for the ultimate burrito. But Casa Mexicana is 5 mins from my house, and has never let me down as my default lunch burrito place. \nLots of choice of meat - I usually go for the steak but the marinated pork (achiote?) is damn good too; all your usual burrito choices plus quesadillas, \"specials\", breakfast burritos etc etc. Fantastic. They also have a salsa bar to load up on with your free chips.\n\n\n In short, I love this place.", "author": "Sadie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-28", "description": "I used to like this place ... until the day I came across their workers demonstrating against the management outside. Not a good sign. I found out about management's alleged abusive practices against their employees: \n\nhttp://cbs5.com/business/azteca.taqueria.complaints.2.779706.html\n\nNow I wouldn't touch this place with a 10-foot pole. No way am I eating food made cheap by ripping off honest working people.", "author": "Randy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-09", "description": "Sorry, Casa.  You no flauta my boata.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "Delicious, generous portions of good quality taqueria food.  Very friendly and efficient service.  It is pleasant to eat here or take food out, which I do frequently.  Yummmy!", "author": "Catherine E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-22", "description": "I love this place. I love the variety, should I get an all veggie burrito or a tofu one? How about just a black bean and cheese? Or maybe a mushroom quesadilla? How about a spinach tortilla? I appreciate the fact that they have lots of meatless options, not that I don't eat meat, but sometimes I just want something lighter. When I do eat meat here it's not heavy like some other places meat is. I don't feel all weighed down after eating, which I loooooove. I do recommend getting fresh avo, skip the strange guacamole. The agua de melon (melon juice) is very tasty, I think sometimes they have different kinds. The red, hot salsa is delicious. I've always had a good experience here. Maybe I should go today...", "author": "gabby m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-05", "description": "Ok, don't go here expecting gourmet, and you'll be just fine.  You have to be selective about what you order, but there are a lot of options to customize, which is what makes this taqueria so worthwhile .  Their burritos and tacos are delish...especially love that they have onion, cilantro, WHOLE avocado, and good bean, meat, vegetarian, and tortilla variety.  For all of those complaining about cold, bland burritos, try leaving out the lettuce and tomato...just turns it soupy!  Also, found out the hard way not to order a shrimp quesadilla.  Yuck...bay shrimp??!!  Uh, so NOT ok.  So, word to the wise...stick with the burritos or tacos, and everything will be fine.", "author": "Julie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-05", "description": "what did i have for dinner last night you might ask? i had a quite greasy fajita chicken ala carte, served with salad (lettuce and a slice of tomato) and four corn totillas, which was very palatable.\ni also observed while waiting in line, that they very generous putting meat & vegetables fillings on their burrito dishes.\nwill i give this place a second chance? why not.", "author": "Nelle A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-20", "description": "It's a solid neighborhood taqueria. Is it spectacular? No. But after a long day, it's perfect when you want something quick, consistently pretty good, and relatively cheap.", "author": "Angie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-25", "description": "I came here for some Fish Tacos at lunch, and the place definitely makes a good fresh taco: just don't expect to be able to pick it up in any way, shape, or form. Prices are very inexpensive and the place isn't all that bad; the staff is also really friendly.", "author": "Eston B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-01", "description": "Not great food, especially when you consider how many good options there are nearby in the Mission or Glen Park (La Corneta). I would give it two stars, but they get +1 for being open late and being near my house...", "author": "Jason Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-03", "description": "So, being a native californian, I am always on the lookout for the perfect burrito. I may have found it after nearly twenty five years of searching far and wide. Casa Mexicana Dos! Yes please, give me a burrito chalk full of all the good stuff, and on top of that could you please put an entirely cheese filled chili relleno? you can? ooh thank you! The service was quick and the horchata looked delicious, I will have to try it when I choose a less filling meal next time.  It's a good thing that it is nowhere near where i live because I would gain an increadible amount of weight no doubt.", "author": "Carley B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-22", "description": "- Soggy burritos. Tonight they actually drained out a lot of liquid over a trash can prior to rolling up the burrito.\n- \"guacamole\" is the consistency of pea soup and the flavor is similar\n- temperature is sub-par.  If I get a burrito here, I always nuke it when I get home.  \n- the service is not what you would venture to call friendly\n\nI admit we come here from time to time because we live nearby.  We may just need to change our ways and either go to Glen Park for La Corneta where they have real guac, or to the mission.  \n\nIf you are driving through Noe, don't stop. Keep going east to Mission and you will find many better places to get a burrito.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-02", "description": "Lots of choices, line moves quickly, plenty of space to din-in, and the food is good and very filing.  It's been there for a long while, and hit the \"Casa\" when I feel Mexican in Noe Valley.", "author": "Tiberius A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-13", "description": "Great nachos, good chiles rellenos, quick service.  Kinda lacking in ambiance, but whatever.  Prices are about a buck over Mission prices, but what do you expect really in Noe Valley?  Good basic taqueria food, friendly point at what you want service.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-04", "description": "If you are craving even semi-authentic mexican food, this isn't the place for you. The food is so-so, and for the price, the portions should be more generous. I asked for a little more meat on my super nachos (she put very little) and not only did I get a funny look from the lady, when I went to pay, got charged extra. My advice: Go to El Farolito on Mission at 24th, they are tasty, inexpensive and they serve HUGE portions.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-23", "description": "Burritos are ok, good chimichangas. Usually can get in and out very quickly even if it's crowded.", "author": "andy c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-05", "description": "Great place for a fast meal. Love the burritos my latin sisters are always friendly and cheerful especially the cute cashier with the long hair. :)", "author": "jerry p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-26", "description": "Best broccoli burrito ever, if that's what you're into. Also has a great salsa selection. Good whole wheat tortillas. A healthy alternative to the greasy (but delicious) fare down the hill...", "author": "Kelsey E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-24", "description": "I am surprised the reviews are so poor for this place.  I love their burritos!  The veggie burrito with guacamole and steamed veggies is sooo tasty!  Then for a real treat, cover it with enchilada sauce and you are in heaven.  Although I have to say I saw a wicked protest outside a few weeks ago and haven't been back.  Something about back pay, labor rights, and poor treatment by the owner.  That is such a buzz kill cause the place really is tasty.  Not sure I will go back until they work their shiz out.  I don't want to support a place that doesn't respect it's employees.", "author": "Roberta J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "The closest thing I've found to the Tex-Mex nachos I grew up on in Big D. Friendly staff, and everything is made fresh, right in front of you.  Yummy flan! :-)", "author": "Megan K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-15", "description": "This place is ok. The only thing I order is the super nachos.  It's way overpriced for the quality though. Its usually inconsistent with amount you get too. Little Chihuahua down the street is better and Papalote is even better than the small dog. Unless you're hard up for a burrito save your money and go somewhere else.", "author": "M M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-14", "description": "I've sadly had some bad meals over the span of my life, but the one I had at Casa Mexicana probably tops them all - oh wait B Bar was worse, but the staff was nice. My mom's oyster casserole was way worse, but my mom made it with good intention so that meal gets a pass. So yep, Casa Mexicana's unprofessional and immature staff served me up the worse pile garbage I ever called supper. Soggy tasteless slop that smelled like a old refrigerator. And the chicken was ancient old gangly thigh meat - I think. Who knows really. Oh and a note on the staff - from my one on one experience, they are  basically a bunch miserable teenagers who appear to hate their jobs and therefore the customers. Oh, except they are not teenagers - they are in their 30s and 40s. Literally the cook rolled her eyes at me when she made a mistake and started make a burrito when I clearly ordered a taco. And they the cashier rolled his eyes at me when I asked for a to go cup for my size or horrid salsa. I would go hungry before going back to such a gross and rude place.", "author": "I. V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-03", "description": "Since i have basically grown up in Noe Valley i love this place. My friends and I would always come here after school to eat, and to this day i always come back! I love the veggie burritos!", "author": "maria p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-03", "description": "I'm sure there are better burritos in the world, but Casa Mexicana makes my favorite. I go there every time I'm in San Francisco. They make my stomach ridiculously happy.", "author": "Alexa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-23", "description": "This is a very cute, casual place to eat. I always get the super taco and a flan. The flan is soo delicious! It's as quick as chipotle but tastier in my opinion!", "author": "Amy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-30", "description": "I love their flexibility. They will gladly custom make anything. My kids love it, I love it. Plus, you never get sick from the meat here!", "author": "Patty S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-16", "description": "The guacamole looked like chunky green water. That pretty much killed it for me.", "author": "Alexis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "we walked into here yesterday (monday/holiday) and guess what, it was the azteca mexican place next to my house in castro. yes, there's a different name but inside it's EXACTLY the same. same menu in the same order with the same color on the menu even. The burrito i always get is even still called azteca burrito. i got a taco instead, to pretend it was a different place. it was good. this is a good place when you  want a quick meal, but it's not a real mexican place. if i hadn't have been looking for a real mexican place, i'd like it just as much as i like azteca right next to my house. so i'll rate it well. :)", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-14", "description": "Huge portions and delicious refried beans, plus a salsa bar all very cheap.  I'm a vegetarian so I can only speak for their veggie burritos.  The guacamole is also excellent.", "author": "Carla K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-26", "description": "We opted for Mexican last night, and decided to stay in the hood, instead of heading to the Mission. Big mistake. This place did what I thought was impossible: several different ingredients (pork, sour cream, beans, etc.) and exactly zero taste. It was the most bland thing I've ever eaten. No flavor, nothing but texture. Really disappointing.", "author": "andrea a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-14", "description": "Just about the only affordable place on the block.  And yet, not a dive.  Great variety, amazing meats.  The hibiscus agua fresca is nasty but the horchata was the best we'd ever had.  Huge portions.  Yum!", "author": "C H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-13", "description": "love this place. i live closer to the mission and i know i know, there are much better mexican restaurants there, but most of the time the food is too spicy for my irish ass.  here they have mild, medium and spicy chicken.  this is my go to place for mexican food. i have been eating here once a week for the last 8 years. great variety, whether i'm up for quesadillas, burritos or enchiladas.  and they make it however you like down to each ingredient if you're picky like me. spacious area in the back too so you can eat your grub. wide variety of mexican and american beers, sodas and even my fav.... jarritos!", "author": "Ms. M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-28", "description": "still on 24th st but in noe valley, the prices here are unsurprisingly higher than the other taquerias on 24th. in addition to the standard meat options, there are plenty of 'fancier' chicken choices, including chicken mole, chioptle chicken, etc. we each ordered a burrito and neither was constructed well and fell apart quickly - they really need to learn to roll burritos tighter. i accidentally ordered a super burrito with guac and sour cream but they also put in lettuce, which i would not recommend. all in all, a decent taqueria that will come in handy since we live a block away but doesn't really hold up to the taquerias on 24th in the mission.", "author": "Angi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-22", "description": "This place is OK.  I was really craving a tasty fully loaded burrito so I got their super burrito.  It wasn't all oozy and delish like I had craved, so I was really disappointed.  I also got their strawberry aqua fresca which was also just OK.  It seemed really diluted and wasn't very sweet.  Next time, I'll drive and head to the real deal further down 24th in the Mission.", "author": "Claire P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-16", "description": "I've lived close by all my life, so I'm pretty familiar with this place.  In my experience, it can be both pretty good as well pretty disappointing.  My main advice is to stay away from the guacamole.  To my tastes at least, it usually breaks the burritos.  Also, the hot sauce isn't too hot, but that's a minor problem (don't get me wrong, I love spicy stuff, but it doesn't effect taste or anything).  The steak is grilled nicely, not flavorless or rubbery or gristly, though I've also had much better carne asada at a quite a few places too.  The chile relleno burritos are pretty good, and the dinner plates are generally alright as well.  You may be satisfied at Casa Mexicana, but you'll probably be much happier just walking 6 more blocks into the mission, where you have many more choices.", "author": "c b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-19", "description": "Generally mediocre burritos and tacos.  I've rarely, if ever, had anything really good from this place.  When I go it's only because it's the only burrito place convenient to my house.  As someone else put it here, this is a place of last resort, which I will fall back on when I'm too lazy to walk to El Farolito or Papalote.  The meats are nowhere near as good as those on offer at the Mission taquerias and the final product is often simply lacking in flavor.", "author": "Sasha W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-30", "description": "Definitely MEDIOCRE! I'd rather drive to El Metate in the mission for gringo Mexican food than walk down the street to this place. I had the microwaved enchiladas...so so, the red sauce was watered down chili powder without the hot spice. This place was recommended to me by a drunken white guy. I should have known it wasn't a solid recommendation. It was pretty inexpensive so I can't complain there. I was a little disappointed that they didn't have grapefruit flavored Jarritos. Since it is in my neighborhood, I will give it another shot. Perhaps something they don't have to microwave???? The re-fried beans were pretty good though.", "author": "Leanna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-21", "description": "Azteca taco is bell pepper, onion & beef or chicken grilled up fresh on a couple corn tortillas for under $3.50 incl tax and very tasty. Burritos are OK too. If you need a bite in the neighborhood, I'd recommend them.", "author": "Paul F."}
