{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "I randomly ended up here because it was right opposite the Safeway and they accepted cards. I had a super veggie burrito which was impressive! The lady at the counter was really nice and suggested a spinach wrap which turned out really good.\n\nIt's a pretty modest place with limited seating. It's perfect if you want to grab and go. I was surprised to see people queuing up, not so surprised anymore!", "author": "Vignesh B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-03", "description": "For a late night shop, this place is practically a godsend. However, on any other occasion I would hesitate to come here or recommend my friends come here. \n\nFor starters, there's nothing wrong with the service or the staff. What I presume were the owners were nice and friendly to my friends despite being a bit loud from a night of drinking. They did have a decently large selection of choices. \n\nWhat made me view this place as okay was mostly the delivery of their food. I ordered just their regular burrito with cheese and carnitas. While not terrible, the burrito only served as a reminder of better burritos elsewhere. The tortilla was very meh, particularly since it was soggy from the beans but it lacked the consistency needed to hold the innards of the burrito together. Personally, I think the tortilla was too thin and would have benefitted from being toasted longer to dry out the moisture. \n\nAlongside this though, the carnitas was severely lacking in depth of flavor. It had kind of a basic sense of saltiness but poorly blended with soggy tortilla and watered down black beans. To alleviate the poor performance in flavor, I did try to supplement with some of their sauces. I would say was also average. None of them had a kick to them that enhanced any of the ingredients of the burrito but kind of seemed like it was fighting for right to be king of the flavor profile.\n\nOverall, I would say this place is great if you're having drunchies after a night of drinking as it was still open past 2 AM but for the quality of the food it was nothing exceptional.", "author": "Ryan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Food was awesome and the staff is just so caring and nice. The woman working there was so determined that I have the best possible experience, it honestly made my day. Salsa selection is also lovely. Love this spot.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "I came here with 8 others friends on a Sunday afternoon. The place seems to be owned by mom & pop, and I felt very welcome. I ordered corn Tostada with chilli chicken. Your order comes with small chip & your choices of sauces. The tostada was very crispy, and the chicken was very well prepared. The ingredients tasted pretty fresh, and I enjoyed my meal. The place has tons of seating area, and it is good for a large group. I would recommend this place for anyone to give it a try.", "author": "Lisa O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-23", "description": "I used to think their food wasn't as good as the other taquerias i frequent, especially el castillito just a few doors down; but then I found out it's because they don't use any lard to cook the food, which is a huge plus for me. They're the only burrito/taco shop open late in the area too, which makes it a good stop over for me on the way home from work.\n\nSalsas are bomb, which is the mark of a good taqueria to me. (If they cared enough to make their salsas good, you know damn well the same care was taken into everything else).", "author": "Mike A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "This like the Noe Valley location produces very solid tasting food at more than reasonable prices, the way regular Mexican food should be. The selection has plenty of options and the staff is friendly to friendly people. If you need some food and have been drinking that is totally ok, but they don't take shit from stupidly drunken, young or old people no matter what the circumstances.\n \nIf you are the Milennial San Franciscan with money, this is not the place for you because it is the bare minimum in terms of decor, and their only two TVs are tuned to Spanish sports stations. You won't talk about it for months or get pretty photos to put on your instagram.", "author": "David A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "I don't know what kind of morons are working here, but I asked for a regular burrito: meat, beans, salsa\nInstead I get some bland garbage. It was grilled chicken with Black beans, BUT NO SALSA. I specifically asked for spicy salsa. Instead I get bland bull***t. Wasted nearly nine bucks on this crap. \nI should have just trekked over to the Mission and gotten a burrito with SALSA!!!!!?\nYou know, that filling comprised for TOMATOES, Onions, and what not......it actually makes you feel like you're not eating sawdust.\nStupid jerks! Now I have to spend another $8-$9 on a burrito.\nThere burrito was so bad I threw it in the street", "author": "LL O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-13", "description": "My small group found this little Mexican restaurant near Safeway and thought we should try it.\n\nOriginally, I wanted a breakfast burrito, but the employee said that they ran out of something. I couldn't understand some of what he said so I ordered something else.\n\nMy burrito was huge and it was good for the price I paid! I also got some chips since I got a to-go back and the employee gladly put some in. Oh, if you want to dip your chips in salsa, don't forget to ask for the little cups. I don't know why they don't have it out. It would have been more efficient that way.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "Love this place.  I probably visit once every other week, and I've found it has consistently good food, made quickly.  Even better:  they take credit cards.  Best:  every single person I've encountered working there has been friendly.\n\nI'm more a fan of tacos and enchiladas, so I can't speak to the burritos...but the tacos and enchiladas get two enthusiastic thumbs up.", "author": "Jamie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-19", "description": "Well it seems brighter, more colorful and maybe more pleasant than the complete hole-in-the wall a few doors down, but don't let it fool you; Casa Mexicana is severely underwhelming. Just to level set, I'm not a burrito snob and I'll enjoy a so-bad-it's-good type spot where the food is greasy but you regret it later. But I had a burrito tonight from here and it was the worst - cold, no flavor, greasy and the cheese tasted off. Even when I asked for \"spicy\" on the salsa it was flavorless. My colleague asked for carne asada tacos and took two bites before declaring them colder than room temperature. I'm giving it two stars for now, but I will come back tomorrow and cut it back to one if I wake up and have diarrhea in the morning.", "author": "philip k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "This orangey taqueria makes me feel more nostalgic about San Francisco than anywhere else. Who says vegans can't get fat? I gained some weight in San Francisco that I brought home with me to So Cal when I used to eat tofu burritos on an almost daily basis from 21 to 23. Casa Mexicana is the first place I went out of my way to visit this past weekend because this taqueria is still naranja. Besides a couple of new and grotesquely large booths that are at least comfortable, it is exactly the same as it has been since I first ate here over a decade ago, very homey, unpolished and comforting.\n\nI actually never reviewed this place ten years back because I used to go to the other taqueria on the other side of Church that was probably a cousin of this place and also served tofu. This place is still really cheap - $6 for a tofu burrito with spinach tortilla with chips and salsa. The tofu in the burrito is as incredibly yummy, guisado and stewy. Unlike other places which order a boring veggie burrito option, this place has been making a rich and thick savory sauce that cannot compare with 'sofritas' at Chipotle. Unfortunately, not many tofu burrito options as of yet in LA. The salsa is also fresh. I like that it offers a large, spacious back room to eat with many table options. \n\nI wish that such a delicious taqueria with tofu existed in Los Angeles, but alas Mission District style tofu burritos have only ever been duplicated at a place called Dolores (complete with a wallpaper of the map of the Mission District of San Francisco on its walls) in Berlin.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "Came here for breakfast & lunch oh boy will leave here with stomach full and licking gum~\nNice place clean and love walls decor enjoyable amstophere plenty of room to chow down with friendly staff~\nWill be back again~", "author": "Jeberechiah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "I eat here all the time! Good Mexican food,  great taste! The staff are very friendly and they accept credit cards which is a big plus. My favorite, Chicken Mole and Chili Verde!!", "author": "Alvin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "Quite good taqueria on Church street across from Safeway. Always fresh and great frescas! Good vegetarian selection including napoles and a zucchini and corn burrito. Extra star for super friendly service, clean and large dining room with two tv's. This place can easily compete with Mission taquerias, but better pricing and no crowds!", "author": "Lorenzo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "The mole is awesome. I crave it!!! My belly is growing big because I can't get enough of the mole. \nIt's more affordable than most places too. I can feed my family of four, which includes teenagers, for under $40.", "author": "Leanne F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "Very nice grilled chicken taco w bell peppers and onions and salsa.  Comes w chips for $4.50.  Like all taquerias they pour oil on the grill before cooking, next time I'll see if they can do it w/o all the grease.  I'll be back.", "author": "Scuba J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-02", "description": "Good, consistent and the ambience is not why I come here, I go for the food. I like that it's more authentic than some spots and use fresh ingredients with a range of filling. I like the wet burritos and horchata. Priced - good value. I used to go to Castellito but found it hype after 4-5 visits . \nOne night I observed they (Castellito the nearby taqueria) used cheese slices rather than grated or quesa fresca in the burrito and this prompted me to try here, and I stayed. \n\nLived in Southern California where Mexican food is better than Northern, found a few great spots in SF that rival and not newbie to Mexican cuisine, and this is my preference in this neighborhood.", "author": "Grace B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "This restaurant takes credit...what a big step. I stopped by on Church because El Castillito was closed on NYE. They have a nice selection of vegetarian burritos. I got the tofu burrito and it was only $6. Prices are good here...and the food is too.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "AMAZING burritos! Very kind staff, fast service, AND THE TAKE CREDIT AND DEBIT CARDS!!!!! The meat is flavorful and tender, and the salsa is phenomenal! Highly recommend", "author": "Morgan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "This is my favorite place to get chicken mole - they make a delicious Azteca burrito (with sauces on top) and it's a great thing to order when REALLY hungry. The service is also excellent & everyone's really friendly. The salsa bar is decent (spicy!!!) & includes lime wedges and raw onion to add on yourself.", "author": "Alina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "Perfectly decent taqueria in the Upper Market area (across the street from the Safeway). Do they make the best Mexican food in town? No. But if you're in the neighborhood and looking for a quick bite at affordable prices, their tacos and burritos will certainly do the trick.\n\nI came in here the other evening to satisfy my hunger pangs. I wanted something quick & easy, and not too heavy. I wound up ordering the Super Chicken Taco. It's essentially a giant plate of grilled chicken, beans, rice, lettuce, guacamole, cheese, and salsa cascading over a tiny tortilla. In fact, that poor tortilla never stood a chance. This is definitely a taco you should probably eat with a fork & knife instead of with your hands. Yes - it's that huge! \n\nAs a nice little bonus, they give you a bowl of chips and your pick of salsa at their salsa bar. This whole meal of Mexican goodness cost me under $5. So no complaints from this hungry, frugal gringo!\n\nI'd definitely return to Casa Mexicana the next time I'm in the hood.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-21", "description": "Just moved to the city and have been scouting out my go-to burrito place near my Muni station/apartment. I get off at the Church/Market/14th Muni stop, so El Castillito and Casa Mexicana (probably only a dozen or so steps from one another), inevitably came up as the two most convenient contenders. Tried both, and the verdict is in- Casa Mexicana is the winner. Here's why:\n\n1. Their breakfast burrito is one of the best burritos I've ever had, and only $6.95. A good burrito for under $7? Sold. Free chips and salsa? Solder.\n2. While there are only a dozen or so steps between Casa Mexicana and El Castillito, Casa Mexicana is closer to the Muni stop (it essentially drops you off at its doorstep), and the few extra steps you have to take to get to El Castillito are pretty suspect. It seems that the crazies like to linger in between the two establishments, so not having to traverse that path feels not only more convenient, but just safer, as insignificant as it may seem.\n3. I really like the service at Casa Mexicana, and the general vibe/layout feels more friendly and homely. Not sure if it's a family-run establishment, but every time I go the people who come in and out are spoken to like family. Either way, the vibes are good.\n\nSo basically- really good food, really cheap food, really convenient spot, and really friendly spot. Can't complain, and now very loyal.", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-21", "description": "I got two carne asada tacos... the meat tasted old and was very dry. I tried to moisten with hot sauce but there was no hope.", "author": "Tania A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "The food is very good and great service! We always go to eat breakfast and the lady always welcome with a great smile! They always try to make the food the way we want it. The place is always clean.", "author": "Rosie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "My all time favorite spot in the city. Not only do they have Frida all over the restaurant but they also have veggie beans and rice and advertise it so theres no communication issues. Super friendly restaurant and very accommodating. I bus down there just for their beans and rice to take home. nothing as topped their's!", "author": "Alison Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-24", "description": "I came here on an unassuming Saturday afternoon after a failed trip to get to mission. I jumped off the muni disappointed until I saw this little gem of a restaurant. Spurred by the eager line coming out of the door, I entered slowly.\nI got my super carne asada burrito quickly, but realized after seeing the selection of meats behind the glass panel, that I should have gotten carnitas or the freshly grilled pollo. \nThe burrito was alright. Definitely could of had more meat or salsa in it. I asked for hot salsa, but it wasn't really spicy at all. Not the best in terms or flavor, but the people behind the counter were really nice! And it is like right off the muni stop. May be back to try more.", "author": "Ernest C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "Everything on the menu is great, freshly prepared and perfectly seasoned.  The staff is friendly and the service if quick.  No fuss, no muss.  You won't be disappointed!", "author": "Marilyn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "This place has the BEST quesadillas in town. Their other dishes are good, but Casa Mexicana's quesadilla makes El Farrolito's quesadilla want to commit seppuku. Come here for a late night quesa and you will be very, very well served!", "author": "Ken H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-30", "description": "One of the worst Carne Asada burritos I've ever had. Complete waste of 8 dollars. \nSalsa is good which is why they get 3 stars. \nCastillo up the street destroys this place", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-28", "description": "We're always on the lookout for burrito places we haven't tried yet so we stopped in here to try their menu. Under the vegetarian burritos, I saw the standard vegetable and tofu ones, but \"cactus\" caught my eye! I'd never had such a thing, so why not? I ordered the regular grilled cactus burrito which included rice, beans and salsa, and we also had an order of 3 tacos (with various meaty toppings).\n\nThe food came out pretty quick and there was a lot of it, for a good price. There were chips and various salsas available to add on top of our food and a back seating area that was pretty quiet. The cactus burrito is pretty wet and I had to eat it with a fork and knife since it wasn't really easy to pick up as per a normal burrito. \n\nThe staff was super nice and friendly and I liked the wide range of items on the menu, especially for vegetarians. \n\nThis is worth checking out if you're in the area and looking for some good burritos or tacos.", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "I've been here a couple times and good is really good, the only reason I don't give 5 stars is because the people that work there don't always have the greatest attitude. Other then a shitty attitude the food is awesome", "author": "J. R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-17", "description": "Awesome location. Quick bite when waiting on the J train. If I order 2 tacos and there's no line, I can be in and out of here in 10 mins.", "author": "Yad L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-20", "description": "After a satisfying happy hour cocktail down the street, my buddy and I needed some dinner in the mediocre mecca of food, Duboce Triangle.  We settled for a burrito at Casa Mexicana around the corner, and when I looked up at the menu was thrilled to see that they offered chorizo.\n\nI attempted to order a chorizo super burrito but was summarily told that it wasn't possible unless I added an extra $2.  Unsure of where this charge was coming from, I stared at where the lady behind the counter was pointing at the menu, which still made no sense.  After some back and forth, I decided that communication wasn't going to work and instead ordered the carne asada super burrito for $8.  This was a little on the expensive side for a burrito of this caliber but there aren't many options in the area.  The burrito was a bit boring and the steak was pretty sinewy.  The salsas were pretty good though, as were their chips.\n\nService was not good, and getting what you actually want can be a chore.  Their menu is complicated and convoluted, and I was generally not impressed with much here.  I'll find a much better burrito in the Mission.\n\nFood: 6/10\n\nService: 4/10\n\nPrice: $\n\nAtmosphere: 5/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Ive been out here two years and this Is my favorite mexican spot..the food Is always fresh authentic and delicious..staff Is always nice and friendly and the place Is clean with seating In the back to drink a beer and catch the game..\nI highly recommend the chicken mole..tastes like my aunts from the old country..\nthanks you guys!!", "author": "Henry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "Not open until midnight on Sundays. \n\nThanks for wasting my time, Yelp. Not surprised though - it's about selling ads, not actual useful info. \n\nMy favorite burrito in SF though!", "author": "Rocky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "An amazing experience of Home cooked Mexican food and Mayan delights\nIncredible desserts and great juices and beer.\n Hunks of pork awesome sauce\nGreat frijoles this is Mexican/Mayan food that is as authentic as anything in the Yucatan. When visiting Church Street\nDon't be persuaded to spend more at the hip joint nearby. Above Market, closest\nTo the Safeway, tucked in gorgeous double wooden room of Diego and Friday\nArtwork with a tiny courtyard in back\nIs Cada Mexicana. The place to drift away in over a stupendous meal .", "author": "Bob R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Tasty food and quick!  I have been going here off and on through the years and it has always been a good, solid stop for great, tasty, reasonably-priced food.  Plus they are open late.  Love it!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "I really like eating tacos at Casa Mexicana particularly during the day when two very sweet ladies are working. They are always friendly and build generously-portioned tacos to order.\n\nThe chicken mole has great flavor, a measure I always use to judge a good quality Mexican joint. The menu is very inexpensive, and the food has never disappointed me. \nHighly recommended for a delicious, unpretentious meal for a steal.", "author": "Duke D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "This is one of the good ones.\nThe guacamole, like other places, needs work, but the salsa is great and the meat is flavorful!", "author": "Xander M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-14", "description": "6/10 on the burrito scale. \n\nThe chicken in my burrito had great flavor, but the cut was pretty fatty. The chips were decent but free so can't really complain. \n\nHowever I will say the super burrito fed me for 3 meals, so I certainly got my money's worth. \n \nI appreciate them for not going easy on the avocado. Thank you for that Casa Mexicana.", "author": "Marilyn M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-14", "description": "Without a doubt, the worst burrito I have ever had in my entire life.  \n\nI've had some sad, Mexican-food related experiences (primarily involving my butthole), but this pushed me to the limits of my dignity.  I threw half of it away before I made it a block down the street.  I'm pretty sure I was eating it with a cartoon-ish frown on my face like a caricature of a sad person.  \n\nI watched the lady who made it load it up with rice, meat, beans, and cheese.  Somehow, in defiance of the laws of nature, the first four bites were just tortilla and sour cream.\n\nIf I had a time machine, I wouldn't use it to kill Hitler.  I'd go back in time and slap this burrito out of my hands before I could raise it to my mouth", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-29", "description": "I was hungry n the sign lit up next to Safeway and since I wanted a burrito I stopped here. scared walking down into this place, I went for a steak burrito instead of shrimp because I thought they may not be up keeping the food. Omg was I surprised!! Everything looks so fresh on the hot table, n they reheat the meat for your order, instead of done places just dumpin cold meat into a burrito. The cashier very nice. The dips and toppings were amazing. Tasted fresh and authentic. Maybe i'm use to while in the wall Mexican food places that this just blew my little mind.\n\nSeating is ok. Its Castro grab n go walk the area its welcoming", "author": "Andrea B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-03", "description": "The super burrito isn't so super. The lady making the burrito seemed like she had a burrito up her ass and was rude. They only give you a small handful of chips and they were staled and tasted weird. Wasted $9, the people in the area aren't accustomed to REAL authentic Mexican food. You have to go to Mission, best burrito spot is El Farolito. Don't waste your time and $$$$ over here.", "author": "Max H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-09", "description": "Nah. They take credit cards but don't get close to Castillito a couple of doors up. Their guacamole is bland. So is their hot sauce. The steak isn't fresh. It passes but unless u have a ton of cheese on ur burrito (cheese everything better) it's not gonna be a party in ur mouth.", "author": "Maryam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-29", "description": "After all these years I have living in the city by the bay... I finally had the chance to explore this burrito joint for the first time in this area!!! I had a tough time in the beginning and I wasnt sure if l should try Casa Mexicana or Taqueria El Castillo... Reason why I chose Casa Mexicana is because they had one paticular special burrito which I have never heard or seen before and that would be the Azteca Burrito... After seeing that, I decided to order myself that Azteca Burrito!!! It was a little pricey but who cares how often do I get to come at this area on my day off!!! After eating up the entire Azteca Burrito... It was a little spicy with the enchilada sauce... I managed to survive it all with the help of my Jarritos fruit punch juice!!! Overall Casa Mexicana for me isnt that bad of a place to eat a burrito!!! The Latin girl who made the Azteca Burrito for me was very friendly and cute and also another cute latin girl who worked behind the caah register was very friendly as well!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "It's not like there's a shortage of taquerias in the Bay Area, and they mostly have a bunch of the same things. If you're a fan, you don't care about the decor, you don't care about the vibe, you don't even really care about the price (within reason). You just want the food to be baller. And Casa Mexicana nails it. It's on your way into (or out of) the Castro, so it's a great cheap bite if you're on your way into (or out of) the neighborhood to hit the bars. Even my vegetarian friend is a huge fan.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-13", "description": "The food is good but I went in tonight and guy walks in behind me as I'm standing at the counter, ready to order.  Counter woman immediately recognized him as a regular, ignores me and asks him (in Spanish) what he wants and starts on his order.  I'm still standing there . . . ahead of him.  That's crap. . . Two stars for food.  Zero stars for service (or lack thereof).", "author": "Boris L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-17", "description": "I've stopped by here for years, but tonight sealed the deal: no more. I ordered a meal and sat in the back. A few minutes later a belligerent man sat in the back and started insulting me. I went to the counter and alerted them that I was being harassed by an unstable man. They came back and he quieted down. As soon as the staff left the room he started up again. It got to the point that he lifted a chair and threatened me. I yelled for help and nobody came back. So I exited to the front. The staff would not confront him because they \"are not a man\" (most of the employees are female and the only male there did not speak English). They would not call the police. They would not refund my money even though I had to flee the restaurant in fear of a crazy man. \nIf you are a woman, do not eat here.  There is no security.", "author": "Bryan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-16", "description": "Accepts plastic and way nicer interior than that other place down the street!\n\nI've tried the tacos de; carne asada, al pastor and vegetariano. All super good and don't break the bank. \n\nRecently discovered to ask for hot salsa on my tacos. That stuff is Chernobyl quality (nuclear radiation) sauce. Mmmmm, me likes.", "author": "Hilda Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-31", "description": "HOLY CRAP THE MAKE A BIG BURRITO. Not an especially good one though, I'd say it's a little under-salted and when you're essentially having a meal of excess why skimp on the salt. If you're going to eat a portion that big you might as well just really enjoy your gluttony.\n\nGood salsa bar though!", "author": "Misha T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-15", "description": "Never been here before, always went to Castillito a few doors up Church. Casa Mexicana definitely has more and better vegetarian options. I opted for a chile relleno burrito. It was very good, but also very oily. I guess that's the nature of the chile relleno beast, though. \n\nWith so many great taquerias in the area, it's hard to give this place more than 3 stars. So I won't. But I would eat here again.", "author": "Brett W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-27", "description": "When I'm in the area with my husband, we always go to El Castillito. 'cause it's amazing. But I was out by myself and decided to branch out by stopping here. I had a carnitas super burrito. It was tasty and there are definitely a lot more, clearer options here. But I also did find some pretty large membranous material in my burrito. That type of thing happens with carnitas, and I understand that I'm eating meat that has connective tissue, but that was still a little offputting.\n\nIn general El Castillito is the superior choice, but if you need more veggie options, I would definintely go here.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "Everytime I go back to San Francisco, I never miss Carly's Zumba class Saturday mornings at the 24 Hr Fitness on Church and Market.  Review to follow on why that is.  And having a reliable Latin-themed workout always seems to put me in the mood for Latin-themed food, particularly for food from a hole-in-the-wall, under-$5 burrito joint that stay open reliably late.  Casa Mexicana I to the rescue!!\n\nFOOD: Is very good, though there's no one particular item on the menu that I think puts Casa Mexicana I on the map more than any other Mexi joint.  Even so, I thoroughly enjoyed my delish egg and mushroom breakfast burrito - the medley of that scramble with good Mexican-style Spanish rice, black beans and LOTS of spicy salsa roja, all wrapped beautifully on a whole wheat tortilla TOTALLY hit the spot after a long hard workout.  Mmmmm... nothing to reward the calories you just burned by replacing them!!!\n\nAMBIENCE: Actually, for a hole-in-the-wall, it's quite nice.  There's actually vintage antique lights that hang down from the small walkway between the front and the dining area in the back.  Colorful mosaic tiled walls.  I wouldn't mind dining in if I ever had time.  However, since I'm always on the run every time I come here, I usually just want my burrito as quick as possible so that I can stuff it in my face as quick as possible. =) And Casa Mexicana I is pretty good with accommodating that too - I'm extremely picky in how I want my burritos assembled and Casa Mexicana I lets me boss them around as much as I want. So I reward their efforts with this review.\n\nPRICES: Burrito was $6, which was more than I remembered it to be last time I was in San Francisco (about 2 months ago).  Oh well.  Worth the $6, though I guess that sort of makes my less-than-$5 claim less legit now.  Still a bargain eat in San Francisco, where everything, from burritos to assless chaps, is expensive as hell.\n\nPARKING: HA!!! HA!!! HA!!! Oh, you were serious.  Well, then, seriously given that this place is a half block down from the N Judah/ J Church stop, I would say - both lines are better than trying to find parking in the gayborhood.  Or anywhere in San Francisco really.  Or if you're close enough to walk here... more power to you.\n\nThis is definitely going on my breakfast burrito list...", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "Yummy yummy burritos. And affordable too- with free chips! Lots of seating in the back is also a plus, with some really awesome decor. When I lived in this neighborhood, this was my favorite place.", "author": "Hannah F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "One of the best Mexican food places I've had here in the city. I usually get burritos. Place is inexpensive...quite a bargain for the size of burrito you get. Definitely come here if you're hungry cuz you'll leave with a full stomach.\n\nService is quick and friendly. \n\nI recommend it every time I have friends out of town.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-19", "description": "\"I used to go there all the time!\"\n\nMe: \"Really? It was that good?\"\n\n\"I don't know, but the guy working behind the counter was gorgeous. We called it 'Hot Guy Mexican'.\n\nCasa Mexicana is totally serviceable. Need a burrito? It's got you covered. That said, Castillito is right down the street, and that's much more authentic (and flavorful). If you just pulled up Yelp because you're debating between the two. Turn right, and go to Castillito. \n\n/review", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "I was there and bought a Torta and it was so big I had to take the other half home, it was delicious! \nI recommend getting the \"Torta with Steak\" yummy!", "author": "Amb V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "This place is awesome!!!  Consistently good for years.  The location is convenient and if your hungry before or after shopping in the neighborhood grocery store stop at casa mexicana for a great burrito.  The spicy chicken is my favorite.  Check them out and you shall be pleased.  Oh by the way order delivery from them and it was still good.  Wow", "author": "Nino S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "I travel all over the Bay Area for work and very few times I've been able to find a place that is so consistent at delivering fresh, delicious Mexican food at a low price. Anytime I'm in the area I always visit this place. The girls at the counter greet you with a smile and the food is made right in front of you. Plenty of space where to sit and enjoy your meal. It also happens to be one of the cleanest restaurants in the city.\nI strongly recommend the regular carne asada burrito or their Chicken Mole burrito.", "author": "Juan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "Literally my favorite burrito in sf! Refried beans and rice are both super flavorful and vegetarian. Their salsas (especially the red one) is soooo good!! Free chips, lots of seating, and great veggies also!\n\nHighly recommend, for $6 you can't find a better veggie or vegan burrito in sf.", "author": "Setu U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "This is my go to burrito place.  Why?  They have some serious vegetarian options, and even have tofu (not all burrito places have this).  Their vegetarian burritos are 100% vegetarian, and I know this because I eat them often and have not gotten sick.  They use fresher ingredients too.\n\nThe staff is very friendly, and they even allow (and encourage!) me to use my horrible Spanish on them. Practice... \n\nJust be aware that they are not the fastest.  I don't mind because I never go in there when I am in a rush.  But if your lunch break is super short, or you have limited time, if there is a line just know it might take a few minutes.  Well well worth it.", "author": "Karen R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-17", "description": "Good for a quick snack after you're done with shopping in nearby Safeway", "author": "Igor P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-19", "description": "Great salsa, friendly employees, decent prices.\n\nThis is an authentic Mission style taqueria with quality food. The atmosphere is quick-n-cozy. The burritos are huge and girthy - look out ladies. You might want to get the baby burrito here;) I usually don't finish mine and the lovely ladies behind the counter are happy to wrap left overs to go. But really, the quality of the tortillas, meat, and salsa are what puts them over the top - not just their size.\n\nThis is the best taqueria in the neighborhood.", "author": "Matt D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-13", "description": "bland burritos here we go! i order the vegetarian tofu ranchero burrito. they use that ridiculous steamer machine and pull on the big slot machine lever until the living daylights have been steamed out of the tortilla. can you grill the tortilla for christ's sake?! this is the first step to a delicious SF burrito and you missed it. so she slaps the big soggy ass tortilla on a piece of foil and asks \"what kind of meat?\"\n\n\"ummmm.... tofu?\"\n\nso it gets bland rice, bland beans, bland tofu, and bland salsa. that's it. everything else they charge extra for. even a few shreds of iceberg lettuce is $.40 extra. a simple burrito can be great if all the ingredients are done right, they missed the boat on every one of them. after that their salsa bar sucks and they don't provide containers. you have to beg them at the register to give you one little plastic cup for salsa. just protecting themselves from salsa thieves i suppose. anyway, just save yourself the disappointment and go to el castillito up the street. it's 1,000X better...", "author": "zachary p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-16", "description": "The burrito is one of the all time foods ever invented. The idea to put rice, beans, meat, sour cream, avocado, and salsa all in an oversized tortilla. Perfect combination of flavors, big enough to satisfy those with large appeites, no fork needed for us manly men who think knives and forks only get in our way, great stoner food after the munchies kick in. \nThis place is up there with the best around. Get a super burrito or if you wanna use a fork, get a wet super burrito. Great salsas availible for your tortilla chips. Only drawback is prices in the city are goin up on burritos. In the good ol' days burritos were $5 bucks. With a drink your looking at $10. But what ya gonna do. Your near the heart of the city, near market street. A it's a damn good burrito.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-06", "description": "I'm trying not to be biased here because I've been to one too many taquerias up and down the west coast.  But seriously, this place is NOT where it's at.\n\nPeas and carrots in the rice, hmmm, interesting.\n\nSo a friend and I order the super burrito al pastor.  Then the cook says there's no Al pastor, so we got carne asada, then he opens the fridge and says \"Ohhh we have al pastor! Do you still want it? And we were all YES!!!\"  So my friend and I were super excited, got the whole sha-bang (minus the salsa) hella lime and chile verde sauce.  So...I'm in a good mood, pay, even tipped $5 because I was stoked about the al pastor...THEN... dun dun dun...\n\nI take a bite...it's freakin carne asada. Negatory.", "author": "Edrian D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-18", "description": "It's gotten so much weaker and flavorless! Conveniently next to the 37 bus stop to get up the hill to my boyfriend's, but just not having it anymore. The other joint down the street is supposed to be better, but it's cash only and I'm a debit card queen. So alas, I'm stuck with mediocre burrito.\n\nThey always get my order right and are friendly, but beans need salt, meat can be overly dry and they never put enough sour cream on when I say no guac on a Super Burrito. Plus the chips were stale the last two times I was there.", "author": "Alita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "Way better service and ambience than the other burrito place on this block and a little cheaper, too.\n\nThere is even a great place to sit in the back with a TV (I'll look over the fact that twilight was on).", "author": "Brie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "burritos here are amazing!!!!! I like this place much better than the other mexican place a few stores down.", "author": "K L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-09", "description": "I assumed that any taqueria not in the Mission would not be worth my time.  How wrong I was!  Let's talk about this massive burrito I was served up.  It literally was the size of a baby following a good ol' womb expulsion.  The burrito was wet inside and that tickles my fancy.  I hate dry burritos.  Yes, my impending food baby eventually fell apart, but that's what a fork is for, no?  Not a huge array of salsa choices, but the two I had were all the right kinds of spicy.  Oh, yea.  They give you chips and if you give a few winks to the lady at the register, she may give you a refill.  \n\nYup, I am a seriously fan.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-18", "description": "Proximity forces me to compare Casa Mexicana to El Castillito.  El Castillito is the clear winner (on comparison of burrito and taco selection).\n\nHere's what Casa brings to the table:\n\n- Fishier fish. Casa's shrimp taco smelled more like a fish taco.  That ain't a good thing\n- Crappier meats.  Casa's are less seasoned, and play a smaller role overall in the burrito\n- Fewer greens\n- Less fresh chips.  This was a no-brainer.  Serve a sub-par burrito, but get the customers back on delicious tortilla chips.  Nope.  Casa's chips were served room-temperature, and slightly chewy.  Not good.\n\nA quick glance at the menu suggested that Casa has more vegetarian burrito and taco options than its superior neighbor to the north.  If Casa can't put any vegetables into a meat burrito, how am I to trust it when the veggies play the lead role?  I just don't think I'll go back to Casa Mexicana.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "I liked the burrito I got from this place, for two reasons. One, it had chorizo just the way I like it: mushy and gooey. Two, I could not detect the presence of that vilest of herbs... cilantro. I don't know how this compares to other tacquerias in San Francisco, but it certainly beats anything in the other places I have lived: the East Coast and Europe. So, this will get a cautious 4 stars. Also, it's open late!", "author": "Jason G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-13", "description": "Love this place and their cheap, huge burritos. It's a wonder I don't come here more often now that I live a bit closer. I personally recommend the Tofu Rancheros burrito - at least two meals worth of food. With it, you'll get delicious fresh baked chips. Top all that off with a mexican coke or perhaps a beer and you'll be feeling good for hours.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-09", "description": "Worst pollo asado burrito I've ever had. I never NOT finish a burrito, especially when I'm really hungry, but last night was a first.\n\nNot one, not two, but 3 hairs in my burrito.. wow, someone's been shedding around the food a little too much.\n\nThe food was completely cold. And I don't mean coldish, I mean completely cold. Come on, can't you keep your food warm or at least warm it up again?\n\n2 stars because I've had one there before (because I was walking past and starving) and there was no hairs in it last time, so at least it's not consistently that shitty.", "author": "Alexandre T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-21", "description": "Super tacos al pastor?  YUM.\n\nChorizo tacos?  YUM AGAIN.\n\nGreat food.  No lengua or cabeza or anything outside of the whiteboy menu like that... but still very good at what they do.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-12", "description": "My friend and I stopped here while we were walking by. There was a couple running it that night and super friendly. I was a bit surprised on the prices as well but we were in San Francisco, so I suppose that is to be expected. Living in Chicago for a few years and being able to get super yummy tacos for under $1 each it was a bit surprising. You can still walk away with a pretty cheap meal if you split it or if you do vegetarian. Ours was each under $5 because we split a meal. \n\nLoved the Frida Kahlo and Diego Rivera decor and pictures!", "author": "Mindy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-08", "description": "Casa Mexicana was pretty close to getting 3 stars from me but there was one big factor that prompted me to round down the score: The burrito, while tasty, had an overall feeling of wetness and pretty much fell apart despite my being very slow and methodical about peeling off the foil as I ate my way down. And I ordered carne asada, not one of the stewed meats that you would expect to result in a wettish burrito. It didn't help that they steamed the hell out of the foil-wrapped log; I'm not a fan of gummy tortilla.\n\nI was also annoyed that they ran out of chips several hours before closing. That's bad planning. I was bummed because I love using chips to scoop up the filling between bites for extra crunch.\n\nI'll take the extra few steps up the block to El Castillito next time.", "author": "Valeria R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-01", "description": "This is the best burrito place in the area. Gone here several times to order stuff, sometimes early in the afternoon and other times late at night. If you are in hunger for a burrito come here.\n\nJust stay away from the vegetarian. I had this one night before going out to the bars. The burrito kept reminding me it was there the whole night, until it came out to visit at midnight.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "I love this place. Where else can a vegan eat a filling lunch in San Francisco for $6? I get a tofu burrito here nearly every single day, and I love it. No lard in the refried beans, no chicken broth in the rice, perfect. The only issue I have is that there are no habanero peppers, but that's a personal issue as I'm sure most people aren't trying to set their mouth on fire the way I like to do.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-10", "description": "Whenever I'm jonesing for a burrito and I'm at my boyfriend's place in the Mission, I typically hit up the burrito joint just down the street from Casa Mexicana, El Castillito. I've been told by numerous people that it's the better of the two. \n\nThis weekend I decided to give the underdog a try. I ordered the grilled veggie burrito in a whole wheat tortilla. It came stuffed to the brim with broccoli, zucchini, onions and bell peppers. I added cheese and guacamole and it rounded everything out perfectly. This was one of the best veggie burritos I've had to date. It was right up there with Taqueria El Sol on Geary.\n\nFrom now on I'm going to have a hard time deciding between the two Church Street competitors!", "author": "Julia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "I've yet to have a less than great meal here.  Fast service, cooked to order, generous portions, good prices, super convenient at the intersection of the J-Church and N-Judah.  It's easy to hop off the train, grab a delicious burrito with marinated steak or fresh (whoppingly huge) quesadilla and get back on the train.  This go-to place is a winner", "author": "Caleb H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "I had pork in red sauce burrito, I have to say it was awesome. The service was very polite and friendly", "author": "Marta L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-29", "description": "So this place has gotten much better in terms of the food quality in the last 6 months or so for me.  This past weekend, I ordered the Pozole which is a Mexican stew with maize.  [Note: they only serve this stew on Saturdays and Sundays).  I've had Pozole is some other taquerias and I have to say this was pretty tasty.  \n\nI have to admit that I much prefer to come to this taqueria than the one further done towards Duboce Avenue as they are always much friendlier to me here than the other place is...", "author": "Thang H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-15", "description": "The nachos here are slightly better than El Castillito because they use more cheese. Their burritos aren't very well assembled. \n\nI'm fairly certain I got food poisoning from the breakfast burrito once. As an after effect of the food poisoning, I became temporarily lactose intolerant! I grew up in the Midwest. In my mind, the four food groups are Pork, Fried Foods, Cheese and Beer. - several weeks without dairy was hell.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "We stopped up here to top off our tummies before an evening of alcohol and debauchery. When I say we, it was a group of five people, and I was the only one who didn't speak Russian. So, I didn't get a good handle on my friends' reactions, but all-in-all it was quality Mexican food at a reasonable price and open at the right time. I had a few different tacos (I think one order Al Pastor, another steak.) It all went down well.", "author": "Jonathan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-27", "description": "Ever since I moved to San Francisco eons ago, I've been in search of a burrito that satisfies me as much as Benny's Bay burrito used to back in my youthful Greenwich VIllage days. I realize this comment is a type of heresy, as the NY-spot is attempting to do it Mission style. Maybe it's just my unrefined pallet, but I never found a burrito to love in SF, and I've tried several places. \n\nA few nights ago, I stumbled into this place late at night. I ordered a super burrito with grilled chicken, took a seat in back, and felt transported back to Benny's. Same soft tortilla, with a burrito the size of a firelog. Even the free chips and salsa tasted better than my usual experiences AND the staff were really nice. Loved the decor too: painted tiles featuring Frida Kahlo and Diego Rivera.", "author": "Alex N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-16", "description": "Pretty good for a quick bite. I have tried the carnitas tacos and veggie tacos in the past.  The food is tasty, fast and the ladies were nice. The dining area is generally clean.  The salsas are tasty too. \nThis place is not the most memorable taqueria but it is A-Ok...a perfect 3 stars.", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "For my Church and Market burritoing, I go for Casa Mexicana. There are quite a few veggie options. I have had the tofu ranchero a few times and it is pretty good. The Grilled Veggie is also a hit. They have Spinach and whole wheat tortillas too. \n\nThe salsa bar is has quite a few different salsas, cilantro, onions, jalapenos, and lemons. They only give you 2 cups but I usually just fill up my plate around the burrito. \n\nThey are open until midnight, so it is a great late night option.", "author": "Peter V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-03", "description": "I'm not a big fan of Mexican food and this place gave me my first burrito. Lol. I had it very place just wheat tortilla, cheese, chicken and rice. Lol. I mean it was ok. It was huge, and I got a drink with it which totaled to be $10. Place had plenty of seatings and it was clean.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "The food was great. I had the super taco with chicken. \n\nThe prices are expensive, which you can expect in San Francisco. The taco cost nearly $5. My husband had a burrito (nearly $7) that was almost a foot long and nearly four inches in diameter. \n\nIf you like the artwork of Frida Kahlo and Diego Rivera, you will love the decor and ambiance. \n\nWarning: you must use a knife and fork to consume your food neatly.", "author": "Flora R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-14", "description": "There is no perfect burrito place in San Francisco. With so many to choose from, we have the luxury of being picky. So I was at a loss when Azteca shut down last year and became something entirely different instead.\n\nOh, wait - Casa Mexicana is the same business? Sweet!\n\nHere's why I'm picky about going to Casa Mexicana instead of the much over-hyped, hipster-infested blandness that is El Castillito a couple of doors down:\n\n- The food is always good. I've read reviews where some people say it's too salty, others that it's not salty or flavorful enough. I must be right in the middle, because I think it's tasty without being overwhelming. Compared to El Castillito, there actually IS flavor.\n\n- I always get the chicken burrito (no matter where I go) and their chicken is always juicy. Plus, I always get a lot. I got the opposite at El Castillito; it was like a veggie burrito with a couple of chicken pieces in it. EVERY TIME.\n\n- They pay attention to me, listen to how I want it made and do exactly that.\n\n- They STEAM their tortillas, which I love. Warming them on the grill is fine, but only if it actually tastes better afterwards.\n\n-The chips are always fresh. They did have some problems with this last year, probably because they were training a new staff, but it's gotten better. And they're always tasty.\n\nAnd that's why it's the best take-out burrito place for me in my neighborhood.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-26", "description": "Delicious food and great friendly service! Steamed broccoli burrito rocks!", "author": "Ali B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "After a delayed flight coming in from Phoenix, maxing out the BART, then looking at a 45 minute wait for the Muni N, I decided to just jump on the J and walk from Castro to Upper Haight.  It seemed like a great idea, until I realized it was 11:55 PM, I hadn't eaten since lunch, and my fridge was empty thanks to being out of town for a week.\n\nI was pretty much screwed, but remembered there was one option...\n\nSo I ran up Church, and to my sheer delight, Casa Mexicana was indeed open, welcoming me back to San Francisco.  3 minutes and $8 later, a delicious chicken burrito was in my hand.  In all honesty the food here is good but not great, however, when you're in the predicament I was in, anything warm and hearty tastes like heaven.  For late night food, you won't find much better.", "author": "John H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-14", "description": "This is the place to go for authentic Mexican food.  Everything is made fresh daily, including all of there salsas.  I got the super nachos with carne asada - it was filled with beans, cheese, fresh guac, sour cream, and the meat.  HUGE servings for my huge appetite.  My friends got the burritos, which were also HUGE and filling. \n\nGood thing I don't live in SF anymore; I could get fat from going to this place alone.\n\nThe service was quite entertaining. The guy was talking to me in Spanish the whole time and laughing at me while I was trying to understand and decipher.  Good thing my friend was there to translate (and good thing the server actually spoke English). hahahah.  Loved it.\n\n*Sidenote: If you need to use their bathroom, ask them for the key!", "author": "Tram T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-04", "description": "BLAND tacos al pastor on stale tortillas with flan that was burned on both sides. There was no recognizable seasoning on the meat and no beans or rice. 2 tacos with flan was almost 10 bucks.", "author": "melissa d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-16", "description": "It was my first time trying out this place and it was damn delicious. good chicken, had whole wheat tortilla (and also tomato and spinach I think?), and spicy salsa that was actually pretty spicy. it was 9:30pm, at first since they didn't have \"baby burritos\", I was like \"ok.. I'll just eat half and maybe have the rest tomorrow\" -- next thing I know, I was 2/3 through and then just threw in the towel, or do I mean napkin and said fuck it and finished it.\n\ndefinitely will be going back to try their other stuff :)", "author": "Jennie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-19", "description": "Heck to the yeah I like this place! Once you walk in here you see the menu right on top of where the grill is. This place has options- meaning you can get a tofu burrito! I never knew that existed! You know how I know that they're serious about giving vegetarians options? You can see that they have a \"Steamed Broccoli Burrito\" Yup! The folks here are very friendly, and they don't rush you. They cook to order, and you get chips with every order. The place is actually not bad. It's nice, clean, and spacious. They have a bathroom you can use if you ask for the key- but sometimes you need to play a fumble in order to get it from some people that hog it of course. Their steak is fantastic, and their chicken is grrrrreat! I'll have to come back sometime to try the rest of their menu. Ole`!", "author": "Monina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-23", "description": "We stopped in for a quick lunch during our bar crawl. The young lady that greeted us was just a peach. Helpful, polite, and very efficient, to include being one hell of cook. I ordered the shrimp burrito and the Mrs had two tacos, one beef and one chicken. Down to earth authentic melt in your mouth food. The burrito was prepared right there as you watched with fresh onions, bell peppers and whatever else you choose..tossed on the grill, chopped up with skill and slid onto a fresh warm tortilla..The tacos looked great, and I was told they were as equally good but each time I reached for a bite the Mrs slapped my hand. \n\nThe food was great, fresh, hot and the service was outstanding..reasonably priced as well.", "author": "David S. Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-27", "description": "The Worst Buritto!!!! Will never come here again. The restaurant is at the most congested area but not do well because people don't get what they order. The menu said Salmon but they are not Salmon in the food. My grilled fish was WHITE.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "I come here all the time before, after or during my break at work. This is a small restaurant near the corner of 14th and church. All of their seating is indoors and it looks small from the front but when you walk to the back there is more seating. If you are in the mood for mexican food this is a great place to pick up a quick lunch or dinner for dine in or take to go. They have a wide range of vegetarian options on top of all the authentic mexican dishes. My favorite is the tofu ranchero burrito which is usually either $6 or $7. Whenever I order a burrito they always include chips and salsa. They also have very late hours so if you have the drunchies after stumbling out of churchill or another bar, you know this place will probably be open! This restaurant does take card whereas some other places in the area are cash only.", "author": "Anthony H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-26", "description": "Your basic burrito joint. I tend to get the Chile Relleno burrito which is prettty good. One bummer about their set-up - the condiments station is on the back wall so its hard to watch them assemble your burrito which means that if they don't do it right, you don't know until you're eating it.", "author": "Rochelle M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-18", "description": "Bland and dry burritos....Come on we are in SF...\n\nSTEP YOUR GAME UP", "author": "Mario W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-16", "description": "I should give Casa Mexican their stars back. Now that prices have caught up with their last price hike you gotta admit that a super taco, chips, and a domestic beer for less than $9 is still a pretty good deal. There's a lot of crappy Mexican food out their and the quality of their flavors and ingredients is constantly reminding me why I come back.", "author": "Luke M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-01", "description": "I live in Noe Valley. Everything closes at 10pm. Everything...except for Haystack Pizza (their margarita pizza tasted like shrimp once & last time I ate there, I was rewarded w/ extra feta for having a hair in my salad) & Tutti Melon (hair in my yogurt, twice). Hair nets people, hair nets.\n\nI digress. So, if me & the bf are traveling home from outside Noe Valley/Mission/Castro & have a minute before the J comes, we pop into Casa Mexicana...it's that or we eat hair. I'll take Casa Mexicana.\n\nFor $13.41 we got:\n\nSuper Veggie Burrito w/ black beans, sour cream on the side \nSuper Tofu Burrito w/ pinto beans\n\nThe lowdown:\n\nSUPER fresh salsa, even at 11pm, loaded up w/ cilantro\nVery friendly staff\nSolid pinto beans (the beans have to be good when you're skipping the meat)\nFresh chips, not too salty\nSteamed tortillas...always a plus\nClean place & a nice atmosphere (I wouldn't mind dining in, but the train was coming)\n\nFun side note: Prob 20 of us that were waiting on the J grabbed burritos, the train was smelling so delicious.\n\nThese burritos won't change your life & you might not take out of town visitors here, but they're a reliable late night non-Mission Mexican best bet.", "author": "Stephanie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-13", "description": "I am definitely a fan of this place; mostly for it's location and nice staff. \n\nLocation: It's on my way home from anywhere, it's open late, it's amazing. Right on Church and Market, many people get off at the MUNI stop and come here for some after-work grub.\n\nSpace: Ample space for seating should you want to grab your burrito here or on the go. For a quick burrito place, the decor is not horrible. It's traditional tile, the kind you see in Mexican houses, and pictures/artwork of Frida everywhere...which makes me happy.\n\nAmbiance: Usually people that live around the general area who are just stopping by for a quick bite. \n\nService: Super nice Mexican ladies. They taylor the burritos or nachos to your heart's desire and don't charge extra for more chips.\n\nFood/Drink: It's not the best, it's not the worst. It's a fast burrito made from prepared and probably frozen ingredients. But, it's cheap, they have a vast menu and they're quick. I'm usually starving after school or work and just need to eat...these ladies feed me, and that's all that matters.\n\nOverall: Great stop to drop in after work, sit down, have a Mexcan coca, eat fast, go home and pass out.", "author": "SF N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-03", "description": "There is a burning neighborhood debate about which is better: Casa Mexicana or El Castillito is better. I vote with enthusiasm for the former. Much higher quality cheese and guacamole, a bigger selection of meats in delicious sauces, and much more vegetarian options. Go Casa Mexicana!!", "author": "Lora M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-06", "description": "Food was so delicious; steamed tortillas were a treat.  A far cry from what I'd get in Winnipeg.  The vegetarian burrito with nopales added was so delicious.  Also, try the agua fresca, it totally hits the spot.", "author": "Kameron H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-23", "description": "Upper Church Street alternative to Castillito.\n\nThis place is pretty good on its own; unfortunately it is near Castillito.  I love that place much more.  However, the burritos here aren't that bad either.  Their Wet Burrito is pretty good; almost a staple when I come here.  Love their Tacos too.  Their food does feel a bit lighter on the stomach than Castillito.  The staff is also very friendly too.\n\nThe things that I really do like infinitely more than Castillito is their fixings bar and their larger dining room. Their expansive fixings bar has it all from cilantro to peppers to onions.  Their larger dining room has a lot of character.  I always find myself staring at the Frida pictures on the wall as I'm scarfing down their food.  They also have a cleaner bathroom that is easily accessible; rather than going through some kitchen.  \n\nGreat fixings bar and comfortable dining room compliment their tasty food.", "author": "Satoru Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-24", "description": "Thanks for always being there when it's raining, I'm buzzing and stoned and need a yummy snack with good people and good conversation.\n\nThanks for always having snapple, too.\n\nThanks for always being a $5.00 munchie of heaven.\n\nThanks for being you Casa Mexicana, thanks.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-07", "description": "Very good, cheap burritos.  Super veggie is highly recommended and extremely filling.", "author": "Bob L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-28", "description": "My husband had the super burrito and I had a veggie burrito, so I can't speak for the rest of the menu.\n\nWe were not impressed. The meat and fillings were unremarkable and didn't really have much flavor. Worse, their tortilla was rubbery and tasteless and had a plastic-like smell. \n\nIf we're craving a burrito on the corner of 14th and church, we'll just walk the extra 40 feet to Castillito.", "author": "Galeet L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-26", "description": "I absolutely love this place, the carne asada tacos are the best, the meat is soft and tastes fresh, the salsas are really good and the staff is friendly. I come all the way from San Ramon to eat good Mexican Food.", "author": "Betty V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "The decor is cute, the food is decent and cheap! And the customer service is fantastic! Just loving it!", "author": "Ronnel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-23", "description": "This place is underrated. I would venture to say its one of my favorite taquerias in SF. Certainly the best in the area. It has a lot going for it. Fresher than average food. An actual dining room with a Frida Kahlo/Diego Rivera motif. And, more importantly, polite staff who will indulge my attempts to order with meager high school Spanish. I think I have command of like 10 verbs in the present tense, but they keep letting me try. They even respond with slow formal phrases like \"Por Supuesto\" which then makes me feel like an ass.\n\nBut lets get down to brass tacks. Chicken Mole. They have it. Its good. It doesn't taste like KFC covered in Hersheys syrup. Its more like you've wandered into Oaxaca. Not that i've been to Oaxaca. The wet burritos are good too. The put the salsa, sour cream and guacamole in little stripes on top to look like the mexican flag. Its a nice touch. I don't normally go for the wet burrito thing, but they really are good here. When I was vegan for a spell this place saved me. They have multiple veggie options. Cactus, Tofu etc that aren't bad.\n\nJust don't piss off the tall skinny dude. He looks like an overworked extra from Apocalypto and I bet he can kick some ass.", "author": "Zac H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-03", "description": "Got the veggie burrito this time...was better (as in, not soggy and falling apart) than the Tofu Ranchero, but still pretty bland.\n\nGiving them 3 stars since El Castillito is cash only, and this spot takes cards. Also, super friendly staff... but their burritos are definitely no El Castillito.", "author": "Alan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-25", "description": "Interesting random Mick fact:\n\nI had a twin sister that didnt make it through the birthing process.\n\nSo because of that, i find myself searching for the B end of my A conversations in my head. I dont *think* that i have multiple personalities, i just think there is a piece of \"Amy Mae\" inside of me that communicates with me through some weird symbiotic shit i cant understand.\n\nI wont use the word \"blame\", but i will say i think there is some inherently weird shit that goes on in space for some of my decisions.\n\n1. Lets have another cigarette.\n2. Hey, hows about we have another beer? We can stand, kinda.\n3. Pack it tighter....you get paid today, well get more.\n4. Another beer? Come on brudda. Youre drinking for two.\n5. Dont ride your bike today....we have a MUNI pass.\n6. Get this tattoo that no one understands. \n7. Sweet! A replica Vader helmet on eBay for $500! Bid! BID!\n\nI also blame her for my voracious appetite that is never properly quenched. \n\nMe: Chicken burrito please.\nHer voice: (Carne asada....extra cheese)\nMe: *Sighing* CHICKEN burrito......please.\nHer: (Come on....what the fuck is wrong with steak?)\nMe: I already had red meat this week.\nBurrito lady: Ooookay.\nMe: No, not you...that was her...er.....nevermind.\nHer: (At least get a steak taco. WE deserve it WE had a shitty week.)\nMe: Steak taco too please.\nBurrito lady: Steak taco, too?\nHer: (FUCK YES!!!)\nMe: Yes. Were totally going to pay for this, you know.\nBurrito lady: I hope so...it isnt free.\nHer: HAHAA....\nMe: No....i meant.....ugh....nevermind.\nHer: (Tell her youre fucking insane and you have a twin in your head!)\nMe: Sorry....im really tired....\nHer: (TELL HER.)\nMe: ugh....We um.....were crazy, and i have a twin in my head.\n\nI point to my head.\n\nMe: Shes the fucking crazy one....not me.\nBurrito lady: ............................youll ummm.....be getting this to go, right?\nMe: Yeah.....two (sharp head pain) i mean FOUR Negra Modelo too.", "author": "Mick F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-19", "description": "I can't help but compare this taqueria to El Castilito on the same block.  \nThis one appears cleaner, the ingredients seem fresher, & the seating is nicer.\n\nAnd yet . . . \nI cannot give the same gushing 5 stars I gave and would give again to its neighbor.  Somehow, the flavor just doesn't compare.  From the spicy chicken on the tacos to the liquid crack (otherwise known as the green salsa) I crave from \"the other one,\" I always find this place to be just \"ok.\"  I do come here specifically for the chicken mole dinner since I can't get that down the block; and I think my husband prefers the nachos here - they have the better chips.  But overall?  Eh, average.\n\nI dunno.  Maybe I just prefer the taste of grimy?", "author": "Ravena F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-30", "description": "What happened today at approximately 9 PM:\n\nMy brain: IM HUNGRY\nMe (to brain): Dude, we just had a veggieburger like 4 hours ago.\nMy brain: BUT IM HUNGRY AGAIN\nMe (to brain): Remember how you spent like an hour today telling me I was getting fat?\nMy brain: I WAS LYING YOU ARE GORGEOUS FEED ME\nMe (to brain): Okay, let's get a Luna bar or something.\nMy brain: NO I WANT A BURRITO\nMe (to brain): We are not in college anymore so we cannot possibly justify two dinners in one day.\nMy brain: THE VEGGIEBURGER WAS TECHNICALLY LUNCH\nMe (to brain): No it wasn't. \nMy brain: BUT WE WENT TO THE GYM TODAY SO WE CAN EAT ANYTHING\nMe (to brain): Dude. We did pilates. That doesn't count as burrito-worthy.\nMy brain: OKAY UM WELL UHH IF YOU EAT A BURRITO YOU WILL HAVE MORE ENERGY TO WAKE UP EARLY AND GO STRAIGHT TO THE GYM\nMe (to brain): Oh my god best idea ever!\nMy brain: LOOK HERE IS A TAQUERIA THE DAY IS SAVED\nMe (to brain): Wooohoo! \n\nI got the tofu ranchero burrito with black beans and spicy salsa. It was one of the better burritos I've had around here, and the restaurant was surprisingly clean for a taqueria. My only complaint is that the rice had peas in it (eww) which I would have picked out were I not so hungry. I also noticed they have chicken mole, which is one of my favorite foods EVER, so I will most likely come back next time my crafty brain talks me into eating an additional dinner or something.", "author": "Liz G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-31", "description": "The comparions to El Castillito are inevitable since they share the same block, but they are completely different experiences. Casa M takes plastic, is actually pleasant to sit in, has a nice little salsa bar and they have way more options, especially if you are with a hot vegetarian or just want different flavored meat. \n\nThere are two things I order here: chicken mole burrito with melted cheese or tofu ranchero burrito with veg. refried beans and avocado.  Never, ever come here right before they close becuase they run out of everything. The best time to come is middle of the day when they are replenishing the steam trays. If you are not health consious and want straight up meat and fat and require a little more grit, Casa M is not for you. Also, they steam instead of grilling, which always detracts from the experience for me.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-17", "description": "So when the 24 did a detour this past Thursday night due (I assume) to the Castro celebration of the California Supreme Court striking down the state's ban on same-sex marriage, I had to reconsider my getting-to-work options.  I normally take the 24 to Castro and 18th, grab something to eat, and then catch the 33 to work.\n\nWell, I needed to think of something in a hurry; I thought I would be late, and I was really hungry.  I got off the 24 at Church and Market and saw a 22 full of standing people trundle up.  That didn't look good, so I decided I'd catch a later 22 and get some food from Castillito.  The line there was really long, so I checked out Casa Mexicana.\n\nIt also had a long line, but it wasn't as long.  So I waited.  I saw two more 22s and two J's pass by, but I was determined to try this place's food.  The burrito assembler was very nice and efficient.  The line took a long time because the people in front of me were either unfamiliar with ordering burritos in San Francisco or really pissed off that the Tecate wasn't ice cold.  (One of the workers had mentioned that they had just put the beers in the cooler; that seemed like a nice warning.)  So these guys argued, and I thought about the distinct possibility of having to catch a cab to work, which is ridiculous.\n\nI eventually got my burrito to go.  I didn't get to enjoy it right away because I had to wait for a 22.  It came on time, and then I caught a 33 the rest of the way to work.  I arrived with two minutes to spare and went to town on my burrito.\n\nI was very disappointed.\n\nIt wasn't bad, but it wasn't good either.  It was mediocre.  I was also less-than-happy that my Jarritos wasn't cold enough, although I didn't complain about it profusely to the employees and, thus, hold up the line.  I wouldn't mind giving this place a second chance, but the layout of having to wait out the door with a line of only four people is just, well, not cool.  So I might come back, or I might not.\n\nThe people who work here are really nice.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-07", "description": "It very well may have been the alcohol I consumed prior to stopping into this place, but burrito I got here last night was the best burrito I've had since I moved here from Texas.\n\nThe refried beans were creamy and delicious, and most likely not vegetarian. Mmm, manteca. There was also rice and cheese in my burrito, but I didn't really pay much attention to those because the beans were so perfect. Perfect, unhealthy, delicous frijoles.\n\nI'll have to go back sober some day and really enjoy it.\n\nUPDATE: So I went back with one of my original dining buddies, and though I had already had dinner, he ordered the same thing as last time (veggie burrito). As he was ordering I noticed that the menu says that \"absolutely no lard\" is used to cook the food, and the items with a star next to them are \"100% vegetarian\". So I'm sorry I slandered them in the original review. Oh, and my friend says his burrito was just as good as the first one, so apparently the alcohol was not a factor. Awesome!", "author": "Vanessa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "Now that i've come here more often, and tried more of the items, my original 1 star review has gone up to 4. I'm definitely a fan of their super tacos. They're dirt cheap and one will totally fill me up! How cool is that??", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-10", "description": "It's not quite Azteca, but it's still good. \n\nThe menu is the same. Prices are more than likely the same. They have a legit bathroom that doesn't make me feel like I'm violating health codes. Something's just a little off and I can't tell what it is.", "author": "Maira M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-20", "description": "This was a very poor excuse for Mexican food.  My chicken taco had pre-cooked chicken that wasn't even warm, a huge spoonful of greasy beans, and a soft tortilla that tasted worse than the ones at La Salsa.  There was nothing fresh, grilled, or tasty in any way.\n\nThe service was nothing great either; the lady who asked to take my order started walking away and talking in Spanish before I had a chance to respond.  Cheese costs extra and so does guacamole - I am MUCH more impressed by Castillito which is half a block up Church St!", "author": "Laura W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "I have been visiting this place for years, and it has always been consistent and tasty.\n\nThe staff is very efficient, and they will have your dish ready in a few minutes. The taqueria has a large dining area in the back, so its perfect to have a quick meal there if you choose to sit down.\n\nI like the cactus burritos and tacos they have; a nice alternative for vegetarian fillings.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-20", "description": "I love Mi Casa.  I especially love their Tofu Ranchero burrito, it is the best ever.  All the employees are friendly and fast.  I love and frequent this restaurant so much that I asked them to cater my wedding!  \nI received so many compliments on the food and it was all eaten up.  \nI heart Mi Casa.", "author": "Sarah N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-06", "description": "When I am with a group of friends and have any say about  where we eat- I always choose burritos from Casa Mexicana!", "author": "Mary D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-02", "description": "Not bad man, not bad at all. \n\nThe super burrito here is cheaper than the one over at El Castilito but less meat, for sure.... and a little shorter. \n\nStill good though, because I can actually finish it without feeling too overly stuffed. I have a tendency to eat til I feel sick. And well, if there's nothing left to eat, I'm better off. \n\nI got the Pastor Super Burrito with absolutely everything. The Sauces are good, I prefer them over another burrito place a block down. It was awesome, the burrito tasted fresh and the chips were crispylicious. \n\nI give you 4 stars! because you're still more expensive than socal !", "author": "Eugenia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-29", "description": "Absolutely fantastic super burritos and friendly faces/great service!  I've been here several times over the span of several years and the same situation.  Figured I review them.  :)", "author": "Maddy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "I come here for pretty much one thing, and that one thing here is pretty incredible: pozole. They make it only on Saturdays and Sundays, and it's just as well because theirs is far better than I could ever set aside the time to do. A nice zingy spice, tender meat, sippable and slurpable. A great post-drinks food, and they're open late! Comes with a nice helping of radishes, lettuce, salsa, onions, etc. Also perfect for a cold day/night, or for fighting a cold/flu.", "author": "Jake m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "This is a great place for people who like chewy burritos with steamed tortillas.  I am one of those people.  If you want a crispy burrito, go elsewhere.  I have had consistently good experiences here for 9 years now.  My go-to burrito: Whole wheat tortilla, melted cheese (have to specify this), rice, pinto beans, avocado and mild salsa.  I love that you can choose avocado instead of guacamole.  They don't automatically wrap the burrito in foil if you're eating in, so make sure to request foil.  If they have melon (cantaloupe) agua fresca, GET IT!!!  Best ever.  If you don't feel like a burrito, get enchiladas or nachos.  Don't recommend the quesadilla.  For meat, I suggest the mild green chicken.", "author": "Shana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-19", "description": "is this the best burrito in San Francisco? No. Is it my favorite? Yes.\n\nI lived in the Lower Haight/Hayes Valley area for years, and I was unable to find anywhere else in the hood that delivered so consistently. \n\nAgree that the burritos are sort of soupy. But it never really bothered me.", "author": "Maple Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "For $4 you can get the best breakfast burrito in the city.  And best of all it's served all day.  Their menu is large, everything is cheap and the portions are large.  Personally, I think the breakfast burrito is the best thing on the menu, and everything else is just so-so, but the price is always right.  \n\nOverall, the food probably only deserves three stars, but I'm giving them an extra one for the price and the fact that they serve beer.", "author": "matt c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-09", "description": "I go here a lot!  I've tried all of the taquerias in the area and I always come back to Casa Mexicana.  The food is always fresh and tasty and the salsas are killer.  I was addicted to their green salsa for a while; best I've ever had.  I've weened myself off for a bit and have been trying more of their red salsas.\n\nI must admit that I'm not a big burrito fan.  I'm defintely more of a taco type of guy.  My favorites here are the carne asada tacos and the chorizo tacos.  They always cook the meats perfect and I usually don't eat them with too many toppings, usually just onions, cilantro, and salsa.  But they are just so yummy!\n\nTheir beans are also great; I sometimes order a side of them.  They always give you free chips and salsa as well and the prices are extremely reasonable.  Definitely go here for quick, tasty Mexican food.  It really is the best in the area.", "author": "Philip D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-23", "description": "More attractive, better menu, and better prices than El Castillito down the street. I had an Azteca burrito with pinto beans and mole chicken. It was honestly a little too large. I thought the guacamole was one note and below average (seemed old). And, the mole was a little too sweet; it got old. But, the chicken quality was high. I would return (and share)!", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "I had a veggie burrito.  It was tasty.\nThe tortilla chips weren't that great.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-04", "description": "Casa Mexicana is a hit-or-miss kind of place.  I've been there quite a few times because it's so close to my house and because I refuse to eat at El Castillito (the other option on that block) after having had one of the worst Mexican meals there since the time I ventured into the Taco Bell (okay, it's not really Mexican) on Duboce @ Guerrero with my niece and nephew (they love Taco Bell) and was served nachos with ground beef that had soured.  *shudder*  Never again.\n\nAnyway, after at least half a dozen trips to Casa Mexicana and lots of experimenting, I learned to only order the Grilled Chorizo Burrito (with veggies).  When I'm in there, I often hear people ordering the Al Pastor Taco, so I'm assuming that's a big hit.  They have a pretty tasty green salsa, too.  I'm taking off two points because (1) well, it's not the best Mexican food I've ever had, and (2) they can be kind of inconsistent.  Like last night.  I think the girl workin the station had no taste buds or sense of smell.  This is the only explanation I can think of that would explain what she did to my burrito.", "author": "Diana Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-05", "description": "I generally despise mexican food, mostly because I hate ground beef and beans....you get the picture.\n\nHowever, my DH would eat here every day if he could, or if I would let him.  He would also be as big as a house.\n\nTheir burritos are the size of small condominiums, for the low price of $4-6 bucks !   Warning: Only order 1.......\n\nSince I hate beans and beef, I had to look around their menu and find something I can eat...WOW...they have fajitas, shrimp, fish....and you can watch them make most of it right there.  A plus in my book, especially at this kind of place (cheap and easy).\n\nIf I could subtract another half-star, it would be because the service is strange.  Sometimes it's fast and great, but many times the service puts my patience to the test (and my Bad Spanish).  There is one cook there who simply won't make what you tell her.....you must beg, point, speak spanish, or leave.  You think I am kidding.\n\nBUT overall a nice cheap alternative to cooking at home.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-25", "description": "I still can't figure out why this place continues to be rated lower than El Castillito. \n\nThese are very solid burritos. Not AMAZING, but still a damn good burrito. They also take credit cards, which is a huge plus. Best burrito in the area before you get to the Mission. Also major props for a big dining room.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-11", "description": "This is the place for the person that always reaches for the salt shaker BEFORE they even taste their food!! \n\nThere food is decent but my gawd, can I please have some food with my salt!   Every time I have gone here food  just has way to much salt.   I am not even going to talk about the chips.     Just saying..................", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-29", "description": "I eat here all too often. They make a good cheap burrito. Nothing fancy. I just get a bean and rice burrito with salsa and avocado. Plus chips and soda for less than $10? Hell yes! Keeps me a happy girl!", "author": "Jennie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-15", "description": "Stopped by here last night on the way home from lucky 13 and had a burrito with carnitas and nopales.  Outside of being a little bland, it was a pretty decent burrito.  Add to that the quick service and the fact that they're open later than the other Mexican place down the street, and you have a decent place to stop for post bar sustenance.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-22", "description": "Looks like a little take out place, but in the back there is a large room with lots of tables, good for bigger groups. Good super burito, which is pretty much what I get at most places.  Less than $7 bucks for a meal makes me happy.  Good salsa bar.  Like eugenie says, it is smaller than castillito, but i thinks slightly better.  I would get the pastor on the corn tortillas.\n\nSay hello to Reyna, she's the first person you see.", "author": "Travis S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-16", "description": "Ah shit, the plumber's here. Don't get me wrong. I am really really thrilled to see the plumber. Especially since he left us without a working bathroom sink and minimal water pressure in the kitchen sink. Over two weeks ago. Then dude goes MIA on us. And he has the keys to the house. But he's cute and he's Irish. You learn to forgive a lot when a cute Irish plumber shows back up to fix things.\n\n\nBut that means the water's off. So, no cooking. So, I'm sitting at home, on my day off, writing endless reviews on yelp. Catching up, as it may. And getting hungrier by the minute. And reading reviews. And now my stomach's grumbling.\n\n\nI think I'll go to Casa Mexicana. Because La Carreta sucks. And the last time I went to El Castillo, the dude was SO CRACKED OUT that I was afraid a drop of his stimulant-laden sweat would fall into my food and I would be tripping. And not hungry because I was tripping so hard. So, I haven't been back to El Castillo in, like, 3 years. Even though we can probably safely assume that cracked out burrito maker 1. died of a heart attack or 2. cleaned up his act.\n\n\nCasa Mexicana has fresh food. Clean restaurant. Funky Mexican Art-inspired interior. Good salsa. I judge salsa by the green stuff. Anyone can throw some tomatoes and onions and jalapenos together. Green salsa's where it's at. And really nice servers who will put the tortilla on the grill & melt the cheese on it if I ask. Nicely. I always ask nicely because burritos are important and the people who make them for you are also important. Treat them with respect and they will treat your burrito with respect.", "author": "Yasi S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-09", "description": "I've only been here once. I had the grilled fish taco and a side of rice. They were both okay. \n\nBut they give you free chips ans salsa. AND they have a salsa bar where you can help yourself to cilantro, onions, jalapenos, and a variety of, YES,  salsas.", "author": "Dorothy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-15", "description": "I started coming here when I lived around the corner.  There is one woman who has worked here ever since I've been going religiously who is always very nice about my broken Spanish.  The rest of the staff are nice but tend to act busy and stressed out when it seems to be slow...\n\nGets busy around dinner time (6-8) so expect a line out the door (although the counter is literally inches from the door, so you still won't wait long).  I suggest the fajita chicken super burrito, but no lettuce for me.\n\nOh and... despite rave reviews of El Castillito up the street, I can't stand that place.", "author": "Cole I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-19", "description": "A friend and I weren't sure where to eat. Like a prophet sent from God, a crackhead steps up to us and says, \"Don't eat at Castillito, eat here. Castillito doesn't wash their hands, and this place has fresh vegetables! Look, they're cutting some right now!\"\n\nI love Castillito, but I wanted to try something new, so my friend and I went in. Got their wet Azteca burrito and it was the best wet burrito I'd had in a long time. It's surprisingly spicy and the meat has a good flavor. Their red salsa from the salsa bar is also really good, it almost tastes slightly italian pizza sauce-ish. The big problem is that their food is somewhat inconsistent. Some days it's great, some days it's not all that good.\n\nThis place is a good alternative for when Castillito is closed or you just want to switch it up.", "author": "Daniel R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-18", "description": "The tostadas, are good. I just started eating here cause my girl. One time the tostada wasnt as good.....so you have to pick your days......need to check da burridahs.........hmmmmm........chicken!!!!", "author": "freaky r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "alright, so this is a review update. i have tried new menu items and have not found any more rocks in my beans. \n\nmy personal favorite is a spicy chicken taco with black beans and pico.\nthe chicken is flavorful and tender, the beans are iight. \nmy first two experiences here were awful but any time i have been there lately, the food has been pretty good.", "author": "Carly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-17", "description": "Wow.... $3.25 for a \"Super Taco\" gets you basically a small taco tortilla with meat, cheese, sour cream, salsa, and guacamole piled on to high heaven. Best deal ever. I couldn't even reach the taco at the bottom of the plate. Good thing they give you free chips to dig your way through.\n\nbtw, props to them for getting 100 on their health inspection. :)", "author": "Richie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-18", "description": "BOO! after seeing that this place had such high marks, especially with such an equally well rated neighbor up the street (castillito) i thought i'd give it a try for lunch. what did i order?\n\nregular chicken burrito w/ cheese (on the menu)\nchips\nhorchata\n\nhow was it? bland, tasteless, the cheese came in one big clump and the horchata was MEH. i would never go back to this place with such a better alternative 4 doors away.", "author": "Greg A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-17", "description": "I stumbled upon this place since the Muni J just stops right in front of it. The first time I got the chile relleno dinner, and the second time I got a super veggie burrito. Both times I was very happy -- both with the food and with the value for the price (~$4).\n\nParticularly because of the location, and because they're so consistently good, this place has become my neighborhood tacqueria. The food is good and cheap and fast, and there's a little salsa bar and free chips. What else do you need?", "author": "John C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-05", "description": "Yes! This place is so good and their rice, beans, and chips are vegetarian! It's very reasonably priced- a super veggie burrito for $5.70 and everyone that works there is very sweet and helpful. The food is delicious and they have a decent salsa bar.", "author": "Sara D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-17", "description": "had a burrito here and it wasnt too good. quesadilla was good though", "author": "Mohammad A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-13", "description": "As I type this, I am experiencing uncontrollable volcanic flatulent eruptions. Came in last night with my friend who had spotted it the previous day and, ignoring my Yelp tendencies and generally skeptical consumerist tendencies, I ordered both the most expensive and crappiest Mexican food in my life. Ordered a shrimp taco, got a flavorless fish taco, for which the salmon had the texture of soggy bread. Ordered a chile relleno burrito, experienced an overwhelmingly large burrito that was 2/3 peas and rice with a tiny chile relleno stuffed in. I felt ripped off and sickly following this memorably sickening taqueria experience, and to top it off the people working were unexpectedly rushed with the minimal traffic.", "author": "Peter H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-24", "description": "They're cheap.\nThey're fast.\nThey're open pretty late.\nThe food isn't too bad.\nThe place is pretty clean.\n\nHeck, if that was a woman I'd date her - but it's not, so instead I go there and order take-out maybe once a week.\n\n\"Two shrimp tacos and one Pastor taco with spicy salsa. To go please! Thanks!\". Eight dollars and change later I'm out of there.", "author": "Rich S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-16", "description": "Great vegetarian options including tofu, cactus, or grilled veggies.  Always tempting me on my walk home from the gym...", "author": "Kacie O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-26", "description": "We had a super crappy meal here the other day. I don't know if it was just an off night for them or 8 million degrees inside and the staff was overworked but whatever, it just sucked.\nWe usually go to castillito (just a few doors down and a million times better) but we were feeling lazy about not having cash and casa mexicana takes cards.\nMy husband had a steak plate which was basically an open faced burrito and he said it tasted like dog food and I had a prawn burrito. It took so long for them to make (seriously it felt like an hour but it was really crowded and hot inside) and they didn't give us those little cups for the salsa until we asked repeatedly for them.\nI've actually eaten here before and it wasn't that bad but next time I think I'll just go to Castillo where I know it will be delicious.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-14", "description": "Enchiladas = QUE BUENO!\n\nGive this place a try, and you will kiss La Taqueria (= OVERRATED) goodbye!\n\nI have been dining out in SF for nearly 3 weeks straight, and this place finally inspired me to write my first Yelp review.  This place is light years ahead of your typical hole-in-the-wall Mexican joint.  They use high quality ingredients, no lard, and even have tofu simmered in ranchero sauce for those who don't eat meat.\n\nMe?  I eat meat, and meat I ate.  They have FIVE different kinds of chicken, two of which I sampled in my enchiladas.  Both were very tasty and distinctive, and the large, lean, succulent chunks of all-white breast meat are oh-so-good.  And this is coming from someone who almost NEVER orders chicken.\n\nSo I have been on a quest for the perfect enchilada for several years now, and this place is the best I've found so far.  The red sauce has a complex and distinctive taste--much better than your usual tomato drivel.\n\nChips, refried beans, rice, and salsa bar all are well above par too.  Mix in a friendly kitchen staff that seems to have deep roots in the neighborhood, and you simply can't go wrong.", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-24", "description": "Delicious, and one of the only affordable places in Noe Valley.  Service is quick, food is fresh, and the atmosphere is fun and casual.\n\nIt's everything I want in a local Mexican restaurant.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-25", "description": "Good food. If you work in the area- great place for a quick bite that's extremely filling and cheap.\n\nYum.", "author": "Art A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-20", "description": "Sour cream was like white water.  The guacamole was 90% cucumber...no joke. Just charge people more and give them real guacamole.  Cucumber is unacceptable.", "author": "Vincent C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-26", "description": "The Best Mexican Food in the City! A payday favorite!", "author": "Sara G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-19", "description": "Casa Mexicana I burritos are alright, but nothing special here.  I'd rather go to Mission/24th Sts for a burrito at El Farolito.", "author": "George L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-10", "description": "Had a tofu ranchero burrito; pretty decent. This branch has one of the better interiors (pleasant looking, at least) as far as Mexican fast food joints go.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-03", "description": "I like this place alot better than the one next to this place! \n\nDecent veggie brito, awesome chips! Also love cheese enchilada plate they have!\n\nAlso love Frida's photos and Diego's paintings inside!", "author": "moshi m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-04", "description": "I love this place. Fast, friendly service and damn good food. \nBest place to grab a bite walking home from the Church station.\n\nAnd it's dirt cheap - well, at least for this city.", "author": "Pam Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-10", "description": "Casa Mexicana is pretty ok.\nI like their burritos but nothing to write home about.\nI prefer Azteca just south on Church.", "author": "Joshua E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-30", "description": "For someone who's been to more than a few mexican restaurants this place is one that I always keep coming back to again and again.\n\nThe burritos are made how I want them and are a good size. The nachos are also really good (even though nachos are a made up dish). I guess because I speak Spanish the people there can understand better what I want and what I don't want. \n\nTheir sister restaurant in Noe Valley has equally good food where if I was in that neighborhood more I would go there just as often.\n\nThanks Casa Mexicana for the good burritos and nachos...oh yeah and for serving those Coronas I like as well!", "author": "Alexandra A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-16", "description": "This is one of our default local restaurants when we feel like Mexican food. The quality of the food is sometimes inconsistent, and depending on who builds your burrito, it can be quite variable too. \n\nI prefer this place over some other taquerias because they have more authentic choices unlike those who have only Gringo items on the menu. The Chicken Mole is very tasty, as is the Chorizo, and Pork in Green Tomatillo Sauce.\n\nOverall I would say this place is \"quite good\" for a cheap and casual meal. It is sometimes dissapointing due to inconsistency, but for the price, it is not too much of a gamble.", "author": "Adrian L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-26", "description": "Had for dinner tonight...not good, the food was stale, my quesadilla had hard pieces of meat in it....I honestly will not go here again.....ick.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-30", "description": "If you are stuck in the area and craving a burrito, do not fear this place... Good selection and you will not be disappointed because they do make good grub. \n\nHowever if you are looking for a burrito to tell your friends about... keep looking. SF is blessed with more than a few places that make Casa Taqueria just about equivalent to making a burrito at your own Casa.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-12", "description": "Sorry, but you have to try harder Casa Mexicana. You have prime real-esate yet you've rested on your laurels instead of producing great food like your competitors (La Taqueria, Los Coyotes, Cancun). If you do a good job, geography helps you capture the Castro and Lower Haight market.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-05", "description": "I'm a general lover of tacos, but I really did NOT like what I got. The carne asada taco was way too watery, too big for me to actually pick up and eat, and just an overall weird tasting taco. I swear, maybe in another life it was probably a burrito or taco salad. I didn't like the price I paid, either. This is what I get for not walking a couple of feet up to El Castillito. It's doubtful that I will ever go back here.", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-16", "description": "I found Casa Mexicana highly disappointing. I only rarely treat myself to burritos lately (trying to lose weight), so it's a bummer when I order a burrito and it comes with overcooked chicken and some serious temperature issues. I'm going to stick with Zapata or La Fajita from now on.", "author": "Curtis F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-02", "description": "I hate to be a downer.  I really didn't like this place.  I got a veggie quesadilla, which was so-so.  My friends got the cactus tacos, which were wayy too salty, and the salmon tacos were apparently not good either, although I didn't try them myself.  I did try the cactus and it tasted like salt.  Add to that the fact that the dining room was cold.  Not my favorite place in the city so far.", "author": "jen h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-20", "description": "The tofu ranchero burrito is there for you, like a good friend, when you get yourself into hungry trouble. And it's here at Church & Market, the center of the world.  Get it with avocado slices, not guacamole.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-07", "description": "A favorite hole-in-the-wall eatery, I usually get the Nachos con pollo which is a five hour, stomach-filling meal! Really, I don't need to eat much more after this. I had their tacos con pollo today with extra jalepenos and a wonderful hot salsa. I like the smokey flavor of the roasted chicken though most of the times I ask for the 'pollo rojo' which is a piquant red sauce. Try the burrito nopales for something different..the cactus picks up the other flavors incorporated! The staff is friendly and I try practicing my Spanish while ordering. Prices are VERY reasonable too!", "author": "michael s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-18", "description": "You'd have to be insane, retarded or tongueless to go here when Castillito is 20 steps to your right.", "author": "merkley m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-03", "description": "As I walked in door of Casa Mexicana I thought \"Why haven't I been here before?\" Clean, friendly, and with cool mosaic portaits of Frida Khalo it was a refreshing alternative to the interior of El Castillito down the street. \nHeard rumors of great chile rellenos burrito here but my appetite was only ready for a taco. A veggie taco. Lucky too cuz Casa Mexicana is kind of expensive. Taco, chips, and agua in hand I headed to the salsa bar; green was good. Smashed the whole plate in my face. Straightforward and tasty, for a taco. Girlfriend had the grilled chicken version with onions and peppers and felt the same way. Moderate Mexicana.", "author": "Corey D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-01", "description": "all that beer at lucky 13 can't be good for me, especially on an empty stomach. oh, and did i tell you i'm asian? um, light weight? guilty! so before i make a complete ass of myself and get thrown out of lucky 13, i usually walk over to casa mexicana and get me some cheap mexican food to soak up the alcohol. casa mexicana offers solid food that's easy on the wallet. so you should have plenty of money to go back to lucky 13 for more beer afterward. in my opinion, the food is more traditional than papalote or pancho villa, but you better ask maria d if you want the resident mexican food expert's opinion. i swear, that girl should have her own mexican food blog.\n\nin conclusion, casa mexicana may not be a destination spot, but its close proximity to lucky 13 (a destination spot indeed) is a blessing............and thanks to casa mexicana, i have never been thrown out of lucky 13. now how many people can say that?", "author": "frisco j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-20", "description": "Casa Mexicana's a clean establishment--a good mexican food joint in the Castro.  The place looks small from the outside, but there's more seating towards the rear.  The menu features a separate veggie menu with options that include a tofu ranchero burrito.  Portions are hearty and worth it.  And it's always a plus when they take plastic.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-01", "description": "i still have yet to find \"mi casa\" for burritos in my neighborhood. a word for the wise -- if you are getting your burrito 'for here' and want it wrapped in foil, make sure to ask them for it!\r\n\r\nfirst of all, i came here absolutely starving and I still wasn't completely satisfied... usually when you're hungry, most things taste amazing. in fact, that's my whole theory about why certain people are obsessed with specific sushi hot spots: when you wait forever for your food and are starving and salivating, almost anything tastes fantastic.... but i digress... that is neither here nor there!\r\n\r\n3 stars because the restaurant was clean, the staff was friendly, and the food was fresh. delicious tomatillo salsa as well!\r\n\r\n2 stars deducted because my super veggie burrito was COLD :( also, i hated the way it didn't come wrapped in foil (since i didn't get it 'to go' because then not only is it difficult to eat, but it loses temperature quickly. the filling tasted good but not great.... left me kind of feeling 'eh.' also, the chips were somewhat overcooked -- almost dark!\r\n\r\nwould like to give it another try at some point and make sure to ask for my burrito wrapped in foil!!!!", "author": "Jill M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-14", "description": "make sure that your stomach has room for their huge, nummy platters.  the shrimp taco shocked me with its size (seriously huge) and price (truly affordable).  i've uploaded a pic of my taco,  don't be jealous.  ^_^", "author": "Anita J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-17", "description": "Lord knows I appreciate a tofu burrito, but not one that tastes like tomato soup.", "author": "Tovah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "Always good food, lots of seating, and open late.", "author": "Aneuwave V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-09", "description": "this place is grim. i've eaten here twice. the first time i thought it was the worst mexican food i've ever had in my life. a few years later, in a pinch, i went back...hoping that they had gotten better and that the last time was a fluke. no such luck....easily the worst mexican food i've ever had again. i couldn't even finish my meal....and i was starving. \n\nyou should try this place out. the lack of flavor is amazing. its worth it almost to see how bad it is. it'd be like smelling something that stinks even though you know it stinks just so you can have a shared 'Eeeeewwwww' experience with your friends. \n\nblech!", "author": "h h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-14", "description": "Delicious burritos, a green salsa to die for  (seriously, we smuggle little cups of it home with us), and where else can you get super nachos with chicken mole on top? They really serve huge portions, but it's so yummy I trade the discomfort of stuffing my belly with the joy of eating those last few bites. Too bad the dining area is a bit dark and unlovely.", "author": "Phoebe J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-29", "description": "I give them a one star and that's being generous. Their customer service is horrible and their food is NOT great.", "author": "Omar J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-18", "description": "An OK spot. nothing outstanding, but not bad. hard to choose it over el castillo just up the street, though.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-04", "description": "Anyone that knows me knows that I could eat 3 burritos a day and be happy. This place not only makes wonderful burritos and salsa....but they are also super friendly. I seriously want to hug each person that works there every time I go in (at least twice a week).", "author": "Camille L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-07", "description": "Where else can you get a burrito with lovely, flavorful tofu, and crisp, delicious vegetables, while your friend devours his version of 'tasty'... which comes in the form of meaty something. Very yummy burritos. Customizable in a cafeteria style. Clean, hospitable atmosphere for consumption of said burrito. And I've never finished it in one siting. That's eatin.", "author": "Ania W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-20", "description": "I go at least once a week. Best options: Super Burrito (Steak) or Super Nachos (Steak)", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-25", "description": "I love this place.  They're open late, very convenient.  Best part of all, is brown rice.  I hate white rice, and while there are other places that have brown, usually those places assume you want no flavor on it.  I used to go to El Castillo, but they are very cheap with the cheese, and I eat veggie burritos, they've got to have cheese.  Nice people, great salsa bar, they don't wrap my burrito in 3 pieces of foil that will be thrown away 10 minutes later.", "author": "julie t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-13", "description": "As a soon to be resident in the Duboce Park/Castro neighborhood, I was thrilled to happen upon this place on Saturday afternoon. Whole wheat tortillas, black beans, spicy salsa, and good guacamole. And burritos run less than $5. And they're pretty big. I gave myself a food coma. You can't beat that. AND it's within walking distance of my new digs. They've got a small dining area towards the back of the place. But judging by the traffic on Saturday, this is more of a take-it-on-the-road kind of place. Cheap Price + Good Food = Happy Marie", "author": "Marie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-25", "description": "I had a fun Christmas Eve dinner with my friends here. I ordered the green chicken mole, which was pretty good. They have refillable tortilla chips with a salsa bar. It's all self-serve, but I didn't mind. I thought the setting was very \"luxurious\" without being luxurious at all. Oh, the price was good too.", "author": "Alex Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-22", "description": "I heard great things about this place and wanted to check it out. I ordered a burrito and was disappointed. The sauce they used was not that great and the guacamole wasn't very fresh. The chips were a little stale but at least the salsa was good. We sat at a table with the window seal covered in cushions which were quite dirty. I wasn't impressed", "author": "Denise S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-19", "description": "These guys have been life savers for me on a number of occasions.  Their food is fresh - a HUGE bonus when you are talking Mexican.  Ther aguas frescas and horchatas are always mighty tasty.  Oooh, and those chips...", "author": "Shane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-08", "description": "I thought I was being adventurous and coming here instead of Azteca but they're exactly the same!  Fortunately, it was just what I wanted b/c I was peeved at Azteca but missed the food...so I suppose going to Casa Mexicana across Market will be the way to get my burrito.  They're slow here also and also have a credit card surcharge though...but it's convenient, good, and clean.", "author": "Debbie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-08", "description": "TACOS. This is the best place for tacos in the city. They are heaping--much more filling than your average taco and they have multiple delicious vegetarian options.", "author": "Hillary L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-07", "description": "The owner is hot, the staff are friendly (and remember your face), and the food tastes fresh.  I really like this place.  They could improve upon their salsa selections.", "author": "Adrian N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-26", "description": "Wha? The fact that this place has four stars on Yelp boggles and confuzzles my poor little brain. Hungover as FUCK on Sunday morning, I wandered down the street to this place to get a veggie burrito in hopes that some rice and beans would soak up the nasty funkedupness in my stomach. Instead, I got the most mediocre burrito I've ever chewed up, digested, and excreted. It wasn't bad, just abolutely nothing special. So much so that I can't believe I'm even writing this review.", "author": "Alyssa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "Great little mexican spot for what it is. The carne asada in the good size burrito I got here really hit the spot. The salsas were some of the best I've had in SF and the chips were solid as well. Great for a fast and cheap bite of quality authentic mexican food. Thumbs up.", "author": "M L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-09", "description": "I saw go the  extra few blocks to get your burrito at Papalote down  the  street! This  place  isn't horrible, but to me  the cardinal  sin of Mexican  food is the chewy, greasy, fatty, chicken. Guess  what  kind  of chicken  was in my burrito at Casa? The  one  redeeming  factor was  the quac is pretty good and  I love a salsa bar, but couldn't  get  over  the  chicken.", "author": "Tara T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-11", "description": "Way cleaner and better, but flavor-wise there is something definitely lacking from the food. They are really nice though and they do have decent quesadillas. Tacos are sort of blah though. The meat has no flavor, it's true.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-27", "description": "Solid.  I like the steak super burrito in a wheat tortilla with black beans and mild salsa the best.  They charge $0.25 extra if you use a credit card.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-25", "description": "Pretty delicious and great for being so close to my house. My food was pretty good but the salsa was a little bit too spicy for me. This place is great considering this is the first mexican place i've gone to in SF that didn't start in San Mateo.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-07", "description": "Check out the hand crafted tile tables in the back room - a nice place for a late breakfast.", "author": "David H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-18", "description": "Congratulations Casa Mexicana on having the WORST super burrito I've had in San Francisco - and I've had a lot!\nI stopped in here because I was taking the J home and it was on the way. I order:\n\"A carne asada super burrito - no rice - refried beans - to go.\" Simple, right?\nThe person starts my order: \"what kind of meat?\" \"um . . .carne asada\" \"regular or super?\" \"um . . .super\" Until she started asking questions, I was confused if she was even working on my order, given the two tablespoons of meat on the grill.  \"what kind of beans?\" \"um . . . refried beans\" . . . She proceeds to fill up the tortilla with a HUGE amount of beans - we're talking like 3 cups of beans here. Then she starts to pile on the rice \"oh - no rice\" I say. Then, she plops it down on a plate \"it's to g . ..\" Aw, hell - I'll just have it here.\nThey use guacamole instead of avocados - a burrito pet peeve of mine, but what can you do? Their salsas were disgusting: they tasted old and fermented and like plastic - as if they made up a big batch on Monday and just kept it around all week. Come to think of it, that's probably what they do. \nThe meat was just gross - it tasted like dog, or what I imagine dog to taste like. REALLY tough, stringy, and flavorless. And the salt! I don't mind some salt, but the beans were SO salty it just took over the taste of everything else. Then to add insult to injury, the thing was not even folded tight, so it fell apart when I tried to eat it. \nIf I hadn't have been so hungry, I wouldn't have even tried to eat this garbage. I guess this place banks on the fact they're the only taqueria in the neighborhood. It wouldn't stay in business in another neighborhood.", "author": "David C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-24", "description": "They changed management or something about 9 months ago. Much of the usual friendly staff gone; prices increased; manager at the register who seems to care much less about service than anyone else there. I use to go weekly - for years, now just once in a while. Their food is still good - oh yes - but you pay the price - in cost and in service.", "author": "mike g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-24", "description": "My advice, take that little walk toward the Mission.   Dude, canned shrimp?  cheap yes.  good no.  fresh. not even close. passable drunk/stoned food, sure, but so is taco bell.   Was hoping for more from a local place but it's the 7-eleven of taco joints - cheap and convenient.  oh well, plenty of other choices.", "author": "top b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-29", "description": "I agree, it's a lot more appealing and appetizing than the place down the street.  The prices are right in line with what you would find outside of the Mission district.  The carnitas is delicious and always moist.  The only hangup I have about this place is sometimes the burritos can be cold.  At first, I thought it had to do with them putting lettuce in the burrito, and the lettuce cooling everything off.  But, then I ordered a burrito without lettuce and still had the same chilly result.  As a point of interest, I have gone two more times since then, and have not encountered a cold burrito.  The ingredients are consistently, fresh; the salsa bar (albeit) a small one is a great plus too!", "author": "DamnGringo X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-20", "description": "Casa Mexicana is another place around the upper market area that's just fine.  Their food is fresh, not too greasy, cheap and pleasant to eat.  We never find that anything stands out in particular, however.  The salsas range from decent to so-so, and the guacamole is a bit sub-par, but certainly never bad.  The place is decorated really nicely, and interestingly, with Frida embedded in tiles (which is always awesome), and is one of the more pleasant taquerias for dining in.", "author": "Nicole and Kayvon B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-28", "description": "I used to like this place (especially when its sister taqueria Taqueria Azteca was too crowded) ... until I found out about their alleged abusive practices against their employees: \n\nhttp://cbs5.com/business/azteca.taqueria.complaints.2.779706.html\n\nNow I wouldn't touch this place with a 10-foot pole.", "author": "Randy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-23", "description": "One word......AMAZING!  Delicious taqueria sort of place! Staff is very friendly. TONS of items on the menu. Very fresh and clean. The green salsa is some of the best green salsa I have ever had in my life.....and the best thing of all, is that they have a salsa bar so you can help yourself to as much as you would like.  The food was excellent. I'll definately be back!", "author": "Julie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-12", "description": "i won't get caught up in the \"best burrito\" wars SF has become famous for, but this place is pretty damn good. it's clean, well-lit, they use fresh, tasty ingredients and (unlike many burrito joints) the staff is actually friendly here. there's another tacqueria on this stretch of church, but you should avoid that one like the plague you'd probably contract if you stepped inside - stick with casa mexicana (the one closest to market) and you'll avoid that nasty doctor's visit.", "author": "RT G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-25", "description": "my tippity toppity most favorite mexican food joint in the city. super friendly, super yummy, i usually get food to go but when i stay, there is almost always a place to sit. im always super satisfied. super as in coma.  the good kind of  coma.", "author": "coffeecake j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-28", "description": "I want to start by saying that I am from Colorado where we smother everything, and we make a mean chile relleno burrito. I have been homesick for years for that kind of massive gratification. What stands out in my mind about this place and their fare is the variety on the menu and the smoky flavorful salsa' and enchilada sauce. I personally sampled an azteca burrito with Chile relleno and it was so flavorful hot delicious that I have no problem saying it is my favorite in the city. The chips are fresh, and the selection includes tofu in several different styles. The red salsa is so addictive and flavorful/ reasonable spicy that it would be wise to get 2 cups.  The warm atmosphere is inviting and the dining area is spacious and separate from the street which is nice if you want to have an actual conversation. It is very colorful with Freida Kahlo reproductions on the wall. The stress here is that yes it is quick cheap  but instead of being a taqueria it is much like the name suggests a house of Mexican flavor and culture.", "author": "crystal j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-04", "description": "The back room gets a bit smoky at times, but the food here is amazing and fast+fresh", "author": "Nick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-03", "description": "I was born and raised in El Paso, Texas.  For those of you who don't know where that is, it is a border town in West Texas.  I am 100% Hispanic, and as you can imagine I know a thing or two about Mexican food.  I love Casa Mexicana, or as I call it Mi Casa (don't ask).  I will say their food differs slightly than the homemade Mexican food I am use to.  But that doesn't matter.  When I say differ, here is what I mean.  Where I come from, we don't offer spinach tortillas or black beans. But I don't mind because they are delicious. Their burritos are beyond huge, and mighty tasty at that. They have great quesadillas, and cold beer (which is very important to Mexicans). The staff is always so friendly, and to no surprise at all, VERY speedy at what they do!  If you are in the neighborhood, try it out...I think you will like it.  BTW...I am not saying this is the best in the city.  Believe me I have had some great Mexican food in the Mission, it's just so hard to decide which place best represents my fathers cooking.", "author": "Samantha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-23", "description": "I LOVE BURRITOS.  I'm from SoCal and I grew up in a Mexican neighborhood.  This is the first five-star rating I given but it deserves it.  Okay...it seems, a lot of people think that in order for Mexican food to be \"authentic\" it has to be unhealthy.  WRONG.  They have good rice if you like rice in your burritos.  I love the pinto beans.  They use quality cheese not dehydrated nastiness.  They have good salsa.  You have a selection of tortillas: flour, whole wheat, tomato, and spinach.  I hadn't ever had a spinach tortilla before I came here and strangly I liked it.  I'm vegetarian but I haven't always been and I know what good meat looks like when I see and smell it.  They're plain chicken looks really good.  You can also get real Mexican Coke's in the bottle made with real sugar and not government subsidized corn syrup.  The ladies and gentleman behind the counter are GREAT say hi, introduce yourself, they'll remember you!  While you're there check out all the Frida and Diego picture-tiles.", "author": "Amanda A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-06", "description": "I usually go to El Castillo when I'm done in these parts, but I thought I'd check this place out last night -- mainly because there was less of a line. I guess there's a reason the line is shorter. The burritos are just ok. They're a bit smaller than what you usually get in the bay area. The chicken was tasty but it was lukewarm. Overall, it was not memorable. If I come here again, I want to try the fajita burrito because it gets cooked to order.", "author": "Luke F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-30", "description": "This place is the closest taqueria to my place (mi casa if you will)...so when I crave some comida mexicana I head to Mi Casa Mexicana.  I would say it is definitely in the top tier of taquerias in the city.  The interior is a bit nicer than most other taquerias...with Frida Kahlo and Diego Rivera memorabilia around the place.  I haven't lived here long but I have done my fair share of eating tacos, burritos, and the like.  It's quality is on par with Toro, Pancho Villa, and Taqueria (I haven't been to the fabled Papalote yet).  They have a fairly wide selection of meats - it seems like they have a few more choices than some other places.  As long as I stay true to my staples of Super Tacos and quesadillas (with sour cream and guac) - I always leave happy.  I ordered a chili relleno on my last visit - and I don't think I'll order that sloppy, soggy mess of cheese again.  Their salsa bar is not QUITE as good as some of the competition, but they do have cilantro, diced onions, and jalapeos on the bar.  They also serve \"Mexican\" Coke...which I am assuming has a different flavor than normal US of A Coke.  Definitely better than the competing taqueria right up the street.", "author": "Adam M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-16", "description": "Great mexican food!  Much better than Castillito, which I found to be greasy and heavy..  This place is lighter, the ingredients are fresh and the prices are great.  This place is definitely in the regular rotation.", "author": "Kristen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-21", "description": "i'm a sucker for salsa bars...and they have a great one. i love their salsa verde. also, they serve breakfast burritos all day...so when you wake up from a long night of drinking and it's 2pm, get your breakfast on here.", "author": "selma s."}
