{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "The food is good. I came here during my lunch break from UCSF. I ordered the Wonton in chilli sauce and Mongolian beef chow mein. Both were excellent.\n\nI wanted to substitute the thick noodles to the thinner noodles on my Mongolian beef chow mein. They wanted an extra charge of $3.00, which I pay bc I like the thinner egg noodles. The really shouldn't nickel and dime people.\n\nNoodle are noodles. I buy noodle from the Chinese market often. Noodles are very inexpensive!", "author": "James N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-15", "description": "Ordered delivery at 3:30 PM on a Monday (fulfilled via GrubHub) -- estimated time to deliver 60-70 mins.  Called at 5PM (90 mins post order), was told they were \"very busy\" and sometimes it takes much longer than 70 minutes to deliver.  Actual delivery time 5:15 (105 mins).  \n\nRecommend updating that language then to reflect actual delivery times might be....infinity?  Just following her logic.\n\nFood was meh.  Ordered everything light on the sauce, think they interpreted that as \"extra, excessive, way more sauce than anyone would ever need\".  Won't be ordering again.", "author": "Tyler K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-24", "description": "The last 4-5 times I've ordered from Chang's (either via Yelp or called it in and picked it up), they struggle with including hot sauce/chili oil. Last month, I called in an order for 4 entrees and picked it up on my way home. I asked the lady (the older lady who's always working) to include some hot sauce and chili oil in the bag. When she brings it to me, there is not hot sauce. I ask her AGAIN, and she brings one. I said, \"excuse me, I ordered 4 entrees - can I at least have 4?\". She huffed and puffed and threw 3 more my way. \n\nTonight, I ordered my food delivery via Yelp. I put specific instructions 3 times saying \"please include hot sauce/chili oil with each entree\". I received my order, and alas, no hot sauce. \n\nHot sauce & chili oil costs nothing -- this is just a representation of poor customer service.", "author": "Zoe Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-01", "description": "Late post: Again non of the food was good except the dry fried chicken wings and string beans but the service was nice. Not much to say beside I love their chicken wings which they do deliver for parties. Oh ....do not get the fried salt n pepper calamari. It was so salty.", "author": "Christy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Chang's Kitchen never disappoints. My family has been coming here for over 6 years. Mr. Lu and Jenny have seen my children grow up from babies to school aged kids. My family love coming to this place. \n\nWe ordered the Hong Kong combination noodles (Hong Kong Style is crispy noodles), string beans with beef and salt and pepper fish. My kids absolutely LOVE the HK combination noodles it comes with a variety of vegetables and meats to include seafood. That dish is always the one that gets emptied first. \n\nMr. Lu and Jenny are always personable and treat us like family. \n\nGreat food and personable staff = Great place to eat!!! Enjoy!!!!", "author": "Dorothy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Apparently, this restaurant has changed hands many times over the last few years. They currently have four chefs in the kitchen, so the food is cooked fairly quickly. I like that they have dishes from many different provinces in China like Shanghai, Guangdong, Szechuan, etc - a diverse menu. \n\nTo start off the meal, there is complementary soup. I ended up ordering their homemade green onion pancakes, which were a bit dry. The fried egg roll with taro was very crispy and delicious, and so was the fish fillet in chili oil and Shanghainese pan fried noodle. \n\nThe service is also very good. All the servers, especially the older guy, were so friendly and had such good energy. It was nice talking to them and hearing what they had to say about the restaurant and their dishes.", "author": "Kristine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "EVENT: one of those days you seriously don't want to cook - which is everyday for me... lol... I moved to a different location in SF and currently tryna find a new \"go to Chinese comfort food place.\" I walked pass this place a couple times and never though of going in... but... here I am... I'm finally trying this place.\n\nFOOD: I ordered togo\n(1) Wonton Soup: wontons well made! Carrots and cabbage! delish - 4 stars \n(2) Salt & Pepper chicken wings: OMG SO GOOD! If you like salt & pepper shrimp.. you'll like this Salt & Pepper Chicken. It's battered well, super crispy, and savory! Def... will order this again! 5 stars! **MUST TRY**\n\n**OVERALL: I'll come back for the salt & pepper chicken! 4 stars overall! YUMS!", "author": "Mindy Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-25", "description": "Ordered sesame chicken and each chunk had 70% dough. Go see the photo. We also got the same amount of meat as we do at Panda Express but Panda Express bowls come with a side and rice or noodles, at a cheaper price too.. Panda Express food taste better than this place's food. The only good thing I could say about this place is the elderly man who waited our table was very kind and checked in on us a few times. Either way, we will never come back, can't trust these cooks. They just lost a customer group of 3 for playing around with our food", "author": "YH L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Great place good atmosphere reasonable prices everyone here is nice. Must try the dry fried chicken it will not disappoint", "author": "Vinnie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-17", "description": "Came here the other night after giving up an hour long wait for San Tung. Food was decent and the service was good. Server was kind and attentive. Beware that they include tip in your bill! My order was only supposed to be around $5 and i ended up paying almost $10.", "author": "Gabby O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-15", "description": "Not a fan. All items were greasy. The twice cooked pork was mostly not edible. General Tso was overly breaded with too much sauce. The salt and pepper chicken wings had promise but all the wings had something odd going on with the way they were butchered. The chow fun and fried rice were coates in oil making it not worth finishing.", "author": "Ken R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "We were supposed to go to the Chinese food place across the street but they were closed, and I'm so glad they were! Chang's kitchen hit right on the spot. The staff was soooo friendly and welcoming that's what I loved most about here. And the food was DELICIOUS. I told my friend I'm going to be coming here every week! Haha. Their prices aren't bad either, I just had an amazing experience.", "author": "Diana P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "I am NOT surprised as to why/how this place has close to five stars. The best part about this restaurant is the owner. He has such an amazing sense of humor! It's entertaining. The service is amazing and fast. You have to order their Mongolian beef. I always order Mongolian beef with rice every time I eat out at a Chinese restaurant and no one has disappointed me yet. Chang's Kitchen's Mongolian beef is by far one of the best I've ever tried. I'm a very picky eater and very critical when it comes to my food so that should say a lot haha. My boyfriend ordered their orange chicken. That was the first time that he and I have tried orange chicken, spicy! It was different because it was a new taste for us but it was good. Not as good as the Mongolian beef though.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-28", "description": "Over priced, below average Chinese food! The sesame chicken should be renamed sesame dough with a little chicken because there's more dough than chicken and it wasn't even crunchy! The person who takes the order over the phone was rude and when we got there the food wasn't even ready to be picked up!", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Best deal at Lunch in Sunset\nTasty Canton dishes also Chinese dishes \nThe fish filet with sweet corn is the best ! \nNomnomnom", "author": "amy y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "When we walked in on a Wednesday during lunch, we were greeted by friendly staff and were seated right away. We got the mabo tofu and the Shanghai dumplings (10 count). Oh my gosh, that was a lot of food. I would say the size of the meal could feed 3 people. Especially the mabo tofu had very generous  portions. At the end of the meal, the kind staff even PACKED our lunch for us! I did not expect that, for even some higher end restaurants do not do that! The food was delicious and we had an amazing experience.", "author": "Julia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "The was 18 years old the last time I ate at this restaurant and I'm now 33! This is my absolute favorite Chinese food in SF! The food is great and the owner is so nice and friendly. He has really great customer service!!! Definitely would recommend the Beijing chicken, walnuts shrimp, and salt and pepper prawns!!!!", "author": "Hanalei M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "This place keeps me fed. They have such a large menu, (including vegetarian meats and dim sum) it would hard to find something you didn't want to eat! \nI stumbled upon Changs when I was waiting for my table at San Tung and months later have still never made it to ST because Changs has quick service and delicious meals! Changs always meets my expectations for a great meal.\nI've liked everything I'd ordered and always try something new because of that. In house or delivery... I'm in. Thanks to the Changs Kitchen staff!", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "This place is across the street from Shantung or 山東小館 that is always packed and this place always has a table.  I don't get it. ST is alright. Nothing special. The food is about the same as this place. The prices a slight better here. And the staff & friendly and remembered me the 2nd time I came. The people are from Guangzhou so speak to them in Cantonese is you can. They will be so grateful & you will get better food.", "author": "Leung T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Chang's Kitchen is my go to for good Chinese food. Service is excellent, food is tasty, accessible location, and friendly staff especially Lou. Lou knows our favorites to the point that he starts uttering them before we sit down and all we have to say is \"Yep!\" :)", "author": "Cecille A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-11", "description": "I would've given this place 5 stars for the prior 4 times weve came here. But the last time my dad and I came here, the service and food were good as usual. \n\nWhat pissed me off was that we paid our bill, and left a cash tip.\n\nWe started to head out the door and couldn't have been more than 3 or 4 steps out the door. When one if the servers yelled at me and my father! She said \"hey! Where's my tip?!!\" Are you freaking kidding me?!?!? I said excuse me ??? Your tip is  on the table! Look a little harder for that $6... the bill was only $29 or so... what I should've done was go back inside and snatched the tip off the table. \n\nRude ass bitch didnt deserve a tip after coming at us like that! They've just lost out business. Which sucks because the food is usually really good, and the older gentleman who has served us before is really kind and  down to earth. Smh!.... the nerve of that server. So just beware if you eat here. They might chase after you when their blind ass servers can't see cash.", "author": "Coraline J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-22", "description": "Today I was going to stop and eat here but first I needed to use the bathroom and the waiter charged me $3.50 for a soda to use their bathroom. After that I didn't even bother to sit and eat here. I was astonished at the service. He didn't even ask to see if I was going to eat here. I ended up going across the street to eat.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "This is place is very right one for me! I like dry fried chicken wings, here is very delicious, better than other restaurants, crispy, soft inside, yummy! \nService is always my favorite, Jenny and Lu very humble, very nice, 5 Star.", "author": "Yabin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "Chang's Kitchen has pretty authentic Chinese-American food. The old man who took my order was a dear and he always made sure my water cup was full so service was awesome! If you're going to eat here, the one thing that id like to HIGHLY HIGHLY recommend would be the barbecue pork buns. i rarely eat buns so i got it to just try something new but it was AMAZING. there isn't a lot of filling but the buns are sweet and served hot so the next time i come, i think i'll only order this honestly. The tai chow fun was lacking in flavor though and the chunks of broccoli were way too big. i also got the fried rice and it was decent but nothing matches the bbq pork buns!", "author": "Maya S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-09", "description": "I think the only reason why my boyfriend and I came here was because San Tung was super busy. And it got great ratings on Yelp, but I was disappointed with the food. We tried the minced beef cilantro egg white fried rice, chicken wings with fries (just for kicks), and the green onion pancake. The fried rice was really flat and didn't really have any flavor. And the chicken wings and fries were decent. But the green onion pancake was way too thick and needed some dipping sauce.\n\nI will say the service was outstanding. Probably the best service I've had at a Chinese restaurant. Our waiter was really intuitive and knew when we needed napkins, more tea, etc., all without us asking for them. But he knew we would need them :)", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-15", "description": "After a crazy line at San Tung and the line not moving this was the best option for a party of 15+. They were able to accommodate the number of people and service was good. Most of the people got the canton special. Some of the highlight dishes were the honey walnut prawns and the wings were a ok substitute. Most dishes were just aright and nothing too special. \n\nA decent alternative to San Tung if you're hungry and tired of waiting.", "author": "James H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-28", "description": "Ordered the beef, very chewy, noodles was very plain, I asked the waitress, she insisted the quality is good and refused to take it back, and insisted to charge half of the price. Don't know where the good reviews come from, definitely will never come back. Horrible food quality and service", "author": "Amy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "Decent take out and the free delivery is amazing. Ordered through Yelp. I got the dim sum platter, shrimp wanton, and spring rolls. The dim sum platter was pretty good. Shrimp wanton was not shrimp wanton, so that was sad. It was like pork wanton with shrimp pieces around.\n\nI would order again, especially with free delivery.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "This little hole in the wall has some really good food.  We were promptly seated and then we were served hot tea on the house.  We then waited for our order to be taken, but after about 15 minutes we gave up.  W hunted someone down to take our order.\n\nW ordered the crispy duck lunch special, which included an egg roll, hot and sour soup and rice.  I ordered veggie mu shu from the regular menu.  We shared an order of shrimp and chive dumplings.  Everything was so delicious and fresh.  We both loved our food and the servers.\n\nOur server was very nice, but I had to ask for water twice and our orders were delivered separately.  I had to wait a bit longer to receive my dish.  Also, the dumplings were delivered when we were about half way through with our meals.\n\nI definitely give the food 5 stars.  It did seem that every other table was received better service than us.  Maybe it was because we were seated at a table facing a window away from the servers.  Anyway, it definitely would not stop us from returning.", "author": "Teresa L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "So I ordered food once and it was great. The second time I ordered with friends and  I literally bit into a piece of metal that was in my food!!! We placed a big order because I recommend this place to my friends. But to my embarrassment, I found a screw in my food, screw me! A piece of f'n metal! This place is lucky the inspector hasn't been called yet. We talked to a manager to complain but they wanted to comp one item only. We expressed that we didn't feel safe eating the rest of the food but they didn't care. They were only going to refund us for one item. Wow! That was a poor business decision on them. I could have been really hurt by them and had to throw away all that food!", "author": "Jose J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-31", "description": "Came in for the fried chicken, which were somewhat disappointing. There was a symbol on the menu indicating that the wings would be a bit spicy, but they ended up being pretty sweet. They were also just thick in sauce, which took away from the fried chicken.\n\nThe salt and pepper pork and salt and pepper calamari were tasty. The pork was delicious and perfectly cooked. The calamari was alright, but a little small in portion.\n\n(Date of visit: 07/23/2017)", "author": "Adrian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "If you don't have time to wait for San Tung this restaurant is a very much adequate alternative. Although their dry fried chicken isn't on par with San Tung, maybe 80%, but the selection and taste of the other plates are pretty good. Although there's usually a long line at San Tung, this restaurant will usually have a table. Definitely worth a visit. Let me know your thoughts if you're going from this review!", "author": "Murray N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-23", "description": "Dry fried chicken wings were fried nicely but I thought the sauce was cloyingly sweet and not good at all. Not what I expect from Chinese chicken wings. As someone who pretty much loves eating any chicken wing, I couldn't eat more than two of these because the sauce was weird.\n\nSalt and pepper pork chops are delicious! Nice, hefty portion and seasoned perfectly. Fried to perfection and not dried out.\n\nSalt and pepper calamari was okay! Rather small portion. Fried nicely and seasoned well.\n\nSiu mai was standard/nothing special other than being a bit meatier than siu mai I've had in OC - but definitely overpriced at being around $5 for 4 pieces.\n\nThey didn't refill our waters. Tea was good but was not piping hot like how tea should be served.\n\nDate of visit: Sunday, July 23rd, 2017", "author": "Brittney L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "I first came here with my mom two weeks ago when we came to SF. I tried the dried fried chicken wings (mild because I can't to spicy ) and it was one of the best fried chicken I've ever had. \n\nI drove back from LA today and leaving SF tomorrow and stopped by here to get the same fried chicken and it was still delicious! Hot and crispy as it can get!! If I ever have the chance to come back to SF I'd definitely visit here again. Oh and I don't know the name but the old gentleman was one of the nicest person as well. Make sure to stop by this place if you're in SF", "author": "Minho L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Their water boiled fish and ribs are fantastic. I come here very often. The servers are very friendly and prices are unimaginably reasonable. Their chicken  wings are delicious as hell. I think their food is suitable not only for Asian but also worth American native to try. Higher recommend bean ribs, chili ribs, beef brew pot. And wangtoo soup is so tasty.", "author": "Richen Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "My roomie and I have a weekly tradition. On Saturdays, we get huge 56oz bottles of low-quality Korean beer, play the terrible Dreamcast game Shenmue, and, most importantly, order the medium-spicy Szechuan feast from Chang's Kitchen. The delivery is super fast -- the one hour estimate always ends up being around 20 minutes. We get a meal and a half each out of it, which isn't half bad for $16 a head.\n\nThe wontons are simply sublime. They're deliciously spicy, are filled with meat that's a little sweet in addition to hot and savory, and the chili oil they come in goes great with the rest of the meal. The (free!) crab rangoons are good too, always nice and warm. I'd like them to have a little more filling in them, but what is there is tasty.\n\nThe kung pao is fine. That's all I can say about it. The Mongolian beef is good though, but Mongolian beef is always good so no surprises there. I wanna try one of the spicier ones, but my roomie can't take spice so I'll forever be left wondering if my hypothesis of \"more spicy = more good\" holds water.", "author": "Shawn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "I ordered from grubhub delivery.  The delivery was within an hour and the deliverer courteous.  I thought their lunch house special wouldn't be too filling (asian restaurants usually load a lot of white rice but a smaller portion of actual veggies/meat),  so I also got the bbq spareribs appetizers.  Well, they DO give you a lot of rice, but they give you enough house special veggies/meat which were tasty and tender.  The only neg is they should cut their broccoli and celery into smaller bite-sized pieces.  As an example, the broccoli looked like little tough trees the size of a wristwatch.\n\nSome of the bbq spareribs were pretty tough to bite into, not at all tender and the bottom half of the spareribs carton was just all lettuce(actually not that bad since I ate it as a side salad), so that's why it's 4 stars for me.\n\nBut the house special was very tasty and filling with decent sized shrimp and good beef/chicken portions and very tasty sauce and the prices were great, so I'd DEFINITELY order here again for delivery when near their area.", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-22", "description": "Came here for take out. I ordered dry fried chicken wings, honey walnut prawns, tomato beef chow mien and mushroom with egg tofu. Overall it's been a disappointment. If you read my other reviews you'll know that I recently been to San Tung, which is literally across the street. Chang's chicken wings or prawns is no comparison to San Tung's. The other restaurant has better flavor and the glaze is much better. Since they are so similar and the food I ordered are almost the same, I appreciate that both offer affordable prices for good portion. However, Chang lacks the flavor that I'm looking for. Their mushroom and egg tofu had only a few pieces of tofu and mushroom but lots of broccoli. And steer away from their tomato beef chow mien - terrible flavor and lots of raw onions. I won't come back.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "My husband and I love Chang's! It's our go to neighborhood spot. Great front of house customer service. My husband choose this restaurant for his birthday dinner! We always order Orange chicken, sweet n sour pork, white rice, spring rolls. YUM! Their orange chicken is to die for!", "author": "Jes C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "This place is by far our favorite Chinese food restaurant to go to in San Francisco. Not just for the food, but for the excellent service as well and I'll get to that later in the review.\n\nFood : everything that I have tried tasted really good. From the Mongolian Beef to the Honey Walnut shrimp. AWESOME! \n\nAtmosphere : pretty typical of any other good chinese restaurant. Nice and welcoming environment. \nGOOD\n\nService : the service is good here but 1 individual goes far and beyond what you'd expect from even the best of them. His name is Lou, he's extremely accommodating, friendly, funny, and just all around great person. He takes so much pride in what he does and it really shows. When we went there last it was a day after my son's birthday. When Lou found out his bday just past he went in the back and came back with a teddy bear for my son and wished him a happy birthday. AWESOME!!!", "author": "Raymond M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "While driving through SF, I spotted a nice little Chinese restaurant. I ordered chicken wings, green beans, walnut shrimp and salt fish fried rice. \n\nThe chicken wings were great! \n\nThe skin was made crunchy and the meat juicy. The sauce is sweet and spicy. \n\nThe walnut shrimp was great!\n\nCoconut shrimp is a perfect combination. \n\nThe fried rice was great!!!\n\nThis was the best part of the meal. The rice had hints of ginger but not overpowering. The staff is also so friendly.I would recommend this place to anyone!", "author": "Travis M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-21", "description": "You guys, I was so disappointed by this place. After bottomless mimosas for brunch, I had a craving for Chinese food. I was so excited to get hui guo rou (twice cooked pork). Unfortuantely, it was ridiculously fatty and tasteless. It was probably the worst hui guo rou I've ever had in my life, and that is one of my favorite dishes. The scallion pancakes were way too thick and over-fried. The beef chow fun was the only thing that was remotely okay. Sad face :(", "author": "Eva W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "TL;DR: Decent Chinese food! Doesn't particularly stand out compared to other restaurants on Irving but it really is decent. Reasonably cheap for SF! Free delivery is a huge plus- came quickly and food was warm!\n\nI think Chang's deserves a little more credit! I've been here to dine in and always thought it was okay, and tonight I ordered free delivery. \n\nFood arrived in 30 minutes, though it had quoted me 45 min-1 hour. One large soup and one noodle dish for 2 people with free delivery, tip, and taxes cost $20.53 total, which is really cheap for SF!\n\nTonight I ordered sizzling rice soup and it was GOOOD. No one really mentioned it in their reviews, but I thought it tasted just as good as I used to have eating with my Chinese grandparents in SoCal. For delivery, it came with the soup and all the ingredients with the sizzling rice on the side, dry for you to add yourself. And the soup was really warm when it arrived! Warm enough that the rice still sizzled when I put it in the soup. I was impressed. I got the large size and only ate half and felt satisfied. The veggies were plentiful and tasty and the broth felt warm and comforting on a cold, sick day. It was definitely worth the $8.75 for soup that will last me 2 days (though I have a pretty small appetite)!\n\nI would definitely order it again. :) Thanks Chang's!", "author": "Rebecca T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "The food is very good.    The fried chicken wings were better than their competitor across the street.   I am coming back soon.", "author": "M. W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-16", "description": "Pretty standard Chinese delivery, even a little subpar. For the price, it was fine, and the delivery was pretty snappy. Would try somewhere different next time, but it's edible and would satisfy a Chinese craving.", "author": "Joshua D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "First time here & Food was delicious!  Servers were on point and made sure we didn't need anything. Great Service!! Thank you!", "author": "Yubicela M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "Really good dry fried Chicken wings on par with San Tung - without the wait. And they deliver. Yay.", "author": "teray g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "I love the food there. My family and I go there for all special occasions. Reasonably priced for quality food and great service. They are always so sweet to my kids, too.", "author": "Nancy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "Large portions with top notch service. I came in for lunch with my 18mo son. I had the house special. Tea, soup, large plate of meat/veggies/rice, and an egg roll for under $9. I would have preferred a smaller portion of rice and veggies, maybe skip the soup, in exchange for a little extra meat. I only found 2 small shrimp in the whole plate. \n\nThe staff were kind and engaged occasionally with the little one, which kept him happy to let me finish my meal. \n\nIf you're standing in the long line across the street like I was, consider coming here for some immediate seating better prices, and comparable food.", "author": "Isaac O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "I ordered delivery. \nIt took about 30 minutes to have my food delivered which flew by pretty quickly! \nI ordered online so it was a breeze there were plenty of photos and detailed description of what you're going to order. I hardly had any customer interaction with this place aside from the delivery man whom delivered to our hotel room at Hotel Kabuki in little Tokyo. He was nice smiled & friendly. \n\nThis was choice for my birthday dinner! Food was delicious!!! I would definitely like to dine in one day. Everything was nice and hot by the time it was delivered. They did include forks and napkins but LEFT OUT the plates which was a bummer. But did not ruin my appetite.", "author": "Senay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "3.5 rounded up!\n\nI've always wanted to try this place but since there are so many other yummy options nearby, I never gave myself that opportunity. Until today, when my favorite pho place in the city closed for vacation. ):\n\nA tad disappointed with the food as most of them were really oily and not a lot of flavor in them. I tried their dry chicken wings, I assume in an attempt to mimic the rich tangy flavors of San Tung, and it was underwhelming. Not much of a competition. I also tried their jai jerng mein and flavors did not taste like the traditional ones I've had elsewhere. \n\nIt's not bad though, I mean I would come back if both San Tung and Yummy Yummy were closed and I already made the trip.", "author": "Natalie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "The service here was pretty darn good which is why I'm gonna bump it from a 3.5 to a 4.  I like how the owner said after my meal \"back to the salt mines eh....\" haha. \n\nI had the house special for lunch which was simply beef, chicken and shrimp with rice.\n\nSimple yet solid for $8.75.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "Seems like Chang's Kitchen is the place to be whenever San Tung's across the street is closed. That was the case for us but after dining in, I'm sure I'll be back specifically for Chang's food and not just San Tung's! \n\nThe restaurant itself is really quite clean, and the staff there are pretty welcoming - not your typical \"I-don't-give-a-toot\" attitude you'd find at Chinese restaurants. \n\nFOODDDDS:\n-Spicy Dry Fried Chicken Wings: These were delicious. Crispy. Juicy. Full of flavor. However, I was disappointed that our plate of wings was not spicy at all. In fact, it was more on the sweet side. The flavor is good, just not what I was looking for. \n-Spicy String Beans: YUMMMM I have to say that this was one of the better tasting string beans I've had. SO FULL of flavor - garlicky spicy saucy goodness. I actually dipped my wings in this sauce because of how much I liked it.\n-Shanghai Steamed Dumplings: Average buns of soupy goodness. I wouldn't necessarily crave these or come back specifically for these, but they're good.\n-Shrimp & Chive Dumplings: I think I might be biased because I have a special place in my heart for dumplings. My boyfriend didn't really care for these but I thought they were absolutely delicious in a comforting way. The dumpling skins were boiled to perfection, still had that chew to it. The filling was full of flavor - large pieces of shrimp and the chives didn't overpower the taste of the dumpling as a whole. I could probably eat like 2 orders of these by itself. \n\nAll that food only came out to less than $40. I might not necessarily come back for the wings but I would definitely come back for their DUMPLANGSSSSSSS.", "author": "Ava F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-25", "description": "The food that made it into our mouths was hard to swallow and that just got worse when We found a screw in the food. A Metal SCREW! I called the restaurant to let them know. I was transferred to the owner who promptly scolded me for not telling the driver about the contaminant when he dropped off the food. How I was supposed to know that he was handing me food with hardware in it is beyond me. After multiple calls back and forth to eat24 and Changs kitchen, the manager promised me a full refund, but then told eat24 that she was only refunding the dish with the life-threatening ingredient. It is truly maddening and passive aggressive, but that is the way they chose to address this serious problem. Of course we won't be eating any of the food that came with this order, but I am out 130 bucks for the pleasure. Their food is not worth dental damage, choking, or any other serious threat to your health. The people who run this place made it very clear that your money is much more important to them than your satisfaction or your safety.  Pass on this one folks.", "author": "joel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "This is our favorite Chinese Restaurant in the city. The food is good but the highlight of this place is their server, Lou.\nEach time we go here, he always have this very cheerful, warm, and friendly attitude. He always greets everyone with a smile and makes sure everyone is taken cared of. He is great with kids too! Whenever we are around the area, my son doesn't want to eat anywhere else. He would go  \"I want to eat at Lou's restaurant!\"\nYesterday was my son's birthday, I don't know how the conversation with Lou went but I ended up mentioning that it was my son's bday. Before our meal ended, he came with a little stuffed bear to give it to my son, my son came up to him and gave him a hug. \nThat sweet gesture is something that we did not expect. It made an impact on my son and made him really happy, now he wants to bring Mr. Bears anywhere we go (that's what he named the toy). It made his day \n\nIn any restaurant, the quality of food is always important, but the service matters as much. This place doesn't just offer good food, they also offer an outstanding service that you can rarely find nowadays.", "author": "Krizzy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-28", "description": "Tried the Shanghai steamed dumplings and the fried chicken and both were mediocre. Fried chicken was too greasy for my liking and the steamed dumplings weren't as soft as I'm used to, as the dough was a little more chewy and not as silky.", "author": "Lillian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "came here last weekend because We wanted Szechuan Style food and it was really GOOD. we ordered Spicy Fish Fillet with Flaming Chili Oil with steam rice, Fish in pickled mustard green noodle soup and shrimp fried rice for our son. Both of the Szechuan dishes had good spicy and flavor. \nCan't wait to go back and try other Szechuan dishes!!!", "author": "Jason G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-07", "description": "First time for me personally, dining here. We didn't plan on coming here, but the spot we went to initially had a long wait, so we decided to try this place out. Glad we did! Being from SF, we have been seeing less and less good places to grab chinese/Asian food. All the local spots are slowly changing the quality of their food and it's leaving us with barely anywhere to go. \n\nWe only ordered a few dishes to try and they were all pretty tasty. \n- The pan fried noodles are a good portion. We got it with beef and Chinese broccoli. \n- The salt and pepper halibut is good. Also good portion. \n- The Mongolian triple meat is good. It's got a good tasty spice to it, not just heat. Next time we are gonna ask for that over the pan fried noodles. Lol! \n - the Singapore rice noodles seemed a bit smaller in portion, but it's got a lot of ingredients in it and not just the noodles. (Just maybe add a dash of salt) \n- last but not least, the dry-fried chicken wings were really good. Not sure if that's the name of the dish on the menu, but it's pretty much the translated name. It has a sweet glaze and spice sauce on it. The wings were pretty big in size and filling. The dish came with 10 wings and we were surprised. Yayy!!! Who doesn't love tasty wings! My mom doesn't eat spicy food, so we ordered it without the spice. Still tasty! \n\nGonna come back and try some other dishes.", "author": "Helen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "The best Chinese Restaurant in San Francisco, hands down! I was born & raised in Chinatown, Los Angeles! I know my authentic Chinese food and can't be fooled! After trying just about every Chinese Restaurant in Chinatown SF & surrounding areas, I'm come to the conclusion that Chang's is by far the best in terms of quality and prices! \n\nMy favorite dishes, Salt & Pepper Pork Chops, Singagore Noodles, General Tso Chicken, Deep fried spicy Tofu, Phoenix & Dragon Eggplant and many others....\n\nDo not listen to the haters & negative reviews, you will not be disappointed at Chang's Restaurant! Also, if there is a dish you want custom made they will be more than happy to oblige...speak to the Lead Waiter, Mr. Lou!", "author": "Abel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-20", "description": "Meh. It was okay. I was excited when I saw general tso chicken on the menu but it was soggy and not very flavorful. White rice was sticky and good. The egg roll with the meal was just ok, nothing special. Also, I asked for soy sauce and they gave me one packet which wasn't sufficient (imo) for the amount of rice I received. Maybe eating in is better than delivery?", "author": "Alexa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "You know those flyers you get in the mail, that no one ever pays attention to? That they hang on your door, or the flyers they put in those Value Pak blue envelopes for advertising local businesses? Chang did both of those techniques, and that's how I found out about the restaurant. When I saw it had 4 stars on yelp, I thought it would be worth a try!\n\nMy bf and I wanted take-out delivery. We ordered Yang Chow Fried Rice, Spicy Eggplant, and Sweet and Sour Pork. With the special (see below) we got the crab rangoons free too! Our total came out to around $30. The food was pretty good quality for Chinese food. The portions were big! We both ate that dinner, and still had leftovers for 2 more dinners after that. Not bad!\n\nSpecials:\n-If you order $20 worth, you get free delivery (at least to our zip code, shout out to 94121!). \n-When you order $25 worth, you can get free crab rangoons (like crab & cream cheese deep fried wontons) or egg rolls. \n-If you order more than $30, you can get free fried rice or vegetable chow mein.\n\nI'd suggest ordering on Yelp, since the process is a lot easier compared to their website, and it's easier to find the coupon specials. Delivery time was estimated to be 1 hour, but came within 40 mins. \n\nWe're doing this take-out delivery thing more often!", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "Super fast delivery as I'm at a friend's nearby about 5 blocks. We ordered 5 vegan dishes and they threw in chowmein for free! Super good food and they really go heavy on the veggies so you actually feel good afterwards. Veggies were fat and plump and super fresh.\n\nWe got the \"meatless\" kung pao, orange chicken, and sweet and sour. Tender greens with mushrooms and garlic fried rice on the side. Chowmein for free.\n\nThe best dish was the Kung pao and chowmein! \n\nOh and it's Christmas Eve!", "author": "Priya S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-15", "description": "This is really meant to be 2.5.\n\nOrdered the Szechuan beef with noodles. Broth looked super yummy but was tasteless so very disappointed but, the beef was super tender and melted in my mouth. I probably would have enjoyed it more with a different type of noodles and with some additional seasoning of my own. \n\nAlso had the salt and pepper prawns. This was good but wish it would have been a little crispier.\n\nLastly, had the wontons with hot chilly sauce. This was super salty and I almost feel that mixing this soup with the broth from the Szechuan beef noodles would have fixed both dish since they were complete opposite in taste. Should have given it a go but unfortunately didn't.\n\nOverall okay but probably wouldn't return.", "author": "Hello E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "My father and I checked this place out a few months ago because we did not want to wait for a table across the street.  Boy, am I glad we did.\n\nAfter beer, my second biggest guilty pleasure is chicken wings... and I have had them all over.\n\nChang's chicken wings are about the best I have had.  The are sweet, sticky and spicy.  They use good quality wings with lots of meat and they do not overcook them.  If they did not have any calories, I would be thin.  :)\n\nThe other food is also very solid - but then it better be -- after all this is the City.  We like the hot and sour soup and the sweet and sour prawns.  \n\nEven better, they have free delivery, so if you don't have to deal with parking.  We order delivery often and they do a nice job.  The food comes fast and well packaged.\n\nIf order $25, you get free egg rolls or veggie chow mein.", "author": "Gary A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-23", "description": "Food was average. Ordered spring rolls and got egg rolls. Mushu pancakes were flour tortillas.", "author": "Tracy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "Ordered via Caviar.\n\nI was sold because they have peking duck, which is my absolutely fricken favorite. I had the duck, bbq pork buns, rice, and requested a side of their Chinese broccoli in oyster sauce even though it wasn't on the Caviar menu. Everything was great.\n\nI might even have given them five stars if they had butchered the duck away from the bone. They butchered it Chinese meat cleaver style, bones included, which makes it hard to eat. But it was delicious nonetheless.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-13", "description": "the food quantity on carry out orders is wayyy too small my mongolian chicken order was 80% onions and 20% chicken i am attaching pictures. \n\nThe lady who runs the store was incredibly rude to me and refused to help me in any way. The gentleman, however, was very nice and at least was listening to what I had to say. I went back to the store to tell them about my order and the lady was horrible to me. The gentleman knows how to handle customers but the lady doesn't even have any common courtesy.\n\nSeriously, do yourself a favor and go to San Tung's right across the street!!!", "author": "Monika G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "We ended up in Chang's Kitchen because San Tung was closed for a week.  I was starving and didn't really want to spend time looking for a place.\n\nChang's Kitchen had the BEST Customer Service.  The help staff was attentive, humorous and energetic.  I heard a few tables comment on how great the customer service was, and I agree!\n\nI ended up ordering dishes that I would normally get in San Tung, so maybe for starter that is not a really fair way to rate Chang's Kitchen.  First, their dishes are mostly chili oil based.. which was good for chili oil based dishes or what is known as Szechuan Dishes.\n\nWe ordered the sautéed green beans, dry fried chicken wings, mu shu chicken, and black bean noodle.  At first taste it was really good, but the brain started comparing to the flavors of San Tung..", "author": "Melinda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "This place is delicious! Perfect if you're craving wings. The service is great. Everyone here is super nice. Whenever I'm craving wings this is my go-to place. I love Chang's kitchen", "author": "Carla T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "This DELIVERY was outstanding! Not only was the food delicious (I'll get to that) but it was so fast that it seemed like 15-minutes including the delivery! I should be receiving the food now according to delivery norms, but it was delivered and I'm completely done eating and STUFFED! \n\nLook no further if you're really hungry and the food is great!  I ordered General Tso's Chicken (medium spicy) and it's superb! I have enough for 2 more meals as well! The Pork Potstickers were just like Mom used to make them. Delicious. (OK, I'm not Asian and Mom never made pot stickers, but we have dumplings in the eastern European food cultures too, ya know.) I ate two of those and have leftovers again. I have sipped on the excellent spinach mushroom soup -  flavorful! More for later since I'm stuffed. I placed one of the Shrimp Har Gow in my mouth and those are exceptional. I'm too full to continue!  I have plenty of left-overs. This would easily feed 3 hungry people. To top it off, they threw in 6 pcs of the Deep Fried Crab Rangoon.  YUM! \n\nLOVE THIS PLACE AND WILL ORDER AGAIN!", "author": "Dana J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "So great, lovely and friendly service. Me and my group of 20+ people dropped in last minute and they were so friendly to us. Also I haven't had this quality of genuine food in years.", "author": "Frank N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-09", "description": "Do not order from here! I found a fly in my chow mein at the bottom of my container which I had already ate some of it. This wasn't some house fly it was a huge fly that you can see it's legs and hairs! I've honestly never made a review on something but this was so disgusting that I had to warn people.", "author": "Briana R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Chang's makes reliably delicious dim sum which holds up to delivery! I've actually never been to the location itself, but on weekend mornings my husband and I love to have dim sum delivered. We usually get the xiao long bao, har gao, and char siu bao--not too adventurous but always good, and I'm constantly impressed DoorDash gets us the soup dumplings still hot and usually only 1-2 pop (from an order of 10). One day we'll have to make it there in person!", "author": "Anika K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-29", "description": "Scallop with egg white fried rice is great.  Not greasy at all.  The rice is just right, not too wet or too dry.  The portion is decent, good for two people.  But it doesn't have too much scallop.\n\nSpareribs with special sauce is just so so.  The spareribs were over cooked.  Maybe it sat on too long before going to the table.  The spareribs was warm but not hot.\n\nString beans with special sauce is yummy.  The dish is very fresh.", "author": "Flora Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-03", "description": "Food was okay. However, I specificly said not to ring doorbell and bring the order to the garage downstairs, but they still ring the doorbell and bring the food upstairs.", "author": "Trang Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-22", "description": "Pretty greasy and not much in the way of flavor. \n\nShang hi dumplings were pretty good.", "author": "Evan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "Remarkable. I have been coming to \"Beijing on Irving\" now Changs Kitchen since I was a little boy. Food is always delicious and in my opinion better than what's across the street. The food here is more authentic to San Francisco and is not trendy. Lu, who seems to be everything there is an amazing host and always makes you feel more than welcome. Please come and dine on a foggy San Francisco night or even a nice warm night, you won't be disappointed.", "author": "Jeremiah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Just got a delivery from here and it was delicious. The fried wings were amazing. Will definitely be eating here again", "author": "Sean S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-17", "description": "Wasn't great this time around, and will likely not order again.  This was my second time ordering from here.  While the delivery was quick, so was the prep.  Meh indeed.", "author": "Matt D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-04", "description": "* some delivery apps still call this \"Golden Rice Bowl\"; they really mean Chang's Kitchen *\n\nsweet & sour meat, dumpling soup, fried rice. not memorable but not bad. was thankful to encounter it all laid out on the table when i got home from a not exactly filling $$$ dinner. xie xie!", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "They give you free delivery service & egg fried rice with your meal! \nDecent portion, taste very fresh and clean. If you are craving Chinese food and think to call in for food delivery this is the right place!", "author": "Stella K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-17", "description": "We ordered for delivery twice. First time was almost average. Decided to try them again. (Everyone has an off day) As a Bay Area native, I've been eating Chinese food all my life. (More than 40yrs) \n\nWe ordered pot stickers (unusually soggy), chicken chow mein (C- grade on flavor), orange chicken (C- grade), green onion pancake (C- grade)\n\nWe will not be ordering from here again. Quantity gets them from a 2 star review to a 3 star. \nGood luck if you're going to try this place", "author": "Jonathan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "REVIEWER # 239\n\nChang's Kitchen never seems to fail me! This is my number one Chinese restaurant I go to when I am at work and craving some delicious and fresh food!\n\nChang's Kitchen offers decent prices and fresh food. Every time I have ordered here the food comes out piping hot! \n\nThey are known for their popular and delicious Dry Fried Chicken Wings also known as \"Crack\" because they are too dang good! Chang's offers huge portions of food (big enough to serve 2 people) and fast delivery service (if needed).\n\nThe main food items that I have tried on their menu have been:\n-BBQ Pork Fried Rice\n-Shrimp Chow Main\n-Fried Wonton with pork\n-Steamed Rice\n-General Tso's Chicken\n\nEverything I have ordered has been delicious! I usually always order delivery because parking around the restaurant is not the easiest. When I ordered it usually takes an hour for my order to be delivered (the only bad con of this review is the long delivery service) but who can complain when you're not the one driving. FREE delivery up to a minimum order of $18. \n\nWould I order here again? YES! The food is delicious, portion size is VERY generous and the prices are reasonable!", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-05", "description": "This review is for a won ton soup I picked up. I was really pleased that it was made with fresh vegetables- carrots, cabbage and celery! No canned mushrooms or bamboo shoots like the soup of my youth. The fresh ginger flavor came across in the wontons. Perfect for a cold. I will go back to check out the rest of the menu.", "author": "Susan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "This place= AMAZING! I had a crappy encounter with Ubereats but Chang's managed to come to the rescue and boy was I beyond pleased! :) Seriously, the best Chinese food I have had in a long time, but Jenny (I think that's her name) and her employees were the true cherry on top. Such kind people. \n\nI am a huge fan of family businesses and will absolutely support this place moving forward. Double thumbs up!", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "I came with my dad who is quite a picky eater and we both loved the flavors in the dishes we ordered. I ordered the mildly spicy jajangmyun (beijing black bean paste noodle) and the other dish was a beef rice (can't recall but it had bitter melon in it but I tried the meat which was very tender and savory sweet). It's funny because I usually go across the street to San Tung, which is a very popular restaurant but it was closed so I decided to try this place. I am so happy that I finally came into this restaurant because the flavors were really great! The portion sizes are also very good for the price you pay. Overall, highly recommend and I actually would choose to come here over San Tung (which is really yummy for only a few select dishes but Chang's Kitchen seems to have more consistent yummy variety. I would definitely come back to try more items on the menu.). \n\nPlace is clean, the service was also very nice and mellow. They speak english and chinese. Overall pleasantly surprised and absolutely would come again.", "author": "Angie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "Okay... I've always gone to San Tung growing up. However one day San Tung was closed so I decided to go to Chang's Kitchen and I have not stopped going ever since. The food is utterly delicious... not to mention the prices are pretty good. The 10 piece wings at San Tung is around $13 compared to $10 at Chang's Kitchen. Both of them are equally as good... and I personally feel that the wing sizes are bigger at Chang's Kitchen. \n\nYou NEED to try the Mongolian beef chow mein. The beef is so tender and the noodles are always cooked perfectly. I think it's called the mango fish filet but it's fried and has this sweet and spicy batter and oml it is so delicious. Not to mention that the portion sizes are HUGE. The spicy string bean and pork is also a main staple and is just as delicious.", "author": "Sam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Great place, they always accommodate our order changes, friendly and have lots of vegetarian options.", "author": "J. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Bomb chow mein and great vegetarian options. They're a new go-to for delivery when I'm hungover or feeling lazy.", "author": "Jess M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "This place was second choice today but should've been first alll the food was hella bomb honey shrimp was on point spicy green beans won ton soup every thing was great fast and and good and are waiter was so cool I'm definitely coming back", "author": "Johnny V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-01", "description": "I have some bad news and some good news. Bad news is that there was something funky baked onto the vegetable buns, which I did not notice until after I started eating. Good news is that it looked more like sweater fuzz than human hair.", "author": "Itir S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "This business is a JOKE. After my previous 1 star, I still ordered their chicken wings. The wings are sweet and blah blah blah. Here is the problem: what I can't stand is the stupid delivery guy who clearly is doing the wrong job. If you are in the hospitality business your JOB (the thing you get paid for) is to serve people. Don't expect to get paid more on top of your paycheck. If you aren't making enough, go find a different job or complain to your employer about it. Anyone who justifies tips as being a \"thing\" is feeding the stereotype that I am responsible for the well being of the servers and delivery people. \nI have lived in Asia and Europe and guess what: servers have a good life and we don't tip them. They have houses, cars, and kids and they are able to pay for everything with their jobs because the moment their paycheck doesn't make them happy, they complain about it with their freaking employer, not their paying customer (who btw, are making sure you get to keep your job). \nThis is vent after the delivery guy said that driving 2 miles for 6 minutes is \"far away\" and I should tip him more. Should I also pay for your gas? and maybe calculate the freaking depreciation on your car? This idiot was loud and disruptive. Their food isn't good. I still order it because of the convenience. But after this experience, SCREW this business. If I have to pay to get shitty customer service, I'll keep my money for myself and cook.   \n\n\nHere is a message for the manager and owners of this restaurant: make sure your employees are happy before you send them over to my house.", "author": "Ashish N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-18", "description": "Not bad. I ordered takeout online. The food was ready when I got there. The owner was very friendly. Food was in large portion and tasted fresh. That was what I was expecting.", "author": "Jacky C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Went here for a family lunch and luckily there was seating available. The size of the restaurant is perfect for families and groups. Also, kids! The food was really, really good. We ordered a bunch of food (way too much for lunch, I admit) but everything was really yummy!\n\nI also really liked their service. Everyone was really nice and made sure you left satisfied. I think it's a family owned restaurant (?) \n\nI highly recommend!!", "author": "Patricia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Great service! I would definitely come back. I am giving 4 stars because the wonton soup was bland. If they could touch that up a bit then 5 stars all the way", "author": "Mickey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Great food, great service except they do not have AC. Price is not bad, place is clean. However, dont go unless it is a cool day (we came on a hot day -- excessive heat warning in the area. We are only visiting the NorCal area and noticed all the restaurants on this street have no AC). We ordered 7 dishes and fried rice, everything was excellent.", "author": "Jen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "I ordered online and the food came really quickly and was still hot! The items I got was the dry fried chicken wings, sauteed string beans, chicken fried rice, and the general chicken. The portions were enough for 4-5 people and there were no left overs!! I really enjoyed the food here, I would definitely come again!!", "author": "Yao Chun L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "We will there for my friend graduation lunch to my surprise the food was so good we finished everything on the plate the people were so nice we were a huge group and asking for water napkins sugar soda they always say yes and refill our glasses I highly recommended", "author": "Louie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "I only came here because San tung which is right across the street was closed on a Thursday. I had their dry fried wings and dumplings. The dumplings were decent! I was skeptical of the wings but it wasn't bad!! it was a little too sweet for me and not spicy at all. I wish San tung had been open but chang's is a great alternative. staff is really friendly as well", "author": "Stella C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "The restaurant is very clean and awsome. The food is great. One  of the best Chinese food i ever had. Their  tofu king salmon fillet is super good.", "author": "Xiao H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Amazing food! We ordered the Tofu with Garlic Sauce (Spicy), General Tso's Chicken, and the Spicy Vegetable Chow Fun. We both agreed that the Tofu was the best thing we ordered! It came with carrots and onions, but I asked for broccoli instead of onions. The service was fast, and friendly. Our waiter was also really funny and joked around with us. He constantly refilled our water without us having to ask and checked in with us several times. We will be back!", "author": "Bernie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-19", "description": "It was Sunday around 1 pm and a beautiful sunny day. A few friends and I wanted to grab a bite and the consensus  was Chang's Kitchen. We decided to carpool. Two cars total. We parked about five blocks away and walked. I didn't mind because it was, once again, a beautiful sunny day.\n\nWe had reserved a table and they accommodated our party of 12 as per our reservation. Good stuff. I looked around, it wasn't necessarily packed but it wasn't necessarily empty either. The staff came promptly to take our order. After taking our orders, the staff hung back and stood around surveying the restaurant. The food came fast and hot. Wait a minute... we had ordered rice but where were our rice bowls? \"Excuse me, can we get 12 rice bowls?\" I asked. \"Why do you need rice bowls? Can't you eat rice on your plates?\" was the response. Me and my friends were taken aback. Never have we experienced this at a restaurant before. Never mind. The food is here, we'll eat the rice on our plates to prevent further commotion. \n\nThe day proceeded as we had otherwise planned. Good food, good company. Chicken wings, Ma Po tofu, Mongolian beef, string beans and a couple of other miscellaneous run of the mill Asian dishes. It was good, my hunger was satiated. A few minutes passed by like seconds and it was already time for the check.  We had leftovers. \"Can we get a takeout box?\" It was me who asked once again since i also spoke Cantonese, which the staff of this restaurant spoke. \".....\" No answer. She proceeded to take away our food and our plates, never to be seen again. Once again, our friends and I were dumbfounded. \n\nAt the end of it all, we ate, we paid and we left. Good riddance.", "author": "Wing C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Had a bad experience with a restaurant down the street and came to Chang's Kitchen after leaving and I was so happy to receive great service after what I had just experienced. Everyone is so nice and welcoming the food was amazing they definitely changed my mood around! Thank you Chang's we will be coming back soon!", "author": "Nancy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "I work for a company that has an account with this restaurant n every time im here i always have to get the sweet n sour pork!!!!! It is one of the best dishes as far as sweet n sour go... They keep a clean kitchen as well seeing that i go in the back to do service..staff is friendly atmosphere is calm and the food is delicious..if ur n the area def check them out!!!!!!", "author": "Kyle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Great lunch special prices in the neighborhood and nice portions. Lunch specials come with soup and an egg roll. Their Mongolian beef is pretty good! Same with fish filet & bok choy rice plate (asked to replace corn). Hits the spot when I'm craving comfort food! \n\nBeen to my fair share of Chinese restaurants growing up, and the service and cleanliness of the dining area here is exceptional..everyone is so nice, warm and welcoming. The owner (?), Lou, is super friendly, funny (been cracking jokes since I sat down), and remembers his regulars. Been here 2-3 times for lunch and it's like the Cheers of Chinese restaurants, where Lou knows your name. \n\nTheir lunch menu includes the standard fare of Americanized Chinese food (sesame chicken, general Cho's, broccoli beef, etc.), but they also have some Chinese-style dishes (tomato beef, scrambled eggs with prawns, etc.) Saw some Chinese contractors feasting here for lunch..so I know there are legit authentic dishes I need to try here with my family one day!\n\nThanks, Lou!! I'll be back :)", "author": "Liz L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-20", "description": "Food arrived really quickly. (We have a child so we usually have dinner around 5ish).\nWe ordered the usual.. Mongolian beef : was a little too much add-ons and very little beef, with quite a bit of tendon, Orange chicken : bit too much batter, String beans were okay but the wonton soup was delicious though..can't go wrong with that. \nOverall, back up restaurant if our usual isn't open.", "author": "Dee F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Stopped by here after a visit to the science center. We had the Har Gow, Bao, Sesame Balls, Fried Bananas, and Sesame chicken. \n\nHar Gow: Wow. It was a taste sensation.  It tasted so fresh and was so large. It was just amazingly well done. \n\nBBQ Bao: The dough was soo fluffy and just melted in your mouth. The insides were oh so tasty. \n\nSesame Balls: I didnt get to taste any of these - they (my party) ate them before i got to them but they looked really delicious. \n\nFried Bananas: They are cut sort of like Banana chips but not like banana chucks, that have been deep fried then chocolate sauce is drizzled all over them. The warm fluffy banana just disappears into your mouth and the sweetness of the chocolate brings out the sweetness in the banana. \n\nSesame chicken: It was ok, not much to say.\n\nWe did not make it to Chinatown, but to us it was a great and delicious meal. Especially the dim sum.", "author": "Melody B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "The waiters here are wonderful! I haven't even tried the food yet, but the waiter has been wonderful!", "author": "Danica Dei J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "Long story short, ordered delivery and food came within 20 min. Found no beef in my chow fun, and barely any seafood in my other order. Called back and they said they would deliver the beef to me but took 45 min. Food didn't taste that good either. Wish I had more hands to give them 4 thumbs down.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-02", "description": "Came here cause the wait at San Tung across the street was just too long, even after arriving just 20 minutes after San Tung had just opened. \n\nThe owners and workers in the restaurant were all very gracious and friendly. While I really want to give a higher review, the food wasn't to die for.\n\nMy friend and I both agreed it really hit the spot for our Chinese food craving because it's truly authentic. It also came out extremely fast, which was a miracle for our hungry souls. \n\nWe ordered the chicken curry, string beans with fried tofu, and combination chow fun. The fried tofu was mouthwatering, but the string beans could've been cooked a bit longer. The chow fun didn't have as much protein as we would've liked, but it was good nonetheless. The portions were large, and it's definitely a good spot for some real Chinese food.\n\nOh also, the fortune cookie's fortune that I received after the meal was scarily accurate in relation to me! Found that pretty interesting", "author": "Lillian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "20 minutes for delivery when ordered on a Saturday at 6:15 pm?! I don't really need much more than that! But...the food is always good and hot!", "author": "Austin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-19", "description": "Ordered takeout and received the order with no utensils or chopsticks. Very frustrating.", "author": "Rotem N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Chang's kitchen has great vegetarian dishes, rice, and spring rolls. It's hard to find restaurants like Changs' that understands how to cook the meatless al dente. We dig it. ;-)", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "Super nice owners and i finally tried their dry fried wings like san tungs and i have to say I AM STILL THINKING about them! They are way better than San Tung's! \n\nCRACK WINGS at CHANG's KITCHEN!\n\nCheaper, juicery and definitely more flavorful with less sauce.\n\nLOVE!\n\nI WANT MORE :)", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "This restaurant definitely need more reviews! Their spicy chicken wing is amazing, and they offer lots of delicious looking and tasting food! \n\nThe service is good too, followed by quick serving time.", "author": "Aria R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "Fast delivery. We ordered 4 lunch plates for less then 40$!! Generous amounts of rice and meat. :)", "author": "Cameron A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "Not gonna lie, we were originally going to San Tung but it was closed so we looked across the street and ended up here. Boy am I glad we stopped by! \n\nCame here on a Wednesday afternoon around 2pm Not too crowded - our party of 5 was seated right away which pleased my grandparents. Food came out very quickly, portions were generous, and the service was amazing -- our waiter was extremely gracious and attentive, and even set down dishes and teapots gently, a rarity in Chinese restaurants. \n\nDry Fried Chicken Wing: ABSOLUTELY DELICIOUS!!! Not the typical kind of thing we order from a Chinese restaurant, but they were hot, crispy and sweet on the outside, and savory on the inside. Wings were meaty, not those dainty bony wings that make you feel ripped off. Comes with a side of steamed broccoli to make you feel better about yourself for eating fried chicken. Yummy yummy definitely would order again\n\nHouse Special Chow Mein: flavorful and hot. Just a tad on the oily side but that just means you get to slurp the noodles more easily\n\nShanghai Styled Rice Cake: honestly pretty same flavor as the house special chow mein, but with rice cake. Also delicious and chewy and hot, with a bit too much oil for my taste. \n\nMinus one star for the MSG headache afterwards. I'd definitely come by again if I was in the neighborhood and itching for more chicken wings.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "Found this restaurant four stars in yelp. Food I rate four stars & services is five plus. It is very busy on Tuesday night(lots to go order). With only two people working, we still get very good services.  The lamb is very good! The pictures taken after we eaten half. Reason price & good services.", "author": "Linda T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-11", "description": "This place is an adequate chinese delivery place for those nights when you don't want to cook and cheap chinese food would really hit the spot.  We enjoy standards such as chow mein, honey walnut prawn and sautéed broccoli.  I would not hesitate to recommend this place to friends - and I have!", "author": "lucy w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "For several years my family and I have been eating and ordering take out at Chang's since it was named Golden Rice Bowl.  Lu is AWESOME, he is so friendly and accommodating every time we come in.  Most of our orders are usually for catering and we love the chicken and veggie chow mein.  We have tried most of the dishes and they are all very tasty and the quality is consistent. Great neighborhood gem!", "author": "Prof. X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Chang's kitchen is hands down my favorite place to order food from. Here's why:\n\n-food is absolutely delicious\n-great portion sizes\n-super cheap, I get two meals for $22 (and that's including delivery/tax) \n-friendly staff\n-DELIVERY TIME IS ALWAYS UNDER 30 MIN. I thought the first few times were a fluke, but now I've ordered over 10 times and realize they are just incredibly efficient - even when ordering for big groups\n\n10/10 best Chang for your buck", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-02", "description": "Food wasn't great. Egg rolls, siu mai, and pork buns were inedible and disgusting. I spit them out. Crab rangoon, potstickers and fried shrimp appetizers were decent. String beans with tofu and walnut tofu were both bland and weird. General Tsos meatless chicken was OK. No pot sticker sauce or sweet & sour sauce was provided for the appetizers, rendering them even more inedible. Won't be ordering from here again.", "author": "Josh P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-18", "description": "Delivery driver asked aggressively for his tip. Like, held my food hostage until I forked it over level aggressive. Then I came to find that the extra sweet and sour sauce I had asked for twice was not included. No sweet and sour sauce at all. Cool.", "author": "Christianna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "This has just become one of my probably favorite places to go to. The food is delicious and the service is amazing! So glad I went here with my family--it was a such a great experience!", "author": "Katie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-16", "description": "Disappointment city man. Why all the great reviews?\n\nI just ordered and got three soggy spring rolls, bland chow fun, and weird chicken and bland kung pao. i'm SO not impressed. i'll probably wind up throwing the rest of it (more than half) away. The person on the phone and the delivery guy were nice at least.\n\nwhat happened to all of the decent affordable chinese delivery in SF?\n\ni miss ha's so so much. (so much)\n\nchang's leaving my phone's contact list almost as fast as it went in. \nsave your money, go/order elsewhere, or like bland and soggy food. \ndisappointed.", "author": "Wendy X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "We came here after stopping by San Tung only to find out they were closed. The beef chow mein and General Tso's chicken are fireee and the owner is super friendly as well! Definitely recommend if you are in the area", "author": "Mohamed A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-28", "description": "Good food and big menu. Take out orders are ready quickly. But they charged $2 to add three smaller pieces of broccoli to my Mongolian Beef order.", "author": "Justin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-04", "description": "Honestly the food was average but the owners and servers make up for it. They are super nice and sweet. Chowmein was good.", "author": "Megna S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-06", "description": "The food is really bad. I ordered several things. The meatless chicken was probably the worst veggie meat dish I've ever had. So many SF places get this one right, but this place isn't one of them.  It was salty, tasteless, rubbery and just plain weird and in no way resembled chicken. The shrimp chow mein was soggy and had two pieces of shrimp. The string beans were oily and overcooked. Btw, everything was oily, but I would've looked past it if it was tasty. The walnut shrimp were alright, but way too much batter, and not ok enough to make up for how bad everything else was. The plain rice was what it's supposed to be and the delivery was fast. Yay. $50 worth of 1-star food. I threw everything away with the exception of walnut shrimp and plain rice. Sorry, but these guys don't live up to their current 4-star rating. :( Life is too short to be eating this stuff.", "author": "Tatyana V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Just all around good food here. We ordered for delivery over the weekend and service was fast, the delivery guy was super polite and the food was the bomb. We ordered Mongolian Beef, Honey Walnut Prawns, Sweet & Sour chicken and the Spicy Garlic mushroom fried rice. They have an awesome special that if you order more then $#0 - you can choose from a few free items. We got the vegetable chow mein. \n\nYUM.", "author": "Cat G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Was on my way to San Tungs but found this place across the street after I found out San Tungs closes on Wednesday. Was the best find on Irving. The owners are the sweetest people ever. I only ever get their chicken wings and they are yummy to say the least. \n\nCame here for my birthday dinner and ordered a party platter of 100 wings for 13 people Tip: Nobody needs a 100 wings, I recommend getting the M or L party platter instead.", "author": "Laureano F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "So I wanted to go to a Chinese restaurant in the Sunset area, and San Tung was on the list as a 4 star place and I was like oooh I wanna go there! :O But as we parked, paid for the 30 minute parking( after 6pm is free), we found out that they were on vacation. NOOO. SOB. How could they be on vacation? :(\n\nSo we walked across the street to Chang's Kitchen and we read the reviews there as well. It didn't seem too bad and decent enough and so we gave it a try. We came in and got a table for 4 and saw that most of their orders were for pick up, rather than for in store. It does have a lot of housing around, so I can see them just picking up and going home to the family for dinner.\n\nSat down, got wonton strips with sweet and sour sauce, which I liked haha. The reviews said to get the chicken wings, and indeed we did. Chicken wings were good. Like the sauce around was excellent. It was a tad spicy and was sweet and had a lot of sauce. Finger lickin' good. The inside was moist, rather than dry, so that was good as well.\n\nThe rice ovalets- not enough sauce. Wayyyy too little sauce. They had longer elongated rice ovalets and had mushrooms, carrrots, and cabbage with some pork. It was \"healthy\" it seemed, I guess but just not enough sauce.\n\nGarlic beef- This one was really good. Had good sauce, had peas (yay vegetables) and would have gone great if we had bowls of rice( they offered, we declined).\n\nFood comes out reasonably quickly, service was good, as they can speak both Canto and English. At night, you can watch them prepping for the next day, as they were peeling pea ends on a table in the back. \n\nIf San Tung is busy, give Chang's a try! I haven't had S.T. yet so I can't compare them together yet :(", "author": "Raymond L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-22", "description": "First, my son said if he can rate this a zero he would. This is by far the worst customer service and food he has ever experienced. He was pressed to add a second tip. The lady stood by my son and did not move until he tipped her. I just wish I was there...this is crazy how this grown as lady stood asking for a tip. He food was cold...nasty and questionable. He threw away his food.   Stop begging for a tip..pressuring kids to tip and serving nasty as food. Run Forest Run..do not go to this nasty infested place. You suck!!!!", "author": "Lou R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-28", "description": "We were disappointed and found the food very bland.  We ordered chicken with green beans, beef chow fun and Korean spare ribs. The ingredients seemed good, with a nice variety of vegetables in each dish, yet they were all strangely tasteless. Given all the 5 star reviews, this restaurant seems to have found a niche, but it's not for me.", "author": "Kathleen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-15", "description": "Super fast delivery. Ordered on Sunday, July 5th a little before 7pm. Our ordered arrived a bit over 35 mins later. Placed our dinner order through delivery dot com as we had a $5 credit.\n\n*Dry fried chicken wings ($9.75): hot and spicy\nLately I've been disappointed with San Tung's chicken wings as they've been sweet and not much else. Where's the spice?! These actually hit the spot! A great combination of garlicky spice with a hint of sweetness.\n\n*Sauteed string beans ($8.25): hot and spicy\nNot really as spicy as I wanted. I like a little heat to counteract the pickle and sweetness.\n\n*Shanghai steamed dumpling ($7.50): 10\nYum! Still arrived soupy. The wrapper had a great texture while the filing was nice and meaty.\n\n*Fresh basil chicken ($8.95): hot and spicy\nThe roommate ordered this one. It was like an oily mess! I almost wanted to call it an affront to Chinese food! The only redeeming thing was it had some spice.\n\n*Bbq pork fried rice ($6.95): no carrots\nThe best fried rice I've had in a while! The rice was the perfect texture. And a great savoriness from the bbq pork.\n\n*Wonton soup ($4.95 small)\nStandard wonton soup. The wonton wrappers were a little too thick for my liking, but the soup had subtle flavor.\n\nOut of what we ordered, the Chang's Kitchen solid dishes were the wings, XLB and fried rice. The rest of the dishes were just average with the basil chicken being a definite miss! Next time I'm craving soup dumplings and crack wings, I'm glad I have an option that delivers for free!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-20", "description": "Food isn't that good and way too much rice 80% rice 20% chicken delivery took 1.5 hours and I live 10 blocks away. Driver was kinda rude (and other comments say they demanded tips) I gave a couple dollars so I had no issue with that. The sweet and sour sauce I asked for weren't there (saw someone else say that too) won't be ordering from them again waste of time and money", "author": "Felisha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "Came here,  naturally because sang tung was closed. No one else was here,  so was a bit skeptical. \n\nWe ordered the spring rolls to start.  They were very delicious.  They also brought us Jasmine tea which was very good. \n\nFor dinner we got the kung pao chicken and the chow mein. The kung pao was not bad,  a little greasy but pretty good. The chow mein however was AMAZING.  Probably the best I've ever had. You should give this place a chance.  I would say they're as good as across the street.", "author": "Arman J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "their spicy beef noodle is very good, with generous portion of beef covered with chili oil.  The service was very good too.", "author": "Haoran C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-12", "description": "Came by after finding Yummy Yummy had a line at 8PM on a Sunday. Didn't bother with San Tung because they use too much sugar in place of MSG. Yummy Yummy food does that too in the last few years to compete I suppose and it was the reason why we didn't go back, but tonight we just wanted to see if things changed. I've seen Chang's open up across the street, but never bothered with it. Tonight, we decided to look at the menu and we have them a shot.\n\nPlace was fairly clean and hardly decorated. The staff were nice and we were seated immediately in a mostly empty dining room. We ordered a few things, here's how it went:\n\nChicken Corn Soup. Basic and decent, but too much starch. It was almost on the brink of ruining the soup. Flavor was there. They need to refine this.\n\nBuddha's Delight. Tofu cubes tossed with rice noodles, mushrooms, celery, black fungus and snow peas was good. I've seen better presentation, but it tasted about as good as the one I had with the more interesting presentation, so it doesn't matter. I would order this again.\n\nHouse Special Fried Rice. Decided to get this instead of buying white rice by the bowls. It had shrimp, chicken and pork bits. It was good and that's not a bad rating on the dish. It means I would order it again. It didn't blow me away and it didn't disappoint me.\n\nGeneral Tso's Chicken. This... Wonderfully prepared! Not too sweet, not too salty, not drenched in sauce, but could be more spicy for Asian customers. Nice sized chunks of chicken in a wonderful crunchy fried batter. Excellent. I would surely come back just for this.\n\nThis restaurant was stumbled upon among stiff competition on the block. As everyone else will stand in line for those diabeetus restaurants, I'll happily walk past them all and get seated easily in this overshadowed gem. Recommended.", "author": "Bor C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-17", "description": "The food is swimming in oil. I ordered the Twice Cooked Pork and it was 60% oil, 20% cabbage and 20% pork. Also ordered a meatless option of Kung Pao and it's not wheat meat (vegetarian option that tastes like chicken) but tofu instead (it tasted good though!)\n\nAlso, the guy that delivered yelled (yes, he literally shouted at me) regarding the tip and how I should be more generous.\n\nProbably will not order from here again.", "author": "Aditi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "The taste was ok the egg rice was skimpy on the egg and vegetables the general's chicken was too sweet & too much sauce not enough vegetables. Sorry!", "author": "Rosemarie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-18", "description": "Bland food and too oily...even for Chinese food. \nWe ordered cashew chicken,  it had a strong taste of garlic. Mongolian beef was in a lot of chili oil, and the chow mein had no taste\nThe dry chicken wings were good", "author": "Orlaigh C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "Good times at Chang's!!!\n\nIt was lunchtime and I needed something to eat. I wanted some Chinese food and this place came to mind. I saw that they have online ordering so I went on ahead to the website to place the order. The menu is GREAT! The food here looks really good. I went straight to the lunch menu to begin looking for what I wanted. The lunch menu is well priced and they offer a LOT of stuff to choose from. I was tempted to grab something from the Chef's Special but instead I went on ahead with the Mongolian chicken, a very wise choice.\n\nShortly after I placed the order I headed on over. It took roughly 15 minutes to get over to the restaurant. I found parking across the street which was perfect!!! I walked over after I parked and took a moment to look at the menu in the window, WOW! All the pictures made me hungry. This place has some really GOOD food. I thought about getting something else to add to my lunch but I chose to just get my food. \n\nI went inside and saw that this place was not busy yet. I thought noon time would mean lots of customers but it looked like I had gotten here before the rush! I went on up to the counter and told them the greeter that I was picking up an order. To my surprise my food was ready and waiting for me. This was surprising because the confirmation email that I received told me that my food would be ready in 45 minutes! It pays to get here early. I talked with one of the gentleman that works here, he may be the owner but I am not sure! I told him that I typically go to San Tung and he laughed and said, \"Oh no, you should come here from now on\". He is a funny guy! After I paid for my food I headed to my ride and booked towards my house. After making a few more stops I finally made it home.\n\nI laid out my food and opened the box. Cool, the food smelled good and I was excessively hungry. The meal, exquisite in every way imaginable! Great blend of spices and peppers which created a dynamic taste for this meal. I should have asked for more soy sauce though but I was able to manage with one packet. \n\nCHECK THIS PLACE OUT! There is plenty of seating here if you decide to come with a large party as well. Or just order online and get some take out. \n\n#kitcheninthename #cookingistheirgame #hotplate #can'twait", "author": "Robert F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "Just ordered for the first time, what a great find!  Spot on delivery time based on estimated arrival of 8:11pm \nOrder:\n*Beef & Black Bean Chow Fun - the picture looked overly sauced so I added \"light sauce please\" to the notes. They listened...maybe too well. Good smoky, funky black bean taste, plenty of meat, a few fresh veggies for good measure but touch more sauce needed. Next time I'll just take it as they see fit. \n*Yang Chow Fried Rice - Shrimp! Several plump, juicy shrimp! Nice light stir fry, not greasy with a good variety of veg, chicken and SHRIMP!\n*Salt & Pepper Chicken Wings - fat little drums & flats. Crispy despite being in a box or delivery. Don't overlook the garlicky jalapeño cabbage hiding at the bottom of said box. Mighty tasty on the fried rice. (The menu says 6 pieces, we got 8)\n*Chinese Broccoli with Oyster Sauce - a lot of crisp cooked tasty greens. Again asked for light sauce, perfect for this\n*Bonus FREE Egg Fried Rice - didn't try yet, still loving on those plump little shrimp. I'm sure it'll be great with a fried egg tomorrow.  \nOh, and the nice delivery guy...great smile!\nWill definitely order again.", "author": "Us And J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-20", "description": "If I could I would give zero stars . Ordered they eats24 order got there and driver try to charge me again even tho I had paid\nOnline already . Than demanded a tip with a min of $5 hmmm no you can't not demand a tip. Got here late. And he was just plain rude.", "author": "Yolanda J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "I wish I could give Chang's five stars, but I have some reservations that I cannot readily access in my memory. I really enjoy most of their food, and I am particularly fond of the dry fried chicken wings, (as are most patrons.) The mushu is not seasoned enough, but the salt and pepper pork chops are tasty and tender.  Love them.  The twice cooked pork, the fried fish with any sauce is lovely, and the spicy wontons are fun. Considering that it can be SO difficult to  eat at, or even order from San Tung, or San Tung 2, Chang's is a wonderful option.  Oh, and guess what....they deliver!\nMore power to them.", "author": "janice s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "On our way driving from LA back home to Vancouver, BC, we decided we would take a detour and go to San Francisco. We heard about the fabulous wings at San Tung and decided it was worth the detour. Unfortunately, we didn't think to check if they were open or not... we saw a sign on the door saying that they were closed for a couple weeks for a vacation. Oh man!! Were we ever disappointed! At this point we were hungry and willing to go anywhere, so we went across the street just to get anything in our systems.\n\nWe were greeted promptly and seated by a friendly server. I decided to order the black pepper steak short ribs and the dry fried wings. I was determined to get wings, even if I couldn't have San Tung's! The black pepper short ribs were great. I've had much more tender short ribs back home but these were tasty and it was a good portion for the price. The wings though, they were fantastic! They were perfectly sweet, without being too sweet, and were moist! Yum! \n\nWe were pleasantly surprised and left happy and full. Highly recommend their wings!", "author": "Ashley Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-21", "description": "Honestly, this place could be a lot better. I tried their 'chicken' chow mien, which wow.. wasn't chicken. the meat flaked like fish and tastes like fish. I went to them to show them and while not listening to me they said it is chicken and just sent me on my way. \n\nNow assuming this is fish chow mien, this chow mien itself is so bland, there is no flavor except salt and chili spice. \n\nThis place is really low end, and low quality. You will get food (good quantity), but the quality is really low", "author": "Parth K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-12", "description": "Well ok... I typically don't leave reviews unless something was stellar or absolutely horrendous. Unfortunately, this is the latter.\n\nWhere to start...\n\nCame home hungry as ****, so ready to feast on some good Chinese food (cheat day lol). Well, they got my order wrong. Or rather, the free crab rangoons I got via coupon, they replaced with a veggie chow mein... without notice? Ok, fine. I got more food than I ordered (albeit, bland, plain chunk of empty carbs). Well, GT was hard, no meat inside, even the sauce was not enough to get it soggy lol... next up, salt/pepper pork... who just batters and fries pork with all the bones?!?! I almost cried accidentally chewing on my first bite so hard that my teeth were agonizing and my tongue in utter shock from the bone that poked it. Mongolian beef... well... I'll just call it soy-sauced runny beef. lol I got GT and MB because they were highly \"recommended\" by everyone... I am starting to lose faith in those that apparently call themselves \"foodies\".\n\nMy cheat day is ruined, and I just could not eat the whole thing anymore. I threw out all of them after the painful meal. I never throw food out and eat them all because that's how I grew up (\"you have to finish your food or God will make you eat all of them in hell\"). But this... I just can't. This I won't eat in hell either.\n\nI'm already having digestion problems from eating something against my will + all the grease that's slowing it down.\n\nWhat a waste of money. I am so pissed. I worked my butt all week waiting for a cheat day, and it got ruined. Should've just got kalua pork, donkatsu or donburi elsewhere like I usually do.", "author": "Eryn K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-04", "description": "DO NOT EAT HERE! I ordered from this restaurant, I got the general tso chicken, the pork buns, and some chow mein. I've had severe food poisoning for the past 4 days. I have never felt more sick than I have after eating this meal.", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "I know San Tung across the street gets all the hype, but this place is great too! I haven't done a side-by-side comparison of the wings yet but who goes to a Chinese restaurant and just gets wings?! I tried Chang's Mongolian Beef chow mein, Shanghai dumplings and few other dishes and everything was quick and delicious. The staff were a bit disorganized but friendly and attentive. Most importantly, unlike so many Chinese restaurants in Chinatown the meat in their dishes is sketchy or gritty, fresh and tender the way its supposed to be.", "author": "Gabriella M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-09", "description": "Went here on Labor Day because the line at SanTung 2 was too long. One of the ST2 waitresses shouted into the crowd, \"I've heard Chang's has good wings too.\" We trusted her. We shouldn't have. \n\nThe food all sort of tasted the same, and was overly greasy and sweet. The wings were not even close to the ones at SanTung... They weren't terrible, but definitely weren't comparable either. \n\nThe redeeming quality here was that the service was very friendly and good. SanTung often feels like a \"high pressure\" dining situation due to the crowds. If you just want some sweet Chinese food in a calm atmosphere, Chang's would be right up your alley.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-06", "description": "What??? A place that makes dry fried chicken wings just like San tung?? I'm sold!!! \n\nParking - tough....I'll tell ya! I know it's a busy street but I had to circle around the block a couple times even though it was noon!! Keep your eyes peeled at all times for a spot or else someone behind you could swoop it from right under ya! \n\nService - great!!! The staff is all very nice and friendly. Especially the older waiter! I didn't catch his name but he really is sweet and does everything with a smile.\n\nFood - surprisingly delicious! I got the dry fried chicken wings lunch special and it comes with 7 wings, a scoop of white rice, vegetable egg roll, a side of small broccoli, and soup. Portion size was really generous...especially with the price being so cheap too! I gotta say that the wings are really good...nice crisp to them and glazed with just the right amount of sweetness. \n\n...I definitely will be back!", "author": "Coco L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "Ordered from Eat24 one night after a lazy weekend. Got the orange chicken, sizzling prawn platter, fried rice, and kung pao shrimp, and every dish was inedible. The dishes with shrimp were funky, all the dishes were dripping in grease, and the orange chicken was soggy, despite coming fairly quickly. \n\nNever again.", "author": "Tom F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "This place is awesome cause there is no wait like at San Tung and the food is just as good. We had the salt and pepper wings, won ton and chili cause and a fried rice. Everything came out hot and fresh and the cost was very reasonable. Honestly I came here only because So was closed and Sang Tung had a huge wait, but I was pleasantly surprised and this place blew away my expectations. I will definitely come here again on my own.", "author": "Joshua Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-23", "description": "I used Chang's Kitchen to cater for an event at school and was glad I chose them! Their prices are pretty decent and the food is great quality! For a group of about 35 ppl we ordered a large fried rice, large sweet and sour kitchen and a medium eggplant dish. Everything came out to about $170! My order was a little short notice but they were able to get it ready for the next day, and now that I think about it, it was Valentine's Day! Very impressive! Everyone was really impressed by the food! The service was great! The employees were very accommodating and greeted me so warmly when I walked into pick up the food. They even helped me carry it all out! I would definitely order from here again!", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "This is my go-to spot for good Chinese delivery. The food is always good and the vegetables are always fresh and crunchy just as I like them, never over cooked or greasy. Hope they keep up the good work!", "author": "Stella D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-01", "description": "Good lunch, we enjoyed the kung poa lunch and sesame chicken lunch. We added a chow fun chicken noodles.  We were served in 10min", "author": "Jose S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-22", "description": "I ordered the General Tso's Chicken. The portion size was great and had zucchini and bell peppers in it which was a different touch. The breading on the chicken wasn't too heavy, and the sauce was perfectly spicy. The Deep Fried Crab Rangoon was also delicious and perfect for sharing. Loved those two items!\n\nHowever, I was deeply disappointed with the Green Onion Pancakes. These are by far the worst I have ever had. They claim they are homemade, but when I took a bite...the pancake was hard as a rock and VERY stale. These were either way overcooked, or a couple days old. Either way, they were impossible to eat. I tried to bend one and it snapped in half like a burnt cookie! I am shocked they would serve food in this condition. It was horrible.\n\nSince this order was for takeout, I was expecting some takeout utensils but there were none. No napkins, forks, or chopsticks. Just a couple packets of soy sauce. \n\nI really wanted to like this place because I needed a new Chinese takeout spot. But was extremely let down from the Green Onion Pancakes. It also would have helped to have some utensils since this order was to go. I'll give this place another try since I liked most of their food. Hopefully the Green Onion Pancakes will be fresh next time.", "author": "Chisholm T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-18", "description": "This place that I would thought it's good but came out that wasnt so good because I order one of the soups that got my friend really sick, in the soup was way too oily and some of the meat wasn't fully cook all the way, and you guy claim it's fresh everyday? And completely fully cook? \nAlso I order the tai chow fun, it's doesn't have any flavor, I'm basically eating the food raw like it's didn't even cook at all!\nWhat a lie, I will never order from this place again\n \nIf you guy still want continue to have good business, you guy should of change or improve the food better, other wise I recommend you guy should stop the business because you guy doesn't even care to give good customer service!", "author": "Conny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Nice family style cooking. Just right for everyday dining. I live nearby and this has been my regular diner whenever I'm rushed in time. The food is cooked just right, seems much care in preparation. Good food, right price, best neighborhood dining.", "author": "Bill C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-23", "description": "Super duper fast delivery. (Admittedly, I live 3 blocks away.) I've also had good pickup experiences but I've never dined in here. It's basic American(ized) Chinese food. Tasty, never had a dish I didn't enjoy. Fair prices and good portions. It's not gourmet or avant garde. There's really not a whole lot to say, except that if you know what you're in for, you will almost assuredly be happy when you're done eating.  After downing all that salt and fat, you're gonna  feel like you can take on the world!", "author": "Jason G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "I came to the area for a different restaurant and ended up coming to this place instead. Great authentic Cantonese cuisine. This is not just coming from me, but my mother---who is the pickiest critic when it comes to authentic Chinese food. Loved the house special beef chow fun! We will be coming back again!", "author": "Scoot G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "This is becoming my favorite delivery place as far as good Chinese food. This place is just across the street from the overcrowded San Tung but Changs Kitchen does delivery and San Tung doesn't . Changs Kitchen dry chicken wings are fantastic. The Hunan chicken & prawns are yummy. When it rains Changs Kitchen delivers delicious food.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "I love Chinese food but unfortunately I don't exercise enough to burnout the carbs of these delectable dishes. So, when I rarely go for Chinese food it better be darn good and worth every bite! I ordered takeout since I had a large family to feed from the fire evacuations. The food arrived at a decent acceptable time, quicker than I was told. All the dishes were packaged in reusable plastic containers, which I loved because no leakages of sauce everywhere and they even placed reinforced plastic bags  over heavily sauced dishes. The food was fresh, seasoned well (not salty), tasty, hot, delicious and cooked with the exact amount of spiciness since some guest prefer mildly spicy. All 10 dishes were accounted for, I hate when a dish is missing! Chang's is definitely on my \"bookmarked list\" for Chinese food.", "author": "Maxie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-16", "description": "Quite befuddled at the high reviews on this page: my experience at Chang's was quite disappointing. Like everyone else, I went here when San Tung was closed. It appears that in some ways, this is San Tung's grandson or younger cousin - when it really just lacks anything close. Of course, if you're looking for cheap Chinese, I suppose this could work. However...\n\n...the food is absolutely disappointing. The lunch special is your traditional Chinese restaurant lunch special - hot-and-sour soup, rice, your entree, and a fortune cookie. I got the Kung Pao Prawns, and counted five prawns on a massive dish. To make matters worse, the \"Kung Pao\" sauce was just slathered on hot sauce that was numbing spicy, and the vegetables were hardly cooked down (the celery and bell peppers all had a raw, bitter snap to them - a sign that they had barely been cooked). Additionally, the celery (who puts celery in Kung Pao dishes) was cu way too big, making it difficult to eat.\n\nSimilarly, a friend ordered the chicken wings, which are theoretically like San Tung's. Uh, I guess? They're sweet, and a tad spicy, but nowhere near ST. (Again, cheap Chinese, sure, authentic or similar to ST, no). The dish came with two measly pieces of raw broccoli which appeared more like decoration - if it should be decoration, at least make it edible. The broccoli was not cleaned nor had its leaves removed. Quite disgusting, to say the least.\n\nNot to mention, the waiter forgot the soup. And the fortune cookie. And the spacing of our dishes was awful - I received my dish immediately after ordering, and fifteen minutes later, as I finished, my friend received his.\n\nThe service is sweet - the waiters are attentive, albeit a bit clumsy (I never received a menu and had to ask for one multiple times). However, good service doesn't make up for clumsy food. If ST closes, go next door - unless you truly are craving some really cheap Chinese eats. But don't compare it to San Tung.", "author": "Bobby W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "This is the first time that I ate lunch at this place. The dry fried chicken and the salmon chow fun are great dishes and the appetizer deep fried card Rangoon also good to try! I highly recommended this place and hopefully to visit again for lunch!", "author": "Minnie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "This place was super fast delivery, I live close but it was still awesome. Good food too, I got the chow mein and spring rolls.", "author": "B G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Chang's is my favorite takeout spot in SF! Was so stoked to find they deliver to my new neighborhood when I moved from the upper haight to the outer sunset. Deliveries always arrive earlier than anticipated and the drivers and staff are great. I once accidentally input my old delivery address, and even when I offered to come pickup, they delivered to me before the original estimated delivery time. AND the food was still hot and delicious! Top notch service AND the best Chinese food I've found here. 10/10! I lovvvvvvve the honey walnut prawns and the orange chicken. General Tso's is as good as they come and the orange chicken is even better. Also they have a huge fried rice selection that I've explored fully - all very good. Definitely spring for the rangoons!", "author": "Phylicia H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-02", "description": "We ate lunch here a few times prior and the last time the shrimp appeared undercooked and we had a reaction. This time the shrimp/beef was questionable again-choose not to eat it. Simply oily and bland/favorless dish dinner tonight- left a 1/3 of the dishes un-eaten and did not take a box...moving on.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "Amazing lunch at Chang's Kitchen today!  We hand the Dry Fried Wings and General Tsao's Chicken which were both incredible.  Great spicy flavor and huge portions.  We had a great time with our waiter who was extremely friendly and accommodating. Highly recommended!!", "author": "Jim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "So delicious! Might be the best I've had! Szechuan dinner for 2 with my fiance was amazing. Very fresh ingredients, not too greasy, and perfect spice. Staff was extremely friendly and prompt. Highly recommend the Mongolian beef. Definitely check this place out! It was worth the 12 minute walk from golden gate park", "author": "Masahiko W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "This place is amazing.  The service is great and the food spectacular.  Way better then San tung", "author": "Mariel J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "Delivery came 15 minutes earlier than the expected arrival time and fed our group of 6 for dinner (2 of whom were out-voted for our ultimate decision to go with Chinese). The Dry Fried Chicken was definitely the highlight that won everyone over. Everything was perfectly fine: Chow Mein, Mu Shu Pork, Orange Chicken, Broccoli Beef, Deep Fried Crab Rangoon. The only reason I wouldn't give this 5 stars is the competition is fierce for Chinese in the area and nothing really blew our minds. But for our relatively conventional order they gave us exactly what we expected.", "author": "Greg C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "Awesome Chinese food with big portions. Try the fried rice and spicy thin noodles. This is my go to for delivery.", "author": "Cynthia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-12", "description": "Thought this place was okay for the price and food. Ordered the lunch special fried rice with sesame chicken. It was pretty tasty but I found a good half and egg worth of egg shell. In my friend rice. How the hell did they happen? \n\nI would do a good double check before eating here. Food is pretty good, but they have their food quality check has to be better.", "author": "Enoch T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-19", "description": "YUM! YUM! YUM!  This is our regular go to for delivery.  Great phone service, great portions, efficient delivery!  Great kung paos, mongolian, dim sum, mu shee.  You will not be disappointed.  This reaction was to the food we ordered from there last month.  \n\nIt is sad but the food we ordered tonight was the worse Chinese food I have ever had.  The lemon chicken was old brown and tough.  The kung pao chicken was flavorles and had an odd slimy texture.  The peanuts were stale.  People now days do not know how too make a good kung pao or a good mongolian any longe.  In the meantime I will never order from Chang's again.  If they cannot control their quality, then they do not desere to stay in business.  \n\nIt gives current cooks a bad name.", "author": "Emilia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "My friend and I came here after seeing the crazy long line for San Tung and we definitely weren't disappointed! As is most Chinese food, it was rock solid (aka pretty damn tasty). We ordered the Kung Pao Chicken and Beef Chow Fun and it was good. I highly recommend the Beef Chow Fun!", "author": "Annette N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Our family's fave Chinese restaurant. Best food! Our regular server Lou is very nice and funny and the owner is nice too. Great lunch specials.", "author": "Gigi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Skip the wait across the street, why wait when they're all the same food? \nFour of us ordered crab rangoon, pork fried rice, dry fried chicken wings, boychoy with garlic sauce, and a variety of dim sum. Food was not too oily or salty which is a must for me when I go to Chinese restaurants. \nFood came out quick and service was great, would definitely come back or even get them delivered to me!", "author": "Sean W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "This is my favorite Chinese restaurant of all time.  We have been to San Francisco four times, and have made time to come eat here every time. \n\nWe always order the General Tso's Chicken, which is garlicky and crispy, and the best!  \n\nWe also love the Mongolian Chicken.  Love the onions and heat from the chicken.  Delicious!\n\nThe food comes very quickly and service is friendly.  \n\nIf I had to choose something to nitpick about, it would be that you have to order rice - it doesn't come with.  \n\nOther than that, this is a must eat every time!", "author": "S.Y. K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Food was great. Wasn't super salty like some other places. Also was very pleased with the service that I received.", "author": "Yi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "The food was very tasty and the best I have had in a while.  We had the food delivered and the wait time was reasonable.  I will order again from this restaurant.", "author": "Ramona M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "Wanted chicken wings and San Tung is closed? Well, you're in luck because this place has similar chicken wings and taste as good + no line! HOLLA! My friends and I wanted to go to San Tung one day but unfortunately they close on Wednesday's....bummer but anyways, I've been to Chang's before and they are as good as San Tung. The waiters are actually much nicer since they actually check up on you to see if you're enjoying your meal which is definitely a plus for me. It was a party of three for us and we ordered bunch of different foods. We had the salted fish fried rice, chow mein, chicken wings, and some veggies. All very good and tasty. Salted fish and the chicken wings are my favorite. Salted fish fried rice is a bit salty but the rice balances it out. The chicken wings were hot and spicy but very flavorful. I'm not sure why people are giving it bad ratings but honestly, I had a good experience and I'll definitely be back again soon!", "author": "Monica W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-07", "description": "I received junk mail from this establishment. It is a saturation mailing, addressed to \"Local Postal Customer\" with no address. It is impossible to opt out of this kind of mailing. It is incredibly wasteful of the earth's resources, and does not even offer an option to stop receiving it. I will not be going to this restaurant, because they conduct this amoral business practice.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Came here when the place across the street was too full. Family was in town so we sat down and immediately started ordering food. \n\nThe owners are very friendly and funny! They played a couple of jokes on us and even sang my husband happy birthday  when he walked in late. He was so confused it was funny. \n\nThe food is good and the portions are hearty. \n\nCheck it out!! \n\nWe got the fried rice, noodles, soup, and potstickers!", "author": "Carina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-21", "description": "Gets the job done Chinese take out. Don't know why everyone says that. If it got the job done I'd go to some cheap hole in the wall place on Clement. \n\nChangs! Their set dinner prices and crazy fast delivery makes this place my go to Chinese take out every single time.\n\nEverything comes hot still.\n\nThe right order every time.\n\nFriendly service.\n\nAffordable price.\n\nLiterally waiting for my order right now", "author": "Ninotchka A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "I just ordered food for the first time with Yelp. I am visiting my girlfriend in town and she tasked me with ordering dinner. We picked Chang's. Realizing that I did not have any cash, I ordered online using my cc. I did not select sn option for tip and the delivery guy comes over and the first thing he asks for is the tip. He hands me my food. I explain to him that it was my first time and he is insistent on a tip. He starts saying that I selected a \"cash tip.\" He keeps asking and he finally asks one more time for a tip and I again tell him that I don't have any cash. I say that there is no way to tip with that attitude at all. He walks away! As someone in the service industry, I need to make people aware that if you hire someone like this, your business will suffer,  regardless of the food. We haven't even eaten yet! Poor delivery service with a terrible representation of this place. Hopefully, the service in the restaurant is much better than the delivery! Terrible!!!", "author": "J W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "I've come here for dim sum and it was tasty. My favorite part about this place, though, is the owner. He has a great sense of humor and always makes me smile --honestly why I keep coming back!", "author": "Em S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "The Mango Chicken is seriously the best item on the menu and I hope that it moves from being a lunch item to being on the full menu.  The Beef Cilantro is also amazing.  So far, the only Chinese restaurant that I think gives Chang's a run for its money in San Francisco is Henry's Hunan.  \n\nThis place is amazing!!!!!!", "author": "Brikka M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "I ordered delivery through Eat24 and I will be doing it again soon! I had meatless chicken mu shu and meatless chicken kung pao with brown rice. Both entrees were fresh and tasty with plenty left over for dinner again tomorrow night. I chose the spicy option for the kung pao (options were mild, medium, spicy & very spicy) and it had a nice kick without being  overly spicy. The veggies were all fresh & crunchy. As a vegetarian, I appreciate the meatless options. I also greatly appreciate the restaurant's decent health score, the highest score of comparable places. Delivery was fast and smooth as well.", "author": "Marybeth S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "Fast delivery and generous portions for the price. This place in my go to chinese delivery. Easy to order online via yelp and pretty quick delivery, around 30mins on a friday night at dinner time. Ordered Mongolian beef which was good on flavor and a good amount of heat to it. The veggies were crisp and fresh and not too soggy. Also got the combination chow fun, noodles were well cooked, a little disappointed in the amount of protein as it had an ok amount of chicken and beef but like only 2 little pieces of shrimp. Overall the food was good to delivery and it was fast", "author": "Peter P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-03", "description": "Appetizers were overly salted. The cook that night over seasoned half the food we ordered.", "author": "Pang M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Hands down my favorite general tso chicken and walnut prawns and reasonably priced.  The service is great too!  Love to see people there supporting it", "author": "Patarck S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-16", "description": "I ordered online through their website and received a confirmation email.  An hour and a half later, my food still hadn't come, and I called the restaurant to check on where it was.  I gave them my address and they said my food had already left the restaurant and was on its way.  Another half hour went by, no food.  I called again and they gave me a long story about how they never got the order and that it must have been my fault, even though I booked through their website and not a third party, got a confirmation email, and called and got confirmation that the food was coming to my address twenty minutes prior.  Don't waste your time.", "author": "Juliana D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "Had delivery. Mongolian beef was great, just the right amount of spicy, and just the right amount of onions. 4 stars because the chow main was a bit bland in taste.", "author": "Fernando G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Let's get to the point, the staff (guy running the show) is amazing and friendly. Fast and nice service. Food is really good but I feel like when they are busy, it can get hectic and warm food comes out. Loved the hot & sour soup. Ordered the chowmain and it was a little dry but very tasty! Order seafood it's good.", "author": "esme R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-21", "description": "3.5\n\nQuick delivery easily and seamlessly done via Yelp. Prices are very reasonable...something like 6 dishes, which were very generous, for about 58 bucks with tip.\n\nFood?? Meh. It is okay but I wasnt blown away. Stuff was pretty oily...but the spicy stuff definitely was spicy. Great pork fried rice Like someone else mentioned.\n\nI am still a ton kiang groupie...even though it is twice the price.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "the spicy dry fried chicken wings and the appetizer deep fried crab Rangoon are must ordered. They are just so great. I will definitely come back again for those two dishes.", "author": "KaiChiu F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "Great value, never a line, and good variety! I used to queue up at ST across the street, but no more. C's deep fried chicken wings are just as good and I like their vegetables. \n\nTheir staff is always courteous and kind. It's my go to spot for Chinese food in the Inner Sunset. I order the sesame chicken, deep fried chicken wings, and dumplings.\n\nTo Jan Carlo below, if you've got a large party, a baked in tip is usually standard. It's not just the tip fee charge, there is the SF Restaurant Health Care surcharge of 4% plus the 9.5% Sales tax and then the 15% - 18% tip. Are you really complaining about a $53 total bill when you had a party of 6 or more? Are you serious? Blame the government if you need to blame somebody for all your taxes.\n\nI hope you didn't spend too much on your law degree. Because I'd ask for a refund if you're willing to pay tens of thousands of dollars in law school tuition a year and yet complain about a 15% tip that equals $12? How are you going to win any cases when you can't understand the other side? If you want to save money, eat out less often or eat less. \n\nLearn some EMPATHY. The waiters and owner don't speak the best English, so they probably had a hard time conveying the rules. They work hard every day earning near min wages to please customers like you who couldn't give a damn. Be kind to others, and others will be kind to you.", "author": "Jacob J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "The food is good, but I feel like we always have a missing item- this time it was an order of white rice.", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "They mostly get overflow from San Tung, but Chang's is worth a try on its own. Good dim sum, free crab ragoon with delivery minimum, and friendly service if you eat there.", "author": "Dawn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "If you always go to San tung you should try Chang's instead. Their dry fried wings are BANGIN    PERIOD. \n\nHi Michelle", "author": "Lawrence L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "We didn't want to wait to be seated so we picked this place and I'm glad we did. Our waiter was so funny, he kept messing with us the whole time saying things like \"We're out of rice.\" (They weren't.) We definitely ordered too much food but it was all great from the fried rice, to the sweet and sour shrimp and of course the chicken wings. We also ordered shrimp potstickers and had to take mostly everything home. Have yet to try San Tung but can say that if you don't want to wait in line or they're out of chicken wings like the last time I went, this place is a great alternative. Parking is pretty hard to find in this area, especially on a Friday night", "author": "Trisha S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-17", "description": "Chang's Kitchen saved my life.\n\nAt least it felt that way. Wife and daughter had been out of town for about a week. I had been suffering the worst flu of my life and did not want to leave the house or prepare anything for myself. More of a lay around in a fetal position kind of mood. After a few days of not eating soup seemed like something that I could work with and I found Chang's online. Corn soup, wonton soup, and ma po tofu were ordered online and 30 minutes later a smiling Chinese man was at my door with hot food. The food was so hot I burned my mouth on the corn soup. Didn't bother to check thinking it would be lukewarm...\n\nI ate dinner from Changs and am still alive. Thank you Chang's Kitchen.\n\nSubsequently we have ordered lazy homey style takeout Chinese from Changs and been happy with the result each time. It is not going to hit you over the head with authenticity or local, organic, free range, etc. but it gets the job done.", "author": "Easwud C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Absolutely love Chang's; my favorite place to get Chinese food! I'm Chinese, so I eat Chinese food almost every day, but I'll never get tired of coming to here!\nMy boyfriend and I randomly decided to try this place even though it was relatively empty (it's easy to be overlooked when San Tung is across the street), and we definitely didn't regret it! We've tried their dry fried chicken wings, which were generous in quantity and overflowing with flavor, their tomato beef noodles, spicy wontons, garlic eggplant, Mongolian beef, etc (we try something new each and every time and nothing has let us down so far)! The food gets a 5/5 for both portion size and flavor! \nThis place also earned a solid five star review from me because their service has been impeccable each and every time! I once came here after a colonoscopy, but kept fading in and out of consciousness due to the procedure's anesthesia. Good thing I was with someone else, but I clearly remember how kind and considerate the waiters were! \nI feel a bit sad when I see this place on the emptier side and San Tung with an overflowing line! I hope this place gets the recognition it deserves!", "author": "S Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-19", "description": "Slow service, requested white meat chicken and was given dark, never got our complete order, and while eating, they rolled a garbage can through the dining room. That's disgusting! We will never eat here again!", "author": "Antonio L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "Ordered delivery twice, the first time they screwed up my order, I ordered broccoli and beef, but they gave me beefstew with eggplant with the broccoli. I hate egg plant. I'm allergic to it. Gave it to my coworker the next day. \n\nThe wings were good, but the second time I ordered it wasn't that dericious.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "The food was amazing! The sautéed string beans with minced pork, Singapore style rice noodle, and the salt and pepper pork chop was amazing. The food was in large portions, and amazing prices.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "The food was strangely sweet for everything on the menu. I didn't like that, as it seemed like they only knew how to flavor in that one way.\nIf you like food that it sweeter, you may like this place though!\nAlso, the fried chicken was good. Again sweeter than San Tung, but worth it if you don't want to wait the long lines.", "author": "Lina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "Quick, friendly delivery. Food was hot and fresh, portions are large and satisfying. Found my new go to delivery.", "author": "Vito F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-28", "description": "I am usually open to trying new places, the reviews on this place were okay and it was open so we decided to try. The man helping us was so friendly and patient. We ordered the lunch special and they brought us this funny smelling soup. It was too salty. The main course was alright. Nothing special. The textures of the meat were a little off and it wasn't well seasoned. I even ordered dim sum sample plate, again, no seasoning and the meat texture was off. Dumplings we're sweet though", "author": "Dalia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "I am a true fan of this place as an all around good place of good Chinese food at a reasonable price.  A big plus is that they deliver in a wide radius of the restaurant too!  They are located in the Upper Sunset and I am in Twin Peaks and they still deliver for free - awesome!  My go to's are Mongolian Beef - medium spice, Sweet and Sour Chicken, Wor Won Ton Soup, Chinese Broccoli in sauted garlic and they give you fried rice with egg for free; all for about $40.  Not too bad in my book.   Have tried other places in the city but always come back to Changs.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-10", "description": "Good comfort Asian food. Very flavorful but maybe a tad too much...\n\nFOOD: I came here for a group meeting and we ordered and shared a bunch of dishes, some includes string beans, coconut shrimp, fried rice, chow mien, fried chicken wings...Very traditional food you would find in any \"Chinese\" restaurant. Why the quotation marks? Because to be honest you would never find any of these dishes in a real Chinese restaurant, because they have been customized to suit the American taste buds. Everything tasted good, but the flavor is too overwhelming for me - either too sweet, or too salty. I felt really thirsty that night, probably because all of the sodium (and MSG ??)...\n\nSETTING: Very typical Chinese restaurant - family-style. And it's right across from its fried chicken rival - Sun Tung! Both fried chicken tasted good to me. \n\nSERVICE: Very friendly servers and the dishes came out very quickly. \n\nPRICE: The food was covered but I think the price is within the typical price range ($10-15/dish). The portion sizes are also pretty big - definitely enough for 2 meals if you are eating alone! \n\nOVERALL IMPRESSION: Pretty good comfort food but ONLY ONCE IN A WHILE!! I have higher standards for Chinese food since I am Chinese and was born in Southern China, so I really prefer aromatic dishes with light seasoning. Food like this is a little too greasy and heavy for me..", "author": "Wendy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "This place has awesome dry fried wings. I've come here twice when the lines at San Tung were too long. The wings at Chang's are just as good without the line. \n\nHave also gotten the spicy eggplant and the black bean halibut fillet. Everything came out piping hot and delicious. Highly recommend!", "author": "Teresa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-11", "description": "I have to say the two top thump's up for Chang's is their preparation of veggies; either with or w/ot meat, so tasty. And then their portion size. Humongous! Student's everywhere could eat for a week for under 30 bucks.However, the sweet and sour isn't too hot (and I don't mean the temp) and the dishes are a bit bland. However, their chicken is great. You just have to go through their menu to see what you like. Honesty, they're 3 and 3/4 stars; but totally worth trying!", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "My go to Chinese take-out spot!\n\nThe ginger sauces are killer, especially the one that comes with my favorite item, the spicy wonton.\n\nThe spicy wonton is this little pillow of soft dough swaddling a hearty bite of pork stuffing. All soaking in a spicy, gingery, crack laced, fish sauce that is so good. I srsly save every drop of it and use it when I cook. \n\nFor reals, that sauce can take my lame fried rice recipe and puts it right up there on par with Gary Skanko. OK well maybe a little under par, sans the fancy shmancy presentations, but yeah spicy wontons for life!\n\nThx Chang.", "author": "R J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "Gerenal Tso's chicken is my favorite dish in this restaurant, its juicy and spicy, and the spicy it's just perfect. And I come for lunch a lot, lunch plate it's big enough also get soup with it. The service was very nice. \nThat's why I come back all the time!", "author": "Huixin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "This place is delicious. The service was fast and extremely helpful. The place looked clean and the food was great. I got the Mongolian beef and the honey walnut shirt along with their dry fried chicken wing. It was a excellent meal.", "author": "Tony N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Chang's is a typical small Chinese place in the Inner Sunset.  We were there for lunch and both of us had chow fun.  Mine was dry beef and my wife's was wet seafood.  Both had excellent wok flavor.  Serving portions were huge.  The only downside was there must have been high levels of MSG because both of us had very dry mouths later in the afternoon.", "author": "Steve N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-26", "description": "Came here to celebrate Mid Autumn Festival with family for dinner. It was oddly empty... Anyways, the food was pretty average. They don't give you chopsticks by default, so that was a sign it's not as authentic Chinese food, at least in my opinion. The tofu was pretty dry and didn't taste that good. I don't know what the heck was with the Gai Lan (Chinese Broccoli) but it was super fiber-y. \n\nThe General's Chicken was pretty good though. And service was very friendly. I'd give it three stars. Average Chinese place, probably wouldn't come again though.", "author": "Brandon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "Stumbled upon this place since I couldn't get a seat at San Tung across the street EVER. To my surprise, extremely please with the service cleanliness and most of all delicious large size portions at a great value. Love coming here when given the chance. Shanghai Soup Dumplings are a all time fave!", "author": "Eduardo S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-24", "description": "WARNING: For those who are eating here, make sure to calculate your bill before paying up. They add mandatory tips in your bill. We had a bill of $53. We added everything with tax and it came out $41. So they added $12 as tip. When we asked for breakdown, they said that the tips are already included and it's in the law of San Francisco to give tips (Excuse me, you ain't fooling no one who studied law).\n\nFood is great but service is soooo bad. It took a while before we got our food. The waiter even kept ignoring us when we call them.", "author": "Jan Carlo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "Great delivery Chinese food! Order came fast, hot, and well-contained\n\nSoup dumplings - stellar. How do they keep the soup in there during transport?! I usually lose half my liquid getting the dumpling from the plate to my face. \n\nGeneral Tso's Chicken - A whole lot on NOM. You could smelly the spiciness when the lid was lifted off\n\nStir fried rice cakes with pork - always a winner\n\nCombination appetizer with pork bun and shrimp dumpling- definitely worth it", "author": "Jordan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "On different occasions I have tried (delivery, not dine-in) their Mongolian beef/lamb, shrimp dumplings, orange chicken, General tsao's (spelling?) chicken, veggie shrimps, plain rice, fried rice, and Mongolian beef chow mein. They are one of the best restaurants my family has tried in San Francisco; costumers can depend on the meats being fresh and lean cuts, the veggies being fresh and not being used as fillers, and the portion sizes being VERY generous. Be warned, however, that the sodium content of the Mongolian beef/lamb dishes may be high on occasion, and that the chow main has a strong peanut-oil smell, but besides that, this restaurant is fantastic.", "author": "Jenifer J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "We come here often and they always give us great service! The fried chicken is definitely worth a try, it comes out hot and fresh! I also like the salmon with the tofu as well as the egg tofu with beef and veggies. I think all dishes are great and worth trying new things every time I come :)", "author": "Kotoko T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-28", "description": "What happens when your friends of friends from out of town visit SF?\nThey decide to get San Tung at peak lunchtime on a weekend.\n(Which all Inner Sunset locals know is a laughable idea)\n\nOf course, it is crowded beyond imagination, so of course, they decide to go across the street to Chang's Kitchen and order fried chicken wings.\n\nMy problems:\n- The storefront says it's Asian Fusion, but the only fusion parts I noticed were the fried chicken wings and the forks\n- Don't expect dry fried chicken wings to be like San Tung's... these are really dry fried like KFC dehydration status\n- Small portions (however this assessment is confounded because we all came here after running a 10k)\n\nMy approvals:\n- Overall, their Chinese food is better than Panda Express\n- It's the kind of friendly mama-san, rather than disgruntled servers that make people complain about service on Yelp", "author": "Edna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "Ordered the veggie friend rice, veggie chow mein, and the sesame chicken. Delivery arrived hot and fast. The portions were good with plenty of fresh veggies.  I'm picky about meat and the sesame chicken was great. I would say it's the best Chinese food I've had in a long time.", "author": "Amanda A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "One of my goto place for fast delivery. Food taste good. Price is reasonable. Portion size is large. My favorites are General Tso's Chicken, BBQ Pork Egg Fu Young, Chinese Broccoli Beef.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "I can't believe I hadn't heard of Chang's Kitchen until my brother decided to Yelp an alternative to San Tung's. The food here is great! Some of the dishes are cooked a little differently from other Chinese places I've been to, but the quality and taste was not a sacrifice. Everything tasted very fresh. Their chicken wings are comparable to San Tung's across the street. It's cooked and flavored a little differently, but still good! The only little gripe I had was that the breading on the Honey Walnut Prawns was pretty thick. But the flavor was on spot. \n\nService here is amazing. All of the staff was super attentive, friendly, and professional. They were on top of all our needs - extra napkins, refills on water and tea, clearing the table, etc. \n\nPersonally, I don't like dealing with the dinner rush parking in this area so it was great to see them constantly receiving delivery orders. The phone was pretty much ringing non-stop the whole time we were there. It wasn't annoying (not to me); it was just a little surprising given how empty the restaurant was when we entered. So don't let the emptiness of the restaurant fool you! Give Chang's Kitchen a try.", "author": "Florence S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "The owners are so nice. I really enjoyed my salmon lunch special. It was crispy, spicy, and delicious. The prices are almost criminally cheap.", "author": "Lauren U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "Everything was great with delivery. Hot, fast, & fresh. The Sesame Chicken was so good and by far the best dish of everything we got. Just an overall good order for a Friday night movie!", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "If you dare to open a Chinese restaurant right across the street from one of the most popular Chinese restaurants in SF, you better be good   Chang's Kitchen didn't let me down.   \nNo need to wait for a table. Service is super prompt, courteous, and friendly.  The food selection is almost identical to the one across the street.  We ordered dry fried chicken wings, curry prawns, garlic filet mione and shrimp fried rice.  I also had specific request to each order and the food all came exactly the way I wanted.   The taste of food is GREAT!  This place is no joke!   \nI just don't see any reason for me to join the hype across the street.", "author": "W C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-29", "description": "I've only ever ordered for delivery from here and they've never disappointed. I ALWAYS get the meatless sesame chicken with a side of brown rice. It has the best sauce ever. They offer a wide array of meatless options if you're vegan which is great. My husband likes the kung pao meatless chicken.\n\nThe fried tofu is also really yummy and you get A LOT for your money.", "author": "Adelaide M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "Are you sick of the line at San Tung? Go to Chang's, which is the forgotten but severely underrated little Chinese brother. The fried chicken is just as good here and there is less of a crowd. Staff is friendlier as a result.", "author": "Jin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "We have been going to Chang's Kitchen since my daughter was a little girl...so for 20 years plus.  The staff is very friendly, it is very clean, and the food is very good.  They have dry fried chicken, war wonton and many other popular dishes....if you want something, ask because they will accommodate you. Really a little gem!", "author": "L G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "I was feeling adventurous last night and decided to order take out from Chang's thru yelp. Never tried or heard of them before which is risky for take out because if somethings not right with your order you're kinda just ...stuck. \n\nFirst off the food (and portions!) were awesome!!! I was super impressed by the way they wrapped each dish individually. Major props for that and thanks for the small details. I had the eggplant with spicy garlic sauce. And that thing was saucy! If it wasn't wrapped in its own bag it would have been an annoying mess. I most other chinese restaurants clearly don't give a shit. So again, thanks. I also had the mix mushrooms and tofu and veggie chow mein. \n\nEverything was great, will recommend and order again :) OH! and they deliver fast! My order took about 30mins.", "author": "Ashley Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "Great food. I work in the area two days a week. They know me by name. Szechuen Salmon on lunch menu. Great.... had dinner there too. Nice tv screen. Watched the Warriors.... great service, always with a smile. Walnut prawns yummy, kung pao shrimp and chicken. Great. I'm hooked on the salmon right now. Check them out. Daily lunch specials, decent prices. You'll be glad you went there. Enjoy!", "author": "Karen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-24", "description": "Owner was nice but OMG I DON'T THINK THEY WASH THE DISHES. I saw lipstick stain on one of the bowls that the waiter brought to my table. Food tasted like they were precooked and microwaved. They got cold after couple mins. Bug in our water and cups were dirty.", "author": "Thanh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "We were so impressed with this place! We live about half a block from it but hadn't eaten here before until a few days ago, on Christmas Eve when most stuff was closed. The spot used to be Golden Rice Bowl, which was very \"just-OK,\" so when it opened under a new name, I wasn't sure if it was the same place with a new name or if it was a new place. Judging by the menu and the food, I would say that either it's new ownership or at least new management. They were packed that night and we had to wait a bit for our takeout order, but the food was really good. \n\nWe had the dry fried chicken wings--they were awesome, though we ordered medium and I would have liked them a bit spicier, so next time I will order spicy instead. However the other food we ordered medium was pretty spicy (the sauteed string beans and Mongolian beef). The string beans were some of the best I've had--sometimes those can be kind of soggy, but the string beans were still a little crunchy, nice and spicy, great flavor and texture. The beef was really good too. We also got the pork fried rice, which is also some of the best fried rice I've had--not greasy at all like fried rice sometimes is. The crab rangoon were OK, but probably the least exciting of the dishes (though crab rangoon is kind of always exciting anyway). \n\nWe'll definitely go back now. If you are waiting across the street at San Tung and feel like getting some delicious Chinese food without waiting 2 hours for it, I recommend crossing the street and checking this spot out. You won't be disappointed.", "author": "Jennie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-06", "description": "Decent Chinese food on a cold day. Small place on a busy street. Pretty big menu. Food came our really fast and fresh. Lots of people coming in to grab to-to orders. \nVery nice owner and staff. Go out of their way to help you and they have good relationships from their regulars it seemed. \nDay after food heated up was just as good!", "author": "Loren L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "As noted by many yelpers, very nice owner.\n\nPortions are Hugh, so order with care or you will taking more home than you consume on site.\n\nI should have ordered the chicken wings.  They looked so good.  Next time!", "author": "Bradley C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "Food was fresh, veggies crisp, very flavorful, and delivered pretty quick for a Friday nite.  Recommended!", "author": "V S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-19", "description": "This place is like bad Americanized chinese food. Once you go in, you get seated and there's already forks on the table. That should be red flag number one. Instead, we got a menu and we got General Tso's chicken, chow fun, and the dry fried chicken wings. The chow fun was by far the best thing there and the General Tso and chicken wings were both not good. The General Tso's chicken was mostly breading with no chicken whatsoever. The chicken wings were too sweet and breaded as well. Lets just say... you should just endure the wait across the street at San Tung and enjoy the best wings in the city......", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-21", "description": "Got discouraged waiting forever for San Tung and decided to take a chance on this place.\n\nProbably 4 stars overall but starvation mode made everything about 1 star tastier.  Also one of my best friends is named Chang so bonus points for that too.\n\nHopefully this will spread some of the culinary love across the street and decrease some of the absurd wait times.", "author": "Gerald D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "First time visitor. Awesome customer service. I requested a custom plate and the server didn't have any problem placing the order. The portions were large. Definitely will be back to this restaurant if I'm ever in town.", "author": "Juan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-29", "description": "I would give this restaurant 0 stars if I could. I placed an online order and after an hour of waiting and no delivery in sight, I contacted the restaurant and Yelp. I was told the order was on its way. After 1.5 hours, the restaurant called and said \"the boss says we are not going to deliver to you.  You live too far away.\"  I explained that I live about 2-3 miles from the restaurant and my order was processed and that it was 1.5 hours after I originally placed the order.  The guys just said \"sorry\".  My dinner with my guests were ruined.  I will never order from this restaurant again for its lack of professionalism and courtesy to its customers.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-06", "description": "Good food, quick delivery. Did have a few problems with the on-line ordering with Yelp, but other than that - all good...", "author": "Simon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "Stopped in for a late lunch/early dinner with my siblings and many other of the restaurants were closed but this one was open. Decided to try it out, it was a great choice, the place is super clean, the staff friendly, food quick, reasonable and delicious. Will be back for sure!!", "author": "Alicia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "I actually like this place better than San Tung! San Tung's dried fried chicken has better taste, whereas this place's is sweeter, but Chang's Kitchen's entrees are way better! We tried the walnut prawn, fried rice, sautéed green beans, dried fried chicken, Mongolian beef, and Kung pao chicken!! Everything was so good ;D \n\nTheir service is awesome too, well at least from the older man. He was so funny and cheerful and made so many jokes:)", "author": "Jacquelyn W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "We recently ate here twice, both times the food was just OK. We got delivery and the food was made quickly and delivered on time. Veggie chow fun, ok, lacking in vegetables. My husband had two different vegetable beefs dishes - they had too much garlic, beef was just okay. Had a craving for sweet-and-sour chicken. It was OK. I asked for no Bellpepper peppers but they put them in anyway. I'm allergic, my husband ate most of it... OK overall but not my first choice.", "author": "Coco J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "We had ordered online through their website the following dishes - spinach tofu mushroom soup, spicy garlic fried rice with mushroom, General Tsao's Meatless Chicken. A promotion was going on so got Egg rolls (3) for free. The fried rice was really good. Egg rolls weren't greasy and tasted okay. The soup was a clear one with mild seasoning so just what we had wanted. General Tsao's meatless chicken but it didn't meet our expectations. Delivery was prompt.", "author": "P B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Sooo good. Love the meatless options. We always get general tso's meatless chicken. It is crispy and spicy and full of flavor. Chewy texture which vegetarians often miss out on. Also vegetarian potstickers and buns. Yum!", "author": "Marie E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-16", "description": "The sweet and sour chicken was so deep fried that it didn't even taste like chicken. Other than that, not great food. I would probably order from somewhere else next time.", "author": "Kray P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-27", "description": "FRUSTRATING. We ordered delivery. The service was friendly, the food was just so-so. But they forgot to include our potstickers. No big deal -- these things happen. But that was the main dish for one of our eaters. So we called within minutes to see if he could come back. Hopefully the bag was just left in the car. Even if not, we're only about a mile from the restaurant. On the phone, they promised to bring us the potstickers right away. Two hours later we gave up -- and ate a late-night salami sandwich instead of potstickers.", "author": "Patrick J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "Wow!! We ordered delivery of tofu, orange meatless chicken, Singapore noodles and fry rice... The food was absolutely delicious!! And for delivery when we received the food it was still hot!!! Definitely would recommend this place :)", "author": "Ria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "I'll say it... I like Chang's Kitchen BETTER than San Tung! The service is great, the food tastes fresher, and you never have to wait. Better yet, they deliver when you don't feel like leaving the house. I've often been there when it wasn't busy but I don't count that against them - I think they do a ton (if not a majority) of their business in to-go and takeout orders. I'd rather not wait anyway! \n\nWe get super basic orders usually; some kind of chicken (Sesame or Dry Fried) and recently got the chow mein (SO SPICY but SO GOOD). The soup portions are huge (even a small is enough for 2-3 people). Love this place.", "author": "Whitney D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "My most favorite Chinese food in SF!! Wandered in here after San Tung across the street had an annoyingly long wait & we were hungered. Was amazed and excited to find everything I have ordered from that day & since is delish!! BBQ Pork Fried, THE BEST Shanghai Soup Dumplings!! , Mongolian Triple Combo, Sautéed Spicy String Beans with/without Pork, Eggplant w Garlic... All amazing. \n\nLastly and most importantly, the server/host is the cutest and most hilarious Asian restaurant owner I have ever met. Once asked him to split the check & asked if we needed scissors, haha", "author": "Sabrina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "Went to a late lunch today around 3:40 PM and missed lunch specials):. But none the less the food was HELLA good!!! Best Chinese food I've had at a sit down Chinese place ever. Everything is made to order and it didn't take hella long to make about a 3-4 minute time gap for each order to come. We ordered the house fried rice, house chowmein, sweet and sour chicken and chicken wings(minus the spicey) and all of them WAS HELLLAAAA GOOOD. I cannot emphasize enough how good the food was. \n\nSERVICE was a ten!! The woman and man that served us were very kind and helpful with questions. The man was HELLA funny and made the experience more enjoyable. Asked for a refill of water and he said \"noooooo... PROBLEM\" and just the way he said it put a smile on my face.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-07", "description": "3.75/5; worth a try but could be improved\n\nLike other reviewers said, I was equally apprehensive when entering a restaurant across from the (in)famous San Tung, but I was pleasantly surprised! If you crave a quiet environment where you can actually hear the people you're speaking with, fast and friendly service, fresh food, and the bonus of a television, come on over to Chang's.\n\nThe lunch special runs until 3pm (fairly late--most end at 2pm) and comes with rice, soup (hot & sour) and an egg roll. The soup is not too spicy and the egg roll lacks the artificial red sweet and sour sauce other places douse their egg rolls in: you can taste the freshness and crispiness. The portion of the lunch special entree is smaller than other places though, so a balance adjustment in the ratio of rice:entree would be good.\n\nYes, the bathrooms are very clean and spacious. Yes, the waiters speak proficient English. Yes, you can hang out a while and catch up with friends. Yes, I will go back!", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "Ordered for delivery through UberEats. Fast and reliable. The food was good and we enjoyed as expected.", "author": "William H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "First time ordering and they were super fast! Placed my order at 2:24 pm to have it delivered at 4:30pm but it arrived at 2:40pm! I wanted it delivered later tonight but hey not complaining for less than 20 minutes! Food is very good too and big portions!", "author": "Dayna Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "To be completely honest, we were trying to go to Sang Tung and when we realized there were twenty people ahead of us, we decided to go here. \n\nWe had a party of five and were seated immediately since the restaurant was empty. We were a bit apprehensive since no one else was there but we decided to stick with it as we were pretty hungry. \n\nOur server was wonderful. As we ordered he made jokes and was generally very welcoming and pleasant. \n\nHere is what we ordered:\n\nGarlic Fried Rice - So so good! Some of the best fried rice I've had. Very flavorful. \n\nWalnut Prawns - Very good. Well fried and full of flavor. \n\nChicken Chow Mien - Solid. Cooked well, the noodles were a great texture and the flavor was there. \n\nDry Fried Chicken Wings - Yum. Hot and fresh crunchy with the right amount of sauce. \n\nGarlic Pork - Others liked this, but for me it was a bit too sweet. \n\nSoup Dumplings - I've had better ones elsewhere, but these weren't bad. \n\nAll of the food came pretty quickly. In typical Chinese restaurant fashion they brought out each dish as it was ready, which means it is fresher, but you don't get everything right away. It wasn't too long from first dish to last, though. \n\nOverall this place is a solid choice, especially if you don't want to wait forever. I would eat here again.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "Girlfriend and I came to the city for a hiking trip and were craving Chinese food. Place was smaller than I thought but it feels homely inside. \n\nWe had a very warm welcome by more than one of the employees there and were taken care of right away. The place is pretty clean and the menus are easy to read. We only had to wait ~10 minutes for our food and it was a pleasure. \n\nVery welcoming atmosphere, pretty clean establishment, and a very friendly team of employees. Would highly recommend and come back if I decide to come through the city again!", "author": "Michael G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-21", "description": "After receiving my order I was promptly asked \"where's my tip?\" To which I replied I left it on the card. Or so I thought, I did sign the driver a tip because apparently it didn't process it in. My bad. Either way I was aggravated that this entitled lil brat approached it in the manner he did. Also, as I had company over and was at my new place and not properly unpacked I asked for condiments I.e. A couple forks or chopsticks in the least. Nope. \n\nOn further review I found onions in my fried rice (after I requested no vegetables in it) as I am allergic to these I was unable to eat this too. (Which kinda sucks because the reviews for the bbq fried rice were pretty high. \n\nThanks chang's kitchen, now I'm headed to Safeway for forks and a precook ex dinner for myself!", "author": "Cody N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "Was aiming to go to San Tungs directly across the street but we were TOO HUNGRY to wait in that line. We sat right away, had plenty of space for dining, not too noisy, INCREDIBLY FAST SERVICE. Plus the food was delicious.. Wings, lo mein, general tso chicken... Yum yum yum! Nice portion sizes. Will be enjoying again for lunch :)", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Garlic Filet Mignon cooked to perfection, as was my wife's kung pao chicken and the service was great!", "author": "Brian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-24", "description": "Very rude service and we won't be going back, although these folks didn't seem to care.\n\nWe had 6 people. When ordering a soup, we asked the server if the soup was large enough for our party, she said the amount was good for 4 people only and that we should order 2. We decided to order 1 soup and a noodle dish instead (in addition to a few other entrees) to have more variety.\n\nWhen the soup came, the server started serving the big bowl of soup and filled 4 bowls up to the rim and left 2 bowls completely empty. We, kids and adults at the table, opened our eyes wide and could not believe what we saw. When she was done, we had to take over the ladle and redistribute our soup to fill the 2 empty bowls. The server was obviously making a statement that only 4 of us should enjoy the soup because we did not order 2 identical soups as she wanted. \n\nAt one point during our meal, we asked another server who walked by to take a picture of us. She immediately raised her hands signaling they're dirty (without saying a word) and gave us an annoyed look that we're asking for too much while she was busy around. We resorted to taking a selfie.\n\n1 star is too much for how we were treated as customers.", "author": "Linda A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Best food best service why wait in line for San Tung it's over hyped and not much better", "author": "Nui J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-13", "description": "This place was a giant let down! Never again. Got delivery from here bc it had similar reviews as Nan King Road. I don't understand how bc the food was very poor quality. We got the diced dry chicken and i ended up throwing it all away. Nothing but batter and minuscule pieces of fatty chicken. Way too much sauce what a soggy mess, ain't nothing dry about this greasy pile. So gross. Also got the combo fried rice, chicken chow fun, and Singapore noodles which were all so so... definitely a lot of throw away pieces of meat mixed in. Nope, do not want. Bye now.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "This is my favorite Chinese restaurant in town serving the best chicken wings. Whenever I need some delicious Asian food, this place is a go to.", "author": "Benjamin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Don't sleep on chang's! Their dry fried chicken wings are the bomb! Better than San tung. Michewwe.", "author": "Nelson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Chang\"s kitchen the food is good for us, we order the online food online, the driver delivery very fast, fresh  and he is very friendly so good that I gave some to my neighbor highly recommended I will go back again", "author": "Zhi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "San Tung was closed when we got there around 3 so, my girlfriend and I opted for Chang's Kitchen across the street. A quick yelp review to see the overall ratings and it's a lock. We came in and were seated right away. The room was half full, which is a good sign. We quickly ordered:\n\n1. Minced pork with string beans- This was fresh and crispy. It was wonderfully seasoned, not too salty or bland.\n2. Mapo tofu with pork- This was amazing over rice.\n3. Walnut prawns- I remembered it being amazing but couldn't confirm with a second piece because my girlfriend were throwing them back like miss pacman. It was crispy and delicious.\n4. Dry fried chicken wings- Three layer texture of awesomeness. (Juicy/savory meat inside, crispy goodness in the middle, and sweet sweet sticky glaze on the outside)\n\nThis place had a lot of nice touches that separated itself from the pack. For one, it was incredibly clean. The menu's weren't sticky from food residue like other places. Also, the owner was a sweet lady that put my leftover food in the box for me even when i insisted to do it on my own. What else can I say?.. The lady has class.", "author": "Vu T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "Happen to b in the Inner Richmond & craving dumplings. Stumbled on this spot & checked it out. Clean, easy, friendly staff, great prompt service. The food was spot on. Know that there items are not \"Americanized\", meaning that it's not sweet. Pretty traditional from what I sampled: steamed pork soup dumplings, spicy wontons (the shit!!!!), Sui Mai & pork-chives dumplings. $26 all in w tea. Stoked to find this spot.", "author": "Sen-Sei S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-14", "description": "We ordered 5 orders from the restaurant. The delivery guy was rude and appeared to very unhappy when delivered the food.\n\nI was very sick and my fiancé was too tired to cook after work. We ate the food. It tasted different. Not good. Not bad. Just different that we both couldn't eat more than a small bowl. It doesn't taste appetitive as we expected.", "author": "Ely T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "My friends and I were looking for a good place to eat after exploring Golden Gate Park, and boy did we find one. We actually wanted to go to San Tung first, but like a bunch of other Yelpers, we ended up here after finding out the wait list (which was ridiculously long) had closed for the night. After trying Chang's, I'm glad it had. \n\nI came here with three other friends so we ordered a good amount of dishes and shared family style. Don't come to this place without trying the fried wonton strips. We started off with them as delicious snack to open our meal. The BBQ pork fried rice we shared was a great side to our entrees. The honey walnut prawn puts Panda Express to shame with its perfect glaze and flavor.  The roasted duck was just the right amount of fat under the crispy skin and had more than enough to go around. My favorite, the dry fried chicken wings, were an instant classic. With its crispy skin and savory garlic seasoning, I'd definitely come back just for these. \n\nThe service was quick and polite, and they were nice even though we ended up being there 15 min past closing time. I would definitely recommend trying this place for anyone, especially those not wanting to wait forever at San Tung.", "author": "Tony T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "We are huge fans of Chang's Kitchen.  We love that we can enjoy a fresh and tasty meal, and even more than that, we love that Mr. Lu makes us feel so at home.  Mr. Lu always goes out of his way to make friends with our 2 year-old son, and so, going to Chang's Kitchen feels we are eating at a relative's home.  There are not enough good things that we can say about Mr. Lu and our many happy memories dining at Chang's Kitchen because of him.", "author": "Sophia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "4.5/5 stars but I rounded up to 5\n\nMy dad stopped by the city randomly and wanted to grab some dinner. We drove down Irving and spotted Chang's Kitchen (I remember seeing good reviews on yelp for this place) and looked for parking along the block. \n\nBy the time we sat down it was almost 9 pm. They gave us some fried wonton strips with sweet and sour sauce (I guess it's their version of free bread at a \"western\" restaurant). I thought this was really interesting. \n\nThey have a really extensive but not overwhelming menu. I also liked that they had a \"meatless\" section with classic dishes but made with imitation meats (perfect for my parents who are vegetarian). \n\nWe ordered the wontons in chili oil, garlic fish in spicy sauce, and the kung pao meatless chicken. \n\nAs we were waiting for our food, I checked yelp and realized that they closed at 9:30 pm (it was already like 9:10ish by the time we ordered). I felt so bad!! But they were so nice. People were still coming in closer to closing to order food to go. \n\nThe wontons came out first and they were so good! I ate all 8 of them. My dads a vegetarian so he missed out on the delicious filling, but he did try some of the wonton skin with the sauce. He enjoyed the flavors as well. \n\nI didn't really care for the kung pao meatless chicken since I'm not a fan of imitation meats, but I ate the veggies that were cooked with it and I liked those. \n\nThe fish dish came out last, but it was super fresh and tasty. I wish they had a non-fried option though.\n\nThe waitress lady was super nice and told us not to rush. I guess she heard me tell my dad they were closing soon. \n\nWill be back for the wontons and to try other dishes", "author": "Elisa Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-19", "description": "Ordered delivery online through Yelp. I specifically asked them to only put green onions in my Mongolian Beef. I also ordered green onion pancakes and pot stickers. When the food showed up the Mongolian Beef was packed with yellow onions, green peppers, yellow peppers and a few small pieces of beef. The pot stickers and onion pancakes were both cold and hard.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "We had such a great experience here! We just parked and walked around because we needed food and were so happy to stumble upon this place. The wait staff was so kind and welcoming. We had tea and chips given upon arrival, and the whole place felt friendly and kind. On of the people in my party said \"if you could taste the emotions from food this place would taste like happiness\". One older gentleman, we believe his name was Louis, was particularly wonderful, joking with us and making us feel at home. \nIt was a TON of food at such a great price! Would highly recommend :)", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "The food was tasty--very hot and fresh!--but surprised to get both dishes with no rice. Also, the wings were just so-so.", "author": "Todd W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-10", "description": "Went on a Sunday afternoon. The place was maybe 1/3 full. They can seat larger groups at a banquet table with a big lazy Susan or can push together several smaller tables. \n\nWe were a party of 5. Got many dishes:\nBbq pork fried rice\nBeijing chicken \nBroccoli beef\nHunan lamb\nMongolian beef\nKing pao chicken\nChicken with string beans\nSalt and pepper halibut\n\nAll of the dishes tasted good. However the lamb, the Mongolian beef, and the Kung pao were a bit spicier than we were comfortable with. That staff were very friendly and attentive. We all agreed we would go back again.", "author": "parker p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "This is a great place to order from. I would suggest the Beijing Chicken. All types of potstickers are good I matter if they are vegetarian or with meat. The veggie chow mein is also great. The prices are reasonable. I hope to order from there again!!!!", "author": "Will D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "We get their food delivered to us in the outer Richmond.  The portions are generous. The dishes are delicious and the food arrives within a half hour and it is piping hot.  I certainly recommend them", "author": "Emily G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-03", "description": "I ordered the Szechuan Dinner for two for delivery. Per their website at http://www.changskitchenchinese.com/ this should be: \"FD03 Szechuan Dinner (for 2)\nFor 2: Wonton with Hot Chili Sauce, Hot and Sour Soup, Kung Pao Chicken, Mongolian Beef, Chicken Fried Pork (Spicy)\"\n\nHowever when it arrived I found there was no fried pork, I thought this was breaded pork fried like fried chicken (like chicken fried steak, or chicken fried pork chop). Instead it was chicken fried rice.\n\nI called immediatly to find out what the deal was and the person I spoke to told me it was on their menu in house as chicken fried rice. I was a bit upset as this was the main thing I wanted to eat. He handed me to his boss who told me to call the person who made the website?? I asked if there was anything they could do and all she said is if I bring it to the restaurant (not an easy task at the moment) she would refund me. Otherwise she would do nothing.\n\nShe promptly told me she was busy and had to go and then hung up the phone.\n\nNow I've had plenty of wrong orders before in my life and I really don't mind that much, I am a pretty friendly person. But the fact that they didn't care at all that I did not get what I was expecting and hung up on me really makes me upset. The least they could do is offer a replacement or give a discount. Anything other than rush me off the phone and basically tell me to \"deal with it\".\n\nI won't be ordering from here again.", "author": "Arun Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-18", "description": "Some of the better American-Chinese delivery to be had in the Sunset.  Good quality ingredients, everything is seasoned/spiced well, prices are decent, and delivery is quick.  Their mongolian beef chow mein is some of the best I've had in the city.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "Chang's Kitchen is right across the street from San Tung, which unfortunately means that it gets overshadowed by its neighbor's dry fried chicken.  Don't be fooled by the lack of a 90 minute line though, Chiang's has food which is mighty delicious, if not quite on par with its neighbor.\n\nOur group of 3 showed up around 445 and we're greeted by an empty restaurant.  Although a bit unnerving, this also meant that we were instantly seated.  Our servers were a bit slow to take our order, but not egregiously bad.\n\nOur group got an order of pork buns, some general tso's chicken, and the Mongolian lamb.  I've been around the country trying variations on the good general's chicken, and let me tell you, nothing compares to what Chang's makes.  The outside has a perfectly crispy crust, and the sauce had a delightful mix of sweet, tangy, and just a bit of a kick.  Is it authentic chinese? Probably not.  Had I forgotten all about my lack of San Tung by the second bite?  Absofreakinglutely.\n\nThe pork buns were a bit on the small side and we're not quite as world - altering as the chicken, but they were definitely tasty and hit the pork bun spot which had been neglected for far too long.  I didn't get to try any of the lamb, but my girlfriend wouldn't let me steal her leftovers, so that's a seal of approval from her.\n\nThe portions weren't huge, but they also weren't tiny.  Plus, at around $9 for a main, the price is definitely right for food this delicious.\n\nTaken together, Ching's isn't perfect,  but it delivers very tasty food at a reasonable price.  The service could be a bit quicker, but that's really the only gripe I have about this place.  If I'm ever craving a meeting with General Tso again I'll happily venture out to the Sunset to meet him here..", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Really good and yummy food here. Been ordering from them for couple yrs already . The best Chinese food I ever had . The gentleman who works there (  host , manager , owner ) not sure - very nice guy and funny too. He always makes sure that his costumers are setisfied .", "author": "Tetyana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Went here with 4 friends - great place to do family style! I've lived in the city for 6 years, and this is one of the best places to get quality Chinese food. The eggplant is fantastic!", "author": "Nicolette L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "We placed a to-go order from Chang's of Won Ton soup, pork fried rice and the dry fried chicken wings. It was all pretty darn good - the chicken wings weren't spicy enough and weren't served with the chili peppers like they do across the street, but they were really well done! Everything else was tasty. I could order from Chang's again.", "author": "Alexander M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-18", "description": "I've been wanting to try this place for months, so I ordered pickup tonight for the first time, and the food was, no lie: disgusting. I'm honestly shocked at the five star reviews. It was BAD -- compared to any other junk-food Chinese delivery place (which I absolutely crave all the time), and certainly compared to real, authentic Chinese places. I only ate a few bites and I'm about to throw out the rest because I don't even want it sitting in my fridge.\n\nThe walnut prawns were just overwhelmed with greasy batter sweating with mayonnaise -- and cutting them open I realized the shrimp wasn't cleaned well. That essentially means that there was a line of shrimp sh*t in my food.\n\nThe \"tender veggies with garlic\" was my attempt at eating some greens. It's a really simple dish -- hard to mess up -- but the bok choy was watery and stringy with random hard pieces. Like, bok choy does not have seeds -- what was I biting into that was hard? Ew. For the record, Yummy Yummy across the street has \"seasonal veggies\", made with the same ingredients, and it's 100x better.\n\nThe fried rice was edible for a few bites. I'm sure some people would like it -- there's nothing horrible about it -- but nothing great about it, either. After a few bites I didn't want to look at it anymore.\n\nBut the biggest letdown was the CRAB RANGOON. This was the reason I ordered Chinese food tonight -- I was craving crab rangoon like nothing else. Theirs was flat, boring batter, liquidy cream cheese with a celery aftertaste and chunks of really bad imitation crab. You can't understand how sad I feel right now.\n\nMy advice: get delivery from Emmy's if you want your greasy fried rice and crab rangoon fix. It's the best guilty-pleasure Chinese I've found in the city. Go to Yummy Yummy for great, garlicky vegetables (and a lot of other great stuff). Go to Burma Superstar for delicious honey walnut shrimp. And for any other Chinese dish, go ANYWHERE ELSE other than here.", "author": "Laura W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "The Walnut Shrimp, Combonation Fried Rice, and the Hot and Spicy Tofu is a must eat! This place is simply amazing. If your near this restaurant, well what are you waiting for go! This place has good yet inexpensive food! I love it! It's delivery is also very fast and the food is always fresh. The deliver also has a great attitude and is an amiable person. This place is highly recommended!", "author": "Bruce N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "When I entered they immediately offered me a menu. I was surprised to see how affordable many of their dishes are. They have lunch specials which is awesome! \n\nI came in knowing I was going to order  General Tso chicken. It comes with white rice and an egg roll. The server was kind and patient with me while I asked her questions about the meal. She gave me a starter which was a small bowl of Sour Soup. It was delicious! Warm and flavorful! Also a teapot of tea. Tasted light and herbal which was great!\n\nMy meal arrived quickly but then again there were only a few tables so not sure how it would be if they were busier. \n\nMy main course was plated beautifully. Looked colorful and appetizing. \n\nThe General Tso chicken is some of the best I've ever had. White Rice was cooked nicely. Not super soft but not super hard. The little baby eggroll was good. Tasted differently then your typical eggrolls. \n\nOverall amazing experience! I recommend it! \n\nRecommendation\n- Play Soft Music to enhance dine in experience.", "author": "Andrea R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Crazy to see how inconsistent reviews are for this place, but it might mean that they do certain things well and others terribly.  \n\nI've ordered Chang's delivery 3 times now and we typically order the standard Chinese meat-laden order - Sweet and Sour Chicken, General Tso's Chicken, Steamed Pork Buns, and every single item we've ordered is the best of any Chinese food place we've ever had.  We're not snooty foodies though.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-25", "description": "Unfortunately, the dinner gave our family bad indigestion. Also the chicken wings had a strong granulated sugar taste.", "author": "Fred H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-16", "description": "The dry fried chicken is tasty. So maybe the westernized dishes are good. The non-westernized dishes are not very authentic; you can get actually authentic food in the neighborhood for cheaper.", "author": "Keito U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "Great Food.\nMASSIVE flavors.\nGood Portions.\nVery Spacious!!\nHuge serine Clean Restrooms.\nFriendly Staff.\nSpeedy service.\nGreat environment.\nBest part-No lines!!:)", "author": "Hung L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-11", "description": "Ordered delivery: Sweet & Sour chicken and General Tsao's Chicken with steamed rice.  The taste of the sauce was very good, but it seemed to be mostly breading I was eating and not much chicken at all which is not very appetizing. Not sure I'll order from here again for a while, and if I do, it will probably be for noodles or rice only.", "author": "Mr. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Delicious food, funny waiter, excellent service. I love Chang's--it's become my go to place for Chinese takeout in the Sunset. The deep fried chicken wings are AMAZING--definitely give them a try!", "author": "Daphne W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "This is a SF hidden gem. If I could give 6 stars, I would. The man that waited on us made our night so fun and was so accommodating. The won tons in hot chili sauce are a must! We will definitely be back.", "author": "Jess Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "This place has the dubious distinction of being directly across from one of the more famous Chinese places in the area, San Tung (and San Tung 2). You might think that this would set you up for disappointment, but on the contrary we were pleasantly surprised. We went with a friend of mine who has several young kids, and they were very accommodating (a big plus). Not only that, but when they found out the middle kid was having a birthday in a few days they somehow produced a stuffed animal toy as a gift for her. Who knew?\n\nAs for the food, I thought it was quite good. I went for the general Tso chicken while my wife had one of the eggplant clay pots. Both were very good and flavorful. We also had one of the dim sum samplers, and all of those items were good as well. \n\nOverall, we had a great experience here and will be happy to come back.", "author": "Brent W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "Love Chang's Kitchen! We go all the time, they remember us, and the food is always delicious. Totally recommend, especially since it's right across from a great, but often crazy busy (and more expensive) alternative.", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "I live nearby. I love coming here because the staff is so friendly! They always welcome me with a warm smile and get everything right the first time. The food is great and I will be a lifetime customer! The food here is nothing short of fabulous!", "author": "Tony P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Tonight I had the greatest experience at Chang's Kitchen. I did not want to wait at the restaurant across the street, so I took a chance on Chang's, which had no wait.\nI ordered the Wonton with Chili Sauce as an appetizer,  and they were excellent, but not fancy. I then had the Shreaded Pork w/ Bean Sauce, which was PERFECT!  I can't wait to go back-maybe tomorrow night.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "I only order delivery from this place.  Food is really good!  The sizzling rice soup is excellent - a ton of vegetables, tender chicken, and water chestnuts !!!  I've also ordered the salt and pepper wings -  so good. I ordered 8 orders for poker night.  Everyone raved about them.", "author": "Anna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "Amazing Chinese food. I ordered the orange chicken and Vegetable Chow Mein to go. They were super quick. Big portions! Definitely will be back.", "author": "Jamie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "Surprisingly good!\nAt a popular location, was going around there for lunch, happy to find a seat without waiting. The food was nice, steamy hot, tasty but not overwhelming,  a lot of places want to pack so much flavor in their food would make it too salty, no good for the health conscious bunch. We ordered the pan fried noodles, dumplings and the fried chicken wings and they were nicely made just right.\nEven better, its price is more reaonable, can't beat the value.\nWill definitely go back.", "author": "Bill C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "Initially our group had planned to go to San Tung after a very nice day at the Golden Gate Park but due to the very long wait I did what every other yelpers do and rely on YELP to save the day haha. Seated almost immediately we walked in and ohhh my goshhhhh was the food GREAT, I kid you not all entrees ordered were very tasty! Be sure to order the Honey Walnut PRAWNS they are amazeballs, and for $11 *winning* food items came out fairly quick, fresh AND hot *double winning*\n\nNot to mention the service was great, we were welcomed and served by the owners themselves now that's something you don't see often. Being that we were a fairly large group the hospitality was as if we were just 2. They were very accomodating responding to our requests and needs. They were awesome and hilarious. Great atmosphere!!!!\n\nDefinitely returning on our next visit.", "author": "Jackie Lyn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-23", "description": "Best Chinese Food in the Inner Sunset! The walnut prawns are phenomenal! Excellent service...clean. Haven't ever had a dish I didn't like.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "General Tso's Chicken is delicious and nice that it gives you an option to choose your spice level. +++Free Crab Rangoon, are you kidding me? So good.", "author": "Reilly W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "Omg! I came all the way down from bay shore to here is to eat there Dried fried chicken wings ! It's crispy and I really like the sweet and sour taste! Not like the traditional sweet and sour taste like General chicken. Highly suggest the hot and sour soup it's a amazing combination with tofu egg and veggies. The waitress are nice and especially they serve quite fast.", "author": "Ann H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-01", "description": "What a disaster. \n\nWalked in around 9pm on a weeknight and was seated by an older chinese gentleman who was actually really nice. The pleasant experience ended there.\n\nOrdered Shu Mai and Har Gow and after eating a couple, I noticed that they weren't really very warm. I cut open the dim sum pieces and found that both the Shu Mai and the Har Gow were still raw! NASTY. The shrimp wasn't even slightly pink, it was straight up black and white still. \n\nIn a few hours I'll find out if I end up sick, but I can tell you I am never coming back here.\n\nEven worse, when I asked for the check to get out of there, they tried to charge me for half of the meal that I had already eaten.. what a joke. Of course, I wasn't having that so in the end they ended up not charging me. \n\nWhat a shame. I had high hopes for this place. But raw Har Gow AND Shu Mai; thats a double screw up. Don't come here unless you want to get sick.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-02", "description": "Hong Kong ABC here, if you're Chinese, not the place for authentic specific food. Came here with the parent and my dad said \"they do Cantonese, shanghainese, and sichuan\" which usually indicates not specializing in one. If you don't know, then this review shouldn't matter. If you do then this is all you need to read. \n\nThe main crux of this place is if you're looking for \"a Chinese takeout\" place as an American, this will do the trick and you shouldn't be too concerned of this rating. Then again you're in SF... so you should do better.\n\nOn second look, the other reviews are mostly from non-asians. \n\nLook at the highlights: general tso's, etc, you know what you're getting. More American tastes should be fine with this place.", "author": "Byron C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-07", "description": "Best Chinese food in the Sunset. Please tell me if there is better? Chinese food is one of my favorite foods and it took me awhile to find a decent Chinese restaurant. Even though the sunset is the real China town? I order delivery from here once a week. I have never gotten sick. The meats and seafoods are decent quality. Better than most in the sunset. Service is great. If you have any problem with their food just tell them and they will accommodate you.\n\nWHAT To ORDER\n\nFried won tons\nSweet and sour chicken or pork\nGeneral tso chicken\nSesame chicken\nKung pao chicken\nCombination wonton soup\nBBQ pork chow mein (light oil) add green onion\nLemon chicken\nFried rice (any combo is great)\nWalnut Prawns", "author": "Roman J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "I. Love. This. Place. \n\nThe General Tso's is amazing, the crab wontons are amazing, the Chinese broccoli is amazing. Everything is amazing. \n\nBut most importantly- the people! It might sound weird to call a Chinese restaurant a home away from home but when you're working and living in the city it's a reality. The owners are so kind. They are hilarious, hardworking and always offer service with a smile. They even let me turn on jeopardy if I'm here at 7. \n\nIt's easy to want to draw comparisons to San Tung- but this place is light years ahead. Save the long lines and rushed service for the tourists.", "author": "Kyleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-12", "description": "We went to San Francisco on New Year's Day with our family friend Sophie's hiking club. Our group was deciding where to go for lunch when we passed Chang's Kitchen. Sophie and her husband happen to have the surname of Chang, so I jokingly suggested that we should eat at \"their\" restaurant. The funny thing is that we actually ended up eating here as it was one of the few nicer-looking eateries that was open on New Year's Day.\n\nThe first thing I noticed was that the menu had a huge selection of items. I didn't do an exact count, but I estimate there were well over 150 dishes. The prices were also pretty attractive, with many of the entrées being in the sub-$10 range. Even the daily specials were relatively cheap.\n\nThe food itself was pretty good. Per family tradition, each of us ordered different dishes to share; the salmon fried rice was my personal favorite, but everything else was also delicious. Although Mom noted the salmon in the fried rice was slightly overcooked, and that the food made her thirsty for some time, the three of us overall enjoyed everything.\n\nThe interior of Chang's Kitchen is pretty small, and our group easily took up two-fifths of the tables. The restaurant was mostly empty when we arrived, but it did become a little crowded when more people started showing up. But other than the limited seating and the saltiness of some of the food, I have no real complaints.\n\n-- TL;DR version --\n\nHighs: Huge menu selection; great prices\nLows: Somewhat crowded interior; food is somewhat thirst-inducing\nFinal verdict: Chang's Kitchen offers a huge variety of good Chinese food at extremely affordable prices.\nBottom line: 4.1 stars (rounded down to four)", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "There orange chicken is to die for!!!!!!! And i am SOOOOOO PICKYY with chinese food. Its a little spicy and i hate spicy food but this chicken had me drooling for days!", "author": "Keyla C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "I ordered delivery from them. I had the vegan General Tso chicken and my boyfriend had the regular General Tso chicken and they were both really good. I think this will be my new go to delivery place!", "author": "Lori L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-11", "description": "Well we tried to go to San Tung, but so long of a wait. Decided to try this restaurant since it was across the street. Reason we were going to try San Tung because we hear folks rave about their Dried Fried Chicken wings. Well we ordered them here aand my daughter stated they are just as goid. So folks why wait for hours for San Tung because the food is just as good!. This restaurant is clean and service is good.", "author": "Nancy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "Food was amazing. Service was amazing. I would eat here over San Tung any day! Definitely a quick and delicious go-to place in the sunset.", "author": "janet r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "Really tasty. Ordered on eat24 and it came in less than 20 min and the food was too hot to eat immodestly. But it was delicious. And for the cost you get lots of food. Enough for left overs!\n\nGot the general tso's chicken - got it medium. It was spicy and Delish. Nice crunch to it. The sauce was amazing. I loved this. My only gripe is there was very little veggies. Less than 10 pieces and most were green peppers.\n\nAlso got Mongolian beef. The sauce on this was also really tasty. Medium spice. Less spicy than General tso's. But yummy! A little too many onions but the beef was well seasoned and tender. \n\nAsked for chopsticks and some extra sauces on my order and didn't get them. But that's ok. It was all good. Definitely will return.", "author": "Beth E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Fantastic Chinese food. And they deliver. I would stack this up against San Tung, given it's so much easier to actually get food without long wait times.", "author": "Anil C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-08", "description": "Ordered food delivery via Eat24 and food arrived literally within 20 minutes. Makes me kinda wonder why so fast....\nI ordered:\n\nSpinach w garlic - meh! it was a good portion size. I took about 2 bites out of it and that was it. \n\nShrimp and scallops w two kinds of mushroom- The mushrooms tasted kinda funky...it had a bitter taste to it. It's kinda like eating  some week old food that's been marinating in old sauce that was left out of the hot kitchen for some time. Bottom line- it tasted OLD and FONKAY (not funky but FONKAY)\n\nChicken corn soup- bland...no taste.....where's the corn? it looked like someone put in two cups of water and half an egg. Down the drain it went. \n\nSorry Chang's Kitchen, but you guys gotta step it up a couple of notches if you want to have more business. \n\nI should've gone down to Subway and saved my $26 dollars... damn!", "author": "Annette F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-15", "description": "We ordered delivery last night. Everything was just ok. The BBQ pork chowmein was oily, the lemongrass and green bean chicken lacked any flavor and the sauce was broken and thick. Overall not awful, but definitely won't order again. There are so many other spots to choose from.", "author": "Eileen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "The Chinese Broccoli Beef was excellent! Honey Walnut Shrimp mouth watering and the Vegetable Chow Mein hit the spot. Halibut with Tender Veges (choi sum) was very good too. Our pick up order was late but all was forgiven when we had a taste of that yummy goodness.", "author": "Marie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "Wow happy I came across this all because of their flyer! Fresh, convenient and inexpensive! 1/2 duck, mongolian beef, wonton soup, snow peas chicken, pork fried rice, spicy string beans all for $57! \n\nGreat friendly service and no wait! My family will be back!", "author": "Morning S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-27", "description": "Bland. Not bad just flavorless the salt and pepper prawn was just battered with no seasoning. The beef chow mein literally could have been bare spaghetti noodles and the generals chicken was greasy and uninteresting. The dim sum was good got the sampler.", "author": "J R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "I found a place with better dry-fried wings than San Tung! There, I said it. These are better. Great food all around. Great prices and exceptional, friendly service. \n\nWe will be back!", "author": "Dave S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "Excellent Chinese food. Just as good as San Tung down the street. If you want San Tung style quality without having to wait an hour for a table, then Chang's Kitchen is your best bet. \n\nThe dry fried chicken is very good, just like San Tung. Great rice, great dim sum, excellent egg rolls too. Love the Honey walnut prawns. \n\nPrices are good, comparable to San Tung. Try it!", "author": "Helen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "Sunset district residents rejoice!  It's no longer necessary to travel to the Richmond or Chinatown for good Chinese food.  That's right, we now have an honest-to-Buddha Chinese restaurant in a neighborhood formerly dominated by San Tung but otherwise devoid of a good Chinese restaurant.  While the food here may not be \"to die for\" (who would want that, anyway?), these folks definitely know how to cook.  The service is efficient and friendly, and the portions are generous.  Recommended!", "author": "Richard A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-27", "description": "I usually don't really write reviews or I don't want to leave any bad reviews.. but this one I needed to. \n\nI ordered Eggplant with Garlic Sauce and Walnut Prawns. The food came in 40 mins which was okay. \n\nPrawns were okay, but too creamy. And the lettuce under the prawns was really old and all brown. It tasted really bad too. If I saw that before I ate some prawns, I would've called the restaurant and returned my food. \n\nAnd I'm usually a big fan of eggplant with garlic sauce from any Chinese restaurants and I've tried from various places but this eggplant dish tasted really weird. And it was very oily and soupy. Not saucy. I couldn't have more than few bites. It's maybe just more traditional or a different type of Chinese food. I still have that weird oil or vegetable taste left in my mouth. I can't even say if it was good or bad because it was impossible for me to eat. \n\nThe delivery service and portion was fine.", "author": "Seul K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "Happened to come upon this place looking for dinner. My boyfriend and I weren't really in the mood for anything in particular, so we decided to stop here since it was the first place we passed after parking. Everything was great! We got Kung pao shrimp, general chicken, salt and pepper chicken wings, and steamed rice. The portions were generous and the flavors of everything were exactly what we wanted!\nMost importantly, the service was fantastic. There were two gentlemen tending to the dining room and they were both so attentive and nice. It can be hard finding good service around here so it was so refreshing and very appreciated. \nWe will definitely be going back there many times, especially for the salt and pepper wings!", "author": "Karissa Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-14", "description": "Yuck. Yelp let me down. Because of lots of other high reviews, I got the Walnut Shrimp which was mushy and tasted basically like breaded shrimp drowned in globs of sweet mayo (with about 5 walnuts thrown in. To be fair, I got delivery. Hopefully it's better fresh out of the kitchen, but I wouldn't try it again. The bbq pork fried rice - while, as others mentioned - was not greasy, it also was not flavorful in the least.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "Liked the menu that they had on Eat 24 and gave this place a try. \n\nFast delivery (35-40 minutes when they said 60) and the food was GREAT. Had the Szechuan (hot) family menu for 2 ($25). Hot and sour soup, chili oil won ton, Kung Pao chicken, Mongolian beef and fried rice (had shrimp and scallops in it). All cooked to perfection, not too hot and LOTS of food. Could feed 4 easily. \n\nEnough for 4 or two nights of dinner... Check it out.", "author": "Debbie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "You say you want good Chinese Delivery - then look no further - this has become our go to spot for sure and we prob order at least 1x per week from here and have been rarely disappointed!! - now, this sits across street from Sun Tang, famous for their dry fried chick wings (rightly so - they are amazing!!) - BUT, Chang's does their own DF Chicken wings which are OUTSTANDING - great sauce on top of perefectly cooked and crispy chicken wings - if you like ST, you'll like these a lot - not to be confused with the appetizer salt & pepper wings, which are good, but I'd like to see them use the same prep on the SP wings as the DF wings sans sauce...anyway, another staple - chicken corn soup - you want comfort in a hot, piping bowl of viscous, egg white, asian rift on chicken soup - then here ya go!!! - rest of menu is all pretty standard, but they do give you brown rice options on all fried rices, which is really nice!!", "author": "Richard D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "Honestly one of the best Chinese places in the city and certainly the nicest owner/waiter.", "author": "Markus S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "The best Chinese food i ever had I was so surprise they deliver so fast and hot and driver was so nice I highly recommend mongolian beef chicken wing and walnut prawn their pice are so cheap and the package is so good not a sauce drip", "author": "Mia Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "My new takeout fav. Satisfies my Yang Chow cravings by not skimping on the tasty bits!", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-22", "description": "I've not eaten enough dishes here to give it a better review, but we ordered Chinese delivery for the first time ever and by surprise, dinner was very satisfying. Finally, a good restaurant very close to home that delivers. Delivery was on time, food was cheap and of course, salty - specifically what I was craving that night. There is nothing healthy about Chinese take-out EVER. So this is only a good idea for those bad days.", "author": "Thao T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-22", "description": "We just ordered two dishes (mapo tofu and Korean BBQ) and I have to say it was the worst I've ever had!  I have no idea how this place has gotten four stars!", "author": "Mitra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "This place is great. San Tung is right across the street and is always super busy but this place is just as good. Dry fried chicken wings and eggplant with garlic sauce are both excellent. And the twice cooked pork is the best I've had in SF.", "author": "Duncan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "We came here because San Tung was too packed and we were really hungry. Food was good, fast, hot and reminded me of home in Rowland Heights, lol. The service was really good too. Our server was patient with our group of 7.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-13", "description": "The lunch specials are an excellent deal and they deliver them. The items were hot and miss. Very low quality meat - like the beef had a weird consistency. Hated the cloyingly sweet mango beef. Shrimp and salmon dishes were better, especially the one with scrambled eggs. Also, ordered delivery online and explicitly asked for a 12:15 delivery and they brought it at 11:20.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "Really good Chinese!  Very large portions, quick service, funny waiter, great food, reasonable prices.  What more could you ask for?  The 3 of us had the Chef Special Salmon fried rice, the mock chicken moo shoo and a dish with prawns, scallops and mushrooms.  All were excellent and plenty to take home for another meal of left-overs. Probably the best fried rice we ever had.", "author": "Marc V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "Second time I get to-go here and they are so funny. Really nice customer service, and the food is good!! Thought about getting some food at sung tung, but there was a long line, so we went across the street and got our yummy food in 10 mins.\n\nPhenomenal: lemon chicken, dry fried chicken wings, Mongolian beef. Pretty big portions and I can eat a lot! Enough for a couple to share with two orders of steamed rice and be super full. Also, free range chicken! \n\nOwner is the nicest man ever, and it's nice to just even be Acknowledged  than when they don't even look at you when they talk to you at Sung Tung.", "author": "Anna B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-21", "description": "The food here is OK. A lot better than I would've expected seeing as how there are always super empty inside. Right across the street from Santungs so they really do have to keep up with the competition. They have Drive fried chicken on the menu as well but it is not nearly the same, do not order Dry fried chicken here if you're craving Santungs, it's completely different mine turned out to be like sesame chicken soggy and sauced up. The honey walnut shrimp was good, still not as good as across the street. The only thing I could ever really crave from there is the sweet-and-sour chicken which was better than OK but definitely not the best. Delivery is fast can't complain about that!!", "author": "Natasha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "This place is awesome and the wait staff are super friendly! Especially Lou! They helped us host our red egg and ginger party for my daughter - I feel like I could not have picked a better venue for 40 people. Coordinating everything was super easy with Lou (who I think manages the place). The food was great and the price was right! Totally recommend this place for groups, parties, or just for a simple lunch or dinner :)", "author": "Ceanne H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-27", "description": "The waiters were too slow to react and never bothered to answer us and did their own thing.", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-11", "description": "Changs kitchen. \nIt's a really generic name, but the food there is awesome. We got noodles and sweet and sour pork and fried wontons and it was all pretty good. There was a very large group of us present and they were super accommodating. The food is awesome but what makes this place worth coming back is the awesome service. Will definitely be back.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "I love the dry fried chicken! I eat at Changs more than any other restaurant. I first ate at Chang's when it was called Golden Rice Bowl because San Tung's across the street was mean to my brother and me and I've never had to go back because i like Chang's food better and the people way better.", "author": "Anna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-15", "description": "I placed an order for delivery and my order was delivered in a timely manner, however when I opened the package the soup I had ordered had spilled all over the place causing a big mess and disappointment .\n Quality of the food is just ok.", "author": "Marilton D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "I've been ordering here for the longest time. This place used to be called Golden Rice Bowl, but now they changed it to Chang's Kitchen. The food still taste delicious and to be honest, even better than before! Customer service here is specaticular, and the waiters and waitresses are very friendly and helpful.\n\nI usually get the dry fried chicken wing, lemon chicken, and an order of chicken fried rice. The food is amazing and it is worth the price because they give you very big portions of food. Most of the time when I come here, I have a lot left over, so I usually take it home and finish it for lunch the next day. \n\nI also found out that they do deliveries. You can order from them online through Grubhub. The delivery is very fast and the delivery guy is very friendly! Definitely be sure to give Chang's Kitchen a try when you are in the neighborhood or just give them a call!", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-22", "description": "Came here from out of town looking for chinese food during my 30mins wait time before my hair cut appointment. I ordered shrimp fried rice to go, but since I have a little more time, I decided to sit down for another 5 min before walking back to the hair salon. The cashier person who took my order was having a bad attitude because I decided to sit down. Very bad customer services. I would not recommend this place.", "author": "The Critic C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-25", "description": "This is my first YELP review.  I've ordered delivery with the Uber Eats app from this restaurant on a few occasions, but my rating is for this particular meal.  As a vegetarian I appreciate their wide selection of vegetable dishes and faux meat entrees.  Although not outstanding, it is much appreciated.  However on this occasion I ordered the string beans with fried tofu.  It was the worst dish ever, and the sting beans were raw.  Not al dente, but raw, with no flavor whatsoever.  Steer clear of this dish.   I also ordered the chow fun with gravy rather than my usual dried chow fun.  Again, absolutely no flavor.  Really disappointed as the food is usually better.", "author": "Robert W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-31", "description": "Checked out this place because of the reviews and was devastatingly disappointed. Our waiter was extremely temperamental because he did not understand our order and when we explained it to him in both English and Chinese he got frustrated. Not surprisingly, our order still came out wrong. The xiao long bao skin was dry and the meat did not taste fresh. Their veggie dish with homemade fishball was too salty. \n\nTwo redeeming factors: the dried fried chicken wings were very good. Piping hot with a delicious sweet sauce. The older man who greeted us was very sweet and accommodating. However these two factors do not compensate for the negative aspects I've experienced while dining here. If I do return, I would only order the chicken wings TO GO.", "author": "Ilene L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "Ordered for delivery, we got the Korean BBQ ribs, honey walnut prawns and house fried rice. It was delicious and would definitely order from them again. Loved it!", "author": "Thanh V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "We just had our food delivered through Eat24 and it is absolutely delicious! Unfortunately I was at the store and my girlfriend didn't have much tip money (a measly 2.00) so I figured I would write a review. Also, we just found our new favorite chinese food! we ordered wonton soup, walnut shrimp, salt and pepper pork ribs, and egg rolls. Next time we will be sure to tip in a better manner. Sorry delivery guy! Also, these are fair sized portions. Not as big as I had wished but not small enough to complain.", "author": "Matt T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "This place has become my go to for Chinese delivery in the area.  Delivery is usually quick and they do a good job packaging. The food is actually better than the place across the street but don't tell that to the lemmings who like to wait in line for mediocre food. I do hope they survive since this location has never been able to make it work.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "I got the Mongolian beef with noodles, fried chicken wings, and crab ragoons for take-out. It served 4 people generously. Chose medium-spicy and had no spice at all, next time I'll choose hot. This place gives you A LOT of food! Great deal and tasted great too. Friendly service and it was warm and ready when I went to pick it up.", "author": "Katie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Good was sooo good!! Being from the sunset and coming back to visit this is prob the best I've had in years. Fresh tasting. The lemon chicken is a must!! \n\nService was alright. Poor guy seemed overwhelmed but was friendly enough.. Don't let that scare you.. It's a must try!!", "author": "Destiny O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "Delicious hot and sour soup delivered. Showed up in the time allotted, piping hot, and could include tip with the online payment so it wasn't a problem that I was out of cash. Great to have this option in the neighborhood", "author": "Gigi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-23", "description": "We got delivery. The pork fried rice was awesome and the sautéed green beans were a massive highlight. The sweet and sour pork was one of the best sweet and sour pork a I've ever had. The delivery was super fast and the food was really good! Highly recommend!", "author": "Jacob B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-13", "description": "This place had a re decoration and name change. Same people. Very friendly and helpful but the food is mediocre to bad Ordered takeout. Walnut prawns. Very decent good sized and flavorful. \nBlack bean shrimp. \nCounted 6 small shrimp in order  sauce was generic and bad. Very disappointed.\n Seafood chow fun. Seemed to be same sauce as black bean shrimp\nThis may have been an off night but this meal was not worth the price", "author": "Lambchop B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "Kind of typical Chinese food. Good flavor. Actually seems a bit less greasy and unhealthy than other Chinese restaurants I've been to.", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "Being opposite of Santung... It's not easy for Changs kitchen. However, they've been consistently outstanding in terms of the food quality, portions, and price. I know people can be put off by the mostly half empty restaurant. But compare to waiting 2 hours at Santung, I'd gladly patronize this joint. Their takeout is great too!", "author": "Davis W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "My favorite Chinese food spot in San Francisco. They have delicious dry fried chicken wings and everything else is great too!! They have excellent service and are very nice! Would definitely keep going here and recommend it to everyone!", "author": "Yolanda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "Dry fried wings prepared in the same manner as San Tung across the street. Quality is nearly as good if not just as good, but without any wait. Rest of the menu items are solid too. I have yet to be disappointed by anything I've ordered here, and the staff is extremely friendly!", "author": "Matt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "We were originally planning to go to Yummy Yummy and there was a wait.  I went on yelp and saw that it has a 4 star and decided to give it a try.  Very good food and service.  Things we ordered\n\nhouse special chow mein - very good\nphoenix and eggplant - very good\nstir fry pea sprouts - good\nwestlake beef soup - very good\n\nWe will definitely come again.", "author": "AB H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "We stopped by today for lunch, the customer service was great and so was the food. We kept it simple dim sum, hot and sour soup and a main dish. What I liked the most was the food had a lot of flavor and very little to no grease.  We will be back.", "author": "Susan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-29", "description": "Do not order anything involving dough: potstickers, steamed buns, mu shu pancakes, etc. The wrappers are very thick and doughy.\n\nOther than that, all I tried was mu shu chicken. Chicken was sparse. The vegetables were crudely chopped. There was an unusual lack of egg. It was very oily.\n\nI would say the Golden Bowl formerly in this location was better, and it was mediocre. Wait in line at San Tung instead.", "author": "Crabcakes C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-27", "description": "The service is really bad.. Food isn't that good either, do not order the beef noodle soup", "author": "Joshua L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-12", "description": "There is no quality control both in cooking and servicing.\nWe ordered some fish. It was wrapped in msg and we couldn't taste the fish.\nAnd the bok choy was bitter.\nThe service was bad also even though it was not that busy.", "author": "andy s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Finally a Chinese restaurant where the people actually have some personality. They are attentive, they Smile, and it feels genuine. Oh and the food is good. Everything is as good or better than the place across the street and no lines. Try this place.", "author": "H L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-05", "description": "Hot and sour soup was tasty.. Pork dumplings were juicy.. Dry fried chicken wings were ok.. Wait staffs were very friendly.  An alternative when you dont wait an hour at San Tung.", "author": "Eva L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-09", "description": "Their chicken wings are NOT like San Tung's. They were soggy, over-sauced, and did not have much flavor. We also ordered the mongolian beef chow mien which was drenched in spices and had a crunch due to the overload of spices added. The flavor was terrible and we ended up having to throw them out. This place does have better food here, but definitely not what we ordered today.", "author": "Amelia E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-28", "description": "We used to order from Golden Rice Bowl at least once a month. When they changed over to Chang's Kitchen, you could tell things were different. The food is less flavorful than it was before, the soup and potstickers are completely disappointing. At first we thought it was a fluke, but now know it's something different. A completely different restaurant!", "author": "Domenique B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Delicious, low cost $!!! Staff is friendly atmosphere is nice, clean. Give this place a ten!", "author": "Marisa L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-05", "description": "Rice bowl was decent Chinese but I don t know if they got a new chef for Changs but the food is really substandard. Walnut prawns were greasy and tasted old. I was not happy and will not use them again", "author": "Lamb C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "I had one of their flyers on my door and usually won't order full take out without at least checking the place out in person first.  However, my go-to place wasn't open yet and the overall Yelp reviews seemed positive.  \n\nSo I ordered pretty standard stuff:  Broccoli beef, sweet and sour pork, bbq pork chow mein, snow peas with water chestnuts and the General's chicken.  With tax and tip it came to $50.  I was told it would take from 30-45 minutes for delivery.  They arrive in less than 30, which was great, but I was waiting on people and the 45 minute time frame would have worked out better.\n\nAll of the dishes were excellent.  The vegetables were crunchy and the sauces were flavorful.  The only complaint is with the snow peas with water chestnuts.  It was more like chopped celery with a few snow peas thrown in.\n\nThe best part is that after eating I didn't get really thirsty, which is usually a tell tale sign of MSG, right?  The flyer had coupons for a free item, which I didn't use because I wasn't sure of the quality of the food.  It also had a stamp card on the back, which, again, I didn't use.  Maybe next time.  And there will be a next time!", "author": "Kim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-09", "description": "Originally came to the area for San Tung, but was discouraged by the line. Chang's was a pleasant surprise! The best aspect of this restaurant is absolutely the service. I'm gluten free and have major food allergies, so Chinese restaurants are usually a no-go zone for me. However, the manager of the restaurant went out of his way to accommodate my situation. I was able to order a customized dish and they allowed me to pick exactly what went into my food. I was absolutely floored by their attentiveness and highly recommend this place for anyone who wants the experience of a Chinese restaurant without the typical brusque service that accompanies it.", "author": "Addison Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-03", "description": "The dumplings were not edible and the chowfun was tasteless and very greasy. This was an extremely disappointing meal.", "author": "Linda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "The food here is delicious. I originally walked over to grab food at Sam Tung across the street but they were closed from 3-5pm, so I ducked into Chang's for a quick bite instead. Had the Mongolian beef (spicy) and the green onion pancake. Both were delicious and authentic. Not to mention, the service was wonderful.", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-15", "description": "I ordered orange chicken, vegetable chow mein and chicken chow fun. Right after I had orange chicken my stomach was feeling weird and half an hour later, I was feeling sick and I threw up. I strongly recommend not ordering from here.", "author": "Daiya M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-26", "description": "EXTREMELY salty, and I generally like salty food. My meat was gross- it didn't taste real at all and pretty much dissolved in the sauce. No taste. I ordered the Mongolian beef, Kung Pao chicken, chicken fried rice, and egg rolls- pretty standard and popular dishes that shouldn't be too hard to make. Not sure why this has four stars.", "author": "Sara C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-05", "description": "Not enough chicken in the General Tso's Chicken; too much breading, too many phantom pieces (all flour, no chicken).", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-28", "description": "Came here with my family and had their chicken wings, hot and sour soup, fried rice, green beans, spicy beef and eggplant. Three out of four of us came down with severe food poisoning that started 2 hours after we ate and my sickness has lasted six days. At first I thought It was too much MSG but the pains got worse and I was bed ridden and exhausted. This was the only meal we ate together that day with the same food. Mine was the worst and I ate more of the eggplant. My son is the only one who didn't get sick and he also didn't eat as much or touch the eggplant. It was a terrible experience. This is very concerning if your young children can get seriously ill. I read a few more reviews here that stated others got food poisoning also so I don't think it's just my problem. Be aware of this place.", "author": "Bay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "My favorite Chinese delivery spot. Have ordered from them multiple times and they never disappoint. Just had the Szechuan fish fillet and it's amazing - definitely ordering again.", "author": "Matt F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "This is the best Chinese restaurant ever!! My family was Hungary for some Chinese food. We ordered online and the delivery came every fast. We were so happy the food was out of this world. We order General chicken, Mongolian beef, walnut prawn, and spring roll. We highly recommend this restaurant. The deliver was very friendly and nice.", "author": "Andy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "I don't eat here as often I used too but the happy go lucky server, I don't know his name is always a joy to see. I used to work at St. Anne's and always ordered pick up for lunch from the previous restaurant. He's always very nice and jones around. I had lunch there today with my sister and nieces. Food was good and environment quiet. We didn't feel rushed like if we're ate at San Tung across the street. Even though it's not a popular restaurant, the food is good and service was great.", "author": "Judy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-09", "description": "I have gotten delivery from this place three times and ordered out once and i have not been disappointed yet :). Great hot and sour soup, mu shu, and mongolian beef! Portions are great, and prices very reasonable.  I am surprised this place does not have more reviews.", "author": "minnie l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-15", "description": "Those who say this place has better dry fried chicken wings than San Tung are just too lazy to wait in line across the street. It didn't quite have the balance of sweet / spicy / sticky that San Tung has, but admittedly it still hit the spot. Ordered it take out,  along with the beef chow fun. Come here if you want something much cheaper and filling.  Food was ready much earlier than anticipated,  and it was still steaming hot when I opened it up at home.  Overall,  I recommend.", "author": "Ronald T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "Being overshadowed by it's cousin San Tung, Chang's food is really good WITHOUT THE WAIT! I've been coming here for awhile and have yet to be disappointed.", "author": "Justin E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-26", "description": "I tried to order from my regular delivery spot but they  were on vacation so I tried Chang's Kitchen again because they are close.  Food arrived quickly.  The first chicken/veggie dish was ok, but lacking in spices.  It was bland and even though I could see lots of what looked like garlic, I couldn't taste it.  The second dish was pork with garlic sauce.  What this looked like was just a big container of stir fried onions with very little pork.  The sauce was like a watered down sweet and sour sauce.  The rice was just fine", "author": "Dennis M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "This place is so great! They changed their name from Golden Rice Bowl to Chang's \nkitchen which surprised me a bit but they still have the same quality service as they did before. I love ordering the sesame chicken and the walnut prawns, they are so good! The customer service is great (especially Lou!) and the owners are very friendly. Stop by, you won't regret it!", "author": "Tidani B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "This is our family's go to Chinese restaurant. We order pot stickers, Chinese broccoli with garlic, a chow mein, and the Beijing chicken most commonly. The food is well made, delivered quickly and reliably, and I love the ease of ordering through Yelp. Changs is an improvement in good quality over other restaurants at this address and we are fans for their delivery service. Recommended!", "author": "Scott D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-28", "description": "OH MAN, practically inedible. My boyfriend wouldn't even eat it... (and he typically eats the majority of Chinese and leftovers). It just tasted wrong-especially the veggies. It's almost like they had soaked the veggies in putrid water prior to cooking, and they DEFINITELY kept that flavor. I'm so very disappointed. DON'T DO IT.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "This is one of my regular spots for casual Chinese food. Easy to order to go or dine-in and they have a great lunch menu. Servers are nice and food is served fast, which is great when you're on the go. Portions are a good size too. Some of my favorites are broccoli beef, general tsao's chicken, egg drop soup, fish with sweet corn and their veggie dishes with tofu and mushrooms.", "author": "Jenn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "Amazing place!! All the dishes are well serve! Super tasty! Came for dinner with my sister and order a family dinner special for 12.95 per person! Don't have no regrets!!", "author": "Jose L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "This place is incredible!! No reason to wait in the line across the street. The service here is so wonderful they're all so sweet and helpful and the food oh my god it's divine. The veggie potstickers were flavorful and delicious, the wonton soup was a beautiful classic and yummy and the combo chow mein hong kong style noodle was one of the best i've ever had. Thank you for the great experience Chang's!!", "author": "Blake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "Cheap, quick, kind, and much less stressful than San Tung. basic good American-style Chinese food. 10/10 would eat there again.", "author": "Eli F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-29", "description": "Wow, these people are the worst.  Total bait and switch!  Beware if you are ordering takeout or delivery.  What the menu says and what they charge are not the same. By hear people add extra on their items and then offer you a free item to make up for the next time.  My order should have been $40 and they charged me $48.  A little here a lot there.  I asked for an itemized receipt which they did not send.  They texted me the amounts they charged after the fact and I was horrified to see nothing on the menu was what they charged.  They made excuses for everything and wound up offering me a free item next time.  After I said I would report them they said they would credit me.  This only happened because I complained.  Don't order take out unless you go over every item before and also once you get your order.", "author": "sonaz k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-29", "description": "Buyer beware!!!!  These people are criminals, their menu says one thing they charge something entirely different.  Combination chow mien $7.95 invoice price $12.20  $4+ more. Broccoli chicken 8.95, price charged to me $11.50. They have done this before and I gave them the benefit of doubt.  Last year their delivery guy gave himself a tip without my consent. The food is ok but unfortunately they are thieves!", "author": "Sheila N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-20", "description": "Found a hair in my food, restaurant did not want to refund me unless I brought back uneaten portion. Rediculous", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "I always order for delivery at work with my co workers. Love their hot and spicy soup, chicken&corn soup, and dim sum is good too. So far i will be a returning costumer for sure!", "author": "Nart T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "Awesome food that unfortunately lives in the shadow of san tung...totally undeservingly. They are super nice.food is great.portions are huge. We tried delivery and they took 26 min from order to our door in outer sunset. Awesome :)", "author": "Stefan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Finally, I love a restaurant in my neighborhood! The host is super friendly and greets you with a plate of won ton chips. Imagine: feeling welcome in a Chinese restaurant. The chow fun is really good! Excellent and generous portion of spinach with tofu.  We will be going back and soon will be regulars. It's nice sitting down at a nice table with friendly service and watching the madness across the street at San Tung.", "author": "Roxanne M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-09", "description": "the most rude employees never will i ever order from them again. called to tell them they forgot part of my order and they didn't care. disappointment", "author": "Caroline D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Exquisite Chinese cuisine. We ordered the Canton Dinner for 2. It consisted of BBQ pork fried rice, broccoli beef, orange chicken and egg rolls + chive and shrimp dumpling. Everything was absolutely amazing and full of flavor. I would recommend it if you're hungry because their servings are generous. Furthermore their ambiance was peaceful and calm compared to other restaurants during dinner.", "author": "Javier P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-26", "description": "One night I was craving for chicken wings but did not want to go to San Tung's since it was worst terrible, experience with San Tung's service and food a few month ago. I decided to give restaurant across the street a try since I was already in the neighborhood.  Wonderful surprise, awesome chicken wings, better than San Tung's. Their noodles were delicious and so was the dumplings. Best service and no San Tung attitude!", "author": "Mit T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "Great food and generous portions at reasonable prices. Try the dry fire chicken wing,garlic eggplant, walnut prawns! Delicious!", "author": "Mia Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "Such tasty food and good service. The food is very flavorful and spicy dishes are both spicy AND savory. They don't let salt or chilies dominate the whole dish. We will be back!", "author": "Athena A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-02", "description": "Delivery took 1 hr and 22 minutes. Every single dish that we ordered was disgusting and extremely greasy. One of the rare times I want to throw everything out. I would rather eat cereal.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-28", "description": "Orange Chicken was soggy, yet too spicy for my daughter. Only occasional orange flavor observed. The Kung Pao Chicken had no flavor ! When I ordered from this restaurant, I didn't realize that it was that empty restaurant across the street from San Tung.", "author": "Steven A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "I love their food! The owner recommended me some of their famous dishes. I ordered the wings, fishball with veggies and other food. I would come back again to eat.", "author": "Kevin D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "I give this place 3 and 1/2 stars.  The food was fresh, and portions impressive.  We ordered for delivery and didn't have to wait very long.  My pal had the beef broccoli, and I had the chicken with mushrooms  I tried it once, but I will try it again to make sure I feel the same way.  At least the first impression was a good one!", "author": "Lawree S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "Great 'American' Chinese food. Best General Tso's chicken I've ever had, seriously. Tasty (not too greasy) Chow Mein. Crispy spring rolls. And the Shanghai dumplings (soup dumplings) are amazing! Service was quick and the owner (maybe the manager?) was really funny and sweet. We finally found our go-to Chinese restaurant!", "author": "Brian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "Been ordering delivery from here for a few weeks now so can't comment on eating there but the delivery is always fast and hot. The food is the best Chinese delivery I've had in the sunset. We have tried a bunch of different stuff on the menu and so far it has all been good.", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-27", "description": "Really loved the food and our waiter was awesome. I wish that our water had been refilled more but the food was great. Try the egg drop soup-- it's filled with veggies!", "author": "Abbie H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-18", "description": "The food's fairly nice. The service is disappointing.  They messed up and forgot to bring an item.  I thought I'd be a nice person and not insist that they drive across town and bring the food that night.  Big mistake.  The woman I spoke to said next time I ordered they'd give me a \"free\" replacement.  Well, when I called to get my \"free\" replacement, the person handling the order insisted I had to order 25.00 worth of food, which is more than I wanted and not fair.  They made the mistake.  Not a nice way to treat a customer.  I cancelled my order and hope GrubHub will get my 8.00 back for me.\n\nGrubHub fixed things.  Meh to Chang's.", "author": "Monte C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "lou is great.  he always makes me feel special and is accomodating to special requests...they have the fastest delivery ever, and food is always hot and fresh, the prices are very fair, some of my favs are the honey walnut shrimp, the chicken and veggies are delish, the wonton soup, and the prawns with scrambled eggs.....great food for a hungover cure or just a lazy day", "author": "Lizz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-13", "description": "Is a very nice and neat traditional Chinese place. Service are great and friendly. The place is clean and neat. What I order taste good as well. I recommend to come back.", "author": "KBs C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Found my new go-to chinese place. Kung pao chicken and the basil-chili chicken were both great. \nCheap, not too greasy, quick-ish delivery!", "author": "Ankush K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "This place is great! So worth it. Dumplings are awesome! General Tso chicken is the ish!!! Wow! We will be back!!!", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "Originally I was going to eat at San tung but it was crowded and was to busy to give me service quickly. I went across to Changs and ordered fried rice and noodles. It was super fast and pretty tasty. This place is close to me so I'll be going there more when I'm craving for Chinese food.", "author": "Jesse S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "Fast delivery, and good Chinese food.", "author": "Saam D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-30", "description": "A truly lackluster experience. The vegetable pot stickers were oily and flavorless. The meatless Mongolian Chicken was incredibly average as well. Nothing was bad, per say, but nothing was indeed truly delicious in any sense. Probably will not be ordering from here again.", "author": "Anon E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-25", "description": "While I can't speak to eating at the restaurant I can tell you the delivery is amazing.  We always order the walnut prawns and the chicken with Chinese greens (gai lan).  With a lot of Chinese delivery the quality varies but with Chang's the food is always good and the delivery people are nice.  The food is reasonably priced and with quick delivery how can you go wrong?", "author": "Thor B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "Really good!! Part of yet another group that stumbled in here after seeing the dishearteningly long waitlist at San Tung - but I'm glad we ended up here! \n\nWe had a group of 7, seated immediately. They leave a pot of tea at the table, which was nice. \n\nWe ordered: Mongolian beef chow mein, honey walnut prawns, eggplant in garlic sauce, salt and pepper wings, deep fried chicken wings, fried rice\n\nWe were really satisfied with pretty much everything we ordered, my favorites being the Mongolian beef chow mein and the fried rice. Word of warning that the Mongolian beef chow mein was really spicy (but so tasty). One tip if you want wings - pick the salt and pepper wings (I think this is what it's called?) over the deep fried - deep fried is slightly bland, while the other one is flavorful. \n\nGood service, good prices; we ordered 6 appetizers/entrees for 7 people, which came out to about $8.50 a person (including tax and tip!) - and everyone was very full by the end too!", "author": "Jane D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "Super tasty chicken, order delivered extremely quickly and chicken was still nice, warm and surprisingly still crispy. First time customer, definitely eating here again soon!", "author": "Emerson 3."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-10", "description": "Ordered delivery, about $75 worth.  Came within a reasonable amount of time.  What I ate was ok, nothing special.  I\"d orderd fried rice and something else to take to work to eat the next day, those went into the frig as soon as we got the food.  Work as a mad house and I only got to eat a few  bites before my body said \"um, we don't want to eat this anymore\" so I tossed it out...and within an hour or so began to have serious stomach problems and had to go home early, had to take a cab because I didn't think I'd make it via bus.  Got home and exploded.  Food poisoning.  3 days of serious explosive purging from both ends.  Then I got feverish and delirious for a few days.  Only drank water for about 5 days and now have to see my doctor because may have damaged my kidneys and some other things because of it.  Even though this may have been one of those rare time where one piece of food may have been bad, I'm never eating Chang's again.", "author": "Kai T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "Last week we ordered delivery from Chang's for the first time. Wow! Finally a great meal from a Chinese restaurant that delivers. We chose the dry fried chicken wings entree (we requested \"mild\") General Tso's chicken (also mild) and the Phoenix Dragon eggplant. Since our order was over $25, we asked for the complimentary egg fried rice. Everything was fresh and delicious and arrived steaming hot. Given that we live quite a distance from the restaurant (Clayton Street near Corbett Ave.) we were felt we were taking a risk on delivery. Our risk paid off and we were really, really pleased. Chang's is our new \"go to\" restaurant for tasty Chinese food with excellent delivery service Yum!!!", "author": "Donald K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "Very good food here. I highly recommend this place to people looking for yummy chinese food. The owner and staff are very nice people. Will definitely come back again.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-11", "description": "Love the steamed pork buns and Singapore style noodles. Have only had delivery and last night they brought us Shanghai style noodles instead of the Singapore noodles we ordered. I called and fresh Singapore noodles were delivered within 30 minutes. Will definitely order from here again!", "author": "Kristyn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-27", "description": "Gotten delivery from this place several times.  The drivers are friendly and they follow instructions.  Gold star!\n\nBUT... yes, there's always a but.  The food isn't all that great. In fact, one word describes it all... disappointing.  The \"spicy\" dishes aren't even spicy.  They give off the appearance they could be but in reality they aren't.  Dim sum is hit or miss... dishes are hit or miss. Would say that everything is hit or miss.  They either got it or they don't and they don't.  It's almost like they change cooks every time.  \n\nThe one thing that has been 95% consistent has been their hot & sour soup.  Other than that, you're taking your chances.", "author": "D G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-06", "description": "Chicken wings were good but a little too big. In comparison with the San tung wings across the street, they have different flavors but very similar. They were both good. Lines were shorter. What grossed us out was that while we were eating, they were rolling out huge trash cans through the front ruby next to us. I was a little thrown off but I didn't let it bother me... the first time. The man did this three times. Isn't that a health code violation or something to bring huge garbage cans through the dining area? I'm not sure who the owners are, I'm sure they're nice gard working people but the trash needs to be taken out the back or if that's not possible, wait until your customers are all gone before pulling it through the dining area so as to not ruin the dining experience. Also, as we were finishing up around closing time, the server comes up to us and says \"we closed. Ok? Ok.\" I understand you want to go home and I respect your hours but you should let your customers finish their food. That was really rude. She was also a little forgetful and flustered throughout the whole meal. Maybe she's never served before but I don't see San tung kicking out their customers. In fact, despite their long line, San tung took in everyone, even after they were closed.", "author": "Brittany N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "I ordered a lot of food for delivery. Very prompt and courteous service. Loved the spicy eggplant, Mongolian beef and the spicy basil shrimp. The baby Bok Choy with garlic was crunchy and good. All I all very pleased!", "author": "Toni J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "Ordered delivery the other night because my go to place on 9th Ave closed up shop after 25 years. Truth be told, I'm an idiot for not having tried Chang's before. Wow, SO good. Definitely my new go to for Chinese food in the neighborhood. The extra spicy curry chicken was so good my mom (who hates foreign food) had seconds. Excellent place, and really nice guy who manned the phones and fixed my Eat24 mistake with speed and grace. (and to be clear, I'm no foodie and I doubt I've ever had \"authentic\" Chinese food more than once (and I wasn't fond of most of what my Hong Kong born and raised eating companion ordered that day))", "author": "Sergio S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "Ordered :\nLunch General Tso's Chicken - 5/5 . Loved this, will definitely order this again.\nLunch Cashew Nut Chicken - 5/5. Loved this also\n Mu Shu Chicken - 5/5 . Really good, but a little oily.\nChicken Chow Mein - 0/5. The worst chow mein I have ever had, had to throw this away.\n\nWill Order again : 4/5. Yes", "author": "Rachit A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "The older looking waiter is fantastic and he got jokes. 10/10 would come again just for the waiter", "author": "Ken L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-09", "description": "Was walking around this neighborhood, it looked pretty good. We were pleasantly surprised. Good food & yes friendly staff! Above average for cleanliness for a Chinese restaurant.", "author": "Bea Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "We are traveling from San Diego & this restaurant is amazing since you walk in service is excellent ! Their food is amazing !!!!! Definitely will come again in my next trip !", "author": "JC E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-17", "description": "When i first came here last year it was because San Tung's line was too long. The elderly gentleman who served us was very nice, so we came here a second time. Because the first time that we came here they charge rice per person x 2, so we assumed it was the same, but when the check came they had charged us by the bowl. After pointing this out they took this off our check. Today, the elderly gentleman was no longer working there and the elderly woman/owner at the register brought the check with the total amount so I asked her to itemize it. When we ordered from the waitress we clearly asked her if rice was charged per person or by the bowl and confirmed it was per person. After the owner return with the itemized check, not only did she overcharge us for the rice but they charged us per bowl. The menu price was $1.45, but she charged us $1.60. When I pointed this out to the waitress and she brought it back to the owner she got yelled at by the owner. First of all I did not appreciate when members of my own Chinese community try to cheat people because it reflects on the rest of us. Most other customers would not ask for an itemized receipt. Second of all, I don't appreciate owners yelling at their employees so loudly (because a customer pointed out something that they try to do that was unethical) that the whole restaurant could hear. As I pointed out in another review I wish my Chinese cousins would learn that the loss of customers is not worth the extra $0.15 they're making nickel-and-diming every customer that doesn't check their bill. By the way we can hear Chang in the kitchen calling another employee a bitch. No more Chang's Kitchen for me!", "author": "K T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "I love the spicy chicken wings here, I can't believe I come here many times just for the wings.", "author": "David Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-02", "description": "Definitely fast food quality. Two dishes we order, mixed veggie tofu and garlic filet mignon  uses the same dark sauce and same viggies. And the filet mignon is tough, veggie are not cooked enough, not flavorful regardless the unappetizing dark sauce.  Lots of takeout and delivery business. Service is nice though, friendly server.", "author": "jane z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "I've ordered from this place several times. Their delivery is always timely (30-40 minutes if you're in the Sunset like me) and the food is always good. My main staples are the Walnut Prawns, Sweet and Sour Pork, and Shrimp Fried Rice (comes out to about $30 with tip, but will last you 3-4 meals). The breading always has the perfect amount of crunch, nothing is every soggy, and they don't skimp on the shrimp. I got some General's Chicken in my last order where a few of the pieces were more breading than chicken, but it still tasted great. This is definitely decadent food, and you will definitely enjoy it!", "author": "Robert G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "Best service of any restaurant I've ever been at, hands down. The hot and sour soup, sweet and sour chicken and chili dumplings (forgot the name) were all very very good, but the Honey walnut prawns were alright.", "author": "Ben Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "I really like this restaurant and will definitely come back more often! I went there with a very good friend and we received warm greetings from the owner of the restaurant. The service was awesome and the food was amazing. Our favorite includes the honey walnut prawns, the chicken wings, and the beef chow fun (with egg gravy/sauce). I also like the ribs with barbecue sauce  we had but it was a bit hard to bite through. I'll definitely come back to try more dishes here!", "author": "Cheng W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "This place may be overlooked because it is right across the street from San Tungs. And yes, its hard to beat the wings at San Tungs, but most other items on their menu are so-so. Everything we ordered at Changs was delicious! It didn't have that cheap, greasy feel like at many other Chinese restaurants. It tasted fresh and authentic, and the service was excellent. The Singapore noodles were one of my favorite items. Highly recommend this place!", "author": "Margaret N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-18", "description": "Tried them based on a flyer.  Sub-par in every regard.  Going back to Andy's", "author": "Douglas B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-11", "description": "ordered many times from CK (Chang's Kitchen) what use to be pleasure to order from has turned to an annoyance, ordered a vegetarian rice & half of the box was empty, nothing is proportioned equally, my wife said where's the veggies, being a lite eater, it was definitely short on veggies. rice was hard & after a quick reheat in the microwave the rice got harder & stuck together! even with a wet papertowel on it. Reviews from the people who order pork buns, chow mein, dinner for 2, have no business rating CK! CK cannot be compared to san tung! why do you think it's a 90 min wait, case closed! the couple who ordered the dinner for 2, well, guess what, these were assembled for non chinese not insulting anyone, to each their own! I would never order that. for the couple who ordered the har gow & shiu mai, better rethink why it look raw, that stuff is usually made in large quantities & stored in the freezer, the ones you ate were definitely frozen & under cooked. haven for food poisoning! but my main complaint is i ordered for delivery & owner is cheap, i specifically asked for utensils & napkins, i don't care who's responsible for packing these important items, i even called once (not 1st time) & said if i'm not home, how am i supposed to eat it. she gave some lame excuse saying her driver forgot, i just wanted to reiterate the importance of following instructions. So my order was missing these things again, so i contacted delivery.com & the rep was fully understanding my request & was super helpful. as i was chatting with her online the driver returned with utensils & napkins. the thing was what he said, whether it was true or not, he expressed his feelings which was uncalled for. All they did was blame each other & what goes on between them should be between them & not passed on to us the consumer. back to my complaint, driver said his mgr who is the owner biitched to my wife that she loss money on this order. at this point i had enough & spoke to a mgr at delivery.com & he spoke to Jenny the owner, she apologized after their long conversation. she offered to give me one spring roll  to amend the confusion,  i told delivery.com that the 1 spring roll is included on every order. I am not going to accept that offer it's invalid as an offer, besides that is not my idea of a springroll, it's an eggroll that is so cheap to make, yet they charge over a dollar for one, unreal!  CK, YOU HAVE LOST A LOYAL CUSTOMER, CAVEAT EMPTOR! ALL THEY WANT TO DO IS PROFIT FROM YOU. LEARN HOW TO READ & STOP BEING SO CHEAP, MOST IMPORTANLY BE CAREFUL WIH THEIR FOOD!", "author": "david c."}
