{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "great food and nice location. service can improve :-)  \n\nyelp is forcing me to write more which is a violation of my first amendment right", "author": "Ray L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-12", "description": "South East Indian food is definitely different than the regular Indian cuisine...some friends and I had just left from an event and we were hungry! Walking on Beach St and stumbled upon this place. It was pretty late in the hour and close to closing time.\n\nOur waiter wasn't the most helpful when we asked specific questions in regards to the food items and once our food arrived, it was not thrilling at all.\n\n3 star rating is based on knowing they probably could've done better, however, I wont be back to find out.", "author": "Arthur B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "Avoid this place like the plague.\nThis is one of the most awful place in this city. \nThe food is terrible, the service is awful, and the \nstaff is ill-mannered and rude. \nThe customers are mostly tourists who dont\nknow better.\nI had a horrible experience -- the food was bland \nAnd gave me food poisoning.\nThe manager and host were complete idiots and\nMade us wait 30 minutes and gave us the \nSmallest table on Earth.\n\n\n\nNo idea what this dumbass idiot owner is talking \nabout. I ate at this cesspool of a place a month ago not yesterday as he claims. But I made it a point to write a review given my bad experience.\nHis attitude is clearly representative of his attitude towards customers. I hope this cesspool sewer of a restaurant closes down soon.", "author": "Ray M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-18", "description": "This is the closest Indian place to Pier 39. I was super happy to find a South Indian food place. That place was moderately busy when we stepped in for lunch. We got the corner table which was the only clean table that time. We took our time to decide our food. There were only 2 employees in that restaurant. They were handling everything - taking orders, serving, clearing tables, cleaning, handling the cashier job. We waited there and waved at them for more than 10 minutes to at least get their attention. \n\nAfter a while, that gentleman came and took our order. Ordered Gobi Manchurian for starter and told him to bring that one first. We decided to place rest of our order too since we don't want to waste our time. Ordered 2 fish curry combo, 1 parottah combo and a vegetarian kothu porottah. By that time the restaurant was quite busy. We realized that we are not going to get our food quickly. More than 15 minuets gone by, still no sign of even starter. We started our waving job to get that guy's attention. He came over and told us it will be served very soon. Again I asked him to bring the starter at least. He said sure and walked away. After another 5 minuets, Parottah combo came first. The other lady brought it, ao I asked her what happened to the starter. She said she will check and walked away. She went to the kitchen and came back with Kothu Parottah. She said they are still preparing the gobi Manchurian. She didn't even wait for my reaction and walked away. \n\nMay be after 2 minutes, she came back with Gobi Manchurian and one Fish curry combo. She walked back to kitchen and thought finally we got it. A few ministers gone by, but she's not coming back and busy serving other tables. I started waving my hand again. This time that guy came over. I told him that we ordered 2 fish curry combo and asked where's the other one. To my total surprise he told me that they are preparing it. He also added that they serve everything fresh. Its the same food we got one order and he was telling us that chef is preparing it. He said sorry and went to kitchen. When he came back he had our food with him. He said sorry for the delay as well.\n\nParottah combo was really good. The Parottah was soft and chicken curry along with that was good too. Fish curry tasted good, but really spicy. Gobi Manchurian was crispy, it has got the flavor but kinda of sour. Vegetarian kothu parattah was terrible. It tasted awful. We waited for our bill for while. We spent almost 70 - 80 minutes there. Food was ok, but the wait time is atrocious...", "author": "Jay T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "I got the specialty curry - I think it was Chennai 65. I wanted it a little more spicy but the guy talked me out of it. I would have preferred the additional spice but maybe next time! Overall my curry was good but I was not a fan of the rice. I was expecting basmati but I think they use \"regular rice\" mine was over cooked and a little mushy which did not go well with the curry. I didn't eat it. \n\nOne thing to note - they are a southern Indian restaurant so don't expect chicken tikka masala :) of the staples I think you'll see are butter chicken, but it's a good opportunity to try something a little different if you go.", "author": "Sarah I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-07", "description": "Stopped here for dinner on a weekday when boyfriend was craving some south Indian comfort food. Noticed right off the bat that the food didn't match up to south bay restaurants.\n\nThe idli was doughy and you could tell that it hadn't risen enough. It came with sambhar and two chutneys - the coconut chutney and sambhar were pretty good, the tomato chutney was average.\n\nVeg kottu parotha had an overwhelming level of spice in it; there was nothing spectacular about it. Dosa was decent.\n\nSouth bay seems to be a better place to indulge in Indian food so don't think I will be returning.", "author": "Preeti R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-29", "description": "This restaurant was OKAY. We did get our food in a timely manner - paneer dosa was bomb, spring dosa was NOT. Completely flavorless. It took a while to get my masala tea out but it was fine. I've had better.", "author": "Anmol V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-08", "description": "Went here for a quick lunch. The restaurant and the restrooms were clean. My Mom and j both ordered the Masala Dosa. Dosa was crispy and the Sambar and Coconut Chutney were delicious. Service was prompt and courteous. For a restaurant in a very busy touristy area, it exceeded my expectations. Would highly recommend it.", "author": "Krish M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "Had lunch at Chennai Kings.its very near to pier 39\nGobhi Manchuria tastes good. It's authentic.\nThe other curries vegetable kurma and paneer tastes good with correct spice levels \nParatha was freshly prepared and just melts in your mouth. \nOverall it's good restro.\nPlanning to visit again and will have only breakfast menu.", "author": "Yasasvi Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-06", "description": "I am glad Yelp provides a feature to update the review and all I would say is simply \"AVOID\" this restaurant.\n\nIt was nothing like what I visited back in 2016, the whole staff was changed who did not knew about what they are serving.\n\nThe ambience was with no lights, no A.C. (well it is fine in SFO though). \n\nService was super slow and the dosa was too soggy with very less masala inside it.\n\nIt was missing the taste I had 2 years back and all I wanted to leave that place as early as possible.\n\nOverall I will suggest to go to this restaurant only if you don't find any other options to go to.", "author": "Hafiz M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "We tried the Dosa, and it was very average. Potato stuffing was bland, Sambhar was tasteless, but the Dosa itself was crispy. Didn't like any of the chutneys. Service was fine. No wait time.", "author": "Aparnabose D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-09", "description": "I normally don't review, but made it a point to post the incident that happened with me. I went here after a tiring day of roaming around SF, reading all the positive reviews. Being a vegetarian, it looked to be the perfect place to eat. There were only 3 tables occupied then, and two had been served. We were the only ones that placed an order. We had ordered a gobi manchurian and we were famished and hungry that we both ate a piece, realizing that it felt weird. We thought we were just hungry. The manager there then came and said there was some confusion, and by mistake they served Chicken manchurian instead of gobi manchurian (That's right, danish sait's prank came to life ). I was startled. When I said I was vegetarian, he arrogantly said \"didn't you know that's chicken\". Wow. \n\nHe said sorry a couple of times. I didn't react there since I understand mistakes happen. But being a indian, especially a South Indian restaurant, you have to be careful about what you serve. Pathetic. \n\nI wouldn't recommend this place.", "author": "Sai I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Good atmosphere. Food was tasty. We got the garlic chicken and butter chicken curry. The host was a little awkward and he did not talk very much, but the waitress was extremely kind and friendly.", "author": "Mickey B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-29", "description": "We ordered Veg biryani and chicken biryani , takeout, with regular spice levels. The biryanis are extremely extremely spicy and we could not eat. The place looks very clean and we may give another try with different items (not biryani).", "author": "Kavuri S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Sambhar here is one of the best. Masala dosa and vada is thumbs up. Service is also 8/10.\nIf you are by the firsherman's wharf or gurradelli square area, this is the place to go if you are craving South Indian food.", "author": "Ritu W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "I should preface this review by stating that I have spent a fair amount of time in India, largely on consulting jobs, and always in Tamil Nadu state in Southern India, and the vast majority of my time there has been spent in Chennai. Oh, and I should also mention that I like Southern India food, which tends to be spicier -- in terms of hotness -- than foods from other areas of India. In general, I can tolerate and enjoy very hot spicy food.\n\nOkay, with that introductory information out of the way, it is time to move on to the body of my review; here goes:\n\nI have visited SF perhaps twice a year for approximately 10-day visits each time since mid-2015, always staying in this area of Fisherman's Wharf. And, ever since what was perhaps my second visit, in perhaps late 2015, I had started seeing the signage for this shop, along with a sign listing its open hours, on this storefront, but every time I passed the shop -- always during its posted open hours -- it was, strangely, never open, and never showed any signs of activity inside. This odd phenomenon of being always-closed continued for each of my SF stays through late 2016. \n\nFinally, during a June 2017 stay (that is, about  5 or 6 months ago), in  this area, and much to my surprise, I finally found this shop open for business at about 9 PM one Friday evening, and, since I was hungry and dinnertime was overdue for me, I wandered in and sat down.   \n\nSince I was quite hungry and well-overdue for dinner  by that time, I ordered six different menu items, including two breads, a bowl of rice, and three main dishes. The food started to arrive after about a normal wait time, and all of the food items turned out to be very good portions and to be very high in quality; it was all genuine Chennai-style South India food. Amazingly, I ate everything that I had ordered in that one sitting, only because I was extremely hungry, and in fact, I would likely have been able to also fit in my little tummy an order of samosas, but for the fact that when I tried at that time to order samosas, my waiter told me proudly, with his nose in the air, that they did not offer samosas, since, he said, they were not genuine South Indian food! Oh well! \n\nI am once again in SF for a 10-day stay, and I have been eating my lunch (and dinner one night) here at this restaurant almost every day of my stay here, often in the company of one of my colleagues (who have, due to my artful and sneaky manipulations, always offered to pay for my meal...!). \n\nThe food quality and portion sizes are still great, and this is still, in my opinion, excellent South India food. And, to my great delight, I found that they are now finally offering samosas (although I do not believe that they are yet listed on the menu), consisting of three good-sized samosas on a bed of shredded cabbage and veggies for about $5. The quality and flavor of the samosas is very good!\n\nBTW, one of the two always-on wide screen TVs in the shop has displayed, during each and every one of my visits, women's volleyball games from around the world. I tend to have very little taste and tolerance for competitive spectator sports, but I do have a bit of a warm spot in my heart for women's volleyball, and so I appreciate that the TV set nearest my table is always displaying women's volleyball games from all over the world, and, if my memory serves me correctly, even, at times, from all over the solar system!\n\nIn closing, I want to state that I have always found the service here to be at least adequate, and often quite good. Oh, and as is true of so many Indian restaurants in the US, by default this restaurant always tends to provide only large linen cloth napkins for each customer. Now, the problem with this is that while those ubiquitous large linen cloth napkins may look pretty, and may even offer a bit of a (fake) sense of style and class to the decor, the reality is that the large linen cloth napkins that are provided in American restaurants are horrible, since they exhibit nearly-zero absorbency. So, whenever I visit this restaurant, I always ask my server, while ordering, to bring me two large paper napkins, which they do, and their large paper napkins, as would be expected, are ten thousand times more useful and more functional than those annoying but ubiquitous large linen cloth napkins. \n\nBTW, when I become the evil despotic dictator of the entire universe, which I plan to accomplish quite soon, with the aid of so-called \"chemtrails\", fluoridation of municipal water, and the aid of my space alien buddies and the Bavarian Illuminati, one of my first acts as despotic evil  dictator will be to issue a  law prohibiting restaurants across the universe from providing customers (yes, even the purple octopus-like customers from the large yellow ocean planet in the Betelguese star system) with useless linen cloth napkins!   \n\nIncidentally, each of my colleagues who has accompanied me to this restaurant have also really loved the food!", "author": "Vinny P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "Definitely not \"Kings.\" Quite the opposite. Ask anyone from Chennai or anywhere in India and they will tell you what they call Sambar is not what is served here. It is some concoction of lentils that I cannot even remember ever tasting. Is this is what they make for sambar, imagine how the rest of the food tastes. The potato curry in a masala dosa is dry and pretty bad tasting. The Tomato soup is actually tomato sauce. And I can go on and on, but in short, this food is not South Indian and the chef of not Indian at all (assumption). Never going back of course.", "author": "D K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "Good place for South Indian food. The place reminds me Tamil cinema and Chennai. We ordered dosa and chicken gravy - tasted good but price is expensive.", "author": "Dhatchayini A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-02", "description": "I'm sorry. I'm so confused. I thought Indian food should be bold with species and flavor. I felt like I had curry soup minus any flavor and spice. This place needs help.", "author": "Tyler N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-02", "description": "Staff is nice and place looks good. But I was the only person there and a to go order for one room 20-25 min.  In addition I asked for a mild Chana with Tumeric and no garlic.  I got the spiciest Chana I've ever had with loads of spicy peppers and onion.  Not what I was hoping for.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-07", "description": "Horrible food and service and very dirty to india standards \nNeed to improve the service and food", "author": "Cherilu S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-05", "description": "Small plates, bad service, table not clean, food too spicy even though I ordered medium spicy. Overall, I did not have good experience here..", "author": "Sonal P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-11", "description": "I have just one word for them. Its pathetic. \nServed spoiled Biryani and frozen paratha.\nBetter have some burger or french fries.\nI will give -1 but no option.", "author": "Sony S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-16", "description": "I ordered a to go dinner. As we are from Kerala, we love spicy food. Order Nathalie dry fry, pepper goat and chapathis. While placing the order, I specifically asked how much time will it take to which the person on call told 20minutes. Food was great and we loved the goat curry, but the food was ready only after an hour I reached to pick up!! So no 5 stars from me for the time management.", "author": "Abuarshad S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-05", "description": "I came here for dinner on a Saturday and the place was fairly empty. Overall the place is spacious but feels a bit haphazardly arranged.The food here is average and not as good as south bay, it is okay if you are desperate for south Indian food. \n\nI had paneer chili and parotta. Paneer chilli has soft and fresh paneer, but it was not really well made. Parotta and curry was rather bland and dull, didn't spark my taste buds.", "author": "Piyush K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-20", "description": "Ok, more than two stars but not quite three. The regular biryanis are quite spicy and the portions, while seemingly for 5 people, are just OK.\nService is nice but food-wise, the flavors and-or freshness are not quite there.", "author": "Nancy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-07", "description": "This place is so bad, it's not worth rating, one of my friends who is a vegetarian ordered a veg biryani, had to wait 2 hours and started eating the non veg food because he was hungry..Never come here!! And the manager did not even apologize once, \nPS we ordered beer and biryani at the same time and the beer came after the biriyani", "author": "Deepak M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "I ordered the chicken biryani and it wasn't the best biryani but was better than most I've had in SF. The place is definitely an authentic South Indian place and liked the varied flavors. The biryani was cooked in dum and the flesh fell right off the bone - this is always a sign of a well cooked biryani. However the Salan and raita weren't upto the mark. The perfect biryani should have an amazing accompaniment of salan and raita and this was the only lacking part.\n\nOverall I would return to this place whenever I'm at the wharf again.", "author": "Akshat G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Food is authentic and very tasty. Their goat biriyani and chicken curry are must try. It's true that they take time to bring the order but it might be because of the time taken to cook the food.", "author": "Alekhya D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "Tucked away from Pier 39, this place is spacious. They have 3 (maybe 4?) TVs each on different channel that entertains while you wait. Wall paintings are interesting. Kothamalli Rasam was spicy and good. Tea was also very good. Service was fast and friendly. Parottas were nicely made.", "author": "Yugi M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-30", "description": "Tried to order through Postmates and at first the order went through...then it said the restaurant declined the order since they were too busy.  Tried to call them and they didn't answer.  They just lost a customer.", "author": "Vi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "This place is amazing! I wish we had this restaurant in Austin. At first, we were a little scared since the reviews said the food is really spicy but we told our server and he adjusted it down for us. For our meal, we got the butter chicken and chicken shahi kurma with rice and bread. \n\nAt first, we were unsure of how the bread would be since it's not naan; however, it is BETTER. Way better! Finally, we topped it off with Rose milk and coffee - both were phenomenal. \n\nOverall, I give this restaurant a five star review. The food, ambience, location, and service were all around wonderful!", "author": "Charles L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-22", "description": "We ordered 2 breads and curry. They gave us one bread and curry. The 2nd bread was taking long so we asked them to cancel it. The response was that the bread was ready. We asked them to get it but they took 5 minutes to get it. We could hear them laughing about our request. \n\nIt was pretty obvious that they weren't ready and didn't want to cancel it. \n\nBad experience\n\n----Adding further----\n\nWhen confronted, the lady says \"It's none of your business what I teach my employees \"\n\nMy friend suggested that we will share our thoughts on Yelp. She says \"Go ahead. Do whatever you can\"", "author": "Amit S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-28", "description": "service is very slow and food was not good at all... I had waited for 30 minuets for tea then one guy came and said tea is not available... not happy with this restaurant service", "author": "Kapil V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-19", "description": "I'm Sri Lankan and kotthu is a Sri Lankan food that this restaurant is selling claiming that it's Indian. Not only is this blatantly wrong, the kotthu did not taste as good as what we make in Sri Lanka. However the staff was very friendly and nice and the faluda was very delicious.", "author": "Hiyanthi P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "I don't mind paying $15 for a decent meal at lunch.  But $15 for a tiny piece of fish & 2 doughy dosa is a travesty.  If that's what it takes to keep the doors open.....well, they're doing it at the expense of the customers who are not stupid. \nAs for the dosa, they're thick & gooey. Maybe that's their style. I like dosa that's thin & crispy on the bottom & stuffed with seasoned potato. Really too bad. Would've made a good neighborhood restaurant.", "author": "V L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Good spicy food. Really loved this place for some food like fish , paratha, Sukha Goat . Recommend this place.", "author": "Babu S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-23", "description": "I visited this place with my family during Jan 2017 long weekend.I was a fan of their Mutton Biriyani, this time we tested breakfast.\n\nWe asked for Idli but its was no available so ordered 2 normal plain dosas and one Masala dosai.\n\n* Dosa was good, tasted different than other places. I am not sure what is added to the dosa batter.\n* Chutney'e were spicy; OK for us.\n* Ambience and location are good.", "author": "Vipin K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "If you are craving for good South Indian food while your visit to the Golden Gate Bridge then this is the place to go. Great variety of sea food too. Walkable from the Fisherman's Wharf. \n  We went on a weekend so it was pretty crowded. You can reserve a table in advance.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Lovely food.. The mutton pepper was delicious! Also the malabar fish curry and madras curry were great.", "author": "Abhishek P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "4.5 stars from me! So glad a new South Indian restaurant opened in the city. \nExtensive menu of many delicious sounding things to try for carnivores and vegetarians alike. We ended up sharing a vegetarian biriyani and a madras masala dosa. Both were exceptionally good! The biriyani was very spicy (we ordered regular) so if you aren't used to extremely spicy food I recommend not getting the hotter version. Aside from the heat level, the spices they used were delicious!\nWe also really enjoyed our dosa and accompanying chutneys. \nThe butter milk drink was one of the best I've ever had. Think lassi without sugar and spices added. Soooo good! \nI look forward to trying more dishes here next time.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Mix vegetable uttapam was excellent. Chutneys were very tasty. \n\nIn the mornings they have a limited menu. Parking was easy on a week day around 10 am.", "author": "Bhanu V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-24", "description": "After reading the reviews here about the restaurant about not everything in the menu available, rushing the guests to finish the dinner and messing up the order, we lowered our expectations and boy they disappointed us even further. \n\nNothing we wanted was available. No biryanis or Goat stuff. No mini idlis. No Channa Batura. Finally they said Shrimp Chettinad is available and 10 mins later the host comes back and says no sorry not available. So we ordered the two items which were available on the chicken menu. They were bland.  \n\nIdlis were like warm. Masala dosa was the same. The potato filling inside was cold. \n\nYet the prices were not cheap. Expensive cold food which was super bland. Never going back again.", "author": "Srini K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "Great authentic South Indian food!! Loved it! Customer service was great too. I highly recommend this place to anyone visiting fisherman's wharf looking for some Indian food.", "author": "Uma P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-07", "description": "Their tag line is \"Best South Indian food on Fishermans wharf\". \n\nIn a way, they are right because thats the only south Indian restaurant on Fishermans wharf. You are running a race where there is only one contestant and you will be the best in worst.\n\n- Horrible services. Rude staff, took them 20 mins to seat us, 20 mins to come take the order and another 35 minutes to bring the food on table.\n- Horrible vegetarian dishes : t felt like they were half cooked. Dal was more water, with dal contents as if they had accidentally fell in that soupy water.\n- Overpriced : given the shit they concocted and brought on the table.\n- Acid reflux : after eating their half cooked spicy food.\n- Not sure, if they have AC units working over there. I could see the vents and they had installed standing fans. Still, it was too hot to handle. May be their kitchen exhaust weren't working.\n\nI felt sorry for my 4 membered group for wasting ~$100 over there, whereas we would have easily eaten Chipotle and stayed happy on food and pocket.\n\nI would suggest staying away from this place in order to save you money, stomach and your time which you can spend constructively on Pier 39, instead of they sucking your time and making you wait.", "author": "Swapan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "Great briyani.  Cannot understand why they charge so much for the breads.  Makes no sense.", "author": "Suresh B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-21", "description": "Got screwed badly here twice. First time, I was overcharged. I was charged twice. When I bring it to their notice, they didn't bother to fix it  Second time, I spent an hour getting idly combo and their power was gone. Looks like they didn't pay the bills or so.", "author": "Deepak R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "If you are craving for good Indian food, do visit here. Lovely staff and superb food. Loved it. \n\nThe Khottu Paratha was yummy.", "author": "Sujay M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-26", "description": "Worst customer service n worst order management. They took exactly 45 mins to get our order. If u come here with hungry stomach, u will die. Then i saw ppl coming in waiting in 5-10 mins just to be greeted or ask how many seats.", "author": "Manoj R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-06", "description": "The goat was to die for!!! Make sure to tell the server light on spices, bring a date that loves goat and chicken Briyani and you won't regret it.", "author": "Gsp 1."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "This is an under rated south Indian restaurant. It's in a very convenient location near fisherman wharf. We took a chance last year and loved the authenticity and taste of the parotta and chicken curry. We went there again last week and loved the food again. We ate dosa and idly as well. It tasted very good. Their curries are not oily and greasy which is a good thing.", "author": "San Diego rocks A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "Didn't like the food. We ordered for Vegetable Korma and Veg Biryani. The food was not fresh and had foul smell. We ordered for a mild spicy, but food was very spicy. Service is also not good. Won't recommend at all.", "author": "Vidhi K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-09", "description": "If you are not familiar with their menu, do not go there. Salmon I ordered too spicy and expansive, couldn't eat it, cost still not deducted. Service is too slow.", "author": "Anatoliy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "Amazing south Indian food! This place is my go to South Indian restaurant for food delivery. Their masala Dosa, pesto dosa, chicken dosa, sambhar, idli, all chutneys - everything I've tried here has been amazing (probably the Biryani could be better)! \n\nIf you are craving south Indian food, you should order from here! I've never visited the restaurant, so I can't say for ambience and service as such but the food is delicious. \n\nTheir sambhar is the best I've had in SF.", "author": "Kanika C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-27", "description": "Waited for more than 1 and half hour for dinner, just two dishes and finally got wrong item too. Bad experience", "author": "Deepak K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-18", "description": "Skip if you can. \n\nUsed the restroom so had to walk near the kitchen. Peeked into the kitchen to find the dirtiest kitchen I've seen in my life. \n\nAlso used this restroom right before eating and saw actual poo in the toilets. Awful, lost my appetite. How on earth did they ever get past food standards? Also the lady with glasses gave me the eye after I was vocal about the poo filled restroom. \n\nWill never order or visit this place.", "author": "Preet C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "Cute little place, and one of the rare gems in an area filled with tourist-trap crappy restaurants.\n\nThe food is South Indian, which I rarely find, but delight in.\n\nThe butter chicken was perfectly seasoned. It doesn't come with rice (I don't know if that's typical to the region or they just want to charge extra) but if you have a dhosa and/or bread, you won't need it.\n\nI had the potato dhosa and it was excellent. Had great sauces too.\n\nAfter you fill your belly, go across the street to the foot massage place and get one from Nick. I promise you won't regret it.", "author": "Susan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "Was in the city three days and came here twice. Excellent Southie (South Indian / Tamilian) food. Perfect dosas great curries , perfectly spiced and I love the design of the place. All the ho-hum reviews are for their north Indian food offerings. They probably shouldn't have them one the menu (stick to core competencies and all that)... but I guess most people think Indian restaurants NEED to have chicken tikka masala (which isn't even Indian food ... murgh makhani is its closest Indian relative lol). I was very happy with all the food I ate (mostly dosas and fish curry). Even brought 8 people from the conference I was attending, and they all loved it (the spice got them a bit ... but its South Indian food folks ... get over it). Very happy. Suggestion , if you dont like it too spicy ,, get a parotta. If you've never had a south Indian parotta ..its one of the most delicious flat breads you'll ever eat.", "author": "Umar G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "Food is really good but service is slow. The food is close to authentic and spicy. The place is huge and big with a lot of space.", "author": "Nutella P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-23", "description": "We had been traveling from Austin to Vegas to LA and then to SFO. We had tried Indian food on quite a few occasions in the trip and desperately wanted a good place and avoid surprises.  That's when we found Chennai Kings. We went here for lunch. \n\nThe food was pretty good. It had been a while since we had eaten dosas. So we ordered dosas. The masala dosa was kingly. \n\nA nice place overall with slightly high priced food.", "author": "Ajit K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "Yaye, now we don't have to drive all the way to Fremont for South Indian Food.  But beware...their spicy is INDIAN spicy.  They didn't ask how spicy we'd like the food and just gave it to us super spicy probably since my husband is Indian, I guess they assumed this Korean girl could hang but...I was sweating the entire meal.  YOGHURT!!!!!!", "author": "Janet L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Excellent authentic South Indian cuisine with exactly the kind of ambience and setting you'd expect to find in a similar restaurant in South India. Very well made food and helpful staff as well. Definitely worth a visit.", "author": "Vishnu S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "I don't expect quality service from most of desi restaurants (only food quality is my concern) but Chennai Kings takes it to whole new level. Their prices are $$ but the quality is very stingy. Chappati, Raita, Masala chai etc comes in way too small quantity. On top of that their Customer Service sucks. They gave us a bill with something in it that we didn't eat. When I asked the waiter to talk to Manager, he told me the manager is too busy and wouldn't come. He also explained me that the feedback probabil wouldn't be taken seriously by the management. He does this job part time and management sucks because they think the rents are too high in the area.\n\nAt least don't shit with your customers.", "author": "Waqas A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Authentic South Indian Food right at Fisherman Wharf. Taste and delicacy well maintained. \n\nLoved it", "author": "Mayank T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "5% discount on cash payment.\n\nGood authentic spicy South Indian food.Super fast service.Rasam,mushroom pepper fry,mushroom masala dosa,idlee and filter coffee really good.\n\nStarters a bit uncooked from the core.Falooda too sweet.", "author": "Priyanka L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-05", "description": "I am rarely dissatisfied with any variety of Indian cuisine. Northern or Southern, it's all good to me. \n\nChennai Kings was a major disappointment for a number of reasons. First, the Hosts didn't seem to have a grasp of what was going on at the tables. Granted, this was a July 4th Holiday, but the restaurant wasn't over-crowded. It seemed like they had more space than was being utilized. The Hosts seemed very disorganized. For a restaurant with a small number of tables, this was really unacceptable. I think the Security Guard did a better job of getting people in and out of the restaurant. \n\nWe waited for 20 minutes for a table that we stared at (empty) while in line. The restaurant told us they had a reservation, but they didn't end up using the table for the reservation.\n\nThe waiter was really good about taking the order, but that's where the quality service ended. \n\nOur food came out at all different times. We only ordered 3 entrees. They served our fish dish first without the rice we ordered. The fish was REALLY spicy (and overcooked) and needed rice desperately. We waited patiently until all the other food came out and reminded the waiter about the rice. He said he would check on it, but seemed to imply that we didn't order it (which they charge you $4 for an order of rice)...10 minutes later we saw him clearing off another table and reminded him about the rice. He then came back after a few minutes, once most of our food had been consumed and most people were ready to leave. They still charged us for the $4 rice that became dessert. \n\nAfter we finished, we received the check which had an erroneous food item added to the bill that we didn't order. The waiter had this corrected promptly, but the damage was done. \n\nMy girlfriend and I both had upset stomachs after we ate last night and throughout this morning. I have no evidence about the source, but since the stomach issues started about 30 minutes after dinner and we hadn't eaten anything else, I can only use basic reasoning to deduce where this awful feeling came from. \n\nThis was really a big disappointment. It's in a nice location, but that's about it. I won't be back nor would any of the people that joined me for dinner yesterday.", "author": "Nathan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "There's not enough stars for this place.  Simply amazing!!! You want flavor, authenticity, and genuinely great food and people ---- this is the place!  Seriously, I'm a total food snob and all I did was order more and more and FOOD TO GO FOR IN THE MORNING!  A must !!!!  Delicious!!", "author": "Honest Ratings D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "This place is owned by the same guy who previously owned Gajalee on Valencia. I was a regular eater there and got to know that they are moving somewhere else (pretty sad as the yummiest place was getting out of the city and it was very close to my office).\n\nGuess what, this guy just now opened restaurant right in the heart of fisherman's wharf. The cuisine has changed and the taste of the food has gone crazy. I still can feel the aroma of desi style curry. \n\nYesterday, I spent almost 2 hours at that restaurant (owner - my friend and all the staff are all cool). I say just go and try all the curries, chapati and biryani. You will likely go mad.\n\nDefinitely, 5 stars. Parking - street/garage and if you live in SF, you know how to find ;)", "author": "Pratik J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "I LOVE THE Place I was there order dosa it was amazing and the paratha was awesome....and service was also good ,great place to go there to  enjoy food", "author": "Kandeepan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "There are very few places where I feel I am transported back to South India like on those trips as a little kid, but this is easily one of them. \n\nChennai kings is clearly the king of chennai. I enjoyed a mushroom pepper fry: delectably pan fried mushrooms with spices that were truly amazing. For me, when someone says spicy, that's usually not that spicy, but Chennai Kings knows the true definition. What was amazing is how even the spice level did not take away from the taste at all. \n\nFor my entree, I had a shrimp masala dosa. The seasonings here are worth every penny. Every single bite was better than the last. And the seafood, being near Fishermans Wharf, was incredibly fresh. \n\nWe finished our meal with gajar halwa, a well known Indian dessert made from carrots. I have NEVER had a gajar halwa that I've loved until today. \n\nWell done Chennai Kings. I felt reminded of my trips as a kid and had a fantastic meal to boot!", "author": "Jiten S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "First ever Chicken dum biriyani and South Indian spicy food. Earlier to have this we always used to go to East bay it South bay.Please do mention your spice level if really want spicy or mild if you can't handle. They customize", "author": "Bon Vivant R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "Bang it's the Third CK location and congrats to The CK Team ! \nSFO location's grand opening was yesterday the 04/29. This store is pretty spacious and the interior is beautiful handled for a soothing dining .! There is a dance floor as well as a banquet hall. \nComing to the food , it was the first day of their opening so Buffet with numerous items like Parata,dosa, Biriyani, butterchicken and many more was placed. Service was very welcoming .!\nParking area is not an issue so Definite spot to stop and try !", "author": "Kemitha M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-03", "description": "Wonder what happened to this place. I visited this restaurant when it was a week old - the food and service was amazing. This time I found the service lousy and the food average. I ordered the mutton Sukka and the ghee dosa . The goat was very well cooked but lacked flavor/marination. The dosa was alright but the important part of this dish , the chutnies, were a big let down.", "author": "Meera S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "I am always wary of a place that calls itself a South Indian restaurant. You don't get to be one just because you serve dosa and idli ! Chennai Kings would definitely fit the bill and a damn good one at that. The menu has plenty of options from the spicy Kothu parota to chole bhatura to a ton of dosa varieties.\nI was travelling with my 17 month old and able to feed him freshly made, nutritious and filling mini Idlis ( steamed rice floor dumplings) far away from home was awesome. I had a muni pass and ended up visiting the place on more than one occasion.\nI would definitely recommend this to people looking for an authentic fix. Word of caution, authentic south Indian food tends to be spicy and credit to Chennai Kings for not being spice shy.", "author": "Sudheer P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-11", "description": "Good Service! Well prepared dishes! Unfortunately 75% of items we ordered from the menu were unavailable! Had to order dishes I did not really want! Disappointing!", "author": "BigBad W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-02", "description": "Very disappointing food. The dosas were soggy and nothing to write home about. The kuttu-porrata was lame -- spicy but no real flavor. The biryani was quite tasteless. \n\nService was attentive and good, but could not make up for the food quality.", "author": "Vikram C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-25", "description": "I work in the area and have never checked it out. Thought  I'd give it a try. Two times in the last week I went and was unable to get lunch. First time at 11:45, signs says open at 11:30, but it wasn't opened. Fine. Second time one week later at 11:45 they are open, but advertising American Breakfast. I go in and am offered free coffee. I don't want free coffee, I want Indian food. \"We are only serving breakfast.\" Server asked four guys standing around behind the bad when the kitchen would open for Indian food. 20 minutes. No third time. You guys stink.", "author": "Katenryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "I have been here 3 times and everytime,Chennai Kings has never disappointed me.\n\nI love South Indian food and was never satisfied with the number of good quality South Indian Restaurants in the city except Udupi! But now I can put Chennai Kings in my favorite list too!\n\nTheir Dosas,Idli,Vada are great.\nBiryani and Gajar Halwa were one of the best I've ever had in San Francisco! \nChole Bhature were also not bad.\nLoved the Filter Coffee too.\n\nNote:Their Spice level is typical Indian Spicy and not the sweet version of Spicy,so Normal food would be a hell lot of spice for people who don't eat spicy food. (Tongue Twister. haha)\n\nHence,Before ordering you must confirm the Spice level you want!\n\nAlways happy with the service there.I have never had a problem with anything and the staff is attentive and friendly. :-)\n\nWill come here again and again as this place reminds me of India and definitely fulfill my cravings ;-)", "author": "Sonia J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-02", "description": "I find the food here to be very good but the customer service to be lacking.\n\nThe waitress, a south indian woman with long hair and glasses, is unfriendly and distracted by her cell phone.  She looked sulkily at customers walking in, and didn't seem to want to do her job. I would advise the manager to improve her attitude, to promise a better experience for customers.", "author": "Michele Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "We had a great food. After a long time a good kotthu parota , on a typical chennai style. I loved it and paneer butter masala too was very good", "author": "Sundar T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Great Indian food experience at a restaurant. I favor the speciality of this place, the 'CK' chicken curry. Amazingly tasty and spicy. Freshly made drinks also accompany the good food perfectly. However their masala dosa and sambhar are not that great, I've had much better when my Indian friends make it.", "author": "K. J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-21", "description": "I came by to try the Kadai Chicken to go and it's came in 6 oz plastic container with no rice and they charged me $16+. I'm so mad I can't even. If I went to Kennedy's on Columbus up the street I could have fed two people and probably get a beverage for myself.", "author": "Jeff D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-04", "description": "Middling to poor service, food that was just average and not cheap!! Lots of other South Indian options in town that are a lot better. We were disappointed.", "author": "S T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "Great little seeming hole in the wall Indian joint, but great food and it is pretty ridiculously big/good once you try it out.", "author": "Kannan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "Finally a good south/north indian place near pier 39. Good for Tourists craving for good dosa.\nservice is good. restaurant is clean and hope it continues.", "author": "yelper l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-04", "description": "Very bad service.. Employees were very very very rude.. and the restaurant was understaffed ... the experience ruined the day!", "author": "Vishakha R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "We went here on a Saturday evening with our kids. We have been here once before and came with the expectation to quickly grab a dinner and get back to our place (we are from SJC). Food came quickly (5 stars for that), and very good (4 stars for that).  The reason why I am giving 3 stars is that we specifically ordered a chicken dish for kids and told them it has to be less spicy and they promise to deliver just that.  It turned out to be super hot, even we couldn't eat it without drinking a lot of water. After complaining they gave a complimentary lassi, which is a good gesture, but that didn't help much. We would have asked them to replace the dish if we had enough time, but we were in a hurry to get back home.  Except for that one dish, everything else was good and the service was good as well.", "author": "R P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "Like the food and surroundings. Server's attitude is too good. More over I love the goat biriyani. Recommended!", "author": "Mohammed Ziya A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-15", "description": "Horrible food. Cold undercooked food. For the price as compared to other South Indians restaurants, this is priced higher and quality lower.", "author": "Ravi G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-20", "description": "The only reason we went there is because of the location. Its located very close to the pier. We ordered Masala Dosa, Idli and Chilli Paneer which all tasted very good. The only concern was the cleanliness. When I walked back to the restroom, I got a view into the kitchen. The place is very dirty and the restroom stinks. If you are starving and close to the pier, I would recommend this place.", "author": "Pritesh P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-04", "description": "We came here to try biryani and dosa at noon. Chicken dum biryani was served cold with hardly one chicken piece, a real low value for a $15 biryani. \n\nDosa was mushy and mediocre. While biryani wasn't that bad overall, wouldn't recommend to someone looking for good Indian food.", "author": "Div M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "For the first time in SF city I had really good South Indian food . Reminds me of home . Being a South Indian I think this place has some fairly legit south Indian dishes. I wanted to try this restaurant after seeing the name Chennai kings and the authentic dish names on their menu ( Chennai sentiment) . Good ambience and spacious seating area . The staff were super friendly and very good at giving us suggestions . \n\nHad the goat biryani and Goat Varuval ( Kinda like a roasted goat preparation with traditional south Indian spices) . It was perfect . Soft and well cooked . The biryani was fair enough( 3.5/ 5) but not the best for a South Indian biryani . Also had the parotta ( Flaky bread) not impressed by the parotta because I felt like it was one of the frozen ones available in the market . The Good points about this place is the flavor I can they its really authentic and doesn't mislead you from the name . \n\nThe menu had a good variety of dishes and desserts to offer . The price was a little on the higher side but can't say much because it Fisherman's wharf . \n\nA lot improvisation can be done on the utensils and ambient experience to make it feel more traditional and authentic . \n\nI am definitely coming back to this place to try out the other dishes !!", "author": "Nikita R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-15", "description": "I got take out but it didn't come out with a fork or anything (staying in a hotel nearby). I spent 2 months in southern India and learned how to eat with my hand, but they also didn't even provide any naan or rice. The food itself was alright.", "author": "James M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "We had vanjaram fry and meen vary all with parota. All items were tasty and had good amount of spice in them. After the long bus tour at SFO, eating here was a relief and perfect end to our day :)", "author": "Sahithi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "Good biryanis and a good South Indian find in fishermans wharf.. service is cAsual but good. The food is not very spicy , and is flavorful. Cricket inspired ambience. Good place to eat if one wants South Indian food in  San Francisco. Will definitely go again.", "author": "Divya J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Loved this restaurant. Their seafood is awesome (you should be ready for a spice level of High here though) and love the Goat biryani too. They have an amazing long list of Faloodas as desserts. Very close to Fishermanwharf. Highly recommend this restaurant.", "author": "Sonia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "It's rare to find South Indian restaurants, so when you find a good one, it's worth noting.\nI would say that realistically the food here is more of a 4 star than five (still very solid), but I increased my rating because of the good customer service.  \nI tried it out a few days ago and was pleased with the goat curry's taste, but rather dismayed that there were literally 4 very small bony pieces of goat in the entire dish (that was $17). I don't mind the bone in, but it's to emphasize how little meat there was.\nHowever, at the end of the meal, I decided that rather than just leaving them a poor yelp rating, I would mention the paucity of meat in the dish and see how they reacted.  I am pleased to say that without me even asking them to do anything, they brought out an entire new goat curry dish for me; one with far more meat than the original one and even brought out complimentary rice with it.  Nice Save Chennai Kings.", "author": "Justin D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-10", "description": "Have been to their restaurant in South Bay, was a bit excited to see them opening here in SF. But, this is my worst experience in several years. We ordered a simple plate of idli and vada, after waiting for 45mins to take the order and provide us water after waiting the first 30mins,  20mins later they updated they are out of vada. After a 1hr and 10mins we receive merely the idlis and immediately we noticed pieces of shrimp. Such a horrible experience and very poor quality of service and food.", "author": "Ram A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-12", "description": "Kitchen closes 30mins before the actual closing time but no such signs or indication of that. But the kitchen is still open for other guests whore still ordering and the food is still being made for them!!! Go figure!!!!", "author": "Lu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Best South Indian food hands down !!! . Had their chetinad shrimp and boy oh boy it was excellent !!! Definitely coming back . Highly recommend this place .", "author": "Gerard A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "Took 15 mins for someone to get our order. But the wait was worth it. Food tasted great ! Very authentic!!", "author": "Jagan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "Awesome spicy South Indian food! Loved their Chilli Chicken and Chicken Biryani. Both had the typical South Indian spicy touch that I love. Masala dosa was okayish.", "author": "Anoshak I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "In Bangalore, where I'm from, it was customary for my family to go have idli, dosa, filter coffee and onion uttapam on Saturday mornings. Revisiting that tradition in San Francisco, in this restaurant conveniently located near Pier 39 was refreshing. I had the masala dosa and idli-vada combo topped off with some filter coffee. The staff was extremely friendly and the Rahman tracks in the background are a welcome change to the teeny-bopper music playing in most stores. Would love to go back and try out some of their Hyderabadi Paradise inspired Biryani.", "author": "Debjani B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-05", "description": "The food was ok. The coconut chutney was really sour and didn't taste so good and it tasted as if it went bad. The crepe was ok. And the sambhar wasn't fresh vegetables. You could tell they were frozen.", "author": "Krupa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "I went this restaurant really awesome food chettinad shrimp curry and chappathi and masala does and onion pakora really supper I came from India but. I want come back again this restaurant Chennai kings", "author": "Pragash S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "If you get the chicken pakora you must get it with yogurt on the side, it compliments it really well. Got the fluffy fried bread with the chickpeas (Chole bhatura)... Amazing!! And the mutton korma was well flavored, yummy rice.", "author": "DJ J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-24", "description": "Very bad experience. The service was very bad. The staff was very rude and did not respond to our requests. Will never recommend it to anyone.", "author": "Z D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "The biriyani here is top notch. It's far better than the Biriyanis I've had in India too! Situated on the beautiful beach street, this place served authentic Indian food as promised. Be it the fluffy mini-idlis, Kothu parathas or the foot-long ghee roast dosa, the place does justice to all.", "author": "Nimisha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Amazing everything!! \nThe most authentic south Indian restaurant.. Rather the only authentic south Indian restaurant in sf.\nOrdered ghee cone dosa - dosa was awesome so was the sambhar and the tomato chutney\nChicken chettinad curry, fish varuval, chicken pakoda,\nAnd mutton kitthu parotta and all of them were awesome and we were blown away! Will definitely come back.. My friends were raving about it and are going to make this a regular place for future!!", "author": "S M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "The service was awful. They didn't even have the food to make the Chana batura. Some food came late, and the food was pretty cold. If I could give a lower rating, I would.", "author": "Harsh W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "This is it. My dream of having an authentic south Indian restaurant in the city has finally come true, and I can't believe how amazing their food is! So I don't have to drive to Sunnyvale to get my biryani fix? - hell yeah! Being a hyderabadi-biryani eater (from Hybderabad, India) for most part of my life this has been by far the best biryani I've had outside of Hyderabad - 'nuff said Chichha. This even trumps most of the brethren in South-Bay (Hyderabadi Dum Biryani, Bawarchi, Paradise, etc etc). Their appetizers - Gobi Manchurian, Chicken 65, Naan and Chapati are bomb as well - very tender and close to home. I'm hungry all over again typing this. Damn it.", "author": "Rajiv R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "This restaurant is so good. I had wonderful kothu parotta, kal Dosa,  Biriyani, BUTTER milk. Groovy they are. Just one thing,  if they ask you for a butter milk refill,  beware it is for extra price not a free refill", "author": "Rajesh B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-04", "description": "Nothing great about this one. The service was slow and the food was below average. They didn't bother to ask us for water and took ages to get us the checks. Never coming back.", "author": "Bhaskar K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "I love this place. I have always been looking for an Indian restaurant  near fisherman's wharf but couldn't  find any. This place is very close to the main tourist area which is a plus. Great customer  service and great food..I love the fish appetizers and shrimp biryani the most. I recommend  this place to all of you.", "author": "Vishal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "Good food, good service but bit pricey! Tried gongoora mutton, butter chicken and butter dosa. Everything tasted good. Ok place for dinner while visiting the bay.", "author": "Anil L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-21", "description": "This is the best Indian food I've ever had. I was craving spicy Indian food and this meal was unlike anything I've tried. Most places have that sawdust dry flavorless chicken breast in their curries. This was moist flavorful chicken pieces. Everything was so flavorful and different and really hit the spot. I was wary because I never eat in fishermans wharf and almost didn't go for that reason. \n\nI ding one star because our meal ended up very expensive. We preferred the bread to the rice. They didn't bring us rice and still charged us about 15$ extra for 4 pieces of Indian bread even though we asked for a substitution. If they were going to charge so much I think they should have brought the rice in addition instead of substituting. 30$ per person After tip seems a little steep but I understand it's in a tourist area. \n\nEven so, I will be back, I'm already craving more and I don't think I can find these flavors anywhere else.", "author": "Megan N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-23", "description": "Food is good, not much quantity.\n\nCharged me $2 for an extra raitha, $10 for 2 idles and 2 vadas, ridiculous \n\n Nice business plan to rip people off", "author": "Dan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-22", "description": "I was really impressed by how clean everything is and stylish inside.  I had the butter chicken and it was pretty good, could have used a little more chicken meat.  Otherwise tasty and good spice.", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Great food, very good customer service .. Nice South Indian restaurant in middle of town.", "author": "Pandu S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "Great food & good staff.  We reached there late night around 10:45pm but staff was very helpful and we got perfect service.", "author": "Guru G S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "So happy to have an Indian spot on the wharf again. When the last one closed I was bummed I couldn't get Indian for lunch anymore. This place is way more welcoming and vibrant. The food is also amazing!! I had the goat curry combo today and will definitely be trying more!", "author": "Steven P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "The best South Indian food u will ever find in SF. People should definitely try the garlic chicken which was spicy and lip smacking good which  reminded me of home. \nIf you like trying different dishes , you must have a taste of the dosas they have. Yummness s not the word. \n\nTo top it off the mango lassi was just amazing and the Gulab jamun was epic.. Uff my mouth is watering just typing it all out!! \n\nDefinitely a place I would visit frequently now .. The service was top class, the young waitress had an amazing smile and was courteous The staff is very friendly and the manager can help u out if it's ur first time at the restaurant. \n\nI hope more people visit this place and get to taste the South Indian cuisine of India.", "author": "Pallavi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "Where I live it is impossible to find Indian food so when I am in the city I always seek out a good spot. I really enjoyed this place. I guess it was more of South Indian food which I had never had and I really liked it! My favorite part was this flaky bread that we ordered...I couldn't get enough! The restaurant is also really cute and the bathroom was clean. The waiter was a little hard to understand, but he was very patient and nice. For being so close to Pier 39, the prices were great! Would go again :)", "author": "Sharai K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Try their delicious Mushroom Pepper dry, u will feel awesome. And Veg Biriyani tastes like a 'Biriyani'.  After a very long time I had a very real nice food", "author": "Anandajyothi A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-31", "description": "Nice South Indian Restaurant at North Beach area. Food is good but not great. Little Overpriced and the portion is tiny", "author": "Chandran N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Very pricy but food was awesome. But if you want more quantity,tasty and cheap means, shalimar restaurant is there which is little far.", "author": "Big M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-26", "description": "Service 1 star : we reached there\nAt 6 pm. The girl on the counter was too busy to greet or offer us seats (even though there were at least 2 tables available for a group of 6.) After waiting for about 10 minutes near the door, we finally asked her if we can sit. And then she without apologizing showed us the table. \nWhen she came to take order, she told us that she takes order only one time. So we need to order everything we want that time itself. So we placed orders. I asked if chutney and sambhar are there for all dosas. And she told us it is obviously going to be part of all dosa orders. \nWe were served dosas but there was no sambhar, instead there was a curry. We asked and they said they were out of sambhar!! And hey, it was just beginning of dinner time, and they were out of sambhar?? Curry was good, so no complaints there. But two orders were still pending while others in the group were almost getting done with their dosas. We asked the server, hoping they didn't forget about the spring dosa and biryani. \nThen the guy tells us that they are out of Spring dosa!!! Well, no one ever told us to order something else!!! I am sitting hungry there waiting for my order! Finally we asked for another dosa. \nFood 3 star: Egg biryani was good. Shrimp dosa was ok. Parry's corner dosa was mediocre. Just onions added!", "author": "V C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-05", "description": "Poor service. They charged my card twice. They didn't respond to multiple calls requesting them to cancel the extra transaction.", "author": "Vinod S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "Thought it was delicious though the quantities were a bit small partially compensated by modest prices.  Though some who reviewed seemed to have had different experiences, I found the service good, friendly and prompt.  I've generally been a bit disappointed in SF Indian food, compared to Berkeley or the Penninsula, but this one was excellent.  AND we noticed that a large majority of the customers were Indian even on the 4th of July evening with lots of tourists which for me is a vote of approval and authenticity.  Parking in the area on non-holidays is generally not too bad.", "author": "Lee R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-17", "description": "I went to the restaurant in San Francisco and finding an authentic south indian restaurant in the city is very rare. Kudos to that. I went on a late sunday afternoon and ordered the usual starters such as chicken Manchurian, Chilly Shrimp, Fish fry and Biriyani. The Chicken Manchurian and chilly shrimp masala tasted pretty much the same. The fish fry was good. The Biriyani was ok - the chicken was pretty dry and not so great. Expected it to be even better. The starters too were ok. Overall it was pretty decent. I would give it a 3 star but considering the lack of any authentic indian food near pier 39, it deserves a 4 star. But i would want them to improve their taste and satisfy many indian customers visiting them. The location is perfect with lot of visitors and if you can get the taste right, this would very easily become a must go place for visitors.", "author": "Janardhanan J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-19", "description": "Horrible Food in the name of Chennai..dont get trapped by seeing yelp pictures guys avoid this restaurant we ordered goat and Chken biriyani which worst biriyani i have ever tasted Mutton not boiled and in chiken biriyani they kept Friend chiken and the price $15 and Kothu parata was like potato curry so much of spices super spice ...Totally horrible experience we were so hungry Expensive as well they charged us $92excludes Tips So dear indians living in SFo plz avoid this Restaurant Cheers", "author": "Nidhi K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-08", "description": "The start was very good, Rasam was amazing. But since there it was all downhill. Chicken 65 was old and the worst was Sambhar which was spoilt. When we asked owner, he started using excuses. Totally unacceptable, can't play with people's health", "author": "Ankit A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "Took a to go order for plain dosa and despite confirming the fact that sambar curry is included, it was not part of the packaging. Very disappointed :(", "author": "Himanshu M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Wow! This is such a game changer for North Beach residents! I am so excited to never go to Valencia or Fillmore for southern Indian food. The idli here is amazing. Very authentic. Will definitely be back at lease twice a week.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "I loved this restaurant. Good people and excellent food. The chutneys served with dosa were very tasty and the filter coffee to top it all off was very nice too. Location is fantastic!!", "author": "Chakradhar M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "It was a good time and I had mouth watering foods at Chennai kings. I loved the lamb biriyani and adayar beach mean varuval. This is the authentic South Indian restaurant.Here the hospitality is awesome. I recommend everyone who really wants to try Indian food.", "author": "Prabhu M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-29", "description": "Useles service but they try to pretend they are very helpful ,they will keep forgeting things and it is super slow service ...we need to remind them every 15 mints for status check ...These folks trying to save money with unhygienic practice ..They don't even provide napkins ..coming to the food it is ok type ..fishes are not fully cooked ..you might end up in stomach upset.. .", "author": "Elumalai K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "One of the best Indian joints that I have ever tasted. We had walked in late but everyone there treated us like a family. From the manager to the guy who took our order treated us like we had come to our hometowns. It was a cherished experience! So happy to have been here :) thank you!", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-05", "description": "visited here recently during a weekend. Place was packed so was a good 15-20 min wait. We tried bunch of stuff, but sorry say every one except one was a disappointment. Milagai bhajji was the only thing close to actual taste. Dosa (as other mentioned) were soggy, even the cone dosa was only crispy on the edges. VEg. Kuttu parotta was just plain \"F\" grade. Veg. Kurma was equally bad. Pesto dosa had no pesto that you could taste. Staff was very hard working and paid immediate attention to needs, but food lets the place down. Our items arrived in group of twos, so the last 2 people in the group got their food after everybody had finished their food. So disappointing.", "author": "ek b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "Caught a look at the place while picking up tourist tickets to sausalito. Came back, ordered the mushroom pepper fry, the madras masala dosa and the shrimp masala dosa. Beautiful! Finger licking! The mushroom was fried just right, the pepper enough to make me lick my fingers! I scooped a bit of the mushroom with my dosa and felt the crispiness and the crunchiness with the softness... ah heaven! The masala of the dosa was good, but believe me, try to scoop the masala with the mushroom and add the chutney...and then sip the sambhar!! My daughter was doing the same with the shrimp! We ordered the idli sambhar also...I am a glutton...reminded me of the idli I ate at the station on the bombay madras train in 1984! Make sure you try the madras coffee. I can almost see the owner pull it! The gajar halwa was great and just right..not too sweet!  Make sure you jog afterwards. I rate this place multiple thumbs up...2 thumbs and 2 toes!", "author": "Dushyant U."}
