{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "The burrito bowl is awesome and delicious that satisfies your cravings for lunch, quick eats or dinner. Friendly staff, good food, good service and clean facility.\n\nI like the amount of tables and seats available at this location. There's seating available as well inside and outside, which is a good thing.\n\nOne of my favorite menu item - the burrito bowl.\nSome ingredients I always in my burrito bowl: white rice, chicken, pinto beans, queso and cheese with a cup of soda.\nI love the portion size for meals like these, it's not too small nor is it too large. It's also a perfect meal right after coming out of the gym.\n\nOverall, positive experience here.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-09", "description": "First things first, Chipotle is a fast food restaurant so I'm not expecting the best service in the world. However, I would prefer to have employees who are making my burrito 1. not give me attitude 2. stop staring at me and my phone and 3. KNOW HOW TO ROLL A BURRITO.\n\nIf you see an asian 20-something year old girl, request someone else to make your meal or, better yet, walk out. (Ain't nobody need that mental strain.)", "author": "Zoë C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-21", "description": "I like Chipotle but don't eat at them often. I saw this place yesterday and after our conference in the AM, I made sure I came over from the Moscone for lunch. My usual is the rice bowl. I keep forgetting to ask for 1/2 the brown rice because they give too much. But the food is seasoned and tastes good. I tried the carnitas this time, a change from chicken. \nBlack beans, cheese, tomatoes, lettuce were piled on. It's really too much food but I managed to stuff myself. The rice is filling. \n\nThe staff regularly wipe down the tables which is good. It looks like mostly high school college kids working here for the summer. I sat facing the window to watch the Downtown crowds go by. Entertainment with you meal.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-12", "description": "Poorly marked hours of operation. Went there because a friend recommended it because he had seen a sign that the restaurant was open until 11:00pm which on the door is marked open daily u til 11pm false advertising will not be visiting this location when it's open", "author": "JJ K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-01", "description": "FunCheap reported that they would give out $3 burritos if you wore a costume on Halloween after 3pm. So I brought Zane and we got $3 burrito bowls. I wore my nun's costume. I enjoy Chipotle. It's always satisfying and feels healthy.\n\nReview #800 in SF.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-30", "description": "Standard Chipotle. We ordered the build your own for our child's dinner.  I liked that they wrapped the tortillas in foil to keep them warm.  The chicken was good.  It also came with a fruit (Clementine) and Milk. The staff were really friendly and helpful here.", "author": "Audrey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "I was one of the first customers of the day! Had a great chicken bowl with guacamole-first time eating at a Chipotle since getting food poisoning at the last Chipotle. Was totally fine here and really missed having the burrito bowl so it was a great delight! Always pair it with lettuce to add extra veggie bulk. Definitely plan to revisit as I was just visiting the area this time.", "author": "Jessica Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-04", "description": "They should just close this place. The lack of care when putting meat into premade hardshells is shameful.... And when they put a tablespoon of meat in there and you ask for more they act like it is coming out of their pockets.", "author": "Dominique A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-02", "description": "The workers were pretty grumpy and the portions were not up to par with other Chipotles I have visited in the past.  \n\nCame here on a Tuesday night with friends for a quick and easy bite for dinner.  The workers behind the counter seemed to be having an off day and had a bit of an attitude when make our burritos and bowls.  They also seemed to skimp a lot on the ingredients. They gave a lot less of everything and my bowl was basically only half full when I went to pay for it. \n\nProbably wouldn't frequent this Chipotle again. Just not worth it here. If I ever crave chipotle, I'll try to head to a different branch for a proper burrito bowl.", "author": "Jacky C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-24", "description": "Not bad for a fast-food restaurant. I'm a fan of their cheap prices--this is one of the few places that serves food that is cheaper to buy than make myself at home.\n\nAlso, it's hard to find fast keto options around here but I love that I can easily skip out on the extra carbs without making it a hassle. The servings are also generous (depending on the servers too I guess) which makes it easy to be full with one purchase. \n\nGET THE BOWL and ask for tortillas on the side. This isn't a taco truck, don't order tacos\n\nOne thing I don't like about this place is how their veggies can get over cooked aka it TURNS BLACK yet they still serve it--I always have to pick it out when i'm eating. Other days, their veggies are just red peppers and nothing else. Not a fan of this inconsistency and lack of attention to what they serve.  Meat can be a little over-sauced but all in all it makes for a decent meal.", "author": "Lydia Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-23", "description": "every time I'm here, I ask for a \"little bit\" of sour cream and cheese, and every day, I get a heaping spoonful of both. I'm not sure how to phrase this request in a way that will be respected.\n\ndon't get me wrong: sour cream and cheese are delicious. but I don't want a bowl of them.", "author": "Charlie H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-03", "description": "Eh. \nCustomer service: ok, limited interaction.\nFood: not very much. I have a stomach pain so i orsered the plain items, chicken, rice, lettuce, corn, and sour cream. I received a question,\n\"Is that it (for your chipotle bowl)?\" \n My thought, if I say yes, could you add more corn or lettuce without me asking?\nResult:\nNope, no additions.\nThe person in front of me got Hella food. 2x my rice and no the person isn't asian.\nChicken was standard as usual. Char and taste.\nBare minimum lettuce!", "author": "Felicia C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-05", "description": "Rude service and barely edible food. I always get a bad vibe here. It's a combination of employees who don't care, cooks who don't care, and the lowbrow chain atmosphere of the dining area. It seems Yelp reviews have really taken a dive from the higher-quality, witty reviews of the early days. Reviews for this location, especially, seem like they're from people who don't know how to think or write. \n\nI was right in front of the counter for a while, but the young, round-faced Filipina employee failed to greet me or pay any attention to me. Finally, I had to ASK her for help. I asked some totally valid questions, but she was rude and dismissive. As she was making my order, she seemed cold and uninterested in interacting with me. Then I saw her being much nicer and attentive to other customers. The East Asian cashier was less obviously nasty than the Filipina one. But still nastier to me than to other customers. The cashier forgot to give me my chips, and I had to go back to ASK for them again. I asked if the chips came with salsa, and the Filipina employee rudely said they can give it if I wanted it. I chose a corn salsa, and she impatiently put a bit in a container and practically threw it at me. And, as usual, no \"thank you\" or parting courteous phrase towards me whatsoever. Then later, I went up to the cashier again and asked for a to-go container and bag. She handed them to me wordlessly - because, as usual, I was too subhuman for any words. \n\nThe receipt had the incorrect restroom code. I called their number, and Holly said to try a different code. Why didn't they update the restroom code on the receipt?\n\nThe rice was too hard - overcooked, or not enough water used. As usual, it was subpar, poorly-made food that was hard to scarf down. Chipotle has gone WAY downhill in recent years. Back when it was at Davis and not SF yet, I remember it had very delicious, high-quality food and decent service.", "author": "Valle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "I come here regularly 3-4 times a week after my workouts because I'm trying to gain some weight. The staff is friendly, professional and very efficient. A great place to watch people going about their day if that is your thing.", "author": "Satnam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Not sure why people hate on this Chipotle so much. The food here is pretty consistent with the others in the chain- it's tasty and cheap. Maybe their scoops are a tiny bit smaller on average? But that's easy to fix by requesting a little extra. I do agree with other reviews about the music being TOO LOUD. :)", "author": "Jean L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-26", "description": "Back to back days of Chipotle.\n\nCame to this Chipotle location wanting just a plateful of protein and more protein with some salad. My order was steak bowl (no rice, double beans, steak, a little bit of mild salsa and a generous load of salad). \n\nExperience was only A-OK here because there were a total of 2 people working during dinner service so the line was ridiculously slow. That also contributed to the lack of ingredients available in the serving counter, it's tough to load my bowl with salad leaves when there was only half a handful of leaves chopped and ready to go. Sizes of bowls created were also inconsistent. \n\nQuestionable if I'd come back to this location over others around the corner that have better portion sizes and vegetable quality.", "author": "Janice K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "It is Chipotle, what more could you expect. Open pretty late for the neighborhood standard.", "author": "RachEl L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-13", "description": "First off, the person starting the order was very rushy & just RUDE! \nWe were at lunch and chose this place to go to with co-workers \n(bad choice) we wanted steak bowls mind you she helped my friend and literally put about 6 chopped squares of steak on her bowl. My friend asked if that was it? rude girl said they we ran out of steak. It was mind blowing the attitude that was given. The other girl (come to find out \"The Manager\") said well we have steak but its for the \"to go\" orders went on to say \"I guess it's OK\" I then ordered 3rd and still the very rushy and rude person \"helped\" me more like helped me get pissed. I took my time in ordering at this point I'm not going to feel rushed at my lunch time and I am a paying customer. after she basically threw my bowl to the left (slid it fast) i asked who is the manager no answer, then the girl said i am I said \"she is rude and rushing  us\" \"oh OK\" she replied \"I will talk to her\" she went on to say. I asked for a card and it reads an apprentice name whom I doubt meant \"Manager\" however, the nice young man was very pleasant and apologized on their behalf he was patient and so sweet. Maybe consider him a new position, he seemed as if he loved it there!  How about the Manager position?", "author": "Angelia A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-31", "description": "Today I went to chipotle for my lunch ordering my normal order. I was a previous employee for Chipotle for 5 years, so I do admit I like my food a little specific. I was served by a manager shorter male with facial hair. I asked for fresh steak because it is supposed to be pink and fresh and it was everything but that. The manager gave me complete attitude and made no such effort to accommodate my request. I would understand if it's busy, but It wasn't. You would expect the manager to have the best service, but in this case everyone working was a pleasure and the manager was the worst part of the experience. Chipotle is all about happy people n this person does not embody that. Sorry I don't want food that's been over cooked and sat there for more then 20 minutes", "author": "Zak B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Great location, perfect for before a movie or after a movie. Doesn't seem to attract any bums for some reason but could be due to security. Price I believe is slightly higher than other chipotles but cheaper than the one next door inside the mall.", "author": "Da X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-27", "description": "I frequent this Chipotle the most as it has an open space and more seating areas. I find that the fajita vegetables here are always burnt and don't look appealing. I also find that the toppings always come out quite cold and aren't as enjoyable. I like how they offer brown rice, but would love if the servers were more generous with the portions.", "author": "Chelsea W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-16", "description": "I'm so confused and conflicted.  \n\nOn one hand, delicious, friendly, and convenient.\n\nOn the other hand,  E. Coli.\n\nHmm 4 stars for my experience, minus one star for so many foodborne illnesses over the past year.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-12", "description": "This was the first time I've had Chipotle since last spring. All the issues have kinda put me off. But this is really prime location in the financial district, one of the better areas in dtown San Fran. I was super famished so I was willing to pay for the extra guacamole for my chicken burrito. It was definitely big enough for me but pretty messy as I finished it. I wish I could find the napkins. \n\nChipotle is definitely one of my go-tos if I'm not feeling Mexican sit-down places but want something more \"authentic\" than Taco Bell.", "author": "Vikram V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "One of the best locations!\nVery attentive and quality service!\nAlways perfectly clean!\nGreatly decorated and spacious!\nCool, peaceful, refreshing, warm and delicious dining experience!", "author": "Minoo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-10", "description": "Do not go to this location. I ordered 2 burrito bowls (1 chicken/1 steak) for lunch today and the meat in both of them were cold. The chicken was cold, maybe room temperature, and the steak was as though it just came out of the refrigerator. The steak was colder than the salad and sour cream on top. \n\nI don't know what the food storage policy is a Chipotle, whether or not left over meats are placed in the refrigerator or thrown out,  but regardless I know it was not supposed to be served at the temperature it was. \n\nWith all the issues Chipotle has been having and surprised they aren't being more careful with the food they are serving.", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-06", "description": "Ate tacos from this location and got food poisoning.  Threw up all night.  So disgusting.", "author": "Emily W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-23", "description": "I ate here with a friend the week of the Super Bowl, and that night ended up in the hospital. She was bedridden for 2 weeks. The doctor's verdict? Salmonella. I really wish I were kidding.\n\nI'm not just not recommending this place, I'm saying: don't eat here if you want to stay healthy. This is completely unacceptable.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-25", "description": "Rice was undercooked. Black beans undercooked. And why is it everytime I get a burrito bowl no matter where I order, it's COLD! Chipotle disappointed today.", "author": "Katie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-02", "description": "Today was my first time back since the whole health scandal began. I used to LOVE Chipotle and was looking forward to my return today (was going to wait until after the February 8th meeting but felt confident with the CDC's recent statement). Unfortunately, my meal was just awful. The lettuce tasted funny, my rice was sticky/clumpy, and the overall flavor was nothing like how I remember. Super disappointed!!! Not sure if it's just this location or a general decline in Chipotle's quality, but huge bummer :(", "author": "Yanni L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-27", "description": "The McDonalds of wannabe mexican food is Chipotle. My only wish is... Can I get my money back. Wacthed as ther service staff couldn't roll a burrito or heat a quesadilla. No flavor other than bad salsa. $30 for blah food. 2 blocks away 1/2 the price, bigger portions for real Cancun food. I knew I should have followed my instincts.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-09", "description": "My boyfriend found a short black strand of hair at the bottom of his bowl after eating damnear the whole thing. \n\nThat killed it for him. I told him to mention it to the employee so at least they was aware of what happened because that's disgusting as hell.\n\nThe employee called his manager over and she was nice enough to say sorry and offered if he wanted a new order, but why would he eat again, after that? Yuck. \n\nInstead he just got his money back. Never going back.", "author": "Yee W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "This was a busy location, being in the financial district but the staff were all pretty no dabs the service was quick. I didn't have much trouble finding seating space either but perhaps I was lucky. Also please note that they now have a 10-cent fee for getting the small paper bags.", "author": "Nick A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-04", "description": "I love chipotle! Its a great healthy option and i eat it all the time. I gave it a 1 start just for this location. This location have pipes up on the ceiling and bird come in and nest there. Literally as we were sitting down INDOORS, a bird pooped on our hands and in our food!!!! We were really disgusted and left. If you look at the pipes, there are evidence of poop shit everywhere!!!  \nBirds carry diseases!!! \nGross!", "author": "Anudari K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-27", "description": "No. \n\nThey had ONE person doing everything which made the line ridiculously long and the ordering process super inefficient.  By the time we got to the register (after a 30 minute wait), the girl said chips were ready, in a bag, so we got them since we were already running late for a movie...but then she ran off and had to tell someone to go bag some chips. What? I thought they were ready... Not to mention it took them 5 minutes to bag chips. What. \n\nSo annoyed. So long. So inefficient. Don't come here if you want a quick meal before a movie.", "author": "Steph S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "I prefer this location to the location in the Westfield mall. \nSimply, staff is amazing. Service is great, food is Chipotle standard.\nThey do have a new employee who gives small portions because of the wrapping process later, so that's that. I've never gotten sick here despite my coworkers warning me. \n\nWill be continuing to frequent!", "author": "Jae T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-13", "description": "I like Chipotle, but not this location. When they were making our food, a burrito & a burrito bowl, we had to repeat ourselves a lot because they missed food items. They also forgot the salad for our bowl & they were stingy w/all the ingredients. They weren't nice and didn't seem to enjoy their job much. \n\nWe asked for a side of corn & it was cold, like it had been sitting in the freezer for a little bit. The tomatoes in the salsa wasn't fresh. It was on the mushier side compared to the fresh tomatoes we're accustomed to at the other Chipotle locations.\n \nIf this was my 1st Chipotle, I wouldn't come back. Since I know this is not the normal Chipotle standard, I will be returning but just not to this location!", "author": "Vi H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-27", "description": "This is July 27th at 20:29:\nThe were really rude and they didnt care about theyre customers. \nI never gonna come back to this location again.", "author": "Alborz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Nathan was serving my salad bowl and had an amazing attitude and professional service. I must say he gave me the best service I've had at any chipotle, and made a huge positive impact on how I now feel about chipotle. Thanks Nathan, I'll be back!", "author": "Angela L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-15", "description": "Service here is bad. If you arrive while they're preparing for the lunch rush, you're not a priority. I waited in an empty line while employees ignored me and served themselves. Then the cashier, after a long back and forth with her colleagues, charged me for 2 meals.", "author": "Ash R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-04", "description": "Fast, convenient, and the staff is super friendly. However, the quality isn't quite comparable to the Chipotles in Texas. This is the first Chipotle I've been to since I've moved to SF so I can't tell if it's all SF locations but I thought the steak was really dry. My roommates told me that the beef in NorCal isn't up to par anyway so maybe I'll try chicken next time. The flavor was a little different. I can't seem to pinpoint exactly what but I'm just gonna blame it on the beef for now.", "author": "Anny T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-10", "description": "I go here when I'm craving some avocado.\n\nI get the burrito bowl with mostly salad and then just pile on salsas and guacamole.  It's altogether not a very attractive meal. It's altogether not the most substantial of meals. It's altogether not necessarily the healthiest of meals (though I skip all meats and cheese), but it works. Kind of.\n\nThough most Chipotles have worked their line queue down to a fine art - this particular one seems to be a little understaffed and also slower than others in the area.\n\nBut if I'm craving something quick and somewhat green it's not a bad option. I still prefer the guacamole at Tropisueno - but it's nice to get some brown rice and salad thrown in - for good measure.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "Random Thursday night, no issues with food or service. Chicken as expected; staff pleasant, even cheerful.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-03", "description": "Chipotle was my go to spot when I felt like getting in a tasty, healthy and affordable meal.  I accepted the price hikes and the one poor experience I had involving some extra protein (fly) in my meal, stuff like that happens and they were prompt in helping me out.  But after this last visit, I left very frustrated.  It seems as though the portion sizes are getting smaller and smaller each time I visit.  That was one thing I loved about Chipotle - they were very generous with the portions and I never left feeling hungry.  I recall every time I had to be careful as I carried my bowl to the table as the toppings would often tumble off.  A very different story now.  I can understand cost savings from the meat but to skimp on rice and produce?  \n\nMaybe it was just this location or the lady behind the counter just didn't like me or my girlfriend.  I did notice she gave the guy ahead of us a scoop and a half of the chicken whereas we got one scoop - plus she made sure to knock some off of my burrito bowl.  They were stingy with the salsa too.  We order chips and the condiment container for the salsa was only half full.  They also charged us for a bag and then forgot to give it to us.    \n\nVery disappointed with the direction they have decided to take - more focused on bottom line than customer satisfaction and quality product.  Probably reaction due to stagnant stock price and shareholders coupled with strong performance by YUM brands.  This is definitely not the way to handle it though, they will lose customers starting with me.", "author": "Roy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-25", "description": "After the big health scare from last year. I tried to give Chipotle another try. Tonight, I brought along a friend of mine minutes before 9pm and about an hour before closing time. My friend asked for plain rice, and they were out of it. I asked for corn for my bowl dinner and they were out of it. We both asked for chips and salsa and we were also told they were out of it. When I asked the guy with blond hair and glasses what will they do with the rest of the 10 or so costumers on line right behind us when they ask for the missing items, he replied in a very defensive and rude attitude \"nothing because we don't cook but the am crew\". I wonder where was the manager when all of this was taking place. Missing items, awful costumer service, over priced and cold food! And that's the way you are trying to have our business back?!!??", "author": "Maribel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "This review is more for the CHIPOTLE MANAGEMENT (if they read this) more than anyone else.\n\nA few weeks ago I was in line and the gentleman in front of me was up to order. To the surprise of myself and everyone else, he was mute, so he could only use hand gestures since no one knew sign language. The staff members were caught off guard at first, but quickly started gesturing communicating non-verbally and kept their cool. \n\nAs a communication studies graduate student, this made me smile because they treated him with respect like any other customer. Shoot, as a member of society it was really cool to see that happen. Props to those employees and whoever trained them! Good for you, Chipotle.\n\nSide note: If there's a huge convention happening at the Moscone Center, avoid going from 12-1:30 pm because most of the convention goers end up walking across the street to grab a burrito. You'll end up waiting in line for at least 15 minutes. This is coming from someone who interns right around the corner from Chipotle.", "author": "Nate W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-23", "description": "This is the swankiest Chipotle I have ever been to (and I have been to a few in upscale neighborhoods like Walnut Creek, CA and Scottsdale, AZ)\n\nThis one is at the foot of the newly remodeled Metreon Center at 4th and Mission in DTSF.  It is sort of like Apple Store meets Burrito place. The Apple store part is all the glass window frontage. Then inside, nearly everything in the decor is stainless steel. Makes it look really clean and inviting with the mustard colored pleather stools, but with the wind and chill howling down the corridors of San Francisco, you need a big burrito to keep warm. \n\nThe new thing at Chipotle, at least this one, is something called Sofritas. This is your non-meat Soy substitute for you vegans and vegetarians. \n\nMe, like my heritage, prefers 50 - 50. So I went with the Barbacoa and Sofritas 50 - 50. \n\nYou might go Sofritas y Carnitas and start your first burrito flavored Rap song. For instance:\n\nI'm a listening to Pepito\nAnd wanting a Burrito\nI walk in Chitpotle\nBut they don't have Mole\nSo I go with Carnitas\nBut what's this Sofritas?\netc. \n Or it doesn't have to be Rap. Try this: http://www.youtube.com/watch?v=U2OxX4KE8z8", "author": "Wanugee N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-29", "description": "This is a pointless review because no one decides whether they want to eat at Chipotle based on Yelp.\n\nDo not order catering from here unless you want to risk my experience:\n1 hour + waiting in the store because my order wasn't ready on time.\nCold food (because my order wasn't ready on time.)\nNo rice.\nMissing one order of meat.\nMissing catering supplies. (No way to heat the cold cold food.)\n\nI called and complained.  They seemed to care.  Until Armondo, the manager, sent me an expired coupon.  When I tried to use it, they wouldn't honor it.  Armondo told me himself \"There's nothing I can do to help you. It doesn't matter if I sent it to you expired.  So go, write your review online, write letters to whoever you want, it won't matter.\"  He's probably right.", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "Came here while waiting for a movie today. The location is convenient because it's located so close to so many of the stores I visit in the area. This time around I came around 6:30pm and it was absolutely empty! I've never seen it this non-crowded and I was able to order my food and get out within 5 minutes. They even hooked me up with a lot of chicken. I ordered a burrito this time around and it was absolutely delicious. The place is like any other Chipotle and is very consistent with the taste. Overall, I really enjoyed this spot and will drop by again if it isn't too busy!", "author": "James R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-07", "description": "I honestly don't know why people are such haters of this place. I've always had a stellar meal here for $10 or less. The food/ingredients are fresh (none of that unwanted grease or lard you find at most taquerias). Their burrito assembly line is always friendly and very good about getting you in and out in a timely manner.\n\nI recently swung by their Metreon location for a quick Mexican bowl. I filled it up with grilled chicken, brown rice, black beans, lettuce, medium salsa, and a dollop of sour cream. Totally hit the spot. The chicken was juicy and tender, the lettuce and salsa were fresh, and my meal didn't put me in a food coma. The whole experience lasted 20 minutes and cost me just $7.\n\nSo why all the haters? Is it because Chipotle is a national chain (and partly owned by McDonald's)? \nWhat ever the case, I'm going to against the grain and declare to the world that I think Chipotle Mexican Grill is a perfectly good place to grab a quick lunch. And given their long lines out the door (on a daily basis), I have to assume that I'm not alone in this opinion.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-30", "description": "Oh, Chipotle, the quality is always consistent and I really appreciate that, but today, I'm writing about your shockingly fantastic customer service. Seriously. \n\nThis is now the 3rd Chipotle I've been to where I've received WONDERFUL service. My favorite Chipotle is in Santa Ana, CA, where they offer me a complimentary beverage while I wait to pick up my online orders, but this Chipotle at the Metreon...it's a close second. \n\nEvery time I come to pick up an order at lunchtime, they're fast and friendly and my order is correct (which isn't exactly over-the-top customer service, but I appreciate it). Today, I ordered my usual veggie bowl, but I indicated that I wanted the guacamole on the side. They forgot it, which was not a big deal. I could see they had a million catering orders and they were really busy. I didn't think twice about it. Then I got a phone call from the kind man who filled my order, apologizing for forgetting my guacamole and promising to make it right in the future. Seriously? When's the last time you went to order food, encountered a mistake and had them identify it and call you to apologize? That never happens. Pretty awesome. \n\nGood job, Chipotle at the Metreon. Keep up the excellent work! :)", "author": "Kimberly A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-20", "description": "This place has a rodent problem. Saw one eating dinner in here before a movie and reported it to the staff. Guy was nice about it but then is trying to trap it with one of the plastic taco baskets. Hope they didn't serve anyone else food in that thing. \n\nAnyhow, we moved up the stairs to another table and then I noticed there was a bunch of steel wool stuffed in the corner. For those of you who've never dealt with rodents at home, this is a known way of blocking up rodent passageways. Needless to say, I think this location is dealing with an infestation and I recommend you stay away until they get it under control.", "author": "aaron f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-08", "description": "This is probably my worst experience with Chipotle. They get two stars for location and killing my hunger..... But service was terrible. I ordered a chicken bowl and noticed that the chicken was just about empty and a guy was cutting some fresh chicken to keep supply up. I asked nicely if I could get the fresh steaming chicken that was getting cut. Lady insisted that i take the last scope of chicken before they replenished with the new. I have been to hole in the wall fast food places that would jump to provide the freshest ingredients. Had to leave a comment as I am very disappointed in a place i frequent for lunch. With all the places around here will think twice before hitting Chipotle again.", "author": "Daniel J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "It's like any other Chipotle, but this has got to be one of the nicest locations I've visited. There's a decent amount of seating, but it's new and definitely trendy (well, it is in downtown SF afterall).\n\nThe location is good for a pre-movie or post-movie meal.", "author": "Leana L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-26", "description": "Worst Chipotle location!  White rice was gritty and small portion sizes for what you pay. Love Chipotle, but avoid this location!", "author": "Heather C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-25", "description": "Probably the worst Chipotle in the Bay Area.  The guy behind the counter was too stingy with the ingredients.  We had 2 burrito bowls and one had more rice.  UGH...\n\nThey also ran out of forks.  The spoons were wet...WTH...\n\nOne trash can was overflowing with garbage.", "author": "Melinda Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-21", "description": "First off, I love Chipotle. Have been regular customer since 2005 and even bought a t-shirt off the website! I've been to Chipotles in several states and am a big fan.\n\nThis is by far the worst Chipotle I've ever experienced. I've tried this store about 4 or 5 times so I feel like the data isn't a fluke. The employees are always rude, don't care, and move very slow. They act like they could care less to be there and go out of their way to provide a poor experience. \n\nThe work stations also weren't clean and food stations were cross contaminated (chicken was in the pinto beans, sour cream was in the salsa, etc...)\n\nI worked in fast casual 15 years ago for a few years and I'm sympathetic to the employees cause I know it's not easy, but this store needs serious improvement.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Hip-hip for scrumptious burrito bowls and hooray for switching from soybean oil to sunflower oil, eliminating GMOs from most of their ingredients!!! More info here: http://www.chipotle.com/en-us/menu/ingredients_statement/ingredients_statement.aspx\n\nSome things in life are worth skipping exercise for -- this is one of them.\n\nEat your way to a healthier America!", "author": "Elaine N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-19", "description": "I think this location caters more to the lunch crowd, because it was pretty much empty when I came here for dinner. Be aware that the prices are slightly higher at this location. Guac was an additional $2. I'm no Chipotle expert, but I think that's a little more than normal, right? This place does have the new Sofritas if you're interested in trying that.\n\nI respect that Chipotle tries to responsibly source their ingredients, using organic veggies and pastured animals when possible, but the food itself doesn't taste as good as their descriptions make it out to be. The cilantro-lime rice just tastes like plain rice, and the pinto beans cooked with bacon just taste like plain beans. The meats aren't very exciting either. They definitely don't contain the flavorful spices and seasonings you can find in well-made al pastor or chorizo from other local Mexican restaurants. You really need to stack on the salsas and guac to make the food taste more interesting. I wouldn't say that Chipotle is terrible, but the food is forgettable.", "author": "Nei N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "If you had asked me when I first started yelping if I ever thought that a Chipotle would ever be on my list of places worthy of 5 Stars I would have socked you in the face. \n\nENTER: Chipotle 4th Street. \n\nA co-worker and I went there for lunch and as per usual I got the kids meal. Now, before you judge, here is the deal: a big human meal is just TOO big for me, and the kid one is usually too small or just right, so I air on the side of less than WAY more. \n\nMy only issue with the Chipotle Kids meal is that the scoop of rice is like one bite. \n\nENTER: Edgar. \n\nI order my usual kids Quesidilla with chicken, and brown rice on the side. I mention to Edgar I'd love a more realistic scoop of rice if possible at which he gave me a HUGE mound of rice. To many this would be trivial, but on that day, in that moment it meant a lot, and I am here to tell you that it was worth all 5 Stars and that I ate every last kernel. \n\nThe End.", "author": "Katie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-15", "description": "So I was there.\"1-3 times\" the favor of my steak burrito was good  at chipotle.. The meat was tender and I like the  fact they have second choice of rice, brown or white..\nI always eat chip without salt and this time their chips were terribly salty 60- thousand times more then other places I've eating anywhere else.. Are u trying to kills your customers? Salty food are not good for us\nat  quantity you added to the chips..\nThe guacamole were not so tasteful as the one I've eaten in the mission area..\nThe customer services is not bad and they \ntook my order right..\nIt is a really big place and has good vibe \nAlright could you have a better chips without adding too much salt next time??", "author": "Pedro D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "This trip to Chipotle stands out for me. The reason being that the staff working on the 10/14 lunch shift were awesome. \n\nIt was packed out and the staff moved quickly and they were extremely friendly. One of the guys even let me sample the Sofritas (dank). The place was a little messy (how can it not be when they're slinging like fiddyleven burritos an hour)... All things considered this was probably one of the best Chipotle experiences I've had---and I totally had it for lunch in Atlanta today.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-11", "description": "So Saturday was my first time back to Chipotle since all the sickness and it was a huge mistake. I'm sick sick sick,  this is the only thing I ate that I did not freshly cook myself. I will never go to a Chipotle again.  If I don't get better soon they will def hear from my lawyer and the health department! Do not go here anymore!", "author": "Amber S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-12", "description": "This place made a bad first impression with me, I ordered my food, how am I suppose to eat it if they don't cut it first I  also asked for chipotle sauce, they gave me Chipotle Tabasco, what a mistake. Don't eat there!!!", "author": "Scott E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-31", "description": "One of the things I love about Chipotle is that it's reliable, this location was no different. The service, the taste, the quality, the portion sizes, even the look of the restaurant is the same no matter what location you visit. This one is on 4th Street in the Financial District, right next to the AMC theater. \n\nThe service was fast, however there were no forks and when we told them they were out of forks they said they'd bring more out but didn't, so we ate with spoons. This location does not have an outdoor patio like the ones I'm used to, but it does have some great people watching up at the bar looking out on the street! Guys in Jerseys, Ladies in scarfs, and toddlers eating ice cream cones. They had the front door propped open which let a cool breeze in, it also let a little bird in who hopped hopped around looking for a treat.\n\nThe food was good but as I said it always is. My go to order is the Burrito Bowl with chicken, black beans, corn salsa and light on the sour cream and cheese (they tend to drench it in that stuff). It's always more than I can eat in one sitting, which means leftovers and I like that.", "author": "Kayla M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-10", "description": "How do you ruin Chipotle for people.. Oh right, by being rude and treating your customers like they're the reason you're having a bad day. Eh, just walk a block over and go to the Chipote in Westfield.", "author": "Lani C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-06", "description": "LOVE LOVE Chipotle.\n\ni like this location because no crowds. its cleaner. definitely better than the Powell st location by Starbucks.\n\ngood portions.\n\nChipotle is taking over the world!", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-27", "description": "for some reason, this chipotle is awful. like worst chipotle i've ever been to & i usually love chipotle. do better.", "author": "Madison P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-09", "description": "The guy assembling my burrito bowl did not listen to my order. I asked him a question. He wouldn't even let me finish my question. He just put a lid on my order and moved to the next order. I don't know what he was irritated by, but I sensed an immense rudeness in his demeanor.\n\nAnother customer (an older lady) who saw this came up to me and said \"I'm sorry that happened to you.\"\n\nSince my order was incomplete, I had to go back to the back of the line to reorder.\n\nTerrible service.", "author": "Shashir R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-21", "description": "I am a regular here, and I had to update my review because I had a less than satisfying experience. I came in with a client to grab a quick bite before we went back to the Moscone center to set up for Dreamforce 2013.\n\nWhen I placed my order, I had told the guy a burrito and two tacos. After he began the burrito, he passed me along to the next worker. He did not make my tacos. By the time I had finished answering the questions about the burrito, I was down the line to the cashier and other customers were already ordering.\n\nWhen I expressed to the manager at the front that my tacos hadn't been made, he explained to me that usually people order one meal and then move along. HUH? How does that make any sense? I asked him if I should get back in line and he said no, we can make them. He asked me what I wanted and I told him, however he was extremely rude about it. Not to mention I was now holding up the line that was non existent when I first arrived. \n\nI was disappointed with the Chipotle's customer service, especially because I am such a frequent visitor to this location, and on top of that I brought a client with me who witnessed the whole thing. She even said to me after we left, that she heard me express that I wanted two tacos and a burrito.\n\nNot happy with the staff or that experience, and because of it will probably not return. Thanks for ruining my love for Chiptole.", "author": "Briana W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-01", "description": "Oh chipotle why won't you open in Honolulu? Was there for conference and had to have my beloved chipotle. Decided again veggie fajita burrito as I only recently discovers that lots calories in the wrap (duh). So went for the bowl with sofritas which I have never had before. Deliciousness! Chips, guac, everything for toppings. Yum. The door sticks open so can get freezing cold inside when inconsiderate patrons leave the door open. But whatever it's not some 5 star French restaurant. Enjoyed my delicious bowl and took off.", "author": "Jannet L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-13", "description": "The worst Chipotle experience! If the managers are reading this... The guy at the line, serving meat, on Thursday the 13th of August, at 6:20pm... He was rude and put in 2 or 3 pieces of chicken in the tacos.", "author": "Siddhartha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-14", "description": "The place is nice. The food is good and its huge. Couldn't finish it. Nice place to just have a nice chilled lunch", "author": "Suryo H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-24", "description": "Precursor\n- I used to go to this chipotle three to four times a week and order a burrito bowl with all the trimmings; Guac, corn, salsa, you name it.  I stopped going about three months ago because a dispute i had when asking for extra portions.  I only went today (1/24/16) to get a burrito bowl for my girlfriend.  During the dispute, I complained to my servers about the low amount of meat my friend and I got (1/3rd of a spoonful).  I asked for more and what I got was another quarter spoonful but was charged for DOUBLE MEAT.  The portions USED to be generous and the service was good.  The service is still  acceptable but the food has been on the decline for a year and a half.\n\nPros\n- They do give a lot of rice and beans these days so if carbs are your thing, this is the place to be.  However, I go to chipotle for a FAT-ASS meal, not just rice and beans.\n\nCons: \n- The portions these days are definitely under.  My friends and I used to get a full scoop if not more.  Recently, we're lucky to get 3/4 of a spoonful.\n- The guac is often too sour.  It's like they drenched it with lemon juice..\n- The chips are a hit or miss.  Sometimes they're amazing.  Perfectly crispy, just the right amount of salt but sometimes they're soft and tasteless. \n\nShoutout:\n- The young new hire with dandruff-ridden hair hidden who mocked me after my complaint regarding portions.\n- The shorter stocky hire who responded to my request for double meat by giving me another 1/4 scoop instead of a full.\n\nI do want to write that the redeeming quality of this Chipotle is the customer service.  There is a young skinnier asian hire who always greeted me with a smile and most of the female workers were nice and friendly.", "author": "Alex Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-21", "description": "First of all I'm here and this girl with long hair and a septum piercing gave me AND my friend THE WORST attitude! Then she's gonna turn around and start kissing on her boyfriend. I don't know where she thinks she is, but this is her workplace and she unfortunately has to deal with customers... Sorry you didn't have enough time with your boo but I didn't want sour cream and your stank attitude all over my tacos.", "author": "Jocelyn T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-17", "description": "Used to kinda like here, not it anymore.  Only customer n still treated shitty, forgot my guacamole n drink n rude, never again", "author": "Rick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "So glad we stopped in to chipotle this evening for dinner! Customer service was on point-. Both of us really enjoying our burrito bowls w torrillas on the side.. The house vinegar eye is also so good and glad they were stocked with chipotle tobacco. Again the lady making our bowls was so helpful and kind who was working this evening.", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-12", "description": "I enjoyed the ambiance and the food, and the food was standard fare.... One thing that didn't tickle my fancy was the overpriced guac Next time I'll bring my own and I'll give it an extra star.\n\n- C", "author": "Claire B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-12", "description": "Had burrito bowl for lunch while at a conference as Moscone. Helps to get there a bit before the lunch crowd. Good food, reasonably fast service. Not a lot of seating.", "author": "Donna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-25", "description": "Guys, McDonald's divested their shares like 6 years ago. Chipotle and Mcdonald's broke up. Chipotle is practically a small business with a million locations.\n\nj/k!\n\nInsider tip: Do not ever go here for lunch unless you order from their website. Breeze through the line like a drunken celebrity at a Vegas club. Do not wait in that ridiculous line, ever. This location will keep your food warm, unlike New Montgomery who will serve you cold food. Beware the other locations! \n\nThe burrito bowl is what most food-obsessives / neurotic women get. The fajita veggies is a scam to serve you onions, do not get these. If you are a delicate flower who does not like the taste of soybean oil, know that the only meat that they do not prepare in this is the pork. The guacamole is always great. Cheese is optional. Double meat if you are feeling sassy / like you never want to eat again. Enjoy your ketosis, comrades!", "author": "Maria D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-25", "description": "I love Chipotle, but this location needs to get their act together. I waited in line for 25 minutes (other locations speed through a comparable line in 10), and saw them tear 2 burritos just while I got my order fulfilled. The usual Chipotle efficiency was completely lost because burritos kept getting swapped back and forth (I think there was a sole worker capable of mending the pitiful mass of bungled ones).\n\nI've been back here a few times, mostly because their incompetence resulted in a free order of guacamole once. Every successive visit has been a disaster, so save yourself the aneurysm and walk an extra block to another Chipotle while they hone their skills. If you must come here, get a bowl with a tortilla on the side. The chances of a torn burrito are too great to risk, and at best you'll end up with a ball-shaped abomination. Seriously, they're the worst.", "author": "tianyu l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-16", "description": "Chipotle for a quick lunch with co-workers! This location is primo right smack in the middle of Yerba Buena. I like the fact there is always a table, but I do agree with other yelpers they need to have one if the million people behind the counter tidying up the tables! Been able to have great power lunches here though!!", "author": "Marie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-04", "description": "Just ate a burrito bowl and the meat was questionable so I took most of it out. Not coming back ever again.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-21", "description": "First time here tonight and it will definitely be my last time. If you think the burrito here is \"massive\", then you haven't experienced authentic Mexican cuisine. I should have known what I was getting in to when the guy behind the counter was scooping ingredients out of catering trays. \n\nHad to try it once, but will never be back...and why was my beer warm out of the fridge?", "author": "Trav M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-22", "description": "Forget authentic Mexican food, I'd take Chipotle over it any day! I love this location as it is a lot less crowded compared to the other ones in downtown during lunch in the financial/soma areas, EXCEPT for days when there are conventions or something going on at the Moscone. \n\nChicken or Vegetarian burritos, can't go wrong with this and custom fix-ins. Fresh, fast, and so good. \n\nP.S. Chipotle's Tabasco is sold at markets. Try it and you won't regret it!", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-04", "description": "Love every other chipotle but this location. Ordered chicken tacos and each one might have had three little cubes of meat. They give you plenty of cheap lettuce!", "author": "Stephanie E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-30", "description": "This location was the worst I've visited in the USA this far. No white rice at 6:30pm? Needing 30 min to make some? 8 people behind the counter, 3 actually working. Portion was so skimpy I contemplated eating the cardboard bowl. Everything (including the barbacoa) was ice cold. This place has issues.", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-17", "description": "Quick Tip - Order the Steak Tacos. Maybe the best thing on the menu. \n\n\nMcDonalds (owner) have done it again. Took a ethnic genre like mexican food and americanized it! The result? Not bad. \n\nIn comparison to the other mexican fast foods such as taco bell, dell taco, and Baja fresh it is definitely a step up! They keep their menu really simple: Burrito, Taco, Burrito bowl and Salad. The food seems more fresh then other fast food chains since they serve it right in front of you. Prices are fair for fast food restaurant.", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "My favorite Chipotle location so far.  Nice, new store in a great location (to go along with the new Target), with always friendly employees.  I seriously don't think I've ever seen a food-service employee with as big of a smile as I did tonight.  She was a happy girl... Very refreshing.\n\n(The reason I held back a star has more to do with the category of eatery--it's more a fast food-ish chain, rather than an actual restaurant.  5 stars for fast-food though!)", "author": "Brian S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "This location is pretty much like all the others.  Poorly wrapped, messy burritos is a standard at all Chipotles.  I used a coupon to get a sofritas (tofu with roasted peppers) item.  I decided to get the sofritas burrito.  The sofritas is a little on the spicy side.  The tofu is not half bad.  My only concern is I dislike like how they butcher the tofu into little pieces.  The sauce mixed with the tofu is also too liquid-like, thereby creating a very wet burrito.  The only way I would ever order the sofritas again, is if it were free.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "This place is great! Good food, good price and tasty! The location is great too because there's enough seating for the lunch crowd.\n\nMy favorite item is the steak bowl with chips and guacamole! Mmm. Can't get enough of their guac! \n\nI went around 11:45 to beat the lunch crowd and it worked out because there were only 2 people in front of me! That's was a first!", "author": "La Bon-Bon A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-18", "description": "First thing I didn't like was the shorted me on the chicken secondly the service I receive was horrid no eye contact very low voice I couldn't even get a caserio burrito because the dude couldn't even roll lol. The food seemed cold and flavorless Mexican food for white folks very bland taste smh", "author": "Kem U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-05", "description": "Chipotle is a great alternative to your fast food lunch. The sallads are great and it seems like they buy proper ingredients for your to enjoy.", "author": "Jens G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-19", "description": "Food pretty good but they refused to let me use the bathroom because they said it closes after 10pm. Pretty creepy.", "author": "Richard A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-30", "description": "They just opened this location not long ago and it's close to the office.  A group of coworkers and I went for lunch.  The staff seemed really confused but what topped it off was the cashier who swore we weren't paying for one meal (which we finally proved that it was included in the coupon).  She was just so incredibly rude, mean and it turned me off to ever wanting to come back.  Horrible customer service", "author": "Amanda K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-18", "description": "Lunch before 3pm, there will be a wait. Go in after 3pm and there's usually no wait. \n*Favorite is to mix the taco shells and meats, nice variety.\nFriendly staff, when it's slow they're very attentive. When the chaos is brewing they try to get you in and out, fine by me.", "author": "Jenna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-19", "description": "Stopped in for a quick bite with my lady prior to seeing Wreck It Ralph at the Metreon.  Cool space, efficient staff, and absolutely delicious food! Veggie Burrito is King!  Fast, and Delicious!!!!  They don't have their beer license yet, but it's in progress.\n\nThey lose a star for not having Tapatia or Chilua... Tabasco is not for mexican food! (Aside from the green Tabasco, all Tobasco is rubbish)", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-24", "description": "Check your chips before u but them because they have been stale 2 times in a row for me. Not coming back here I'll try a busier chipotle that actually has fresh chips. I asked cashier if they were fresh and she replied, \"I dunno.\"  Good answer. How bout u ask or have someone who would know? This place sucks.", "author": "Teddy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "I've always like this Chipotle. Good fresh food and cool staff\nI love the chips and salsa and the quesaritto is great, \nI also like that you can add hot sauces to your order.", "author": "Damion B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-23", "description": "2 p.m no check available and have to wait for 10 mins. Typical Chipotle gets uber busy  during convention times. Close to shopping corridor on Market Strett.", "author": "Joe R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-08", "description": "I tried both the Chicken and Beef burritos here, and they were both pretty disappointing. Maybe because I am used to so many good places in SF, with large burritos, fresh salsa and chips. They were a little more than half the size of a regular burrito in many SF shops, but probably enough for lunch. But I guess what struck me the most is they just tasted bland to me.", "author": "Dave G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-09", "description": "It sounded like a good idea: a Sofritas bowl with guacamole. Turned out to be a meh meal that cost almost $10.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-28", "description": "There's not a lot to add other than this is indeed a Chipotle. It's located close to where I work and you can get your burrito or bowl to go and head for Yerba Buena park. The service has sped up considerably since this location first opened but you run the risk of the place being mobbed by conference goers. The main seating area is also kind of awkward...long, elevated benches with bar stool style seats right next to the line of people waiting to order.", "author": "Chapman S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-18", "description": "Ordered a simple quesadilla . They don't ask for any extras and they forgot about it on the grill. I wanted quacamole, they did not give it.  I had to ask them to take it off the grill as it was burning.  they never offered to redo  the order or refund our money. Worst chipotle experience ever.", "author": "Trevor J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-14", "description": "We've given this place several tries as we LOVE Chipotle and this new location seemed convenient by the movie theatre. However, we've been severely disappointed every time we've tried to eat here. The staff is very unorganized and are not very friendly, they are ALWAYS out of some sort of meat or guacamole, which is kind of weird and disappointing. They also don't seem to be very customer focused, which is sad b/c Chiptole is usually amazing with customers. We will go out of our way to go to a different one as to avoid this location. That's unfortunate and we hope you make some changes!", "author": "Brent T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "This chipotle is much better than the one on Market street or on New Montgomery street. The staff was friendly and the food tasted much much better than the other two places.", "author": "Nishant B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-15", "description": "This is the new Chipotle that just opened up in the Metreon building. My coworkers and I came over to check it out on Friday for lunch.\n\nThe awesome thing about it: huge dining/seating area. Out of the four Chipotles that are within walking distance in SOMA/Financial District, two have really crappy, crowded seating. I was ecstatic to see individual tables with lots of room around them, and many places to sit. There's also the stools with the big communal tables if you like that as well.\n\nThat's about where all the awesome went away though.\n\nThe staff was friendly and considerate, but it was a difficult run through that line to get my burrito. One employee had a really difficult to understand voice (I don't know quite what it was, but I had to ask them to repeat at least three times to hear what they were saying, and I heard the next two people behind me do the same thing). This employee also screwed up my request for a whole wheat tortilla, and I wound up with a white tortilla with brown rice. Eh, no big deal. Then at the end of the line, when I was getting toppings, I requested extra cheese. I said it three times, and the employee started rolling it up, and my coworker actually spoke up to say \"hey, she asked for extra cheese\". The employee didn't even hear *him* request it, and by this time, it was mostly wrapped, so I told my friend to not worry. I don't know if it was just too noisy or if the employee was so focused on just finishing up what was in their line that they weren't listening to me, but I was a bit disappointed that I didn't get what I was trying to request.\n\nAh well, I sit down, ready for my burrito. But first, I go on a hunt for the #1 thing that brings me to Chipotle over other burrito joints... chipotle flavoured tabasco sauce!\n\nWhat's this? Just regular tabasco? Oooookay? Friend goes to the cashier and asks about the chipotle sauce. Nope, they're out/don't have it. \n\nThis was my happy face... :|\n\nI'm sorry, but why in the world would they *NOT* have this? Every Chipotle I've gone to has it and to be frank, it's the only reason I go there. I can get better burritos in other taquerias around the city, but I've not seen any carry chipotle tabasco sauce. \n\nFail new Chipotle shop, fail. I'll go to the one in the mall since it's the same distance *and* they have the sauce. The seating sucks, but I can deal with that if I have my tabasco.  Get the right tabasco sauce at this one, and I'll re-do the review and give it at least one more star.", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-20", "description": "There are people who love Chipotle, and people who are strongly against it saying it's blasphemous to traditional mexican food, etc etc blah blah blah. I love Chipotle. I would eat it every day if I could. Like In n Out, it's always consistant. I can get the same delicious thing every time I go and it will be just as delicious as the last time I had it. \n\nThere's nothing to really say about this location other than it's clean and big. Every Chipotle is the same, food-wise. I was eating a burrito here last week and a staff member wiping down the long table I was sitting on the end of, asked me how my meal was. I'm not use to that at a Chipotle. I was caught off guard, considering my mouth was full of burrito and I mumbled a bunch of noises and he smiled. They get a star for that. Promote this man.", "author": "Catface G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-31", "description": "Food is great as in all other Chipotles. \nThe place is generally clean and nice and there are plenty of other food options around, in case anyone from the group doesn't feel like having Chipotle.", "author": "Maria Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-03", "description": "Stingy on the ingredients. Pricier than other locations. I'll make sure everyone I know to avoid this place.", "author": "Peggy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "The kind of place you love to be derisive of: a chain, not authentic ethnic cuisine... but the ingredients are so basic, put together in the right proportions, you can't help but just eat it anyway. I've only been here twice (once to this location and once in New York where I honestly was not impressed at all). The burrito bowl I got was mammoth. Felt like perhaps a little bit too much cheese. I can hear you now: how can there ever be too much cheese? Well, there can. But if that's the worst problem with this place, that's pretty good.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-27", "description": "This Chipotle gets 5 stars for being open until 10pm, located in SoMa District, and lots of seats ( as opposed to bar stools that are uncomfortable on O'Farrell and so on)", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "Same Chipotle quality as all the others, but much less crowded than the New Montegomery location.", "author": "Allison S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-12", "description": "This is not Mexican food. It's American. And it's not very good. The menu is extremely limited and the burritos are fat but small. I don't like cilantro and they put it in the rice. Blech. Go to the Mission and get a real burrito. Chipotle isn't worth the trip.", "author": "Julie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "This is a great location - the service is really friendly and the servings seem a little larger for some reason. They try to keep the tables clean, but it's definitely a challenge given the volume that goes through these doors.", "author": "Annie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-30", "description": "I have been to this Chipotle several times and they rock!  Very customer service orientated and nice portions.\n\nGive them a try.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-11", "description": "The only thing I eat at Chipotle is their veggie bowl, and I've had that veggie bowl in tons of Chipotles all across the country, and I must say that this is one of the not-so-good ones. Reason? Well, their bowls seem like a small snack...they just don't put enough food in it! (while at other Chipotles I find it really hard to finish a bowl) Also, their ingredients don't seem very fresh...I've been here only a few times and maybe I've come here at the wrong times...but \"Meh. I've experienced better.\"", "author": "Srivatsan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-30", "description": "Slowest chipotle I have ever been to. It wasn't even busy but they managed to make the line take at least 10 mins with less than 10 customers. Need improvement.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-10", "description": "Went here the other day.  It was fast and good.  Friendly staff.  I love their salads with chicken.  Healthy way to eat yummy food.", "author": "Sam O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-18", "description": "I had been to this restaurant on this Saturday (August 17, 2013) at 2.00pm.   I had ordered for two vegetarian burrito bowl.  When I began to eat, I found the rice in it to be raw (not boiled enough - in fact it is less than half boiled).   I immediately brought to the notice of the guy who was at the cash counter.    His reaction was very cold, not at all regretting - He simply said \"Oh! I will let them know.\" and turned his head to get on with his work.    He simply didnt's care which bothered me more than the raw rice.   My money went waste besides facing this utterly callous attitude.", "author": "Sudhakar P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-03", "description": "Today Dec. 3rd, a bit disappointing normally they are more generous on guacamole extra that I paid for. I pointed it out but I was totally ignored. What is going in with Chipotle. The last time I was here, the service was the slowest. It must be just this branch! The ones in o'farrel and 2nd are both much better!!!", "author": "Manila A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-23", "description": "i am a regular here but NOT ANYMORE... this place gets worse and worse each time i go there... rude employees and very dirty no wonder they are not as busy as they first opened...", "author": "Al M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-05", "description": "chipotle...what is the hype with it? i don't know ...but burritos are never meant to be get here..save your money for the mission, but on the other hand...tacos and burrito bowl seems decent. i'm not sure if it is the toppings/veggies that make my meal cold everytime because its topped with veggies more than rice/meat. i dont know...but it's still good for that.", "author": "Marsha C."}
