{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-08", "description": "Came in for a burrito bowl the other day.  Noticed a issue with their food handling.  Reached out to their (corporate?) office via email through the chipotle website and to my surprise I received a very prompt reply with positive feedback.  Now I'll see if they will follow up on their word.", "author": "R K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-22", "description": "Being a minor chipotle investor, I understand the financial reward with uncharging customers. It makes my yahoo finance look pretty in the morning\n\nTo that point, I always delve into the product at a consumer level. For example, the target up the street. Great idea to simply shopping.\n\nSo, I ventured in this chipotle recently. Asked for a burrito bowl. Asked for double meat, chicken and steak with a 1:1 normal ratio is what I asked for. Added guac obviously. Total =$17.50. I accepted it knowing what they had done \n\nI love it from a stock owning perspective. \n\nDOUBLE CHARGE THE WAY MORE EXPENSIVE MEAT. A \"side\" of steak is $5, chicken is ~$2. Funniest part is they'd charge you for a \"steak\" bowl too.\n\nJust look out at this and every other establishment. If ya don't, I may get rich off profit from your dividends in the future", "author": "Michael L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "Homeless person in the entrance asleep. Nothing more.\n\nI hope Management allows employees to act on this, as this will keep me away from this Chipotle in the future.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-15", "description": "Really crappy service here and it was the first time in my life I've ever been to a chipotle that didn't have guac lol. Like ok I get it people run out but you're a business. Stick to keeping your inventory in check. \n\nIt was fairly clean but also extremely small and not well appointed. \n\nFood was actually more bland than other places I've been so idk maybe add more seasoning or care about your job :/\n\nOh and that queso.... forget it. It's gross and the chips are stale here. \n\nPASS!", "author": "Bella B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-09", "description": "I like you, Chipotle, but your lack of quality control is amazing. The \"handful\" method by which your burritos are made sometimes results in a burrito that I feel unwilling to pay for by the time it's finished, because your burrito artists with small hands pick up small handfuls of fillings, resulting in a small burrito. A photo i took of two of the \"same\" burrito clearly shows that one (the one made by (duh) the person with the bigger hands) is at least 1.5x the size of the other one. Up to now, why can't you standardize the way they are put together? Also after all these years, you insist on highway robbery for a TEENY amount of guac, which is arguably necessary for the full Chipotle experience. If you do go here, people, keep telling them you're not \"ready\" to order until the person with the biggest hands is ready to make your food.", "author": "Theresa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-18", "description": "Stopped in today at this location for a chicken burrito bowl.  It was horrible.  It tastes like an entire container of salt was poured over the chicken and the other items included in the chicken bowl.  Horrible!  We did not eat there but brought it home.  They should be ashamed of themselves.", "author": "Patricia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-24", "description": "Typical Chipotle spot just like any other spot. Same shit different location. Walk in and there is a line. When its your turn you pick and choose what you like. At times the guys behind the counter cannot wrap a damn burrito.", "author": "Meishi M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-21", "description": "By far the most disgusting experience I've ever had with a food order.  I'd rather lick the sidewalks clean in downtown San Francisco than put food from this place anywhere near my mouth ever again.", "author": "Dylan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-21", "description": "I came here with Mom for lunch one time after helping her with groceries at the nearby Lucky's. My experience here was simply dreadful. The service here was very poor in that the workers seemed more annoyed than anything when asking us what we wanted. The worst part though was that our Chipotle bowls came out looking like a pile of unappetizing slop. It's as if everything was mushed and thrown on without care. Everything about this place was all-around bad.", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "This is my favorite chipotle. Way better than stonestown! The staff is always fast, friendly, efficient; it's small, there's always parking, there's hardly ever a line and it's certainly never packed in here and it's pretty clean! The portions are better than any chipotle I've been to in a while--they'll give you more if you ask! Sol is here every time we eat, he's super sweet. Stuff some money in the tip jar for these guys!", "author": "Danica N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-14", "description": "They were out of brown rice and were running low on chicken. My mom and I had to wait for them to completely finish cooking the chicken, but the brown rice was apparently going to take 20 minutes. I was running behind schedule and had to choose white rice for my burrito, which I never do. Neverless, their guac never fails to disappoint!", "author": "Erica K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-13", "description": "need to listen on basic instructions. always ask for a scoop of black beans and they always give me like 2 and a half with hella sauce. same with the sour cream. always dripping hella sauce all over my car and clothes. they never close the box all the way too. literally just slaps it on and hands it over", "author": "Kid V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "After Medina's Catering stood us up for the catered meal at our son's wedding in Stern Grove park on Oct 1st (numerous emails confirming date/time/location/menu), we made numerous frantic calls to nearby restaurants as at this time, 30 min prior to the ceremony, any food, wedding \"appropriate\" or not was going to be just perfect! The Chipotle restaurant on Sloat Blvd said to give them an hour and they'd have food for 120. After the ceremony a few groomsmen headed over to get the food and the evening was saved. Thanks Chipotle!", "author": "Lance A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-25", "description": "Have you want to come here for a rice plate or Bowl whatever you want to call it or burrito then you're fine but if you want to come here in order a salad please don't do it! Came here because I was frustrated leaving Subway I tried to order a salad there and they just gave me a bunch of chopped up lettuce I left came here in hopes of getting a real salad like the picture turns out nothing like the picture chopped up lettuce with virtually nothing a scoop of corn a scoop of tomatoes and salsa through it all together and called it a salad for $9 I don't think so never coming back!", "author": "Michele T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-21", "description": "I looooove chipotle, have always been a big fan. Obviously it's not real Mexican food like El Farolito or anything but it's usually delicious. However, this location specifically... idk what they're doing but the flavors are all wrong and I've given this place mutilple chances.\n\nThe last time I went, I got a steak bowl with everything in it plus guac. When I got home, I switched on Netflix and was so excited to dive right into my bowl. But the first bite..... omg my tooth almost chipped off. I immediately spitted it out to find what seemed like small pieces of avocado pits. Wtf?! My mistake was having the guac added right into my bowl because spritz of these pit balls were all through out the bowl. It was so annoying and disappointing. I couldn't even eat it anymore. So I haven't been back since.", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-02", "description": "Last time I came here I had severe stomach flu from getting a sofritas bowl. I was hesitant to come back until today, just cause I'm too lazy to cook. Of course I'm hesitant to order food at first, but I'm sure things will turn out okay. Of course there's a line and while in line, one of the food preppers yells for the girl to come out of the bathroom. She does and takes off her glove and washes her hands with just water for like 7 seconds. No soap. I know that's she was using gloves and stuff but after my last episode and seeing that they can't even take time to wash their hands before helping out with the cooking bothers me.", "author": "Jay Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-28", "description": "1:45 p.m. Got a call from the corporate office saying thanks for letting them know and that they will discuss customer service and courtesy with the staff.\n\n1:15 p.m. Such rude service from the cashier. No \"please\" or \"thank you.\" Yikes. This is when you're supposed to be upping your game, Chipotle!", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-19", "description": "Kudos to Chiptole\nfor showing other\nchain places\nhow to properly integrate integrity\nwhen serving food to the masses.\n\nI'm really impressed and pleasantly surprised\nthat a chain can be so committed to\n \n1) going local (for the most part),\n\n2) rejecting GMO's\n\n3) preparing food daily\n\n4) and using humanely raised meats.\n\nBut they're still still a chain,\n\nso for better or worse are\nbound to a level of uniformity that \nalthough promises consistency\nsmacks against\nartistry and creativity.\n\nThat being said,\nI still have to applaud their effort\nand creative take on\nMexican food.\n\nI usually go for either the \nveggie bowl or veggie burrito\nwith brown rice, black beans,\nand fajita veggies.\n\nBoth are really good and really filling.\n\nAnd their guacamole is also surprisingly good.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-24", "description": "I love Chipotle. But I agree with all the other people who say this location sucks! \n\nI frequent this one because it's the closest one to my place. I've noticed a couple times that their food isn't the freshest but just ignored it. But after last night, I'd much rather drive over to Stonestown's chipotle. \n\nWe got here at 9:15pm and almost thought it was closed. All the chairs were stacked up by the wall and the mop equipment was out and ready for use. No smiles, no thank yous.. Just a bunch of kids cleaning up and listening to loud music. Who knows how long some of their food has been sitting there. I can't imagine them lifting a finger to replace an item. The employees clearly do not give a shit about anything but clocking out right at 10pm. This is a complete insult for people who rush over to places before closing and to people who have done their share of fast-food customer service. \n\nTo those current employees: Get a new job, kids! Somewhere that you think your selfishness and unprofessionalism would be appreciated.", "author": "Daisy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "I come to this location because it's not busy like the one in Daly City or Stones Town.  Parking is not hard to find.\n\nStaff are friendly and attentive.  It's fast food so one would expect to order their food and have it right away.  I always take my order to go.  It's chipotle nothing really special about it.   When I want something somewhat healthy, this is my to go to.  I normally order the bowl with brown rice, pinto, chicken, pico, hot sauce, corn and extra lettuce.  No sour cream or guac.  Plus you can ask for tortilla on the side.  \n\nIf I want authentic Mexican food I'd go to taquerias in the mission", "author": "Junaline G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-21", "description": "In the same week this chipotle had NO cheese and tonight they have NO beer.   Really, maybe go to the grocery store next door and why are your chips here always not fresh.\n\nAs a huge chipotle fan it's to bad won't be coming back to this location.", "author": "Ken C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-27", "description": "This place was alright. I feel like they skimp on the food here but I think most chains like this do. Food was good. I always enjoy a nice burrito bowl with either carne asada, barbacoa, or chicken.", "author": "Carmina D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-31", "description": "**Because I got one free.\n\nYES, it was free for Teacher Appreciation Day. I ordered two of the exact same super chicken burritos. It was pretty much the same since the last time I was there in 2011. Chicken is dry and again, thrown together. I don't speak Spanish but I asked for some toppings in Spanish, of which I just ended up pointing to.  Again, I took them home and it was dry so I added my own salsa to the burrito.  \n\nAs far as the stars go, it's \n* for the food\n** for the service\n***** for the free burrito.  \n\nI don't know if there will be another Teacher Appreciation Day for next year and I'll probably head to another location like at Stonestown. Again, this is not a positive review and I normally wouldn't go there but what can I say for a 2 for 1 deal?", "author": "Stefan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-19", "description": "I normally don't like to write negative reviews unless it something that needs attention ASAP..  I eat a lot at Chipotle and I have some quite sometime,  even with all the negative publicity they are getting.  \nI don't even know where to begin on writing this review so I will list the main points.  \n\nFood -  Food was okay,  the tortilla was stale and tasted very old,  the steak was dry and a little less than warn,  not yet cold but close.  \n\nService -  both employees behind the counter were very unprofessional and seemed like they didn't care about being there. I felt like I was bothering them by ordering a burrito,  after I sat down and ate my food they spoke to each other very loudly and had very foul mouthed conversations (other people in the store at this time). \n\nCleanliness -  horrible,  corn and rice on the tables and floor.  I had to get napkins and clean my own area to sit.  I didn't even get a red food basket with my burrito so I had to use napkins to act as my food mat.  The employees were not busy at all,  they just goofed around while tables were dirty,  one person just took his food and left  because he couldn't find sitting, and there was maybe 5 people max inside. \n\nI am not going back here again until I start seeing some legit 5 star reviews about new management and how they changed for the better.", "author": "John T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-10", "description": "Do not go here. The promotions are not honored here. As a lake shore plaza regular I am disappointed in this particular chipotle. I have high standards for chipotle and this location, today at least did not meet my expectations. # letdownanddisappointed.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-17", "description": "I love chipotle and am a loyal customer.  Even when they had the media scare about their chain...I religiously still went to get a bowl at least once a week.  Usually...4 stars in my book!  However, this location tonight got me pretty upset.  Walked in at 9:35...they were cleaning up...I almost didn't go in because they looked like they were closed.  Walked in and had two people in front of me.  I waited and Ordered a chicken burrito and a beef bowl.  As we went down their cafeteria style topping additions...we get to the end and the guy manning the salsa, corn, lettuce, etc. tells me he has no more corn.  Then out of nowhere another worker comes up with corn.  The first guy then asks where you find that?  Second guy replies...in the back.  Then first guy goes we have no lettuce...I looked at him and asked him...\"no lettuce?\"  He says no...I say \"bye!!\".  \n\nThats just be BS...they just lazy and don't want to get more lettuce (just like the corn) cuz they wanted to get out of there as they we're already starting to close shop at 9:35pm.\n\nI would think after all this media scare and they then giving away free burritos, chips and salsa to get the trust back from customers...that they would accommodate items on their \"normal\" menu (lettuce and corn)...I was wrong.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-11", "description": "Just witnessed the most disgusting and vile thing I think I have ever seen....a man changing a toddler's diaper on one of the dining tables, and management did absolutely nothing.  Made me sick to my stomach!  When I called the guy out, he blamed it on the location for not having a changing table.  Never again!", "author": "Maureen R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-23", "description": "I have come here multiple times and it's basically just like any other Chipotle...always hits the spot. I also order Postmates and this Chipotle delivers to my house. Last time I ordered Postmates, Chipotle forgot my chips and guacamole and a couple ingredients in my burrito bowl. I called them and they apologized and said I could come in and get it....I ordered Postmates because I specifically couldn't come and get it....\nAnyways, they said next time I come in, they will comp my meal.\nI ordered Postmates from them again hoping it would be better this time. I called right after I ordered and spoke to Troy, who I asked to add in 2 sides of salsa and he said no problem! When I received my order, the salsas were not in the bag. It's pretty disappointing because I even spoke to someone who confirmed they would include the sides. \nI guess I learned if you want your order right, you have to go make sure it's being done right.", "author": "Cheyenne N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "I walk by when I am at Lakeshore Plaza. Today, I was very hungry for a burrito so I came in and ordered one. I ordered the carnitas burrito with steamed rice, pinto beans, cheese and lettuce. The carnitas burrito was delicious and I enjoyed it. I am craving for another burrito as I write this review. Overall, good first experience here. Friendly staff members and efficient service.\n\nThe Carnitas Burrito - $6.95\nSales Tax - $0.61\nTotal $7.56\n\nAll in all, I like it so I'm coming back for burrito bowl and taco cravings. Nice friendly staff members and clean restaurant.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-07", "description": "Came here dressed in minimal costume to get their $3 burrito deal. I actually like chipotle enough, but went more often during my college phase when I was less picky about food and had little to no food options. Now I don't go unless there are extra incentives like the Halloween costume deal or I'm in a huge hurry to cure my hunger/Mexican and this was the closest place to stop by.  The portions are big and service is quick. It was awesome Guacamole was available with the $3 deal. I never get it in most occasions due to the extra cost. I will come again next Halloween for sure!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-09", "description": "Mediocre burrito for $10. Not coming back.\nSmaller portions and upped prices. Better to go to any other fast food restaurant nearby. Meat and tortilla are both dry even after I doused it in salsa. Wouldn't recommend to anyone and am never coming back.", "author": "Rob R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-06", "description": "mehhhh... my first experience at this location suuuucked donkey balls. and I've never experienced such shitty customer service. I understand they just opened but the other locations I've been to where they first opened wasn't ever this bad. \n\nthey need to hurry up and get their shit together... like... fulfilling online orders when they actually go through (and actually providing me with ALL items that were ordered), learn how to make burritos without them falling apart. \n\nanyway, they had way too many workers running around like chickens with their heads cut off. hopefully they'll be much better in a month or so. for now, I'll stick to the chipotle in colma and westlake.", "author": "Ann T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-06", "description": "Chipotle seems the only edible option in this shopping center (or the only one i haven't yelped).\n\nthis chipotle is the smallest  i've seen,  just 4 tables for sit down and an serving area almost 2/3 way to the door.. (15 feet?)\n\neats: sofritas (tofu) burritto (6.55)\n-didn't really taste the fried tofu, just the med  spicy salsa and the veggies\n-loaded with crunchy brown rice, corn, black beans, \n\nfrijoles refritos:\n-ok alternative to starving, not hating chipotle (yet).\n-1st mex eatery i've been without a mexican working therein.\n(servers here must have salsa/tequilla in their dna.)\n-smiling cheerful all around. 4 stars", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-28", "description": "Saturday night, the friends and I wanted something healthy but not too healthy for dinner.  I've never had Chipotle so why not. \n\nI got the salad with brown rice and carnitas.  Carnitas were nice and tender.  Black beans and rice cooked perfectly.  Everything was good.  About an hour after our meal, all 3 of us had stomach aches.  I'm gonna go with my hunch and say it was probably from holding in gas from all those beans...", "author": "Linda N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-01", "description": "After coming to this Chipotle, I've decided to never purchase anything from Chipotle again. The amount of money they charge for a burrito is ridiculous when you only get tiny spoonfuls of food. Chipotle used to be good, but lately it's gone downhill in quantity and quality.\n\nI'd rather spend $8 on a burrito at a real taqueria where you get a massive sized burrito. The only thing that's good is the guacamole...which I have the recipe to so I won't miss Chipotle anymore.", "author": "V M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-17", "description": "just stay away. walked out of line mid order. i refused to pay for that low quality of food.", "author": "David M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-12", "description": "Needed quick late lunch. This Lakeshore Plaza location is less crowded than Daly City but I still do not like the food at Chipotle. Bowl, burrito, taco or salad does not taste close to Mexican food. Better taste in Mission district, but in a hurry.", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-13", "description": "Was in the area and decided to get chipotle for the go. Upon entering it didn't look like the cleanest chipotle I've been to. There was only two employees working the line. It didn't seem like they had a routine down like all the other chipotles have down.  The meat sections were dirty and just the whole thing didn't look clean. I ordered a chicken burrito with white rice. They were running low on rice and I was asked if I'd like to do half white and half brown, I mean I guess since there isn't anymore white rice. Then we get to the chicken and they were out on that. We had to wait for more chicken. The guy who was making my burrito was very friendly, when getting ready to pay he said the meal was on the house because we had to wait. Which was very nice. Getting into the burrito the tortilla was hard, and the chicken seemed like it wasn't cooked all the way. I appreciated the free meal, but I wasn't able to eat it due to the hard tortilla and raw meat. Meh.", "author": "Ashmita B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-12", "description": "So I came here to use the buy one get one free teachers appreciation day coupon. We tried using it at lunch but it was only after 4. I usually go to Quiznos in this shopping center but first time at this chipotle. \n\nThe line was long. Oh well. Our turn. I opt for steak instead of my usual Barbacoa. Bad idea. They were out of steak but had just pulled some off the grill and were chopping it. It looked medium rare at best. When I ate it I had to spit out a piece that was a chunk of fat. Come on man I know you're rushing but you gotta be careful. \n\nHad to wait for the chips at my table. No idea why. A young staff working here that seemed a bit frantic. I suppose they had been busy all day but it seemed like ingredients were running out quickly. \n\nI won't go to this location again and ill opt for Quiznos any other time.", "author": "Marty J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-21", "description": "Such a small chipotle! Also they ran out of lettuce when we were there! Man... Luckily we were redeeming a free bowl coupon so we weren't losing out too much..", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "Chipotle doesn't get very good reviews, but I was generous. I enjoy Chipotle burritos and I always will. This location is fine. It's easier to drive to this location and park at this center than taking public transit all the way downtown to go to a Chipotle. I went to the Chipotle Cultivate Festival in Golden Gate Park in June 2013 and got a ticket for a free burrito, so I used it here.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "The people who have given this location bad reviews are selfish, high maintenance, entitled dicks. I read one review where someone was talking about how they rushed here to make it just before closing and they gave them one star because they weren't greeted with smiles. F$&@ you, coming right at closing douche bag! You are a s*#% person. I have good allergies and they were super informed about their product and accommodating. They communicated the precautions they were taking the whole way. Does that sound like \"lazy kids\"? No. If you expect white glove treatment from fast food employees, you are a moron. They are probably better at their job than you are at yours. I gave them 4 stars because it's chipotle otherwise they would get 5.", "author": "matthew m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-07", "description": "We are suckers for Chipotle - it's fast, convenient and usually very delicious. This location lacks a few essentials:\n\n1. Crappy customer service\n\n2. They run out of things regularly\n\n3. Their corporate office doesn't seem to care about any of the above. \n\nEvery other Chipotle we visit seems to be really well managed, with great service and an abundance of offerings. This location fails regularly. I've contacted the management via email on numerous occasions and the lack the follow through, it's truly a shame. At least it the food is good.", "author": "Jimbowicz J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-24", "description": "This place sucks balls. The girls working there are not good workers. Didn't seem to notice me while I waited for service. When I ordered still no eye contact and just shoved my food along so I can pay for it. Food was cold! The meat, the tortilla was cold. What bad service and bad food. Never again! It seems like they are just there to mingle with each then actually work and care about the food or customers. Try the Rice Bowl in Luckys. They have better service.", "author": "Marie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-21", "description": "Living in San Francisco with an amalgam of great restaurants, I tend not to frequent chain fast food places.  However, I was struck with severe food allergies over the past year and found that chicken and rice from chipotle do not affect me negatively (I just don't order the dairy and other toppings that cause me allergy).  Needless to say, I'm at Chipotle about 4 days a week on the average.  I go to about 5 different locations regularly that are in proximity to which office I'm working in that day, kids' school, errands, etc. I have to say that I do not think positively about this specific Chipotle location.  All the 4 others I go to have friendly servers but this one specifically, meh.  This afternoon, I ordered 4 bowls and two tacos for my family.  The lady serving me kept asking me to repeat myself each step of the way and the music was blaring that she probably could not hear despite the fact I was speaking in a loud tone so she can hear me.  So at one point, I pointed at one of my bowls over the glass, to instruct her what I want in that specific bowl as she kept getting my request wrong and she rudely told me to remove my finger without any explanation.  I figured they did not want anything to fall on to the food but she could have asked nicely and with an explanation.  I apologized and explained that she could not hear me and that's why I pointed and she merely responded they did not want bacteria on the food.  Geez, I did not touch the food.  My finger was in the air and not hovering over any food item and how dare her when she's been breathing onto the food this whole time and she should have apologized that I had to repeat my order about 4 times.  The cashier was not friendly either but at least she was not rude.  I frequent the Westlake, Hillsdale and Masonic locations and I must say that I find the customer service at those other places are much better.  So I would like to suggest that the managers train the servers on communication skills and customer service and not to have the music blasting so that server and customer can hear each other better.", "author": "Caroline S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-18", "description": "I ordered a steak bowl and my rice and my beans were sort of uncooked, also the rice has no flavor.\nI RECOMMEND THE CHIPOTLE AT STONESTOWN", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-26", "description": "This is my second experience with a Chipotle burrito. My first exposure was the Westlake location.  The burrito was huge, and if I recall, it was satisfying.  Not great but good.  But not worthy of repeat visits.\n\nThe founder of Chipotle was featured in a major publication recently so I thought I'd give Chipotle another try.  Said fresh ingredients used all the way.\n\nI ordered a steak burrito with black beans, hot sauce, cheese, corn, and lettuce. My steak burrito at this location was lacking in several ways.  The steak was tough and chewy.  Ingredients lukewarm.  And $2 extra if you want guacamole.  I passed.  And very small in comparison to Westlake's. \n\nFor $7.50. I'll get an authentic burrito elsewhere for less money.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-20", "description": "This particular Chipotle charges extra for more side items such as beans, rice, etc. All other Chipotles I've been to never charged extra for those things, just for meat and guac.\n\nPretentious manager told me all Chipotles can charge extra for more than one serving of anything, but she couldn't explain why other Chipotles don't.\n\nLongtime chipotle eater disappointed in this location, it has absolutely terrible customer service compared to other chipotles", "author": "Ben C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-28", "description": "This place is not great. Save yourself a crappy chipotle meal and drive to the Daly City location. I love Chipotle, but this place is horrible!", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-01", "description": "They need to sweep the dining area better. Chicken and beans all along the wall. \nTables were even more filthy with burritos past. \n\nNo mas !", "author": "Arthur A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-05", "description": "I love chipotle but this location....errks my nerves...FIRST off never go here an hour before closing the staff or shall I just say one female work was hella rude. I asked her for more lemons after I already went to go see if there was any left and no there was not. So I asked her for some and she says ''yea they are over there' really bissshhh there is none in there because if there was I wouldn't be asking you...after that she just went  on to something else.. like hello did I not just ask for something????? hella rude I asked the guy and he actually went into the back to double check and wa-la he brought me lemons!!! yayyyy as soon as I can find out her name I will mention her....and btw they should tell customers that guac is $2.25 extra never knew that and that was my first time saying yes to the guac.... I don't think it was worth $10.25", "author": "Angel R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-08", "description": "Dumb girl didn't fill my guacamole cup up all the way. For 2 bucks I should have made her fill it up. Chipotle is going way too corporate. Stupid McDonald's affiliation lol.\n\nBtw LEARN HOW TO WRAP A FREAKING BURRITO!!!", "author": "Marquis A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "Although Chipotle isn't an authentic Mexican restaurant, it's still pretty darn good. Fact, it's great. I've gone many times prior to my first check in and I've tried all of their meats. In my opinion, i think that chicken and steak are the two best meats. They are very well seasoned and taste very good. The portion sizes are decent, but the scoops of meat are usually pretty small.", "author": "Ian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "I was very impressed when I visited Chipotle yesterday @ 2:14pm.  When I entered, there were 2 ladies in front of me, and 3 employees.  It wasn't busy so one was running the food bar.  As I was waiting, 4 more people walked in.  He immediately started working on the bowl for the lady in front of me and started working on my bowl as well.  He was quick, sharp and very customer friendly. He knows how to multi-task. Then another employee stepped in and he was very sharp and friendly as well.  I also observed how clean the store was and noticed the shorter blue-eyed guy cleaning tables.  They were on top of this store. I didn't get their names but the receipt listed the host as David. I enjoyed watching them work.  Thanks Chipotle for stepping up the game on this store.  #chipotle #happy #ilovechipotle #brandloyal #proud", "author": "Martin Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-24", "description": "Went there this pass Monday for a quick bite and got a steak bowl with guacamole. The next day i got food poisoning.. this is the only thing i ate out of the ordinary. Had a massive fever felt like i was going to die! I felt super dehydrated and had cramps everywhere in the stomach area. On top of this I've been having diarrhea that resembles watery guacamole every 2 hours for the past 3 days..  I'm still suffering the symptoms... I have been to multiple chains with no issues.. \n\nBOTTOM LINE\nI will NEVER go here again and you shouldn't either, unless you want to go through the ordeal I had to endure.", "author": "Jack L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-14", "description": "Completely overrated. I still can't understand the hype about this place. Every time I visited his restaurant there was a long line. A long line for what? To pay ten dollars to get a bowl of food that looks like dog food? It does not taste like dog food though, but it does look like it. In my opinion it's not worth the wait and the money. I can get similar food quality at much better value at places like PetCo or Pet Food Express.", "author": "Brent E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-23", "description": "The quesadilla was good. Guacamole and salsa also fresh and tastier than most mexican places.  BUT.  The kids working in there are a bit odd and could really benefit from some training in how to properly interact with customers.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-29", "description": "I was delighted to see a Chipotle in this little mall area on Sloat.  i didn't feel like going over to the one in Stonestown. Unfortunately I noticed the burrito i ordered here was smaller than the usual ones I get at Stonestown.  I had also watched them make the tacos for a guy ahead of me and saw them put about five pinto beans on each.  Looked quite skimpy.  Also my burrito was lukewarm to cold.  they need to warm the burrito wrap longer plus have higher heat on the meats and rice.  And they were extremely slow.\n\nDoubt i'll drop in to this one again.", "author": "Animal K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-10", "description": "Ugh!!!! I'm so annoyed!! I just got back to work to discover that my bowl was somehow switched with someone else's!!! There was only one other person in front of me!! How the f?! I'm so hungry and now I have to eat someone else's crappy bowl that I don't want. The cash register lady was already annoyed with how the like staff was not marking the containers. But wtf. How did I not see it either!", "author": "Verna L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-29", "description": "Just had an incredibly rude experience with the manager, Max, slammed the phone down on me forgetting that I am \na customer, well was a customer!  What is happening to this company?  When you are struggling with a healthy scare, the least you can do is treat your customers well...I guess closing all locations and talking to the staff did not pay off.  Check your manager first please.", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-08", "description": "Short and not so sweet: this is a very sub par Chipotle.  Don't go at night - they are counting the minutes till closing time and are pretty well shut down an hour before closing. After 8:30/9PM, the customer service is really weak. They're out of stuff and have no plans on keeping things well stocked even until 9:30. If they're out of what you want, too bad, so sad. Got home to eat my baseball-shaped burrito that only had a tiny amount of chicken - less than half of what the woman in front of me was served - and was so bummed. I was really looking forward to it. The rice was hard, the meat was old, and it was a mess. Anywho...avoid this place if you can.", "author": "Justin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "This Chipotle location is by far the best one I have been to. Unlike most other locations, they usually give a heaping scoop of meat and sometimes even an additional half scoop. Other locations I have been to like Westlake barely even give 1 full scoop of meat. Line is usually short or no wait here and service is fine.", "author": "Andy Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-23", "description": "First off, went there around 8ish, they are cleaning already, the biggest no no is sweeping thefloor, if you ever swept a floor, you know how much dust gets kicked up into the air, restaurant people should know this, sweep after you close! There was one person in front of me, yet they feel obligated to rush thru the order, The one behind the food counter rushes again with my order, give us a chance to specify what we want, she forgot something, but I'll give her a point for giving you the item on the side, I don't think that makes up for the amount they can put, when it's scooped directly into the bowl! On one of my bowl order the steak was fat & tough, obvious a cheap cut of meat thrown in with the rest. On another bowl we had the Brown rice, it was under cooked, do es the cook think it's suppose to be crunchy? Someone in Mgmt, needs to ggo in & teach them the standard! They did bring out a full tray of rice yet the lettuce was at the lowest point of the tray, yet, they scoop up every last shred & refuse to refill it. Is Mgmt ever there to oversee the operation. Will not return to this location!", "author": "david c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-21", "description": "They had an hour before they closed... I work in this industry. The food was dry (she double wrapped the burrito and still ripped the second tortilla; they were stale) and they were out of rice both white and brown. Also, the girl serving wasn't exactly friendly. I guess their pre-close was on point though. I'm sure they'll get out super early.", "author": "Reychelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-01", "description": "I'm not sure why this place has such bad reviews. I've only been here twice but I never had a bad experience. The first time was when the music was too loud so none of the workers could hear me or my friends, and they charge too much for guacamole but other than that the burrito was yummy and the service was friendly. Not the best, definitely not the worst.", "author": "Shira S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-13", "description": "Wow their burritos are insanely small. Chipotle is usually known for their generous portions but this place gave me a burrito looking like a fruit roll up. When the worker was putting together my burrito, he didn't even give me a full scoop of each ingredient. Usually they give me 2 scoops and burrito is as wide as my fist. Anyways, I ordered it with chips and guac and the total came out to over 10 dollars. That is really pricey for a baby burrito and 1/4 bag of chips. I can go to many other non chain taquerias close by and get something must better quality for a cheaper price. \n\nI must say though that the quality of the steak was really good and wasn't the cheap stuff normal taquerias use. Also the burrito overall tasted good but I finished it in 2 bites. Please don't skimp next time cuz i'll be watching you!!!", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-17", "description": "WOOOHOO my go-to Chipotle whenever I'm craving those burrito bowls! The food never disappoints me (unless I get the scrapings), and neither do those big portions! Half chicken/half steak and a giant glob of guacamole for my burrito bowl please!\n\nLines can get long during the lunch rush, but burrito rolling/bowl stuffing always goes by quick! Staff is usually friendly and they still manage to put a smile during those busy times.", "author": "Cynthia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-04", "description": "Love chipotle, but this location regularly...filthy.\nRegularly out of items....even though store has over an hour before closing.\n\nStaff is the only positive at this location. Needs process overhaul.", "author": "Sharine d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-30", "description": "Pretty average Chipotle, service was good and friendly but the line takes a pretty long time and doesn't move as fast as normal ones. Its the closest one to me, but i would rather make the trek downtown for a better chipotle.", "author": "Josue V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-15", "description": "Horrible. NO ONE knows what they are doing here. The girl can't wrap a burrito to save her life. AND I had to remind her to put new gloves on after she touched everything (AND MONEY) with her other gloves. I waited about 10 minutes before anyone really paid attention that I was there. Gossiping in the back. No professional. Doesn't seem to be running well. And again... please learn to wrap a burrito, because mine fell apart as soo as I tried to eat anything.", "author": "Serina H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-17", "description": "CHIPOTLE YOUR SERVICE HERE IS FXXKING SHITTY AND SO ARE YOUR RUDE ASS EMPLOYEES!!! \n\nTHIS IS WHAT PEEVES ME THE MOST!!! When it comes to food, I get fucking mad as hell when people who handle food don't wash their FXXKING hands!!!\n\nIf there was a ZERO stars button, I would totally select that because they don't even deserve 1 star. \n\nI've been to this location twice. The first time was okay, but meat shouldn't be left to be lukewarm. But this time..WTF MAN. \n\nThe girl who took my order was rude, gave me skimpy portions of everything and then passed it down the line. When I asked her to give me extra meat because of the skimpy serving, she didn't bother to tell me there was an extra charge for even condiments. TOTAL FAIL. \n\nThe person who put my burrito together ripped the wrap and didn't bother to do anything about it. She wiped her forehead, walked away from the counter for a brief moment to grab some water and then returned to making my burrito. SHE DIDN'T EVEN CHANGE HER GLOVES. SANITATION ISSUES RIGHT THERE!!! \n\nI told her to remake it because she didn't bother to change her gloves, she snapped back saying \"OH WELL\". OH WELL?! If it weren't for the plastic wall separating us, I would have decked your ugly face for saying that! \n\nBy the time it was time to pay, I was already super pissed off and told the cashier, who happened to be the supervisor that this was unacceptable and to remake it. She didn't bother to sympathize with the customer (me). The burrito cost $10.17 when it should have been $7. WTF?! \n\nTo avoid further damage, I refused to pay and walked out. TAKE THAT BITCH!\n\n\nSERVICE: WORST CHIPOTLE LOCATION I EVER BEEN TO. EMPLOYEES DON'T WASH THEIR HANDS HERE WHEN MAKING FOOD AND HANDLING CASH.", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-26", "description": "This location is too small. I went her with a friend for lunch. I love the food here I would go to another location instead of this one. Because this one is too small. Overall I loved the food.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-24", "description": "Last 3 times I've been here they ran out of sour cream and I have to awkwardly walk out because I refuse to eat chipotle without their sour cream. FAIL", "author": "Anastasia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-27", "description": "I remember when this place was brand new, I decided to try it. I always eat Chipotle ever since.\n\nI always get a steak burrito and I am always satisfied. You can choose what you want on your burrito which is a plus. However guacamole is an extra 2$ or more and I would not recommended adding it because of the price. The total of my steak burrito without guacamole would be $7 something.\n\nThere was a couple of times where I see the employees unable to wrap the burrito all the way and everything would spill out, but it never happened to me yet.", "author": "Julian Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "Tonight my roommate and I went into this chipotle to have dinner and when I got there I was a bit bummed that the line was so long but I am almost ALWAYS willing to wait for chipotle. \n\nWhen we got up to the line a guy working the bar named Anthony who took the time to see that there was a salad dressing more full than the others and he gave it to me when I asked for it. Right after that I realized I forgot to ask for peppers in my bowl and he went and got them for me. \n\nThanks Anthony. You're a homie.", "author": "Autume S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-25", "description": "Bleech I actually tried to eat this and had a burrito with brown rice and black beans. It is so bland and tasteless. I wasted nine bucks.", "author": "Infodiva B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-11", "description": "I love Chipotle.  Fresh, tasty, and predictable.  Even after moving to SF, I still frequent Chipotle especially after going to the gym in this part of the city.  I eat at this location pretty regularly and though the food is always tasty...the service isn't great.  Part of it is that this is the best restaurant option for this part of SF, so it is packed with people and online/phone orders even at non-meal times.  \n\nHowever, the reason for my review is that I had my first good service experience last night.  Normally the workers at this location give me a death look when I tell them that they are out of ice or forks.  Last night any employee came out and apologized for the wait and handed me a BOGO coupon for next time.  Then they rang up my order incorrectly and apologized and fixed it.  Yay! I don't know what has changed, but THANK YOU!", "author": "Christy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-24", "description": "So I came back here after almost a year of being Chipotle depraved. My boyfriend and I were craving for some fast and delicious burritos, might as well. Came here alone by myself to get burrito bowls to go.\n\nWent in around noon to see not many people in there, no line, and lots of staff behind the counter.  Wonderful!  So I waltz up to the far end where you start your order. There was perhaps 7 or so staff behind and NO ONE helped. This one guy made eye contact with me and with a hesitant voice said, \"Alright I guess I'll serve you.\" At this point one star is gone. I said I wanted two burrito bowls to go and guess how he replies? \"NAW MAN that's too much! Here you take her order!\" (Yelling to this girl next to him) Uhhhh ok......? First of all, if you were willing to help me make my order, give a better attitude towards your customers and second,  don't EVER judge their orders. One star off. So I got my food, and usually I always tip a dollar coz I love chipotle, but not this time.\n\nThird star off is from their shrinking portion size. Compared to when they first opened, I would say their portion shrunk more than half it's original size. My boyfriend's barbacoa burrito bowl was so tiny, I had to give him some of what little I had of my carnitas. Yea...I don't think I will ever go back to this location.\n\nPlease bring back the better staff members that were here in the beginning or a group with a friendlier attitude. Better yet, hire people that actually wants to WORK!", "author": "Sandy F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-12", "description": "This is my 2nd time trying a Chipotle and the one in NYC was waaay better.  \nI tried a soft flour taco.  Their tacos are not authenic in that they have bins of food that the servers basically toss on top of your dish, be it a taco, bowl or burrito.\nMy fillings were meat, blk beans, vegts, cheese, salsa.  It was reasonable for $2.35.\nI took it home and the flavors were not good together.  I didn't finish it and gave half to hubby.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-24", "description": "This is a general review for Chipotle, not location specific. I remember my very first experience at a Chipotle and that I didn't like it, it was nothing amazing. So i never went back for the longest time. Within the last half of the year and probably due to the influx of Chipotle mentioning in many youtube bodybuiding vids that i watch has encouraged me to eat there again. Its amazing for a post workout meal, they have a good variety of choices of meals, I usually go for a buuuurrito, salad or a buuuuuuurrrito bowl.\n\nCurrently I am trying the  Paleo Diet, Chipotle can be eaten Paleo style:  The trick, get a salad w/ bell peppers, carnitas, mild salsa and guacamole!  BAM!   Their Guac is so yummy!", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-20", "description": "Over all, the flavor is good.\n\nHere's my issue.\n\nDude, learn how to roll a burrito.\nIt was painful to watch. The store needs to give you bigger foil to wrap it in as well.\n\nTwo. A burrito should not be like a leftover cold cheeseburger from the fridge by the time I get it home.\n\n2 burritos for 20 bucks (with a tip)\n\nI expect way more.", "author": "erik H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "I'm not sure why this location has such low ratings. I was in the area around lunch time, looking to grab a quick bite in between appointments. I had decided to go to Noah's Bagels, but when I walked up, I noticed a Chipotle right next door. Sweet! I had no idea there was a Chipotle this side of Van Ness. It seems like all the Chipotle's are downtown.\n\nThere were a lot of people eating, but no line. Staff were ready to take my order and helpful in pointing out the different toppings (and saying which ones are extra charge is nice, too). I ordered my lunch to go and was out in less than 5 minutes.", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-03", "description": "The burritos aren't packed full enough, so that makes them fall apart yuk.\nOne of the ladies had a runny nose, and I kept watching her runny nose drip onto her ring that was in her nose. \nIn fact all 4 of the girls were wearing these huge metal nose rings through the middle of their noses. \nIs it cool now to look like a bull fighting in a ring?\nMaybe I am just getting old, but it looked pretty unsanitary to have in when you have a runny nose and are making food.", "author": "Pug P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-22", "description": "This was my first time ever eating at Chipotle as well as the last.  I ordered the burrito bowl w/ steak.  The customer ahead of me ordered the same and as I watched them put the meat on, I saw it was totally rare, just browned on the outside & juicy red blood inside- gross! I asked if they would please put the meat back on the grill so it was well done & guy said \"it's not made to order here\".  I didn't want to be rude & hold up the line trying to figure out what to get instead~ my mouth was watering for carne asada, I mean \"steak\"~ so I just said ok fine & when I got home I cooked it thoroughly myself.  Their website says, \"Our menu isn't long but it's long on options.  Start with the basics and CUSTOMIZE AS NEEDED to build your perfect meal.\" The guy was rude and there was no reason he could not have put it back on the grill.  \n\nI lived in Mexico for 2 years and traveled all over and Chipotle is nothing like authentic comida Mexicana. \nI gave them 2 stars because the place was very clean and the food looked fresh.", "author": "Laurel R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "Worst chipotle ever.\nRice sucks\nGuac has no taste \nCold meat\nAnd the corn is soooo sweet \n\nGot to daly city", "author": "Kps S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "DEEEELICIOUS. Every Chipotle I have been to has had great service and this one doesnt lack anything.\n\nI love the same consistency and cleaniness and great service that I get at all other Chipotles i've been to in San Jose and the one at westlake. \n\nKeep up the good work! Cant wait to get a chicken burrito bowl sometime soon!", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-20", "description": "This Chipotle sucks! They apparently hire a bunch of people who can't read English, because we almost always use online ordering and they almost always get something wrong. \n\nTonight, they made a mistake that also means they charged us more than they should have, unless of course, steak comes from chickens now.", "author": "Ryann L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-31", "description": "I've titled this review, \"Dude, come on Lakeshore Chipotle\":\n\nDude, come on Lakeshore Chipotle. Is there a storewide mandate to go light on the ingredients? You drizzled my sour cream like it was precious manna. Just throw it on.\n\nDude, come on Lakeshore Chipotle. I just finished my burrito and I'm still hungry. You filled my burrito like I was a little boy. I'm a grown man. Feed me like a grown man. \n\nDude, come on Lakeshore Chipotle. I had to supplement my burrito with a bag of chips and a Capri Sun just to satisfy my stomach. Actually, this makes me sound like a little boy.\n\nDude, come on Lakeshore Chipotle. I'm an advocate and supporter of your brand. Treat me with some respect. Don't make me drive an extra 10 minutes down to the Westlake Chipotle for a real Chipotle burrito.\n\nMy tummy gives Chipotle Mexican Grill (of Lakeshore Plaza)...2 Stars!", "author": "Allan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-18", "description": "This Chipotle is easy to get to from SFSU, and it has a fairly quick line. \n\nWorst down fall to this business is that it lacks seating, the layout of the restaurant is a little strange, and the walls are not made to lean up on. If you lean against their walls, you will feel like you are falling as the false wall falls back a little and everyone will look at you. EVERYONE.\n\nBut it is still a Chipotle and that is something hard to complain about.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-28", "description": "When Bunny and I saw the sign stating that a Chipotle was \"Coming Soon\", we were excited. However it wasn't as soon as we had thought. Although the sign was up and running, when we drove by anxious to pick up dinner, we were disappointed to see a couple of handy men still fixing up the place.\n\nBunny and I like Chipotle, especially the burrito bowls. Rice, beans, meat, salsa, lettuce. corn, and cheese, what more could you ask for? With my allergies, I always have to omit cheese and sour cream due to dairy and just have corn and lettuce. Since I' wasn't getting all of the toppings, I've always wondered if extra servings could be allowed as substituion.\n\nOn the last occurence, Bunny had asked if there could be extra corn and the staff employee was nice. She didn't roll her eyes or seemed annoyed. At times Bunny was unable between mild or medium salsa and asked for both. Usually there is good customer service. At times, it's difficult to hear. That could be based on the fact that I am short and have to tiptoe to yell over the counter. \n\nThe shape of this Chipotle is a bit odd. Rather than having the counter horizontal, it's vertical so there isn't a lot of space to stand around while waiting in line. The napkins and utensils are placed far away from the cashier, which makes it easy to forget to grab sone, which happened twice. The seating area is a bit cramped and on a few occasions where we had wanted to dine in, there were no tables avaialble and rather than wait, we decided to just take it to go. \n\nWhen walking around at the Lakeshore Plaza after shopping at Ross or buying groceries at Lucky's, it's always tempting to head to Chipotle, especially if it's close to lunch or dinner time.", "author": "Doris W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-16", "description": "Obviously not real mexican food. The burritos are okay the chips are hella good but the salsa isn't. It's 7 pm in the sunset and cold, they have the ac full blast I understand the employees may get hot in the area they serve food but it's not cool at all the freeze the hell out of customers. Would've given 3 stars if it wasn't so damn cold.", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-30", "description": "I came here in the middle of the day and I just have to say customer service really helps and they didn't have any at all. \nI waited probably a good 5-10 minutes and then the girl making my burrito just kept talking to a guy counting the register and had to ask me numerous times what I wanted in my burrito. How hard is it to remember barbacoa burrito? \n\nThen at the register, the girl at the register was also talking to the same guy counting out his register about wanting to get off of work. She told me my total, took my cash and gave me my change. Then she walked away without giving me my food. I was like WTH! So I had to grab my own food and bag it myself. \n\nI've worked fast food and retail and let me just say if they worked in a busy area like Union Square, they'd be eaten alive and run off crying. \n\nWill definitely not come back to see some high school kids talk about wanting to go home.", "author": "Yvonne T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-04", "description": "Things were going well until my BF and I both ended up with really bad stomach aches for the rest of the day after sharing a chicken burrito bowl...... No thanks.", "author": "Allyson L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-28", "description": "I ordered online and told them we be there in 30 minutes. We get here and nothing has been done. Then they tell that they are out of chicken and we would have to wait an additional 5 minutes.  When the chicken finally came out, we still had to wait and I asked if my order was ready.  And of course they forgot my order.  Then they said it will be out soon.  And then I see that the person put my burrito in the bag and they still haven't given me anything.  And I had to ask again.  They didn't even apologize!!  What horrible service!", "author": "Way G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-29", "description": "With all the  people complaining about Chipotle, you'd think they've never been in a Chipotle!\n\nYes, they shovel the ingredients you choose into your desired vessel (which is a good thing)\nYes, that's why its overfilled when they try to wrap your burrito\nYes, they offer two types of rice. White or brown? Deal with it\nYes, guacamole is an extra cost.\nYes, a ton of kids come here because it's close to schools\nYes, Lakeshore plaza can suck some time\nYes, the place can be messy due to the diners\n\nChipotle is awesome and i'm glad there's finally a location nearby saving me a trip to Daly City. They layout of the seats and serving counter are different but that's because they've been forced in this tiny space. The employees are nice and efficient and get done in no time!", "author": "Dennis L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-01", "description": "The original place I was planning in eating at was closed and I saw Chipotle. It's been a while since I've been to Lakeshore Plaza so I'm not sure how new it is.\n\nI came in around 8pm in a Monday. There were very few people in there, but plenty of dirty tables. I ordered a steak bowl and boy did the girl pile on the ingredients. As I watched her slop each scoop into my bowl, I got grossed out by how messy and dirty the table was. I tried not to think about it. I went to get utensils and was grossed out yet again by how dirty the container was. The spoons were covered with soda.\n\nSadly this place was as bad as the Colma location. The stale chips didn't help either.", "author": "Adelina W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-24", "description": "We came in at 9:40 pm closing is at 10 pm. All the chairs were on top of the tables. We were greeted with a very annoyed looking employee. The ingredients were all run out. Worst chipotle and costumer service I've seen.", "author": "Allison P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-16", "description": "Went this evening at 5pm for two to-go burritos. The guy who made them overstuffed them with rice to the point where one couldn't be folded closed (found this out when brought home to eat) and the other actually had split open and all the rice had spilled out - to the point where picking it up and eating it was impossible. See pic http://www.yelp.com/biz_photos/SPCsV7naOwkZFQGsuArPhg?select=omGGZgMtYl50GbMllyggrQ#omGGZgMtYl50GbMllyggrQ\n\nWho wants to eat a burrito like that? No stars for him.\n\nWhen I tried to pay, the cashier had a problem with the computerized register. For some unknown reason, their system was down - confirmed it was at other Chipotle locations by another worker on the phone. When I declined leaving my credit card number for him to ring up when the system was back online, he did something amazing - he gave me the two burritos for free! Now THAT is customer service. 5 stars for him.\n\nFinal rating: averaged out to 2 stars. \n\nSo I will definitely go back because the quality of the ingredients are high and the cashier won me over, but if that same guy is making the food, I will skip it for another time.", "author": "B W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-01", "description": "Heard all the hype, read reviews, finally decided to experience it for myself. VERY UNDERWHELMED! Food was so so, service was mediocre, employees did not seem happy or very pleasant, tables were filthy, garbage cans were full, food on the floor, and the bathroom was beyond disgusting, urine and trash all over. In San Francisco, this place, this location needs to step up their game. I will not be trying Chipotle again soon and i will be sure to spread the word to people who enjoy good food....Chipotle is a chain, a small step up from Taco Bell.", "author": "Monica W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-01", "description": "The burrito was cold after all the fillings were added to it.  The guys working behind the counter needs to pay more attention to what the customers order before putting the fillings on the burrito.  A plus is that the burrito was a good size.  \n\nIn my opinion, the burrito was not tasty and authentic unlike other taquerias.   It's better to eat at a taqueria instead if you prefer authentic Mexican.", "author": "J W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-22", "description": "Had a hair in my food. It was a long black straight hair and mine is blonde and curly. I know it was an accident but I am seriously grossed out with someone else's hair in my mouth and I probably won't be dining at chipotle again anytime soon. I'm not the type to return my stuff even with something like a hair in it but I was seriously disappointed because I only took a few bites.", "author": "Jade D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "Ok normally I wouldn't review a chain restaurant but I felt like this place deserved it. First off I was greeted nicely when I first came in. I ordered a buritto with both rices and when it came to the meat part I was interested in the barbacoa (spicy shreadded beef), but then the girl said it was spicy and I said \"i dont know, I'm not too crazy about spicy.\" She said it was really good and gave me a sample of it in a little cup and I liked it, it wasnt super spicy, I could handle it. The barbacoa was delicious. I also put the mild salsa, corn, and sour cream in the buritto. It was tasty and exactly what i was looking for when I come to Chipotle. The biggest part I am writing this review is because of the sample offer. Thank you!", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-16", "description": "I mean its Chipotle. Just another Chipotle. And I have to say I like Chipotle's burrito bowls, which is the only reason why I go here. They give a pretty decent amount here.\n\n2 stars because the service wasn't great. Girl with the pink hair is rude to us and was pretty condescending. Maybe she was having a bad day or something, but I work in customer service too so I know how customers should be treated, and definitely not with the tone she used. \n\nBut if you need your Chipotle fix then its pretty convenient. Lots of parking in lakeshore plaza and the wait isn't long. \n\nDon't forget your Chipotle-away! (High five if you know the reference!)", "author": "Claire Angelina C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-16", "description": "I've been to this specific Chipotle location twice and I do not plan on going again unless I have a desperate craving for it. Chipotle is one of my absolute favorite fast food joints and this location makes me not want to go back ever.\n\nWhere should I begin? The service is the worst. I walk in and the staff seems confused and unorganized. My friend and I tell the person what we want and she just seemed to not listen and not all there. She rushed through our orders even though no one was behind us in line. They were rude when asking what you wanted and I saw a lot of the staff members just sitting around doing nothing.\n\nAfter all of that, I go to get lemons and they have no lemons at all. You would think with so many of the staff members sitting around talking and laughing, someone would check on the lemons? They were also low on forks, knives and spoons. The tables were filthy and no one got up to clean them. \n\nThe taste was consistent with other Chipotle locations I've been to so that is something to say for this place. I will probably never come to this location again due to the service and non-motivated staff.", "author": "T L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-20", "description": "As a Chipotle lover I was absolutely thrilled when I found one was being built so close! And by thrilled I mean obsessively checking construction progress, peaking through windows, planning my first meal, salivating, anticipating the burrito belly baby that was soon to come... oh how the mighty have fallen.\n\nWhile the location is convenient, with plenty of free parking, and the place looks new and snappy, with big windows letting in natural light, the pros end there.\n\n#1 Size - Burrito belly? Not with these minis. Wtf? I don't want a \"healthy\" serving size! I go to Chipotle and I expect a log of a burrito; knowing I have a tasty leftover waiting for me brightens any day and is rapture inducing after a late night out. Impossible with these portions. Half scoops of all ingredients. I've had bigger portions from Taco Bell.\n\n#2 Quality - Not only are burritos small, they taste very mediocre. Non of that Chipotle yumminess. \"Well maybe the next bite? nope. Well, maybe if I take just one more bite.. no.. Well, maybe...\" etc. This dialogue continues throughout entire consumption of burrito. I put my poor taste buds through this endurance trial three times before the poor saps got so disillusioned that they wept. Sad visual huh. Tortilla was consistently cold (mmmm, cold lumpy dough) and lack of filler made its frigidness a substantial portion of each lackluster bite. Rice consistently stale and chicken also stale (and dry). Probably b/c its been sitting around all day waiting to get used; if ya would load more than a pittance worth of ingredients on that tortilla then this problem wouldn't be a problem!\n\n#3 Price - Smaller portions for more money. Price went up (again) so you're down ~$7 for a cold-lumpy-dry-stale excuse of a mini burrito.\n\nShame on you Chipotle. Shame.", "author": "Meghann S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-19", "description": "Fast service!  Food is above decent if you go in knowing what to expect.  Guacamole costs a lot but they're usually pretty generous.\n\nI took my order to go and when I folded up the paper bag (because I am gansta aZn and fold my paper bags for later use, maybe) I noticed it said \"this bag is magic\" in sharpie with some poorly drawn stars.\n\nThat made my day.\n\nThanks Chipotle.  \n\n(But if you eat too much you might need Chipotlaway.  Thanks South Park's Billy Mays!)", "author": "Kimiko Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-11", "description": "Came home to find a LONG STRAND OF HAIR IN MY BURRITO. I don't know how I feel right now...", "author": "Rene H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-10", "description": "I haven't written a Chipotle review in a long while.  I thought I'd write another one.  \n\nTarget location:  newly opened Chipotle on Sloat.  It's the former location of Pizza Hut in the Lakeshore plaza.  Amongst the lackluster choices in this plaza, this probably ranks in the top three choices grab a bite.  Nothing against the likes of Quizno's or Noah Bagels, but the choices here tip toe towards the edge of boring (King of Thai easily is the best there).\n\nLuckily I like Chipotle.  \n\nThe rift between the fans and dissers of Chipotle grow as each branch opens up.  Both sides are divided, with the mainstream majority currently in favor of Chipotle.  I wonder if Chipotle will turn into a forgotten label or prosper like the close to legendary Panda.  You know which fast food chain that showcases that cuddly icon.\n\nAt this Chipotle location, interior area is longer and deeper rather than larger inside.  (Reading that last sentence again, it sounds dirty.  I'm leaving it in anyway.)  They might have to post up a barrier to control the lines when it gets busy because of how the burrito making station is faced.  Lastly, the seating area is a tad compact.  \n\nLet's not get ahead of ourselves.  It's still a Chipotle.  Nothing new here people.  It's the same old stuff, different location.   Considering it being opened only recently, I was surprised the service was so orderly.  You'd be surprised how difficult \"what kind of meat and beans?\" could get.", "author": "Arnold T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-20", "description": "This is our go to spot for our Chipotle fix.  I usually get the chicken bowl here. (mostly because the workers really don't know how to roll a burrito up the right way) Their food is pretty tasty but I cannot give more than 3 stars. Chipotle is pretty pricey already but when they charge for $2 for a scoop of guacamole, that's just ridiculous. (Go to Lucky and buy some avocados or guac)  Oh, and they charge for chips too. Shame on you Chipotle.\n\n If I want a burrito I'll go to El Burrito Express on Taraval.", "author": "Craig I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-30", "description": "Typical Chipotle chain locations.  Being inside a mall, it's best to park outside on the street to avoid those tightly drawn parking spots.  Diner is small and only has a very limited amount of seats.  Not always the cleanest location, either.  Plus for having a bathroom on-site.", "author": "Chi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-24", "description": "3 years later, and nothing has changed at Sloat Blvd. Chintzy on burrito meat filling, but lots of rice and beans.", "author": "Kay L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-27", "description": "I'm really sad because I am a chipotle lover.\n\nThis location just doesn't live up to the chipotle standards. They're definitely skimpier than the other places I've been to. Well, actually, the portions are still big, but it's expensive (~9 for a steak bowl with guac) so it's not really worth the money, especially if you can drive to Westlake and get more for your moolah. \n\nIt also really bothers me that their corn isn't yellow. But it still tastes the same nonetheless. \n\nAnd, today, there was a black beetle in my chipotle O_____O i'm guessing it was from the lettuce. I mean yeah I know they can't exactly help it but still. Ew. \n\nBUT in their defense, ive come around 9 and they give you more, probably because it's around closing time. They really pile on the guac then :)", "author": "Bianca W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-23", "description": "Mmmm. I love Chipotle! I don't know why this place has such low reviews. I've always had a very good experience here. The employees are always very friendly and helpful. And as always, the food is always delicious. :)\n\nI also came here with one of my students as part of his incentive plan and forgot my wallet. They let me take the burritos and trusted I'd come back to pay for them. (I did). So grateful!", "author": "Andie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-19", "description": "My favorite burrito place was closed so I decided to get a quick bite at the local chain. \n\nIt's not a very long burrito but a fat one. Their vegetables are extremely fresh and look extremely appetizing, but the overall taste is a bit strange. Its a light meal but lacks the traditional Mexican taste.. . It has all the staples: Meat, rice and veggies. There's not much grease so it's more of a salad bowl wrapped in a tortillas. \n\nCons: they charge $2 for guacamole and don't provide complimentary chips or salsa like my local favorite.\n\nI wouldn't probably recommend it unless I really wanted a burrito when my usual place is closed.", "author": "Sue T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-22", "description": "I really don't know why people are hella hating at this place. \n\nThis place is close to my school so I came here to fulfill my Chipotle craving. Right when I got here, they immediately took my order even though there was a mini line but I wasn't even in line for a minute and my order was done already. Talk about fast service. The place is small so I wouldn't recommend eating inside. Plus, if you go during the lunch hour rush that's when all the high schoolers come so it gets really packed.", "author": "Janice V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-11", "description": "I wish zero stars were an option.  I know it's only Chipotle but I go in at like two on a weekday afternoon.  I order a burrito and the guy working puts like the smallest amount of meat one can fathom.  So then of course I should expect that guacamole you pay extra for to be as miniscule in portion size....Yep.  I left with a $10 burrito about the size of a burrito supreme at Taco Bell and the resolve to never return to this Chipotle again.", "author": "Sin F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-19", "description": "I only came here b/c it was new and I was curious how small these baby burritos really where. Too bad I wasn't smart enough to visit during high traffic time like noon to see for myself instead of having to pay during off peak hours where I'm the only one in line to find out. These things really are small! It's the tiniest burrito I've ever seen. A spicy pork burrito set me back $7.32 after tax. I'm hesitant to call it a rip off, but it's definitely not a deal. \n\nDo companies really think we're going to pay more for them to provide smaller \"healthy\" portions? First it's the total rip off travel size shampoo that's 5x the cost compared to purchasing in regular size. Then it's 100 calorie bags of chips. Now it's mini to-go burritos for over $7?\n\nIs it just me or are burritos following the Pho trend? I remember when both were $5 something and now they're topping $7. We don't choose to eat burritos and pho b/c we like it. We eat it b/c it's cheap. I don't feel like I'm alone when I say I'm definitely choosing other alternatives. \n\nIf I want meat and rice, I'm heading across the plaza back to Ono Hawaiian BBQ for a better deal. Even their mini meals are about $5.60 after tax and the portions are much more generous. It's also tastier than the bland Chipotle stuff.\n\nService at this Chipotle was fine. I'm glad the server warned me that if I wanted to add guacamole to my order, it'd be an extra $1.95 + tax. Ouch! That burrito I had easily could have been closer to $10! My card was declined and the server wasn't frustrated with me at all. She was patient as I grabbed another Expedia gift card out of my wallet.\n\nMy favorite burrito place has still got to be Guardo's. Value is excellent and it's got tons more taste than this stuff here.", "author": "Brian Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-26", "description": "Idk why every time I come here , I just question the management , not the staff , something feels off , like a quiet jungle , the meat is too cooked , or too dry , (streak)  the girl behind is cute tip her good !", "author": "Wdfa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "Ok. I'm not the kind of girl that eats at fast food chains  very often but, today I had some time to kill between errands and was pretty hungry so I popped into Chipotle looking for a healthy late lunch. This was my first time at a Chipotle so the guy filling orders helped me thorough the process and described some of the ingredients to me. For instance, I had never heard of Barbocoa before so he explained it so well I just had to have it. He also told me about the fresh Pico de giao that they make in house, had to have that, too. We also chatted a bit about food and working in the food industry...nice guy. He made me a beautiful salad and the, because it was my first time...he comped it! So nice! I also think that was pretty smart...I will be back. Not 'cause it was on the house. Because it was yummy!! I am so happy to find a spot that is near work and my daily errands where I can find real food that it's fresh, healthy and yummy! The Barbocoa was as promised, a little spicy and really juicy and good. The salsa was delish, good quality tomatoes mad the flavors pop. Nice bright flavor.\nThank you Chipotle dude! That really hit the spot!", "author": "amy g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-08", "description": "The guy who seems like he must be the franchise owner is doing it wrong.  I mean, props to you sir for making your mark on this world and opening up a franchise in a plaza that seems to strive to not at all embrace the diversity of San Francisco and really want nothing more than to be a conglomeration of franchises, but you're doing it wrong.  If you're going to be completely uncreative with your restaurant business and go with a franchise, you need to serve food that is consistent with the franchise.  Follow the instructions.\n\nI shouldn't be able to eat my teeny burrito (if the owner makes it ... if it's an employee it's usually made normal size) in 7 bites, the tortilla should not be rolled around twice and it shouldn't resemble a taquito more than a burrito.  And the rice should be cooked all the way.  I know brown rice is new and everything, but I'm pretty sure the franchise gave instructions that brown rice takes longer to cook than white rice.  And the lettuce shouldn't be wilted.  I don't even eat the guacamole at any Chipotle, but here it's often brownish.  I've eaten here 12 times now, and maybe once or twice was it the same as what I'd get at another Chipotle.\n\nThis establishment is just unfortunately failing.  Which is double-fail since they have an instruction book.  Try harder!", "author": "Greg J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-27", "description": "I LOVE and live on chipotle. I've been to this one about 10 times: different times of day, with different combinations of staff. 100% of the time I received/witnessed slow service and apathy among the employees and no drive to create welcoming environment that I experience at most of the other chipotles in San Francisco. \n\nI notice that if one customer is a chipotle novice, the staff tends to be obviously annoyed with them. These employees are not used to being busy i guess b/c they move at a snails' pace, and seem to move even slower/ act manic when there is a longer line.\n\n If this team was at a busier location they would not be able to hang. Oh, and they are more stingy with their meat than the one in the Westfield mall downtown", "author": "Luke D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-26", "description": "I've been to a few different Chipotle locations in the SF area; that being said this the worst one I have ever been to. The first server person was totally unprofessional speaking to his bud giving me his back as I awaited patiently for service. The chicken I was served in comparison to its quantity was lousy and had significant amounts of un edible gristle and fat. Lastly the proportion I was given once again in comparison to the other locations was terrible, it was actually laughable.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-27", "description": "this chipotles is bad food poisoning proper holding temperature is 135 and above the food here is cold  the chips are stale you will get sick learn it or shut down", "author": "Jenn B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "I had gotten a coupon for their grand opening but wasn't able to make it that day.  Came here 3 or 4 days later and was first thrown off by the way the layout was in comparison to other locations.  I got over that quickly since there wasn't a line and I ordered my food.  The first food prep person was quick but the second and third were slow and the burrito wrapper was really bad; she didn't seem to know how to wrap the burrito and even had to ask what sort of burrito it was so she could mark it on the foil cover.  Food was consistent with other locations so I was happy.  \n\nNote: this location is much smaller than majority of them that I've been to and I would put the max # of people that would fit to be around 25.", "author": "judy l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "Decent portion sizes. Good customer service, as at most chipotles.  Convenient local location.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-13", "description": "Found short hair in my burrito two days in a row... That's gross. Different workers make different size burritos so it's the luck of the draw if u get shorted on the meat... Today, a rookie didn't know how to wrap it and needed help... Really? Isn't there supposed to be some sort of wrap training before they go live?", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "Unlike other chipotle restaurants in the city, they actually fill up your bowl/ tacos with meat. They don't put little bits of meat just so you will have to pay for extra meat. Plus this location tastes better!!", "author": "Michaela H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-02", "description": "I would give this place 3 stars from the last last time I ate here but the last time I ate here I experienced something different. The line was the usual -about a 5 minute wait since they don't have enough people working. I ordered the usual -sofritas bowl/burrito. Customer service was good but the cashier forgot my sofritas sauce which was disappointing because that sauce is really good. I'm pretty sure it would have made up for the quality of the ingredients in that bowl. The brown rice was harder than usual, and something was too wet (perhaps the salsa?). I thought the way the food was prepared was lacking.", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-12", "description": "This location gives Chipotle a bad name. As an avid Chipotle enthusiast, I am well versed in how a Chipotle should run. Unfortunately between the staff and cleanliness, this place fucking sucks.", "author": "Larry W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "I paid $9.52 for 18 pieces of meat, 3/4 spoon of rice, 1/2 spoon of beans, lots of lettuce, you all should be a shame of yourselves charging these prices for a ridiculous amount of food.", "author": "sandra c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-21", "description": "I have a shameful secret: I like fast food. It was the day before I was starting my new years resolution diet. I decided to indulge for my \"last supper.\" I went to the Lakeshore Plaza to eat at a favorite fast food establishment. As I arrived I discovered it was gone, oh the horror.\n\nMy stomach was growling as I scanned the lit up signs and saw Chipotle. I thought why not, a few days earlier I was craving a burrito. What a mistake.\n\nI walked in to the establishment, several of the tables were dirty and there was a cacophony of noise coming from a group of teenagers. \n\nI ordered a carne asada, sorry steak burrito. After my tortilla was steamed I had two options for rice, neither one of them was Spanish. Their bean options were pinto or black, no refried. I watched as the girl fumbled around trying to wrap the burrito. The only thing holding it together was tin foil. I also got a side of chips and guacamole. The girl at the register rang up my order before I had a chance to get a drink. I let it slide, let's face it I don't need a soda.\n\nI found a clean table; unfortunately it was next to the teenagers. I took a bite of the burrito and it was cold. I kept eating in hopes I'd fine the warm part, I never did. The chips were good until I bit into a soggy one. I was about to spit it out when I realized the soggy was lime juice. I applaud them for trying to make the chips more interesting but this doesn't work. I want crisp tortilla chips not a margarita.\n\nOverall the flavors weren't bad but the cold food and soggy chips ruined it for me. I'll not be returning.", "author": "Jane W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-25", "description": "I am a big fan of Chipoltle but this location is not up to par with the brand. I live close by and this is my go-to spot about once a month. About 75% of the time I've had a bad experience. For example, today they ran out of lettuce, tortilla chips, barbacoa, carnitas, sofritas (tofu), lids for the bowls. There is overall poor management. One of the reasons I love Chipoltle is for their fresh sustainable ingredients. I often order a salad and on more than one occasion, this location has run out of dressing and will not get more in until a few days later. It's very surprising with such fresh ingredients they can't make more dressing in-house. Today, there was a long line and there were two employees wiping the counters instead of serving the customers. The orders were backed up and the food was getting cold. Frankly it is unacceptable. I think this location needs better management and better quality control.", "author": "Debbie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-21", "description": "Folks, make sure to head on over to this Chipotle location if you like finding medium length, brown hair that is buried deep in your burrito. Talk about the most inappropriate experience of my life.", "author": "Justine M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-31", "description": "This location used to be great... The last two times have been ok but today was the pits. First no carnitas...ok, not the end of the world but not good. Then the staff wanting to clock in/out step in front of the cashier preventing him from ringing a customer. Customers should be the priority not clocking in. Finally at the napkin/utensil/drink area it is messy and all out of forks! Tough day I guess. Maybe the staff all sees the writing on the wall that the stonestown location is going to hurt the business.", "author": "K H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-29", "description": "my first time eating at this place, and i was far from impressed. \n\nis the brown rice just as nasty as the white rice? cuz the white rice was pretty nasty. wasnt too crazy about their pinto beans, neither. now im reading more reviews, and i see that this place offers \"healthy\" burritos. had i known that before, i would have eaten elsewhere.\n\nthe carnitas even tasted healthy. no bueno! the entire burrito just had a dry, unsatisfying taste to it. even the chips and salsa i always order with every burrito was ruined by this place. what kind of \"salsa\" is this? \n\nthe best thing about this experience was the advertising on the packaging. never again.", "author": "Charles V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-14", "description": "The worst Chipotle EVER!!!!!!!!!  Slow workers, dirty food stations, disgusting dining area, employees not washing hands after they sweep the floor, employees not wearing hats while prepping food, slow dull service by cashier.  I have already contacted corporate of this branch in Lakeshore Plaza and they were kind enough to send me 2 burrito cards.  I will use this elsewhere.  The worst......", "author": "Sam J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-16", "description": "So I'm a fan of chipotle for convenience and somewhat fresh ingredients. When I heard the shopping plaza by my house was getting a chipotle I was excited. However, in my opinion the portions here are liiitle stingy. Other Chipotle's I go to my burrito or burrito bowl are way bigger. Don't get me wrong I still go here from time to time, but I have lower expectations in the portion department.", "author": "Sandhya R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-16", "description": "Got through the line and my burrito was about five inches long with a three inch diameter. I asked why and the cashier said they were told to make smaller portions. Still cost nine dollars though.", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-15", "description": "I ate here yesterday. I must say the burrito I had tasted \"off\" but couldn't put my finger on it so ate it anyway.  I was up all night and half the morning with FOOD POISONING. DO NOT GO HERE.  END OF DISCUSSION!!!!", "author": "Ngeean x."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-24", "description": "I've been here twice and had gotten corn tacos both times to go. I live down Ocean about a 3 minute walk away and by the time a get home, the tortilla has split apart. \nI ended up having to eat my tacos with a spoon.\nI wouldn't come here again.", "author": "Monica M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-17", "description": "The sloat chipotle is awful. The whole Chipotle experience lacked consistency which chain restaurants are known for. It started with the girl who took my to go burrito bowl order. Though perky, she can't make a burrito bowl or even a regular burrito to save her job. She slapped everything into the bowl. At the end my bowl was messy and not all the way full. The aluminum lid wasn't even put on correctly and was dented in one area. The cashier guy wasnt any better. He was slow and didnt seem to know the menu. The staff seemed untrained. The manager of this location should do something and maybe visit one of the downtown locations where the burritos are made to look good and are consistent with other Chipotles that I have been to.", "author": "Trudie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "Really good food, if you go in the morning, or at night they gave you huge portions. Really friendly customer service. Nice area. Compact, but worth all your while!!!", "author": "Andre M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-07", "description": "I am a HUGE fan of chipotle, but the three times I have been here I have consistently been disappointed. Every time I have come (at different times in the day) the burrito line has been very messy, which is not very nice to see. My boyfriend always received his quesadilla undercooked and we have to ask to have it grilled a second time. The service is also not great, the people who have served me have been very helpful but there was one time that my boyfriend and I came (around 4 pm) and I believe it was a shift change as randomly two steps into my order the server walked away and all of them stood talking around the register for at least ten minutes, completely ignoring us and the other patrons waiting in line. Will not be coming back to this location.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-04", "description": "I've been here 4 times and each time its been worse than the time before. This is the only location I've ever had a problem with. The quality of meat at this location is lower than low. Last night I found a chunk of bone I'm my burrito. I also did not take a single bite where I didn't have to spit a piece of meat out. Its inedible. So tough I couldn't bite through it. On top of all that today my girlfriend woke up puking. I would seriously steer clear of this location.", "author": "Brennan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-03", "description": "They said their salsa is not spicy but it's burning my mouth. Just because you can take spicy stuff doesn't mean everyone else can, too. The service was rude also.", "author": "Sky F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-19", "description": "I went to this chipotle for the first time tonight and was very disappointed! I love chipotle but did not leave happy tonight. They jipped me on everything, and other customers I saw them make burritos for. I had to ask for more rice and more cheese because they barely put any. And my burrito was ripped when I opened it at home. Also, my girlfriend got a quesadilla and when she opened it at home they didn't even cut it into pieces and the cheese wasn't melted all the way! She had to throw it in the microwave. I will most likely not go here again even though it is closest to where I live. Westlake will have to do! Hope this helps...", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-28", "description": "My family and I love Chipotle and we go to a variety of Chipotle chains in San Francisco. I don't think I will be coming back to this place. I know its a small place and seating is limited. When we were through ordering our food, they asked us is this to go or for here? Well if there was somewhere to sit we would eat here. looking around i noticed that there was two employees siting at a four seat table. I thought it was really rude that they did not get up for paying costumers to sit and eat, and the Manager should of told them to move so the costumers could eat at the tables. Also we ordered a casadilla for my daughter and when we got home it was not in the bag. The employees were so busy chatting that they forgot to put our food in the bag. When we went back to get the food, they said it was our fault for not grabbing it, when it was clearly not in our bag that was handed to us. I am very disappointed and disgusted with poor service at this restaurant. We will not be returning to this chain and we will now be going to the one at Stownstown. Management should really concentrate on what customer service is and retrain all their employees again on being kind and inviting.", "author": "Sophia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-07", "description": "Great location with GREAT Staff!\n\nI gave up on Daly City. I am a firm believer in giving feedback, both positive and negative, to help a company improve. I wrote several letters to Chipotle Corporate about the poorly run Daly City location. Employees with lose hair, training employees to wait until the chicken or peppers are GONE and customer requests them before they bother even starting to cook more. Can't tell you how many times I've had to stand there waiting for a certain item. \n\nAfter growing tired of dealing with Daly City, I tried the Sloat location. OMG! What a difference. They act like the old days when Chipotle was new and cared about service. The employees are friendly (and speak english instead of tagalog), and they LOOK at the items and anticipate when things are starting to run low, and start cooking in advance. I'm a fan again!\n\nSo bottom line, if you love Chipotle, don't give up on them just because Daly City Westlake location sucks, go to the one on Sloat. It's literally 5 minutes from the Daly City one and you don't have to deal with putting your life on the line driving through little Manila (Westlake Center), and you can get in and out without sacrificing ingredients.\n\nThe only downside is it's (slightly) more expensive than the non-SF ones, my guess is because they have to cover the cost of SF's minimum wage and\\or Healthy SF, but I'm 100% okay with that!", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-18", "description": "Tasty burritos. Friendly and fast service. Fairly healthy.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "Why does everyone hate this place?  It's not bad.  Their food is fresh, they give you tons, and just maybe, there might be a line.  I have never ate in, but i mean it has been clean every time I've been there.  Chipotle is the perfect place for a quick, fresh bite.", "author": "Praise C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-11", "description": "My first experience at Chipotle...passed by it many times but finally got to try it with my kids. Service was friendly but lacking experience. I told the guy I wanted a chicken burrito and 2 orders of the taco kit kids meal so the guy heated up my tortilla and asked me what meat and rice I wanted. I chose the brown rice & chicken. He then passed the tray to his co-worker next to him for me to choose the toppings. While I'm telling the lady what I wanted, he's asking me what my kids wanted. At the same time, the lady is asking me if I wanted guacamole and other things! I told the man to hold on so I could finish telling the lady what I wanted in my burrito. He then says, so do you still want the taco kits? Yes, but I can only answer to one person at a time! Geez Louise! The kids meal was a good deal. For the taco kit @ $4.60, they got a tray with their choice of meat, rice, corn & 2 tortillas, chips and a drink (juice or milk). I didn't know they charged an additional $2 for a splat of guacamole. The taquerias usually charge $1 extra. Anyhow, the burrito wasn't bad. I like the fresh ingredients but the tortilla is very dry and chewy and wasn't wrapped tight enough. Once I bit into my burrito, everything came apart so I just ate it with a fork instead. I wished they had a steamer to steam the burrito so it's nice and hot like the taquerias. Instead the salsa, sour cream, guacamole & corn made the burrito taste COLD!!! I wouldn't crave to come here but if I'm in the neighborhood and feel like having a burrito, I'll stop by. One thing I didn't like is that they didn't have pictures or descriptions to help people sort their trash. People were throwing napkins in the black bin when it's suppose to be compost and mostly everything was in the trash instead of the appropriate bins. If you're going to promote healthy eating, help care for mother earth too!", "author": "Mimi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-25", "description": "Oh, Chipotle. I really don't like you but you position yourself so strategically. No one reading this review is likely to have never experienced your lackluster white-girl Mexican food so I won't go much into that other than to say that although your burritos are easy to eat quickly in the car in between work or classes or whatever, it is because your tortillas are nearly rock solid. Is this a good thing? I guess it is...sometimes...cuz I've done it more than once. Perhaps this is more a review of my laziness than your quality. Which is why I am giving you three stars. My laziness is A-OK.", "author": "Alan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-01", "description": "The food here is okay. I had their burrito bowl and it was pretty good. The burrito bowl is essentially all the ingredients you would find in a burrito, but just eaten out of a bowl. Although the taste of the food was decent, I wasn['t really wowed by it. It tasted like \"americanized\" mexican food that you would make at home . If you are craving for some real mexican comida this is not the place. I would only come back here if I'm craving for \"americanizeD\" mexican food. The service here is okay and the restaurant is clean .", "author": "Lucy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-21", "description": "It's a chipotle, no complaints on the meal itself. Why I gave it 2 stars was because of how it is run. I went around 7:30pm and they were out of white rice, fajitas, and black beans. In addition, they placed my burrito bowl with several others and there was a large confusion at the cash register. Their only redeeming quality, which is why I gave them two stars over one, is that they give good portions of meat on their burritos (a common issue at chipotle).", "author": "Erik V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-20", "description": "It's ok. Nothing special really. There are better burrito/mexican places. But its nearby. Burritos are kinda small though for the price. I expected better.", "author": "Nikita K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-10", "description": "Obviously any of the amazing taquerias in the Mission have better burritos.  With that said, Chipotle does an incredible job of offering up a great tasting meal very quickly.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "ive never been to a bad chipotles. that being said, this chipotles is like all the others. good quality food with great service. there isnt a lot of seating so if you plan to eat, take it to go. the only reason why its 4 stars is due to the poor burrito rolling skills and a lady gave me attitude for asking for a quesarito (i was the only person in line)", "author": "Zachary H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-26", "description": "Great food, but they skimp on the proteins... if you're not careful, you'll only get half of what they should give you... and if you call them on it, you'll get dirty looks or they will try to charge you extra...\n\nThis isn't just me saying this... read below and you'll see I'm not the only one. My wife constantly complains about this to me too... yet, we always put up with this because of the great flavor/texture of the food...", "author": "Gene G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-14", "description": "I had a 2-for-1 coupon so my boyfriend and I decided to try Chipotle.  This was the first Chipotle experience for both of us, so I didn't have any other locations to compare it to.\n\nThe place is simple and clean.  Service was very friendly and efficient.  Based on some other reviews, maybe it took some time for employees to be trained at a new location, but I couldn't have asked for better service.\n\nI knew about Chipotle's reputation for using good ingredients, which was part of the appeal for trying it out.  Unfortunately, the quality of the meat (I had chicken, bf had steak) was pretty disgusting -- it looked good behind the counter, but it ended up being lots of fat and gristle.  After we each gagged and spat out several mouthfuls, we ended up picking most of it out, and even our cats wouldn't touch it.\n\nAnother downer was that the rice just didn't seem right -- too much citrus taste, and a little dry -- but it would have been okay if the meat hadn't been so gross.  The tortilla and salsa were very good, and the burrito was wrapped well.  I thought portion size was average, not as teeny as others have indicated, though it's hardly a taqueria super burrito that you could get (with chips and guacamole!) for the same or lower price and the same or better quality.\n\nIt wasn't terrible, and my star rating would be higher if there weren't so many better, cheaper alternatives for the quality of food.  If I were to go back, I'd definitely stick with a veggie option.  I'm just glad we had the coupon, or I really would have felt cheated.\n\nThis place defines the \"Meh.  I've experienced better\" description of a 2-star rating.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-29", "description": "I really wanted to rate this location 3 stars and I actually spent probably 5 minutes debating it (which is far to long to think about a yelp rating), but after careful consideration I have to go with 2 stars. But in the immortal words of fellow Yelper Allan L., \"Dude, come on Lakeshore Chipotle.\"  You totally have skimped on the fillings in my burrito twice... I ordered vegetarian and literally got 3 pieces of green pepper as my filling. I'm not asking for a fully stuffed burrito, but more than 3 pieces of pepper would have been nice.  The place is also so chaotic every time I go.... I think that may have more to do with indecisive customers and the big groups that seems to flock into the restaurant ahead of me, but still.  Because of the chaos, I've almost gone home with the wrong food.... TWICE! The people who work there are really nice and try to be accommodating, but even in spite of them, I never have a really great experience when coming to this Chipotle.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-24", "description": "Flavors are good. Bowls are piled high which I like but what killed it was the rice was not cooked through. Any harder and itll be raw rice grains.", "author": "Darren Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-30", "description": "This location either is just the worst or hates me. When I order a burrito (typically a fajita burrito) I ALWAYS have to ask for more peppers and stuff. They skimp.  No other location does this so bad. When I have someone else pick me up my burrito, it usually comes back around small as heck. This the only location this ever happens at so my guess is this location is trained to make them that way. Be sure to get lettuce on your burrito if you want it a decent size compared to other locations. I've been to tons of locations and have had chipotle at least 100-120 times over the years. Typically love it, but this location is so bad it needs to be called out. Wife just brought back a burrito  for the family (where she admits she wasn't paying attention to every one of them being made) and a couple were only around 4\" long. And pretty much no peppers in mine.", "author": "Koobie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-14", "description": "Came in one night an hour prior to closing and they were out of chips?  Really?  Never been a huge fan of Chipotle in general.  Usually get a burrito or children's quesadilla.  I love their chips and guac though.", "author": "Noreen F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-27", "description": "I don't know why we try to go here anymore.  My boyfriend and I started going to this location when it first opened.  It was great, but then the next few weeks they started running out of everything.  How does a business do well when they run out of everything?  First of all Daly City never does, and I have had always great service from there.  This location; however, has failed since the first month of this location being open.  We use to love the help here, but that has changed too.  Even when they didn't have guacamole or sour cream or chicken, we still came here for the service, but now this is not the case, so we both decided to go to Daly City and They gave us a discount for the bad service Sloat gave us... Sloat didn't even bother to offer that.  We both work in very high-end customer service jobs and believe in providing feedback.  For us we would rather go to a location that is always stocked with items of what they sell, and Great customer service, instead of an unprepared location, with bad service.  We both will not go back here even though it is five minutes from our house.  I would rather drive to Daly City, than to worry if the Sloat location will be out of guacamole, sour cream, or CHICKEN or ALL 3 at the same time... horrible. If I could give 0 stars I would.", "author": "Kristina R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-28", "description": "My husband and I love Chipotle in general. The food is fresh and delicious. With the Lakeshore plaza location, there is often something missing. Some of the staff are sometimes sloppy in the way they prepare the food. This evening we found avocado seed bits in our burrito. To the staff: Please maintain the high quality we are used to and be a little more careful when preparing food. Imagine how you would wish someone else to prepare food that you will eat.", "author": "Rima E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-27", "description": "This place has horrible service and never anything in stock.  How does a food place run out of Chicken?  That is a staple for you!  Then to give bad customer service on top of that.  Someone woke up on the wrong side of the burrito.  Come on now, and you ran out of guacamole? How does that happen?  Don't you all make that yourself?  I mean I will go buy you some avocados and make it if it's about being lazy.  Man this place is always out of stuff.  Even sour cream! Now I'm no genius, but I will go to Lucky's across the way and buy it for you all... I don't know about you guys, but this place lacks creativity.  I worked for a food place and use to buy stuff for my business if it ran out. Oh wait you all grow that yourself, well then maybe you need to start thinking a little more and have things in stock because this is ridiculous.  I have advice for everyone going here: Call ahead to see if they have anything you want because they might only have tortillas and lettuce possibly some brown rice and maybe some cheese... You might only be able to get a quesadilla... if you're lucky.", "author": "M R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-31", "description": "Portions are inconsistent. The girl gave us so little compared to the rest of the people around us. Truly disappointed.", "author": "Jen T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-13", "description": "The staff here are absolutely rude! I bought a steak burrito for 7.56, I gave the cashier $8.01 hoping to get 45 cents in change, the cashier gave me 35 cents and 10 pennies! I was furious ! That was just rude! I am not coming to this chipotles anymore !1 star is for the food not the service!", "author": "Sue K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-29", "description": "I have been a fan of this place from day one. it is the best burrito I have ever had. However... PLEASE DO NOT TRAIN INCOMPITANT EMPLOYEES ON CUSTOMERS!!! These truly are the best ingredients in S.F. and I still eat here twice a week. But when I see ripped and torn burritos given to customers that are obviously too compassionate to speak up, it pisses me off. I have witnessed this in several locations. I eventually learned to ask for a competent person to prepare my food and ended up in a questioning issue...EVERY location has told me \"well, it is a very watery burrito\".   BS, Chipoltle. I will always come back. but I hate how much food you just throw in the trash.", "author": "punk l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-04", "description": "Great food! BIG PORTIONS and friendly service!", "author": "Zuleima J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-10", "description": "First don't order over the phone or online because last time I ordered both online and over the phone for pickup. When my mom went to pick it up they said that I never called which there were lying because they called me back twice to make sure of the order then when someone comes in you tell them its not ready and never called. I would not order from this place. You're gonna lie to you're customers to get a better customer service.", "author": "Mybraceletsify L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-06", "description": "good average mexican food... still not up to par to my local mexican joint back in sac", "author": "Jaseon F."}
