{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "Can you say ... customer for life? Waiting for my take out order on a busy night and talking to the owner Ray about their amazing vegan options and that I was happy to see them so busy...\n\nNext thing I know he hands me my card back and gives me my tacos on the house!\n\nLove places that appreciate what great customer service / loyalty can do for a small business. I'll be back, again and again and again...\n\nKeep it up Chisme! And to any vegans out there, they have amazing plant based options!!!", "author": "Mark J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-22", "description": "Chisme is a good sized, modestly priced Mexican restaurant on Sutter between Leavenworth and Jones, which is a great choice if you are in the Nob Hill area where modest priced and tasty options are few and far between. The order at the counter concept and open seating means that it is a flexible place to get a quick bite.  The wide open door and chilly SF weather means that it might be a windy bite.  The tables are more geared for communal dining and largely with high top tables that are not very family friendly.\n\nThe staff is so friendly and inviting.  They have lots of knowledge about the menu and are very patient.  The tacos come two per order and are quite large.  I encourage anyone to bring  a friend and split a couple of orders so you can have more than one taste.  We had:\n\nChicken Taco ($11): two corn tortillas with shredded, spicy chipotle chicken, caramelized onion, some peanut mole and queso fresco.  I was not a fan of this taco, because it was not very flavorful.  Mole is a personal favorite of mine, and I could really only taste chipotle and felt like the mole was totally lost.  It was not a well balanced taco.\n\nMahi Mahi Taco ($12): this was a solid taco.  Two corn tortillas had a drizzle of creamy dressing (coconut ranch that tasted mostly of ranch) topped with sauteed spinach, grilled and heavily spiced mahi mahi, grilled pineapple salsa with habanero and some red onions.  The taco was tasty - good fish that was well cooked.\n\nJackfruit Taco ($9): THE BEST TACO ON THE MENU!!!  Two corn tortillas were loaded with fried jackfruit, a little spinach and lots of tangy and sweet red cabbage salad before being finished with a verdant and fresh mint verde.  So good and would return just to have this.\n\nPinchelotes ($8): traditional Mexican street corn that is halved and put on a stick for easy sharing between two.  A well prepared classic.\n\nChips and Guac ($9): a VERY generous portion of guac and the staff is willing to replenish the chips.  The guac is fresh and has the perfect balance of salt and lime.  A solid, traditional choice.\n\nDeath Via Ginger ($4 for hot as opposed to cold): absolutely the best thing that I had.  It is a hot ginger brew with mint and lime that is about the best hangover or make-you-feel-better regardless of what ails you drink.  I love, love, love this and would come just to get one.\n\nOverall, the tacos were a bit mixed for me.  The mahi mahi was classic but nothing special, the chicken was a miss and the jackfruit was out of this world.  I would come back and recommend, but I can't say it is the best ever.", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "I've had this bookmarked on my \"must-try vegan spots\" for quite awhile now. Today, I finally decided to try it out! Honestly so surprised how vegan tacos can taste so good. \n\nFirst, I ordered 2 eggplant tacos. I added guacamole for an extra dollar. The taco was honestly full of flavor! I didn't really have much complaints other than I wished the guacamole was evenly distributed lol I felt like it was just a big blob. The amount of guacamole was also a little too much.. but who am I to complain? More is better than less. I couldn't finish my two tacos because I was so full from eating their chips & salsa- which was also very delicious! I loved their red and green salsa. Their green salsa was so creamy and spicy. Additionally, my boyfriend ordered a mahi-mahi taco and he liked it as well. Also, we ordered coconut horchata and they were boooombbb!\n\nSecondly, the service was great! All staff were kind and helpful :)\n\nLast, I loved loved the atmosphere. The lights were purposely on the dark side and it made me a little sleepy lmao. I was so full that I was about to pass out in the restaurant.\n\nOverall, my total was $41 which is a little expensive but it was worth it for the experience! Definitely recommend!", "author": "Tanya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "Quick, reasonably priced, nice sized portions, and never that crowded for some reason. Good variety for an assortment of diets, and most importantly really tasty. I usually order the steak tacos and either the plantains or the corn, but I've tried other people's dishes too. You can't really go wrong with what you order here.", "author": "Cynthia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-15", "description": "Visiting Chismse Cantina for the first time on Sutter Street today. It's easily identifiable due to the teal doors, blue gate, and awning in front. It's a small business with reasonable rustic seating options and friendly staff. It's expensive for the Quantity of food you receive, but, the food is good. I'd recommend the shrimp or skirt steak tacos. I ordered the shrimp tacos (which only came with 2) and chips and guac which totaled over $20. Again, its a good place and worth trying. Just be prepared for the sticker price!", "author": "Rhett B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Hands down the best tacos I had outside of Mexico. \n\nI love this place!!! You know when you eat something and you feel all nourished and happy and wholesome? That's how I felt after having the food at Chisme. Ingredients were really fresh, and the even the fried food wasn't too greasy. Everything was just absolutely delicious, and perfect and I felt satiated and satisfied and very happy. \n\nI'm not vegan, but my friend and I thought the vegan options sounded delicious, so we got the eggplant and jackfruit tacos. Best decision ever. It's so delicious, it just doesn't cross your mind that you're eating something vegan. The combinations of toppings also went so well, and might I say the hot sauce also had just the right amount of heat. My friend LOVED the peanut mole in the eggplant tacos. (Tip: it's on the steak tacos as well!)\n\nWe had an early dinner around 5.30pm, and knowing myself, I knew I'd be hungry by around 8pm, so I got a box of steak tacos and cauliflower ceviche to go (recommended by the lovely lady at the counter). I personally preferred the vegan tacos to the steak tacos, but they were also so good. Cauliflower ceviche came with fresh, warm, chips. The whole combination was to die for. The ceviche was so incredibly refreshing, the perfect late evening snack I wanted! \n\nAlso ate pinchelotes... and I love corn, so that was good too.\n\nEverything everything EVERYTHING was good. You can't go wrong here :) (the only thing I didn't love was the coconut horchata, I thought it was too sweet for me)", "author": "Su Lin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Thrilled yet again!! Got to try the eggplant tacos which were filled with a crispy, fried eggplant, mole, spinach and onions- filling yet light enough to enjoy some churros too! We also tried the papas rojas... the sauce on top was absolutely delectable.\nMade the right choice this time, and I skipped the beer for the refreshing horchata!", "author": "Roma R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "This restaurant was a great find while we wanted to eat something before seeing Kathy Griffin at the Masonic.\n\nThe staff was excellent at suggesting what was best on the menu.\n\nWe had sangria, to meet tacos and to vegetarian tacos. Very flavorful and really enjoyed the meal.\n\nThe food was visually appealing, the restaurant is super cute,  clean, and definitely will be back when I am in the area.", "author": "Ray A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Awesome little taco shop. The cauliflower ceviche is amazing, especially for my mom who isn't a seafood fan who finally got to try a fun new twist on ceviche! The steak tacos were great, as was the bowl! So much good food and you leave feeling like that \"clean full\" where you haven't eaten a ton of greasy food! Will definitely be back again, as I was told they always try and update the menu with new exciting flavors!", "author": "Robert Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Came here with some friends who were visiting SF to grab a quick lunch - and I am so impressed with the service and how sweet the staff was! \n\nI never had a jackfruit taco in my life and was feeling very adventurous. I decided to try it after someone recommended it to me and realized after one bite that I hate jackfruit (if you are a fan, more power to you). But I did not like the texture or the sweet flavor because I am a spicy flavor kind of gal. \n\nAfter my disappointment with the taco I was hesitant/embarrassed about telling the staff, but they were so accommodating that they let me return that taco plate and order a different one! I ended up with shrimp tacos and paid the difference. The shrimp tacos were much better and I really enjoyed them!", "author": "Alysia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Right as we walked in we were greeted with a beautiful smile and welcoming words. The interior of the restaurant  is so aesthetically pleasing including the honey bear wall, which is so cute! \n\nOur order included one quesadilla (half plantain and half steak), and an order of pinchelotes. On the plate we also received a side of sour cream, grilled pineapple habanero and roasted tomato salsa. Both the quesadilla and the corn were SO delicious and flavorful. The salsas definitely topped it off, and are seriously to die for. \n\nAlthough the menu is a little pricey, it is definitely worth the try. Food is one thing, but great customer service is another that really topped our experience off. Will definitely be back again to try more of what they have to offer when we're back in town :)", "author": "Nayoung K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Interesting menu.\n Never seen jackfruit tacos. Will be my go to next time. Great chipotle chicken tacos. Loved the vibe. Highly recommend.", "author": "Teri C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Really great eclectic modern Mexican food. Drinks are good to... Beer and Horchata. Definitely worth trying. The plantains are like heaven", "author": "Kathleen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-02", "description": "I was rolling solo for lunch, which is the perfect (and by all estimations - the ONLY time) to indulge in corn on the cob. Or, elotes in this case. \n\nThe number of times you (irrespective of gender) should ever order corn on the cob while in the company of others is zero. You look like a damn toothless fool for half of the ordeal, and are foolishly picking corn out of your damn teeth for the other half. Unattractive. \n\nAlas, this isn't just any corn on the cob, they are elotes. Smothered in cotija cheese, slathered in mayo, drizzled with lime. Some varietals (not found on the Chisme menu) come in a cup, which negates my statements above. \n\nThe cauliflower ceviche was unique but I can't say I was blown away. Of course, in re-reading this sentence, it's glaringly clear why, but I am always up for low carb/calorie novelty. \n\nIn sum: Go alone. Remove the paper bag from your head. Order elotes. Enjoy.", "author": "Spartevan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-04", "description": "Great lunch spot! Also, the wall art by fnnch in there are ON POINT!\n\nMahi mahi tacos- super yummy and loved all the toppings, would get again.\n\nPlantain quesadilla- was good, but the cheese to plantain ratio was off. More plantains please :)\n\nChips and guac- presentation is great and they also don't rip you off on the amount of guac. Can I get an \"amen\" for that.", "author": "Morgyn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-12", "description": "Just okay. Food was not impressive and pricey for things that come in paper plates. The highlight for me was the coconut milk horchata ($5). I did like the ambiance. You order at the cash register and servers bring food to you. Makes splitting the bill a lot easier because you can order for yourself. \n\nI get it, rent is expensive in Nob Hill, but I didn't feel that the food quality or authenticity justified the price. They tried to make the dishes unique and colorful, which I appreciate (you eat with your eyes first!) but everything was not that flavorful. \n\nThe chips were kind of stale (but our waitress offered us more chips, thank you!) and the churros were overly sweet (since it was already stuffed with caramel, I didn't think the churros should have been dipped in more sugar).", "author": "Dana Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-13", "description": "Solid taco spot with some interesting menu options.\n\nThe coconut horchata was seriously one of the best I've ever had.  Must get!\n\nI was having a hard time deciding what to order but ultimately went with my go to... Steak for the win.\n\nIt was a bit messy but damn delicious!\n\nThe elote was way too cheesy for me and the guac was ok but I'd go back to try some of the other fun taco options for sure!", "author": "Kimberly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "Dinner review. Taco shop.\n\n3 - Chips/salsa/guacamole\n3 - Taco chicken\n4 - Taco steak\n3 - Quesadilla\n3 - Corn\n4 - Churros\n\nOverall, \"I'm a fan.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "Shrimp tacos - delicious, plenty of shrimp. I was worried they would skimp out. They did not! \n\nJackfruit vegan taco - I've been super curious about jackfruit as a meat substitute. It definitely looks like meat, but it doesn't taste like meat. However this taco was pretty dang delicious. \n\nCoconut horchata - I never get horchata, but the coconut was screaming for us to try it. MC doesn't like horchata either, but we both were highly obsessed. Not sweet at all, which is how we both like it!!! \n\nChurro - I wish there was an option for no caramel sauce, since I know not everyone likes caramel, BUT it was really good. It was still warm when we had it sitting out while we finished eating the rest of our tacos. Comes with fresh vanilla whipped cream. \n\nWater - it's colored.... why?? The only unnecessary thing there. Haha. \n\nI want to go back to try the other tacos.", "author": "Dianna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-28", "description": "Here's my chisme on Chisme: I think that the tacos are really flavorful and were prepared with an interesting twist. I had the shrimp tacos and my date had the steak tacos. Honestly, it reminded me of a blue apron recipe I cooked with a few months ago. \n\nThe coconut horchata was my favorite item here. I'd prob come back just for this. I love horchata in general. \n\nThe churros were very unique as well since they were filled with caramel in the center. \n\nNot sure if I'd make this my go-to place in my new hood but I appreciate the concept of what seems like \"healthier\" Mexicali food.", "author": "Denise L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Ay chisme! Que rico! We made it in here 15 minutes before they shut their doors, unbeknownst to us. But we would have never known that because the young lady welcomed us into the restaurant very warmly and gave us suggestions on what to order. \nWe had a seat and within 5 minutes, our food was delivered. As we continued to eat we over heard her welcoming people in but kindly informing them they were closed for the night. She kindly came over to assure us they would begin cleaning but to please take our time eating as there was no rush for us to leave the establishment. \n\nFood: WOW Chisme! My wife and I are STILL talking about these tacos despite us being alllllll the way in Maryland. The chicken tacos were so delicious with the right amount of spice. \nThe shrimp tacos were bursting with flavor with fresh mango salsa. \nAnd the guac? Oh the guac! Oh guac! How I adore thee. The guac here is so fresh and chunky. The chips are obviously home made since the were warm and thick. Yum!\n\nLong story short we ate here twice. Luckily the taco joint was about 5 blocks from our hotel. If I could have, I would have made it here 3 times if I could. \n\nOne thing is for sure - Chisme will see me again if I ever find myself in San Fran again. \n\nYum!", "author": "Gina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-13", "description": "Visited from Seattle and decided to check out some restaurants in the area. I love tacos and always make it a point to get some every time I go on vacation! What struck me about Chisme was its peculiar menu. Jackfruit and eggplant tacos?! My interest was surely piqued. \n\nThey were pretty busy for a Thursday night. It seems like a hipster/touristy place. We ordered the following:\n\nSteak tacos - I really enjoyed the marinade, it was unique in a very good way. \nMahi mahi tacos - These were just ok, I think the fruity salsa overpowered the flavor of the mahi mahi.\nJackfruit tacos - Whatever topping they had (it was pink though.. Seasonal greens? Sweet cabbage?) made the entire taco really tart. Even after taking some of it out, it still tasted interesting to me...  We weren't huge fans of this one. \nPinchelotes - Really good. They sure didn't jip on the cheesiness!\nGuac and chips - Extra chips are free!\n\nMake sure to try the house hot sauce! It has a real nice kick to it, and it's sweet.\n\nIt's pretty expensive here. The tacos range from $8-12 for just 2 tacos and I'm pretty sure the pinchelotes were about $8-9 (seeing as how I usually get elote for $3.) It's one of those places where I'd go once just to try the cool menu.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "Tacos shouldn't only be consume on Tuesdays, right? Good any day of the week in my opinion. Chisme is located in the Union Square area right across from my favorite restaurant, Liholiho. Very cute interior with honey bears artwork along the walls. Open space with a good amount of seating. \n\nConcept: Order and take a number. Self serve water and utensils.\n\nI came with a group of 4. We order Shrimp, Skirt Steak and Pulled Chicken Tacos. All tacos are 2 per order. My favorite was the shrimp tacos, so much flavors and texture in that bite. It was delicious! \n\nWe also order ordered Papas Rojas, Guac and Chips, Pinchelotes and \nCauliflower Civiche. The papas rojas (potatoes) was so good that my group order another one. I was not a fan of the cauliflower civiche. I was hoping they had their roasted cauliflower but bummer, no longer on their menu. \n\nWe got the owner himself to serve us, which was amazing. He gave us great service, super friendly. My overall experience was good. The food was tasty and the presentation is Instagram worthy. Not my favorite taco spot in the city but will be making my way back very soon.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Taco Tuesday anyone?? This place is as good as it gets! Walking in, I felt instantly calmed by the beautiful details of the place; the Fnnch mural, the simplistic light fixtures, the 'magic' pink water... Everything in there made me want to stay.\n\nGreeted by a huge smile, we gathered some information about the menu before deciding on the skirt steak tacos ($11), the shrimp tacos ($10), and the cauliflower ceviche ($7). The food was out in a prompt fashion, and our taste buds lit up when we took our first bite. Holy moly peanut butter MOLE. These flavors WORK. Every bite was just like the first - magical. Adding the lime wedge to the cauliflower ceviche gave it an acidity that perfect the dish, and the staff brought more chips as soon as we finished the first batch.\n\nWe were so blown away that we decided to go in for dessert as well. We had a hard time deciding between the Sweet Chimichanga ($7) and the Caramel Churros ($7). However, we had no regrets when our caramel stuffed churros arrived with the sweetest, homemade whipped cream. Every.Damn.Bite was incredible. I have never enjoyed a churro so wholeheartedly.\n\nSo yes, come here. This is a humble restaurant serving some of the best damn food around at a totally affordable place. I am #blessed to live just around the corner and will be a frequent visitor here!", "author": "Hannah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "I came here for lunch today with my girlfriend and we had the jackfruit tacos, skirt steak tacos, an order of the elote, and a horchata to share. To get straight to the point, everything was delicious, the decor of the restaurant looks fantastic, and the woman at the counter couldn't have been nicer. \n\nOf the two different types of tacos we ordered, I personally like the jackfruit one a tiny bit more; the mint verde that was lathered on top of the cabbage in the taco was my favorite part of the taco. Our only criticism with the skirt steak taco is that the meat itself could've been cut a bit more, into smaller bit size pieces. With how the meat is cut right now, there's a good chance your first bite pulls out the entire piece of meat, leaving you with a meatless taco. Be sure to grab extra napkins for the skirt steak taco too! The (delicious) mole sauce is going to be dripping all over your hands once you're through with the taco. Overall, both tacos were carefully thought out in composition and I can definitely appreciate that.\n\nIf you've never had elote before, be sure to order one at Chisme! There are few things better than cheese on a cob of corn on a stick. You won't regret it.\n\nReading through the other Yelp reviews, it seems like people's primary criticism of Chisme is that the prices are too high, and that you can't mix and match the tacos. I disagree on both these points. The prices are perfectly reasonable for what you're getting, and you'll definitely be full after having an order of tacos. Not specific to Chisme, but to all restaurants in general: if the restaurant publishes its prices (which Chisme does), if you're unhappy with the pricing, just don't go; nobody's forcing you to. Re: mixing and matching, I've got a solution for you: come with a friend! Just order two and share :)\n\n5/5 experience, definitely coming back to Chisme.", "author": "Austin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Wow i was very impressed by this restaurant! I came here on a week day for dinner and there was no line but a bunch of people here hanging out and eating! The atmosphere was pretty hipster, a little different from a taqueria but very pleasant. The workers were all very nice and helpful, suggesting very good things they definitely know their menu!\n\nThe first thing i got was a white wine sangria, very good and refreshing! The freshly cut apples in it were so crisp and worth trying! \n\nNext i ordered the steak tacos and man were they good, there was so much flavor! Nicely cooked, not chewy or anything. One this i hate about steak tacos is that if i take a bite, the whole piece of steak of steak will come out but that did not happen which made the meal enjoyable. I also had a shrimp taco that my bf had and it's not one of this tacos that barely have any shrimp, i had shrimp in every bite and it was in this sauce that had some spice so it has a slight kick but not spicy. It was topped with a salsa that had mangos and they weren't this giant diced tomatoes and mangos, its was a small dice which made eating pretty easy. Both the tacos were soooo good! But the spicy sauce that they usually ask if you want, it is SOOOO SPICY! Just a warning.\n\nDrum roll to my favorite part of my meal! The Caramel Churros!!! Omg they are worth getting! Homemade cream and the churros have a caramel Creme on the inside! Uuuugh i want more!! And let me tell you that i don't like sweets but these churros were just soooooo good! Everyone needs to try them!\n\nOverall, would come back here again! :)", "author": "Ada N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Nice chill place with great appetizers and drinks big tables great for board games. \nWe went there after lunch for drinks and got a bunch of appetizers. They have a have a decent selection of the beers and drinks with some unique option (death by ginger!!).", "author": "Melissa Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Aye you wanna hear some chisme listen up, this place has some bomb ass tacos, especially for the vegetarian/vegan crowd, with more than just a one-off option. My friend and I split two orders of tacos so that we could try one of each item. We had the mahi-mahi and the jackfruit. The mahi-mahi were great - cabbage, sauce/salsa verde were all on point and deliciously tangy. But the jackfruit one was the standout - this was very diff from your typical \"pulled\" style of shredded jackfruit - no this was like they had the jackfruit pulled and then cubed and fried. Perfectly crispy on the outside, soft on the inside - and flavorful too! Topped with crispy nori (seaweed), you wouldn't think it would work but it so does.\nNot the place for authentic Mexican style tacos as it is a hipster spot, but really flavorful food. Def. will return!", "author": "Farrah N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "As my yelp buddies and I were in search of our next date night, Chisme was recommended. I skipped the yelp newsletter that featured Chisme, but alas, our dinner location was set.\n\nWe entered into a fairly large area. We observed that it's an order-first-then-sit-down type of place. Along the wall are a few cute... bears? (They're also at he Union Square Ice Rink). \n\nWhile waiting for the group, I started with a Panda Petals Saison. It was pretty tasty! \n\nWhen the group got here, this was what we decided on:\n\n2x Shrimp Tacos (2 per order so 4 tacos total)\n2x Skirt Steak Tacos (2 per order so 4 tacos total)\n2x Pulled Chicken Tacos (2 per order so 4 tacos total)\n\n2x Papas Rojas\n1x Guac and Chips\n2x Pinchelotes (Corn on the cob - 2 per order)\n1x Cauliflower Civiche\n\nOur general consensus was Steak, Shrimp, Chicken in that order. I personally LOVED the flavours in the shrimp taco. \n\nWe initially only ordered 1 papas rojas, but decided it was yummy enough to get another order! The cauliflower civiche, while a bit odd in theory, worked pretty well, however it was missing a little something that I can't put my finger on.\n\nThe guac was spot on, and the pinchelotes were quite good. Personally, I'd love more it if it had a hint of garlic on it!\n\nI spent some time talking to the owner on the thought process of establishing this place. He had an idea for each dish and how it should taste. There was one dish we wanted to try, but he took it off the menu due to it coming out a little inconsistent. That tells you a lot of what this place is trying to offer. There's also a lack of arrogance and he seems to be customer focused.\n\nOverall, this place does well and is heading in the right direction. I was really happy with the dishes. I really look forward to an updated menu in a few months to see if any other unique dishes pop up to try. \n\nI'll be back, to try all the beers, and definitely for more steak and shrimp tacos!", "author": "Kaje Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Amazing late night dinner after a concert. \n\nSangria was awesome, Guacamole was A++ for flavor and presentation... tacos were good too.\n\nAll around great spot", "author": "Robert M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "I wanted to love this place. I mean, I prefer \"rajas\" over shredded meat, any day. Buttttttttttt the peanut mole taco failed to deliver, because it was missing that chocolatey, tomato, spicy mess that Mexican mole is. Dammit. The elote also needed a kick. More chile powder, salt, butter. Gimme that thang. The papas, again with peanut mole sauce, failed to explode in my mauf. The coconut ranch got lost in the paprika and mole. The agua fresca was bomb.", "author": "Gabriela W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "When I found out that a new taco shop opened up in the 'hood, my interest perked.\n\nWhen I found out that they had vegan options, (not just a one or two but at least half the menu is vegan-friendly!) I knew I had to try it out asap. (That fiery 'Hot & New' business flame only lasts so long!)\n\nLocated off Sutter & Leavenworth, it mirrors power-player Liholiho and the faux-bougie corporate l*ser Papa John's. If I lived in the direct area, I'd be happy to see this new affordable, fresh, and delicious restaurant opening up.\n\nReading the reviews, it seems like a lot of Yelpers are complaining about the \"expensive prices\" of these tacos. Come on people, have you not been to Tacolicious or Nick's Crispy Tacos? This is not your average hole-in-the-wall taqueria. As much as I love my $2 tacos filled with beans and rice, this place offers a more modern take on Mexican cuisine with eclectic ingredients. Could you find fried plantain tacos at a standard taqueria? Don't think so. The diverse ingredients equate to a slightly higher price, but I don't believe it is priced exorbitantly. \n\nFor dinner, we had the Via Via (Fried Plaintain) tacos and the Jackfruit tacos. We also had the Papas Rojas with Mole Sauce, and draft beer to round the meal out.\n\nBoth tacos were delicious! The Fried plaintains were paired with refried black beans which were a delicious blend of sweet & savory. They fried the jackfruit, which gave it a crunchy texture. This paired very nicely with their fresh greens and mint verde. The mole sauce on the papas rojas was so good! Crispy potatoes topped with a savory white sauce. Yum! \nAlso, don't forget about their spicy green salsa. It definitely has a kick to it!\n\nThey offer bottled beer and wine, but we opted for the draft. I forgot what the brand of beer it was, but we went for the Cascade Sunshine, which is a light IPA. It paired very nicely with our meal.\n\nIf I had to nitpick something, I wish we could mix & match tacos. Since all the vegan tacos are $8 for 2, maybe at least we could mix and match the vegan options? Or maybe mix and match, but reflect the price of the higher priced taco. [Ex: Someone buys a steak & shrimp taco, it would still be $11 for the two].\n\nOverall, Chisme offers delicious tacos in a cozy environment at a decent price. I applaud the extensive vegan options and bold flavors not usually seen at a standard taqueria. I will be back again soon!", "author": "Lanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-05", "description": "I've now been here four or five times and have to say I'm a big fan of this place. I'm not vegan, or even vegetarian, but I love trying new foods. This menu certainly succeeds at honoring traditional flavors while offering alternatives for those who may have dietary restrictions. My favorite items on the menu are the:\n\n-- plantain tacos\n-- cauliflower ceviche\n-- horchata \n-- churros\n\nThe decor is nice and there's plenty of seating. It can get packed on a Saturday night so stick to week nights if you can. \n\n The only reason why I've taken off one star is for the price. Twenty bucks for two tacos and a side is a lot, especially when there are so many great options for $10 in the city. \n\nThat being said, it's cute and delicious. I'll keep giving them my money.", "author": "Capers B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-03", "description": "Hey Chisme! You're good, but you're not 2-small-tacos-for-$12-good. Add a third taco and it's a whole different ballgame. I understand you're using quality ingredients, but when my total is $40 after getting a 3 dishes...come on now....", "author": "Olya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Awesome!! \nTheir jack fruit tacos are a must.. \nalong with the coconut horchata.. \nthey play good music, and are extremely friendly :)\n\nI am not a vegan, nor vegetarian, and I very much enjoyed this place.", "author": "Natalie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "UHHHHH-mazing vegan tacos. And the horchata=life.  we also had the elote which was to die for. Loving this new local place!", "author": "Stephanie Giselle P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "Woahhhhh - welcome to the neighborhood! This is now officially my favorite restaurant in my area! This is going to be dangerous - amazing tacos at my doorstep, ah! \n\nVegan and non-vegans alike... this place is for you!!\n\nI tried the via via taco (fried plantains) and the jackfruit taco - both full of flavors and and oh so tasty! The Via Via  highlights the tastiness of the plantains, combined with the mango salsa and coconut ranch sauce, Wowy! The jackfruit is deep fried, so crispy and moist. Add some of their hot sauce to this taco for even more good flavor. Hot sauce is out of this world good. Also, very hot for spicy lovers!\n\nGet the coconut horchata - best mocktail ever!! Get it.\n\nAtmosphere wise they have done a phenomenal job. Big windows for natural light, large tables for big groups (up to 6). Up beat spanish music playing, really gives the place a great vibe. \n\nService is fast and friendly.", "author": "Jenna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "Not too shabby. I tried two shrimp tacos with a delicious sauce for $10 b4 tax. New spot with cool furniture and vibe. I would definitely try this spot again. I wanted to get the chicken tacos but I'm glad I trusted the waiters suggestion.\n\nThe world needs a San Francisco Taco ranking...so I'm here to provide my humble list/rankings. \n\nRanking explained:  #1 (listed at the top) is my favorite/ #?  (listed at the bottom) is my least favorite. \n\nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. If you're curious, I have rankings for Boba, Bakeries and Ramen , Chicken and Waffles as well (random right?)  Follow my profile to see my most recent reviews.  I hope I can be helpful since so many Yelpers have helped me discover new places.  \n\nRod's SF Taco Rankings:\n\n1 El Gallo Giro Taco truck\n2 Garajito\n3 Belmar La Gallinita Meat Market\n4 La Corneta\n5 Chisme\n6 El Norteno Taco Truck\n7 Taqueria Los Mayas \n8 Garaje\n9 Taqueria Vallarta\n10 Little Taqueria\n11 La Taqueria\n12 Taqueria Castillo\n13 El Farolito\n14 Pancho Villa Taqueria \n15 Taqueria el Buen Sabor\n16 Panuchos\n17 Taqueria Gudalajara\n18 La Palma Mexicatessen\n19 El Tonayense\n20 Tropisueno\n21 La Espiga de Oro\n22 Papito Hayes\n23 Tacos San Buena\n24 Los Compadres Taco Truck\n25 Cochinita Mayan Cuisine\n26 El Taco Loco\n27 Gordo Taqueria\n28 Nick's Crispy Tacos\n\nBelow is my top 10 for the Bay Area in case you were curious.\n1 El Gallo Giro Taco truck\n2 El Jaliciense\n3 Taqueria Sinaloa\n4 Garajito\n5 Belmar La Gallinita Meat Market\n6 Belly\n7 La Corneta\n8 Chisme\n9 El Norteno Taco Truck\n10 Taqueria Los Mayas", "author": "Rod M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-05", "description": "Chisme.\n\nYou tell a co-worker: \"I think ChadBro is kinda cute.\"\nThat person tells another person, who then tells another person, and another person.\n\nSeveral days later, when you go to the water cooler, everyone starts whispering and giving you the evil eye.\n\nA co-worker pulls you aside, \"WTF - didn't you know ChadBro is engaged?!\"\n\n\"Huh?\"\n\n\"Everyone is saying you have obsessive crush over ChadBro and that you're trying to break up his engagement!\"\n\nFunny, how telling someone something so seemingly innocent can turn you into a stage 10, psycho worthy of a starring role in a Lifetime movie. \n\nYea, I'm not the biggest fan of Chisme (\"gossip\" in Spanish) so let's talk tacos. \n\nChisme is a new fast-casual cantina serving \"Chicago-style\" pescatarian and vegan friendly tacos. The menu is vegan heavy but there's several options for all the carniwhores out there. Beer and sangria available. \n\nSeveral reviews comment about the high pricing of Chisme which I agree to some extent. $5-$6 tacos at Americanized/Californian/Modern Mexican restaurants are the sad reality of San Francisco, thanks to sky high rents and one of the highest minimum wages in the U.S.\n\nI'm fine with that as long as:\n\n(1) They're larger than $1.50-$2 street tacos. \n(2) They're made with higher quality ingredients.\n(3) They taste good.\n\nChisme has some of that down. I ordered the Skrrt Steak Tacos: Steak, caramelized onions, peanut mole, guacamole, queso (2 pc - $12): http://bit.ly/2xWV9Gx. The tacos are larger than street tacos and have a good amount of meat in them (guesstimating 3.5 oz per a taco). Two were filling for me. \n\nBut, as others have mentioned, the tacos are very bland. It's supposed to have peanut mole which sounds delicious but I didn't taste any. The tacos were in dire need of salsa, hot sauce, and a squirt of lime which Chisme doesn't seem to offer which is really odd.\n\nWhile ample in portion, the steak was chewy. They were in long, flat strips so it was hard to get a clean bite because of the chewiness. \n\nI never heard of Chicago-style tacos before and I asked my taco fiends at work, and they have no clue either. I did notice that the corn tortillas were larger and thicker, and good quality compared to your standard corn tortillas at a taqueria. Maybe that's the \"Chicago\" twist?\n\nI also ordered one of their vegan sides: Flower Basket - Fried pickled cauliflower + crispy curry kale w/ coconut ranch ($10): http://bit.ly/2xVoMud. I didn't like this at all. The cauliflower was sour as to be expected but it needed a better sauce for balance. The coconut ranch was watery and didn't taste like anything. Maybe a cashew cream based sauce would work better? The crispy kale reminded me of kale chips which I usually like but it had gooey [undercooked] batter in the middle. There were maybe 7-8 pieces of veggies and for $10 ($2 increase from last week), it was grossly overpriced. \n\nTheir drinks are also grossly overpriced: a small cup of horchata with mostly ice is $6 (see Genevieve Y's picture: http://bit.ly/2fN4pob) and a cup of agua fresca is $7. But, they do have complimentary fruit infused water which I did enjoy because who doesn't love free?!\n\nService is friendly and food is cooked to order. \n\nLoved the décor. I AM in love with the Mariachi honey bears on the wall - so cute!\n\nSince they're really new, Chisme does have potential. Add some salsas and lower the price points of the sides and the drinks, and they'll get the hangry spillage from Liholiho across the street.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "The mark of a good restaurant is finding yourself craving the food a few weeks later.  I stopped by Chisme with a few friends after seeing a show nearby.  Finding solid vegan food has been more difficult than I would imagine in San Francisco, but Chisme had a few tacos and other menu items that are vegan.  \n\nThe vegan tacos are jackfruit, eggplant, and plantain. All three were delicious. I think maybe the eggplant was my favorite as the breaded and fried crispy pieces of eggplant were crunchy and delicious. \n\nThe cauliflower ceviche was also delicious. As someone who recently started eating more of a plant based diet, I definitely find myself missing some of my favorite foods. While definitely not the same as real ceviche, this cauliflower ceviche definitely hit the spot with the lime juice and jalapeño flavors. \n\nThe staff was extremely friendly and attentive, the place was clean, and the decor was nice. \n\nI will definitely be back!", "author": "Paul W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-28", "description": "Date & Time:  Thursday September 28, 2017 @ 6:30pm\nDining Companion:  The Husband\nScene:  Solo Diners, Couples, Groups & Families in White & Blue Ruffled Off-The Shoulder Dresses w/ White Sneakers & Mini Cross-Body Bags \nMusic:  Latin Music that Makes You Want to Salsa\nDecor:  Fun & Whimsical.  Counter-Seating, Communal Tables & Tables for Four\nService:  Sweet, Friendly & Energetic Girls\nImbibe:  Coconut Horchata\nDevour:  Shrimp Tacos, Steak Tacos, Flower Basket(Fried Pink Pickled Cauliflower, Crispy Curry Kale, Coconut Ranch), Pinchelotes(Corn, Mayo, Cheese, Chili, Lime), For Dessert:  Sweet Chimichanga(Cinnamon Plantain w/ HouseMade Whipped Cream)\nTotal:  $60.63", "author": "Genevieve Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-07", "description": "Chisme chisme gossip all about it. And chisme I will to y'all.\n\nWhile I can't speak to all the menu items, the jackfruit taco was the bomb dot com. And I still can't believe it's vegetarian. The jackfruit is fried and has just the right amount of crunch, paired with a beautiful sauce and adorned with an IG worthy flower (lol). Churro was yummy, but for $6, it wasn't phenomenally better than a $1 churro at Costco, ya feel?\n\nService was friendly, music makes you want to shimmy, flavor combinations were interesting, but was it enough to offset the higher cost and warrant more of my stars? Not quite, but perhaps if they had a mix and match taco option (so that we can try more without breaking the taco bank), it'd be hard to exclude Chisme from any date night rotation.", "author": "Deanna C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-08", "description": "The taco tasted like chili with guac and cheese sprinkled spooned into a tortilla and folded to look like a taco. The flower doesn't make it taste any better. \nOne star for service, one star for the flower.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Chisme's jackfruit taco is to die for! Perfectly cooked, deliciously seasoned, and flavor packed salsa.", "author": "Tucker N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "I love this place! I've had the jackfruit tacos, mahi mahi tacos and their papas Rojas. The portions are great and make sure to ask for their homemade spicy sauce.", "author": "Jack C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "A new(ish) taco joint on a stretch of Sutter that is... weird. A couple really great greasy spoons. A coffee shop or two. Some hair stylists. A fortune teller. An art gallery. Liloliho. A book store that is definitely owned and operated by a wizard-in-hiding. And a gold dealer? OK, Sutter. \n\nAnyway, nice to have a place to eat that isn't closed by 3pm or Liloliho Yacht Club. \n\nBig, \"fast casual-y\" interior where you can sit comfortably, but not for too long. Speedy service. \n\nI know the whole deal here is tacos, but I had a plantain quesadilla. It was pretty good! And bigger than I thought it was gonna be. (I thought it was going to be feeble. Sorry for doubting you, Chisme.) \n\nCame with three \"housemade salsas\", one of which was sour cream. Don't get me wrong, I was glad of the sour cream and ate all of it but I'm not 100% sure it counts. \n\nA ton of vegan options on the menu, which was nice, but nothing specifically vegetarian. I guess you could just order a vegan thing and ask for real cheese and sour cream on it, but that was a level of social interaction with my server I wasn't prepared to have.", "author": "Jim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Best tacos in the neighborhood, hands down. Especially for the price. The guacamole is excellent, and the eloté is to die for. Also not a bad place to have a beer either. The owner, Ray, is very gracious and friendly. If by (some rare chance) the food isn't perfect, he will make it up to you by remaking it (or a free beer). \n\nIf you're up for it, the desserts are also excellent. Big fan of the churros and the plantains with ice cream. Presentation A+.", "author": "Jatin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "This was an Insta find while scrolling through bay area eats! super happy to have this crossed off the list. Great food, excellent service, and nice venue. \n\nfirst and foremost, the food. the mahi mahi tacos are great. full flavor from the fish and the toppings. the pineapple bits bring out the sweetness and the slaw and sauce carried the flavor of the fish making a mean taco. \n\nAlso tried the quesadilla. if youre for the traditional super quesadilla, id veer left from this item. the reason being is that the meat is sauteed with red onions and other seasonings that focus the taste on the seasonings, rather than the meat. not bad or terrible, just not your typical tacqueria style. \n\nlastly dessert and drinks. the plantains are an interesting take. if youve had thai style fried banana then this isn't far from that. plantains have a natural sugar coat when fried, so this was a lot sweeter, but the vanilla ice cream calmed the sweetness down. the churros are stuffed wtih caramel, so be careful of sweetness overload. the cream that accompanies the churros is great! homemade and not too dense. \nif you still have room, get the horchata. its a vegan take on it and it is honestly such a refreshing drink to have with your meal. hope this helped. leave a line, or lets explore food!!!", "author": "Nikole D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "So this is my first Yelp review ever! Why?? Because this restaurant has inspired me so much that I want the Yelp world to know! I visited this little gem back in November because it was conveniently located around the corner from a friend's apartment. \n\nI ordered the plantain tacos and was BLOWN away by the amazing blend of flavors! Each bite was irresistible. I could taste the expertise and the freshness of these gourmet tacos. I finished the plantain tacos and HAD to have more. I ordered the chicken tacos next and, just as I had expected, it had satiated all my taste buds. Not only that, finished off the tacos with a seasonal delicious draft beer! \n\nI have to say, Ray the owner, was the nicest guy! He joined our conversation and answered all my friends questions about starting a business, and was a really great person to talk to. I love going to a place that I can eat really delicious food and be treated as a friend and knowing that my money is supporting an amazing establishment!!!! I do not live in California but if I visit the Bay again, guaranteed I will come back!!", "author": "Windy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Spent a Sunday afternoon with a bunch of friends here. Great place to chill out, play games, have a drink and snack! The fried plantains are made with cinnamon sugar and you can't go wrong with it. Have a beer and you'll be set!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "This place is amazing! So many vegan options (!!) and all delicious. The Michelada was also fantastic. I'll be back soon!", "author": "Sam E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-12", "description": "Super overpriced for what you get. Delicious horchata though. \n\nSmall interior than can seat about 20. Prepare for a loud interior. \n\nSmall menu with 2 vegan options. If you like Mexican food, you may not enjoy this place. A very straightforward taco shop", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "This place was awesome! Just had dinner after a friend's recommendation about their vegan options. We had the jackfruit, eggplant and via via (plantain) tacos. Personally my favorite was the jackfruit! We also had the vegan potatoes rojas and chips and guac. Everything was piping hot and flavored amazingly. The free water also had flowers and fruit in it and was delicious! The place was beautifully done, bright colors and very clean. My only wish is that they had margaritas but they did have some local draftbeer. I'll definitely be coming back.", "author": "Stacy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "This place is great for vegans. I would especially recommend it for people with a large party because their long tables and small plates make for a great \"tapas\" style meal. They also have sangrias and great coconut horchatas. I've loved all of their food so far, especially their jackfruit tacos. Staff is incredibly nice. I can't stop coming back here, especially when it's a bit less crowded during the day.", "author": "Gina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-10", "description": "Well if I have to describe this place in one word, it would be \"interesting\". The place itself is super cute with adorable interiors and the have a very unique menu. I wanted to try the fried jackfruit taco and that's the reason I came here on a saturday afternoon. It wasn't crowded and we got the items on the table in 10 mins. I'm still unsure if I liked the taco or not, but it was worth the try! I probably wouldn't visit again, but it was a nice one time snack place!", "author": "Malavikka R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "I live in the neighborhood and this is one of my favorite spots to grab dinner. The staff is so friendly and the food is great. (Lots of vegan options at reasonable prices.) The decor is also super cute so that's always a plus. \n\nMy favorite dish is the Via Via.", "author": "Teresa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "What a fun little spot! A very interesting menu with small bites, tacos galore, vegetarian/vegan options, and churros! All at a great price for being in San Francisco. No frills, good food, fun environment, and friendly service.", "author": "Stephanie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-30", "description": "when the cashier waitress tells you the green hot sauce is a leeettle spiceee... fthat it's HOT.\n\nlol i'm a spice weakling anyway so why'd i even eat that and the DEATH BY GINGER. but hyeah i'd do it again.\n\nsure the tacos were good, tho i didn't taste much after dat sauce n dat drank. :p", "author": "Dan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-10", "description": "The service staff is very kind, the environment is cute, the atmosphere is a little confusing but friendlier than the matador down the street. I got the Via Via, a vegan fried plantain taco. I have to admit, the flower on top is a nice touch but the food wasn't worth the price. Very soggy tacos that drip everywhere and the tortillas rip open very easily so be careful and make sure you eat over your 'plate'. \n\nThe mouth feel / texture also needs some work: the spinach gets warm and soggy due to the dripping wet black beans and watery salsa and then it clumps together and all comes out at once making a huge mess that you have to scoop back into your tortilla with your fingers. \n\nAnother factor - if you are zero waste friendly this may not be the place for you. I'm not sure if it's because they don't want to do more dishes but even when you order 'for here' it comes in a to go container that gets thrown in the trash.  \n\nNot worth the amount of money y'all are charging. I know your in the city and you think you can get away with it, but locals don't fall for that crap. #anothertouristtrap", "author": "Amber L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-30", "description": "The presentation of the food here is spot on! I love how colorful the tacos are and they're finished with a beautiful flower. However I don't think the flavors match up to the presentation. We are vegan and we ordered all three vegan tacos. Our favorite was the via viva which is the taco with fried platanos/plantains. The other two were ok. We also ordered the flower basket and I preferred the kale to the cauliflower. I understand the cauliflower is pickled, but am not sure it goes well with the yummy sauce they include with it.\n\nThe interior is really cute, however it was freezing inside which is why we decided to take it to go. \n\nIt was pretty pricey, $4 for each taco. You can go to the mission and get a veggie taco with lots of beans, guacamole and salsa for about $1.25.\n\nI love how much vegan options they have and I know fellow vegans and vegetarians will appreciate and love it. I would come here again for the via viva tacos.", "author": "Reese E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Delicious! Wished I could mix the taco orders. The shrimp tacos are very savory; however, I had a small taste of the jackfruit taco and was blown away, much better than carnitas tacos. I guess, I'll have to come back!", "author": "Joselin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Solid food and drinks at reasonable prices. Excellent service.\nLike so much of the SF restaurant world, acts like it's never cold out, so why would you find ways to keep the draft out? It's a citywide scheme to act like it never gets cold out in hopes that it therefore never gets cold out.", "author": "Carl B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "FINALLY Mexican food with some authentic flavor! So tired of bland Mexican food around here. We had:\nChicken tacos: A\nElote: A+ seriously some of the best I've ever had.\nPoblano mashed potatoes: A+. What? How have I never thought of combining these two things? So, so, so yum.\n\nI'm in trouble. I work mere blocks from here. Will definitely be a regular.", "author": "Griffen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "Wonderful food and excellent service the Micheladas are ice cold and the tacos are to die for being from Los Angeles I'm used to really good Mexican food and I must say this place is awesome", "author": "Mario A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Best vegan tacos in San Francisco \nEverywhere you turn there is a new vegan restaurant but when you find one with regular and vegan meat you score big time !! \nMy boyfriend really enjoyed his non vegan tacos as well. I got the jack fruit and this is not just your ordinary jack fruit this one is breaded and fried to make your tacos delicious and crunchy\nIf I lived anywhere near San Francisco I would be a regular but until next time Chisme", "author": "Daisy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-12", "description": "When I noticed a new Mexican restaurant had popped up merely a block away from where I live, I was really excited to give it a try... and then I noticed the menu is vegan-friendly and my mind exploded a little (I'm not a vegan but I do like to eat plant-based foods on some days to give my system a break).\n\nI visited Chisme last night with a friend (who happens to be a vegan) and we ended up getting 1 order of jackfruit tacos, 1 order of eggplant tacos, and the guac.\n\nThe jackfruit tacos were the highlight of the night. I love me some pork, but I would gladly swap my carnitas for this forever (ok, maybe 80% of the time). If only other joints served jackfruit, there would be more vegans in the world.\n\nThe eggplant tacos were a-okay, a little difficult to eat honestly (maybe the eggplants need to be chopped into smaller pieces?) but they tasted good. The guac wasn't anything special and I wish the tortillas came separately.\n\nOverall, I had a great experience at Chisme and I will definitely be coming back for the jackfruit tacos.\n\n-\n\nNow a couple of suggestions for the restaurant owner:\n\nPlease serve food on actual plates; there is no reason for food to be served on disposable plates when this is a sit-in restaurant. It's wasteful and SF is all about being ecofriendly. \n\nPlease allow for a mix and match type order for the tacos. I really wanted to try other flavors but the orders come with 2 tacos. The tacos are pretty expensive, so I think being more flexible about this would compensate for the price.\n\nI would suggest a better presentation for the guacamole and chips (definitely more chips). I think having real plates would solve that problem.\n\nThank you for opening up a vegan-friendly restaurant in my neighborhood!", "author": "Rafaella S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Savory tacos with home made mole that'll take your breath away. Delicious and every dish looks gorgeous when served ! The chips and guacamole are phenomenal! If you like a little kick to your guacamole, then add their house made spicy salsa to add that fire to your meal. If you love horchata like me, then I suggest getting the coconut horchata it's better than most home made ones at restaurants or at home. If you have room for dessert then get the churros....they have caramel in the inside and comes with cream! BEYOND AMAZING!!!!", "author": "Erica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "I'm not a vegetarian but if you are, I'd imagine you'll dig this spot.  Two friends and I recently dropped in after a round at Royale.  It's fast causal and really whimsically decorated.  I don't really get the honeybear with sombreros, but whatever--it's insta worthy.  \n\nThe girl who took our order was really sweet and patient as we asked a bunch of questions.  She says the steak tacos are by far the best sellers.  I decided to try the jack fruit tacos because I've been dying to try jack fruit--full disclosure, I asked to add queso.  They were AH-mazing.  I couldn't believe they were vegan (besides my cheese indiscretion)!\nAlso had the elotes which was equally amazing--the corn was perfectly cooked--it basically fell of the cobb.  I'd definitely order both again.  I'd skip the chips and guac--nothing special.", "author": "Olivia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "The service, space and food were really good, especially the elote. Slightly overpriced but what isn't in SF. The edible flowers were a nice touch but not needed because the food speaks for itself. Great spot in the neighborhood. Would totally recommend trying if you're looking for a new spot!", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "BOMB tacos and seriously bomb quesadillas. I had the steak tacos which were delicious- it had some type of amazing cheese which added a certain something. And the meat quesadillas are amazing. Owner is super cool, welcoming, open and loving. \nUpdate: GET THE PLANTAIN TACOS !!", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "Very friendly and professional service. We love the cheese quesadilla and fish tacos. Whatever we have, it always tastes fresh and delicious.", "author": "Zhao E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "I'm from San Diego, and this place has the best tacos I've ever had. My personal favorites are the chicken and eggplant.\n\nEverything here is tasty. The guacamole is fresh and delicious. They have 4 great beers rotating - which should not be understated, finding good food and beer under the same roof is something this neighborhood (and city) seriously lacks. \n\nThe staff/owners are the friendliest people and make you feel at home.\n\nDon't take my word for it, go find out for yourself :)", "author": "Patrik B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "This place is really good!  We loved the tacos, pinchilotes and guac. We will definitely be back when visiting SF.", "author": "Haldis V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Love this spot. It's fresh with quality ingredients. \nFor those that like heat, their house hot sauce is killer but flavorful.\n\n1. Vegetarian and vegan friendly\n\nPersonally not huge on the jackfruit but the eggplant tacos were amazing. Breaded eggplant with peanut mole. Recommending adding the guacamole on top.\n\nThe mashed potato bowl is delicious and comforting\n\nThe quesadilla is one of my favorites in the city. The tortilla is super light and flaky, just perfect!\n\n2. Beverages\n\nThere's a selection of wine and beer. For those who like strong ginger drinks, they have a great ginger tonic that packs a punch. \n\n3. Dessert\n\nHad the caramel churros with chocolate sauce and home made whipped cream. Definitely worth saving room to have this.", "author": "Crystal F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Fantastic addition to the neighborhood! The Via Via plantain Taco is maybe the best taco I've ever eaten, very closely followed by the skirt steak taco! Shrimp taco was very very spicy, perhaps a bit too hot for me, but still fantastic.\nHomemade hot sauce was very spicy and delicious, and went very well with the papa's rojas", "author": "Mike A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "I live less than a block away from Chisme and this has become my go to taco spot. I've tried a number of them and they are all unique, gorgeous, and delicious. \n\n-Chicken demi da: my go to taco with yummy mole and shredded chicken\n-Shrimp: love the mango salsa they use, with a generous amount of shrimp\n-Mahi: tropical with coconut and pineapple, good piece of fish in each taco. \n-Jackfruit: I've never had jackfruit before and it was a very unique taste that I was not use to. I prefer the meat tacos, but my vegan friends thought this was incredible \n-Via Via- You can't ever go wrong with fried plantain\n\nTheir guac was good, but nothing out of the ordinary. I love their spicy homemade salsa- but be warned- it's very spicy. Pinchelotes was a little expensive but covered in cheesy goodness. Cauliflower ceviche I would skip- not very flavorful. I haven't tried any of the desserts, but will make a point to leave some room next time!", "author": "Peggy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "Impressive restaurant.  The tacos I had were great but I am in love with the quesadilla.  A bit cheaper than the tacos but I think it is incredible.  Between the chicken and plantain one I'm sticking with this.  The salsas are great as well.  Nice little surprise that doesn't dig a hole in your pocket and exceeds expectations.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Pleasantly surprised as I pick the place off of going through the pictures. We got here we're still skeptical but the menu was pulling us through the door. They have great vegan options and the food is out of this world!  Great mix of all locals hanging out grabbing fantastic tacos and Sangriale's. Definitely check out this Mexican joint", "author": "Erik W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "Yummy tacos! Definitely priced high but never had a bad meal. Have sampled most of the tacos and all are great. Love the chips and guacamole too!", "author": "Sam E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Wow!! I cannot say enough good things about this place (for both eat in and take out). The options for vegetarians and vegans are plentiful and delicious! The jackfruit tacos are my favorite, but come often and try all their different kinds! The two tacos are only $8 and are extremely filling. My boyfriend also loves the steak and chicken tacos.\n\nThe staff is very friendly, beers on tap are from the local Barebottle Brewery, clean, nice modern restaurant and good location! I've made my third trip in three weeks and don't see myself stopping anytime soon. Come check this neighborhood spot out, you will not regret it!", "author": "Mia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "This place is probably my favorite Mexican restaurant in USA, very authentic. I'm half Mexican and when we are talking about MEXICAN TASTING, I am very picky (just because I love Mexican food) I will say that the mole sauce is pretty much as amazing as the one my grandma made, Shrimp Tacos with the Mango salsa, mole and queso fresco is definitely my favorite, The Via Via (vegan) or Plantain Tacos is my second favorite choice, with the coconut ranch sooo good! They also have an amazing vegan cauliflower ceviche, a super tasty poblano mashed potato, the poblano pepper (not spicy) totally make it very unique. And of course the  \"Pinchelotes\" makes me feel like if I'm in Mexico City, They also have Churrossss con salsa de Chocolate caliente so yummy, plus they always have great spanish music , the service is very friendly and kind. Go try Chisme!!!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Instantly obsessed with this place! I got the chicken mole tacos and my date got the skrrrt steak tacos. We also got a side of chips and salsa. The spices and sauces were to die for, the mango salsa so fresh and delicious. I noticed, too, that the tortillas were quite fresh - something I haven't really observed at other Mexican places in the past but stood out to me here.\n\nFor dessert we opted for the churro which is served with a side of fresh whipped cream. Again we were not disappointed - my partner remarked it was the best churro he's ever had, even having spent a lot of time in Mexico City.\n\nStaff was very friendly and we got to chat with the owner. We love having new places like this pop up in our transitional neighborhood and Chisme is a welcome addition to the area.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "Great tacos in a casual setting! Nothing bad to say about this place. The shrimp tacos were beautiful and flavorful, and two tacos was a perfect portion for me (granted I don't have a big appetite). My SO got the corn and LOVED it, and my friends who got the churros were very happy with their choice. While it's a little on the pricey side, it's definitely on par with other gourmet taco places (and their tacos are more inventive than most others I've seen). Will be back for sure!", "author": "Megan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "Okay...  Not going to lie this place is SUPER LEGIT!  I had a friend tell me about this place and suggest I go.  So I did just that since it wasn't terribly far from my office.  It's a little hidden spot that kinda hides within the storefront along the sidewalk.\n\nAtmosphere: \n\nUpon going in I was immediately immersed with the tantalizing smells and ambiance.  The music was great, not being too loud or to low as well.  I love how clean everything is as well and everything from the menu to tables were very well put together.  \n\nFood/Drink:\n\nNow let's get to the nitty gritty and down dirty with the yum yums...  So typically for the most part I feel Mexican food isn't something that can be improved on very much, but I am not sure what the hell they are doing back there in the kitchen but I think I would equate it to sorcery.  The food was so good, I cannot really say what in particular as to what I all ate because the group I was with literally got everything on the menu.  I am not a huge fan of vegetarian or vegan dishes(pretty sure I was a Tyrannosaurus rex in my past life) but it was fricken delish!  That is definitely something that I am going to remember for sure.  Their drink choices are on point too, though I didn't have any of the horchata, as I opted for the beer(don't judge me).  The have some great choices on that front also but I went for the IPA and I can say I was very pleased with tastiness that ensued.  \n\nOverview:\n\nIf you have not gone or you are thinking about it...  you need to fix that in your life...  Like NOW!\n\nJust go, I am extremely sure you will be coming back to my review to tell me it was \"helpful\", because I know I am right on this...  it's just science.\n\nCheers,\n\n-Togyl", "author": "Adam K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "After months of lurking around Chisme I decided to hear what their gossip was all about. Luis at the cashier desk was awesome and exiting that I ordered A bit of todo. Their tacos are so savory and the food presentation is beautiful. Also if you have room for more Chisme than try their Churros and Elote; they are BOMB.COM!", "author": "Gardenia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "This place has great vegan and vegetarian options. We ordered the jackfruit, eggplant, and plantain tacos. The jackfruit and eggplant are breaded and fried. We also tried the papas rojas (which were just ok) and the churros (yum!). \n\nThe ambiance is nice, but they had the same eight Selena songs on rotation while we were there. A suggestion to mix it up: get some Luis Miguel and Marc Anthony in there!", "author": "Jenn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Soul good! I love their shrimp tacos with the peanut mole, mango salsa, purple cabbage, queso, and cilantro. Oh myy goOdness! And their hot sauce with it is absolutely delicious. I could eat 5. Yumm. I love how they use El Milagro chips, from Chicago. They are the best chips hands down! The owner is from Chicago, which is cool, because I am too. Can't wait to show my parents when they visit! I tell everyone about this place! Their guac and chips are a great size, and the plantain taco is so good too!", "author": "Alexis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "Dear Chisme. I'm giving you 4 stars only because your Jackfruit tacos were really tasty. I'll admit. But please please please let us mix and match tacos. I would have loved to try your steak taco also. Truly. It looked so tasty. Unfortunately, I'll never know.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-14", "description": "Interesting menu items but ultimately just too puny for the price. This place has a limited fixed menu offers far smaller portions than comparable places in the city. All\nTaco orders are 2 tacos. NO MIX AND MATCH. Chicken tacos should be $8 and shrimp $10, not 10/12 respectively. The food is TINY, albeit quite tasty. I want to be nice but also want to simply say \"get over yourself, it's tacos\" I use this place when I'm in a pinch for food due to its proximity to my apt but I'd much rather a well made traditional taco at the multitude of other places in SF that make great, authentic taqueria fare for half the price.", "author": "Thomas K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "Tbh their churros alone are 5 stars! If you come here, you should definitely try them. Everything else we tried was good but not great. The tacos had way too many slimy onions, and the sauce was not mole sauce. It was just a dark red sauce. Their papas rojas were good but I could only eat a few before getting overwhelmed by them. We did really like their poblano potato bowl and some green salsa they gave us on the side. Overall I would only come back to have their churros for dessert, sooo good!", "author": "Daisy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Absolutely loved the Steak and Shrimp Tacos here....wow! \n\nI also loved the presentation of the Chips & Guac. Definitely recommend for a cute date night spot or even if you are on the run. Great part of a town and friendly staff.\n\nWill definitely be eating here again to try all their Veggie Tacos!", "author": "Kyle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "First time here and I had a wonderful experience! The ambience was really pleasant and the aesthetics was really pleasing. The little bears on the walls was super cute definitely instagram worthy. The presentation of each item on the menu was of high class also instagram worthy. Menu was easy to understand and gave a variety of options on tacos. \n\nThe food itself was outstanding, takes tacos to a new level. Tried all of the choices, even the vegan tacos and it did not disappoint. The jackfruit was different but In a good way definitely recommend the jackfruit for a new experience. From appetizers to desserts they were all satisfactory to the taste. They even have elote which makes my soul very happy. \n\nVery good upcoming place that has a lot of potential and delivers to a wide variety of foodies especially with choices for vegans. Definitely will come again with more friends of course. Now my go to spot in the city!!", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "I have finally found the BEST tacos in SF! I will admit I am a dramatic person but I am being reasonable here. Everything I had was delicious, well-seasoned and flavorful. I came out of here with a food baby and I wasn't mad about it!\n\nMy favorites on the menu were definitely the jackfruit tacos, the steak tacos, guac and chips, and OBVI the churros. They were so good I shed a tear of sheer joy... might have just been allergies but whatever. The churros were the bomb!!\n\nI definitely recommend coming here for chill vibes, great food and wonderful service! My new favorite taco spot!", "author": "Kaylen A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-03", "description": "This place has a lot of potential but menu needs refining.  They do not allow mixing and matching of tacos, and there are no tacos available ala carte.  The guacamole portions are small for the price and the shrimp tacos were very salty and heavy on the chipotle seasoning.", "author": "Sona P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "This place for one, is so cute inside ! The decor is so cute and the place is nice and clean :)) As for the food, AMAZING! The skirt steak tacos and quesadilla are delicious Everything I ordered from the starters to dessert was super yummy and I left with a full and happy tummy :)", "author": "Sophie. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "This is one of the best taco shops I've been to! The environment is very modern/hipster. The owner is soooo nice. I went with my group of friends and we almost tried everything on the menu. Get. The. Chips. They make it fresh in the restaurant. The steak and chicken tacos have so much flavor and they're so juicy. This is a new shop yet it's so much better than most taco shops? \n\nThe menu provides a vegan options which is super nice for people who are vegan. Each taco has a different taste so be sure to try it out with a group.\n\nFor dessert, we got FIVE orders of churros because they are SO delicious. They are caramel filled and comes with a fluffy whip cream. \n\nThis place is a MUST TRY restaurant. We will definitely be coming back. Good food, good service, good environment! I'm in.", "author": "Devina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "The food was interesting! Perfect for my family since we have a combination of meat eaters and vegans. Everything had a unique twist and the owner was beyond sweet! He made sure we left full! He gave many things on the house without question and made us feel like we were at a family table! Would deffff come back again!!!", "author": "Amnit P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Great place for a quick bite and tapas kinda stuff. We got chips and guac, churros, and some sangria in the afternoon and it was perfect for our group. I definitely want to come back to try their tacos at some point", "author": "Neel R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-10", "description": "Was so excited to try a new taco place! To start off positive, their hidden gem is the coconut horchata. Seriously it was so good! Next time I'm in the area I'll stop in just for that. Tip: If you're gonna try it, ask for less ice. \n\nNow for the food: guac was good, equivalent if not identical to Chipotle, papas rojas were too salty, though the concept is good (fried potatoes + ranch), and the tacos (I tried chicken and skirt steak) were just plain ole' bad. Too saucy/messy, the meat was gritty, and toppings got lost and overwhelmed by the saucyness of the tacos. I will say they have A LOT of vegetarian options here, especially taco options I didn't try, so if your a vegetarian maybe ignore my review and try this place out. I know from my veggie friends that taco places are always a challenge so kudos to Chisme for that. For the rest of you meat eaters, this is SF there's way better (and cheaper!) tacos just about anywhere else.", "author": "Gabriella M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Soooooo delicious!!!!!! The food here is amazing!!! Our favorites are the chicken quesadillas and pulled chicken tacos! Also, the guacamole is SOO good!!! We really enjoy coming here when we come to the city!", "author": "Angel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Tasty small taco plates, but healthy and affordable for the area. Good vegan and vegetarian options. Decent guacamole, but terribly hard and thick chips!", "author": "Andrew J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Food just keeps getting better. No idea why others said it was bland, I totally disagree (and I'm someone who adds salt and hot sauce to EVERYTHING). Looks like they lowered the prices, although I thought the prices were totally reasonable to start with. The staff is totally sweet and I love them all. Still a regular and I will continue to be!\n\nMy faves:\nChips & guac\nMashed potatoes \nShrimp tacos\nChicken tacos \nPlantain tacos\nBeef tacos", "author": "Stomparella J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "This place is a great choice for vegans. We had the ViaVia tacos which are stuffed with a fried plantain and black beans. Flavor bomb!! Also had the chips and cauliflower ceviche, which was really good -- sorta like coleslaw but healthier. Highly recommend and I will definitely be back!", "author": "Teri F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "Oh, my!\nPlantain tacos are the best! Who knew?\nWas excited about the potatoes, they didn't turn out to be as flavorful as I hoped, but TACOS! Best ever.\nSuper fresh, yummy, tasty, flavorful and filling.\nCan't wait to go back!!", "author": "Daria L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "Such a cute place and the colorful storefront definitely caught my eye so I wanted to check it out.\n\nMaybe it was just this one incident, since there are such good reviews on this place, but I felt like the skirt steak tacos I ordered was a really bland. The steak was cooked well but I had to add at least 2 pinches of salt to each taco. The tacos definitely looked tasty, but I was a little surprised I had to add salt to taste, especially when I'm not one to add much salt to my food usually. \n\nThe website boasts \"affordable and contemporary Mexican-inspired cuisine,\" however, I wasn't impressed by my $8 guacamole and chips. There were only 14 chips intricately placed in the guacamole, which tasted very fresh. I just didn't see how 14 chips in guacamole with a flower in the middle served in a paper bowl served for here could be justified. They charged an extra $2.75 for extra chips as well. \n\nI'm hoping it was just a one time incident in regards to bland tacos. As far as price goes, I think the chips and guacamole were a little overpriced. At least offer more chips and present the chips and guacamole in actual porcelain/ceramic bowls if you're going to charge that much. I could purchase a whole bag of chips for the price of adding more chips to the 14-chips I received... \n\nRegardless, I do love that Chisme offers good vibes and a fresh take on Mexican food... The Counter seating by the window would definitely be a great spot to people watch. \n\nI'm a full supporter of all the restaurants popping up in our Tendernob neighborhood. Hence, I'm hoping this review would be seen more constructively so I could continue to show some love to the growing Tendernob family community of restaurants and bars.", "author": "Vivy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-03", "description": "Just spent a whole lot to get not so much :/\n\n$13 for two tiny steak tacos, stuffed into a small paper box, with tough meat.. ???\n\nI also should've listened to the previous review describing how bland the flavor was. Needed salt badly.\n\nTypical yuppie crap invading our city. Could get twice the food and have it actually taste good at a taco truck for five bucks. Avoid unless you have money to burn and don't care what your food tastes like.", "author": "James W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Ray and his tacos are amazing! Happened to walk by this place and popped in for a visit. So glad I did.\n\nI got the steak tacos and guacamole and chips. Both were delicious. It was hot, so the tea and the Horchata were both fantastic.\n\nStaff was super nice. It smells great in here!\n\nIf you are looking for a good meal and a great experience, I definitely recommend Chisme.", "author": "Jim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Living in San Diego for 6 years has really set a high taco bar for me. Everyone says \"oh go to Mission - it's like street food straight from Tijuana\" - not true. I have yet to find a taco place I can call SD worthy, until Chisme. Scene.\n\nMy co-workers and I wanted to grab a quick bite before our pottery off-site and we stumbled upon this place. Gluten free options, dairy free options? Yep - we all can eat here.\n\nSteak tacos: medium rare, well marinated and oh so juicy and tender. \nChips & Guac: you can definitely tell these chips are not store bought - they're thick with a non-preservative crunch, refills aplenty without judgement. Guac is as guac as guac can get - yummy.\nShrimp tacos: (coworker rated) finger licking good - didn't leave a trace on her plate\nMashed potatoes: (coworker rated) \"so full, but I'm going to finish these anyways\" totally worth overstuffing yourself for\nMagic Aqua: ok their free water doesn't just add a lemon or cucumber, they infuse berries and it's like drinking (healthy-ish) purple drank\n\nLast but not least - the service was amazing. Coworker accidentally forgot to mention no cheese on her tacos and said it under her breath as they brought hers out and without missing a step they made her new tacos and let us wolves fight for her cheesy tacos. \n\nI'll be back.", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Ahh this place is amazing! My friend and I shared the shrimp and steak tacos. The steak was good but my god the shrimp was phenomenal!! Would definitely recommend! The shrimp was cooked perfectly and everything on it was needed and complimented each other. As I picked each taco juice-y goodness spilled everywhere--not something you can be neat about. I came here yesterday for the first time and I can't wait to go back! \n\nWhile you're at it get the \"death via ginger\" drink hot. Pairs perfectly.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "I have already ate here twice! Finally Nob Hill has a restaurant that doesn't just serve taco truck style tacos. I ordered the steak tacos the first trip and the plantain the next time both times with guacamole, all colorful and delicious! Guacamole tasted very fresh and the food was all scratch made as expected. Try the coconut horchata or regret it! \n\nService was quick and the staff was very professional. My friends and I enjoyed the fun ambiance and we did not feel rushed even though there was a line out the door. The couple next to us had the elotes and said it was fantastic, definitely getting it next time. Open late is a huge plus!", "author": "Chris K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-21", "description": "I've been to Chisme 3 times. First, with my 3 homies who have lived in the city for many decades. Then with my dad, then with my homies again. Through these three visits, the food was consistent with the first visit. \n\nChisme has a nice atmosphere and the staff are very friendly. They feature - basically - tacos, a few side dishes like roast corn with cojita (mmmm!) and some small unique salads.  Textures are a major thing here. A taco may be piled with crispy pickled cabbage, a few deep fried bites, and liberally doused with piquant sauce. Mashed potatoes are gooey with cheeses. For me, the range of textures, the freshness and piquant spices really make this place. They encourage you to try their house made green salsa, which is citrusy and fresh, and tummy warming.\n\nRegarding drinks, they have a good selection of beer, wine, and some really tasty non-alchoholic bevs. \n\nit's nice to see rice and beans - the perfect protein - on the menu with their fresh mango salsa. However I was surprised at the low quality of the white rice served with this dish. White rice, ok fine, but the rice itself is not a fine grain of rice. It's mushy and just very different from the overall consistent quality they have in everything else.\n\nI'm not exactly certain what a Chicago style taco is. However the tortillas are thick and tasty. I wonder how sustainable it is to ship them across the country though, and would it make a difference in price if they made them locally? These are details, but new restaurants deserve feedback.\n\nSee you in the neighborhood Chisme!", "author": "Roxmarie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Nice cozy space with good music and friendly staff. Treat yourself to some jackfruit tacos and caramel churros to instantly make your day 500% better. No seriously!", "author": "Đào T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "We stumbled across Chisme on our quest to find a restaurant open in between lunch and dinner hours since we had just flown into town. The restaurant was mostly empty when we arrived so we received our food quickly even though it's cooked to order. \n\nI had the shrimp tacos and thought they were delicious. We also ordered the Flower Basket with crispy coconut kale and fried pink pickled cauliflower. We all agreed the kale was delicious but the cauliflower was just ok. \n\nWe were lucky enough to be there the first day Chisme offered homemade sangria and we were happy to partake. :) It was tasty without being overly sweet but a couple diners in our party thought it was a little light on the wine. \n\nThe staff was very friendly and attentive. I would give them 5 stars but I do think the price is just a little high for what you get. It was definitely delicious and worth trying!", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Mexican with a new touch. I took tacos with aubergine and was really good. Kind and quick. I definitely recommend it.", "author": "Andrea C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-05", "description": "I was very happy to have some new Mexican food in the neighborhood. Its a little pricey but it is delicious. The Jackfruit tacos are yum.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Best vegan tacos in the Bay Area. Get the Jackfruit or Via Via yum. Also a lot of the staff is Latinx, very important. Support this friendly, delicious establishment.", "author": "Dom R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Holy moly - walking home during YAHW (yet another heat wave) and a gal was outside handing out menus. SUCH. A cute spot, great ambiance. Foo was delicious. A friend and I split the began plantain tacos and the skirt steak with peanut molé. ZOMG. We'll be back!!", "author": "Arianna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Tacos executed to perfection! You can't go wrong with anything on the menu. We were a group of 5 and ordered all the tacos on the menu and were blown away by the flavors on each and every one of them. The jackfruit taco stood out among the vegetarian tacos. \n\nMust try and will come back again.", "author": "Vinay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "Don't you hate it when you're traveling somewhere, randomly just decide to stop in a place to grab a quick bite, and then have something so amazing that you're having craving for it when you don't live anywhere close to the place?That's what happened to me with Chisme's Jackfruit tacos. \n\nThis place is so cute. I love the artist Fnch so I was happy to find his little honey bears lined up like they were meeting me for lunch. My boyfriend and I split the Via Via and the Jackfruit tacos. If you are two vegan eaters, order just like that. Eat the Jackfruit tacos first (I still cannot believe how good they were), and end with the sweet plantain. \n\nOnly open for 5 weeks, this place is going to be around for awhile, they're food is just too good.", "author": "Jacklyn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Wow. Best vegan tacos I've ever had!! The jackfruit tacos are shredded/pulled and deep fried, oh my god :D crispy, savory, a little spicy, delicious! There are 2 other vegan taco options. I ordered takeout", "author": "Joe R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "I stopped in here when I was in town. The place is super cute and is decorated really nicely. I had no idea that it had just recently opened until the owner started chatting with me as I was in there eating - really awesome customer service! I had the chicken tacos and decided to treat myself to some churros since I noticed a few other people were also eating them. The food came out pretty quickly and the chicken tacos were super good, the presentation alone gets 5 stars because they looked too good to eat. The churros were even better, if that's possible. I truly don't think I've eaten such a delicious desert before, and that's not an exaggeration - everyone needs to order the churros!! The girls at the front were really nice and friendly, they answered any questions I had with no issues - which I appreciated. I'll be back for more tacos and definitely more churros if I'm ever back in town!! :)", "author": "Tara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "One of the best tacos and great service. Jackfruit tacos and cauliflower ceviche is a must!! Value for money", "author": "Pratiksha S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-19", "description": "Ordered pulled chicken taco, looked great but awful Mexican food, tasteless ..had to add so much lemon and hot sauce to make it edible. Quesadilla was better compared to taco, but in general not good Mexican food being in SF (which has so many great options). Good ambeince and service, giving 2 stars for it.", "author": "Praniti S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "Great place for locals and tourists! Food was fresh with unique presentation. I will be back every time in San Francisco! Owner Ray is delightful and passionate about guest service.", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Yessss! Go here for the chicken tacos with peanut mole. Service was incredibly friendly and fast. Food was fresh and delicious. A bit pricey for street-style tacos, but that's to be expected in SF. Edible flower garnish was a fun touch. Everything has a generous dusting of cilantro, so if you're one of those rare unfortunates who find it soapy, request your order without it.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "Where to start! Counter ordering so nice and casual. Food is amazing, customer service on point. \nHad jack fruit and fried plantain tacos, yummy!!", "author": "Chauntae M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-28", "description": "First and foremost the people that have taken our orders have been amazing and this review does not reflect the service or staff whatsoever. \n\nI think the problem I have with Chisme is perhaps the efficiency of the kitchen, speed of food deliver(chips and guacamole came out 15 minutes after our order was placed , when our mains arrived on a slow Monday evening)/prices on our meals on both visits have been insanely high, for that money I Could have eaten at Liho Liho across the street or 2x visits to any of the rest of the neighborhood taco places. \n\nI understand Brick and mortar prices when starting out, I've been a member of the service industry for 20 years, cook,expo, server, bar back, bartender, barista etc. but for a very small steak quesadilla $12 dollars is pretty bad. I was very excited for vegan options for my girlfriend since the usual is a veggie burrito minus some toppings at other places so when she sampled 2 different tacos on 2 visits and was left unimpressed it bummed me out. Also there are a lot of fried options for the vegan choices. It would be nice to see the jackfruit made like carnitas or pulled chicken as opposed to deep fried. Over all it just feels like I'm dining at an off the grid style food truck inside of a great store front. I think part of the menu needs a reinvigoration instead of the usual suspects you might see at so many \"hip\" Mexican takes on classic styled restaurants. \n\nI make vegan Mexican food all the time at home, family recipes and new ideas. I'd love to see some classics made vegan instead of what we ordered. We live in the neighborhood and would love to love this place, but $40 for one order of tacos, a quesadilla, 12 chips in a pile of guacamole and a horchata(fantastic) is not worth coming back unless some things change. It's sit down prices at a fast casual place. \n\nI would love to have my mind  changed but I think portion control, prices, and menu revamp would be needed.", "author": "Joe A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "We went, we ate , we drank.  6 girls, 6 orders of tacos, 5 beers, 3 sides   Fantastic flavors. Beautiful presentation.  Nice atmosphere. Very helpful and friendly service. Authentic mole. The menu has lots of items for all the meat eating folks and lots of items for vegan folks. \nMy favorites were the shrimp and plantain tacos, the poblano mash potatoes and some of the best guacamole I have had.", "author": "Catherine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Amazing food! Guacamole was delish! We had the chicken taco and the vegan/vegetarian taco which honestly was my fave and I'm not even a vegetarian.: coconut horchata.. fantastic! Great service and ambiance... just what the neighborhood needed!", "author": "Maggie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-16", "description": "With quite high expectations after i've read other Yelp-reviews I thought this taco would be increible so to say, but I was wrong. The taco was OK, but not more than that. I think you can find loads of tastier taco in town!", "author": "Frida Ö."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Cute decor and AMAZING tacos and food!!! The skirt steak taco was the bomb. You also have to try the PINCHElotes and the guac with pomegranate! So funny, so good!", "author": "Robyn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "So many vegan options that taste amazing (and I'm not vegan)! Really loved everything we had and will definitely be back to try the rest. Really loved the jack fruit tacos", "author": "Lee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "Ordered a large variety of different tacos and literally every single one was incredible. The staff is super nice and welcoming from the moment you walk in, great staff and amazing food.", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "This is the coolest new spot in our neighborhood! We are so excited to have a yummy, fun and vibrant  spot. All the food is on point!", "author": "Mariela C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "A top-notch taco joint and a great addition to the SF Mexican scene. Solid, creative take with some playful choices like the jackfruit taco. I've probably tried most of their tacos over a few visits - love everyone of them!", "author": "Srikanth N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Loved going into this vibrant and friendly place for lunch during work! Strange I know but the mashed potatoes are a MUST share. I always get the shrimp tacos it's perfectly seasoned and has a nice kick. I'm usually not into horchata but damn it's good here.", "author": "Sonya S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-06", "description": "This food is OK and completely overpriced. The beef tacos were super duper greasy. To the point it was dripping out of the taco. I couldn't believe how greasy they were. The last time I ordered the same tacos and they were cold. I thought maybe it was me cause I didn't eat fast enough. But no. Second time tacos we're barely warm. I am disappointed. Should have went somewhere else. Or maybe ordered something besides the steak skirt tacos.", "author": "Andrea N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Absolutely amazing place! Walked in and it was roomy and had plenty of seating. The sweet ladies at the counter had the best customer service and the kindest smiles (two things that I appreciate immensely!). The plantain tacos were insane. Mango salsa was fresh. My husband had the skirt steak tacos and loved them! Great choices for vegans and carnivores alike. What a gem!", "author": "Christeen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "I was so excited to discover this new restaurant! The half mile walk from work was totally worth it. The jackfruit tacos are AMAZING! Great flavor, texture & spice.\nI will be back to try the multiple vegan options on their menu. Yum!", "author": "Eva P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "Sooooo good!! Staff gets an A+++ !!! Nicest girls ever who really care and take pride in their work. Going above and beyond to make sure everyone is taken care of! The tacos may have taken 5-10 extra minutes than normal but well worth the wait! They were super busy too so it made sense. At least the staff was super friendly and attentive... which made the wait not bad at all. \nWe got the steak and chicken tacos.. A! \n(I would like two tortillas per taco) but I kno most \"city ppl\" would hate that  \nOverall great experience and trendy decorations! Super cute touch putting pretty pansies on the tacos(keeping it unique and classy) \nAND don't let me forget the CHURROS!!!! To dieeeee for. Oh my goodness. They are the best we have EVER had. Def a must have. Will forsure be back here shortly", "author": "Haley J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "I was very excited to try this place as I have passed it everyday since it opened. It did not disappoint! I got the Steak Taco's and Mashed Potatoes. The tacos were very flavorful and reminded me of being on the streets in Mexico. And the Mashed Potato creation was unique and yummy with layers of flavor. Can't wait to bring my friends to try this new SF Hit!", "author": "Kyle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "Oh man oh man!!!! Food was fantastic!!! I had two tacos, the via via and the skirt steak and both very wonderful. \n\nThe via via was this sweet, creamy, and ever so slightly spicy taco. HIT THE SPOT! The mango pico is what is up with the world.\n\nThe skirt steak was fresh, juicy, and perfectly marinated.\n\nPinchelotes (corn) was also really great.\n\nHAPPY BELLY.\n\nGreat beer selection and atmosphere. Super happy I stopped in here.", "author": "Ann M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "The tacos are nutritious, delicious and filling! Two orders and a side and you're good for a date night meal. The ingredients are fresh, the food is quick and perfectly cooked. The mahi mahi tacos were the best, hands down. \n\nOrdering the cauliflower ceviche, it was good (don't get me wrong) but the ingredients were simple and the idea of paying almost $10 for a bowl of raw cauliflower and spices was a little reality kick in the ass that you're paying San Francisco prices. \n\nGreat place though, they should be getting sangria and wine soon.", "author": "Cabaca T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Was in town for a few days and was looking for a good place to eat. Since it was Taco Tuesday we decided to try this place out. I did not think I would find a place that could match the quality of tacos at some of the places back home in Phoenix. Boy was I wrong! I had the steak tacos and my wife had the shrimp. Both were fantastic! My son had the quesadilla and he loved it. We also shared the pinchelotes which were probably my favorite.The cashier who may have been the owner was very nice as well. Would come back if I ever am in the area again!", "author": "Michael K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-25", "description": "I came here with a group of vegetarians and we ordered the following\n\n- mahi mahi tacos (for me the only non veg person): 3.5/5\n\n- plantain tacos: 2/5 not enough flavor. Flavors didn't make sense together. I've had delicious plantain tacos with black beans, cilantro and hot sauce. These just didn't land.\n\n- eggplant tacos: 3/5 the fried eggplant was good, tacos were again seriously lacking in flavor (and salt)\n\n- cauliflower ceviche: 1/5 this item is 99% branding. It's literally raw riced cauliflower in lime juice. Not good.\n\n- death via ginger: 2/5 way too sweet to be \"medicinal\" as claimed on the menu\n\nI had really high hopes for this place, but the food was not good and the service was also a 2/5. Would not reccommend.", "author": "Somya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Tacos are phenom but look out for the yellow sauce that comes with them, it's so spicy that I almost threw up haha. (I hate spicy food.) \n\nThe mashed potatoes are an absolute most-order. They're not good for you but they're so delicious that I've gone back twice for them.", "author": "Anthony J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Great tacos. Really good vegi options. Awesome service. Fast. Good beer. All round winner.", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "I want to really like this place. But it was a three star experience. I like the decor, the staff seemed friendly, I believe I met the owner and she seemed interesting, and most importantly, I loved the concept of the menu...but, I felt a little let down by the \"casual cantina\" it represents itself as. The menu is priced for a minimum of $20 per person to have a meal. It is hard to walk out of there satisfied for less. The most filling item is a $12 quesadilla, but I still wanted more. And it took almost 20 minutes to get. Great place to eat, have drinks and share a meal with friends. Not so great for stopping in for a quick reasonably priced meal.  But all the cute plates did look yummy. Quesadilla was tasty, but not $12 tasty. The safest part is that I'm a taco fiend. I LOVE tacos. But I would've had to have spent $20 to be satisfied with a taco meal there. You get two tacos for $12, basically forcing you into ordering more. The tacos options looked really good.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "Good food not great, just a bit overpriced. I paid $5 for a Coconut Milk Horchata which was okay nothing amazing it came in like a 12 ounce plastic cup, and I was not offered a free refill:( .... The tacos I ordered were really good though, I got the plantain black bean veggie tacos and they were a 9 out of ten.  The Cauliflower Ceviche was good, it had a coconut flavor, tastes tropical I would rate the Ceviche a 6 out of ten. The food is good, the taco shop order at the counter concept combined with the prices could use some work....", "author": "Angel F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "AMAZINGGGGGG. Best tacos I've ever had. Go try this awesome place! House drinks are bomb too :)", "author": "Angelica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "This place is great! Went last Friday and ordered the shrimp tacos, which were delicious. My BF orders the steak and couldn't say enough good things about them also. We would definite go back!", "author": "Ashley N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Hot girls work here. And they are so sweet too. And the food is AMAZING. And the vibe is amazing. I love this place and can't wait to come back!", "author": "CeeCee Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "I love this place. It's cute on the inside and the food is really solid. They have great vegetarian and vegan options. The only thing is I wish their fried vegetarian options were also gluten free. I'm dying to try the jackfruit tacos, but I will die if I do. Can't have it all, I guess. Be sure to try the mashed potatoes. And the guac is next level.", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "A friend of mine posted a picture of her tacos with the flower on it and that's really why I even came Chisme, what can i say i love those instagram aesthetics~~~ \n\nI figured Chisme would be another what I call \"gringo\" cantina, but to my surprise it was far from basic. I had the \"Chicken Demi Da\" minus the onions. 6/5 would highly recommend!", "author": "Viviana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "This review is for the vegan options. The jackfruit taco was outstanding. Deep-fried (?) jackfruit gave it a crispiness I've never seen before. The texture worked really well. The eggplant was interesting, but I probably won't order it again. I didn't love the other vegan one (black beans and plantains) because it tasted like a Caribbean plate in taco form, which is to say, it was tasty but not what I want in a taco. I didn't love the horchata but my bf loved it. It tasted like coconut milk with cinnamon... which again, is fine, but not what I want when i order horchata. (The coconut ranch also tasted very strongly of coconut, didn't love that.) I wish you could order one taco instead of two, but I think that would draw more attention to the ridiculous price per taco. But it's a fancy taco and a tasty taco, so I'll pay the extra for that jackfruit. Anyway, the staff was friendly, the green hot sauce was delicious, and the jackfruit taco was so good.", "author": "Megan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "The food here is good but not as down and dirty the way I like Mexican food to be as the food is more refined. The wait staff are very friendly and kind and that goes a long way.", "author": "N A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "This place is hot! Cute new little place in the tendernob. Love the ambience and the food here is banging! Yummy tacos and everything is presented so nicely. And a great selection of beer and sangria.", "author": "Bernadette B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "I cannot get enough of this place.  It's dangerously close to my apartment and I've started limiting myself to once a week here.  If not, I'd end up living here. I have yet to order something that wasn't amazing.  From atmosphere, employees, to plating and TASTE- this place is legit. My favorite are the shrimp or mahi tacos and the churros- OMG!!!!", "author": "Aubany G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "The jack fruit tacos were so good! I am craving for them right now!\nsuch good food and friendly service!", "author": "Raja K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "Get the vegan, jack fruit tacos. Mouth watering delicious!! Nice decor. Friendly staff. A welcome addition to the Nob Hill Neighborhood.", "author": "Annmarie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Chisme is an outstanding addition to the neighborhood. The mahi mahi tacos are some of the best fish tacos money can buy and the shrimp tacos are no joke either. The churros are delicious and decadent. Fantastic beer selection from San Francisco's own Barebottle Brewery, and the people behind the counter are always friendly.", "author": "Troy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-02", "description": "The tacos are fine, slightly upscale California style, not authentic Mexican. 4 tacos and 2 horchata for $40 is insane... just absolutely ridiculous. I've had way better for under $10. It was very late and I was desperate. There was nothing wrong with them except the price, but nothing special either. I really don't understand all the great reviews.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "This place has the absolute best tacos, quesadillas, and CHURROS in downtown SF. The steak quesadilla with plantains is insanely good, but it also has plenty of great vegetarian options. Love this place!", "author": "Zavier A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Came here around dinner time with a group of friends. The tacos are all so flavorful and the chips are super fresh. The shrimp tacos are a MUST have. The service was amazing and the churros were perfect", "author": "Eric P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Amazing first experience. Tried most of the tacos and each one did not disappoint. Varies flavors from each taco and very distinct too. The chips they had are freshly made by hand as well and very crisp. Their house sauce is lemony with a kick of spicy and goes very well with the chips. I'm not a dessert person but their caramel churros are to die for, and it came with whip cream. 10/10 would recommend.", "author": "Richard P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "This place will elevate your taste for tacos. Come here to explore new tastes on your palette. The service is amazing, and the decor on the food is superb, and the ambience is very casual. Will definitely be back!", "author": "Edward L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "AMAZING FOOD. I dream about it nightly (no exaggeration). The service was incredible, great atmosphere. If you're looking for a solid place for tacos and guacamole, you found it.", "author": "Leondra Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "This place is AMAZING! They just opened in lower nob hill a couple days ago and there's seriously nothing like this in SF! \n\nI was drawn in by the super cute Fnnch mural and decided to stop by on opening day to try out the tacos. They have 6 total on the menu and three of them are vegan friendly. Amazing. My favorite by far were the shrimp tacos. They're served on corn tortillas (the owner says they're from El Milagro in Chicago!) with huge sautéed shrimp, purple cabbage, the most delicious mango salsa, and a drizzle of their house peanut mole. \n\nThe menu is super fresh and most items are vegan friendly which is a much needed addition to the San Fran taco scene. For the guac and chips they give you the option of adding in pomegranate or mango to it for a small extra charge. Do it. Totally worth it! \n\nFrom the delicious fairly-priced food, to the adorable interior, this place is definitely worth trying out!", "author": "Tori M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "This place is cute and good. When you walk in, it's easy to think it's just for a quick bite, but actually the food portions are hearty and it's cozy to sit at one of the tables. If you want a fast meal you can get that here, but it's also a good place to hang out for a while. It's comfortable whether you're dining solo or with a group. Steak tacos are yummy - the peanut mole is very flavorful. And they make really fresh, flavorful salsas here too. Lots of great beers on tap. Even though you order at the counter and then take a seat to wait for your food to be brought out, they are super nice here. Feel free to ask for more salsa or to try any of the beers before deciding what you want. They want you to enjoy what you order and come back again. And this formula works!", "author": "Sonya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "GET THE STEAK QUESADILLA ! It was delicious, also the mole tacos are splendid loved it!", "author": "Rebecca F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "This is a great taco place. Its not your standard taco place, and thats one of the reasons I love it. The food is very fresh, and even more so, its definitely unique. There is a great atmosphere in the restaurant, its great for kids and groups.", "author": "Benin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "I had their steak tacos today, and was blown away by both the quality of the beef and the size of the portion. They were twelve bucks for two, so I wanted to see if it was worth it, and it totally was. I'm very excited to have high quality food just a block away, a great addition to my neighborhood.", "author": "andrew f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "By now I've pretty much tried everything on the menu. Even though I am a carnivore I can say I still enjoyed  the vegan and vegetarian options. The Via Via and the Chicken Demi Da were my two favorites. It's nice too see that they have recently adjusted their prices! I'm still not sure why people are comparing this too a taco truck when clearly it's a taco building. I liked the atmosphere in the restaurant. I didn't feel rushed eating my food. Most of the restaurant was instagramable. The honey bears are a nice touch! I've had similar style tacos in Chicago so believe it or not thats a thing. I'll be back here soon.", "author": "Greg C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-31", "description": "Can't mix and match tacos. Tacos are pretty average, not mind blowing. Probably wouldn't come back here.", "author": "Tina J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "This is a great addition to the TenderNob/Lower Nob Hill neighborhood which has Yelp favorites such as Liholiho Yacht Club, Mr. Holmes Bakeshop, Mensho Tokyo and Elephant Sushi. It's Mexican fushion is a fresh alternative from your neighborhood tacqueria. It has vegan options as well for health conscious and guilt free eaters. The place is spacious and colorful, a great place to wind down at the end of the day.", "author": "Raymond V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "New place...super legit tacos...solid local microbrews on tap...friendly staff. New neighborhood staple", "author": "Brett N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Being from San Diego, I've eaten a lot of tacos. These are without a doubt some of the best I've ever had. I literally eat here several times a week, and the friends I've brought here all feel the same. Not to mention the staff is awesome.", "author": "andrew c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Cauliflower Ceviche was amazing. Excited to try more things on the menu. Cute atmosphere.", "author": "Dominique G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Great addition to the neighborhood. Their tacos are damn good--I recommend the shrimp and vegan jackfruit tacos. Definitely coming back!", "author": "Laura U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "This place has the best tacos! We had the chicken and the jackfruit tacos. They were both delicious and full of flavor. I also had the death via ginger drink and it was amazing! So glad this is in our neighborhood. We'll definitely be back!", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "Absolutely delicious! I always get the shrimp tacos, my husband gets the steak. Whatever sauce they use is absolutely incredible. Super tasty with a spicy kick. Get the churros for dessert! Customer service is superb. We'll be back a million more times.", "author": "Kayla N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "The shrimp tacos...mmmmmm...I was a bit hesitant to try this place since it's new and might need to work out service kinks. Beer was so reasonably priced and again, those shrimp tacos...", "author": "Sean W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "High points: Ginger, lime, and mint tea.  Shrimp tacos.  Chips.  Hostess.  \n\nNot-so-high points:  Too heavy handed on the mole sauce.  It is a good sauce, just too much of it.  This is the first mole that I actually liked, though.  So I got that going for me.\n\nThe guacamole is good, too, but I prefer mine with onion and tomato mixed in.  Chisme's guac is made fresh with avocado, cilantro, lime, and salt.  Simple, clean, and tasty, but I miss the onion and tomato.", "author": "Alex F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "I stopped in for a quick bite with a friend of mine on Halloween night. The two staff that were at the front of the store were genuinely kind and had no problem giving me recommendations. I am a vegetarianan and they had plenty of options for me. I tried a couple different tacos and I liked everything I had, but i highly recommend the jackfruit one!", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "Excellent food and amazing staff. It's like a down played gourmet Mexican taqueria. The ambiamce is inviting and laid back but the food is high end. Good beer prices and they're open late too!", "author": "Tommy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "I have been going to Chisme for about a month and I must say this place is great. Good food and hospitality are the essentials for me to come back to a restaurant and Chisme got it. Recommended to anyone who lives in the neighborhood to make it your go to spot.", "author": "Guled M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "World class. Great food and great service. We went here twice during our 3 day stay. Both times everything was stellar. The second time, we ordered steak tacos but the girl that took the ordered accidentally put in chicken. When we pointed this out, she kindly said sorry and said she'll arrange steak, she did this without charging us the difference. Then, when the food arrived, we had not realized that one pair of the tacos has a peanut mole on it, and did not ask for it to be removed when we ordered. This was not a problem but the girl just left the peanut one and brought a second pair without peanuts to no extra charge. \n\nJust an example and it was this great overall. Go there.", "author": "Joel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "My friend Emilie and I came in to Chisme, late night, the other day. We live in the neighborhood and have been waiting for somewhere like this to open up so close to home! Ray, the owner, was so welcoming and awesome! The customer service we received gets 5 stars alone. On top of that, everything we had was amazing as well. My favorite thing we had was a toss between the Pinchelote and Flower Basket!!! Need to go back asap for these bomb dishes!!!!", "author": "Ambz C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "Best Tacos in Nob Hill! Lots of options and delicious House-made habanero hot sauce. Definitely gonna be my regular spot.", "author": "Austin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Omg soooo good. This place is nice, clean , great food and great service. Keep it up.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "This super cute place just opened around the corner from me and I've been 3 times in the past month. It's fast casual (but with a delicious beer and wine selection from Bare Bottle - try the Cascade IPA if they have it), affordable, and absolutely delicious (though I haven't strayed from the chips and guac and steak tacos since I legit crave them). Across from liholiho too as a yummy backup if you can't get in. Hope they stay in the neighborhood for a good long while!", "author": "Carolyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "This place is amazing! I'm from Austin where pretty much all Mexican food is the bomb, and this is the first place in SF that compares with its authenticity and interesting flavor combinations. I had the steak tacos which were phenomenal. One of the owners graciously offered to let my friends and I try some new menu items being worked on and I can promise that there are even more good things to come!", "author": "Allison O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "This place is amazing.  My husband and I are vegan and have tried nearly every vegan option in the Bay Area and Chisme's vegan entrees are the tastiest by far.  Their understanding and balance of flavors is very impressive!", "author": "Ares B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Fantastic new taco spot with high quality ingredients and $5 beers. Make sure you try the churros, they're insane.", "author": "Grady J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "The most filling and tasty eggplant Tacos I've ever had. An amazing vegetarian option in a sunny Lower Nob Hill neighborhood. I was surprised, exclaiming \"holy shit\" to myself. A great addition that is sure to grow with everyone living here.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Delicious tacos, great guacamole, and solid sangria. The ambiance is chill, prices are reasonable for the quality of food you're getting, and an overall wonderful experience. Definitely recommend stopping by for some beer and tacos.", "author": "Aly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "The tacos are really good and they have good beer on tap. You must get the churros and I'd recommend the guacamole as well. Really great spot for fast dinner.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "Great find on Yelp. Right amount of spicy in the food and good local beer. Personable service and attention a plus.", "author": "Franklin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "I tried Chisme out this past weekend. They have the best shrimp tacos and elote I've had in the city. The shrimp tacos come two per order, and I really appreciate the fact that they're sautéed rather than fried! I'll definitely be back!", "author": "Matt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "THIS PLACE IS THE BEST!!!!!!!!!!!! The food is so bomb!!!! The tacos are garnished with flowers \"QUE CUTE!!\" You will absolutely loveeeeee ittt my favorite new place in SAN FRAN!!!! Please get the chicken demida and the corn! :-D", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "We've had 3 of their tacos (chicken, jackfruit, and eggplant) and I thought they were all excellent! The mashed potato was the bomber (pbbly the best mash I've had) and the rice/beans side was also really good. \n\nMy only 2 gripes:\nAt $4.5-$6 (including tax) for EACH taco, it's pricey for what you get. A portion of 2 is not filling. I wish they'd have an option to do 3 for $10.\n\nSingle-use cups, bowls, and utensils drive me crazy. I know the owner said that they recycle and not having to do dishes saves water. But take into account what it takes to produce/transport those paper plates and plastic water cups (which are not recyclable or compostable) = not so convinced. Super Duper uses corn-based compostable utensils so maybe that's a good compromise? Just my 2 cents. \n\nRegardless, great creative tacos and menu. Vegan friendly. And a great neighborhood addition.", "author": "Barney S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "Food is DELICIOUS!!!! It would be 5 stars if the staff was a bit more on-it. Great addition to the neighborhood. Really chill, order at the counter, grab a seat, enjoy a beer or sangria. The guac is BOMB, churros are out of this world, every taco I tried was super flavorful. Definitely adding this to one of my \"regulars.\"", "author": "Colleen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Place had awesome food and delicious drinks.  The owner was super friendly and it was a great choice for some late night tacos.  Definitely would recommend coming here, their vegans tacos were super good despite me being a firm believer in eating delicious animals.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "Really enjoyed this place. Small manageable menu, and the owners will be taking care of you personally. One order of tacos comes with two 6-inch tacos, which is plenty. I went with a friend and we ordered two taco orders and shared. The steak and chicken were both delicious. You must order the churros!! They're amazing, never had better. Small drink selection (no margs, sad). But fantastic food.", "author": "Patrick s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "Great, deep, complex flavors in a tasty soft corn tortilla. Chips and quacamole are great additions. Highly recommend for a casual, quick dinner or reliable take-out option.", "author": "Adam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "Came here for a quick , inexpensive dinner and was not disappointed. Everything was super fresh and delicious! Got the chicken tacos and the vegan plantain tacos and they were both so so good. Friendly service and attentive.", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "Really delicious food and relaxed vibe. The jackfruit tacos were amazing. Honestly some of the best food I've had in SF. Would highly recommend.", "author": "Jimmy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "My wife and I were in San Francisco over the weekend and we stumbled upon here and grabbed some food. The decor is nice and modern and the ambiance is fast casual. The staff was friendly and attentive as well. The items I tried were the:\n\n1) steak tacos: these were tasty and I felt had a fair amount of steak in them. I know other people complained about the amount, but I didn't have that issue. The steak was also tender and not overly salted (I hate salty food). The peanut mole was something I enjoyed, even though I was hesitant at first. \n\n2) mashed potato bowl: these were my favorite item. Poblanos in mashed potatoes are delicious! I'm surprised this isn't more common. \n\n3) black bean and mango: I liked this a lot as well. Black beans and mangos, what's not to like?  \n\nMy wife also had the via via taco. I didn't get a chance to try it, but she loved it. \n\nAll in all, this was a positive experience for me and if I lived in the area I'd go back for sure since some of the other items I saw people eating looked good as well.", "author": "Sargon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-18", "description": "The food was delicious. We had a beef and a chicken quesadilla, chips & salsa, and two beers for $41. Personally I would have preferred my food on a real plate with real cutlery, not paper and plastic. The place was nice, clean, and airy, with big windows overlooking the street. The service was nice and friendly, and the food arrived quickly.", "author": "Jan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Love the vegan tacos, jackfruit tacos are AMAZING churros are next level, love this place so glad it's close", "author": "Kels K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Awesome service. Simple, but unique menu.  Passionate owner.  I highly recommend this restaurant. The atmosphere is laid back and fun.", "author": "Antonio R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Delicious tacos and great atmosphere! Was in town for a few nights and well I love tacos! I'd consider myself a taco expert (only because I eat too many tacos), and I loved each one. I had the chicken, skirt steak and shrimp tacos and all were great. Friendly staff too!", "author": "Mo D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "It's rare I take the time to write a positive review, but my taste buds are extremely happy right now and I just left this restaurant so I wanted to share! We had a small group of one vegan, one vegetarian, and two meat eaters, and everybody felt they had a great meal. We sampled several appetizers and probably 6 of the 8 or so types of tacos on the menu. The beer was really good as well and the chips were awesome and fresh. Others have posted complaints about the price of the tacos but you have to understand that these are not bean and cheese tacos, they are very fresh and flavorful, and still in my opinion a very good value for the money. The service was warm and the space felt good to be in.", "author": "Sonoma L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-02", "description": "I'm going to agree with vivy's review the tacos are bland. We had the shrimp and the chicken. We were hoping the hot sauce would pep things up but instead that too was bland. The sides have ridiculously small portions even without how expensive they are. The service was bad as well. Really slow and if you ask for anything they will fill the straws or something else before they help you even though there are only 4 customers.", "author": "Ellen F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-29", "description": "Updated review to add one more star for owners kind response : Pretty good food, over priced of course for what it is. Awesome decor and wild use of color. No tipping option on their square tablet payment machine. I can't  figure out why in the most expensive city in the country one would not always have a tipping option at a restaurant is absurd and makes us guests feel like you don't care about your staff which in turn makes me.not want to support you in my neighborhood. Now don't be rude with weird amounts please....15% ,18%,20% is acceptable. You also have no happy hour pricing at all. I walk by every day and I see the place empty. Just a couple ideas to fix this before you go belly up and start blaming  the neighborhood. There are many in the direct neighborhood who don't have kitchens but I keep walking by every day because of these few easy fixes. A frequent diner program would be cool too. Like 2 free tacos after 10 meals, I mean who cares taco cost is cheap and it promotes repeat biz. You have to cater to the direct neighborhood as well as trying to get tourists up this far. 30 years in the business here....man I wish I could run that place for a month! One can dream...", "author": "Scarlet M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "Came here for lunch on a weekday and loved everything I tried! The ambiance is fun with South American art pieces. I tried their eggplant tacos, shrimp tacos and the flower basket. All three were fantastically delicious. Sweet people to sweeten the deal.", "author": "Jake M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Jackfruit tacos, homemade coconut horchata, delicious sides and plantain chimichangas for dessert?! Couldn't have wished for a better place to open up close to home! Also Michelle who runs the restaurant is super sweet!", "author": "Fsa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Came in for a quick bite. Awesome tacos. Had the shrimp and it was delish. Great friendly service as well. I'II def be back.", "author": "Christian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "THIS PLACE IS EPIC. The food is out-of-this-world amazing--especially the jackfruit tacos, which are gorgeous gifts from God herself. Read: INCREDIBLE vegan options. Plus, the staff are welcoming and kind, and the venue is innovative and awesome. GO TO CHISME. It will change your life!", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-07", "description": "I tried the chicken tacos... it was okay but it has potential to be so much better. I loved the chicken meat, seasoned and cooked well. However, it lacked condiments. I needed some hot sauce and salsa verde but also more cilantro, more lime and less cheese. I personally love sour cream on a taco so that was great. I will give them another try as I'd like to try other items on the menu. A salsa bar is just the thing they need!", "author": "Tahmeena A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "We came here a couple months ago for my husband's bday and it was so satisfying! Great for us, being plant-based, and great for the kids and meeting their needs!", "author": "Emily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "Love Love love the jackfruit tacos! And the via via is great too. Being a vegan, this place offers great fresh food options that taste great. I definitely recommend giving it a try.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "Easily the best tacos in 94109 if not farther. The peanut mole is perfect. Can't pick a favorite between the steak, shrimp and chicken tacos. Great local beer on tap. Owner is kind.", "author": "Brooke M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-27", "description": "Good food, but for a taco restaurant?$17.95 for two tacos.... added a glass of wine and it was served in a plastic cup? Seriously? I'll go to the taco truck next time. Food was good but not worthy of the price", "author": "E L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Cool vibe and the staff were all very friendly and helpful. I got the cauliflower ceviche which was honestly kind of bland. I wouldn't get it again. The tacos I ordered however were AMAZING!", "author": "Stephany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "This little spot just opened across the street from us. My boyfriend eats there almost daily! The tacos are a little pricy but they are big and just the two and a salad or a side can really fill you up. My fav are the shrimp and the chicken tacos. The horchata was out of this world and they always have a new water infused with spinach or light fruits.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Our group of 6 visited Chisme for dinner and loved it! Shrimp tacos were awesome - flavorful, the right amount of spice, filling, and beautifully presented with a flower. My husband had steak tacos and also really liked them. We ordered chips and guacamole (with pomegranate seeds on top - great idea), cauliflower ceviche, and mashed potatoes as sides. The ceviche was good, but I would prefer it made the original way with fish or shellfish instead of cauliflower. Mashed potatoes were delicious. We tried both red and white sangria, both excellent. We were excited to find this new restaurant!", "author": "Meg H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Hostess was amazing. Food was delicious. Feeling full and happy. Will definitely come back.", "author": "Elle E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "The food and the service was amazing! Will come back for sure! Had the chicken tacos and shared some papas rojas. Next time I'll try the plantain tacos.", "author": "Juan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-03", "description": "I came here twice during the soft opening. So far the menu consists of 6 kinds of tacos, sides, and one dessert. They have a small selection of bottled beer and 3 on tap which are served in disposable plastic cups. The tacos and the sides are also served on disposable containers, so the place has a cafeteria/food truck kind of feel. I was pleasantly surprised to see that half of the taco choices are vegan and they're priced lower than the meat options. $8.25 for two veg tacos (two of the same kind, no mixing) seems reasonable, or at least no worse than anywhere else. And they were good enough that I probably would eat them again. However, most of the side items and some of the drinks are ridiculously overpriced. I tried the $8 pinchelotes which are two cuts of seasoned corn on skewers. The total amount is smaller than one ear of corn. It tasted okay but that would be an outrageous price for one ear of corn in any restaurant. The rest of the side items are similarly small and overpriced. There's more ridiculousness happening on the drinks menu. $7 for agua fresca?? That's for one plastic cup, not a pitcher. And $6 for horchata. And you can see the $9 dessert in the photos. There is no salsa bar but if you ask for it, you'll receive salsa verde.\n\nI might come back for tacos but I'm staying the hell away from everything else on the menu.", "author": "keith s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "The food was great! I was waiting for a tapas place to open up around here. The staff is nice and the atmosphere is very warming/inviting. My new favorite tacos place!", "author": "Rachel Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Ate there today while in the neighborhood visiting family. We live across town in the mission so we rarely cross Market.. However, I'm gonna come back, with friends! The Mole sauce was so delicious I had a hard time not licking the paper my taco was served on. The salad was also simple, yet unique, and having the option to add meat on top of it would be ideal (sorry vegans). Also, since I often judge a cantina by the quality of it's chips, I say AMEN to this place+ they give you more chips until you can't chip anymore. The Tacos have thicker tortillas and are truly filling! I ordered a few different ones like I have at other places near me because I'm use to the small bites nature of most tacos- nope! Could barely eat my second one because I was so full! Keep that in mind when looking at the price! Like others have said, the \"salsa\" is spicy! Amazing, but spicy, especially for the ill prepared. Prepare yourself.", "author": "Elle M."}
