{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "My favorite in the City! Succh an underrated low key place. Orders take a while longer than other taquerias because they make it fresh after you order. Worth it! \n\nWonderful:\n-al pastor tacos\n-shrimp burrito\nCarnitas burrito", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-05", "description": "This place is definitely better than Taqueria Gonzalez just down the street. I ordered 2 tacos- 1 carne asada and 1 al pastor. There weren't too many customers at 6:30 PM weekday dinner time so my order was prepared quickly. I was in and out in less than 10 minutes!\n\nMy tacos were set on top of thin wax paper before being enveloped in tin foil. I was surprised by all the juices from the meat! There was enough for some to leak out of the foil, so I had to unfold the foil on a plate to prevent a messy dinner. But hey, who doesn't like juicy meat? One thing to note is that they cook the meat, onions, and cilantro together. Most places just add it as a topping. \n\nFlavor wise, I enjoyed the tacos. Despite it being 3.40 per, they gave a lot of meat. I had two tacos and was full for dinner. The pastor had a bit more fat/tendons and the asada was on the leaner side (which I preferred). On the downside, I'm wasn't a huge fan of the corn tortilla, but that's just my preference. I daresay this place uses some MSG in their seasoning as well.\n\nOverall, I would return on a day I am craving tacos or perhaps to try their regular burrito. With how expensive these tacos are, it might be more worth to go with that route instead. Naturally, these tacos can't compare to tacos from LA, but it's enough to satisfy a craving!", "author": "Amber T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "I came here today at around 4:30 and it was pretty dead inside. I quickly scanned the menu and went for a super taco with steak which comes with cheese, guac, and sour cream for 5.30 instead of a regular taco for 3.50. If it was gonna cost me 5 dollars for a single taco, it have better be a really good taco. To my surprise, it was pretty huge. The meat, salsas, guac were all over the tortilla. The meat was tender and well seasoned. It also came with a bag of chips, which only had like less than 10 chips in there but it was absolutely the best chips I've had at a taqueria and it was well salted all over with a nice crisp. By the time I was done with my single taco, I was starting to get full. I felt that two would be just perfect to fill me up next time considering it was a pretty big taco. It may be a little bit on the pricy side, but the flavors are worth the extra buck!", "author": "Mandy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Steak & Shrimp Super Burrito: grande shrimp, good steak with no or very little chewy fat, 14 inch. long burrito, clean bathroom, and parking at Shells gasoline station next door.  A definite revisit for $16 with Jarritos soda!!!", "author": "Keegan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-16", "description": "I love this place, but today they suck! Ordered my super burrito but they gave me NO SALSA . It was pretty dry.", "author": "MissBlondie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-09", "description": "Good customer service and delicious food!! They always get my order right and deliver on the quality of food. I can say prices have gone up from when I first started eating here so that's the only drawback.", "author": "Jess G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "This review is for the steak and prawn burrito. \n\n\n\nSmaaaaaaaacking Bayyyybeee. This is the only thing I order from here and I swear it gets better every time. A little pricey but gawd is it full of flavor. Minus one star because they stingy as hell with the sauce. Burrito damn near $15.00 and you charging for sauce???", "author": "Chickmake I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Yum! Man, this is one of my favorite spots in the Portola. Their veggie burrito is on point, and the tacos are super good too. Everything I've tried tastes amazing. Honestly there are places you can go that would cost twice as much, and the food quality would be about the same. I like being able to eat a good meal for under $10 (which is getting harder and harder to find in the city). Cinco De Mayo has that small family operated feel that I like at a taqueria, great food, and very little wait time. No complaints from me; only smiles. Try their strawberry horchata!", "author": "Steve B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-23", "description": "I had to say something because usually I come to this place for sure burrito but I thought no meat today let's go veggie Friday and this little mini super Burrito that they gave me really pisses me off specially considering it was almost $11...Cinco has to do better especially for Once! At least it was a good lil mini burrito. I'll try again another day...", "author": "domenique c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-05", "description": "This place used to be ok years ago. However, it has been going down lately. I came in for 2 regular steak tacos with everything in it. Yes, When I said EVERYTHING, I really meant cilantro, salsa, and hot sauce in it. They also did NOT give me CHIPS and other hot sauces until I ASKED for it. It was not my first time eating Mexican food, so do not ever try to fool me. The cashier and the \"chef\" at this restaurants seem so lazy and not friendly at all.\n\nNOTE: I call her \"chef\" just to be nice. She is probably just a helper and she also seems very lazy.\n\nI would NEITHER come back here nor recommend people!!", "author": "Vicent N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-09", "description": "Horrible customer service don't even bother placing a phone order they get it wrong every time !", "author": "Misses H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-11", "description": "I'm not sure how this taqueria has good reviews. I come here when I'm in a rush because it's the closest taqueria to my house. The food is way overpriced! The carne asada is too salty and over seasoned so much so that it takes away the taste of the beans, rice , cheese and other condiments in your burrito. The so called called \"guacamole\" which has no sign of avocado, onions, tomatoes or whatever else goes in your guacamole. Instead they serve you a green watered down sauce that taste like the bottled sauces they sell at foodsco and they call it guacamole!  What a joke. Never coming here no matter how hungry or in a rush I am. Just throw the whole taqueria away", "author": "Adriana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "I've been here with my colleagues last Friday and I really liked this place. This is the very good food for that price. I took super burrito with chips and salad. They put a ton of meat in their burrito, so you can eat half of it and the other half you can eat later. If I will be in that area again I will definitely go there again.", "author": "Akim Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Hands down my favorite taqueria. I live in San Jose now but still travel all the way here for my burrito because I cant find any other place who has yet to be as good! I always order the steak and shrimp burrito. Quantity is usually always good they never really hold back on their portions. Always ask for the sauces especially the salsa verde. Employees have been changed around a lot lately but most of the time my burritos and tacos have been consistent. Please be aware it is really pricey, but if your looking for quality look no further! Owner is also friendly and usually works almost every day which is great for customers to see.", "author": "Tavana F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-24", "description": "I'm not sure why this has one $ rating, I use to always go here for Mexican food in the area, but they have gotten really bad. The burritos are not even all that anymore. I paid $14 for a freaking shrimp burrito, that was basic and small! I honestly wouldn't mind paying the cost if it was good. Not only did it cost so much but they are stingy with the pico de gallo that comes with chips. They gave me some hot dice kind and when I asked for the other one she wanted to charge me for that tiny cup, why even give chips!", "author": "Denise N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-18", "description": "I only went to these place because it's convenient but for the last few months I been going to the mission taquerias because it's better price and cuality.Yesterday I decided to give these place one more try I order a super burrito with no sour cream but they did not even put guacamole or cheese pay almost 12 for a very poor cuality burrito. I did not enjoy these burrito it was bad.These place it's over priced and the burritos are bad.Mission taquerias are thousand times better than these place.", "author": "Luis T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-28", "description": "We ordered a few burritos and few tacos. They are just ok but the price is a few bucks more.", "author": "Wil M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-25", "description": "13 dollars for a wet burrito. Insane.... I called and ordered it and asked multiple times how much it was gonna be and they replied the machine was acting up and they couldn't tell me over the phone. Also gave me the smallest bag of free chips. I asked for a few more because how much the burrito was and she gave me the biggest attitude and gave me like 3 more chips.", "author": "Brett R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-31", "description": "This place is alright. For what you get, especially considering the proximity to the outer mission, it's pretty standard fare. Standard prices with standard seasonings and salsas. The best of the tacos I had was Al Pastor, which is generally my favorite, but better pastor can be found a mile away. \n\nFriendly customer service and quick for take out but bag didn't come with any salsa or limes so make sure to check and have what you need before you dip!", "author": "Sean S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-24", "description": "I'm always looking for menudo. It's like a scavenger hunt for me even though there is a real art in making a good bowl of it. Mexico Tipico has figured it out with their luxuriant broth, still the best one in town if you ask me, and so few others have. It's worth the exploration though, which is why I found myself in Portola, a melting pot neighborhood that's quite foreign to me. San Bruno Avenue is bustling with local residents shopping and eating, so it took me a while to get to this cavernous place right off Silver Avenue. I heard the menudo here was very good. We'll see about that. Anyway, I ordered a bowl for $8.85 and was met with a certain amount of indifference.\n\nNot that I'm all that hypersensitive to standard etiquette, but I actually considered turning around and leaving when the server turned out to be a rather curt woman who appeared resistant to taking my order. I don't know if I came across as someone who fell off a turnip truck at the border because she cocked her eyebrow and asked me point blank if I knew what menudo was. Well, girlfriend, I've had more menudo than yo mama. Don't you sass me, Señora Thing. Anyhow, I got over it and ordered a quesadilla just to make her feel better and sat down at a table in the back. It's a huge space, and there was only one other customer as it looks like most people come in for takeout.\n\nThe menudo came with all the standard fixings (photo: http://bit.ly/1zwZkpr). Once I put in the onion and oregano, I thought it was pretty decent (photo: http://bit.ly/1wEx0iU). It still lacked the hearty, spicy broth I keep looking for, but it did have plenty of tendons and bones, not so much on the tripe itself. The $3.10 Flour Quesadilla was nothing more than cheese melted between two tortillas, but it made a nice accompaniment to the menudo (photo: http://bit.ly/1zwZBbS). That was plenty of food, but alas, the scavenger hunt continues. It was not the transcendent bowl of goodness that makes my knees quiver and my stomach gurgle in delight. I did, however, manage to blow Señora Thing a kiss on the way out much to her constipated consternation.\n\nFOOD - 3 stars...middling menudo is better than no menudo at all\nAMBIANCE - 3.5 stars...a big space does help with my digestion\nSERVICE - 1.5 stars...rudeness is not a virtue\nTOTAL - 3 stars...I'll overlook her cold stare and keep my rating in the middle", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "Food was on point. Very authentic to. Salsa was spicy. Strawberry juice was delicious", "author": "Brenda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-09", "description": "Wednesday, 11/2016 ~7:30 pm.\n\nOrdered a super carne asada burrito and a super shrimp quesadilla to go: total was ~$25 (~$10 for burrito, ~$13 for quesadilla + tax)\n\nFood came out quickly. Tasted good, nothing to complain about. I ordered the burrito and I loved how spicy it was. The ratio of ingredients was perfect and the little crispy bits of carne asada gave it a nice texture. Burrito was a solid weight too; they aren't skimping on fillings here. Best surprise was getting chips at the bottom of the bag!\n\nWould come back again if I am in the neighborhood and I'm craving Mexican food.", "author": "Vivian Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-06", "description": "we were craving for some  yummy tacos and nachos decided to order 6 chicken tacos and sauce on the side and chicken nachos with extra cheese $45.00 wtf? \nsurpising how much tacos cost theae days and you have to pay more for extra toppings things you want , used to be free on the sides where you choose what you want and pack it. \n\nchicken tacos were so bland and they didn't give much sauce when i paid for it. For the nachos they disn't put extra cheese when i paid for it either. They really need to taste their food before serving it and give free sauces !", "author": "Hoa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-25", "description": "Love the super steak burrito. My only complaint is that the guy at the register also bags up the free chips that you get with your order and I saw him not wash his hands or put on gloves after handling my transaction. Just palms the chips and puts them in the bag. That's pretty gross.", "author": "Mechelle M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-09", "description": "Wow. This place was terrible! We went out of our way to check this place out because it had good reviews, but I don't know what they were about because the food was BAD :(\n\nThe staff seemed genuinely bummed that customers (us) walked in at lunch time to their totally empty restaurant/ex-bodega which says to me that this place is getting ready to go under, but I digress.\n\nThe free chips were fine, but the salsas tasted old and not fresh. Definitely not made the same day. We all had burritos and I always order a couple various tacos for good measure when trying someplace new, but none of us even made it half way through the meal.\n\nThe guac was basically liquid avocado and everything just tasted old. This was one of the few times Yelp pointed me in the wrong direction.\nI'm half Mexican and I eat a LOT of Mexican food, so when I have some as truly disappointing as Cinco, I barely eat half of it and leave in search of an afternoon snack. \n\nThanks for nothing!", "author": "Michael T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "Amazing Burritos and tacos. Great neighborhood taqueria. Can't get enough of them tacos.", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-25", "description": "The burritos are average, but as it is convenient, I tend to order here from time to time. Yesterday, I ordered 2 burritos, and got my 4 year old a side of beans and a side of rice. These were $3.50 EACH!!!! $3.50 for a side of rice??!! That is the price of a whole bag of organic rice! Are you kidding me??!!", "author": "Tei G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "I come here all the time and order a super steak burrito w/ everything. It's never dry and always seasoned well! (Gotta hit an hour on the treadmill after eating one though lol) Chips come w/ your order, MAKE SURE TO ASK FOR SALSA - or they won't give you any!", "author": "Leetamz A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "Cinco de Mayo is an important day in history.  It's the day Cy Young threw a perfect game.  The day Ghandi got released from jail.  The last day Floyd Mayweather used the nickname \"Pretty Boy Floyd\" before becoming \"Money Mayweather\".  And a date in history where Mexicans beat up on the French, \" Au revoir pendejo Frenchies!\"\n\nBut another significant Cinco de Mayo is a taqueria on San Bruno.  I came yesterday around halftime of the 49ers/Bills game. They have a tv in back showing the game so I decided to eat there and have some chips and salsa.  Along with that we ordered:\n\nSuper Carne Asada Burrito:  what else is a guy on a Sunday afternoon while watching the Niner game going to order?  Tacos are too messy, plates require forks, so it only makes sense to order a huge, neatly wrapped burrito so I can eat without ever taking my eyes off the television.  That being said Cinco de Mayo makes a delicious, well proportioned meat to bean to rice ratio, along with sour cream, salsa, and avocado.  Easily this taqueria could get \"cinco\" stars for the burrito, but they are a tad bit pricey.\n\nSuper chicken taco: my wife ordered the taco.  Good sized, they don't skimp on ingredients.  Perfect for those who don't want to carb overload from a burrito.\n\nIt's a really large sized taqueria.  Minimal dealings with the people working there but they seemed nice.  \n\nOverall worthy of returning to again when in the San Bruno ave area.  Another Cinco de Mayo worth remembering or talking about..", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "I've been getting a burrito every week here since high school. Their chicken super burrito is my jam. Great salsas :)", "author": "Yvonne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "This place was awesome. The Carne Asada burrito was about $9.50, for the super burrito, but that thing was massive. Yes, that's what she said. Upon first opening the burrito wrapper, I noticed how fresh it seem to be. The first bite offered a succulent masterpiece of carne Asada, rice and pinto beans. The whole burrito was mixed very thoroughly so that every bite consisted of all the different ingredients. This place is very affordable, and offers very high standard food. Definitely recommend.", "author": "Zach A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-21", "description": "Some of us are always searching for the next best thing. Whether it's a hotter gf/bf or better paying position, we will never be satisfied. It's the nature of the beast. For me, I'm always searching for better lengua (albeit expensive, La Taqueria has the best in SF). I'll be honest though; nothing gets me more excited than being able to yelp yet another place. Pathetic, I know.\n\nI need to mention that I got food poisoning from Cinco de Mayo 10 years ago. I remember it like yesterday...I was helping with a retail store move when I threw up in front of 20+ people after having a burrito here for lunch. The slow-mo snapshot of everyone's face in horror will be forever ingrained in my head. Mortifying. Anyhow, given the overall 4 star rating, I decided to give Cinco de Mayo another shot but should have done a better job reading through the reviews. Everyone is entitled to their own opinion but I noticed several people mention that Cinco de Mayo has the best burrito they've ever had and it's also the first/only burrito they've ever had. Ironic much?\n\nI know I have been harsh in my recent taqueria reviews but Cinco de Mayo is deserving of no more than 2 stars for the following reasons:\n\n1. OVERPRICED\n$2.80 for a taco? $3.95 for a super taco? $9.90 for an el grande burrito? $13.70 for an el grande shrimp burrito? Are you f*cking insane? This is the ghettos (I grew up in this area) not Pac Heights or the Marina.\n\n2. NO SALSA BAR. \nNot a deal breaker but they don't even provide you with salsa in small plastic containers. WTF. \n\n3. RUDE CUSTOMER SERVICE\nI'm standing there waiting to order when the lady looks at me then the phone rings. She answers it and proceeds to take the order. I wait patiently until she's done and she looks at me again as if I'm bothering her.\n\nME: \"Do you happen to have wheat tortillas?\"\nLADY: \"No. Did you still want anything?\"\nME: *Woooooo Zaaaaaaaa*\n\nAnyhow, I ordered 3 lengua tacos which were sprinkled with raw onions, cilantro, and a dash of salsa verde. http://www.yelp.com/biz_photos/4MvdxbwpYK8Ci4DH-HQguA?select=fK14tlwxICjIsDUX69iYEg No lime, pico de gallo, or salsa rojo was provided. How can you not have these staples?\n\nThe lengua wasn't stewed long enough nor seasoned well enough making it bland and semi-chewy. The juices from the lengua caused the corn tortillas to fall and break apart upon picking up the taco making them inedible. http://www.yelp.com/biz_photos/4MvdxbwpYK8Ci4DH-HQguA?select=cyKLTMQ0iYPSzT-QY3YL-w \n\nCinco de Mayo is not horrible (does not compare to the taquerias in The Mission) but $9 for three tacos is a complete rip-off especially when a complimentary side of bitchassness is included with each order. NO GRACIAS!\n\nOTHER NOTES: \n*Meats available: carne asada (steak), pollo (chicken), carnitas (braised pork shoulder), al pastor (spit-roasted marinated pork), and lengua (beef tongue)\n*Burria (goat stew) and menudo (tripe soup) available on weekends \n*Closes early at 7 PM\n*Plenty of tables and seating \n*CC's accepted", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "This is my favorite Mexican restaurant. The food is real. Not canned. The place is light and spacious. The staff is always friendly. The portions are at good size. The jukebox is funny. It will start playing on its own.", "author": "Pks M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-07", "description": "2/6/2013:\n\nCinco De Mayo Taqueria is of my favorite restaurant to go to when I am craving for a burrito. Why? This place is 10 minutes from home and I can make a stop here for a burrito when I am hungry - EASY!! During my most recent visit, there were two guys working. One guy ran the cash register while the other one made the food. The guys working here are very friendly, this is one quality that makes all the difference for customer satisfaction.\n\nI came in for a bean and cheese burrito with rice and chicken in a moment of hunger. A bag of tortilla chips are included - props to that!\n\nMy mom, aunt and uncle tried the burritos from this place before. They liked it as well! I like coming here because of the efficient service, this is one quality that really makes a significant difference in customer service satisfaction. Overall, very good experiences here!\n\n12/4/2013:\n\nThe quesadilla suiza with steak and cheese is delicious. Nice friendly guys, efficient services and good food. Good restaurant to visit when for a burrito or quesadilla.\n\n1/26/2016:\n\nI tried the burrito and quesadilla before, also I have been meaning to try other items on the menu. This time I craved for tacos, I finally tried the tacos it was delicious and I liked it. Chicken tacos with chicken and cheese on corn tortillas are delicious. The guys preparing the food are super fast and the food is usually ready for pickup within 5 minutes. That is very fast!", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-29", "description": "... so I've been to this place a couple times to buy a burrito but today was a little but different. I ordered a burrito and told the cashier that I was going to dine in . I also , requested a GLASS OF WATER , but I was told by this girl at the cash register that she didn't have any. I was in shocked by what I had heard. I asked her to clarify what she meant by that and I was told that they didn't have cup ( seriously ? I'm mean, it can be any cup , since I was going to dine ) and she suggested that the Owner did not want their employees to give complementary water and that I should buy instead . Well , now you know what you're getting into when you go in there .", "author": "Sergio C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "This review is specifically for the Super Chicken Burrito, which is pretty much the reason why Cinco De Mayo is my favorite Mexican place of all time (not an exaggeration).  I discovered this place when I was a 7th grader and have been a life long fan ever since.  Ive had a lot of decent/good burritos in my life, but the one thing that sets this burrito apart from any other is how juicy it is.  The juice comes from the chicken, and whatever the eff they do to it when they put it on the grill.  But it blends perfectly with the liquidy guacamole, cheese, and sour cream to make this saucy awesomeness that moistens just about the entire burrito.  I have never found anything like it...most good burritos have high quality ingredients that taste good together, but definitely arent comparable to one that is, sort of \"blended\" together with said juice in the Cinco super chicken.\n\nI do have to say that the guacamole is not the best ive had, for sure.  Its, liquidy, not chunky.  But again, the overall burrito just works together on so many levels,  that I can't even say that I care.   Also wanted to point out that steak is my normal burrito meat of preference,  but the chicken in that burrito is so good, that I get it everytime.  An emphatic 5 stars indeed.", "author": "Frances L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-27", "description": "Just had the super carne asada quesadilla and it was a MESS. Juices everywhere! Scarfing my way down the quesadilla 1/4th way done and the quesadilla exploded around the halfway mark leaking the insanely flavorful juices everywhere, had to get a bowl to contain the mess. When you think quesadilla you would think it would be flat, but not in this case. This is more of a burrito size & shape.\n\nBeware, do NOT eat in it in your car if you ever get one :p", "author": "Hui L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "Maybe my standards for an SF/ California burito.  Maybe I'm just super picky?  I don't know.\n\nEither way Cinco De Mayo is o.k.  not bad. Not amazimg.  Just adequate.  I ordered a super veggie and it was rather bland.  Just semi like they are phoning it in here.  Eat at your own risk.", "author": "Augie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-07", "description": "Standard Mexican fare but on the bland end of the spectrum. Nothing to write home about.", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Great food. Spartan surroundings but definitely worth a visit.   I'd definitely go back.  Get the shrimp tacos!  They were awesome.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "Super burrito had no sour cream cost $9.00 super quesadilla $9.00 no sour cream the meat was good but the place was empty and customer service was not very good. Look at my quesadilla picture it was very disappointing, and for the prices I would expect a satisfying burrito. I say we drive about 0.5 miles to the next taqueria next time or stick to your usual favorite taqueria. Because clearly they don't care about your food.", "author": "Eli A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Tried Cinco Taco Bar tonight. Food was delicious. Staff was very friendly. We had the taco bowels. My wife had the chicken, I had the carne asada. Food was fresh", "author": "Karl S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "Loved this spot when I lived in the area. I would go chicken super burrito every time and it was bomb. I got to a point where I would walk in and the cook would start with my order right away. I barely had to wait here. Good people making good food.", "author": "Curtiss G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "The only taqueria I go to for my chicken and shrimp super burritos! If i can't drink the delicious juices out of my burrito, then it aint a real burrito! The price is ridiculous though but worth the juices lol", "author": "Tinai J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "This is by far the best taqueria in the area. Shrimp tacos are amazing and so is the al-pastor and carne asada. Maria, who is often at the counter, is very sweet and cares a lot about the customers. The staff over all is fantastic and speedy. I've been coming here for over a year now and I don't think I will ever stop. Also this app is terrible, the people who base their restaurant experiences on this app are terrible; you are all terrible. But this taqueria is amazing, please support them.", "author": "Deez S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "I've been coming here since the day it opened, I don't know back in 1999-2000 or so. Of course I think its the best. I moved away from that part of the city years ago, but would trek across town to get a super burrito or super nacho. The sizzling carne asada that's cooked on the spot is so tasty, as is the chicken too. Get anything, including a horchata to wash it all down. Check it out, the same family has been working it all these years, and I've watched everyone grown up and grow old there.", "author": "Raylan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-09", "description": "DO NOT PATRONIZE THIS PLACE- THEY RIP YOU OFF!!!\n\nSeriously I have given them more than one chance. No one is perfect I get it. BUT this time really threw me back on how they handle customer issues. \n\nThe food to begin with is average. Typical mexicano food. Inexpensive and is what it is. On several occasions  have ordered the super burrito with the guacamole and sour cream on the side, paid the price of a super but they were not included in my bag. Granted I should check before I leave, but at the same time as I am ordering this request they should be on top of it!\n\nToday was it. I ordered a super steak burrito- guacamole and sour cream on the side. The unfriendly girl at the counter asked me if I wanted inside. I said no on the side please. She repeated the question as to not understand me. I stated my request again and thought she got it this time. Few minutes later my burrito was up. After a long, hard day at work I just booked outta there with getting home to eat. I come home and feel in the bag there was no signs of my guac or sour cream. I thought \"maybe they put it inside instead\". I cut into it starving at this point and discovered I was charged for a super and got a sad regular. Not cool for this has happened before. \n\nI decided to call them to see what they would compensate since I paid for something I did not get. The girl answered the phone and I explained the situation and said I was already home. I explained this has happened before. I asked \"how will you compensate me?\" and SHE HUNG UP ON ME!!!!! I called back and said you hung up on me. She said come here and we make you another one. I stated I was not going back just to get my sides that should have been included. Rather than apologizing SHE HUNG UP ON ME AGAIN!!! I called the third time and spoke to her in Spanish. I asked for the owners name to which she replied she could not give his name out!!!!! WTF!!!??? This is NOT how you run a business!!!!!! I put my clothes on and headed there. \n\nI went in and it was busy. I asked the guy behind that counter who the owner was and that I wanted to return my food for my money back. He didn't even know what to say. He turned to this older gentleman who didnt give me his name as an owner, DID NOT apologize after I told him that the girl hung up on me twice. He went to the register that HE COULD NOT OPEN HIMSELF!!! Gave me the cash back and did not \nsay a peep. I told him that it was not the way to run a business nor would I be back. \n\nIt's a shame when you want to support your local businesses and they fail to recognize that their neighbors are the ones who are helping them achieve a successful business!!!! Bite me Cinco de funko!!!", "author": "Ana B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-29", "description": "What Attracted Connie Here: Convenient location near my home. \n\nMy experience: I used to come here every so often from my house to pick up food. I remember the burritos being expensive and even dry when I asked to omit the sour cream. Recently, my boyfriend said the carnitas were something to try and I decided to come here to pick up tacos before our Warriors game. I order 5 tacos at $2.95 each. Its pretty expensive considering most tacos are about $2.25. The meat was stuffed on, but my carnitas were a bit dry when I ate it. The chicken and carne asada was good, but nothing spectacular over Taqueria Guadalajara.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-27", "description": "I came here after the 49er game. After all the cheering, dancing and yelling, I've lost my voice and energy after the Niner's victory. And surprisingly my dancing didn't land no rain in the Bay Area. Even if it did, I'll get numerous complaints from many of you. \n\nThank goodness Yelp don't wanna hear my voice of my reviews, because I can barely speak. I can tell you my second-wind has been recuperated when I landed at this taqueria. \n\nLooking at the menu, the taqueria serve Grilled Chicken. And being a burrito-lover, I chose that meat for my super-burrito for $7.50.\n\nThis is one of the bigger taquerias I've visited with a huge dining area and a stage with a huge plasma screen TV. The bathroom is as huge as my master bedroom. Of course, not as clean.\n\nI know my burrito and love it oily and greasy. That is what I got when the grilled chicken was very lean and smoky and tasted well with the other key ingredients. Some of the drippings landed on my free chips. And believe me, the chips were covered with them. One of the better burritos I've had in recent weeks.\n\nI also washed my meal down with a cold bottle of Negro Modelo beer for $3.00. \n\nMy meal: http://www.yelp.com/biz_photos/4MvdxbwpYK8Ci4DH-HQguA?select=ImRGxX39NqmGLN4-3xw42Q\n\nI paid my meal in cash, assumingly that is all they accept. \n\nVery nice staff.\n\nHealth Department rating score: 95\n\nNow I feel better!", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "This place takes you right into Jalisco state, some cafe in Guadalajara. The food is bursting with flavor with freshly sauces, dips, meats and seafood.  The regular size burrito is understated, they're big and the super sized dinners are massive. Hit this place if you're stuck in rush hour on the 101 and need a short vacation to old Mexico.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-18", "description": "I believe a strong determinant of whether a Mexican place is solid or not is its hallmark offering: the burrito. The burrito is so simple, but so few places can make it right. Luckily, this place gets it right. \n\nThe meat is juicy and plentiful , sturdily encased by a thick, chewy tortilla. The rice is moist and does not overpower other ingredients. You get your choice of whole beans or refried beans. Most importantly, they get your order right (unlike a famous taco place in the Mission). \n\nThe only complaint I have is the price...which is one of mexican's food most appealing factors. A super burrito cost me over $8! :( I didn't think the super burrito was that \"super\" in size to warrant such a high price. However, this joint does come with free chips, which is always a plus.", "author": "Mina K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-16", "description": "The cook was creepy and they charged me $10.85 plus tax for a super burrito which is $2 than most places. The burritos here are small and the meat was overly salty and their salsa is not fresh. They also didn't put any sour cream, guacamole or cheese in my super burrito. I am never coming back to this horrible place. I did not feel safe here, they charged me more than what they should have and they didn't even put what is supposed to be in a super burrito in my burrito", "author": "Allison K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-16", "description": "I haven't gone back to this place in years but the super quesadilla is as great as I remember!!!\n\nNow I'm not sure about the other quesadilla options they have here, but the super quesadilla here definitely comes out looking like a burrito with the tortilla slightly pan fried for the crispy layer. This thing is packed with juices from the meat, tons of guacamole, fresh salsa and who knows what else but that initial bite is guaranteed to be heavenly! Of course the middle is the best part of the quesadilla but my goodness, it is so good!!!\n\nThis also came with a good amount of chips, but make sure you ask for salsa!", "author": "Maggie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "Makes one of the best super burritos and quesadillas in the city. It's a lot bigger than most places, too. I like that they have a good ratio of meat to rice to beans. They don't skimp on the guacamole or sourcream either. BUT if you ask for extra, they'll charge an extra $1.00 which is reasonable. \n\nMeat is grilled fresh. Accepts cards. Average service.", "author": "Han N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "I roll in here once every month. Sometimes it feels like a front for the cartel. Silent hombres chewing in the back, quiet dude manning the grill, that slow Mexican guitar strumming from the speakers like a Quentin Tarantino flick about to get real.......  But then I taste the Al Pastor......  Just like my imaginary Abuela (Mexican Grandma) used to make. Only then do I realize that the Cartel is the front and the real business is food that is highly, highly, addictive.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "My best burrito ever.\n\nThe carnitas was the best I had so far. And the burrito as wrapped in a divine way.", "author": "Paolo I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-03", "description": "My friend and I stopped by for lunch.  I love the high ceiling, the murals on the wall, and how the skylights keep the place nice and bright.  The tables are not at all cramped.  I sat so that I could see the tv, watching soccer.\n\nWe both had a carnitas burrito.  It turned out pretty good.  But even though we ordered two burritos, we received only one basket of chips.  The salsa was good, but there wasn't enough of it to go through a burrito and a basket of chips.", "author": "The Bottomless Pi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "Place is really empty when we came by at 6. Not a good sign... However, 15 minutes later, it's packed!\n\nI ordered the carnitas plate. The carnitas is pretty good, however the chunks are a bit too big (I like my carnitas in shredded style). Beans and rice are yummy. I really like their salsa.\n\n I tried the chicken plate as well, but I think the carnitas taste better.\n\nGood find in San Bruno Ave!", "author": "Novalina N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "All time favorite burrito place. I can't rave enough about this place. I have been going to this place since I was 10 and I have always loved it. I always get the super carne asada burrito and the meat is so juicy. I love my food with sauce and the combination of the salsa, guac, meat and rice is absolutely delicious. I know a lot of people get the shrimp burrito and I heard that is really good but I don't eat shrimp. \n\nI always rave about this place to my friends in Berkeley and it makes them so jealous to see my pictures because it looks amazing. Not only does it taste amazing, it also looks amazing. Best burrito forever.", "author": "Polly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-15", "description": "As far as taquerias go, you'll rarely see me order anything but Al Pastor, whether I get a burrito or tacos. I think this place has the best in town (18 year \"native\"). \n\nAlso, if you want to have an authentic Mexican experience, come in on a Saturday, grab the special mutton stew, and watch Mexican futbol on the 40 year old big screen television.\n\nEfficient service, as long as you're not a needy gringo with no spanish.", "author": "seth c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-06", "description": "This neighborhood taqueria is often quite busy.  During the late afternoon hours between 2 PM to 3 PM the place gets downright crowded with regular customers and school kids just getting out from class.  I had always noticed the popularity of the restaurant, but I never stopped in to try it until the recent holiday break.\n\nIt wasn't too busy during the noon time lunch time.  I was able to just walk in, look up on the big menu board overhead and place my order.  I was feeling especially hungry so I ordered the Burrito Mojado with pollo asado (grilled chicken) and a canned soda.  The Burrito Majado is a super burrito covered in enchilada sauce.  They have a nice assortment of canned soda, Mexican Coke, cold bottled beers and a couple of agua frescas.  Their food prices are a bit on the high side as my burrito and soda came out to just slightly less than $10.\n\nThe interior is very brightly lit with lots of seating.  Posters, trinkets, even a sombrero and ethnic attire decorate the saffron colored walls.  Authentic Mexican music plays in the background and there was even a television in the middle of the dining area airing Hispanic television.  Considering I was only one of three customers there at the time the food preparation time was quite lengthy.\n\nI sat for awhile before the young lady who took my order walked over with a basket of crispy chips and a container of fresh salsa (http://www.yelp.com/biz_photos/4MvdxbwpYK8Ci4DH-HQguA?select=DIUqC2BqdxMcOYjmIkJfEw).  Well, I'm not sure how fresh the salsa was as the cilantro was wilted and tasted flat.  I finally got the huge burrito (http://www.yelp.com/biz_photos/4MvdxbwpYK8Ci4DH-HQguA?select=8X1CUbm11Ws24caePGZaiQ) buried under a layer of grated Mexican cheese and a thick red sauce that appeared to be separating between the liquid and the pulp.\n\nThe pollo asado was outstanding and you'll get a very generous portion of it within the massive burrito overstuffed with rice, beans (choice of refried or whole pintos), sour cream and fresh salsa.  The overall taste of the burrito didn't strike my taste buds well however.  The taste of the tangy cheese overpowered the entire burrito which for some odd reason seemed overly salted too.  Maybe I just ordered the wrong thing on this first visit, but being in the neighborhood I'm certain I'll return one day to try something different.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "I usually get the super carne asada burrito or the quesadilla here. The steak is very tender and well marinated. Shout out to the cook; he's very chill and always serves me tasty food. This is definitely my to-go burrito spot in the city.", "author": "Agent K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-03", "description": "Ugh. I went here again this morning, and NO for the customer service! The bitch who took my order looked like me like I was a fucking retard when I told her I didn't want hot sauce on my taco and gave me attitude.\n\nThe food on the other hand..\n\nthe burrito was great. chips could use salsa.\n\n& my taco was pure shit.", "author": "Mimi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-09", "description": "So I never thought I would say this... but I've found a taqueria that is way better than any that I've tried in LA. As an Angeleno... that was really hard to admit. Cinco De Mayo seriously gets tacos and burritos right! And their FREE chips and salsa are perfection. The chips are always crispy & crunchy, and when paired with the pico de gallo-- mmm mmm mmm!! Their burritos are huge and I can never finish them-- but I definitely save it for later and enjoy it just as much as the first bite! I always get the al pastor burrito-- and I cannot stray from this choice because it is just so darn good!!! The meat is always savory, soft, and NOT DRY (which a lot of taquerias mess up on).\n\nI truly recommend Bay Area folks (not just San Franciscans, everyone around the Bay Area) to try this place out if you love Mexican food. You will be so happy you did-- and you will feel like you never have to go down to Southern Cali to try Mexican. Though, if you want real carne asada fries-- you might just have to. (And I recommend going to Southern Cali for the beaches and club life.) :) I love Mexican food so so soooo much and I'm so happy I've found Cinco De Mayo Taqueria. It satisfies my cravings and so much more. ;)", "author": "Julie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-20", "description": "The super steak burrito is delicious ($8.21). It also came with some chips and you have to ask for the salsa. I thought the salsa really sucked though so I didn't even finish the chips.\n\nYou can also see them clearly make the burrito and I thought that it looked pretty sanitary and just good.\n\nParking is on the street. Anyways, this will probably be the place I go to and recommend for burritos.", "author": "Tam N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-16", "description": "This is a decent little burrito place. I've been there several times over the past six months and it's pretty consistent.  The service is fast, the food is pretty good, the prices are reasonable. They take credit cards.  The service is decent meaning they aren't rude but they also aren't incredibly friendly.  The decor is ok, it's not particularly fancy or nice but what do you expect from a cheap little burrito place? The tables have never been filthy or nasty. \n\nParking can be a pain in that neighborhood which is the biggest drawback to the place. \n\nIf you are nearby and craving some burritos stop by. If you are a burrito connoisseur looking for a \"burrito experience of great magnitude\" then you might not be satisfied with this place. For the rest of us on a regular day, it's a good little place.", "author": "Hope A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-27", "description": "What's with the single dollar sign?  This place is fricken unreasonably expensive!!!  Regular burrito is $8 and it's below average, tried to charge me extra for salsa...HELLLLL NO!", "author": "Carmel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "I'm sure this will be heresy but I liked the Cinco De Mayo's super burrito much more than the \"best burrito in the country\" from La Taqueria. I also liked it more than the burritos from Pancho Villa, also in the Mission District. The beef in the burrito was nicely grilled and the mix of ingredients had good flavor. The super burrito was simply good in every way possible. Well OK, smoked beef would make it better but you can't have everything.", "author": "John W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-17", "description": "I live really close to this place and it never seemed appealing enough to want to go in there.  I was craving Mexican and didn't want to head out to the Mission so I decided to yelp it, saw the good reviews and gave it a chance.\nThe food is really good but the location doesn't make me want to go in there.  I'm all for the hole-in-the-wall taqueria but it's just not very inviting.  The menu is confusing and hard to read, because it looks like a 5 year old made it.  There was just really no care that went into this place, which I feel a lot of businesses on San Bruno are.  Good for a quick bite I guess.", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "I'm going to miss this place...the burritos were always stupendous, and the people were always friendly and welcoming. I used to tip theming r speaking Spanish to me, and the Super Shrimp and Steak burrito is so good I went about 3 times in one week just to eat those things. You get a side of tortilla chips always, and they always make sure you leave satisfied. Les voy a extrañar!", "author": "Jeremy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "Burritos, tacos, nachos, quesdilla, tortas,... Cinco De Mayo is the place to be!!!\n\nThis is the only Mexican restaurant I would crave and order from.  They grill the meat in front of you and the portions are *sometimes* pretty decent; depending on whose grilling up the steak.  I'm not sure what the price range is for other taquerias, but this place is pretty pricey.  \n\nLately I've been ordering the loaded nachos with extra meat.  It comes with salsa, avocado, sour cream, cheese and jalepenos,. topped with carne asada is how I like it.  This place never disappoints me when it comes in connection to my taste buds,.. the only downer is when I open up my nachos and the extra $2 of meat I paid for,. isn't there,. BUMMER,..\n\nOther then the lack of consistency in portions,.. the meals they provide here is YUM YUM YUM. Def can cure a big fat hangover!\n\nLoaded Nachos + Extra Meat = $10 out the door,. pretty expensive eh? \n\nI will be back =)", "author": "Chanel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-12", "description": "Just moved to SF, and I am so glad this place is down the street.  My mother and I ate here twice while she was here helping me settle in and get together.  She said the chicken super tacos were amazing (had them twice), I had the carnitas super burrito the first time, no complaints. Huge burrito and extremely savory and tasty.  \n\nNOW this is my favorite find. The Tortas with carne asada, are AMAZING! It is like a hot sandwich with a burrito as the filling.  Just AMAZING! Definitely a must try.  The 3 people who work there are super friendly (I speak spanish) so they welcomed me to the neighborhood after I told them I was new to the area.\n\nDefinitely a place to try, food is inexpensive for the portions you receive, and you will definitely eat here more than once.\n\n:)", "author": "Tom L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-11", "description": "Place is clean, service could be better at cash register, not that friendly! Not sure why? But always have different women in front they might be a language barrier and thats why they are like that?!?! ...or they just hate it there! Food is good and cook is nice ( with the blue eyes) and he always provides fast service, he's been there for a long time! Food can be a bit pricey compared to other taquerias", "author": "Susie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-07", "description": "Probably the worst taqueria I've ever been too. I order two carne asada super tacos and the meat was undercooked, the sour cream sauce looked as if it was left out for hours, and the salsa was no where near from being freshly made. Although their service was quick, I'd much rather wait and have a better meal.", "author": "Crystal D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-06", "description": "First of all the meat was somewhat warm and secondly the rice was just straight outta the fridge. Halfway through the meal I was molested by flies. Overall will not come back unless I truly have to.", "author": "Jimmy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-31", "description": "I'm not sure where all of these good reviews are coming from. Maybe they paid a few people, maybe it's their friends? who knows??\n\nWhat I ordered: Super burrito w/ Carnitas\n\n1 - Expensive: $8.20 for a super? I'd wish there was a El Farolito around this neighborhood but I was really hungry when I was in the neighborhood.\n\n2 - Taste: Carnitas was SALTY like the damn ocean water. I had to throw half away.\n\n3 - Place: Wasn't like the last photos of the inside. Dull looking too.\n\nI would only recommend going here if you are super far from a burrito place. The thing is, the meat was so salty I had to throw half away and it gave me a headache afterwards. Maybe they used MSG in their meats also? I read a review earlier about salty steak meat so maybe it's not just me that think their seasoning is SALTY! \n\nFor the price, I would pass. Getting some Calamari from Pier 39 is more worth it for the same price except you gotta deal with shitty tourists walking slow clogging up the damn sidewalks", "author": "Aye K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-27", "description": "I walked by this place on the way to my dental appointment so not surprisingly, I started to get a hankering for mexican food.\n\nFast forward to the end of my appointment...I walk in and decided to get a super burrito. I stood there for a few minutes, staring up at their menu on the wall. I realized I haven't had some tongue action in a while so I chose the lengua. The service was fast and friendly. Actually, the burrito was made so fast that I stopped and checked the bag to make sure they didn't forget the chips and salsa I also ordered.\n\nIt was a good burrito but didn't have that wow factor. But it's probably because it was a typical taqueria burrito and not some fancy schmancy fusion type of deal that's bursting with different flavors from around the world. The ingredients were definitely fresh, the rice wasn't mushy and the lengua had flavor. The natural flavors of the tomatoes, onions and cilantro really stood out in the salsa. I came in here and got what I was looking for. The only downside were the chips, they weren't homemade and were the thick kind...boo.", "author": "Christine P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-14", "description": "BEST BURRITO IN TOWN! The super shrimp and steak burrito is ORGASMIC. Been coming here since high school and I still come every now and then whenever I'm craving a burrito. The burritos here are JUICY and WET (hahahahhahahahha). Anyways, if you're a fan of mexican food and you haven't tried this spot yet, you're missing out. I always tell myself that I will try out other things on the menu but I always end up with the burrito. It has never done me wrong.\n\nService here is fast. The guy making the burritos usually work fast. The lady running the cash register seems mean though although I've never said anything to her other than \"Super steak burrito\" and \"Can I get some salsa?\" \n\n***Parking***: There's usually a few meter parking in front but if there isn't you can always look for residential parking close by.\n\nCash/Credit are accepted here.", "author": "Johnny G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-19", "description": "You would think that making a carne asada super burrito is like cooking rice a no brainer. In my case it was gross!! \n\nThis place only gets two stars. 1 for being a restaurant, and 2 just for serving the saltiest carne asana in the world. Never again. Don't they know that eating foods high in sodium can lead to having kidney stones?!", "author": "Jimmy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-14", "description": "Cinco de mayo is close to my house and one of the better Mexican taquerias in the area. The carnitas are the best meat they have. The al pastor is too greasy for me. The carne asada can be good sometimes alot of people come here but I only come here when I dont feel like driving.They serve menudo on the weekend but its not all that great lacks flavor although they do give you alot.", "author": "Rigoberto C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "This is my go-to burrito spot. Its by far the best burrito I've ever had. It beats all the taquerias in San Jose too. I always go for their chicken and shrimp burrito. Soooo good with their strawberry fresca. Yummy in my tummy!", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "They have the best super tacos ever! We're talking real yumminess here. You won't be disappointed. All my co-workers love it it here too.", "author": "Gessa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "I was starving the other day and yelped up this place near me. At first I was iffy, should I walking out into the cold and risk getting mugged? Or should I stay home and eat crackers to sate my hunger? After reading a few reviews about this places' shrimp and carne asada burito, I caved and went through turbulent winds to Cinco De Mayo. \n\nThe place was spaciously hectic as it was dinnertime and the woman who took my order looked frazzled but she was focused and to the point. I ordered the super shrimp and carne asada burito and watched the two men behind the counter cook it fresh. Ahh the smell of beef tantalized my senses. Come to think of it, me and the dog next to me probably had the same expression minus the drooling.\n\nService was quick as I ordered to go and omg one of you yelpers was right I DID NOT expect it to be that O.O huge it was like the length of my forearm! waited til i got home to dive in and thank goodness i did, it was so tender and juicy and flavorful, the shrimp and carne asada and everything else just came together perfectly. think of it like when the universe combusted for the first time and all these stars were made and the planets and yada yada yada. Even hungry I couldn't finish the whole thing. I've had some pretty good buritos in SD and in Mission but this place will def be on my list of to visit again.", "author": "Mindy X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "I was craving burritos all day, then this place came to save the day! Pretty convenient location with parking not too hard. I ordered the al pastor super burrito and it only took a minute. The burrito was absolutely delicious too! Great deal for not a bad price.", "author": "Dan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-03", "description": "LOVE LOVE LOVE LOVE LOVE their al pastor burrito. theres only like 2 maybe 3 ppl that work there, the lady who rings you up doesnt say much so ur not really sure if she got your order right. but she did. and the chef is fast, i mean like by the time ur done ordering ur food is almost ready. they also throw in bomb ass chips which i just recently learned helps calm the spiciness.", "author": "Leanna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-18", "description": "Solid SF style taqueria. Their carinitas is super crispy which I love but the pieces were a bit too small... perhaps it wasn't the best batch. Go for a burrito if nearby and hungry.", "author": "Audrey N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "I'm a fan for sure! The burritos remind me of one of my fav joints in the Mission.\n\nGreat carne asada super burrito--crispy yet juicy and super flavorful steak rolled to perfection. The chicken one is good as well. The fiancé was not as fond of his veggie burrito but he said it wasn't bad, just 'meh'.\n\nThe space is big and the music is loud. I felt really at home for some reason,  :-) \n\nChips and salsa are good, as well as the guac.\n\nYum!", "author": "Tysen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-13", "description": "This is where i had my first ever burrito......\n\nI still remember it like it was yesterday. Came here with my friend after school and i ordered a Beef burrito.( Carne Asada,  i just recently realized that it was called a carne asada burrito after 7+ years of just calling it beef burrito when i order. haha, silly me) When i first got it ( my first time seeing a burrito) i was like this thing is huge, and it looked so good, and when i took my first bite into that fat and juicy burrito. I knew i was in heaven..ever since then, i became addicted to burritos.\n\nAfter all these years of eating burritos at different places, i still think Cinco De Mayo is one of the best, i can always come here whenever i am craving for a burritos and trust that it will taste good.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-14", "description": "Best place to buy a burrito in Bayshore. Everything they make here is always on point, but the El Grande Burrito is really where it's at. Triple the the meat. SUPER juicy at the bottom... If you can finish it.", "author": "Russel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "Ive been coming here ever since I was a teenager, and this place has never disappointed. I love there Carne asada! And tacos. Everything there is very well cooked and very tasty. I highly recommend it to try out.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-13", "description": "I remember coming here back in the day when I was working a block away. The burritos were decent, but the best. At almost $10 for a super burrito, also not the cheapest. \n\nWhen this place gets busy, it gets loud. And the flies hovering around don't help", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-25", "description": "This is my 50th review and I wanted to write a review on something close to me. I just moved to the Portola in October of 2010. I didn't know the 'hood at all but I loved my place so I rented it. I have to say I'm really glad to be here and Cinco De Mayo is one of those things that makes me happy to be a Portolan (Portolian?) \n. \nChinese food abounds in Portola and I love the stuff. However, I'm from Southern Oregon and we love our Mexican food there. I have an actual NEED for Mexican food. My previous 'hood was the Mission here in SF. What I'm getting at is that I've had the chance to eat a lot of killer Messican food. I had modest expectations of this place because taquerias are hit or miss. This place is HUGE and usually seems empty because it's so big. I am happy to say that this place has consistently met my expectations and delivered good food. \n\nI've had burritos here and al pastor tacos. Their al pastor is my favorite. It's very tender and has a lovely flavor. What really pleases me about their food is that they have plenty of veggie options (whole beans), a small menu (which indicates freshness to me), and their food is NOT covered in inordinate amounts of grease, cheese, or other fattening additions. I recently had a taco plate and am happy to report that I was served portions a normal human could eat. \n\nMexican food isn't synonymous with healthy because it's often so Americanized and we love our fat. This place has the right idea of focusing on good, clean flavors. I don't feel bad indulging here from time to time. \n\nPlus, I love being greeted with a big smile every time I come in. I am happy this place is in my 'hood. \n\nCootz OUT! \n\n({})", "author": "Cooter T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "Very good burritos. I am a huge fan of chipotle but their burrito had so much more flavor. The price is a little high but it's worth it and also it is San Francisco. Nothing good is cheap.", "author": "Natalie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-30", "description": "I love, love, love Cinco De Mayo! Their burritos are the best. Though, when you first enter, it feels like you are being mobbed by flies.. Other than that, the service is quick. Just make sure you're extra clear when you order, so that way they get it correct.\n+ Chips and salsa come with burritos! =)", "author": "Audrey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "solid burritos at a reasonable price, fast service", "author": "Long C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-25", "description": "I don't come here as often as I used to, but it's mainly the neighborhood and not the food. The food here is awesome! Best burritos in town, nice people, great selection, decent prices and quick service. There was a time when I was a vegetarian and even their veggie burritos are awesome!\n\nIt can be hard to find parking at times, but this place is worth walking for.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-27", "description": "When I worked at a nearby school, I came here at least twice a week for probably the tastiest burrito I've had in SF. Trust me, I'm from SoCal and the food here at Cinco de Mayo comes pretty damn close to the real deal found down south.\n\nThe torta with carnitas is THE best I've ever tried. They grill the perfectly sized bread and fill it with all sorts of spicy meat and fixings. They also make some good horchata and agua frescas.\n\nIt's a bit out of the way, but if you find yourself in Portola, this is your best bet for some of the tastiest Mexican food in the City.", "author": "Art O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-28", "description": "I got hungry watching a soccer game (you would be hungry too if you were watching men with hot bodies take their shirts off.. okay only one of them but still) and I was slightly hungover.\n\nBURRITO TIME.\n\nThank you to Lizzy C for accompanying me. It was kind of scary. The lady behind the counter seemed a little PMSy because of some of the people in the restaurant. \n\nLizzy C killed a burrito mojado. Killed it...", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-21", "description": "A student from Thurgood if I was very hungry I would sneak down here to buy a super burrito. I always get that with steak and it fills me right up. My hubby gets alot of different things so hes always satisfied they make profit but dame their burrite is huge and long. Fills you up for about 5 to 6 hours", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-24", "description": "Today I got the steak and cheese quesadilla from here. I did not realize until halfway through eating it that I was actually eating TWO at the same time! I felt kinda dumb, but the last time I ate one it was just one piece! I was wondering why the whole time that the middle kept seperating..I'm hella smart.\n\nBut the steak was greasy and oil drippin with every bite! It was okay, I've had better. I will stick to getting their super burritos instead! Maybe I'll get a cup of horchata next time!", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "For this neighborhood this place might be one of the best , great food  sometime the lady at the counter can be a b**** but I usually call it in .carnitas one of my favorites , chicken plate and steak burrito all very good not the best if you looking for the best 25 th mission LA Taquria", "author": "Tony P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-16", "description": "Came here twice. The decor is atrocious, but the burritos are great. The flour quesadilla was delicious as well.", "author": "James N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "Mmmm so good but so bad for you.\n\nThis is the first taqueria I've gone to that adds hot sauce in the burrito. Or maybe I just never noticed it at other taquerias. \n\nOrdered the super burrito w/ grilled chicken to-go. Food was made very quickly. Everything tasted very fresh. 2/3 of it was all I could eat. Didn't even touch the chips, but luckily, my younger brother was eager to take it off my hands :)\n\nFor the price, quality & quantity are good. \nIf you're ordering take-out, service is very minimal, so can't really say anything about it. \n\nI'd come back again.", "author": "Florence S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-07", "description": "I have always drove by this place but never really gave it a shot. It got decent reviews on here so I decide to try it out today.\n\nNot bad at all. But it is on the pricier side. $10.50 for one \"Super\" burrito and they only give you minimal corn chips with the salsa.\n\nI put burrito in parenthesis because although it's their biggest burrito that they offer, its not really that big. Maybe its just me because I can eat alot, but its more like a regular burrito.\n\nAgain, not a bad place to get authentic Mexican food, but I dont want to pay over $10 for a burrito in these days. \n\nGive EL Farito on Mission st by Geneva and La Corneta on Diamond st right by Glen Park Bart station a shot. Those are top Mexican restaurants around this area too!", "author": "U L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "This place is OK. It's good for a burrito craving where you can't wait, but if you can I'd make the extra walk down to La Loma market and get a burrito from their deli. This place does the job, but isn't particularly tasty or anything. The prices are pretty standard and the last few times I've been in there it's been empty save for a few people ordering to-go.", "author": "Sannie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-06", "description": "I've only been here once personally but I've tried their burritos many times because my sister used to love driving here just for their burritos, esp. their steak nd shrimp burrito! It is sooo big nd juicy nd just tha combination of steak nd shrimp is genius! Whenever she has one nd I'm near, i just HAVE TO get at least a bite :D\n\nWhen I first came here, i ordered a steak nd shrimp burrito without even scanning their menu. I was ready. Noticed that they weren't any lettuce, cheese, sour cream, etc in it... was kinda disappointed but tha burrito was still scrumptious. Found out later that you have to ask them to put it in although i did order a super.. hm odd.\n\nSo recommended, esp. tha steak nd shrimp burrito. Nd remember to remind them to put what other stuff you want! Gave them a 3 only because my order wasn't what i expected my first time... i might change it later when i go again.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-05", "description": "I used to love coming here after school, since my high school was several blocks away. I would always get the usual, because a skinny girl needs to eat. Haha. I'd get the carne asada super burrito with EVERYTHING in it. \n\nJust until recently last week, they charged me for a small tiny container of salsa & jalapenos, which I thought was completely retarded since they NEVER used to do that.", "author": "Kimmi Mey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-06", "description": "Really wish I could give some more yelp love. Burrito was as big as the space was cavernous, service was friendly, and lettuce was added at no charge (yes, as some of you have called out, I do like lettuce in my burrito).\n\nOn the flip side, black beans and wheat tortillas were nowhere to be found, prices are on the high side, and oooooh, did you just give my cooking just fine as it is chicken a generous scoop of oil. \n\nBut I did get that lettuce, the eats were rather good, and what the heck, I've got a good 48-72 hour lingering buzz from Markus Schulz, so everything is getting an extra star.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-02", "description": "Best burrito deal in town?  I nominate thee!\n\nThe Super Burrito here is terrifyingly mindblowing.  It's like a fat baby's arm rolled into a tortilla.  To hold it is to fear it.  I don't know how I got all of it inside of me.  Oh wait, it's because despite getting full halfway through it was SO FREAKING GOOD I COULDN'T STOP!   I had mine with steak and no beans.  My colleagues opted for beans and theirs blew up halfway through, so I guess it can get a little sloppy.  I cannot complain about the food here.  I can't wait to go back and try some more.\n\n*Pros*\n- Retarded cheap.  The ratio of food to dollar is just silly.  It's fast food pricing and top notch quality meats and ingredients.\n- Ninja speed service.  I barely soaked in the place before the food arrived.\n- Solid selection of Mexican standards.  Plenty to try, mix, and match.\n- A handful of authentic Mexican beers are also available, too.\n\n*Cons*\n- GHEETTTOOOOO!   If you're coming for dinner bring a weapon or guys with broad shoulders.  If they're wimps ask them to wear black hoodies so they'll blend in with the locals.  Or come in daylight.\n- My friends did not like the nachos/tortilla chips at all.  I didn't mind them but that's not my thing anyway.\n- Feels like the whole place could use a deep cleaning of the non third world variety.  Maybe its just the dated decor/kiosk, I dunno.\n\nDon't get me wrong -- as of right now this is my favorite taco joint in the city.  Just watch your back as you're woofing that burrito down!", "author": "niero g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-07", "description": "I was having a craptacular day and I needed nachos. Hurray for nachos! I have been coming to this place since high school and it holds a special place in my heart.  Don't you love nostalgia?  :)\n\nI ordered chicken nachos with EVERYTHING on it. And when I say everything I mean refried beans, cheese, guacamole, salsa, sour cream, and jalapenos!  I typically order to go, but today was the day I got to plop by booty down and eat at this fine establishment.  I was so happy I was skipping to grab my food before the man could even put it on my table. I love it!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-02", "description": "THiS is my joint! \nSUPERnachos.SUPERburritos.SUPERtacos = SUPERB'!\nplus the imported soda in a bottle! sofresh!\n\na tiny tiny con: they charge a fee for card usage! i was not told the 1st time", "author": "JASE B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-18", "description": "The food is good, but the people there are not friendly. Sometimes salsa is free, other times you have 2 pay. Bull shit", "author": "Brian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-25", "description": "This place is amazing! One of the few places I often grab Mexican food from.\n\nReally recommend the Super Nachos and Super Burrito. They load up the toppings on the Super Nachos! Their beef is the bomb!", "author": "Peter Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-22", "description": "i love this place, their burritos are really good! \n\nthe wait time isn't that long. sometimes this place looks really empty. but don't let that influence your decision, it's a gem in san bruno avenue.", "author": "Tiffany B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-25", "description": "You could get the XL burrito and that thing is like HUGE! They pretty much put anything and everything in it! Everytime I eat it, I can't help but to feel like I'm a tiny person living in a giant world. That thing can crush you...nah jk. \n\nBut seriously, biggest burrito I've ever had. \n\nStill finished it. Yep I can eat alright..", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "They have the BEST super tacos ever! My boyfriend & I have tried a couple places in the mission. It didn't get any better than this!   Lots of flavor in their meat and reasonable price. It's too bad they close so early.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-12", "description": "4 solid stars for their pollo asado burrito. perfectly grilled chicken, whole black beans (my choice), rice and slightly spicy salsa. chicken grilled after I ordered. not greasy. super tasty. \n\nambiance nothing to write home about but you can't eat ambiance", "author": "Charles B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "I'd say this place ranks a solid 4.5.  I was introduced to this place by Raleigh, and am glad I got a chance to try it.  The carne asada was an epic taste sensation, perfectly suited for my taste.  It reminded me a lot of the Robertos style carne asada, kind of  like it's heavily seasoned with garlic salt, delicious!\n\nAlong with the chips they gave us, I was able to sample their pico de gallo, and a red sauce that was very good.   I think if you get a regular burrito, you'll definitely want to give it a good splash of their red sauce.  I opted for the gut busting Burrito Mojado, a super burrito covered in enchilada sauce and melted cheese.   I think all that cheese did me in, I was unable to finish my burrito and soon felt like it was nappy time.\n\nThis taqueria has a ton of space, and several nice sky lights, it's right off the Silver Ave exit on 101.  Give the Carne Asada a try, I really liked it.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-17", "description": "Their chicken burrito is VERRRRRRRRRRRY greasy! It is super good! No wonder..but I ate half of the burrito and I covered it and I placed it back in the bag and in a few hours the grease leaked out. Their horchata  is one of the best I have ever had!", "author": "Janet Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-21", "description": "The chorizo with egg burrito is to die for!", "author": "Liping H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-01", "description": "If you're stuck in the area and need a burrito fix, I suppose it's not bad but compared to Taquerias like La Vics or Super Taq in San Jose it comes up short. \n\nI've been here twice and both times I got a carne asada super burrito and came out unsatisfied. I think it's overrated here. Both times my burrito was soggy and overly salty. Mine did not look like the pictured one another customer shared and I was also disappointed in that department.\n\nThe price wasn't very cheap(I think it was like 7 dollars after tax, but definitely not under 5) but I suppose that's San Francisco for you. The place is big though and was pretty empty when I went during a weekday.\n\nMy quest for a good local burrito continues...", "author": "Cliff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-28", "description": "Cinco de Mayo rocks the Portola! Living in the Portola neighborhood for 11 years, this is like a home away from home for us. Friday nights after a long week, we know we can count on Cinco de Mayo for a huge, delicious burrito. Our favorite shrimp and carne asada super burrito. Oh yeah, it's divine. It is not super cheap, but a good value for the dollar. Their carnitas super burrito is a new favorite. Their tacos are tasty. All good! Definitely get them with salsa and hot sauce for maximum flavor! It's not too spicy, you can handle it!  I am a white girl after all! \n\nThe hood is not that bad, please. We go down with our kids and eat there sometimes and have never had a problem. \n\nWe wanted to try something different one time and found Taqueria Cancun on Yelp, and thought we would try it. It was more pricy for our shrimp and carne burritos, and definitely not as tasty. It was not worth the drive.", "author": "Keri V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-02", "description": "Super Steak Burrito is pure win, make sure you order it with the works and extra hot sauce. Sadly, the \"house\" tortilla chips were awful and way to salty. Not the best place for tiny stomachs like mine! Woah.", "author": "Rey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-06", "description": "Went to school up the block and we usually grab a carne asada burrito with no beans on the way to the bus stop. I still go there to this day. OM NOM NOM so gooood. the steak is fried to a crispy, but soft on the inside, srum-diddly-umptious state! parking sucks major beeeeep on san bruno though...", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-02", "description": "funny how i live a walking distance away but i never tried their food until my brother dragged me here during lunch hour. i was totally amazed how their burrito taste so goooooood! \n\nnext time when i need a burrito fix, this is the spot! yay.", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-20", "description": "Cinco de awesome.  This place is my favorite taqueria in the city, and I've tried many of the highly rated ones (Guadalajara, Gordo's, Papalote's, La Corneta, Ocean Taqueria, Zoro's).  While the others have their strengths, like La Corneta's salsa verde, Gordo's quesadillas and carne asada and Papalote's delicious salsa, Cinco de mayo's strength is just having the best burritos.  The super burrito is a fraction of the cost of Ocean taq's, La Corneta's or Zoro's.  My favorite is their chicken, which has a delicious sauce on it, but their carne asada is also great.  I haven't tried carnitas or any of the other meats offered because the first two were so good.  I really should try more of them though, because this place is great.", "author": "Jon O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "I have been going to school around the same area since I was five and have never been to this place until I was in high school. It served awesome mexican food back then and it still does! I recently came back from break and craved Mexican. I went and ordered a plate of pollo asado and it was ridiculously good. The chicken was so tender and seasoned perfectly. Their tortas are huge and flavorful that it definitely beats most places I have had. If your itching for some quality mexican food you have to come here.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "Love this place. Food is always good and the staff is very respectful. My order always comes fast and the portions are always enough. I am a very big eater and the Super burritos are the right size. I'll continue coming here on a weekly basis", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-27", "description": "I've never tried Mexican food until today. I pass by the Taqueria quite often but I never had to chance to go in until today.\n\nI ordered the combination burrito with chicken and beef, no beans. I didn't have to wait too long for my order. \n\nSo, I just got home and I'm eating my burrito as I'm typing this. And I gotta say, it's uber yummy! The chips, on the other hand, are quite flavorless. The price wasn't too bad.\n\nI'm attempting to finish the whole burrito right now (don't judge me!). People should definitely go check the place out! I think I'll try the super nachos next week. [=", "author": "Suzanne Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-01", "description": "I think Californians tend to take burritos for granted. We have access to delicious burritos in pretty much every neighborhood of every city in the state (coastal cities at least, I try not to go inland). Well today I had a burrito that was truly exceptional. Allow me to elaborate:\n\nToday was a union holiday for most of the people in my office. I am not part of said union so I reluctantly went into work today with a plan of sitting at my desk for three hours and then sneaking out at two.\n\nI spent the entire time looking at yelp. I was happy to discover that according to yelp I live in Portola (hey, it's an upgrade from Excelsior!) so I decided to check out the restaurants available on San Bruno Ave in hopes of finding something for lunch.\n\nOf the dozen or so places listed Cinco De Mayo was second. I wasn't too excited at the thought of a burrito. I was looking for something more exotic, but the reviews were all great and I decided to duck out an hour early and head over. \n\nThe place is actually pretty big, but the whole back area is vacant with five or six tables situated in th front. The lady behind the counter was very friendly and recommended the carne asada burrito (as does pretty much every other reviewer on yelp) so I ordered the super to go. I watched the cook prepare it...it was a spiritual experience. He grilled the carne asada and some shrimp for another order, I decided right then that I would get carne asada and shrimp in my burrito next time. It was butterflied! Most places make you eat that disgusting poo filled vein that grosses me out. Anyway, the smells coming off that grill were heavenly! I was quickly given my aluminium wrapped bundle of joy and headed off to my apartment to devour it. Did I mention is was $7? I have a feeling some people would think that was expensive, but I am not a cheap ass so it was fine with me.\n\nI hadn't had breakfast and it was almost 2:00 when I got the burrito so I practically ran home. It was some intense power walking. As soon as I got in the door I grabbed a beer and dove into my burrito.\n\nIt was delicious. It was so beyond my expectations. The reviewers had it dead on. Because the carne asada is cooked when you order it, it is dripping with juices and oh so succulent. Often times (from lesser establishments) the meat will be all chewy and fatty...not so with this delicious beef brick. \n\nSo I just finished it and I am so content with my choice. A good third of the burrito is on my shirt right now, the stains are like little medals of honor from the most delicious battle I have ever been in. I am now going to sit here with my yum medals and enjoy being comatose.\n\npardon my spelling....wow that was a long review.", "author": "Justin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-29", "description": "I dont  see what all the hype is about. First and last time going there! Food is bland! Customer service is horrible, the cashier had a mug on her face the whole time as if she hates her job. They also got my order wrong oh and its super expensive! Damn near $10 for a regular burrito with cheese.", "author": "A C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-06", "description": "The mixed seafood burrito here (shrimp and tilapia) is delicious. I've been meaning to try something else, but .... so far I've been sticking with what I know I like.  This is not a cheap burrito, but it is tasty and satisfying and walkable from my house. And sometime soon I will try other food there and update this review. \n\n3.5 stars!", "author": "neil c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-19", "description": "This place is the best.  I've been coming here since high school and in college I used to crave it while I was away.  Are you hungry?  Super burrito to the rescue.  \n\nPros: great food, get the steak super burrito.\n\nCons: in a shabby neighborhood with not much parking and no homemade tortilla chips.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-05", "description": "This is the taqueria that your mother warned you about. You know the one that she said would make you sweat grease after just one bite? The one that was supposed to be bad for you, but you later found out was real good to you? Yeah, this is the place.\n\nAfter four years away at college and away from what I consider to be authentic Mexican food, I ran straight to Cince de Mayo after moving back to SF and ordered the fattest burrito on the menu. I forgot the name of the burrito, but it's basically an upgraded, \"double the pleasure, double the fun, have two scoops of meat, instead of one\" version of their super burrito. I had mine with \"la lengua\" and everything on it. You can get all of the basic meats here, like the carne asada or the pollo asada, and all of your standard sides/veggies. The service was really fast and I got my burrito in about three minutes. When the cashier handed the burrito to me, I almost dropped it. No lie. I'm not a weak guy or anything, but I just wasn't prepared for a hefty, something-around-three pound burrito. The bag had the usual suspects: the burrito and some chips. I guess you can ask for salsa too, but I wasn't too worried about it.\n\nSo, I'm no burrito architect or rolling expert, but I like my burrito to be built in a certain way. I think all of you know what I mean when I talk about a burrito with all of the meat shoved into one corner and all of the sour cream and guac into another corner. Those burritos piss me off. Anyways, the point that I'm trying to make is that the guys behind the counter knew how to properly wrap a burrito. Every bite that I took was filled with just the right amount of meat, rice, beans, and salsa/sides. The meat was flavorful, the rice was moist and seasoned just right, the beans were beans, and all the flavors just came together really nicely. The only downside that I want to mention is the greasiness of the food: these guys aren't shy about putting a little extra oil and fat to bring everything together. With that said, you only live once, right?\n\nEnough about the burrito, let's focus on the chips now. A burrito will tell you about a taqueria's attention to detail, but the chips will tell you about a taqueria's dedication to the big picture. I think if you're going to put chips in my bag, you better mean for them to be there. I'm not the kind of person that takes kindly to the Chevy's style, paper napkin chips or the dried out, pre-packaged Tostitos. Anyways, these chips didn't disappoint. They were hefty, like the burrito, and thick cut so you won't get dirty looks from your girlfriend when you have to finger the broken chip out of the salsa that you're sharing with her. These chips had everything that you could want: a nice color, shape, texture, and crunch. Again, they were pretty greasy, but I didn't care too much.\n\nAlright, so here's the final breakdown for the stars from a baseline of 3:\n+1 for great portions for the price (~$10 for my ~8 inch burrito)\n+1 for having delicious, delicious burritos and chips\n-1 for sketchy looking sanitation, if you know what I mean", "author": "Frank Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-09", "description": "I got a bunch of burritos for a business lunch and they were a hit.  Teachers on the southeast side of the City are burrito connoisseurs (or they ought to be given the number of great taquerias around here) and we all agreed that these were pretty awesome.  \n\nAs per usual, one burrito is two meals unless you're crazy-hungry.  Not per usual: meat wasn't super-greasy, the beans were whole, and the salsa spicy.\n\nThe only drawback was when I was placing the phone order.  I had to correct them over ten times, and it wasn't a language issue, it was the person not paying attention to what I was saying (and I swear I wasn't talking a mile a minute--my coworker was listening and started to silently laugh his ass off as I repeated myself for the 9th time).  When he went to pick up everything, he noticed the people in front of him in the line having similar problems.  So 1/2 star off for that.  Also 1/2 star off for arguing with him about taking the small covered cups for salsa.  Our order was over $100, so I'd think that was worth $0.10 of plastic!\n\nStill, the food's awesome and they're a small business, so that's a win-win worth some a little extra frustration.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-14", "description": "steak and scrimp burritos!!!!!!!  CHOWWWNNNNKYYYYY mofos too..birria and menudo on sundays is da one...rite before niners smash...down it wit a cold negra and you ret ta go!!!  on da rilla tho the burritos are bomb the scrimp is always fresh...the pastor and carnitas are always hella tender...fresh agua frescas...i always get the fresa but the horchata is really good too...lifelong memeber up in this piece!!!", "author": "Bane V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-06", "description": "The place was ok for me as far as burritos goes.  They stuff it with so much rice and sauce I couldn't really taste the pollo.  It was defintely spacious and clean though.  I wouldn't mind coming back but it wouldn't be my first choice.", "author": "May B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-08", "description": "I picked up four heavy burritos while visiting my grandparents in this neighborhood. The burritos were packed with well-prepared and quite tasty carnes/meats -- carnitas (deep fried pork) and pollo asado (grilled chicken) with al pastor (grilled barbecue pork) for the combination burrito of which I tried. Despite the lack of cheese and lackluster Mexican or Spanish rice being the only two drawbacks, I was very satisfied. Not dinging them a star for the chips and salsa, which were complimentary, but the tortilla chips were too thick (have had much thinner chips and not sure if theirs is housemade and fresh) and the salsa didn't have enough juice but it was still had lots of flavor coming from the onions and cilantro.", "author": "Cliff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-10", "description": "My favorite place to get Mexican food EVER!  This place is truly the best.  I lived in the neighborhood for about 11 years before I moved.  I've been a customer since I was a kid.  I don't come here as often anymore, but whenever I have the time and it just so happens I'm in the neighborhood, I'll grab a Super Chicken Burrito here.\n\nThe burritos here have the perfect amount of zest and spice to make you a Cinco De Mayo burrito eater for life!  But seriously though, one bite and there's gonna be a rave in your mouth.", "author": "Joyce C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-22", "description": "Tried after reading the reviews so maybe I expected more.  Anyways, its a decent place, I've had better and worse burritos.  I'll give it another try before I say more", "author": "Cri S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-24", "description": "Like many other reviews I've read about this place, I live close by but never bought something from here before. Today was my first time. I read about the super burrito and that got me interested. \n\nIt took a couple minutes for the cook to make the burrito. I was surprised it was so fast. Guess only the meat needs cooking. The other ingredients were readily available.\n\nupdate: upped to 4 stars. Been going here more often and I'm a fan... although I wouldn't eat here everyday.  I have yet to try to nachos and other stuff.", "author": "Vincent C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-17", "description": "I love this place but always hesitant to walk by there. San Bruno ave is dangerous @ night. I've been living here for 10 yrs. It has gotten better but not much.\n\nI have only tried their burrito. It's huge and decently priced. Shrimps is the best to my preference, but a bit pricier than chicken or beef. Chips are given, but I'm not sure if you have to pay addition for salsa. I'd come here more often if it wasn't the neigborhood that it's in. I think it closes @ 8PM on Sunday.", "author": "MT D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-30", "description": "Ended my weekend in Sf at this place based on my location and yelp reviews.  It was empty when I went in at 1 on a Monday I don't know if its always like that but don't let it fool you.  I had a carnetas super burrito.  It was HUGE, the burrito ended up getting a little wet because of the salsa but the taste made it worth it.  I don't normally go to places like this in Sf so I really enjoyed this. Probably got into my top 3 burritos.", "author": "Nick F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-06", "description": "I was out in SF and decided to go to Cinco De Mayo Taqueria to grab some dinner with a friend.  The food was serve very quickly and that is probably why my food was not good.  I got a burrito and it was the first burrito I did not like in a long time.  This place has positive reviews so maybe I lucked out but I will not be coming back to this location.", "author": "Herm K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-20", "description": "This place makes the best burritos in the world!!!  I lived in LA for years and all over the Bay Area and this place has the BEST burritos ever!!!  I hate places that just pour tons of hot sauce and jalapenos and have no taste.  You can get a mild burrito here and it still has lots of flavor!  \n\nWe always have trouble finding parking but it is SO worth it!", "author": "fusita t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-24", "description": "For it to charge so much for a burrito and call itself a taqueria is outrageous.  If you go to the Mission and go into a taqueria or another burrito joint even like the Gordos chain, they don't charge this much for burritos.\n\nThey don't even throw in free chips like other places.\n\nTheir food is good and kinda big but I can get the same for much cheaper elsewhere.", "author": "Gilbert C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-05", "description": "Oh - I just realized you can pay with a card here. Exciting and handy! Now if they would only stay open a little bit later . . . .", "author": "Allegra F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-22", "description": "Super suiza carne asada from Cinco De Mayo  and a negra modelo..the perfect lunch in SF.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-02", "description": "Cinco de Mayo serves up a good burrito when you're in the area and can't get to or dont want to head out to the Mission.  i've found their grilled chicken to be dry sometimes, so i usually get the carne asada super burrito with everything - but carne asada anything is good.  their steak is well marinated and cooked to order.  it's always tender and moist and provides the right amount of juicy saltiness to the burrito.  this place will definitely fill your burrito craving, but if you're willing and able, i'd still go to El Faro Lito.", "author": "Norman N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-24", "description": "One of the best burritos I've ever had the pleasure of eating, nice and juicy.  I wish they were open late; I used to go to this place once a week.", "author": "Danny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-10", "description": "I am in LOOOOOOOOOVE with this taqueria! This is defitnetly the best place to get mexican food. Not in the Mission, in San Bruno near the fire station! I come here at least once a week. I had the chicken enchilada a couple times here and it is the BOMB! Also the quesidillas are really good here. But I usually just get the super burrito. The super burrito is super juicy so be prepared with TONS of napkins, you'll need it. It's just perfect...... It's so delicious that it's just unexplainable. You defitnetly just have to try it to see what I'm talking about :D Totally worth $7.", "author": "Didi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-28", "description": "This place, hands down, has one of the best burritos I have ever had in my entire life. I grew up around the south bay area where the Mexican food was below mediocre, then I moved down to southern california where it's supposedly the \"burrito mecca\", yet every time I have a burrito at King Taco per-say, I always happen crave a Cinco De Mayo burrito. There's something about their burrito that is so different than the others. When I bite into one, their carnitas are a perfect crisp, the carne asada has an explosion of flavor, and what's great about it is the el grande burrito can mix both of those meats into one! When you get to the middle of the burrito you can experience a euphoria of flavors, the juices coming from the meat, the cold pico, and they can even spice it up for you. Service here is always quick, plenty of space to sit, the only downside is that the area is a little sketchy, but nothing has happened to me thus far, and I've been coming here for 3-4 years now, so don't be scared to try one of the best burritos you will ever have in your lifetime", "author": "Roy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-07", "description": "I had two tacos from El Farolito at Mission last week for $4.25 total.\nTwo tacos at Cinco De Mayo was $5.25, with about 25-40% less stuff.\n\nCinco De Mayo tacos lack the onion cruchiness, which I enjoy a lot. There was nothing special or worthy to comment regarding the taste.\n\nNot the best bang for the buck, but I guess you don't have", "author": "Ivan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-07-11", "description": "I ate there once and was so unimpressed that I've never been back.  I really can't recommend it, when there are so many good Mexican restaurants in town.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-30", "description": "Best place to get a burrito! The burrito is huuge so it's really worth the price you pay for it. Every bit of it is delicious. It's always hot and fresh! Plus you get some free chips to go along with it. This is my favorite place to get a burrito, but I don't know if it is good for anything else on the menu. I'm sure it is though if the burritos are so damn awesome.", "author": "Bets Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-06", "description": "So I get on the bus from what seems like a long day at work. These dumb ass hoodlums also get on the bus. One of them sits next to me, and puts his arm around me. I ask him politely to move his arm, and he refuses and talks back. And then his other homeboy tells me not to worry about him and then attempts at getting my phone number. While he is doing that another one of them ashes his blunt on my foot. So I get up from my chair really irritated and then tell them to f*ck off. Then they start saying more sh*t to me. I start yelling right back, and I'm usually not like that, but I'm tired as hell. When I find another seat, I just blast my music on my Zune really loud. When I get off the bus, we're just cussing at each other, while they're still sitting on the bus. And then one of them throws a water bottle at me. Anyway I get home so irritated. But to my surprise, sitting on the kitchen table are Cinco De Mayo super burritoes and nachos. And with each bite, I forget how about angry I am, and remember that tomorrow is another day. I grew up loving this taqueria since my sister introduced it to me when I was in middle school. And me and a good friend of mine would come here sometimes every week in high school. It really got me through the hard times. Even though I've had other taquerias, and sometimes they may have tasted a lil better, I still love this place more. Thank you Cinco De Mayo for always being there and your life lessons.", "author": "April D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-23", "description": "DISCLAIMER: My review is based on the food itself, not on the restaurant. I have been coming here since my high school years, and all I can say is that the burritos here are the best in the Portola District. The burritos here are juicy and pack a lot of flavor. If you went to Thurgood and never went here, you definitely missed out.", "author": "Gerry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-02", "description": "Cinco De Mayo is THE BEST taqueria in San Franciso.  Their burritos are amazing!  The meat is seasoned to perfection and the portions are huge.  Even though a little pricey, it is definitely worth it to try it out.  I highly recommend the steak burrito, nachos, and the super quesadilla.  TRY IT! YOU WILL NOT REGRET IT.", "author": "Edward C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-25", "description": "yum! I love their nachos. I never seen any other nachos like theirs before. its gi-normous! The first time they opened, I didn't like it. I had their normal burrito and wasn't that impressed. A few months later, my friend tells me I have to try it again. It's her favorite Mexican restaurant and she raves about it, religiously. So I decided to try their nachos and fell in love. They close at 8 everyday I think.", "author": "Abby A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-28", "description": "i loves me some cinco de mayo\n\nin high school, i used to go to this place around once a week.  now that i'm in college, i fall into SF taqueria burrito withdrawals :[ i'll either go to cinco de mayo or el farolitos (my faves) to fix my cravings\n\ncinco de mayo burritos are sooooo juicy, there's no other way to describe them.  i love the super carne asada, chicken or carne asada&shrimp burritos.  SO GOOD.\n\ntheir pico de gallo is awesome too- you always have to ask the woman at the cashier for some though, they don't automatically put it into your bag.\n\ntheir super tacos are HUGE and really filling. i've tried their nachos as well. everything i get here is always spot on. i wish they had more hours though.", "author": "Cee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-21", "description": "One of the best burritos i've head is here, they're big juicy and they give you a big bag of chips. I would recommend this place to anyone", "author": "Jack L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-27", "description": "A hidden gem is right.  If more foodies hung out on this side of San Bruno, I'm sure this place's reputation would be sky high, because the burritos are phe-freaking-nomenal.  The carne asada is seasoned beautifully and grilled right there, and all the grease and meat juice doesn't soak off while the meat's sitting in a tub, but ends up in your absolutely massive burrito...mixed with some hot sauce, the experience is just sublime.  Juicy, filling, flavor explosions, these burritos are.", "author": "Keane N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-17", "description": "A hidden gem. One of THE tastiest, most jaw-droppingly good burritos you can get in the city, period. It's very out of the way for most, but it's very much worth the trip for a completely unique burrito mastication ceremony that is completely unlike any other. Ignore any reviews with anything less than 5 stars, as these people, quite literally, are retarded and would not know a good burrito if they were hit in the eye with it. And these mothers are HUGE....they are more than a burrito...more like a 3-day internal pet. Incredible. This place will go down in my burrito scrapbook of wonderful life-affirming experiences. These burritos will make you happy to be alive.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-01", "description": "Excellent burritos.  The seasoning of their meat beats many of the usual taquerias.  In fact I can think of anyone who does it better.  The carnitas are outstanding.  It would even be worth a trip to this edge of the city destination.", "author": "p w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-05", "description": "If you find yourself on San Bruno Ave and you have a taste for a taco or two this is a good place to eat.", "author": "ein bier bitte k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-21", "description": "I LOVE this place!  RIGHT by my house, the Super Nachos are amaaaaaaaaaaaazingly good, and the carne asada they use is pretty damn good.  It's one of the things that always brings a smile to my face to go up there on a lazy afternoon, get some nachos and a Corona, or mexican coke.  Atmosphere is pretty nice, and never had any problem with the cashiers.", "author": "Sean V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-15", "description": "burritology.  this place can school a lot of the taquerias i've been to in northern california.  they have excellent carne asada as iit pretty much tastes like the carne asada found at the 'berto's chains in southern california\\nevada.  they have an excellent red salsa as well.  the place isn't quite perfect though.  the price of 5.60 for a regular burrito is on the higher end.  it's also out in the portola area, which isn't really near anything.  however, the price premuim is something i can afford, and i now live a couple blocks from this place so it gets the hi-five from me.  if more people ventured out to this place it really would be like the hi-v  because it would be a full blown pandemic.", "author": "Raleigh W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-19", "description": "I came here not expecting much because it was completely dead inside. Had I read the reviews before I went, I would have expected much more and lowered the rating. I ordered the carne asada which was good, but not THAT good. Also, the chips and red sauce they gave were much too salty for my liking.", "author": "edmond s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-01", "description": "I'm going to give this place a top notch grade. It's been in my lunch rotation for the past eight years and deservedly so.  This is far from the Chipotles and Rubios of the world.  I think the key phrase to describe this place is \"hidden gem\".  I rotate between ordering super burritos: carne asada - juicy and succulent with fewer gristle pieces and unchewable parts than most other places! Between that and the carnitas and al pastor, I've got enough variety to satisfy my appetites.  They have way more on the menu, it's just that I'm content with those.  I've had comparable burritos in the Mission, but I still like this one the best.  Unless I'm in LA and getting one of their best, this kicks the collective butts of all others.", "author": "Erick K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-19", "description": "I tried cinco de mayo last night for dinner. Aparently, by what everyone says, their burritos are great, but none of us had one. We usually get our burritos from la loma down the street. This is your usual walk in, order at the counter spot, with some chairs.  We got takeout. I wish there were a mexican place that delivers. S had tacos, which I never even got to see, much less try, because he inhaled them before I got into the room, but he liked them. J and I both had the same thing - the two enchiladas plate with one beef and one pork, and verde sauce. When we ordered them, the woman at the counter warned that verde sauce would be very hot, and we said that's fine. After I had finished eating, I remembered she said that... I don't know why, because it was not only not hot, it was so so mild. I couldn't taste any hot or spiciness to it at all. Besides that, they were tasty. Not gigantic, but normal sized. They came with lettuce, avocados (yay) and sour cream, as well as some runny, tasteless beans and tasteless rice, and chips. So, I think entrees are good (though lacking in spiciness) but they need to work on the sides. I would come here again, and just add some hot sauce to it for seasoning. Or maybe I should try the burrito.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-25", "description": "how does it feel to have THE BEST burrito ever made? bc that's how i feel about this place! the meat is thoroughly seasoned.. the flavors compliment one another... on top of another.. on top of another.. on top of another.. isnt that the \"ideal\" of food anyway? dont skimp out and get the basic burrito.. go for the one in the middle with the works... give your palate a sensual exploration and go for the FLAVOR", "author": "geoffrey l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-17", "description": "This is the BEST burrito place by far......The have the best vegetarian burritos ever. Nice people. Juicy burritos. Decent prices. I have been going here for more than 7 years and I recommend it to everyone I know. All my friends eat here and everyone I know loves this place.", "author": "SF N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-08", "description": "my favorite burrito joint. they're a bit cheap on the chips + salsa though. a super chicken burrito from cinco de mayo always knocks me out.", "author": "Andy H."}
