{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "I rarely dine in so this is based on my takeout experiences:\n\nGood, solid, not too fancy Indian food.  Probably best Indian restaurant in the Noe Valley/Mission/Castro/Glen Park area.  Highlights are the saag paneer, the samosas, and the various naan.  The tandoori items tend to be a bit dry and once they got a little too aggressive with the meat tenderizer in my butter chicken.  But otherwise pretty solid.  They are very spice-forward, so don't expect too much delicate subtlety in some of the flavor profiles.", "author": "David O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "The food was yummy, the service was good and we really enjoyed the inteire experience! We ordered the clay meal for two (tasting menu style), it was A LOT of food but everything we had - maybe except for the hot pan with meats that were a bit dry for my taste - was very tasteful! We'll be back!", "author": "Stav F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-02", "description": "AVOID THIS PLACE.  \n\nWe live nearby, thought we would walk down from Bernal Hill to try it out.  \n\nOne guy was working the whole restaurant.  No other customers.  Guy took our order.  Then proceeded to take phone orders, which he went back and prepared and handed to the delivery guys before STARTING our order.  Must have been half an hour when he finally brought out our fried eggplant appetizer.  Huge.  Inedible.  Stinking of rancid oil.  We left it on the plate.  The waiter spent another half hour in the kitchen.  Finally, we asked him to cancel half of our dinner and bring us what was already prepared.  More than an hour after we entered this empty restaurant he brought us our fish tandoori and rice.  The fish was edible, though the oil was again bad.  Rice was OK.  I immediately asked for the bill when dinner arrived so we could escape.  When he brought the bill, it still had all the items that we previously canceled on it, so he had to redo the bill.  \n\nI don't know how this place stays in business in the busy, competitive San Francisco restaurant scene.  Why didn't I do 3 minutes of research?  I'll never get that 90 minutes of my life back.  And for the first time in many, many years (10 years?  more?) I left no tip.", "author": "Greg S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-04", "description": "The rice came super soggy. Like almost jook like (congee for non-Asians). The rice isn't the typical ones Indian restaurants give either. More like typical Chinese rice. And they topped it off with peas. Wtf.\n\nCTM, the most basic item ever...is probably a two stars out of five. The rice was a killer though. Total $21 and some change. Never again.\n\nWorst part is that I had it ordered so of course I can't send it back to the kitchen. Instead the rest lays in compost.", "author": "Whitne Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-28", "description": "Do not be surprised when you step in  there and you will be informed that the food take  10 minuets to be ready and after 15 minuets when you go to ask about it, they say another five minuets and after 5 minuets they  say another fives minuets! Then you never get your food .\nIf you are hungry do not think to go there .", "author": "Mo'ad A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-31", "description": "Empty for lunch midweek. The items on the lunch buffet struggled so hard to make an impression. It has been a while since I've had lackluster Indian food--the scene in SF is vibrant... but not here. Peace out.", "author": "Lu-Shien T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "The staff and owner (I think he was the owner) here are the sweetest! My friends took me here for their buffet lunch on my birthday. The food was flavorful and they brought us endless amounts of naan. What really stood out was the fact that they made us feel like we were eating in our own family's home. They kept encouraging us to keep eating and were showing us videos of an American actress who does Punjabi performances. \n\nMy friends and I couldn't stop talking about what a pleasant experience we had here. We'll be back!!", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-16", "description": "Super bland. We got the veggie fried rice and mushroom and peas (both seemed like canned veggies). It was the only restaurant on Doordash late at night with vegan options. Never again!", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-24", "description": "I have eaten at this Clay Oven several times. 90% of the time it's really good but tonight was different. I ordered the chicken tikka masalla and onion naan and could not be more disappointed. The chicken was burnt and and there was no heat spiceness to it. The entire order tasted burnt. The onion naan turned out to be garlic nan and was not edible.\nI'm not sure that I will return.   :-(", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-06", "description": "Our flight was delayed by 2 hours from LA and we reached SFO at around 10 pm. This was the only Indian restaurant open till 11 pm. Thats the primary reason for giving it 4 stars. Food was good too. I would like to visit this place again.", "author": "Saurabh M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-15", "description": "I put in an order for delivery around 630 and it's now 8:30 and I still haven't received my order. Called in to check in on where my order was and they took a very long to respond back. He just said that the delivery guy left a long time ago and it should arrive any minute now. Didn't even offer a discount or anything. \n\nSave yourself some time and don't order from here.", "author": "Marcella C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-19", "description": "Horrible service , same guy takes order and cooks and delivers. Food quality poor , please don't waste money here , there are plenty of other better Indian restaurants to try around here.", "author": "Madhulika G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-22", "description": "Don't want to pile on here so I'm giving 3 stars.  One is a pity star. The men working were nice enough but this lunch was very bad. Empty place should have been a clue. Naan was the best part. I don't get to spend this much on lunch very often so it was a bummer.", "author": "Miss F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-15", "description": "Please save yourself some pain and don't oder from here. I ordered a meal for one at 6:30pm and the unpleasant woman on the phone said it would take one hour to get to me. I called almost two hours later at 8:15pm checking on my order. She said to give the driver another 20 minutes. I called back at 9:35pm over 3 hours from my order time. I told him I wanted to cancel the order. The guy that answered asked why, I told him it had been three hours, he told me to hold on and he'd check where the food was then he hung up on me. I made myself food and 20 minutes later the woman said her driver was lost and asked my address again. I told her I canceled the order and she said, \"Sorry.\" Please do not order from here if you want to eat. I only had a small window in between work and sleep to eat and they ruined it. Thanks a lot.", "author": "Justin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-06", "description": "The last time I had delivery from here it was fabulous but tonight was a different story.\n\nThey sent me rice I didn't order. Pakora I didn't order. They didn't bring the Samosa I had ordered. The pappadums were crushed. The Butter chicken was burnt and inedible. The only semi-edible item was the daal but it wasn't hot and not fully cooked with some still slightly crunchy lentils in the mix.\n\nI called to get the items I ordered redelivered and to complain about the burnt chicken but despite their promise to re deliver they never showed up. \n\nVery disappointed.", "author": "erin m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "I absolutely love this place. The food is some of the best Indian food i've ever had. The lunch buffet is awesome, and the owner is a really nice guy. Highly recommend, I do not at all understand how this place has 3 stars. That's the issue with Yelp, glad I didn't check Yelp before trying this place out :)", "author": "Zach S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-07", "description": "Flavorless box of heavy cream with chewy cardboard naan is what we got tonight when we ordered delivery of Malai Kofta and Garlic Naan. This might be our last order sadly and we actually used to order the same items regularly until a few months ago. Not sure if the mgmt changed in this time or the chef but the quality and flavors have clearly gone down. Not worth paying the $4.95 for naan so heavy and flavorless. And not worth getting bland Malai Kofta that does not taste fresh. Save your money because this Clay Oven no longer lives up to its once great reputation.", "author": "Shilpa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Warm Naam bread, yummy Mango Lassi, and all dishes are cooked to perfection with fresh sourced ingredients. This is one of my favorite spot for Indian cuisine in the city. You won't be disappointed. Enjoy!", "author": "François N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-14", "description": "We were really disappointed in our delivery tonight. The Raita was sour. The Muttar Paneer was so overcooked that there was no sauce and the cheese was hard and dry. The Chana Masala was also overcooked but not as dry. The Onion Bhaji was good but they forgot to include chutney and they sent regular naan instead of the garlic naan we ordered. I wouldn't recommend ordering delivery from them because you have to take what you get. I won't order from them again.", "author": "Jill P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-19", "description": "Horrible customer service. Can't tell you how the food is as I'm still waiting for my order 40 minutes later!!!", "author": "Monica B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-08", "description": "I ordered food, expected delivery: 1 hour. 1 1/2 hours later, I call, they say \"5 minutes\". 1 hour and 50 minutes, they say \"one to two minutes\". I tell them, don't bother, it's too late. After over two hours, they arrive, demand that I accept delivery. I refuse. They refuse to issue a refund. Wow.", "author": "George F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-19", "description": "Horrible customer service. Tikka masala was watered down and horrific. It seemed they just added water since I ordered 10 orders for my co-workers. Everyone gave it a thumbs down. All I can say is I'am very disappointed. Never again. Super over prized for poor quality food.", "author": "Gabi V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-12", "description": "Not sure if the lunch buffet was for American tastebuds,  cause it was not spicy at all. But their lamb dish was splendid, just not spicy.", "author": "C t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-30", "description": "I love Indian food and some of the dishes were delicious but my stomach turned the second I saw rodent feces near the window.  I hope they are addressing the issue so that there would be no health concerns to customers. The ambience and customer service was nice besides the rodent droppings.", "author": "Natie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-05", "description": "I ordered delivery, it took almost 2 hours. The food had no flavor. I ordered very spicy tikka masala, and it was as spicy as mayo. The entree didn't come with rice, and they didn't even give utensils. I'm staying in a hotel, so it wouldn't make sense not to give them. I don't even know how these people are still open with such tasteless and bland food and slow service.", "author": "Britta F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-05", "description": "food took 2 hours to arrive, mediocre at best. i wasn't expecting much, but it fell below my expectations. oh well, lesson learned.", "author": "Alyssa L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-29", "description": "It was bad. Bland garlic naan. Rubbery flat chicken tikka. Saag paneer had tofu not cheese. Rice was flavorless.\n\nMy mistake not following yelp. Used to know a delicious clay oven on Fillmore at Haight years ago.\n\nNot the same. Not close.", "author": "Dan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "the food is great. service is spotty. been here three times and and often find it hard to find good indian food in sf. this is the real deal. service was the worst the second time but went back anyway cause the food was so good. take out works if you don't want to take a chance.", "author": "Paul F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Delicious Indian food, my family and I always come here and throw family functions, they never let us down, great service, great food, great time.\nHighly suggested!!!!", "author": "Shazanna T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-21", "description": "Food took 3 hrs to arrive. The food was stale and tasteless. I would give this place zero rating if possible. Overall, very disappointing and not recommended at all.", "author": "Suman F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Yummy and affordable lunch buffet. Neighborhood restaurant. Love coming here or getting food to go. Feels like a quick  visit to India", "author": "Rotem N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-17", "description": "Husband got some last minute appetizers from them. Obviously zero expectations from last time experience. However, this time the food wasn't all that bad. Don't know if they changed the cook or not but the food didn't disappoint us that much. Will have to try the main courses though to see if the quality improved. Well I will try and give them another shot.", "author": "strfrm y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-04", "description": "One of the worst Indian food I tasted my entire life . I ordered Chicken Biryani and you know what these guys will prepare Biryani . It's just stupid Jira rice and added some spices and also more than 5 star hotel price \n\nI didn't really tried buffet and I won't recommend this one if someone going to taste Biryani here .", "author": "Vivekananda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Best food in the area I have been coming here with my daughter for about 10 years waiters are very friendly make you feel at home and the food is always fresh.", "author": "Enrique N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-19", "description": "We ordered for delivery and the food arrived on time but that was the best part. Both the paneer and chicken tikka masala tasted like canned tomato paste and they did not bring the side items I requested. When I called to let them know that they did not bring me the side I ordered, the guy at the restaurant hung up on me. Spend your money elsewhere.", "author": "Amit M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-26", "description": "Worst Indian food I have ever had in my entire life. Not only was the food tasteless and chewy, but they welcomed me with a bug on my plate. Looked like a baby cockroach. The waiter gave us 15% off and he could barely look at me to apologize. Never coming back.", "author": "Genesis A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "This rating is actually for 3.5 stars.  The food was delicious and when we asked for non-spicy for the kids, the dishes actually arrived as requested without sacrificing flavor.  We ordered naan, rice, chicken saag paneer (hard to find!), raita, pappadum, and chicken tikka masala.  One of the kids couldn't stop mixing the raita with the other dishes to layer the flavors and kept asking for a second order of the raita (a first)!\n\nMinus .5 star for service - distracted throughout dinner and took a while to get the bill, though we were the only table in house the entire time.  Overall, I'd return again!!", "author": "M G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "Just came by for lunch and was as delicious as I remember. Very fresh and just beautifully cooked buffet.", "author": "elizabeth m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-09", "description": "The chef went to taste what his team had made...\nTakes some curry in a spoon. Takes a taste. A moment's pause.\nAll hold their breath.\nA frown. \nA blast.\n'C'mon what's wrong with you? I can taste the food. Put some cream in there'.\nSome cream later... 'A lil more.'\nTakes another taste.\n'Ahh nice.'\n'Now go smother em boys!'\n\nNote - this is a dramatized version of an imagined but likely true situation.\n\nNice-ish staff but...\nthe food was full of cream. Every single dish so that nothing had a flavour of its own; bland.\n\nI went late at night, with my husband, happy that this option was open till 11pm. My first option, Spicy Bite where the food is on point was closed so I said - Let's try this other Indian place. \n\nWe ordered a vegetarian Indian Thali for two. This was major for me as I was cheating in my diet and looking forward to the food. I was ready to dig in! The Thali had raita (yoghurt), palak paneer saag (spinach and cottage cheese), dal (lentils), baigan bharta (eggplant curry), rice, naan, kheer (milk pudding dessert). Quite a bit. The bill came to $40 including tip. But it was so not worth it :( Only the naan and rice was good. And yoghurt. And you have to try really hard to go wrong with these.\n\nAt the same time there was a now on, now off high pitch sound coming from the kitchen or somewhere and I kept wondering 'why am having to eat and pretend to enjoy a meal through this?' :S\n\nSo good ambience, nice-ish waiters but not good food.\n\nIt also feels bad that such fare should be offered to people exploring Indian food, who then perhaps think that this is what Indian food is like.\n\np.s - just read other reviews. Many people have been saying the same thing for a long time now. Why don't they fix it?", "author": "Malvika B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "The food isn't amazing but they deserve a 4 star review because their all you can eat lunch buffet is such a good deal! Only $11 during weekdays I believe... \n\nThe naaaaaan is boooomb", "author": "Aljosha N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-30", "description": "I really wanted to like this place, but it was not a great experience overall...hopefully this was due to an off night.\n\nI ordered goat cheese naan, chicken vindaloo & a side of rice for pickup.\n\nFirst of all, and this is my bad for not checking before I left the restaurant...but they forgot to include my side of rice but didn't forget to charge me for it. For such a small order that took 30 minutes to complete, they shouldn't have forgotten.\n\nSecond, that goat cheese naan was more like jerky, I'm guessing the regular naan is better...so go with that.\n\nThird, my chicken vindaloo sauce was awesome, but the chicken was incredibly overcooked...I mean I had to laugh because the food was so incredibly below average (except for the vindaloo sauce).\n\nI hope they step up their game!", "author": "Lita T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-25", "description": "My family and I throughly enjoyed our Christmas meal here. The lights were low, appropriate Indian music was playing in the background, the tables sparkled with white tablecloths and tiny lanterns. The waiter was both wonderfully professional and personable. And the food was amazing!\nWe'll be back.", "author": "Dixter D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-11", "description": "We came here on a Saturday for the lunch buffet and I was surprised that we were the only patrons. The food was fresh and hot and they had a great selection of dishes. The taste and quality weren't spectacular but they were very good. I'll definitely be back.", "author": "Diana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "The food is great here is service is excellent. I don't know what is up with the low rating.", "author": "Cisco R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "I really liked this place. There is a nice ambience in the restaurant, our waiters was nice and friendly. We had 3 dishes which were all delicious. I will be going back here again. It's a really good local spot for Noe Valley. I'm surprised there aren't more customers there.", "author": "Neil L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-26", "description": "My boyfriend and I ordered delivery from Clay Oven and could not have been more disappointed with the experience. Our estimated delivery time was between 5:35 and 5:45pm. At 6:30pm we called to check in and were told that our food was on the way and should be there any minute. The food finally arrived at 7:15pm at which point we learned that the restaurant was more than an hour late in preparing the food. We called back to speak with a manager about the experience and were hung up on twice. Extremely disappointing experience. We will not be dining with Clay Oven again.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "It was an awesome experience which i couldn't forget  the taste of clay oven in my life and the way of approach was i can just say WOW........\nI want everybody to try atleast once.....", "author": "Rajesh P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "Not crowded, music in the background, white table cloth, $10 brunch buffet style is very good. I am a happy camper.", "author": "Magda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "I have been to lot of Indian restaurants..this one is special.. The best punjabi food is served here period. Very friendly staff and good ambience.", "author": "Rajessh P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-17", "description": "This place is beautiful!   I walked in and thought wow this is probably expensive.   Today's lunch buffet was only $9.99!  After eating the food I realized why.   The food was set up in copper pots and looked beautiful.   But I'm very picky when it comes to Indian.   The Pakora was cold and a little greasy.  The rice was cold and a little hard.  The chicken tikka masala was delicious.   Tasted more like butter chicken which i actually prefer but it had a lot of bones.   It was fresh and really hot so it heated the rice. \n\nThe restaurant itself would get  5 stars but the food was definitely a 3.  Good but nothing to really write home about.   Can't complain though for $9.99.  My husband is the easiest man to please so he'll tell you he loved this place and the food was delicious.  He ate 3 plates.  Again I'm a little more of a critic.   I'll probably be back.  But I will try a few more Indian places in SF first before I go back.", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "So good. Their buffet is a very reasonable $13. The chicken tikka masala had a ton of chicken and tasted great. They even have the buffet on the weekend (11-3) and it was empty (I have no clue why)", "author": "Mike Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "This place has been our weekly takeout locale for the past few months. We had stopped coming here earlier in the year, due to mediocre portion sizes. That has all changed. Portion sizes are extensive, providing meals for a family of 3 over several nights. We go with our usual, Chicken Tikka Masala, Chicken Korma, Saag Paneer (fantastic!), regular naan, and cheese naan. All of it is delicious. If you're looking for a some delicious indian cuisine, especially for takeout, this place fits the bill.", "author": "Steve R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-06", "description": "I come here often and like it very much. Service is great and so is the food. A great place to grab lunch and hang out with coworkers or friends. The setup forces you to sit next to strangers which can lead to interesting conversations and meeting new people! Some of the servers are really good others are a little lousy but overall it's a great place to grub.\n\nBecause it's an interactive scenario with you cooking your own food you'll want to be ready to do so. They will walk you through the first few times and eventually you'll become a pro. Per our server's recommendation I ordered the naan and I really like it; it was hot and fluffy with just the right amount of crisp on the edges. Then I got a Chicken Tiki Masala and it was as good as the naan. You'll definitely be satisfied at the end but everything here is really light so you'll be ready for dinner later in the day.", "author": "Pocho G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "My whole family loves this place. We eat in or order to go every week. We order chicken tikka masala, mild for the kids and chicken mushroom for me. \nTip for  to go orders- ask for rice containers so you don't get your hot food in plastic containers. It is a bit messy but worth it to skip the plastic chemicals leaching into the food.", "author": "Anne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "This place was delicious! The tikka Masala and naan was sooo good! We came here late at night and the food was exceptional. We ordered off the menu and not buffet. The complexity of the flavors did a happy dance around our tongue. When I think of Indian food I think of this place!", "author": "Laura R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-14", "description": "Not authentic Indian food - not even close! We ordered from here for the first time and were extremely disappointed. My lamb jal-frazie tasted like a backwoods beef stew and the naan tasted like cardboard. \n\nWe threw everything out after a few bites because it just wasn't worth it. You can't say you're an Indian restaurant and have food tasting like that - it insulting and wrong.\n\nTwo stars since the service was fast and polite, but 1 for the food. Will not be ordering here again.", "author": "Zachary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Everything was very hot. Very flavorful for \"medium\" spicy, just right.  Had samosas, m.soup, chicken biryani, riata, Kashmiri nan.    Very happily pleased since 3-4 months ago food not as good.  Hope food stays this good.  Waiter very nice and attentive.", "author": "Stan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-16", "description": "Ding, Ding, Ding... we've got a winner here. I can't vouch for everyone's experience, but my dinner was great! My friend Rosy and I were craving it and wanted to try out the Clay Oven in my neighborhood. Wasn't too sure about the prices before we stopped in but the decor is nice and the place was not too crowded. The place is pretty reasonable for the quality of food and service.\n\nWe ordered the Vegetable Samosas (2 per order and very big), the Chicken Tiki Masala (Very, Very, Very good), the Sag Paneer (a new one for Rosy and she loved it!!!), two orders of Rice (fluffy and good) and some regular naan fresh out of the oven.\n\nThe food was incredible, we left feeling very satisfied and loved this place.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "I love Clay Oven! They have such a friendly staff and I can't get enough of their garlic Naan Bread with Chicken Tikka Masala.", "author": "Gabby B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-25", "description": "I love India Clay Oven in West portal. I don't know how the restaurants are related but the only time I've been happy is when I get my order from West Portal.\n\nTonight husband \"accidentally\" picked the top google hit for India Clay Oven and ended up getting GruB Hub for ordering. They said the food came from India Clay on Church.\n\nMy Hyderabadi Chicken, though decent sized pieces, was tough and had  had ZERO Apricot's in it, not like what I'm used to. Yes it's not fair to blame one restaurant for not being as good as another but I do want to warn folk they are not INTERCHANGABLE. My husband's Lamb Jal-Frazie was good he thought, but we both agreed though having chosen mild, it was more like medium. Fine if  you want medium spice.\n\nAs our order didn't arrive until 1 hour and 30 mins after we ordered online via Grub hub. Indian food spiced medium-ish at 10:30...only if you are young or don't mind eating Tum's all night.\n\nOne thing better at this location, the N'aan is much nicer. More generous pieces and nicer texture, less grease. I wish I could have their bread at the other location but at the end of the day, the entree trumps all.", "author": "Susan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-11", "description": "Delicious food but this place was deserted on a Friday night.  My only complaint is that you have to pay for every little thing: rice, naan, raita. I usually order a veggie thali when I go to indian restaurants but this place only offers it for two @ $43.  Let's face it: these ingredients are not costly, rice, lentils, flour.  I guess they're charging so much to pay the rent.", "author": "Pat P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "I really like this place.  The restaurant is really nice; great ambiance.  Owner/staff super nice.  Never had a bad experience.  I get a lot of take out.  It is really solid.  Nice neighborhood gem.", "author": "Zachary P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Very nice people and great food and service! My husband and I go to St. Paul Church across the street, so we'll be frequenting this cute little Indian place more often!!!! The owner is a gem!!! So nice, great service, great prices and delicious food, chai tea and mayo lassi! The owner even gave us a free magi lassi just because!!! :)", "author": "Bridgette P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "Great neighborhood Indian place. I usually order for takeout or delivery but have dined in, too, and the staff is always very kind. Clay Oven does a lot of to-go/delivery orders so getting a seat to dine in has never been a problem. They'll really do your food up spicy if you ask, so request it!\nSolid neighborhood spot.", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-06", "description": "Not sure why people hate on Clay Oven. The food is amazing & these people are nice. Like, too nice. There's this lady that lives in my neighborhood that is straight crazy...or \"eccentric\" if you're being gentle. She looks wealthy, loves to eat out alone & on some days is very nice & chatty, on other days, she's walking around leaving monologue style messages on friends' (imaginary I suspect) voicemails with tons of curse words...and she's usually screaming. Anyway, one day she was at the Clay Oven losing her shit & they would.not.kick.her.out. It took them like 20 minutes to make her leave.\n\nAnyway, order the tandoori chicken, the chicken saag, the okra dish, or the eggplant & you'll be happy as hell. Definitely get rice. The pappadum is better than the naan. The yogurt sauce is necessary if you get your food spicy. They also make an awesome hot sauce if you ask politely. Hell, you can yell at them, they'll still make it for you.\n\nThe lunchtime buffet is often quiet & has amazing food & a good price. I think it's $12.99 to fat it out & eat enough for a weekday food coma.\n\nWhite table clothes, adorable serving bowls (copper), very clean bathroom, beautiful painting on the wall & lovely service. Seriously, like \"I can't date you b/c you're too nice\" nice.\n\nTIP: I've only ordered from them once or twice & it was delivered fine & on time, but they seem to have issues with that, so walk or drive to pick it up.", "author": "Stephanie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "The best second date place around. Tikka was fire af. naan naan naan was as buttery as Paula Deen.", "author": "Christine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-10", "description": "My husband and I live a couple of blocks away from Clay Oven so we have walked over for dinner a couple of times.  The food is quite tasty and we can always get seated.\n\nI think they may have a lunch buffet; they have a beautiful array of copper chafing dishes along the back wall.  The walls, in fact, are painted with a beautiful indian mural.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "We live nearby and love coming here every few weeks. We're often one of the only tables there so the food comes quickly and the service is great. We always ask them to make Paneer Tikka Masala (which isn't listed on the menu) and it's always delicious.", "author": "Max E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-03", "description": "The story of how I ended up eating here makes my experience more sad. If you don't want to read this rantish paragraph.. skip to the next one! So I was supposed to go to Kome Sushi Buffet with my friends but the line was ridiculously long. I was so looking forward to eating lots of sushi!! After awhile we gave up and tried to go to Regent Thai and found out it was closed since it was Christmas week ): EVEN MORE DISAPPOINTMENT. So lastly... my friend suggested Clay Oven. I like Indian food and all but after looking forward to all you can eat sushi, I was still pretty sad ): Anyways...\n\nWe came here for the lunch buffet. There were only two other tables of people when we got there. The selection included lamb, tandoori chicken, naan, curry, some kinda rice, fried fish or calamari (I forgot what it was!) and some vegetarian dishes. Everything was just okay. The food was pretty lukewarm... I guess that's expected since it's a buffet... but still it made the food worse than it probably was. My favorites were the fried fish/calamari/whatever it was and the naan. I feel like those shouldn't be favorites at an Indian restaurant. Well except the naan I guess. It's just that everything was bland and just average. I don't think I'll be coming back.", "author": "Sandra N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-11", "description": "Lots of good flavors here on previous visits but super bummed to find huge super long hair in our naan. Waiter didnt say anything as i pulled the very long strand out and threw it on floor. He just walked away. I tried to let it go and continue on with meal. Then when smaller eyelash or beard  sized hairs fell off naan I stopped. Spit out food into napkin. Realized that there was a strong possibility there hair in our other dishes. Grossed out. Got the bill...even had to pay for the hair naan. Won't be back.", "author": "h h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-31", "description": "I live right down the block from Clay Oven and have always wanted to try it. But I was a bit wary considering every time I walked by, there were very few people actually dining there. First things first, it seems like the majority of people who eat here either order take-out or delivery. So don't be dissuaded on that front. I chose the take-out option. Bonus: Only took 10 minutes for my order to be ready.\n\nAfter reading mediocre reviews that kept me away, it looked like they were on the up and up so I decided to give it a try. My order: naan, vegetable samosa, chana masala, and rice. \n\nMy barometer for a good Indian restaurant is the quality of their naan. Hot and fluffy with just the right amount of crisp on the edges. I'm sad to say that their naan was lukewarm and kind of floppy. If I had to guess, they need to let the dough rise more and keep their tandoor at a lower temperature so that the bread has more time to bake without burning. Veggie samosa: just okay. Also on the lukewarm side and the pastry shell was kind of greasy rather than flaky. Chana masala: I ordered it medium-spicy and I like hot things. This was maybe a shade too hot. Overall, halfway decent and the curry was just the right consistency. Rice: Pretty much your standard basmati rice. Light and fluffy...and they gave me some fresh green peas as a bonus!\n\nEnd result: The food is merely okay. I didn't feel the need to spit it out, but I also didn't feel compelled to save the leftovers either. The person who took my order on the phone was very nice and the woman who cashed me out was sweet, which counts for something. If you can find better Indian food in Noe, let me know.", "author": "Meredith D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "Yummm...y! The most delicious Indian food I've had in a long time! Simply amazing food, superb hospitality and a nice cozy ambience at a really low cost. True they say - Big things come in small packages.", "author": "Sanchita R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-11", "description": "Serious fail. I put anorder in Eat24 and submitted an order for delivery. The debit was taken and got confirmation. 40 min after the delivery time, I called the restaurant and was told they don't deliver to my address. Why was the order confirmed? Oh, failed to mention that I received notice that the order was on the way.", "author": "Dave C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-25", "description": "Vegetable pakora was delicious- delivery arrived hot and came with two dipping sauces, one sweet red sauce and a green chutney. Prawn biriyani was pretty good-- the raisins and nuts were plentiful, though the rice was a little dry. Biriyani usually comes with a yogurt sauce, but this one didn't. I loved the paneer makhni, it was my favorite dish. We would up pouring it over the biriyani to soften it up, which was just perfect. Delivery was fast, 30-40 minutes. I'll definitely order again.", "author": "Kaya C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-01", "description": "Delicious Indian food at reasonable prices. The chicken tandoori, masala and vindaloo are particularly good. So is the rice and nan. Everything served hot.\n\nGreat ambience, neighborhood and very friendly service.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-17", "description": "The service was excellent. The manager and the server/busser were absolutely cordial and welcoming. We went for dinner on a Wednesday night and had the entire restaurant to ourselves. They made us feel like we were guests in a friends house.\n\nFood is delicious, if served in very small portions.", "author": "Arturo G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-13", "description": "If it was possible I would give this place zero stars. Worst Indian food I have ever had. Made both my husband and myself ill after only a couple of tasteless, salty bites.", "author": "Angel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-04", "description": "Overall, I'm a fan or Clay Oven.  We lived a block down the street, and always enjoyed take out from here.  The food was always consistently delicious.\n\nThe staff get top marks for friendly, courteous, and good quality service.  The kitchen is within view of the dining room, which is nice.  My wife and I always remarked how impeccably clean the staff kept the restaurant.  Someone always seemed to be scrubbing the restaurant any given morning.\n\nIt's a bit on the pricey side, at least for take out.  The decor and ambience and a cut above the rest in upper Noe Valley, so maybe it's deserved for dining in.", "author": "Steve J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-28", "description": "We've lived in Noe Valley for three years and we're JUST discovering this place.... What have we been doing all this time?! The food is superb- flavorful, high quality meat, and authentic. The staff is friendly and professional. The ambiance is really nice as well. If you live in the area, this has to be your go to Indian restaurant.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "Usually, I'm not a big fan of Indian buffet, but, I must admit, the chicken tikka masala is some of the best I've had.  Not a bad place to go for a guy on a strict lunch budget with a big appetite.", "author": "Eric G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-01", "description": "This is my first review here on yelp and I post it just because I liked the meal at this place so much.\n\nI live in the area and so came for the lunch buffet. Had the Chicken Masala, rice and vegetables. The Chicken Masala was one of the best I had in the city. The complementary bread arrived hot and was delicious. And like others wrote, the service is great and the place is inviting.\n\nI would recommend trying it out to anyone in the area.", "author": "Moshe B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-13", "description": "I have been ordering delivery from this place for a couple of years, and up until 3 months ago was happy with it. But their delivery service has now become a joke. They used to have great drivers, and food would be delivered within 30 to 40 minutes, now between 60 and 90 minutes, and the guy on the phone is a joke. \n\nIf getting a delivery make sure you don't want to get it for an hour and a half and that you want it delivered cold. If you do you will love this place,", "author": "Dave O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-05", "description": "This review is long overdue. I discovered this location as an alternative to Toast (which is down the street). The wait for Toast was almost an hour so my group decided to see what was down the street and we discovered Clay Oven.\n\nThis review is only for their Lunch Buffet.\n\nI really enjoy the food that is offered for the lunch buffet. I like how they have a few vegetarian dishes along with the meat dishes. My favorite dishes are the Vegetable Coconut Curry, Lamb Curry, and Chicken Masala. For the price I pay, I always leave full and satisfied.\n\nMy only tip is to make sure you get their before 1PM at the latest. After 1PM, the freshness of the buffet food begins to waiver if they have not had a lot of visitors. I can't really complain because it only makes sense.", "author": "Jesson d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-20", "description": "Love the Food. \nLove the friendly service. \nDo not love being overcharged each time I get my bill. \n\nWhether we dine in or take out, we consistently find we are charged for items we didn't order, or there is a higher charge than what the menu indicates. The last time I pointed this out to Babu he said there had been a price increase. But it's not reflected on either the take-out or dine-in menu. \n\nAnother time, they gave me (and charged me) for 2 orders of rice, when I only ordered one. When I pointed this out, Babu said he wouldn't charge me for it. Yet there it remained on my bill, and I had to insist he delete the charge. \n\nI can't imagine the number of times my bill was padded before I started noticing.\n\nIt's a real buzz-kill, when you are trying to support a local establishment, and they purposely taking advantage. \n\nWe used to get their take-out every week or two. But after the most recent episode, we are boycotting them. \n\nI don't know how the other Clay Oven locations operate, but just keep a close watch on your bill.", "author": "Bonnie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-03", "description": "I've ordered takeout from here at least 10-15 times over the past few years. The chicken korma is delicious and consistent. Same with the goat cheese naan. I've only eaten in their dining room once or twice. The staff is nice but almost overly attentive, especially because the place is usually pretty empty.", "author": "Jasmine S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-30", "description": "2 1/2 stars\n\nI had ordered from this place a while back, and couldn't really remember what I had thought of it. Since I was sick of Zante's delivery screwing me over, I decided to give Clay Oven a try again.\n\nOn the plus side, they have online ordering which was quick and easy . The delivery was quick and friendly (unlike Zante's). And the food was package properly so it didn't explode all over the bag (a la Zante's).\n\nOn the down side, I had no idea Indian food could be so bland! I ordered two veggie dishes and was not crazy about either one of them. And the Nan was sorta dry. \n\nI might try again, because it seems like a friendly, well-run business--maybe I just need to find the right dishes.", "author": "Wendy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-13", "description": "I only order Chicken Tikka Massala with regular nan, yes I know I'm too predictive, but it is delicious!! \nFrom Clay Oven I usually order delivery, and its too expensive for the amount , and they are not very good to deliver on time over at Bayview where I live, they take forever, but in the end it is always delicious and just how I ordered.\nWhen I mean the size is too small, its a round container filled till the top with chicken and juice, mostly juice but good amount of hardened cooked chicken complementing the flavors... Size is 3 inches tall, by 4.5 in diameter, all for $12.95", "author": "Christina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-20", "description": "Wanted to give the place another shot after a terrible dinner. This time we tried takeout. Naan tasted like it was reheated. Even rice pilaf, something so basic for an Indian place, felt like it was a few days old. THere's a reason the place is empty all the time", "author": "Aravind R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-10", "description": "I came back here for some take out and was so disappointed! The samosas weren't flavorful whatsoever. Not sure what happened but I think I will need to switch to a different indian restaurant :(", "author": "Claudia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-31", "description": "No Love Here!\n\nIndian is our fav & we were totally stoked to see a walking distance spot open up.  Got take-out last night & couldn't wait to get it home & dig in.....but after 1 taste, it was apparent we'll have to keep on waiting for that Fab-Indian spot to open up.\n\nFood was completely MEH....Mali Kofta sauce looked & tasted like Chef Boyardee tomato soup...COMPLETELY SPICELESS;  Spinach - same; Garlic Naan was tasteless as well & stingy on the portion\n\nFinal straw....the Kheer was rancid (YES...rancid!) & we threw it out for fear of food poisoning\n\nWould like to think this was a 1-time snafu as they get settled in & might be willing to give 1 more try before completely dismissing but then again, this is a semi-chain (w/ 4 other SF locations) so the recipes should be the same no matter where you go....right?\n\nHmmmmmmm.........", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-10", "description": "Love their $10 lunch buffet. The selection rotates a bit, but you generally have a choice of grilled chicken, marinated lamb, chicken curry, salad, basmati rice, and variety of vegetable-based dishes, sides of various chutneys and naan. For dessert they offer coconut ice cream, honey cake balls (not sure of the name), and chai tea.\n\nI also love the music they play. Last time I was there, they were bumping a Bollywood song featuring Snoop Dogg! \n\nStreet parking can be tough here, but I like that t's nestled in a residential area. The meal is inexpensive, but the ambiance (cloth napkins, silverware, etc.) makes it a little more formal. Clay Oven is a great place to introduce friends and family to Indian food because their buffet makes it easy to try new dishes. It's cookie cutter, but the food is good and it's a great value.", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-22", "description": "I had better Indian food in Eastern Europe 15 years ago. Nothing about my dining experience was terrible, but I can't think of a reason I'd ever come back here.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-22", "description": "In three words:  Disappointing, doughy, and inexcusable\n\n--------\n\nService:  I placed an order via Eat24 at 8:36pm and the driver did not reach my door until 10:28pm.  (Estimated wait time was 45-60 minutes.)  Needless to say, super disappointed.  After telling the driver it's been two hours, the driver assured me it won't happen next time, and I confirmed that it wouldn't... because I will never order from them again.\n\nFood:  Ordered nan, rice, lamb jal-frazie, vegetable korma, and chicken tikka masala.  The only good dish was the chicken tikka masala.  The lamb was not tender and actually quite chewy, and difficult to cut into even with a dinner knife.  Nothing special about the vegetable korma, but it wasn't bad.  What surprised us the most particularly was the nan, you would assume that it would be fully cooked...not the case.  The bread was still doughy on the edges.  I had to stick it in the oven for a few minutes to actually enjoy it.\n\nTakeaway?  \n- Eat24 did their best to follow up with the restaurant--I totally acknowledge that it's the restaurant that's to blame. I checked on my order using the chat feature in the app three times, the first time being at 75 minutes... 15min out of the estimated 45-60 minute window.   I tried to cancel my order about 90 minutes into it, but to no avail.  I went all through Eat24, and my only direct interaction with the restaurant was with the driver.  \n- If possible, DON'T add tip (as a prepaid function on Eat24--tipping before service) to your credit card order, because this service was NOT deserving.  I happily add gratuity when the service is good, but this was unacceptable.\n- Apologies are appreciated, but had I looked closer at the reviews of the restaurant, I would not have ordered from this establishment.  Clay Oven is located 1.6 miles away from my apartment, approximately 6 minutes by car according to Google maps.  \n\nReally, there's no excuse, especially considering they've been a repeat offender on delivery and service with other customers.  Not an efficient business plan, especially when I'm spending over 50 bucks on take-out for two.", "author": "Justin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-17", "description": "Solid food! I wish there was a way to rate food, service and delivery time separately because this place deserves way higher than three stars for their delicious food. \n\nWe love our Indian food and this killed expectation. \n\nChicken Tikka Masala- YUM! Highly recommend \nChicken Vindaloo- hubby thought it was delicious\nNaan- Best part of the dinner, a great combo of crunchy ends and fluffy inside \nPotato and pees- good, but will skip next time\nSamosa - def skip\nPapadum(so?)- love \nTamarind Sauce- one of the best I've had\n\nService- 5 stars, super attentive and sweet. \n\nWe really loved it here and will def me back!!", "author": "Candace D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-17", "description": "I have been to this restaurant a few times before (due to the proximity to my home). However, every time I've had delivery they have been delayed. Today takes the cake! I ordered food at 6:40pm to have it delivered by \"promised\" 7:14pm on a Wednesday night but did not receive my order until 8:40pm. When I called to complain that my dinner guests were sitting hungry and upset, some man named Sunil refused to let me speak to a manager and offered to give me a discount without any details of how said discount would be attained. When I started to get upset, he patronized me and made me feel upset. I was extremely embarrassed that I had dinner guests over when I had raved about this Indian restaurant that didn't even get to taste the food (they had to leave prior to the TWO HOUR delivery delay). I will NOT be going back, and will ONLY be giving my business to Roti Indian Bistro, which is 2 miles away but gets my food to me within 30 minutes...not promised, ACTUALLY.", "author": "Teji K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-22", "description": "I was in town for the week, and found this delightful restaurant within walking distance of where I was staying. The server was charming, and welcomed me warmly. The lamb korma was tender and rich, and the goat cheese naan (the first I've ever had), was fresh and flavorful. I would go back again if I'm ever in town again!", "author": "Liz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "Cheap lunch buffet.\nDecent selection.\nPleasant staff.\nClean.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-24", "description": "The food is ok. Service also ok. But dont have much options.", "author": "Kunal P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Been eating here for 3 years. Great food and great service. The chai is delicious! The food at the restaurant is way better than the take out just because the nan and pakora get steamed by the packaging.", "author": "Abby S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "My neighborhood Indian go-to! Very good and sweet service. They have an amazing buffet lunch special for $10, incredible value. The take out is good and easy and the food is pretty tasty. Very convenient. I like it.", "author": "Sushi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-18", "description": "This has been the best Indian food we've found yet in San Francisco!  Only one small complaint, but we'll get to that later.\n\nThey brought us Papadams to start.  They were light, crispy, and delicious!  For appetizers we selected the Vegetable Samosas and Onion Bhaji.  Both were excellent.\n\nWe had two entries - the Chicken Tikka Masala and the Lamb Seekh Kabab.  I ordered the Tikka Masala with medium heat and thought it was a little on the mild side.  Not a problem since both were, you guessed it, delicious.  We ordered two servings of rice which were served in cute little silver buckets.    And two orders of Onion Kulcha - which was yummy.\n\nOur only complaint was that the Seekh Kabab was brought to our table about five to ten minutes before the naan, rice, and Tikka Masala.  It's not really something you can eat by itself, so we just stared at it until the rest of our meal arrived.\n\nIt's easy to get to the restaurant as it's right on the J-Church Metro line.  For those driving street parking shouldn't be much of a problem in this area.", "author": "Ed J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-25", "description": "I'm surprised this place doesn't have better reviews, I've consistently liked it. As an Indian-American I feel I have the right to praise or criticize Indian restaurants so here goes :)\n\nThis place has tasty food and good service. We actually just went with another (non-Indian) couple and all 4 of us really liked it. The food was fresh and tasted authentic, and without the grease that fills other restaurants' food. On top of that, it was a really good value and I appreciated the constant refills of water. \n\nThis is our neighborhood Indian restaurant and we'll definitely return. I can smell the garlic naan now...", "author": "S S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-20", "description": "If you don't have any taste buds, don't mind dry meat and have money to burn, this place could be fine! But if you want tasty food at a fair price, there are plenty of better alternatives.\n\nI wasn't pleased with ANY of the dishes. And for nearly $100 for 3 of us (no drinks), I think we could have done a lot better. Not the worst food in the world. But I've had much better for much less money.", "author": "Jon K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-20", "description": "I really want to give them more stars. The food is amazing, but the delivery times are too unreasonable. 2+ hours, about 90 minutes on average. I will pick it up myself next time. If you do have the patience, try the chicken saag. It makes it worth the wait.", "author": "Andy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-19", "description": "Table service was poor. The waiter, while polite, was simply not up to the job. He was inattentive to our needs, slow to respond and did not know the menu; dessert and drinks were particularly badly handled. Note that we were the only party in the restaurant and there were two small kids who were clearly getting antsy. We are fairly easy to please and normally not inclined to be critical of wait staff. Their main business at dinner, and their priority, seems to be take out. \n\nMain courses were OK (tandoori chicken, chicken tikka masala, hyderabadi lamb and palak-daal) but the naan was not the best which is bit of a deal killer in an Indian place. \n\nThe dining experience overall did not inspire confidence.", "author": "Anu G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-30", "description": "$10 lunch buffet, great music, and friendly service makes this one of my favorite indian restaurants.\n\nI came here with some girls I babysit and the waiters seemed overjoyed as usual to see the family and greeted them by name.  They brought out fresh naan for us and didn't charge us for the mango lassi.  The food is incredible although not as spicy as I usually like but the cheerful friendly service and experience more than makes up for that!", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-26", "description": "I really REALLY like this place as far as food goes but their delivery is THE WORST if you're expecting the food in the time frame they say, which this evening was forty to forty-five minutes, I have been waiting an hour and twenty-five minutes right now. You might be thinking that this is JUST a rare occurrence but I have given them quite a few chances and tonight is the last unfortunately. I called an hour and fifteen minutes into this current delivery nightmare and was told another fifteen minutes thirty minutes ago. So, if you want to go and dine-in here, this is your place. If you want delivery, I would pass. It's unfortunate because I really want to see them be successful. I'd give them four stars for the food but no stars for delivery. They get two stars tonight because I feel extremely guilty having to write this review as I'm an easy person to please. If you read this Clay Oven, you might want to rethink your delivery problems and see what you can do to not lose devoted customers like me.", "author": "Padric M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-10", "description": "I ordered from this location by accident today instead of the one on Clement street and it was a huge mistake. The lamb in the lamb tikka masala was burnt and dry, the naan barely had any filling at all, the sauce in the chicken curry was extremely bland, and the chicken was very dry. The only decent things were the samosas and the sauce for the tikka masala. I'm really disappointed since the other locations I've ordered from have always been delicious.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-26", "description": "My work has occasionally bought take out here for meetings, etc and I've always really loved this food. I'm basically addicted to Indian food, and what that means is that I've eaten a lot of it.\n \nI had a night to myself recently and I wanted Indian food, but someplace new. Even better would be someplace that I already know is good, so here I went.\n\nI walked in and was not expecting what I saw at all. It's a nice place. Much nicer than I'm used to. Tables clothes and a variety of silverware was on the table. I'm pretty much a fan of the dives that serve food that's so good that everybody can get over how nasty dirty the bathrooms are and that you have to get your own silverware and napkins. Needless to say, the bathrooms were just fine.\n\nI ordered spicy food and it was fairly spicy. It certainly had a good kick, but it didn't pop my ears or anything. I ordered samosas and they had this spicy chutney that was the bomb. Awesome.\n\nI had a really nice experience here and spent more than the dives that I'm used to. But I had a nice glass of wine and great service. It was a good night.", "author": "Erica F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-05", "description": "As an update to my review earlier this year, we ordered take-out recently and everything was top-par. The curries are no longer watered down, they are delicious and spicy, and the samosas are a new favorite. I'm happy to see them turn around, kick ass and make some delicious Indian food!", "author": "Jamaica D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-11", "description": "The food was good, the cockroach I shared a table with was not. Nor did they discount our bill. They also brought us an unrequested double order of nan and charged us for it. Maybe they realized we would not be back. \n\nToo bad too, because the chicken that came out of the, I think he said 1000 degree, oven was really tasty. I also felt secure that any insects would not have survived on that steaming hot dish. \n\nWhat did survive was a baby cockroach on the wall that was watching me from the new table our waiter assigned us to. Yick.", "author": "Elise B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-06", "description": "OMG so sad!  I moved into the neighborhood a month ago and tried this place out. Since it's one of the few restaurants in the little 30th and Church area, I wanted to LOVE. It's not a good sign when a Friday night around 7:30 pm, it was empty. Literally we four were the only diners for the first hour, and when we left there were maybe two other pairs of two. That, while kind of weird and sad, was fine because everything was delicious, the prices were reasonable and the service was great. They even gave us complimentary chai tea that was sooo delicious at the end of the meal.  So what's the kicker?  \n\nThe bill came, we paid, and were at that point so overfull we could barely roll out of there. Then, a cockroach crawls across the wall right over my friend's head. And we were sitting at the table right next to the kitchen. \n\nWe all felt instantly sick and there was not a fight over the leftovers.  I hesitated putting this review up because they seem like they want to make it work, and I want an Indian restaurant in my neighborhood, but guys, clean it up, please!!", "author": "Kari J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-02", "description": "I had an enjoyable experience the first time I went to the Clay Oven. The second time, however, was a bit creepy...as in creepy crawly.  Having lived in Asia for many years, I'm generally not put out by a little extra protein in my food, but in the fine culinary capital of San Francisco, it's utterly unacceptable.\n\nI went to CO on a bright sunny day and started to make my way down the lunch buffet.  Salad, check. Rice, check.  Fried thingy, pass. Lentil curry, hmmm, Veggie curry hmmm. All of the sudden, as I was contemplating my favorite veggie options, I saw something move on the wall.  Was my contact sliding out of place? No. It was a roach. Not an East Coast waterbug size or Asian flying roach but, rather a nice lean, Prius sized roach.  I didn't move, it kept minding it's own business. I did some quick math on the likelihood of my new friend finding it's way into my lunch and decided the possibility was remote and soldiered on.  \n\nI was going to mind my own business until I sat down at my seat and started eating my lunch, which was not bad, though parts of it were cold. Again in my peripheral vision, I spied the Prius' little brother--smart car sized--climbing up the wall.  Here I am YELPING!!!\n\nStay away until the hygiene police or the exterminator complete their next pass.", "author": "ai f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-26", "description": "In a word: Awful. Waited forever for my order to be taken. Waited forever for my food. It was not worth the wait. I know Indian naan can be a bit greasy but the chapati had pools of oil on each piece. The Coconut Lamb I ordered came in a tasteless orange sauce. The meat was poor quality - chewy and not fresh. Small portion too. To top it all off they charged me 3 bucks for the rice. Never again.", "author": "Chuck S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-11", "description": "Got delivery; the nan was soggy and inedible. Otherwise it was just sort of ok, not great. Won't return.", "author": "Travis N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-07", "description": "This failed on all levels for me. Placed the delivery order and noticed dang, pricey. Like $14 a plate pricey. Nevertheless I imagined that my spinach was hand massaged, free range, organic and possibly grown on the moon. How else could potatoes and spinach cost so much? I started to salivate.\n\nAnd salivate, and salivate, and salivate. Basically at this point I am laying in a pool of my own drool on the couch, dehydrated, and so hungry because it has been TWO HOURS since the delivery order was placed! TWO HOURS! on a MONDAY! I felt like one of my cats peeking out the window at the sound of every car door shutting but alas it was just the neighbors every time.\n\nFinally, my dude says \"let's just make something\" and at that exact second the food arrived. Victory! Hooray for expensive tasty food. Oh wait, this isn't tasty at all! Nan was cold and rubbery. Masala was covered in grease. I blotted 2 paper towels to pick it up - not creamy at all. Tastes just like the curry paste you buy at the market. And the spinach. Gooey, goopey with undercooked potatoes.\n\nNever again.", "author": "Allegra F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-31", "description": "First thing when you walk in - the smells! So good!\n\nThe Spinach Pakora - out of sight, delicate, chewy, crunchy. Samosas - spicy filling, just right. Vindaloo Fish = Salmon - mild flame-y goodness, also great for our pal who had a cold. Chai - I'm a tough critic - very good and served with honey (a plus) - spiced *just so*. Saag Paneer and Muttar Paneer - both dishes were flavored delicately and uniquely. I can imagine from our spread, that the meat and other seafood dishes would be equally well prepared!\n\nWould have been 5 stars if they had soy chai. E-mailed them. We'll see what happens. Making CO a neighborhood favorite.", "author": "Mark S. I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-30", "description": "I thought the lunch buffet was a good deal for $10.  They had many different dishes to try and I enjoyed the food.  My favorite was the tandori chicken and the rice.  Yes, the nan was tasty too.  \nThe lunch crowd was sparse today but that was a good thing for us.  Besides two other customers, we were the only ones there.  I'm not a big fan of Indian food but I would come again to eat.", "author": "Brent T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-28", "description": "Experienced delivery tonight. It was pretty pricey - $18 for 1 dish and rice to be delivered. They had a very hard time with the name of my street, but we eventually got passed that. I ordered Chicken Makhani. I don't know how it's different from Chicken Tikka Masala, but I don't care. It was pretty good. The sauce reminded me of the texture of Elmer's glue in the best way possible. I didn't like how they cut the chicken - lots of ligaments. But, I would order from here again, especially if someone else were paying.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-03", "description": "I went here for the Indian Buffet. I would like to mention, I LOVE Indian Buffet. There aren't too many places in the city that even do it. But I digress. This was tasty. really hit the spot. I wasn't the one who picked up the tab, but I thought it was a decent price for all that we had. \nOn another note. The dinner menu is a tad too pricey for my liking. That's a whole other review though. But I would recommend the lunch buffet if anyone is looking.", "author": "Jena D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-28", "description": "Their lunch buffet is great. It's probably the best Indian buffet I've had around SF - and I've tried a lot.\n\nThere were a few months when things went a little awry with their selection, but we were just there & everything's back on track. The food is delicious, the place is meticulously clean, and the staff friendly.\n\nIt's my go-to in the neighborhood. I've gone for dinner, too, which is quite a bit busier, and also quite nice.", "author": "judah m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-02", "description": "This is, thus far, the best sit-down Indian Restaurant in SF. It's quiet. You can always find a seat. And the malai kafta is pretty tasty. (East Bay has more/better Indian restaurant options.) \n\nDownsides: Parking can be a pain. It's a little expensive (tho' not unusual for SF). And decor is a bit dry.", "author": "O. K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-09", "description": "Indian food should never be bland.  Despite very courteous service, all three dishes we ordered were not good.", "author": "Ari O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-01", "description": "I'm always surprised that more people in the neighborhood don't support this restaurant. It's clean and has a nice atmosphere, great and attentive service. Love the food. It's one of our local go-to's.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "Delicious curries and tandoori; friendly service; clean and bright decor.  Great neighborhood feel with authentic food.  A fan!", "author": "Carlo A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-05", "description": "Have eaten here many times and the garlic naan is to die for! \n\nThis is a nice place to go to for a date or nice dinner during the week. \n\nThe service is always impeccable!", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-23", "description": "I just checked my delivery.com account and I have ordered from here 26 times.  Last night will be the last time I order from them.\n\nI look for two things in a place I frequent regularly, quality and consistency.  Over the past few months the quality and consistency have gone down considerably.  I order almost the same thing every time and lately those dishes don't resemble what I used to order or even what the order looked like the previous time. \n\nMy favorite dish is Malia Kofta.  It used to be really creamy and had a rich tomato flavor.  About 2 months ago it got really watery and started to have black flecks in it.  Last night it was yellow and thick.  Additionally there used to be cashews and or almonds in the sauce and cooked into the Kofta balls.  Lately they just started to put them in the sauce.  Now there is nothing.\n\nI used to count on this place as a sure thing.  Now even the delivery is spotty and late.  I've had wrong food delivered and had to wait two hours before... I only live 7 blocks away.  I could have walked there and had dinner.\n\nI went to Spicy Bite the other night and got their Malia Kofta.  It reminded me why I fell in love with that dish.  There was so much care in the dish; you could tell that they used so many more ingredients in the dishes preparation.  Spicy Bite does cost more but it is worth it.\n\nI wish Clay Oven could get their act back together, they really used to be so good.", "author": "Jeremy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "Very good food here. Ordered mild and got it spicier than I expected, but really just right. The coconut curry chicken is to die for.", "author": "Len M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-23", "description": "Hmm I`m a little taken back by the reviews here. I happen to always LOVE the food from here and we get it often.  Then again I have never actually been inside , my honey usually stops here after work to pick up dinner. \n  My only grip from this company is the \"SOMA\" location leaves large pieces of spice in the food which I hate. It`s not pleasant to byte into it.  Other than that I love it.", "author": "Jack O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-08", "description": "Just came back from lunch - went with three others and we all had the lunch buffet ($9.95).   I was pleased, as was the other carnivore of the group, but my vegetarian (and picky!) sister and her partner were not impressed. \n\nOn the lunch buffet - a very pathetic looking salad, rice, deep fried fish nugget things, spinach with cheese (sag paneer, I think), lamb curry, tandoori chicken, another chicken dish, eggplant and and veggies, rice pudding and some other dessert.  \n\nI thought that everything was fine (minus the salad) and the spinach was ESPECIALLY good.   We had a friendly server who always kept our water glasses filled and even brought out a special drink for my baby nephew.   Oh, and they bring out oven fresh naan to go with your food.  YUM. \n\nOnly two things I wish were different - no lentil dishes were out on the buffet (I loooooove lentils) and also none of the dishes were very spicy.\n\nAll in all, I had a good experience, and would definitely go back for the lunch buffet again!", "author": "Amy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "This is a pretty high-end indian place on church street with cloth napkins and a low lighting and stuff like that. The environment is quite pleasant, the service is somewhat formal, the food seems to be of a high quality for the most part...and the prices reflect all of that. I could go to Zante's and spend a lot of less, but i'd be risking a stomach ache. After eating here, you don't feel like death! \n\nThe fish tikka masala ($14.95) is especially noteworthy-get this if you like salmon! It's actually surprisingly hard to find fish tikka masala on the menu of most indian restaurants, and that will be what I come here for primarily. The mango lassis and garlc naan are also good. I would say the sag paneer was only okay-needed some salt. The presentation of the food is nice...i like how the rice comes in little metal buckets.\n\nI've also never seen it too crowded...a good bet if you want dinner NOW and can't be bothered to wait.", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-05", "description": "Delivery for this place sucks. Waited 1hr40mins before the delivery guy was even near my house. I called the resto after an hour and they said it would be another 2 minutes and hung up when I told him I didnt want the food anymore. After waiting another 30 minutes they call back saying they will offer a discount, I turned them down and hung up. Once the delivery guy was at my door I apologized and told him I did not want the cold food. Will definitely not order delivery from this place again. Maybe one day I will give this resto a visit instead.", "author": "Judy Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-24", "description": "I reluctantly ordered rom them because they are just down the block from me and I'd like to really know the landscape of what's good and what's not.  People tend to be very hit and miss on Indian places - a place that I love a friend might hate and vice versa, so I figured with 3 stars on Yelp I should give it a shot.\n\nThe first thing that threw me was reading the recent reviews on here - A review from the user named \"Sirish\", which is no longer present after being reported to Yelp, contained the same exact paragraph about Saag being a healthier alternative, including the same weird broken English in the later paragraphs as the review from Nik C's below (who happens to only have one review... hmm...).  Clearly a bogus review, but I figured maybe the business had made some changes and wanted to bump up their Yelp rating.\n\nFast forward to a couple of nights ago, and as I mentioned I decide to order from them.  I got the following:\n\nChicken Pakoras:  Basic, unseasoned chicken fried in an unflavorful batter.  The tamarind sauce is the only thing that even remotely saved them\n\nLamb Saag:  I love lamb.  I love saag.  I usually get some combination of the two or the two together every time I eat Indian food.  The lamb was OK, but the saag was a disgusting pureed sauce, not even reminiscent of spinach.  It's like they put the entire dish into a blender\n\nKheer:  Respectable\n\nUltimately, I would've liked to enjoy their food much more than I did, but I was completely unimpressed.  The food was incredibly mediocre.  The delivery service was reasonably quick.  Ultimately, I'm rating them 1 star because of the incredibly mediocre food and the fake shill reviews.", "author": "David T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-04", "description": "I love the kashmiri naan at this place an the service is always great. Takeout is amazing too!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-16", "description": "Delivery took an hour and 40 minutes. Their excuse..... \"you were so far away\".  If we were so darn far, they should not have agreed to deliver. Food was cold, we had to microwave everything. Bad service and mediocre food. Not ordering from them again.", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-29", "description": "One and a half hour later and no food, we called and they said oh he's already here a blatant lie,  so  I came here to see if other people had this problem as well, seems like no one should be ordering from this place, thanks for nothing, and I don't care if you already made the food and its on its way, tell your driver he can enjoy it, and thanks for hanging up on us, when we tried to cancel. Hmm and it seems just as I'm writing this review he has called, it is now 1 hour and 40 minutes since we placed the order, he offered to give me a discount, I told him I didn't want it and said bye, he called back again and offered it at half off, \"no thanks, I already ate, I don't want your cold Indian food, you can eat it yourself\" He let out a sigh, it seems like he is finally done calling, Enjoy your meal, and have a safe drive home guy.", "author": "Bruce W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-30", "description": "I generally like this place - in fact - their lunch buffet is quite good w/many selections. \nTonight, however, my BF and I had an early dinner and the chef had to start cooking again. Halfway through our rice with potatoes dish [no potatoes !] a big, black, dead fly was found. Yuch! \nThey did not comp us the rice dish. [bad marketing!]............instead gave us 2 complimentary rice desserts. I could have done without the extra calories for sure, but I love this stuff. \nI'll go back - but will check the food carefully first.", "author": "Carol S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-16", "description": "Sometimes it takes anger to bring a dude back from Yelp sabbatical.\n\nWe ordered at 5:38pm. After three calls to Clay Oven HQ, the driver started calling to tell me he was in Noe Valley. I live in Bernal Heights.\n\nAt 8:11pm, unable to guide him safely to my house, I told him to stay put, got in my car and met him at a bus stop.\n\n\"Man, didn't they give you a map?\"\n\n\"Yes, I have map.\"\n\nAha. The food was cold. I imagined it warm, and it was still uninspiring. Bobby choked on a bay leaf.", "author": "andy d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-24", "description": "Warm, clean, inviting, brand new location of this local chain of upscale-ish Indian restaurants.  Portions are decent, presentation nice, service friendly.  Prices are $8-14 per entree, and two or three of those plus some bread, rice, or appetizers will fill two people up and send you home with leftovers.\n\nThe food was fresh and decent enough but it tasted squeeky clean, not very complex or subtle   You know how it tastes when you brown something on a clean grill or a cast iron pot that isn't seasoned yet?  Like that.  I would give them three stars but it was their first week in operation, before the official opening, and I want to give the kitchen the benefit of the doubt.  Hopefully things will settle in.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-22", "description": "We ordered take out consisting of 3 kinds of bread: naan, pratha, and chapati. The breads had been made so much earlier in the day they were just kind of rubbery and not much taste difference between them.\nWe ordered the Traditional Lamb Curry, the Chicken Do Piaza, and the Bengan Bartha. Sauces seemed eerily similar between the chicken and lamb, the eggplant dish was pretty tasty.\n\nThe raita was a watered down mess. I love raita, but it is the worst prepared item on most menus - truly watery with little flavor.\n\nThe mint sauce was good - but why do I even have to pay for those tiny little sauces?\n\nNot sure this is worth running back to.", "author": "Mariangela S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-08", "description": "Got take-out from the clay oven (noe valley location) last week, and was disappointed.   It wasn't delivered in a timely fashion, seemed very overpriced for the food portions I got, and there was even a piece of glass/hard plastic in one of my entrees.  I probably won't get take-out from there again.\n\nTo be fair, this review is only for take-out from the Noe Valley location.  The dining-in experience might be better, and it might be better at different locations.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-21", "description": "Some of the worst table service I have ever encountered and I realize waiting tables is a hard job, normally I am fairly easy to please. \n\nThe Clay Oven waiter kept delivering our food to another table. I was brought someone else's check- fully paid with their credit card slipped inside, which freaked me out sine I am paraniod. I ordered a salty lassi and it was not salted so when I brought this to the waiters attention he came back to the table twice to clarify, then my salty lassi came out after we had eaten (he was kind enough not to charge me for it). \n\nThey forgot to service our dessert, we sat around waiting for the waiter to give us attention for maybe 25-30 minutes after eating, while we watched him clear other peoples tables and organize around us- then even after we finally got his attention, he slowly responded since the table clean up of empty tables seemed so much more a priority. \n\nI (female) was paying for the dinner and ordering the dinner and the waiter seemed focused only on talking with my male companion and thanking only my male companion. It did not seem to be a language issue as much as a cultural issue.\n\n\"Thank you sir\" \n\"Come again sir\"\n\"What would you like sir\"\n\"How is everything sir\"\n\nHonestly the food was just OK, but in the future I might skip this place just because of the frustration of dining here.", "author": "Shannon Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-24", "description": "I very much like this place. Very romantic lighting. Indian music playing which is a plus (some exotic restaurants succumb to the Top40 playlist). The food is great, and the mango chutney is actually the best I've had. I have yet to have a meal here that wasn't good.", "author": "Giovanna C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-30", "description": "We called in and ordered to go:\n\nChicken Corma, Lamb tikka-masala, Cucumber Salad, and Aloo Gobhi.\n\nWe were so disappointed to find out that even though the delivery was fast all dishes tasted bland, watery sauces, and lacking of flavor.  \n\nThe Chicken Corma tasted like they made it out of an old chicken.\n\nThe joke of the night was we paid $3.00 for the cucumber salad which was slices of cucumber covered with some spice that didn't add any flavor to the cucumber so it tasted like you took a cucumber out of the frige and cut it into pieces...\n\nYou can tell if the food was great if there's left overs and people are asking to take some home... In our case we had plenty of leftovers but unfortunately (I hate to throw away food) nobody wanted to take it home so we tossed it....\n\nOvreall we paid close to $50 for 3 people.  We all concluded to stick with our good old Indian restaurant...", "author": "Mr. La Linea .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-22", "description": "My family and I had a pleasant experience eating there. The foo we ordered was very flavorful  from beginning to end. It is a very quiet place. The waitress we had was very nice but very quiet. I asked her a question  and it seemed forever to hear her response. All in all it was a good experience as I said and worth going to. It's right off the J Church line if your taking public transportation which is nice.. Parking can be a bit tricky any ware in noe valley. Reasonable too!", "author": "Creepyfly G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-18", "description": "This place has decent food.. and I will Never order from them again. I made the mistake of taking them up on their delivery service. After calling in and waiting for 1 hour and 20 minutes we were told that they had had trouble finding a driver and that the food would take another 20 minutes, that's .. count it..an hour and 40 minutes The worst part is they weren't the least bit apologetic. Turns out they have that retarded mall cop syndrome where they can act like complete idiots and be proud of it. All in all, the service here is beyond dismal. If you want good indian food without the disappointment go to Punjab Kebab House and spare yourself the frustration of this place.", "author": "Shreya C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-14", "description": "For dinner the other half and I decided to drive down Church St. and see what we felt like eating (neither one of was in the mood to take charge). We found parking right out front, Indian tonight it is.\n\nWe ordered chicken masala, lamb and chicken korma, saag paneer, tandoori mixed grill, nan, and basmati rice. Seasoning and taste wise everything was delicious Although the chicken korma I felt was over spiced and the saag paneer is suppose to have chucks of cheese, we had only 3. Although the presentation was beautiful especially when they serve the rice in copper pots. Huge portions, we had enough left over for the following day.\n\nThere's a bar off to the side and looking at it I have to assume it's only for wines since I didn't see it stocked with the vodka, gin or other hard liquor.\n\nWalked in and was greeted and seated immediately. Candles were lit for a romantic feel as Indian music played in the background. The walls are a warm curry color with beautiful painted murals in the shape of windows as if you were looking outside. There were few tables for outdoor seating. Service was prompt and friendly. The prices are about $12 each but remember the portions are big.", "author": "Lola L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-25", "description": "Bunch of friends met here for dinner. Everyone liked what they ordered.\nMy Tandori chicken so good-not dry. Vegetable Korma to die for!", "author": "Alan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-19", "description": "I am really confused by the reviews here. \n\nFirst off, reviewing a restaurant that's just opened is like shooting fish in a barrel --- a cheap shot. Of course, things will not be systematized and timing will be off.  It takes awhile to get everything working together. \n\nAlso: A lunch buffet would only be perfect on weekends (hey, don't you ever work?) \n\nQuality/Bargain: We had the coconut lamb curry and the tandoori chicken --- both excellent  and just hot enough at medium hot --- with basmati rice, cucumber, raita, nan and mango chutney and we spilt a 22 oz. Taj Majal beer.  The total dinner for two came to $36 and change.  We had to double check it.  Hey, that's what we normally pay, each of us!  I love Roti's Indian cuisine, but the check there is more often nearer $100 than not.  \n\nAtmosphere: Pretty pretty pretty! Elegant and romantic. We came late, so no screaming children  [N.B.to one reviewer:  A good way to avoid them is to dine later, like, you know, European adults.].  Positive sign: one of the other tables had real live Brits eating there, which we took as a good sign, as Indian cuisine is as ubiquitous in London and in England generally as Chinese is here.  \n\nService: Staff was pleasant enough, yet formal [Big plus for not telling me your name and stating the obvious i.e.,  that you'll be our server tonight] and the food didn't take forever.  \n\nAs a hoodie, I was thrilled to find that they also do their own home delivery, not Waiters on Wheels.  \n\nA real find.  We'd go back in a New Delhi minute!\n\nUpdate: went back with friends. They loved it, too.  Recommended: vegetarian appetizer platter $5.95 --- what's with these great prices?", "author": "Tony S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-28", "description": "BEWARE OF OVERCHARGES & DOUBLE-CHARGES!  Several of the reviews on here talk about how much more expensive the prices are at Clay Oven.  Maybe they've just been scammed like we have.\n\nWe just returned from our second visit, and it's not likely that there will be a third.  We specifically asked for ONE order each of pappadum, rice, and  naan.  When TWO orders of each came out, we sent back the second.  However, this was conveniently forgotten when the bill came (just like the first visit).  We were also constantly being \"upsold\" on everything in a very annoying way.  Too many expensive suggestions & add-ons.  Finally, we were overcharged on one appetizer and one entree.  I'm sure that was a \"mistake\" too.\n\nWatch out especially for the waiter with the bad hair color (reddish).\n\nWe felt like we were treated like dollar signs instead of patrons. (By the way, the best service we ever had at an Indian restaurant was at Sultan on Taylor Street.  Great food, too.)", "author": "melissa o."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-29", "description": "I like the food at this place even though it's pricey for Indian. However, tonight, not feeling well, I decided to order delivery. I've been waiting for nearly two hours. Even if it's Friday, two hours is outrageous when I live five minutes away.", "author": "Zsuzsanna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-04", "description": "With the end of Bombay restaurant's lunch buffet, I was happy to walk by a sign for India Clay Oven's lunch buffet on Church. There seems to be a dearth of these lunchtime options in SF, vs south bay, where I have my favorite haunts. Buffet is $9.99, and featured lamb curry, saag paneer and chicken tikka masala, and hot naan at your table. They charge $2 for a cup of chai, and I was surprised there weren't any daal choices- yellow and brown lentils are always fave buffet items for me. Service was adequate but not very friendly. Personally, the chicken tikka masala is better at spicy bite on cortland and mission,and I prefer the $1 chai at pakwan, or better yet to have it included as part of the buffet. Still I'm happy to know there's a buffet option close by, with reasonable prices.", "author": "Monty L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-16", "description": "I cannot believe that this place has gotten the \"Best of the Bay\" awards.  It is very average Indian food.  I ordered Chicken Tiki, Mater Paneer and some nan just to try this place out.  I ordered for delivery - delivery took a little too long.  The food was fine but, I was expecting more because of the awards it had received.  I think it is quite pricey for what you get as well.\n\nI have had a lot of Indian food in different cities and this by my tastes is only average.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-06", "description": "I finally found place to go to if I want to feed my Indian fix.  The buffet spread was fine.  Everything tasted good including the desserts.  What blew me away was the ambience.  The place was nicely decorated with a lot of attention to details in the table setting.  It looks like they use real china for their plates!  For the inexpensive buffet lunch price, well worth it.", "author": "May B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-21", "description": "There are three Indian restaurant options for folks living in lower Noe Valley - Zantes, Spicy Bite and now Clay Oven. Clay Oven has probably the best dining experience. \n\nThe interior decor is beautiful with artistic murals on the walls. The staff is friendly and courteous. Old hindi music tunes. Oh yes...there's also the food.\n\nFor a vegetarian like me, options are bountiful in Indian restaurants. I especially love the Aloo Parathas (Pancakes stuffed with spicy, mashed potato). I have made so many trips for them here that the chef must have surely perfected the art. They have a good spread for buffet. Love the Okra curry and the dal (lentils). Their masala chai has slices of ginger in it and their after-mint/fennel top quality.\n\nThis place is still undiscovered, I have found myself being the only person in the restaurant on several occasions. I want this place to thrive so I can continue to eat here. \n\nCONS\nIndian Pickle - $2. Whaaa?", "author": "Maneesh S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-09", "description": "Yes, this place is expensive. Dinner for four cost $90. Yikes! We would've paid half as much at, say, Al Hamra or Pakwan on 16th Street in the Mission. However, we enjoyed the atmosphere, and the food, while not the best in the world, was all right. Skimpy portion sizes.\n\nPapadum: Should've been crispier, seemed slightly soggy. Naan: Cookied unevently? Not moist 'n' fluffy enough. Rice: Good, served in individual copper pails, but $2.25 a pop is beyond ridiculous. Chicken tikka masala: Properly yummy sauce, not nearly enough meat, even worse than usual (few places provide enough, really). Fish tikka masala: Delicious! With enough fish! Best dish of the evening. Bengan bharta: Nice texture, fairly one-dimensional. Aloo saag: Ditto.\n\nWe had to wait a while before someone came to take our order. However, at the end, a man kept coming by and checking to see if we'd paid. And the staff were very eager to sell us more beer.\n\nPluses: It's near home. They deliver. The food is mostly okay. Minuses: Price! General attitude.", "author": "Tara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-04", "description": "We went to the Clay Oven on Church Street for dinner on New Years Day.\n\nFood:\n\nSince we were eating with my parents we asked for mild spiciness.  My partner & I ordered the Clay Oven dinner which had papadum & samosa appetizers, tandoori chicken, chicken tikka masala, boti kabab (lamb), saag paneer (spinach & cheese), naan, rice, keer, kulfi &  chai.  My parents ordered prawn biriyani (no raita), saag lamb, rice and basket of assorted naan.\n\nEverything was good and the presentation was quaint.  Some of the dishes were placed on top of the candles already on the table.  The rice had sweet peas in them and was served in a mini-bucket with handle.\n\nEnvironment:\nMusic was too loud.  Walls have beautiful murals on them, but reflect sound too well.  Even with the music, we could hear many sounds from the kitchen.  Very cozy.  Some of the chairs are comfortable.  Some are not.\n\nService:  \nOur waiters were very attentive.\n\nBar:\nA very small bar situated in the back on the side.  There were a few patrons who sat there.  My father and I had a beer so that might not be enough to warrant a complete review of the bar.\n\nOverall, I think it was a nice experience and we might go back again.  I can't comment on the delivery or take out service.  If we do order delivery, I will add to this review.", "author": "David J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-23", "description": "I live right near this place and decided to check it out a few months ago. I can't believe I went this long without coming here! The food is great and the staff is so incredibly nice. They make an attempt to get to know their customers and within a few visits they already recognized me and were very personable. Highly recommended!", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-17", "description": "I love my neighborhood Indian Restaurant.  Babu takes my take out order and is always so gracious and friendly.  The Chicken Tikka Masala is delicious and full of flavor.  Bhindi Bhaji Masala (okra cooked with chopped onions, tomatoes and spices) is one of my favorite.  Delivery is prompt and food is HOT!", "author": "Elizabeth F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-19", "description": "Pretty standard Indian Food.\nThey have a lunch special, around $8, the same price as a buffet at other Indian places.\nService is prompt and thorough enough to ask, \"How spicy?\"\nMy Coconut Lamb turned out to be a bit over salted.\nThe sauce was not as complex as I would have liked.\nI'll have to explore this restaurant a bit more.\nIt has potential.", "author": "Geordie E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-01", "description": "Despite the fact that there are 2 Indian restaurants within 2 blocks from my house, I was very excited to see Indian Clay Oven move into to the hood. The first time I went there, they had just opened and they didn't have everything dialed in yet. The food was cold, and the salad greens were brown. I would have given it a 1 star rating but I decided to give it another chance. I am so glad I did! The food was piping hot and spicy - just the way I like it.  My friend got a vegetable dinner plate - it was huge, no way one person could eat it all. I got the chicken tikka masala (creature of habit, I always get that). The only thing I didn't love that I ordered was the rice pudding - better to skip it and buy a pint of something on the way home.\n\nOne small nit - I am really not picky when it comes to wine but the wine list was awful, but then again  I don't think i have ever been to an indian food place with a decent wine selection.", "author": "Lynn G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-06", "description": "Gave it a second chance, they fixed their problems. Nicest service too, glad they are good again.", "author": "G. John E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-08", "description": "Good but not great, zantes & spicy bite ( bernal ) bombay  (castro) seem to be a bit better in taste and cost. This place is so close to my house, I can't complain too much.  The chicken tikka masala was ok, but the chicken Korma, was so much better. The masala had like shredded pieces of chicken, whereas the korma had chunks of tandori chicken\nThe prices were more expensive than their competitors, about 2.00 more a dish than the others.  \n\nAlso the biggest disappointment, their Nan was about 5 inches wide! Most Nan I've had are about a foot wide, their Nan was too tiny! About the size of a pancake!!!!", "author": "Pug P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "Confession:  My rating system sucks.  Maybe your does too.\n\nI gave Spiciy Bite four stars -- as does most everyone -- but I would never eat-in there.  At Clay Oven on the other hand, I've eaten in twice, liked the food, had good service, thought price was right... I'm giving it four stars too even though it's much more than my \"to go\" place a few blocks away.\n\nTry the Kashmir Nan.  It reads as if it's a \"Pop Tart Nan\" but it works like a chutney.  It's good.\n\nIn two visits we didn't have any misses w/ Cicken Tikka Masala, Tandoori Prawns, Aloo Gobi, Saag Paneer, Lamb Curry.\n\nWe ordered everthing medium hot on both occaisions and didn't really find much heat there so think \"hot\" if you want to be cautious between bites.", "author": "don d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-25", "description": "My husband and I are not experts on Indian food, but we found our appetizers, condiments and main dishes acceptable but not out of this world. We found the waiters to be sweet and attentive and we liked the atmosphere.\n\nThen we ordered coconut ice cream to share for dessert. And as we ate, we both looked up and said, \"I think this is vanilla ice cream with shredded coconut on it...\" We called the waiter over and showed him. He said, \"yes it is vanilla.\" (Actually a 'cookies and cream'-type ice cream). He took it into the kitchen and about 10 minutes later, the manager came out and said that he would be taking it off our bill, but that it was really 'mixed coconut and vanilla ice-cream'. A lie. A bald-faced lie. He was trying to save face by not admitting their 'mistake'. And I use the word mistake generously, because it's obvious that they were just trying to pull the wool over our eyes. Weird and very disappointing. I couldn't wait to get it off my chest on Yelp!", "author": "Ellen R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-18", "description": "Nice and quiet place for lunch. My vegetable korma was too salty. It would be much better without so much salt. My friend wanted to get something that was not on the menu, and they were able to accommodate her request and were very nice about it. \n\nYou need to request a separate lunch special menu if you're interested. Unless you ask for it, they will just give you a regular menu.", "author": "Mia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-01", "description": "I have not dined in at the restaurant - but, somewhat accidentally ordered delivery from this location. I was trying to order from the new West Portal location - but, apparently, they don't have delivery yet.\n\nIn any case - I used the online ordering option - which I love (for some reason, I just dont like using the phone). The site is a little clunky - not the best design - but, it got my order, and i received it pretty quickly (within an hour on a sat. night) - especially considering that I don't live all that close.\n\nI think the prices were reasonable and the food was good. Not outstanding - but, definitely good ... and, the convenience of delivery when you have two small children is awesome.\n\nI will be ordering again.", "author": "Karen G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-10", "description": "When a restaurant is called Clay Oven, my instinct is to try the tandoori, of course. And, our virgin night of take-out at Clay Oven did not disappoint completely as in some reviews below. We got the Tandoori mixed grill (it took 40 minutes to deliver, which is typical on a Friday night even in Noe). \n\nEach piece of shrimp, lamb and chicken was succulent, well-flavoured and I would definitely order this again. It was pricey if you go by the Indian-hole-in-the-wall standard of Pakwan and Shalimar which is supposed to be cheap. My one complaint for take-out was the very mediocre samosas which I consider a staple of Indian fast food/chaat/snacks. The dough was not crisp and came in on the bland side including the filling. \n\nWhich brings me to my observation during sit-down dinner last night: I was excited to see Palak Pakora (spinach fried in chickpea batter), but disappointed at the outcome. I really think that Clay Oven needs a new fryer or hotter fryer or something to that end. Even the Poori (a fried whole wheat bread) resembled a hot yet soggy pita. Not impressive. Cheese Naan was ok, but not enough cheese to hit me with that \"homemade cheese\" goodness.\n\nOur dishes: Shrimp Tikka Masala and traditional Lamb Curry were fair. The tikka sauce wasn't as rich as I usually have had, and the Lamb Curry wasn't spicy enough for my companion. Granted, he likes things spiced up, but when I tasted it it was very one-dimensional. Rice was good and came in the cute copper buckets--a highlight for my aesthetic sense. I ordered a kulfi for dessert, and it was very traditional which means while tasty and authentically tasty, it came sliced in blocks in a small bowl with spoon, a little difficult to eat at first. Once it began to melt, the nutty, creaminess endured and finished the meal well. Dinner for two with beer and wine was still $80 after tip.\n\nI live a block away so of course I'll be back. It's a decent addition to the nabe for me since I'm not real fond of the Thai place across the street.", "author": "E L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-25", "description": "I was psyched to see an Indian restaurant open in the neighborhood, even though there are two other Indian restaurants just a few blocks away on Mission. \n\nI came here for an early (5 p.m.) Christmas dinner, so the restaurant was empty. By the time I left, the restaurant had filled out more with some larger parties.\n\nI ordered the Garden Thali, which consisted of saag paneer, a vegetable samosa, yellow dal, papadam, rice, nan, raita, kheer & chai for $14.95. Everything was quite tasty - I liked everything that was served, especially the saag paneer.\n\nThe atmosphere was nice - clean & crisp interior, friendly staff. \n\nI'd go back again, mostly likely for lunch.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-20", "description": "DO NOT ORDER TAKE OUT FROM THEM.  Twice in a row we have been burned by them.  They say 40 minutes but it takes 1 1/2 hour to 2 ours for the food to arrive. both times we tried.  The second time we ended up cancelling and ordering pizza.  Sounds like the food is good if you eat in the restaurant but do not trust or believe there delivery estimate.  Way better and more timely Indian take out here in San Fran.", "author": "Stef S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-11", "description": "I ordered take out from them earlier today at 12:56pm, and I have still yet to receive my order.  I have checked twice with eat 24, and both times they checked with the restaurant and they said they would be at  my house within a few minutes...that was 30 min ago.  I am canceling my order and will never order from them again this is ridiculous, especially because I live several blocks away.", "author": "Kristen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-09", "description": "Pretty solid food here on our first visit. Clay Oven in San Mateo was always a favorite in high school but the other San Francisco locations have been a mixed bag (India Clay Oven received high marks for papadum and some of the best chutney around, but disappointed with a chewy, gamey lamb dish; India Garden had great ambiance but lackluster food; Tandori Mahal just never really impressed). Despite the less than stellar track record, we were enticed by the entertainment rewards coupon and the convenient proximity of the Noe Valley location to give the Clay Oven folks another shot. Although not blown away, we were pleasantly surprised with the latest addition to the Clay Oven franchise.\n\nThe samosas were nice and fresh, but the chutney (at least the to-go chutney) was not nearly as good as the stuff that had wowed us at India Garden a while ago. The navrattam korma was fine. Nothing special but reasonably fresh tasting and better than renditions we'd had at India Garden and Tandoori Mahal. The Boti Kabab was the hit of the night though. At $12.95, this dish is a bit pricey for the serving size, but was really excellent. Perfectly cooked, tender, juicy, and exquisitely flavored.\n\nI don't know what accounts for the inconsistency in the Clay Oven franchise, but hopefully the Noe Valley location will keep up the good work. A little pricier than Zante's and overall, pretty similar quality. We'll likely be back for the nice atmosphere and that amazing lamb dish. Definitely a nice addition to Noe Valley, and worth a try if you're in the neighborhood, but not worth a special trip, with the wealth of other excellent Indian food in other parts of the City.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-08", "description": "My fiancee and I love Indian and have been in the neighborhood for years without having tried Clay Oven.  We finally ordered delivery tonight.  Most of the reviews here about the price are pretty spot on--it's a little pricey for what you get; after tax and tip, we were in about $45 for nan, samosas, rice, chicken tikka masala, and saag paneer.  The food was good but not incredible--I'd put it on the same level as Pakwan.  But when you compare the cheapness of Pakwan's prices to Clay Oven, it's no competition.  Delivery literally took 20 minutes, so I was quite impressed and they earned points for that.  The portions were also on par with what I'm used to for Indian food, so I'm not sure where the other complaints about that are coming from.  All in all, fine, but nothing to write home about.\n\nPerhaps a word of warning: I love spicy food, but my fiancee not so much, so I went with medium for the spice level for our two main dishes.  Maybe I was off my game tonight or they misheard the order, but man, medium was definitely all the spice I needed!", "author": "Chris L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-18", "description": "Ok, this is probably the blandest indian food I have ever eaten, and I grew up in Sweden where indian food is far from spicy. Do yourself a favor and go buy a premaid Masala sauce from Trader Joe's and cook yourself some rice and it will be far more tasty than what you get served here. We ordered our food spicy and could not feel a hint of spice anywhere in the dishes. The only nice thing about the food was the chutneys we got served as an appetizer that actually had some flavor.\n\nThe decor looks nice and all and you are led to belive that you would get a nice meal eating here but your are mistaken. Unless you like indian food that is not spicy. Then you might love it.", "author": "Oscar B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-02", "description": "One word to describe this place: \"meh\"\n\nI stopped by for lunch today, and their food was solidly unimpressive. It wasn't bad, just not much better than the Tasty Bite pre-prepared Indian meals you can buy at Trader Joe's. The onion kulcha didn't seem particularly fresh, and while the curry was fresh, it had some sort of a stock spice powder that overwhelmed the more subtle flavors.\n\nTwo positives - reasonably priced for such an elegant place (about $10-15/person, including a mango lassi), and a pretty nice ambience. The staff was also pretty friendly, but not impressive enough to overcome the overall mediocrity of the food.\n\nIn summary - Clay Oven is worth going to if you're in the area and really want Indian food, but I wouldn't travel across the city for it.", "author": "Sekhar S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-10", "description": "As with other Indian restaurants in San Francisco, Clay Oven refuses to serve spicy food to white people, possibly to anyone at all, and so I give the restaurant a fairly low rating, despite everything else working out quite nicely.  My companions and I comprised a party of seven, and we had a large order, but all the dishes arrived in a timely and correct fashion, with the exception of the benghan bartha that my wife and I were sharing.  We had ordered it very spicy, and it was utterly bland, like all the other dishes.  The spiciest item we received was, in fact, the garlic naan.  The lamb saag ordered by another of my companions was pretty tasty, and the samosas and pakoras were all right, but the associated sauces were also pretty flavorless.\n\nOn the bright side, the service was extremely attentive, and we actually got multiple rounds of drinks, which has often been a problem at other Indian places, since finding a waiter after the food arrives can be difficult.  We lingered after dinner since the weather was cold and rainy, and the waiter brought us free chai tea, which was certainly a nice gesture.\n\nOn balance, however, I go to a restaurant for the food, and, on that basis, I just can't recommend Clay Oven.", "author": "Bitter J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-02", "description": "Two mamas and babies wandered in to Clay Oven for a late lunch and were greeted warmly by the waitstaff, who got us a table and fetched high chairs right away. We had the buffet, which was decent and tasty (particularly the chicken makhani) and relatively inexpensive, considering you can eat as much as you like. Both the babies loved the food, too, especially the saag paneer. We were in and out quickly, and the staff were cheerful about the fact that the babies had thrown food and cutlery on the floor and we weren't able to clean everything up. We really couldn't have asked for a better experience.", "author": "Beth W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-07", "description": "I ordered food online-it said the delivery time was 45-60 minutes.  I had already paid and my card was charged. \n\n I called them at 75minutes, \"yeah yeah driver left, sorry; it will be there in 5-10 minutes.\"  15 minutes later (now 90minutes) I called the online service.  \n\nThey called restaurant, got same story...offered me a 10 bucks off next online order and promised a 5-10minute delivery time.  \n\nThe online Assistant stayed IM until her shift was over 35 minutes later.  the online service refunded me in full.  the food finally arrived 2 hours and 15 minutes after it was ordered.  It was cold.  it is now leftovers because at the 2-hour mark I broke down and ate cereal :'(\n\nI guess this branch stays in business with walk-ins.  Do not, repeat DO NOT order delivery!", "author": "SD S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-05", "description": "We ordered delivery from this place at 7:45 and it didn't arrive until 9:45. Then when it did come, it wasn't that great- way too greasy. There are some restaurants that are a \"maybe I got the wrong dish\" kind of bad, but this place was a \"never again\" kind of bad.", "author": "andy f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-12", "description": "this is the best Indian food in the city. It is just that simple. Yes it is pricey, yes delivery is slow. But so what? You could have super fast super cheap Indian food--that was not authentic and did not taste excellent but why bother? \n\nthis is simply the best indian food in the city.", "author": "Vasile S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-13", "description": "We were on our way to Deep Sushi, but when we arrived it was closed for the week. :-(  On our way home we decided to try the Clay Oven and were pleasantly surprised.  We ordered one of their Dinner for Two specials.  The amount of food was ridiculous for $40 and we will be having leftovers for days.  The atmosphere was nice and quiet and the food was not too heavy-which I find to be a constant problem with Indian food.  \n\nAll-in-all if you're in the neighborhood, I would definitely give it a try", "author": "kathryn t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-20", "description": "We love this place! It's great quality food and delicious. We often order food for delivery and it arrives pretty fast.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-20", "description": "We were craving indian food and this is the only delivery I know in the area so we decided to give it another try. I even told the gentleman on the phone that we've had a disappointing experience but we'd like to give it another try. Alas, the results were the same. Proof that some people just shouldn't try the restaurant business.", "author": "Reza E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-11", "description": "Not very good at all.  Ordered delivery and it sucked.  The samosa were like mashed potatoes in a greasy shell.  The naan was chewy as if it were undercooked.  The lamb rogan josh wasn't very good.  Usually the sauce is savory and creamy, this wasn't like that.  The punjab chicken was as spicy as ordered and the best thing we got.  I also ordered a side of rice pilaf, which I expected to be a basmati rice w/ saffron, cardamom and peas.  What I received was mushy, overcooked white rice w/ peas.  That is crappy.  There will be no additional delivery orders and the quality of food doesn't make me what to go in to the restuarnt either.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-05", "description": "The food here is less oily than many of the Indian restaurants in the bay.  Their masala sauce is good and a little sweet.  The paneer was tasty and generous.  Another favorite here is the palak dal and garlic naan.  \n\nThe atmosphere and cleanliness of this restaurant is also superior to their competitors.  This is one of the better, not as \"fast foodish\" as many SF Indian restaurants, and therefore, is a little pricier than average, but I also can tell they are using higher quality ingredients.", "author": "Carla K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-07", "description": "Delicious, spicy, addictive food! The fish tikka masala is a must to try!", "author": "ralyv v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "i'm an ok student.  not great, not bad.  for most of my academic life, the problem has been conduct.  no matter how hard i tried to sit still in a chair and not talk to those around me, i always got a D in conduct.  luckily, in college they don't grade you on conduct.  for the first time in my whole life, i got all A's (actually, i got 1 A-, but i'm not counting that).  i asked the old man for some money for all those A's, but instead i got dinner at clay oven.\n\nwe got takeout before game 1 of the NBA finals and ate in front of the tube.  we used an entertainment coupon for 25% off entire bill.  food was pretty solid.  we got veggie korma and a lamb special that was really good.\n\nif i get all A's next semester, i want to go somewhere fancier and i want cash.  50 bucks an A sounds fair to me.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-18", "description": "Flavorful indian food, rich & spicy chai, and a cozy dining experience await you at Clay Oven. I have enjoyed the lamb tikka masala and saffron flavored basmati rice here many times. This place is great for a date during the hectic work week. I also enjoyed carrot pudding here with my Mom when she was in town visiting. The staff welcomes everyone.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-18", "description": "Chicken Tika Masala was great. Rice was horrible. Mushy overcooked rice, maybe its because we were the first dinner customers and got the lunch batch. Had them remake the rice, by the time it came we were finished with the meal. An Indian place that will serve overcooked rice to its customers, not coming back.", "author": "Gene K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-29", "description": "let me start by saying that i really, really wanted to like this place.\n\nbut i didn't.\n\ni was so excited to have an indian restaurant open in the 'hood and when we saw the sign, we went to dinner there the same day.  it started off well - we were seated promptly, had our order taken in a reasonable amount of time and our appetizers served relatively quickly.  then it all went downhill.\n\nafter an hour (!) of waiting for our entrees, and having asked for them a few times, we were ready to walk out the door.  the table next to us was asking the manager where their food was, and we overheard people a few tables over asking why they hadn't gotten their apps after 40 minutes of waiting.  the table next to us, who had ordered a good while after us, got two orders of chicken tikka delivered when they only wanted one.  i had a feeling the other one was ours, but it went back to the kitchen.  \n\nwe were literally grabbing our coats to head for the door when our food finally came with no apologies.  and cold.  and not very good.  the manager asked us, \"so, how is everything?\"  i said \"cold.\"  he walked away.  hmmm.  not the response i was looking for. \n\nwe took an order of aloo gobi to my sister - not because we wanted to subject her to the food, but because she was starving and we had promised.  five minutes after we dropped it off, she called me and asked, \"how does something manage to be hot, spicy and flavorless all at the same time?\" \n\ni'll give them a very small benefit of the doubt since they've only been open two weeks, but i'd wait before trying it out.  1 1/2 stars.  i would have given them two stars if it hadn't cost $60 - without alcohol.", "author": "Eryn K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-02", "description": "So so so bad....I actually joined Yelp just to write how bad this was. It was New Year's day 2008 and I was excited to start the new year off right , rent a movie, hang out in my pjs, and enjoy some indian delivery. it was awful. worst indian food i have ever had....and i love indian food! NOTHING we ordered was even remotely okay. DO NOT GO HERE!", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-16", "description": "I really like this place.  Maybe I'm desperate for good Indian food in my hood, but I think I've gotten over that enough to give an even review.  The owner and staff are really friendly.  I find the food tasty and flavorful.  My only issue is that while the protions are large (especially take-out), the prices are a bit high.  Soooo if you're ordering and want the typical variety of three dishes, you'll be spending quite a bit...and getting a good amount of leftovers for the next day.  I'll survive.", "author": "bill k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-05", "description": "Unlike the other reviews, I had an excellent time when I went here, however; this was on a weekday night. The food was some of the best Indian food I'd had and the service was decent. It's not very cheap (nor expensive), but you get your moneys worth. I'd say try it out on a less busy night, and dine-in here don't get delivery.", "author": "Annie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-30", "description": "My husband and I liked it.  Food was well prepared and tasty.  It's a nice addition to Church Street.  The mus-ac was a little off--think elevator--but we dealt.  I would recommend the lamb masala and aloo gobi.", "author": "Ursinha G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-01", "description": "I don't remember exactly which curries we ordered, but they were disconcertingly sweet. I think the garlic naan was pretty good. But it doesn't really matter, I was too distracted away from the meal to write a decent review of the food. A child of one of the staff members child was inciting all of the other children in the restaurant to scream and jump around and touch the rest of the diner's. It was beyond absurd and continued from the moment was sat down past the end of our meal without a word from any of the staff. In a loud kid-friendly joint with plenty of space, fine. But this is a closet sized, candle-lit joint and I wanted a snuggley dinner with my love.", "author": "Danielle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-23", "description": "Just OK.  No logistical issues with our pickup order.  Food wasn't bad, I just like Spicy Bite more in this area -- it's also a few bucks cheaper.", "author": "Nat K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-02", "description": "came here randomly one rainy night.  we were surprised to see the tables dressed with white linen, and roses.  we ordered our food spicy, and both came out very mild.  also, we had to ask for our naan after waiting 5 minutes after the meal was served.  i'm not sure if they forgot, but it took another 10 minutes to get them.  the food was okay, the servers were kind, but they're definitely in no rush.  the restaurant is a nice indian joint, so you're paying for the ambiance and the location in noe valley.  you could get the same dishes for half the price at (and much better, i dare say) your standard indian restaurants in the tenderloin.  but then again, it's about the location...", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-05", "description": "This place was a good! idk why there were about 4 or 5 to-go orders while the restaurant itself is great.  The music and atmosphere was fine and the staff was always ready to serve. The food was great, i had a lamb dish and it was soo tender that i could cut it with a fork! i also had the tandoori chicken which was good and the coconut vegetable curry which was DELICIOUS! over rice ummmmm! For dessert i had rice pudding, which was very tasty and some of my bro's mango Ice cream, that did not taste fake and was a very soothing way to end a dinner. I had no problem with this place at all, definitely go again", "author": "Travis G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-28", "description": "Every time I crave Indian food and good naan bread, I stop by this restaurant on Church Street.  I worry because it's never full, you can always get a table.  Maybe the portions are too small for the price, but the food is delicious.  My Oakland co-workers make me bring their chicken tiki masala to work, they can't find a comparable sauce in the East Bay.  A BUFFET lunch is available now -maybe to bring in more customers?!? That's when I go, for $8.95 I get to sample everything and go back for more. Lamb, tandori chicken, tiki masala, rice, vegetables, naan bread, dessert...I could eat that food everyday!", "author": "Paula F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-17", "description": "The delivery service was great, except the Okra dish I ordered was extremely salty and stringy because of old Okra.  The nan was decent, but never going to order Okra from there again.", "author": "Xu D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-08", "description": "We had several positive dining in experiences at Clay Oven when they first opened in our neighborhood, so we figured that the take out would be equally delicious.  WRONG!   After three tries now, the take out has been sub par (read: bland) and this last time we ordered they Overcharged us! and the delivery guy asked for a bigger tip. \nWe love Indian food, and now we will go elsewhere for it.", "author": "Doreen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-15", "description": "Clay Oven is in our hood so we have ordered from them several times both pick up and delivery. The portions are decent sized. We seem to always have leftovers. The dishes we've tried have always been delicious including lamb or chicken tikka masala, bengan bhartha, alloo gobi, and sag paneer. Once our naan was burnt and  that was disappointing but typically we enjoy our meal.", "author": "Romeo And Lola K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-14", "description": "Went there twice this month. Despite asking for the hottest most lunatic spicy curry they could muster, both times were quite mild. The waiters there are so nice, but they mess up. They served the wrong dishes to each of us and didn't know which was which. One time they also serve the starters with the main course. In fairness to them they gave us a little free desert but the bill was still huge. Decent food but relatively expensive.", "author": "Gary G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-10", "description": "This place would get 2 stars except the atmosphere is nice. Its not grungy like a lot of Indian restaurants, and the music is the typical bollywood but its not blasting. Food is okay, but I'm not sure I'd go back unless I'm desperate for Indian and don't feel like leaving Noe.", "author": "Emily A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-13", "description": "Beautiful, romantic interior, and excellent food too. Prices are fair. I recommend highly.", "author": "Jade P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-17", "description": "Why don't they have a lunch buffet? Is Noe Valley THAT much of a yuppie guppie burb that a lunch buffet would be too passe? Well, I happen to like Noe Valley decently enough, and this restaurant does fine without a lunch buffet. \n\nI came here for the lunch specials, and I was only moderately satisfied with my order. Dinner was a different experience, though. I came here straight from home, wearing only sweats and a book as my only company, but I felt at home in the dim, classy surroundings. The staff could stand to be a little more outgoing, though --- sometimes I felt like they were hawks, waiting to unseat me just in case I might fly the coop. No \"how's the mushroom masala tonight\"? No \"ah, I see that you basically just rolled out of a late afternoon nap to have dinner at our fine establishment. Bravo!\"  Maybe I shouldn't have came in my sweats after all. \n\nBut the mushroom masala was good, and even better was the Kashmiri nan. I've never had nan of that kind before, and it was amazing... a bit sweet, though, and might work better as a dessert bread. (Also, the crust was a bit too burned for my liking. Work on that!) \n\nSpeaking of dessert, what did I do to deserve the tasty rice pudding freebie at the end of my meal? I didn't notice any other tables getting any. Were they trying to get rid of curdling leftovers and saw my youthful demeanor as an excuse to unload it on me? Eh, it was a nice surprise. No sense questioning kindness.", "author": "Joseph R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-25", "description": "Take my review with a grain of salt -- I've never had Indian food in the US that I thought was very good after living in London for a year and was completely spoiled (don't even get me started on how good their Indian food is!).  Here, I find it all bland, dishes too similar to each other, and a bit of a yawn.  However, I'm glad that Noe has an Indian place now, and when you just really want some naan and a nice korma, this isn't your worst option.  I prefer to take-out from there.", "author": "Jenn K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-15", "description": "Damn. I should have checked the reviews before going here. I was so excited to finally have Indian food in the neighborhood. I got the Lamb Tikka Masala, Veggie Byrani, and Bhengen Bharta. They were all awful. So bad that I could not even bother to save them for leftovers.", "author": "Eater S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-08", "description": "Yummmy!!!  So good!  I went here today for lunch and it was perfect.  Great prices too, my lunch special was $7.95 and comes with an entree, rice and small salad, great deal.  The naan, which I ordered separate, was perfect, light, crispy and a nice flavor.  All the dishes were so delicious.  \n\nI really like the Prawn Tika Masala, the sauce is so tasty, the spinach with cheese cubes, and peas with cheese cubes.  Everything I've ever ordered here has been really good.", "author": "Anna Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-20", "description": "I went for a late weekend lunch.  The service was fine, but we were the only customers, so I can't really rate it.  The food was amazing though.  I ordered samosas and bengan bartha. The bartha was the best I have ever had.  The prices were a little steep, but not unreasonable.", "author": "Gabe K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-03", "description": "Like many of the other reviewers, I am very excited to have an Indian Clay Oven in the neighborhood.  We tried it for the first time tonight.  The food was fine, exactly what you would expect from one of the Clay Ovens.  The decor is beautiful and the restaurant is comfortable.  We had several vegetable dishes and were happy with them all.  I would note, however, that despite the fact we ordered food \"medium spicy\" it was very mild (but flavorful).  If you live in the neighborhood, consider this a 4 star (the fourth star for convenience).", "author": "Penelope M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-01", "description": "Food was flavorless, service was horrible took 20 minutes after I was clearly done for the waiter to get off the phone and bring me the check!!! Then within an hour I felt tummy sick. Yeah, no thank you! Noe Valley is in desperate need of a GOOD indian restaurant.", "author": "ariana m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-17", "description": "Food was just OK.  I live 5 blocks away.  Ordered at 6 PM and was told 40 minutes for delivery.  OK.  I called after one hour and they said he would be right there in 5 minutes.  Ok.  Just got the food at 8:51 PM.  Cold and soggy.  Never again.", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-14", "description": "it's about time our neighborhood opened up an Indian food restaurant. The food and service are always wonderful. I wish them all the best and hope that they never leave. \n\nThank you!", "author": "DEANNA R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-05", "description": "First I think the food here is good. I love the velvet butter chicken. When we learned they delivered we started ordering from them at least once a month. \nTonight, however, that has ended and we will not be ordering from them again. There have been some problems the last few times we got deliveries. Mostly the problems were delivering the wrong food. They always corrected the problem but never offered a discount or anything for free. We like the food so much that we put up with it.\nTonight we got the wrong food three times. After the third time I called them and after a little bit of a struggle with the owner/boss he promised a 20% discount and new food. However, they sent the driver without a new credit card receipt and even though he assured us it would be taken care of we decided not to chance it. We sent the food back. Called them and demanded a refund. Now we wait to see if the refund goes through. It was such a frustrating experience. Normally we are very patient but after the last times we have ordered and it has been wrong we cannot be patient anymore. \nIt is too bad for us because we really like their food. \nIt is too bad for them because we were good customers and we use to recommend them to our friends.", "author": "T W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-08", "description": "bottom line; good curry. a bit on the pricier side when compared to other northern indian/pakistani joints in the vicinity, but it was well worth it. the chutneys were fresh and tasty, my samosas were nice and crispy and my entree was good. i ordered the chicken tikka masala (i know, not exactly the most adventurous choice, but one of my faves), the sauce was spicy and savory and the meat was nice and tender. i thought it was nice how they brought out a mini chaffing dish for my entree. the naan was fresh, hot and perfectly fluffy. the service was also prompt and courteous. I also liked the fact they have my favorite Indian beer, flying horse; a nice hoppy lager to cut through all the spice. not a place i'd get takeout to curb a late night curry cravin', but a great joint to treat yourself to once in a while of take a date to.", "author": "cyrus t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "our cheese dish was lovely and fresh light cheese,lamb korma a bit tough but divine sauce,3 more dishes all degree of spice requested and great sauces.pekora a little tired but onion cake great. will go back anytime.very much appreciate the civilized noise level", "author": "Sharon s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-29", "description": "The roomies and I tried out grubhub.com for the first time on Friday night. We get lazy and then have to order in, and then it's always chinese or pizza, pizza or chinese. So yay when grubhub suggested this place. Delivery is cash only through them, but it may be different if you order direct. You can place your order right online. The  menu looks good, I had a very hard time deciding.. I ended up with a lamb dish that has apricots in it. It was so good! The portion was large; I wasn't even able to finish the last few bites, and I have a big apetite. B had a garlic lamb dish which he liked too. He ordered mild but still thought it was a bit spicy. Mine wasn't spicy, but I forget if I asked for medium or hot.  I thought b's was good, but mine was better. His food lasted him two days, and he has a fairly normal apetite. J had the lamb saag and s had the chicken saag. Very tasty. The basmati rice was yummy, the naan was nice and plump.  The mango lassis were good, but not great. Overall, we really enjoyed the meal, and it was about $15 per person all together which is well priced. I know a lot of the reviews on here say it is expensive, but we were actually thinking as we were ordering it, that it was cheap. Delivery came fast, the food was still hot. I think we will go back again. I love indian food and this is much better than the place I went on my birthday, although maybe less good than the place I went before... Factoring in the fact that this was takeout, I think it was great.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-30", "description": "I received delivery from here....and the Tandoori Chicken was greasy...and the Chicken Tikka Masala arrived cold.  I have eaten in and had a better experience....but I am not a fan of delivery.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "ate here yesterday for a fun girls-only brunch.  we were the only people in the entire restaurant!  we ordered a bunch of vegetarian dishes to share.  everything was great and service was great too, although again, we were the only people in the place so it would have been hard to give bad service.  naan was delicious, and so was the bengan bhartha and coconut vegetable curry.  they even made us our own saag chana because it wasn't on the menu.  can't wait to try the other locations.", "author": "kate s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-20", "description": "great time. the food took a while to come, but that was fine. it was the third night that they were open, and i was in no hurry. kashmiri fish was the best of the five dishes that i tasted. the coconut curry was great too. all of the service was great and i would suggest this to friends so long as they did not want a quick dinner. great addition to the neighborhood i grew up in. much better than china pepper, and not too pricey compared to some of the other newish spots in UPPER NOE VALLEY.", "author": "Morgan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-21", "description": "We were pretty underwhelmed by the Clay Oven.  Interestingly, our friends thought it was delicious, which was curious since we were eating family style.  I didn't think anything was terrible, but nothing was very good and I found myself wishing I had opened a box of tasty bite instead.  The rice was made of all broken pieces.  The garlic naan was made with garlic powder, not actual garlic, which made it powdery and bitter.  And, the service was terrible.  Aside from the person who took our order, no one seemed to know what was going on, when we asked the waiter that brought our food if we could order some wine he had no idea what we were talking about.  Anyway, to each his own, but I wouldn't make any effort to eat here again.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-24", "description": "the food was solid, tasty and delivered in under 45 mins, one of the few places in SF that has Vegetable kofta, lost a star because the potatoes in the saag could have been a little firmer, less over-cooked but altogether a good experience, and certainly right for the price", "author": "Jared Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-03", "description": "like others, i was so excited to have a  new indian place in the hood. it's good, but not great - as others have said, it's lacking spice, though not really flavor. next time, i'll specify spicy and maybe they'll earn a fourth star.", "author": "Erica W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-18", "description": "clay oven is a great addition to the neighborhood - much better than the weird bistro that previously was in this space.  their chicken tikki masala and veggie coconut curry are both tasty, as are their veggie samosas.  true, they are not as good as spicy bite, but if you want to actually eat at the restaurant, rather than just order take out, this place is a good bet.", "author": "Erin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-19", "description": "I have to say I was quite pleased with this newer restaurant in the Noe area.  The chicken was absolutely perfect.  Tender, Juicy and just the right amount of spice.  The service was very good. I really have no complaints, I'm just happy to have a really good Indian/Paki rest. in the neighborhood.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-17", "description": "I have ordered take out from Clay Oven several times and have always enjoyed it very much.  Food is delicious.  However, I felt compelled to share a recent experience a girlfriend and I had when we ate there a few weeks ago.  We ordered the homemade pickles appetizer (or something to that effect) and a while later (service was not great and we were the only customers there) we were brought some flatbread and a dish of what looked like some kind of chutney.  Forgetting that we had ordered an appetizer, I thought this was just what they brought to every table like bread and butter.  So we tried it and it was probably the most disgusting thing I have ever tasted.  I could barely swallow it.  We were so perplexed by how awful it was that we started laughing hysterically.  I almost complained but decided not to as we didn't want to offend them.  Everything else was delicious, thank god.  I had leftovers to take home and I noticed they had included the vile \"chutney\" with the rest of my food.  I asked my boyfriend, a chef, to taste it just to tell me what he thought and he could not even swallow it.  His guess was too much vinegar was used to pickle whatever it was (vegetables I think) and they did not taste it beforehand.  Poor quality control.  Of course, there is the possibility that that is how it is supposed to taste so if that is the case, I would STRONGLY recommend NOT ordering the pickles appetizer at Clay Oven.  You will thank me.  Seriously.", "author": "Knitgirl P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-11", "description": "like other people, i really wanted to like this place, because it's nice having an indian place in the hood.  but, the food was terrible. in lieu of real flavor, they unleashed a firehose of red hot spice onto all the dishes.  blech.  and yes, overpriced.", "author": "soph q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-08", "description": "I went to this restaurant last night with my husband. We are really happy to have them as the newest noe valley addition. The service was really great, the manager served us I believe, and their was never a dirty dish left on our table - never a glass of water that wasn't filled. We were not rushed to order, nor to pay. I am not sure why the restaurant is getting so many terrible reviews, maybe it is becuase they had just opened, but I really had a great experience. I have to say though, I am not a spicy fan, so maybe for others it needs more spice, for me it was perfect. I recommend the mango lassi's they are delicious! - They could serve a fuller glass of chai however, as it seemed only half full in the cup I got, but that was my only gripe. We ordered the vegetable samosa's, cucumber salad, vegetable korma, rice, chicken tikka masala, two mango lassi's, and a chai tea. Nice people too, and the restaurant was packed.", "author": "ac P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-18", "description": "everytime i have been here the food is very good.  my issue is the service.  it is either very odd, or last time pretty non-existent.  my husband and i were basically the only people in the restaurant but our food and even finding someone to take our order took FOREVER.  there were plenty of people working, but perhaps they just couldn't see us?", "author": "n. h."}
