{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "The bartender is the nicest person. Suggest you go there any chance you get. If i lived here I'd make it my local bar to go to.\n\nWe went there two times. Both times the owner was very kind and nice. Also the atmosphere is good and lets you hang with your friends nicely. Not loud annoying music, clean and nice beers. First time he gave us free popcorn and the second time he actually ordered pizza to the bar guest and whever wanted could take some.\n\nMy experience with the bar was amazing. I hope yours will be too!", "author": "Dror M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "This place is so legit chill af. Solid dive bar We had passed by this place in many occasion thinking it was a heroine junkie hangout. We decided to give it a chance after a mother nearby place went out of business. It is a super chill cozy dive bar.\n\nThe owner /tender is super nice and keeps the riff raff out. He made us a huge batch of popcorn for free. Place has a great beer selection and 2 pool tables", "author": "Kev Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "I was in here back to back a few weeks ago to catch the Yankees vs Red Sox division series after work. Friendly bartender made popcorn for everyone, and didnt hesitate to put on the game when I asked. There's a big projector screen in the back behind the pool tables, and 4 large tvs up front. Great place to watch a game!", "author": "Alex G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "This one man shop is great for an after work happy hour. The owner is super accommodating and very nice/friendly. Good will be provided if enough people come. Two Pool tables. Lots of beers on tab. GREAT SPORTS BAR too", "author": "Brittany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "The best bar i was in for a long time, amazing stuff, drinks and atmosphere. Realy recommand you all to go there!", "author": "Yuval Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "Came here on St. Patrick's Day after attending a company party out in the boonies west of San Jose. \n\nThis place is just above okay. It's a dive bar, so I'm going to give them the benefit of the doubt and say that they have all the features you'd expect of a dive bar, like darts, pool table, dark wood bar, etc. We had to kill some time before going over to our actual reservation at The Grid and I wanted to kill some time first. So, time was killed here with a few beers.\n\nThe restrooms are shit. But, it's a dive bar, I fully expect that. The day I went, I don't think the paper towel dispenser actually worked. Your mileage may vary.\n\nIf you're not paying with cash, expect to pay with their iPad and to sign with your finger, tip with finger, get receipt to email/SMS/etc. It's San Francisco, after all.", "author": "Russell Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "I initially found this bar last month through a team outing with my work and I have kept coming ever since. AJ the bartender is what makes this bar such a welcoming place. He pays his own jukebox so that his patrons can choose their music of choice. He even brings boxes of pizza for everyone to enjoy for free on select days. The selection of beers on tap is rather plentiful, and although there aren't hundreds of spirits on the shelf, the ones I like are there. Towards the back are a few couches, two pool tables, and many tv's for additional entertainment. This place is awesome. I'd recommend it to anyone in the area.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "What an awesome bar!\n+ TVs, darts, pool table, jukebox entertainment!\n+ comfortable reclining sofas, are you kidding me?!!\n+ spacious!! \n+ owner will occasionally give out some snacks if you're lucky! And his service is top of the class\n\n- in a somewhat shady area in the SoMa district. Can feel unsafe walking there, so be aware of your surroundings\n\nThis is my second time here as a local and it's definitely a hidden gem! Very low key, and you might doubt it at first because it's not always bustling w pple. But I've already brought two groups of friends here and they absolutely loved the place. You kinda create your own chill vibe here. Above all, AJ the owner is so nice and accommodating - he is for sure the one who makes this place special.", "author": "Connie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Very divey but they got a wide variety of beers in tap, big o' screen for sports and a pool table. I met up with friends here and thought that this place was awesome for a meet up. Definitely coming back for another meet up if it happens here again!", "author": "Real R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "always a fun time, good music and free pizza when the whole team shows up for happy hour", "author": "Luke M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "Great bar with a good selection of reasonably priced drinks. The best part of this place is definitely the staff - friendly, knowledgeable, and great to be around. Thank you, AJ!", "author": "Rick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Amazing dive bar. Good drinks. Good people. Don't let the exterior fool you. This is a dope spot for some drinks", "author": "Hunter N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "This place is awesome! AJ is the best!  My co workers and I come here at lot for happy hour!", "author": "Jay I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Best bar to have fun with the owner, AJ. Can't beat good deals on alcohol and free pizza. Visit Club 93 to find out how awesome this bar is for yourself.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Staff is amazing! Great price. Great people. Fun times. They have pizza from time to time so that's a hugeeeeeeee bonus.", "author": "Sam C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "This place is a SF hidden gem! It feels very much like a neighborhood bar while at the same time being an SF institution. My friends and I stumbled upon this bar and we are so lucky we did! They  have a pool table, a friendly bartender and a jukebox. My friends and I spent the night socializing with other people and picking music for the jukebox. The bartender made delicious drinks and even ordered pizza for the entire bar!\nOverall best low key bar we have gone to in a long time! If you are looking for a real authentic no-frills awesome time, come to this place, it's amazing!!! Definitely come to this bar, it's a local gem!", "author": "Diana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Love this bar! My boyfriend and I go here all the time. Aj is very welcoming and always friendly. Great vibe. Great service. Great prices. He plays music and orders pizza for the customers!!!! All around fav local place in the city", "author": "Kayly O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "This is by far the best bar around the area. The owner AJ is awesome and truly cares about the customers. Great vibes and a very fun! He will also supply free pizza you can't beat that!!!", "author": "Devin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Fun hole in the wall dive bar. Couch seating, pool tables, jukebox, great atmosphere. Felt like we were at home, as AJ made sure to be welcoming! It started to downpour and he even offered to give us an umbrella to take with us to our next stop! After that and a beer we decided to spend our entire night there where we knew we were super comfy and well taken care of! If u like a good scotch blend you gotta try the monkey shoulder! We will be back to see AJ again for sure :)", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "Thanks for being accommodating and putting on a HUGE soccer game we weren't sure who would have it on. Really appreciate the quick feedback to my question and a response when I provided the incorrect time frame. Made everything so easy for us to come down, enjoy some beers and relax to watch the game!", "author": "Corinna G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "The beer is stronger then the drinks. \nStopped by last night with friends for drinks before a show and we stayed a total of maybe ten minutes. Bartender was really friendly but my vodka red bull tasted like a watered down red bull. Drink was 9$ so I expected a real drink at a drive bar. He also offers you peanut packets as if he's being cool then charges you for them on your bill? Haha wow, thought it would be a cool dive bar but it was a joke.  We found a much better bar a few blocks away from here.", "author": "Jose G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "This is home! Great music, great service, great selection of beer. I come here at least once a week and AJ is the best bartender and the coolest. This is seriously home with hot fresh free pizza and comfortable couches.", "author": "Billy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "This place is amazing. Cheap drinks. Awesome service. They have pool tables for entertainment. Getting to the location is sketch but it's all worth it. Our go-to place for drinks and a crazy night.", "author": "Vivi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-30", "description": "$16.00 for a Trumer and a shot of Jim Beam might not seem crazy for SF, but this is a dive bar, in a divey part of town. It being empty at 9:30pm tells me that I'm probably not the only one thinking this is nuts.\n\nStill needing to kill 90 min waiting for a friend but feeling like a sucker for the aforementioned first round, I went across the street to a nicer place with lower prices and proceeded to have a great time. For these reasons, I DO NOT RECOMMEND.", "author": "Helmut R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-15", "description": "We were looking for some where to play pool and relax without being crowded by a lot of ppl. After hitting up a few bars in around the area we decided to stay here. The place is actually pretty big inside and there was plenty of space to move freely. The owner is pretty awesome too!! He served everyone in the bar free shots and pizza!! I recommend coming here for cheap drinks, pool and fun.", "author": "Felicia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-26", "description": "Well damn, if divey bars are your cup of tea, look no further. Club 93 is where you need to be - complete with a pool table, an overwhelming smell of urine from the bathrooms, and the very dark atmosphere. \n\nGenerally I like divey bars, they're usually special or unique in some way. However, the smell from the bathrooms were so off-putting that I felt like I needed to relocate. If it weren't because the fact that our bartender was very sweet and friendly, I probably would not have hesitated to do so. Luckily, the free pizza as mentioned by other Yelpers came shortly after we had sat down and this helped GREATLY in covering up the offending smell (I think this was the intention) which quietly lingered over us. Of course, free pizza means to me, morally, you gotta give a good tip, which means it's not really free; but honestly I was just glad that it was fruitful in its efforts. \n\nThe price was not especially cheap for a dive bar, but it wasn't outrageously expensive either. For its location (close to Bill Graham and a few buildings of major companies), the bar makes an okay effort to keep the prices fair. A huge bonus is that they take card with no minimum, which was one of the main reasons we ended up here instead of at Oddjob or elsewhere.", "author": "Evelynn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "I haven't written a Yelp review in about 2 years but this place deserves it.  This is a hidden gem in SF.  Every bar in SF now has to have sustainable vegan free trade craft drinks for an absurd price. This place is just a simple great sports bar with great beer for a great price.  \n\nTheir beer selection is probably the best in the area.  Also, they hook it up with FREE Pizza for people drinking there which is awesome.  \n\nMost importantly, it is locally owned and not part of some douchey restaurant group so some venture guy that got lucky on some app investment can tell people he owns a bar.  The owner AJ works the bar and is a super cool guy that treats everyone fairly.", "author": "Danny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "First time in San Francisco and ran into this amazing bar. Great service and atmosphere! A must go to if visiting the bay area...  Play pool watch the games and get a great convo started with AJ....   Thank you AJ for the awsome experience!", "author": "Pedro L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Free pizza late afternoon! This place is like my second home. Perfect for first date-testing!", "author": "Ulga-Borovička Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "I'm revising my review since I've had a chance to pour a few days down the ol' gullet. Accommodating owner who isn't above plying his customers with free pizza and/or peanuts and popcorn when sports or bar events are happening.  Nice pool table and big screen TV but watch your wallet or purse & cellphone (and car if you're driving). Not the proprietor's fault.  The area is bad and anything not bolted down is fair game.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "If you want a real Bar experience, come see Aj, amazing personable guy, great dive bar, nice clean, big screens, great picture and some good old fashion drinks.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "Ignore all reviews that say that the workers here were rude. I have never been treated rudely at Club 93 and the owner and bartender are nice. The place has a chill divey vibe and is near Bill Graham/Civic Center Bart. They've got a good variety of beers on tap - something for everyone. To note, for those that are into fruity beers they do have a few options - they have a blueberry and a strawberry beer. I'm not into beers that are too sweet but was curious what the strawberry would taste like so the bartender suggested I mix the strawberry with one of the wheat beers. I've never tried mixing beers before.. but it was actually not a bad combination. They've got pool tables which are usually full so make sure to put your name down if you want to play. Be sure to have some quarters too, I think it's coin operated. The only time it's difficult to get a table is when there's a league going on. Other pluses, the owner is really nice and will sometimes order pizzas if you have a large group. YAY FOR FREE PIZZAAAA!", "author": "Saachi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "$6 for draft IPA, free pizza (plenty of it), and a friendly bartender named AJ. My kind of dive bar.\n\nAlso, they played Kermit the Frog's \"rainbow connection.\" Color me impressed!", "author": "Fred C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "I really liked this bar! It was super cozy and warm! And the bartender, AJ, was so kind and welcoming! It truly is a diamond in the rough!!", "author": "Phoebe V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Aj is the best! I only come here for him, best bar tender in the city! Great conversations, even better drinks and the popcorn is a plus!! Will be back for sure!!!!", "author": "Mikhaila K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "Do I love this bar?\n- Yes. \nGreat (i.e. strong) drinks?\n- Hell yes. \nFriendly bartenders?\n- Of course. \nFood?\n - They order (complimentary) pizza for their customers. \nThey just only have shitty bottled beer...\n  - Over 20 fantastic choices on draft \nThey have to be cash only. \n - Nope, they have square and accept credit and debit. \nAm I dreaming?\n -Nope. This place is real. \nAre you sure?\n - Yes, and they have flat screens with sports and sofas for you to sit in. \nStop it. This place can't be real. \n -It is.", "author": "Seema U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "This is an amazing bar !! The bar tender is awesome and the best part is how there is free pizza and popcorn .. wooahhhhh!", "author": "Raj Kishore Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "My friend and I were visiting the area and decided to grab a drink and I am so happy we did. We ended up falling in love with this small bar and the very friendly owners. They were very accommodating, friendly and easy to talk to. It's a wonderfully comfy divebar with fairly cheap drinks. I wish so much that the bag could be in my hometown; I'd be a regular! 10/10", "author": "Cammie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "My friends and I were looking for food and noticed that this place serves free pizza to its customers! It was also super convenient because it was around the corner from my buddy's house. The bar tender AJ was very kind and accommodating, and ordered us fresh pizza the moment we walked in the door. I will absolutely be coming back here in the future", "author": "Lythia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "My coworkers and I love this bar. AJ always orders pizza for everyone at the bar when we come, and sometimes throws in some money so I can pick music on the \"juke box\". Drinks are all reasonably priced and the environment is laid back. We've all made some great memories in this bar, and it's our default place for after work happy hour. AJ knows the order of most of my coworkers, and recognizes us when we come in. It's nice to have that feeling in a big city! Thank you Club 93!!!!", "author": "Kim C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "Fun dive bar! I met a bunch of friends to watch the Warriors game. We're huge fans and love watching at GG Tap but thought wed try something different. I dont think this is my fav place to watch a game but it wasn't bad and not super crowded!\n\nThe owners (I think they may be brothers) were very nice!! Like other reviews share, they give out free pizza, which is such a thoughtful and also a very smart business strategy!!", "author": "Hetal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Popcorn, armchairs, pizza, and awesome bartenders who are willing to make cool drinks and chat with you. One bar where I feel comfortable showing up alone and staying awhile. Thank you!", "author": "Ariana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "FREE Pizza for people drinking, pool tables available, prices are reasonable and bartenders are awesome.  What more could you ask?", "author": "Christopher C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Great bar. Cheap drinks, free pizza and popcorn, great Christmas decorations, cool bartenders, and a juke box. What more could you ask for from a dive bar? Nada. I always have a good time when I drink at club 93!", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "Came here to celebrate my friend's 22nd birthday! It's the perfect place to watch a game, play pool or just have a nice drink with friends. Ambience is very chill. They decorated the walls with different SF sports teams like Warriors, 49ers and Giants! Much SF pride everywhere! \n\nWe also received great customer service and free pizza! That's right, free pizza!!! We got a beer for $6-7 bucks which I thought was reasonable and student friendly. Highly recommend this bar if you're looking for a nice place to catch up with friends, relax or watch a game.", "author": "Clarissa L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-17", "description": "Came here Friday night with friends after a show at Bill Graham...based on the reviews, everyone seemed to say it was a cool dive bar and that the bartenders were really friendly -- NOT what we experienced. There were about 7 of us and I mean I guess we all look pretty young but they told us we each had to order a drink or get out. Seriously what the heck? What if one of us was the DD? Or one of us couldn't drink??? (Which was the case) Probably never coming back here again. Sad.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "This place offers a unique homey vibe with the owner behind the counter. There are leather couches lining the crimson & black walls. Plenty of pool tables and big TVs. Smells like Fantástico.", "author": "Josh R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "My friends and I were staying in a hotel right down the street and wanted to watch one of the big boxing fights somewhere. We could not find any places that were charging less than $40+ per person just to come in and watch. Club 93 was way cheaper than anywhere else and was SO much fun! The drinks were pretty cheap and the owner ordered pizza for everyone watching the fights. We even asked the owner if we could walk next door to the vegetarian restaurant and order food to bring back since we didn't really want pizza and he allowed it.\n\nClub 93 was SO awesome and was the definition of a dive bar. We always talk about how much fun it was when we were there. Cannot wait to go back!", "author": "Deanna B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-15", "description": "I'm not complain about the price. I can even pay full price.   The only thinks is when you have still 10 mins to drink a beer.  Why you gonna pressure the guest to drink it in 1 min", "author": "Magaly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-27", "description": "Stopped here during Santa Con. The bar is pretty chill and laid back. Bar tenders were friendly and attentive. It was empty when we were here everyone else was on Polk or somewhere else. \n\nLiked the festive decorations. There are two pool tables in the back and a big screen that shows music videos. There is also a juke box you can put money in to play music.\n\nI didn't like the idea of having to pay for the music. The bar was empty and quiet when the songs ended and we had to go pick another song and pay. Why can't the bar just play free good music for all to enjoy.", "author": "Lara D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "This is the dopest bar in sf the bartender from Jabar is the shit. Love this place. Bartender Aj is da mane", "author": "Ry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "Love this place came here to visit and the bartender AJ was so amazin and welcoming When we visit from LA we are always making a stop here !! AND FREE PIZZA... this is just a gem. Flying back from LA to just chill here. Two pool tables and a great time", "author": "Jess R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "If you're looking for good vibes, good drinks, and a friendly bartender-- come here. Cheap drinks and the gentleman throws in free pizza. GET HERE NOW.", "author": "Cameron K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-23", "description": "My best place ever for watching a soccer game. Screens are huge, there is a pool, the staff is really nice and make sure you feel comfortable.\n\n+++ They have my favorite beer : Hoegaarden\n--- : Dangerous neighborhood", "author": "Lino M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Awesome sports bar. Flexible on what sports are on! They give you POPCORN as a complementary service. Bar tenders are down to earth and friendly- What's not to love here?", "author": "Erika G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "I think I reached the point in my life where I can say I have a \"go to spot\" in San Francisco. \n\nSF has lots of options but too many are overcrowded, overpriced, or draws in wack people\n\nHere is why Club 93 won my heart: \n\n- The vibe: bring yourself or your best friends and you will have a good time. There is good energy there despite what you might see outside. I think it has to do with their awesome owner AJ who cares about his business and his customers. \n\n- The set up: it has a lounge, bar stools, juxe box (with updated music), pool table, multiple large screen tvs and couches. something for everyone! \n\n- The alcohol: healthy pours of good beer and liquor and credit card machine. what else do you need ? \n\noh wait, pizza. yea you need pizza and guess what? its on the house and its actually good! boom! DONE. your welcome :)\n\nMy friends and I equally have a great time at Club 93. Thanks AJ!", "author": "Nancy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "If you pass this bar during the day you might be inclined to skip it based on appearance but don't let that fool you, Club 93 is a homey bar with a great atmosphere for just hanging out with your friends any day of the week. \n\nThe owner Ajay is one of the friendliest people you'll meet, a long time San Franciscan who loves his city and wants you to feel at home in it. The night we went there a kickball league was hosting some sort of event and the staff moved the pool tables so they could play drinking games. Judging from this and the number of trophies lining the ceiling it's pretty clear there's a good relationship with the community. \n\nDrinks fairly priced, a great selection of beer, some TVs showing sports, and an owner who really just wants everyone to enjoy themselves makes Club 93 a business really deserving of it's patronage. \n\nOh I almost forgot, the bar provides pizza for free at intervals throughout the night. It's like the adult version of your friend's house with the super awesome mom.", "author": "Jeff F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "This bar is awesome and they play the Champions League games! Got to watch Real Madrid during my lunch time and you can bring any food in.", "author": "Jose A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "I was in town for a couple of days and found this bar. I loved everything about it. The bartenders are super friendly. The free pizza was amazing!! I'm pretty bummed that this place isn't in my hometown. Thanks for a great time guys!", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "So far, beer is 20% more expensive ($6) than another comparable  sports bar in the area ($5). And the other place had attractive female bartenders  (not that it matters). We'll see how this place does during the game (Game 6 Thunder v Spurs). (Sorry for all the parentheses.)\n\nPart 2 - as mentioned in previous reviews,  the owner busted out the free pizza. Friendly crew. Upping the rating to 4 stars.", "author": "Craig N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-15", "description": "You can forget the concept of customer service when you walk through the door. The Indian/Pakistani (apologies for not asking which) bartender took our money, walked off, didn't bring us our drinks, was rude to his co-worker when she tried to help us, and then claimed we hadn't paid so he wouldn't give us any drinks. \n\nHe made us wait while he served people that came in after us, stole our change whilst arguing with us, ignored the group of 4 women at the bar, and then finally told us that he wasn't there to serve us, he was there to make money. \n\nI doubt I'll be coming back here. We are all bar tenders who had been serving drinks all night, but this guy took bar tending to a new low.", "author": "William C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "I live right above this bar. One day I got extremely frustrated trying to watch the 2015 Warriors playoff games on my laptop that I went downstairs and plopped right on their couch to watch the game on their theater-esque tv.\n\nI have to admit before I started coming here I had my reservations about this place. This bar is located right in front of the land of the homeless, drug addicts, and drug dealers. I thought it was going to be ghetto inside, but boy was I wrong.\n\nFor the first few playoff games, I was pretty much free loading. I would come in and watch and never buy a drink. It wasn't until I was invited to watch the game at a nicer bar (near the Metreon) that I realized nothing beats watching the game than at your home. Yes, I call Club 93 my home. Even though it is not the most aesthetically pleasing bar from the outside, it more than makes up for it with the awesome energy and vibe and cheap drinks. The owners are so nice. They order pizza for the bar and give people free shots when there is something big to celebrate.\n\nI am now a fan of Club 93 and will watch all major sporting events at this bar.", "author": "JF K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "never a dull time at this spot. cheap drinks. happy hour till 10pm. owner AJ is a cool fing dude. and if you are a SF sports team fan, best place to watch home game. and best part \"free pizza\". yes, pizza on the house. and if that wasn't enough, just had a free shot on the house cuz Giants got into playoff.\n\nAlso, they have 2 pool tables if it's not a sport night.  seriously this bar is AWESOME", "author": "Nishant A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "AJ Rocks!\n\nI loved this bar. Its perfect! \n\nThe atmosphere is great...just missing more people :) Cant wait to return", "author": "Adrianna E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Great value for money sports bar. Too clean to be a dive bar, and tap and bottle selection is solid. Lots of big HD TVs. Dogs welcome!", "author": "Ethan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-11", "description": "Small place. Local crowd. Very bro-y. Creative seating. Massive big screen. Meh - It was cool.", "author": "Coty B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "Calling this a \"Dive Bar\" is the most appropriate possible name for this establishment but it's amazing. The service is great; the bartenders are friendly and helpful as needed. Beer selection is great and reasonably priced. They also have free pizza in the evening, which was a welcome surprise. Seats are comfortable and they have some big upholstered chairs in the pool table area. Bathrooms were clean and reasonably well maintained. AND the music played there is consistently awesome. Check it out!", "author": "Katy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "Best bar in the area!!!! Who wouldn't love a jukebox and free pizza and bomb ass bartenders! AJ & ALI are the best of the bestest!!!!!!!", "author": "Cristina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Free pizza and wings to compliment my a nice beer list. Could you ask for anything more?", "author": "Edgar P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "If you are looking for a fancy bar or a date night - this is not for you. On the other hand, if you are looking for a casual fun evening with friends and no pretenses - Club93 will definitely make it a night to remember. \n- The drinks are cheap and the pool tables are great. \n- AJ, Ali and Alfredo are awesome and warm, and even on a busy night - they will take care of you.\n- The people you meet here are fun and easy going; you can easily strike up a conversation with anyone.\n- If you are good to AJ, you might even score a awesome free pizza! (and i mean a real yummy thin crust pepperoni).\n- And a jukebox- so you can play your music.\n\nYou'd seldom find tourists - most of the people you find here are regulars, and hence the warm and friendly atmosphere. Oh and definitely go for the Fireball!!!", "author": "Bennet M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "This is a great bar. The beer selection is perfect (large but not like have to spend five minutes looking large). Happy hour prices are great (SF great - $4 for most). Two pool tables and a shuffleboard that intermittently functions. It's never too crowded and a great spot for some casual drinks. \n\nI'd also like to mention that in a neighborhood that can get very sketch, the management (I think his name is AJ) is really doing a lot to turn it from a scary/creepy dive into an awesome/fun dive. Also, this evening they bought the whole bar pizzas - how do you not love that?", "author": "Cody R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "Very friendly and nice environment. Pool tables, lounge area are fun too.  Definitely recommend this place - don't worry about the vagrants outside either.\n\n\nPizza on the house is nice too!", "author": "Shea A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "This is the perfect bar. They have all the stuff I like in a bar, like a pool table, jukebox, and Fireball. They even order pizza for the whole bar sometimes.", "author": "Neil M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Great place, small, quiet, not pertentious in any way, and to top it off a great staff.", "author": "Jacob M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-05", "description": "I live just a block and a half from this bar and one day decided I wanted to play a game of pool. I went in and asked one of the bartenders if I had to get change from him or if there was a change machine somewhere for the pool table. He proceeded to tell me there was a one drink minimum if I wanted to play pool. I honestly could not believe that. I didn't have the money to buy a drink and so I left, unable to play a game of pool. The next experience with same said bar this guy I kind of know wanted to go watch the game at a pub and invited me. I was reluctant to even go in but when we walked up to the bar the door guy says. There's a private party tonight and the cover is $10 per person. So that was a no go.  Then last night I finally decide im going to splurge for the drink just to play some pool and I get to the door and the door guy informs me that it's a $10 cover again because the game is on. I didn't even plan on watching the game. Needless to say I've become fed up enough with the terrible overall unwelcome feeling Im getting from this place. I hate to think any of these things are ok with people. They need to change San Francisco back to the great place it was and ship all these people only interested in the almighty dollar off to drive eachother crazy and leave kind hearted good people to flourish in a positive way.", "author": "Connie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "Club 93 is like the legendary Boston bar in the show Cheers.  I come here usually twice a week after acting rehearsal or a show in the neighborhood.  \n\nFirst, the beer selection is excellent.  The bartenders are quick to refill drinks.  They'll make you anything you want, not just the beer.  \n\nSecond, there is an awesome juke box and two pool tables.  The furniture is really comfy for lounging with your buddies.  And the layout of the bar is such that it doesn't feel too cramped, even when it is very full.  \n\nBut the thing about Club 93 that makes me wish Yelp had a special option for 6-stars, is the owner, AJ.  This guy is like the Sam from Cheers.  He cares personally about each of his customers, not just as patrons, but as real people, friends, neighbors.\n\nThis is a guy who on his own dime will sometimes get several fresh hot pizzas delivered to his bar to offer his customers some free treats for their tummy.  Who the hell does this anymore in 2014!?!?!  Well AJ does.\n\nAnd then the ultimate was last night.  I closed the bar out with some friends, but only after getting home did I realize that I had left my laptop bag in the bar, which I needed for work tomorrow morning.  But since the bar doesn't open until the afternoon, I was really worried how I could get it back.  Turns out I was able to get AJ's cell number from a friend, and called him.  \n\nAJ was already at home at that point, around 2:30am.  But he said no problem, meet him at the bar in 20 minutes and he would open it up for me just so I could get my laptop bag.  \n\nAMAZING!!!  Who the hell does this... in the year 2014!?!?! Correlated to the more general decline of the social fabric of America, has been the decline in truly good customer service.\n\nBut thank god for AJ, he is a bar owner who is keeping this ancient art alive an well down on 9th Street, south of Market in San Francisco!", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Amazing place. Nice place to watch a game. Nice beer, big tvs and good music. We even had on the house pizza the day we were here.", "author": "Aditya G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-27", "description": "Overpriced drinks and a rude bartender (who owns the place) with screaming psychos roaming the street just outside the door.  I guess the techies can't get enough of that kind of authenticity, hence the rave reviews.  Let go of whatever lowlife fantasy you're indulging in and see this place for the hole it is.", "author": "carter h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-16", "description": "I'm not much of a yelp reviewer, so I will simply make a few bullet points listing reasons why I have valued my experiences here & why I will come back:\n\n- AJ, the owner/bartender, gave my dog water before he even served me my first drink. :)\n- AJ was very personable & held a nice conversation, but didn't impose himself on me. In other words, he made me feel seen while giving me space at the same time. (Yes, I'm a therapist & we really do talk like this.) \n- When I came in the 2nd time, he actually remembered my name! He scored major points with this which is why I am taking the time to write a review. \n- The TVs are high quality if you're into watching sports.\n- Music selection is great AND he'll adjust the volume (i.e., he'll turn it down a little) if someone's put on a song you don't like & it's hurting your ears!\n- Oh, ya... I almost forgot... The drinks are good, too. ;)\n\nSee, it's all these little/BIG things & more that make all the difference in the world.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "I love this place I come with my friends all the time the owner is super nice. Great place to watch any game .", "author": "Karina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "Friendliest bar in San Francisco for sure. Been going there after improv shows for years now, and am always greeted with a warm hello by the owner or his bartenders. Friendly cheerful crowd, jukebox, pool, tasty drinks. Perfection, really.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "Great place with a solid selection of beer and liquor.  Suited for both groups looking to hang out for awhile, or a friend or two just looking for a beer on the go.\n\\", "author": "Ben H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "Awesome, awesome spot.\n\nI've been using Club 93 to host get-togethers with friends. I've seen it bustling, but never crowded, which makes it perfect for events. AJ, the owner, is a genuinely solid dude who puts customers first 100%. A few examples:\n\n-The bar phone goes straight to his cell. When I called ahead to book he answered on the first ring.\n-When we got to the bar, he'd ordered pizza for us, for free.\n-One of my friends wanted a hot toddy. The bar didn't have boiled water so AJ went to the restaurant next door to get some, and made the drink happen.\n-Somebody accidentally closed out their tab on my credit card, and left with the card. AJ hunted them down, had my card back to me within 12 hours and waived my bill.\n\nNot to mention all of the other good stuff people have said: strong, reasonable drink choices, good selection on tap, not cash only, pool tables/juke box, very close to BART/MUNI, etc.\n\nOverall great spot to which I will certainly be returning.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "Stopped here to use the bathroom and then had some drinks.  The bartender was fabulous and made us feel at home!  Made some fantastic drinks and had nice pool tables and darts to keep the boys busy!  Great place with fabulous management!", "author": "Anne S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-14", "description": "Not sure why it's called a club because it's definitely a dive bar. I was looking for a spot to chill and watch the giants and found this on yelp. Indeed, it was a good place to watch as there are a bunch of TVs and sofas and comfy stools. However the place is pretty messy behind the counter (see my picture). And the guy behind the bar is pretty lazy. He was on the phone for most of the time and pretty unresponsive. But hey, it's a dive bar. 2 star service, 4 star environment, hence 3 stars overall.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-24", "description": "I like this place a lot. The owner Aj is a really nice guy and not only that there are always a bunch of really good beers on tap! They also have two pool tables in the back if you like playing, sometimes they'll have a dj set up mixing some chill music. This place is cool, what more can I say.", "author": "James M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "I love this place! AJ is fantastic, as are all the bartenders! We use Club 93 as the bar for our kickball league and AJ is always very accommodating and even allows us to play flip cup. I also love that there is a juke box and pool tables. AND, you can bring food in! I highly recommend Club 93!", "author": "Jill M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "Club 93 is a chill dive bar. It has cheap drinks and a very social staff. My co-workers and I stop by when we aren't in the mood for something that's not too fancy and not too trashy.\n\nI have met the owner multiple times. He gave me a free shot of my choice for my birthday and occasionally buys pizza for the whole bar.\n\nIt's my place to hang out on Friday happy hour, since it is laid back and doesn't get packed with stupid tech people. \n\nI haven't hung out here enough to know the entire staff, but so far, I have no complaints. It's everything you'd want from a dive bar.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "Come as you are - this dive has such a vibe. The crowd is friendly and the drinks are strong. Fireball? Why not THREE?!", "author": "Regina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "went here to watch the warriors game on 6/13. this place is great; lots of tvs and places to sit if you need to though most people are of course standing- it is a bar after all. a little sketch walking up to the place so take a car service at night to be safe. this place is great and the people there are also awesome. they are no fuss and so hospitable. also free pizza for the game?! what a nice treat. thanks guys!", "author": "Kam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-04", "description": "Clean. Pleasant bartenders/doorman. Chairs, coffee table in front area. Two pool tables, couches in back. Enough big screens. Cheap cover for big fight; owner even threw in several orders of pizza. Mixed crowd.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "Great place to play pool or watch the game. Friendly staff and they order in some good pizza too which is always appreciated!", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "It is a great place, good service from the bartender, you can choose the music, they order pizza for the customers (for free). Furthermore, on Tuesdays is time for beer pong :)", "author": "Enrique S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-06", "description": "Good dive bar, worked perfectly for us to pre-game for a show.", "author": "Greg F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-16", "description": "came in for shots- got free bomb-ass pizza.\n\nit's def a dive.\ngood place to pre-game, post-game, or go to if ur wearing sweat pants and want to get drunk at a bar.\n\nfun vibe. \nwill definitely drop by for a shot and some food bribes if i'm in the area again.\n\nps- the owner wrote me a funny note after i posted this review-- 5 stars for the owner-- he worked his arse off that night behind bar, and i didn't even know he was the owner.  cool guy. Thanks Ajay!", "author": "Jenna D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "Great service and they offer free pizza when you purchase a beer (during certain times)! Bartender gave us $5 bucks to play on the jukebox. What more could you ask for?", "author": "John P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-10", "description": "I'm more amused than offended but I stopped into this dive bar during my lunch break, as I work for a non-profit arts organization up the street. I had been here twice before about a year ago, once for a pool league tournament and another time with a couple of friends--no problem. \nThis time, I walked in and received an odd look from the bartender and another employee but I went ahead and requested a juice and quarters for the pool table. I was told that they don't give change (which seemed odd seeing they have two tables). So I went next store to buy a pack of cigarettes and $2 in quarters and when I got back, one of the employees or the proprietor (Malasa, he said his name was) told me he was denying me service. I asked him why and he wouldn't say, just told me I was trespassing. I refused to leave until he told me why since other than being a white female, I couldn't imagine what his issue with me would be. He then proceeded to call the police to have me forcibly removed. I stayed for a bit to wait for the police because the whole scene seemed ludicrous, but sadly my lunch half hour was up and I had to go back to work so I left my full name and number on a coaster for him to give to the police so that he could file charges. \nMaybe he thought I was going to shark the other players (when really I wanted to shoot some balls around alone), or perhaps I looked too techie (more like old-SF bohemian: post-playa but showered), or perhaps he confused me with one of the addicts/transients who hang on the street waiting for social services (I was showered, like I said, but I do walk back and forth on that street a lot to do Blue Bottle coffee runs and I do have a coffee/cigarette habit). The only other thing I can imagine is that it is a cover for a drug ring, and they were concerned I would notice and report it. Sadly for them, I guess I just did.", "author": "Marisa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-22", "description": "AJ, the owner was really nice at first and then once his business picked up he became very rude and pompous. I've been going there for awhile now and have had many interactions with the owner and have observed many interactions between him and other patrons: most of which have been unpleasant. I can't even tell you how horrible the owner's attitude is. He tells people \"to wait their turn like everyone else.\" He uses foul language and kicks people out for unwarranted reasons. I will never go back. This place is a dive. There are so many other places I would rather spend my money.", "author": "Shauna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "Great neighborhood bar with friendly atmosphere the owners are amazing and free pizza for happy hour but don't let the neighborhood fool you this place is very comforting", "author": "Wenona B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "Most caring, attendant bar staff ever!! Thanks, AJ, for taking care of our group! We had an awesome time hanging out, playing pool, and drinking our faces off!", "author": "Christy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-02", "description": "I cannot say enough good things about club 93! AJ and the rest of the bartenders are all wonderful, accomodating, and personable. They remember your name and make you feel like a valued customer! I have been coming here every tuesday for my kickball league and plan to continue coming back for the great drinks, great prices, and great company! This bar has everything you need: pool tables, video games, a juke box full of great music selections, and a wonderful atmosphere. \n\nI love AJ and Club 93! Can't wait to spend another fun night here!", "author": "Kari D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "Great bar!! Too much fun!! AJ is the best bartender ever!!! The cocktails are wonderful and the environment is so fun!l love the juke box!!", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "Awesome bar! The bar tenders are amazing! They are very attentive and personable. If you are looking for a fun energetic SOMA bar, this is the place. They have billiards and tables for drinking games such as flip cup and beer pong. Request AJ or Ali for your bartender.", "author": "Krista W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-02", "description": "If you like drinks for the reason of getting drunk, this is your place. If you pick your bar based on how cheap drinks are, this is your place. \n\nI went there once and did not liked the ambiance (fancy word for this place), nor the type of crowd. Its too loud and rowdy, too much racket going on all the time. I had three drinks and it were as bad as not having any. \n\nIt really depends what works for you. The owner (AJ?) seemed like a friendly guy to people who go there regularly. He didn't do anything special for us.", "author": "Nocturnal K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "This bar was so much fun! I highly  recommend it! Thanks AJ my girls and I had a great time!", "author": "Bre R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "Walked past and didn't give this place a second glance. My cousin said the big tvs caught her eye so we could watch the Warriors game. We went and thank god we did! Bartenders are awesome. Alfredo! Drinks were cheap and potent enough. Then suddenly there was free fresh delicious pizza. Definitely coming back.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-15", "description": "I ducked out of the rain soaked winds and into Club 93 with plans to top off the whiskey buzz and absorb some warmth. It was merely 1:10, the eve was young.\n\nI could smell robbery in the air that night and to my surprise the odor followed me into 93. Is it possible to smell immanent debauchery? I caught the rank scent of potential assault to pair with the stickup, and with this realization my senses were at their peak.\n\nBesides the tender of the bar, myself and a shadowy female standing in the very back were the only occupants. The woman faced the wall, apparently absorbed in thoughts known only to her. I scanned the bar's dimly lit interior as the vibe was tense.\n\n\"Black label on the rocks\" and I was served without a word. I spoke clearly and with energy to give notice that I was no drunken mark. The barkeep returned to his smoking pose at the door, lazily letting his exhale fill the bar as the winds blew it back indoors. Complete quiet, no music to be found.\n\nMany would tell me that sounds like a typical true dive. I know dives and I recognize what those many are referencing. This was different. Circa 1:45 a man walks, briskly heading to the back to converse with the woman who has not moved since my arrival 30 minutes prior. The back and forth was heated although I could make no sense of it. Two minutes pass before he spins on is heels and blows right back out as if in a rush to rejoin the cold, water saturated air. He moved quickly but his mental calculations were obvious while sizing me up. Metaphorically on my toes, I twice caught glimpses of his companion poking his head through the door frame looking for I know not what.\n\nThe clock informs me we're nearing bar close, and the shady types know damn well a watering hole like this is likely to cough up at least one patron handicapped by alcohol out onto their streets. Those willing to brave the morning hours in such inclement weather are not usually the types you want to cross paths with.\n\nI down the last touch of black label from round two and decide that it's time to see what I'll find between this bar stool and my bed. I leave the bar, feeling the barkeep's eyes on my neck along with the woman still standing in the rear. The wind hits me with a vengeance, as if to punish me for leaving it to begin with. I am alone on the street and begin my trek home, the entire journey feeling something just out of sight. \n\nAn odd night indeed, and Club 93 was the core of it. I cannot put my finger on exactly what was amiss, like looking at art where the proportions are off ever so slightly as to drive you insane, one fraction of an inch at a time.  I'm fairly certain something almost happened to me at or outside Club 93, those gut feelings you hear talk of in the movies. The ones that either save the lead role or seal him or her to an unseen fate. Doomed, if only he'd listened to his gut. \n\nI won't soon forget the burning stares of the bartender and shady woman upon my departure. Perhaps next time it's the rain drenched morning hours I'll go again and test these murky waters. I always have been one to chase after mysteries.", "author": "Justin N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-18", "description": "Potential for a great place as long as the owner is not behind the bar.", "author": "S. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-16", "description": "Great bar. Really fun bartenders. Good place to watch a game or play pool. Great prices.", "author": "Torsten W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "AJ's 20/20 Club 93 is THE BEST dive bar in San Francisco. To begin, this bar is SO AWESOME that it has two names (AJ's 20/20 Club AND Club 93). Every excellent dive bar requires multiple names--it adds to its mystery, myth and overall allure. Moreover, this spot has a unique and special asset that you just won't find at any other bar in the world... its owner/bartender AJ! He's simply the greatest. If you're in the mood for some good beer, a great jukebox and to hang with awesome people, this is your spot!", "author": "Scott K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "Really like this bar. Great beer selection, good prices, and pool tables to boot. The owner, Ajay, is a really nice guy too.", "author": "Eddie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-29", "description": "Quick and friendly service! We had a really fun night here. Great beer selection. Loved their big screen tv. Convenient location.", "author": "Jen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-20", "description": "AJ, the owner, is friendly and conscientious. I highly recommend this place for the pool, sports, music, and neighborhood feel (which is difficult to accomplish at Mission and 9th). I'll be back again and again.", "author": "Timon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "Great bar! Easy to get to location, reasonably priced drinks, and a friendly and welcoming staff! Bars like this are rare these days.  I'm glad this place exists!", "author": "Javier M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-01", "description": "I have 4 words for you: Arrogant Bastard On TAP!! \nPlus, a really cute bartender named Aurora!!  Internet Juke-box! Pool tables! HEAVEN!!", "author": "Star S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "This is a local neighborhood bar that suits our love for dive bars. AJ constantly keeps our drinks full and knows how to treat his customers.  93 offers the perfect atmosphere to relax, talk, play pool or just hang out.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "My gf and I went on Wed the 25 to resolve the cc issue. AJ immediately refunded our money and was extremely nice and forthcoming and explained to us the issue. As it was also my bday he bought me a free drink. We left the bar feeling satisfied and have decided to visit Club 93 more frequently. Thanks AJ for your professionalism", "author": "N H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "An awesome local drive bar with a great jukebox, nice pool tables,  and some nice new big screens playing sports. The customer service is stellar and like any good dive bar the people watching rarely disappoints!", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-14", "description": "Good place to forget and enjoy! Huge tv in back to watch stuff", "author": "Alan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-05", "description": "This is the kind of place where you order a Jameson & ginger ale and they measure the shot of whiskey and pour some flat soda from an already opened bottle on it! And they actually charge you for club soda. Who does that?\n\n I was puzzled about the sign that reads \"One drink minimum,\" but quickly learned why -- several times, random drugged out homeless people wandered in begging for money and had to be kicked out by staff. Meanwhile, outside in the sketchy neighborhood, my friend had her motorcycle helmet stolen. Skuzville USA.", "author": "Stumbalina b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "Perfect. Refuge from the craziness from the surrounding area. LCD Soundsystem on the radio is fitting!", "author": "Dylan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-16", "description": "Nice bar, not fancy, but good drinks!! Two pool tables! Can pick your own music, a song for 2 credits, or $0.50. Good drinks and friendly bar tenders!", "author": "Amber L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "This is a great dive bar.  \nWe came here in search of shuffleboard - somewhere on the internet is says they have shuffleboard.  Well, they don't but it's still worth a stop in if you are in the area.\nThey had live music which was the perfect volume to still carry on a conversation.  The drinks were cheap for happy hour and the clientele was a little seedy.", "author": "Janz P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "This place is awesome.  Great bartender and a really chill atmosphere.  Perfect after-work bar :)", "author": "Maksim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-28", "description": "I had a good time. Good jukebox selection. Comfortable couches... Not very many people but I loved it! Bartender was nice :)", "author": "Cee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "Awesome bar.  Chill.  AJ (the owner) remembers names and drinks.  The dude bought pizzas one night for the entire bar.  The cheers of bars in SF.  Also, there is a hot bartender as well.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "AJ is the nicest guy ever. Cheap drinks, close to muni, good music. If you don't like a friendly cheap dive, then just don't go and keep your passive aggressive comments to yourself.", "author": "Matt K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-08", "description": "Watering hole or dive bar describes Club 93.  You can roll in here for happy hour and get a tasty tasty Pabst for less than $2.  You can also get a basket of popcorn and we all know how tasty bar popcorn is.   \n\nClub 93's location leaves a little to be desired, 9th and Market is not exactly hot women and fine dining, but it is great for people watching.  Have you ever watched someone play that touch screen video game while they are cracked out?  Talking to her was just as fun, she told my friend and I how she didn't drink and how she hated drunk people; good thing you get high before you come to the bar then lady.  \n\nCheck out Club 93, strong drinks, good prices, and fun people.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "Great independently owned bar with good beer and fun things like pool tables. Definitely a great addition to the neighborhood. Have gone there numerous times and always found the service friendly.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "This is by far the best bar in this neighbourhood! Great beer, music and a good atmosphere.", "author": "Lucy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-16", "description": "It's about a week before Christmas. I've got some time to kill although I really should be heading back to the holiday inn so wtf I figure how bad can it be. Yeah I read the reviews and  I'm prepared for a surly owner to treat me badly. I go in, order a lagunitas at $5.50 which comes quickly in a nicely frosted mug. No issues there. A new pool game is starting at one of the two tables. Some idiot is going to break while holding an open umbrella in his left hand. Needless to say he barely knocked anything apart. Crappy Mexican fiesta music is blaring and I'm  racing through that lagunitas before the frost is off the mug. A couple of clowns are drinking tequila beyond their means and throw their limes behind the bar - the bartender has looks to kill but lets it slide because they have friends paying good money for the juke box I guess. A guy is trying to hustle a way-too-drunk 50 something home before she barfs. Pearl Jam gives me a little relief from the mariachi followed by Queen Fat Bottom Girls. A 10' Christmas tree well decorated is by the pool tables and that's the closest thing to agreeable I can spot in the place. Get tf outta here cuz the crappy fiesta music is playing again and the oh so depressing holiday inn is so much more attractive.  \nProbably won't come back unless ... Can't think of why this dive bar aficionado would ever step foot in here again. \nTime to go. I sidestep the vomit just outside the door and can't think of anything more appropriate to solidify my convictions. Never again. Sh#t imitation of a dive.", "author": "BB M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-21", "description": "I have been going to this bar for a good long time, but something amazing just happened there that I can't let pass without documenting. I go here once in a while to relax from work because I have good friends that have been coming here for years to shoot pool. I love playing pool. Anyhow, last night, the owner was drunk while I getting a drink for my friend. My friend said he ordered his drink and I asked AJ, the owner, and the bartenders there if someone was making the drink for my friend, and AJ says \"We don't give free drinks out\". I explained I was paying for it. To make a long story short, AJ tells a bartender to kick me out. He has been known to be a tyrant, but people do not bring it up because the bar is convenient. I understand no one wants to rock the boat, but that is a terrible way to treat people and people need to be aware how AJ treats people. Be aware. I want to add I have always paid and left a tip each and every drink I have ever bought there so I am not sure why AJ would reply stating I dont.", "author": "richard d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-21", "description": "Awesomeness begins and ends here!!! AJ is fantastic and makes you feel at home in the big city.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-24", "description": "my favorite kinda place! the jukebox was on point. the beer was ice cold and delicious. it had the wonderful dive bar smell. there were strange and beautiful people all around. I will stop by everytime I'm in town!", "author": "Bridget V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-16", "description": "What a awful place. We showed up last night because we were trying to get out of the house for a couple of hours and this is the closest bar to my house that isn't specifically a gay bar. Next time, go to a gay bar, or the Bloodhound!\n\nSo, the bartender was super drunk when we arrived at 10:30. We ordered 2 beers, 2 shots, which came to 23 dollars. Overpriced, but I payed it. The bartender insisted I buy her a shot, I thought, instead of a tip? no, she wanted me to buy it and tip just because she was flirting with us. Awful. I'm married, wearing a ring, and this was inappropriate. \n\nBut, we never got a shot for my friend who I was with so he went down to come and get it because we couldn't get her to come down and serve us. He finally made that happen, she came back to us, insisted I buy her another shot and tried to charge us another 10 bucks for the shot, which by the way was a bad pour.\n\nTwo things to keep in mind here, the whole time the \"bar owner\" a sleazy leather jacket and cologne Arabic fellow (I'm half Syrian, this guy was probably Moroccan or a Saudi) hovered over us and the bartender. I can understand why he was trying to watch her so closely as you will hear momentarily. The other thing is that before this all happened I saw the bartender buying airplane bottles and drinking them in the Go-Go Market next door to the club at 6 PM!!! Not a good sign but here's what happened next...\n\nThe bar manager asks us if we're running a tab, I said no, that we paid in cash. He then kicks US out of the bar! Saying \"if you don't want to pay for your drinks you can leave\". What a joke. This is the LAST  TIME I WOULD EVER EVER COME HERE.\n\nThe thing that gets me is that the bar manager (i think) thought we were running a scam with the bartender. She obviously pocketed the money and didn't ring it up. Plus, There were plenty of crust-punks there, with their discharge butt flaps and pit bulls drinking pabst, probably for free... ok by me but he made the mistake of lumping my friend and I in with them and the bartender just because we had tattoos.  \n\nIn short, this place is discriminatory, stupid, I want an apology from the bar manager as he obviously has no idea what he's doing. And can't tell the difference between a scamming homeless crust punk and a respectable guy with some punk rock tattoos. The bartender, I think she said her name was \"Dees\" is awful and has no business behind any bar. Not only does she owe us an apology, but our money back as well. She's a local and you can probably find her at Zeitgeist (but not behind the bar! Probably throwing herself at some dude she barely knows for drinks! At least that's where my friend thought he recognized her from). Awful.\n\nSo, we left, went to the Bloodhound at 7th and Folsom (a great place) and finished out our short evening in peace and in a fun and respectful atmosphere. I can't say enough good things about the Bloodhound. Go there instead. http://www.bloodhoundsf.com/ Alright, hope you got some humor out of this. It was an awful experience for us.", "author": "Freud R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-09", "description": "Best spot in S.F. business district.  Great service with affordable drinks.  Huge variety of beer selection on tap along with some beautiful bartenders.  2 pool tables, Air hockey, fussball table, and an awesome jukebox.  The owner A.J. is very reserved and knowledgeable on the city for any first timers in the city.  Definitely a great place to hang out with friends and visit.", "author": "Nathan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-22", "description": "AJ's 20/20 Club (renamed from Club 93) is a great local dive. Festive decorations during the holidays, really friendly staff and bartenders, a pool table. Great for larger group gatherings, and if you call ahead to plan, they can be flexible with special requests (ie, the might order food if you're bringing a big group of friends/coworkers). Bar has karaoke, and touch screen juke box -- have the bar listen to what you want to (Justin Bieber, anyone?). Also had a great time middle of the week sitting at the bar after work.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-01", "description": "Great bar, nice bartenders & patrons, big TV, good juke box, pool table, and air hockey!  I love a good divey bar and this is right up there for what I've found so far having newly moved to the bay area.  \n\nWas going to a local concert on a sat. night, needed a place to watch the world series game (I'm a sox fan!) before the show, and found club 93 via google.  I'm really glad we did!  The bartenders were attentive and friendly and happy to turn the TV sound up for us and chat about the game, even though it wasn't their team (or sport maybe!).  the neighborhood seems a little sketchy, but not too bad.", "author": "Luke C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "First walk in there is a Blue hue, two pool tables in the rear, and A wraparound couch to the left. A large tv to the high right, followed by the long bar. Every time I been to this place it's Been Great. The bar tender A.J. (An Indian fella, from the country) makes you feel at home, super friendly and hip to the iPad... If you go, you'll know what I mean. A master of drinks, full of smiles, and really makes this place what it is. Seems to always remember a face. Which is amazing being sf. Couldn't talk this place up enough.", "author": "Dominic G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-22", "description": "My absolute favorite place to get a drink after work. The staff is incredibly friendly, the happy hours are great, and they even do private events if you ask nicely! I can't say enough good things about AJ's!", "author": "Dale M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-18", "description": "By far one of my favorite dive bars in Soma. The bartender here was friendly and the drinks were poured generously. The atmosphere was very non pretentious and the patrons were very friendly and after talking to a couple of them they seemed to be regulars, and I know why. This place rocks and I would come here to chill out and have a drink whenever I felt too stressed out or wound up (and no I am not an alcoholic).", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-22", "description": "New owner is great. Good vibe. What you'd want from a dive bar.", "author": "Menotti M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-01", "description": "One of my fav neighborhood spots, great beers on tap and great staff! Great bar for happy hour, industry hour, any day of the week. I moved to SF in February and I keep coming back.", "author": "Rose R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "I love Club 93!! I love all the bartenders so much and they know all of our names, which is a great feeling. They are down for our shenanigans but, always make sure we are safe. GREAT neighborhood bar.  AJ,  Alfredo, Sydney, and all the others bartender are so sweet and accommodating. They make club 93 the best. I love you!", "author": "Carolyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-06", "description": "Club 93 is one of the coolest spots in SF! It's a block away from work and boy is it what the doctor ordered! It's an awesome Happy Hour spot w/affordable tasty libations especially w/ this economy! A beer and a shot for $6...can you beat that? It's got an Internet Jukebox w/ a Karaoke feature, billiards, foosball, n the Giants are always on da tube! Aj, the owner, not only remembers what you drink and your name (bigger plus), he's also a Community Advocate...He allowed me to host a mini fundraiser for my friend's Cancer walk!  He's super generous with donations for our non-profit organization, Workers' Children's Fund~where we raise money for foster care children and at-risk youth in SF! He's even looking for sponsors for us! He's very personable and always looking out for his customers! He has pizza and/or jot wings on Fridays~perfect finger foods to coat the tummy!  He's really cleaned up the place alot...it's brighter inside with a fun and cozier feel! If you're in the area of 9th & Mission, please stop on by...meet AJ cuz he can really make our Kettel One KamiKazees to the tee...smooth & yummy! Check them out! Tell them, Audrey sent ya!!!", "author": "Audrey N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "For a bar this place is great. They have tv's, pool tables, darts, beer, mixed drinks, and even an arcade machine. Everything you want from a chill bar. The owner opened early for me. Oh did I mention they have wifi. Great for watching an afternoon Giants game. Enjoy!!!!", "author": "Joaquin V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-05", "description": "Great spot, cheap drinks, pool, darts, good service, just a fantastic neighborhood bar.\n\nThis place just happens to be steps from the friends' apartment, so I will definitely be back when in town!", "author": "Mo C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-10", "description": "Really great dive bar.  Pool tables, juke box, tvs, and some of the best bar staff in San Fran!  Tell AJ and Julia \"John says hey\"", "author": "John Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-29", "description": "I stumbled upon this little gem on a recent trip to your (soon to be my) fine city.  My bestfriend and I had so much fun drinking shitty beer and people watching that we went back three separate times in one evening!  One of the regulars even popped us a fresh batch of dry ass popcorn!  Mmmm!!   We did see a small group of scenesters show up toward the end of our third trip, but they seemed to be minding their own business.  This place is definitely worth checking out...  \n\nThings I saw in the course of one night: \nShit-faced normally home-bound senior being picked up by his caregiver\nDrunk ass gay dude in a bath robe singing to himself on the stool next to me\nBlack hooker playing darts with some white dudes\nRegular customer give bartender $100 to make her a big pot of Gumbo\n\nPerfect.  Five stars for sure!", "author": "Snake Rattle And Roll P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-22", "description": "At a party before Pride week I met a guy who invited me to see him in drag on Pride weekend. I didn't know what to expect and Club 93 looks pretty dive-y sitting there on 9th and Mission.\n\nWhen I went in I was pleasantly surprised by how chill the atmosphere was. I also enjoyed the friendly crowd. \n\nI'm not sure how often they have drag shows, but this was a great scene. There isn't a stage and the performers are on the same level as the customers. They put on a great show and everyone had a good time.\n\nThis isn't a fancy place, but if you want to go somewhere for an inexpensive drink with a friendly crowd and really nice bartenders, this is a great place to go.", "author": "Molly R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-19", "description": "A couple years ago Club 93 was in \"A league of its own\" now I'm not so sure. \n\n My friends and I used to frequent Club 93 for the mellow vibe, shuffleboard table, drink prices, Joe Montana cut outs, and popcorn machine. It had been a few years and last night we decided to all make a trip out to Club 93. \n\n To our surprise the only thing that remained of our once beloved bar was the mellow atmosphere. No more shuffleboard, drinks have doubled in price, Joe Montana is gone, and the popcorn machine has been replaced by microwave popcorn. We were utterly disappointed, to say the least.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-27", "description": "I live next door to Club 93 and it is a good dive bar. They have a great jukebox and two pool tables. I plan on going here a lot. AJ and Sarah are also pretty good bartenders and they keep the shots comings.", "author": "William M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-05", "description": "This is my review of this place from 4/15/09.\nSomehow it was transfered to be the only review for another Club 93.\nThe only problem is that it's the same place.\nI went back a few weeks ago and brought some friends only\nbecause we were across the street and too drunk to go anywhere else.\nThe place is still pretty much the same.\nThe bartender was nice, but the owner gives me the creeps.\n\n4/19/09\n\nTimes are tough right now and I can understand not having the money to upgrade the place a little, however, the last time I was there there where broken tv's on the floor next to the pool table and random boxes, and garbage laying around. I mean, It would probably only take a couple of hours to clean the place up a little. The mens room didnt have a toilet seat for weeks. Thats like $10 at the hardware store. Im also not a fan of the $4 pbr when it's $2 at the bar down the street. Is this place a real bar or a front for something? I love sleezy dive bars but this place makes you want to leave. It's been a few weeks since I went, maybe things have changed..", "author": "Julian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "I have never been a regular at a bar until this year and it happens to be this one. It is conveniently located near a rehearsal space and a theater where I perform/attend shows frequently.  I end up at Club 93 two to three times a week. I am not much of a drinker and Ajay doesn't seem to mind, as a matter of fact when, on the off occasion he is out of diet soda, he doesn't seem to mind if I go to the bodega next door and buy one there. When I do drink the prices are reasonable (for San Francisco). Ajay always welcomes our group of jovial improvisers into his bar and even orders pizza for everyone. He is good at keeping the riff raff out, which is appreciated. There is pool, tv and a great jukebox (musical selection varies depending on who is paying). It is not too loud, so you can still have a conversation (which I appreciate). One tip for the ladies - lock the main door to the bathroom. The inner stall door does not lock and if someone swings the door open it could surprise you.", "author": "Erin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-22", "description": "Been coming to this bar now for 2 years since I work/live around the corner.  It's the only place I go to when I need a drink ASAP after work or any time for that matter- Always open and welcoming.  AJ fixed up the place really good- added new juke box with up to date tunes, fireplace,  photo booth and lots of TVs.  All the good sports games on when it counts with a game of darts, pool or golf to complement the night.  Drink specials always available..with of course my fav screwdriver.  I always have a choice of vodka to choose from.  Def come here for local ambience no club hassle!", "author": "Margo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "It saddens me to read the negative reviews written about Club 93's owner and bartender, AJ. I know him to be a very sweet, generous man who is also a great neighbor. I work nearby and have always felt welcomed by AJ when I saunter up to the bar after a long day at the office. AJ has also been a great host when my work has organized after-work receptions at Club 93. We work with local, national, and international artists who have all appreciated the hospitality of this little drinking hole.", "author": "Eyed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-13", "description": "Best little dive bar in San Francisco!! Bartender AJ kicks ass!!! Super nice..& strong drinks!", "author": "Catherine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-17", "description": "Part-hornball part-cornelius keg. I remain neutral about this odd nexus of points of time, space, neighborhood and voids. Currently engulfed in scaffolding as is the whole corner, the ambiance remains the same inside, and it does nothing to dampen people's desire to thumb your butthole from time to time.", "author": "Roy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-23", "description": "This review is specifically for the Trivia Night on Wednesday:\n\nThe host is awesome, the bartender, too. Good energy and easy to join a group if you don't know anyone. And prizes! I mean, I've heard of them and seen others get them (free beer!), as I never win.\n\nOther pluses:\nTHEY LET ME PARK MY BIKE INSIDE. DID YOU HEAR ME? THEY LET ME PARK MY BIKE INSIDE. K.I.L.L.E.R.\n\nAlso, a jukebox just cheesy enough to satisfy the tipsy soul.", "author": "Alexis W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "Great local bar for after work drinks. Unpretentious and chill. If you're looking for some hipster artisanal cocktails this is not the place for you. Friendly bar tender who always makes us feel welcome.", "author": "W.M. F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-09", "description": "The sign reads \"In A League Of Its Own\" This is sooo true, though I assume the bar is referring to the pool league they have here, not what I am about to share. \n\nThey have 2 dart boards and two darts....not two sets....two darts. I assume the others were stolen as self defense devices as the patrons walked outside (with their beers in hand...oh wait, was that me??) to smoke with the bartender, who was also outside for half of the night chain smoking, in between shots of Jaeger (which they have on tap).\n\nThat pales in comparison to what happened next. There was a fire in the crack hotel next door. Yes, a fire. Did the bar get evacuated as the 5 trucks rolled onto the scene....hell no. There was business to be had as the cracked out evacuees tumbled onto the sidewalk and into the bar. WOW! Talk about some good people watching (I am tempted to commit arson the next time I am here).\n\nThe beer, though plentiful in selection (probably about 15 on tap, plus a wide selection of bottles) tasted warm, flat and as if the taps and lines hadn't been cleaned or replaced in 20 years. \n\nI saved the best for last. The shuffle board table - YES!!! Why, oh, why can't more bars have shuffle board tables?? Now, granted, there were really random platters, punch bowls, cardboard boxes and, at one point, crackheads on top of the shuffleboard table, but they were removed as soon as someone asked.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "AJ is real nice and friendly staff. Great place to relax after a long day at work, talk, shoot some pool or just hang out with your friends. Would I come back HELL YES!!!!", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-17", "description": "This is one of SF's most wonderful dive bars.\n\nTrue story.  A co-worker was in a pool league and invited me here one night.  I took a seat at the bar while she and her partner did their pool thingy.  I was swiging on coors light enjoying the scenery walking by and the odd people occasionally walking into the bar.  Some very colorful characters in this area.  Anyway, this dude sits next to me and starts talking to me...\n\nDude:  You here for the massage?\nMe:  huh?\nDude:  You know...\nMe:  Man, I'm just drinking my beer.  I don't want no hanky panky from you, kay?\nDude:  No man, there's a massage parlor around the corner.  You know...happy ending.\nMe:  eh...\nDude:  yeah, me and my buddies come here for a few drinks, hit up the massage parlor, then we meet back here.  They got lots of fine asian girls to choose from.\nMe:  kay den\nDude:  It's only $150! You should check it out.\nMe:  Downloading porn and jacking off is free.", "author": "Luis M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-18", "description": "This bar used to be one of my favorites.\n\nUSED to be.\n\nIt once was a wonderland of SoMa divey goodness w/$2 Coronas, an eclectic jukebox, fooze-ball, pool and hot dive bar bartenders.\n\nAnd, it was ALWAYS easy for a girl to get a seat at the bar.\n\nIt was one of the best kept secrets in the city.  Gary & Elijah were my \"Monday and Tuesday Night Husbands\" (the only husbands I actually have... hint, fellas!)  And, I would hang there at least once a week - despite the inconvenient distance from my apartment. \n\nSince this bar changed hands last year it has gone to shit.\nPure shit.\n\nThey changed the sign - trying to swank it up - painted the inside so it's wayyyy tooo bright.\n\nNow it is crowded with super-fly, urban hipster wanna-be's -- the kids who think they're all that and a bag of chips w/their John Deere hats and white belts, the ones who ruined the Mission... you know, kids who don't understand that if you have to say \"I'm hip\" that you're NOT hip at all...\n\nThey've put all sorts of stupid top-pop shit on the jukebox.  They've replaced fooze ball with darts (right by the door to the bar - what the fuck, people are you CRAZY?  That is just an accident waiting to happen.)\n\nThey've replaced my free (um, I mean $2... ha) Coronas with FiDi prices ($4 for a PBR?  Are you high?)  And, REPLACED my HOT Monday and Tuesday night husbands with some cheeky BEE-YOTCH who takes 20 MINUTES before she brings you a damn beer.\n\nSeriously - my friend P and I went there a couple of weeks back before going to a concert at Slim's for a beer and we had to wait 20 minutes before she noticed us and then it took her three tries to get two  BOTTLES OF BEER correct.\n\nFurther, she left an Andrew Jackson sitting on the bar for something like 30 minutes before I finally walked up to the end of the bar where she was doing shots w/her skanky friends and said, \"Listen hon' - we've been sitting down there waiting for you to take our money for the two beers we finished almost an hour ago - if you don't cash us out now we're just going to assume that they were on the house.\"\n\nBoo to the new owners, BOOOO.\n\nThey should get NO stars -- but, I'll give it two stars.  And, that is only because I hear that Elijah still *occasionally* works there on random weekend nights.\n\nBOOO!", "author": "Kate R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-26", "description": "An ode to Rich's Club 93...\n\nI love when a customer is so drunk he stutters\nSkanky and crusty were your regulars\n\nThere were lots of new faces, many quite young\nHow many times can we listen to Kelly Clarkson?\n\nThe bartender was hot, but she fucked up the pours\nI was not at fault for the popcorn on the floors.", "author": "R M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-05", "description": "There was a period in my life where I was a bit of a dive bar connoisseur (alcoholic). Sixth & Mission was the best spot for slummin' 24 yr old Bukowski poseurs. Lloyd's (now Playbar) offered 20 oz Natural Lights for a dollar.  The Club Charleston (now Arrow) on Fridays represented every possible mental illness, and it was a LOT of fun. \n\nLater on, we ran an improv jam south of market and would pack Rich's Club 93 afterward and i realized the only thing keeping a dive from total chaos is the service. Rich's was great back then. \n\nI recently went back to Rich's.  How can a dive bar go downhill? Well, if there's no bar-back, and the bartender is too wasted to function, empty & half-empty glasses fill the place. The junkies are still there, pathetic as ever, but they're not taken care of either. Two dartboards take up the whole front half of the bar, so basically, you almost have to walk through darts to enter the bar. Brilliant!\n\nNormally I'd say \"If I could give zero stars I would\" but this is a bar, the pint glasses had mass and did not explode spontaneously, and there weren't any moths or insects in my beer. So for that, I'm comfortable with the one star.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-10", "description": "While the crowd I went with certainly made the night a good one, there's nothing to this bar that makes it particularly enticing.\n\nThe bar itself is pretty large, with pool, a Dracula pinball game and bump shuffleboard. The decor is dark and primarily black while accented with chest level rope lighting, which kept the place unevenly lit and too bright for a dive.\n\nThe bartender is slow to take your drink order but quick to go out for a smoke while there's no one else behind the bar. Even after you get the drink anything on tap is watered down and slightly over priced. There was some free entertainment when the floor directly above us caught fire, but despite the juke box's selection of standard top 40s hits there was not disc with Fire Water Burn by the Bloodhound Gang. That would have made my night.\n\nA decent layout and bar games don't make up for the poor service, poor drinks and bad lighting. While not terrible, there are a lot of other dives in this city I would rather spend my money at.", "author": "Keith M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-20", "description": "Total Dump.  Two pool tables and a jukebox.\n\nI love this place.", "author": "Shaun L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-04", "description": "I Gotta say one of my favorite dive bars. The bartenders are super friendly and pour healthy drinks. They've got pool, darts, foozeball and all your favorite drinks. Not to mention, it's great for hosting an event or in my case, MY FABULOUS BIRTHDAY! So, for everyone who decided to check out the reviews on this place before coming to my birthday, my rating is the only one that matters...LOL... See y'all Friday!", "author": "Silvia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-11", "description": "Twas a weird hour I spent in this joint...\n\nI was already drunk when I came down from my hotel room, intent on going to Burger King for onion rings (the only reason I was going to eat said rings was for their fart power, which I intended to release up on my buddies who'd wimped out upstairs.) But, BK was closed so  I decided to swing over for a drink.  I was drawn to Club 93 because it was the only open bar I knew of in the area, and because the name of the place, about which I was actually mistaken, appealed to me.  Due to a scrawled sign above the door, I initially thought it was called \"Shuffleboard\"\n\nThe bar was spacious and empty, dirty and bright... all of this in an oddly appealing way.  The bartender was nowhere to be found, but there was a big crazy dude at the end of the bar (bonus) and a hot girl sharing a drink with what appeared to be her husband.  When I heard that her friends were going to be joining them, I decided I'd wait for the bartender.  The tattooed drink maiden eventually emerged a good 10 minutes later from her crack-smoking lair in the back.  She was friendly enough, but definitely zonked.  When I later got the bill, I was surprised to find the total was accurate.  \n\nEventually the hot girl's friends came, and they were all attractive lasses, which enticed me to stay on for a bit longer.  Also, I didn't want to go to bed so I stuck around a bit.  Things never got interesting and the time spent there would fall into the \"filler\" category of my life's unmade tv series.\n\nOverall this place is a dive's dive and I'd recommend it if you're going with a group. There is pool, a juke box and a shuffleboard table (which was covered when I got there) and doesn't seem to be populated by hostile locals (I didn't get any mean looks, only curious ones)  The booze selection isn't amazing but you'll find something you'll like.  Unfortunately, waiting 10 minutes, just to see the bartender, is lame no matter what the place... be it a crowded hot spot or an empty shithole.", "author": "jorbi p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-06", "description": "Club 93 is a Bar in real sense.. they have over 14 drafts of beers... every kind of hard liquor... welcome hospitality... n' the JUKEBOX seems like it is from Tron-world... not one but two pool tables which takes away the waiting time... n' for the people who juss come there to have a few drinks.. chit-chat.. n' have a merry time... its a sweet little friendly place... n' the club always has something special going on.. Burlesque.. live music... different kinds of shows...for me.. I just love going there for a drink or few n' the kind of environment it has takes away all my stress away!!! I never feel like leaving a review for any place that I go whether it nice or not... but this Bar.. Club 93 is jusss different!!! Check it Out!!!", "author": "Rinkesh P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-14", "description": "Yeah, whatever Sean P., I'm doin' it. =)\n\nI'm writing a review of this place!\n\nFriends randomly discovered this place, I don't know how.  But after some drinks at a club, we took a cab to meet them here.  Having never been here, no idea what to expect.\n\nDivey divey diiiiiiiiiiiive.\n\nBefore I knew it someone had ordered shots of buttery nipples for everyone and we were linked arms belting out Queen's \"Bohemian Rhapsody\".  Good times at a bar that has nothing truly remarkable inside to offer except no line for drinks and a fucking awesome (and available) jukebox.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "For the last week (and one more to go) I am dog sitting for a friend on vacation around the corner from Club 93. I live in the mission and don't wander these streets all that often on my own, so for the first few days I simply walked by peering inside to try to get a vibe. After a few days a friend and I decided to go bar hopping on a random Tuesday or something (this is normal for us) to bars we'd never been to in the area. We hit up some swanky place on Minna first (his choice) and then went to Club 93 after (my choice). It was awesome! The bartender and owner were friendly. Service was good. Drinks were cheap, and music was on the spot. Ever since then, I've been back just about every night to get a quick night cap. Every time I go in there I meet nice people and feel comfortable, safe, and welcome. I have since requested a few different friends of mine to join me at Club 93 for a drink or a quick game of pool. We always leave with smiles on our faces and money left in our pockets. I can't wait until my friend comes back from his trip to the Land Down Under so I can show him this jem that is less than a block from his front door.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-22", "description": "They have free pool and shuffleboard on Sunday and a decent selection of beers on tap.  It's a total dive, and you have to love it for that.  It's less seedy than its facade.", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-21", "description": "Damn you Club 93!   I used to go here when it was Rich's Club 93 and even had this dope portrait to give them that he said he'd put up in the bar - score!  Of course then it changes hands and now it's the Club 93.\n\nIt just doesn't have that homey charm it used to when it was Rich's.  It's more a standard divey bar.  Pool tables in the back, random juke box, and an interesting assortment of denizens.", "author": "Gene X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-19", "description": "Great dive bar, friendly patrons! Be sure to stop in when Elysha is working and say hello to her!", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-19", "description": "I don't know if it's fair to call \"The Club\" a dive bar... it's like no place else I've ever been. It's sign says it's \"In a league of it's own,\" and they couldn't be more right. This place is around the corner from my house and my brother and his best friend discovered it when they went to buy $2 40s, but the convienience store was closed. The next day I found out they hung out all night with a man who had SIN tattooed on his neck, had shots bought for them by a bum, and almost got in a fight.\n\nI had to see this place for myself. In the 2 times I've been back, (once with my bro and once with my female roommates) here is what I've witnessed:\n-After running out of pitchers, I was served Budwiser in a blender.\n-The bartender microwaved a huge Gladware container of pasta and served some of the less fiscally blessed patrons.\n-She also kept leaving the bar to play pool, so she let a regular step behind and do her job.\n-After having numerous drinks bought for us by a gay man with terrible breath and his boyfriend, the two regulars promptly walked out on their tab.\n-Never once was I asked if I wanted to start a tab, it's kinda just assumed.\n-My bartender made us free buttery nipple shots, for dessert, I think as a present for being the only women in the place.\n\nThe list goes on and on. You have to see it to believe it. Bottom line, go here if you want to drink cheaply/for free but are willing to chat with men who, like Club 93, are in a league of their own.", "author": "Jennie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-21", "description": "OK, Sarah and Nik are the best bartenders in SF.  Sarah is fucking hott with two ts and Nik is an asshole but knows how to pour a drink and listen to my bullshit.", "author": "California B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-29", "description": "Worst dive bar I have ever been to. What's up with the owner? He is creepy... The whole time he was staring at us. We paid for our 'overprized' drinks and left asap. The bartenders ......what'sup with that mess!.\n\nDefinately avoid this spot if you are a female!", "author": "l s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-24", "description": "I come to club 93 maybe once or twice a week and I've literally never had a bad experience here. I work in the industry as a bartender and love going to a place like this on my days off. The bartenders here have always been beyond nice as well as super attentive. For me personally its just a really good place to kick it alone or with a crew of people. I defenitely recommend checking it out, especially because they do any beer and any shot for $10's all the time.", "author": "Scotty L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-26", "description": "Club 93 is no longer closed.  It's been purchased by the nicest guy ever, who really knows how to work it.  It's a dive bar through and through, but the new owner is extremely kind, and his bartender was a complete sweetheart.  If you're looking to shoot pool and play a jukebox and a real down-to-earth dive bar, well, look no further.  Club 93 is your place.", "author": "Randy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-15", "description": "I don't care what other people say about this place. I love it. It's sleazy, everyone knows me as soon as I walk in, and AJ keeps me happy. It's a great place, great intentions. I admit they could do a bit more in terms of entertainment, but it's a great spot to meet interesting people you might not otherwise meet. A lot of people here have really interesting stories, and if you spend a night here, I promise you'll remember it.", "author": "Alycia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-02", "description": "Nice selction of over a dozen draft bears as well as a full bar.  Two pool tables in the rear. Pleasant and accommodating bartenders.  Close to Holiday Inn and Hotel Whitcomb.  Good clean casual fun.", "author": "Jerry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-29", "description": "I love this place and its right in my neighborhood. If anyone tells me \"i love dive bars, that's why I go to Zeitgeist\" I hit them over the head with my beer and then take them here. My friend and I poured our own beers from across the bar one night because the bartender just left to smoke pot and never came back. \n\nbrilliant.", "author": "Julia K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-09", "description": "wow.. this place is awful... the bartenders are extremely slow.. ugly and the drinks are sloppy.\n\ni went here in between meeting someone for drinks and this place .... smells like BO..\n\nold man smell.. and toothless homies... \n\nyuck", "author": "tanner r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-09", "description": "Well, it's a bar. And it's half a block from my work. If it's not half a block from your work, I wouldn't recommend going out of your way. But, but the main draw was the shuffleboard. Shuffleboard is fun, and not many bars offer the shuffleboard adventure. So I convinced my roommate to meet me for drinks after work one day and shuffleboard session. My roommate claims this is the diviest bar in SF and possibly on the entire west coast, but that may be a slight exaggeration. I digress. The shuffleboard table was covered with all types of sh*& that the bartender and another patron nicely helped remove and get this thing up and running. It looked like it hadn't been in use for anything except leaning on since the late 70's, but it was a shuffleboard table. The great search for the pucks to play took about, oh another 20 minutes. But then it was on. Pretty intense game ensued. I came out the winner I believe. No bragging though, it was my roommates first shuffleboard experience. \n\nIf this bar was a movie it would be a mix of horror and drama comedy. Hope that helps.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-07", "description": "I have been enjoying this spot for the past two years.  The patrons are friendly and the bartenders are very attentive to your drinking needs. A.J. in particular is a wonderful bartender, always game for good conversation and offers many great drink deals.  My favorite is the top shelf tequila and beer special, can't beat it! Good tunes are playing and there is a variety of games including pool. Highly suggest this establishment for a wonderful, casual good time out!", "author": "rene r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-08-17", "description": "A bar in no-man's land. Seedy little spot that's really not a destination, but makes for a great place to sit and have a brew before a show at the civic center.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-27", "description": "I come here for a beer sometimes.  It is a strange bar.  Not quite a dive, although from the clientele that would be the assumption; but no it is not a dive.  $4 PBR's and Buds prevent it from being a dive.  And the people that go there prevent it from being an appealing bar.", "author": "Anthony Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-09", "description": "I won't really get into great detail as to how I ended up here various times, but it truly is a comfortable place to get sloshed, play some ancient pinballesque games or pool, and a great jukebox...Bartender (can't remember her name) has always taken good care of me & my buds.  ONly drawback to this place is its location...nothin much else nearby...Except All-star Donuts across the street! =)", "author": "Gio G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-29", "description": "This place used to have a heart, but ever since new owner AJ took over, the bar is a sad excuse for a way to spend a night out drinking.  I was constantly hassled by bums outside while in and out of the bar.  the bathroom smell seeps into the bar.  2 terrible songs are played over and over on the jukebox..  the drinks are average price, but never stiff as they should be in a dive bar.  Id rather walk to blocks to folsom st.", "author": "barb p."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-26", "description": "haha this place is funny...i dont really think u can call this place a \"dive bar\" as it just has a different feeling from other \"dive bars\", I'd consider this more a \"Ghetto Bar\"...by the way those pictures must have been like taken years ago because that is in no way how the bar looks, it looks more run down then that...  There are old cash registers, boxes and old kegs lined up on the walls and floors, and the shuffle board is not functional as it has junk on top of it...we actually went there because of shuffle board, so it was unfortunate that it was outta commission.  the place is definitely a dump no doubt, but at least you dont have to wait in line to play pool there...the bartender also really likes to play michael jackson on the jukebox there I've noticed...not a terrible place, just a ghetto place, also the beers are $4, i'd expect it to be a little cheaper considering...", "author": "christopher h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-09", "description": "This place is amazing, I spent the better half of my bday there the other day.  I didnt know where to go and just happened to go to this amazing bar where i was treated like a queen by the friendly bar staff.  There was a drunk man and his friend who happened to come into the bar and continued to pester my girlfriends and I.  Not only where they twice our age but totally drunk.  The owner and the bartender were the only ones trying to help us.  The man who bashed this bar because they wouldn't let him play the piano is one of the two drunk idiots who thought they were cool talking to us even though we tried to make it obvious we didn't want to talk to them.  The owner and bartender saw how uncomfortable we were so when the owner didn't respond to the man in a way that was desirable, he got all mad and left.... and then our night got better!  So, to the man who wrote about hating this gem of a local bar, don't act like such an ignorant out- of -towner next time.  We love Club 93!!!", "author": "G V."}
