{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Honestly, some of the best cookies I've ever ate and I bake for living. I actually came for a job interview, but it didnt work out,  for several reasons,  having to do with time and logisticsThe owner is lovely. She loves the company, she loves  Her staff, and she loves cookies\n\nAh but I thought they were amazing.  There is  just a little taste of honey in all her cookies. The miracle is she doesn't use honey as part of her secret process. And the selection is really good too. It might sound odd, but you must try the milk chocolate blueberry. Never would have thought to mix these 2 flavors. Not in all of my baking days. I'm a believer, and tasting one will make you a believer too.", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "A cute little shop in Nob Hill. Cookies and cupcakes are my weakness so I am happy to live close to Cookie Love. They have interesting flavors. My favorite is the Campfire Cookie if you love s'mores than you are in for a treat. The Matcha Madness was interesting not too sweet. Was disappointed with the Potato Chip Pecan cookie. Dry, a little bland and I honestly did not taste the potato chip. The Bananarama is another cookie you can pass on. I love bananas and was expecting to love this but it did not stand out. \n\nYou can't pass up trying the good 'ol Chocolate Chip Cookie. To me that is a test of a good cookie place. If you can get your basic chocolate chip cookie to stand out than I'm sold. Also liked the Oatmeal Apricot. Definitely worth the checking them out. They have traditional flavors, gluten free options. Pretty reasonably priced for all natural handcrafted cookies!", "author": "Maria M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "I love a good salted chocolate chip cookie, and this one hit the spot. For just $2.50, you can get one of their cookies in flavors like campfire s'mores, white chocolate lavender, and mint chocolate chip.", "author": "Kirsten H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-02", "description": "A talent was nice enough to treat the office to lunch. This included dessert. We all ordered a treat from Cookie Love on Wednesday, January 31st through Caviar. Our delivery order arrived around 1:15pm.\n\n*Sugar Cookie: Rainbow sprinkles and whole ground vanilla beans ($2.50)\n*Potato Chip Pecan: Potato chips in a cookie ($2.50)\n*Peanut Butter Cup: All natural peanut butter topped with peanut butter cup ($2.50)\n\nI got the sugar cookie. The cookie itself was okay. Chewy, but a tad crumbly. The sprinkles actually made it better as I adore sprinkles. Gave it a nice sweetness and texture. A coworker got the peanut butter cup and gave me half. I didn't really like his cookie as it tasted a touch burnt. Plus there wasn't enough pb cup in it. I didn't try the potato chip one, but another coworker seemed to like it.\n\nI was expecting more from their cookies as I was impressed by the selection. But the texture and flavors were just okay. 3 stars.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-26", "description": "The cookies were good but nothing special nor memorable. I was expecting to 'love' the treats.", "author": "Foofa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Coming into a small shop is worth a visit.  What I'm seeing inside is absolutely a Cookie Monster's paradise.  Anyone with a sweet tooth can come here often.  Me, I'm not the kind who eats at least a batch of cookies.  Before I come home, I found the right time to stop by Cookie Love and try just one piece of cookie.  That's right!  JUST one, for $2.50.  Doesn't make any difference when I buy one expensive cookie.  None of them are vegan; however, at least one is gluten free and dairy free, the Triple Chocolate Decadence.  I never take it for a walk and eat later; I eat to try.  As I take a big bite unto the heart shaped chocolatey goodness, superb!  But it almost fall apart because it feels thin.  Every bite doesn't stick to my teeth like toffee.  After three big bites in a couple of minutes, why settle for another when the sweetness level is enough?\n\nThere are different flavors and designs to choose from in every cookies.  No matter how they're baked, here in Cookie Love is how the cookie crumble.  Oh and one more thing I need to add here.  When I ask about a type of cookie made with cricket flour, it'll take half hour to bake for perfection.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "This place is decent with nothing to die for (or travel great lengths for). I came on a Saturday afternoon and no one was there--the place just seemed dead. I note that because, while the sole employee was doing cookie things, the Cookie Love machine just wasn't spooled up and running smoothly. Here are more specific reasons I am not giving this place for than 3 stars:\n\n1) I ordered coffee and it took a while to get everything together (just didn't seem streamlined).\n2) Ordered some milk and it was nothing special (straight elementary school milk cartoon)--if you're going to be in the heart of SF, make it some organic hype thing that people like to pay more money for--not $1.50 for school lunch milk.\n3) Small flies walking on the cookies (point is more that the cookies are sitting out for a while, not that there are actually gross flies on it).\n\nOn a positive note, the cookies are better than average. I tried 4 different types and the only one really worthwhile is the Matcha Madness. I thought the lavender in the Lavender White Chocolate cookie was too strong. I do wish they all tasted more fresh and chewy.\n\nI honestly would not recommend Cookie Love unless you're Cookie Monster going nuts without your fix. There is room for a lot of improvement and they just don't have that uniqueness that would make me a return customer.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "Ah, I wanted some cookie love, but it's cookie like for me for now.\n\nI got an assortment of flavors, and liked the lower sugar and fairly strong flavors on these. Unfortunately, the texture was not my favorite. It had the chewiness I appreciate in cookies, but was a bit too thin for enough chew, but wasn't quite there on the crunchiness.\n\nMatcha-- I didn't really like the sesame seeds in this, which made a gritty sort of cookie 3/5\n\nLavender-- Strong scent, which I liked 3.5/5\n\nGinger-- This reminded me of elementary molasses cookies! 3.5/5\n\nDouble chocolate cherry-- Very chocolatey without being overwhelming, but the cherry flavor was just the fruit and not present throughout 3.25/5\n\nI also got a snickerdoodle and campfire cookie, but haven't gotten a chance to check 'em out!\n\nA tad under 3.5 overall...I think Batter or Baked Bear still has my favorite cookies in town for now!\n--\n\nEdit: We got a box of these for a coworker's bday, and they were by his desk (I joked this was his boss's way of making sure the rest of the team talks to him since he sits in another row). I got a mini sprinkle cookie-- texture is soft but lacks the chew that I love in my cookies. Tasted fresh enough though.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-21", "description": "I came here for a few cookies for my woman's march companions.  I got 2 peanut butter cup and 2 dark chocolate cherry. There were about 10 choices at the small counter.\n\nThe price was steep $2.50 each!\n\nThe cookies are not huge, about comparable to Mrs fields.\n\nI liked them, but for $2.50/per it was too much money.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "I order cookies from them all the time. They always come moist, fresh, and delicious. The triple chocolate, the blueberry and the peanut butter cup are a few of my favorites. This place is a definite must if you love dessert.", "author": "Alicia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "I was craving something sweet and finally decided to check this place out. The display of cookies will make you drool. All of their cookies are so pretty, making it so incredibly tempting to buy all the flavors. \n\nI settled for the matcha madness and the s'mores cookies. Both were truly amazing. Ashamed to say this, but I ate both cookies in one sitting....finishing them in maybe two minutes. I ate the s'mores first and first bite, thought I was in heaven. The marshmallow in the middle is everything. Super gooey and just so perfect. Just when I thought that I've had the best cookie ever, I eat the matcha madness and that one just blew my mind as well. I liked that this cookie was thicker, as the s'mores cookie was mad thin. I'm definitely going to try and resist coming back too often because my body will hate me for eating too many cookies and also, $2.50 for one cookie ain't cheap.", "author": "Annie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-13", "description": "I think the concept of this place is great... I am honestly getting tired of the cupcake and ice-cream stores aplenty and it's refreshing to see a shop selling cookies that have unique flavors. However, for me personally, I would rather go to a shop selling amazing basic cookies than a shop selling unique flavor cookies that lack in quality.\n\nI was in the Nob Hill area and was craving dessert, so I stopped by here to get some cookies to go. I thought that $2.50 per cookie was steep but reasonable given the unique flavors offered. I believe I got the pumpkin snicker doodle, campfire, peanut butter cup, caramel apple, and potato chip pecan. Almost all of the cookies tasted a fraction above grocery store-grade quality. I was pretty disappointed considering I expected these cookies to be some of the best I ever tasted. I was also starving so it's a little strange that given how hungry I was, I wasn't wolfing down these cookies like I normally would. The best cookie for me was, ironically, the potato chip pecan, which had a really great taste/texture.\n\nI honestly don't know if I will be rushing to this place anytime soon... Again, great concept, but the execution is lacking in my opinion.", "author": "Kunal N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-13", "description": "Not worth my time, money, or calories. This place turned my sugar craving into regret and shame.\n\nGot something like a ginger sugar cookie. These cookies are WAY overpriced for the quality. Definitely sometime you can make at home from grocery store premade dough. Very unimpressed.", "author": "Jeanie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-20", "description": "My co worker and I were showing down on rice bowls at Co Nam today when we decided to check this place out, since it was so close of course.\n\nMy co worker ordered 1 cookies ( campfire and chocolate chip).  She really liked the campfire because it was the perfect amount of sweetness.\n\nI ordered the peanut butter ice cream and coffee ice cream.  OMGEEEE was it delicious.  I wish I would have gotten more of the coffee ice cream, it was so good.  I really enjoyed their ice cream because it was creamy and just a lot different than the average ice cream.\n\nMy biggest peeve has to do with the sanitation of the cookies.  Since they are out in the open, uncovered, there were little bug flying all around them which is the main reason why I did not order a cookie or try my co-workers.  I think they need to keep the cookies in some sort of a display that has a cover of some kind on it, just a suggestion. No one wants a cookie with bugs landing on them! \n\nThe lady who was working was really nice so we will definitely return for more ice cream!", "author": "Sabrina J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-24", "description": "Coming from New York, you expect to pay absurd prices to get a unique flavored cookie, and when I found Cookie Love, let's just say I fell in love!! The guy at the counter recommened the S'mores cookie and the Apple Pie cookie. We tried both, and personally I am not a fan of Apple Pie in general, but points to this cookie because it really did taste like apple pie! The s'mores cookie was definitely my favorite. I'm excited to go back and try the other flavors!", "author": "Run.It.Off V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-09", "description": "These cookies are pretty good. I went in at 3 pm (they close at 6) and they were out of most flavors including basic chocolate chip which was disappointing to me and the people behind me in line. I ended up getting their triple chocolate and snickerdoodle cookies. It's $2.50 a cookie which is what you'd expect for a small shop renting in San Francisco. The triple chocolate was good but the dough was overworked so they were a bit more gummy than they should have been. Snickerdoodle was ok but wasn't very flavorful. I noticed that the cookies were not all the same size so they give you more of a homemade feel than buying from a bakery which I would keep in mind if I was purchasing cookies to bring to an event or for a special occasion, especially for the price. The cookies were all right, they tasted pretty good, the place could work on presentation as well as having a greater variety available 3 hours before they're closing on a Saturday though I understand they are closed on Sundays and may not have wanted to bake a whole lot before closing shop.", "author": "Lily R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "These cookies are literally hand crafted to make all the pain go away. Honestly hard day at work.. Cookie Love, going through a breakup... Cookie Love, mom won't stop asking about when you're having babies... Cookie Love!!! \n\nFirst of all I witnessed this hard working woman mixing the dough for the next day just minutes before closing! Everything is made fresh and everything is made in house. \n\nThe cookies are $2.50 a pop, but it is worth every penny and you will want to even pay more! They are just that good!! Do yourself a favor and get some Cookie Love Today", "author": "Cayce T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "I liked my visit to Cookie Love! I happened to walk by it during a recent visit to Polk Street, and it's hard for me to turn down anything that can satiate my sweet tooth.  When I entered, I was greeted by the owner, who was friendly and patient as I checked out the various flavors.  Even though I ended up not ordering during my first visit, when I returned later that day, she greeted me with a smile.  I appreciated her personable nature, and her great customer service will definitely be a reason for my return.\n\nOn to the cookies: the sugar cookie was excellent, with a generous coating of rainbow nonpareils. I also thought the chocolate chip cookie was solid, and both cookies had a lightly crispy exterior mixed with a soft interior.  I'll have to try some of their more unique flavors the next time I'm there; their Matcha Madness and Campfire Cookie looked pretty interesting.", "author": "Keith H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Cookie love is a warm and inviting place that has delicious cookies outstanding staff and a great Aesthetic. I will have to say the best cookies are the campfire chocolate chip cookies with a marshmallow on top. I was strongly suggest everyone come by and take a bite.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-19", "description": "Yummy cookies with unique flavors, but the prices are crazy! I purchased 18 cookies and they came out to $45! Holy crap. Prices weren't posted anywhere noticeable so it was a surprise. As someone who goes to Antoine's Cookie Shop weekly and will pay literally LESS than HALF the price for the same amount of cookies, I wouldn't come back. But it's nice to try once!\n\nFavorites:\n-CAMPFIRE: the cookie texture is awesome and the marshmallow on top is so fun! A bit too sweet for me though. \n- WHITE CHOC LAVENDER: my favorite! Great lavender essence that wasn't overpowering. \n- BLUEBERRY CHOCOLATE CHIP: nice blueberry flavor but nothing amazing. \n- CHOCOLATE CHERRY: I liked this one! Recommend for chocolate lovers. \n- BANANARAMA: per mom banana-loving mom, this was \"so so\". \n- CHOCOLATE CHIP: my typical go to, but I wasn't a fan of this one. Had a funky after taste imo but not sure if that was from the flavors from the other cookies infusing into this one. \n\nOverall, the texture and freshness of Antoine's beats this place. But come here if you're craving unique flavors and don't mind spending a lot more. \n\nWould've been really nice if they had an extra worker there too. We waited over 30 minutes for cookies that we were told would be ready in 10. Totally not the employee's fault though when you're handling a ton of delivery orders as well..by yourself!! With the prices they charge for a cookie, management should really consider hiring another person. From my experience, Antoine's cookie shop and Anthony's cookies always have 2 workers when I've been there.", "author": "Carolyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "$2.50 for a cookie?\nI had the blueberry milk chocolate.\nIt was good, had great texture of a hard cookie but just a little softness to it. Flavor was great, the blueberry was cool.\nBut $2.50 for ONE cookie? Coming here inspired me to try to make my own version because I'm sure I could make a dozen or two of these with $10\n\nI really liked this blueberry cookie from new York that was a couple days old and in comparison I'd pay $2.50 for that cookie but not this one (again).", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "THE 2ND BEST COOKIE PLACE IN SF.  \n\nIf Cookie Monster had a sister, it would be me.  The pop of turquoise paint on the wall was equally as impressive as the cookies.  \n\nCampfire Cookie\nGood Ole Chocolate Chip\nLavender White Chocolate\nMatcha Madness\nMilk Chocolate Blueberry\nChocolate Heart Sprinkle\n\nCrispy outer rim, chewy center, perfect texture, good flavor.  Will definitely come back to try everything else.  \n\nLove cookies at Cookie Love.  Definitely coming back.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "I am angry that I've not stopped in here earlier after passing by this place for the last several months. I have truly missed out on a great experience. If you like unusual types of baking or something different, this is your place. I especially love the fruit filled cookies, like the cherry and double chocolate cookies, and also the apple pie style cookies. No matter what you pick, you can tell that the quality is truly top notch. Also, the young lady whom served me was very sweet and anxious to give descriptions about all my inquiries. I love small businesses like this that truly care about the community and the people that they serve.", "author": "Timothy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Super sweet owner, and delicious cookies. What more could you ask for ?!  It's a hole in the wall spot (unfortunately, since  it deserves to be on a busier street) . But if by some miracle you read this review or see it randomly,  go there! You won't regret it. Try the campfire cookie and whatever cookie of the day they have.  I had a dozen of different cookies and was not disappointed with any . And I'm a pretty picky cookie eater nowadays !", "author": "Christian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "I tried the Matcha cookie during the Polk Street Wine Walk and it was good. It wasn't too sweet and paired well the wine. I also bought the Potato Chip Pecan cookie which was AMAZING!  It was sweet and salty which is my favorite combination.", "author": "Shondra R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "This little cookie shop is right near my apartment.  I went in and purchased three cookies.  The dark chocolate mint, matcha madness, and the bananarama.  The bananarama cookie was my favorite of the bunch.  It's like eating banana bread, the perfect texture cookie, and a pie at the same time.  All of the cookies were great. (Emphasis on were) \n\nThe downside is the cost of the cookies.  I feel like they should be priced around $1.25 each instead of $2.50.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Came here when CL just opened up.. \n\nAmazing cookies, handcrafted in store, ice cream and beverages.. \n\nMy favorite cookies are the campfire s'more, ginger molasses (yummmmmm) and double chocolate decadence.. \n\nFew years later, great staff, great quality! \n\nI can't fault the company for this but I hate the location it's skid row/tenderloin.. can be a little sketchy so be careful.", "author": "Mone J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Ordered cookies through cookie love sf (delivery through uber eats was kinda pricey = $15) for a coworkers baby shower. I had to call the store directly due to order size but the process was very quick and easy. \n\nEveryone loved the campfire smores cookie!! They were a huge hit; wish I purchased more! The snickerdoodle and milk chocolate blueberry were good too but didn't stand out as being amazing.", "author": "CL S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Perfection.\n\nWarm, gooey, delicious cookies in amazing flavors. Service was kind and the space is perfectly quaint and cute. Dangerously close to my apartment tho ;)\n\nTheir chocolate chip is my favorite but the chocolate chip blueberry and oatmeal apricot were also great. They have Humphrey Slocombe ice cream  for a la mode cookies and ice cream sandwiches. \n\n$2.50 per cookie. I think two is the perfect number for an afternoon treat.", "author": "Semuteh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "I purchased the bananarama and the potato chip cookies.  The young man who was working was seemed very passionate about the cookies and describing them. That is great to see in food shops these days. They were delicious! Very simple and basic, I feel that is what makes these amazing. Sometimes less is more. The potato cookie is indescribable, the chocolate ganache adds such a good touch. Keep up the great quality and service!", "author": "Hector D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "I would like to give Cookie Love five stars but sadly, they're not open enough for me to actually determine if they deserve it. The hours are a bit weird to stop by, especially if you're working on a 9-5 type schedule. When I have walked by to see that the store is open (happily) I have always liked my purchases. The classic salted chocolate chip is my favorite though matcha green tea, snickerdoodle, sugar cookie, peanut butter cup, and white chocolate chip lavender are also great. $2.50 for a crunchy cookie on the outside with a softer inside = yes, please!", "author": "Salma R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "Holy cats these cookies are good!  What a special treat!\nMy friend purchased a box of a dozen assorted cookie flavors and we cut them in half as \"dessert appetizers\" for our cookout party.  I tried every flavor he purchased and, OMG, I'm so glad I did. \n\nThe highlights of the tasting for me:\n*white chocolate-lavender\n*snickerdoodle\n\nThe cookies are soft, chewy, and just the right amount of firmness to not completely crumble.  They are far from mass-produced grocery bakery and too deliciously gourmet to be passed off as homemade.  \n\nFeel free to grab a dozen for a party, coworker office treat, or a hostess gift.  The box comes with a darling colorful ribbon, just for fun.  Why?  Because COOKIES!", "author": "Andrea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "A great small business that has a pretty diverse selection of cookies. For a Saturday it wasn't busy at all and their was no line. The man working at the register was very polite and didn't interrupt us which I appreciate very much. Very organized stand of napkins and etc.", "author": "Jayson U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "For those who love cookies, visit Cookie Love. This cute store is a nice addition to the neighborhood. The customer service is friendly and helpful. The cookies are good, and quite complex. I wanted to like the Matcha Madness cookie, but would prefer 2 of the main ingredients instead of 3. The Seeded Granola cookie also had too many flavors. Perhaps one should try Cookie Love's classic cookies. However, if one likes unique, gourmet cookies, try Cookie Love!\n\nThis is an updated review. 1/13/16 Customer service was great. The owner creates innovative flavor combinations. The holiday special Peppermint Chocolate Crunch looks lovely and had just the right balance of mint to chocolate. I'm now a fan and will return to try other cookies.", "author": "Carol W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "First day and killing the service at cookie love! $2.50 cookies and several flavors\n\nMake the menu board a bit more readable, market around, and you will be all there!", "author": "Kerry G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "Now who doesn't love a good cookie? Found this lil gem quite by accident while touristing through Nob Hill. The name of the shop drew me in as well as the quote on the chalkboard, so clever ;)\n\n Its such a cute and magical Lil shop nestled behind a coffee shop/bar. We came right before closing and the couple, who are also the owners, were very easy going and friendly. Ordered the cookie ala mode with white chocolate chip lavender cookie & peanut butter fudge ripple...YUM! I was in cookie heaven :))\n\nLoved the interior decor, the teal wall and a gorgeous chandelier fixture with a couple of tables. Small space but so cute!! Try it out if you wanna satisfy your sweet tooth fix, you won't be disappointed.", "author": "Wendy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-24", "description": "No restroom - one star off. You gotta eat w/ clean hands!\n\nFor $2.50 a cookie, you gotta buy the ones with interesting flavors like matcha, lavender white chocolate, milk chocolate blueberry to get the bang for your buck. My friend had the good old choc chip cookie and said it wasn't worth 2.50. I agree lol.\n\nOne thing abt me - im a sucker for interesting flavors. So matcha love is my favorite. Not too sweet and has a kick with the black sesame seeds.\nI also love the potato chip oecan chocolate- has some crisp to it bc of the potato chips!\n\nThey sell humphry slocombe's black ice cream for $4 a scoop. The black sesame one was bomb.\n\nLots of street parking. Careful to watch out for those no parking 3-7pm signs!\n\nHelp support a local business!", "author": "Inez J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "Cookie Love is a super cute little shop where the owner is behind the counter and only too happy to help you out on making the decision on what cookie(s) to get.  In picking up half a dozen as a gift, I was immediately overwhelmed.  After a lot of pacing back and forth, Erika recommended that I go with their Dark Chocolate Mint (similar to the Thin Mint!), Erika's favorite Milk Chocolate Blueberry, Matcha Madness, Campfire (my mom's favorite), Sugar, and Ginger Spice (my favorite!).  Each cookie brought something different and special to the table, and when I'm back (because let's face it, who can say no to a good cookie?) I'd love to try more of what's on the menu!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "I finally stumbled into Cookie Love after walking by countless times on my way home. I picked up a baker's dozen for my team at work, and everyone gave their vote of approval (including several self-proclaimed cookie connoisseurs).  Highly recommend sampling the entire inventory!", "author": "Chad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "$2.50 a cookie???  Who would pay those prices for a cookie?  They better be huge.  But they are not.  Okay, what the hell...I gotta try at least one since we went all the way here, right?\n\nThe two cookies that I tasted are the bomb!!  I got 1 lavender white chocolate and 1 triple chocolate decadence.  If you're a chocolate fan, you will love the triple chocolate decadence which just oozes chocolate and fudge.  Makes my mouth water just thinking about it.  The lavender white chocolate was excellent as well.  The cookies are definitely worth the price!", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Campfire cookie - soft, chewy s'mores cookie with excellent balance of sweet, chocolate, and graham cracker flavors!\n\nGood Ole chocolate chip - chunks of chocolate chip were soft and gooey, delicious!!!\n\nTriple chocolate - flourless, loved it. the chewiness of the cookie on the inside and crispiness on the outside was amazing. Super rich chocolate flavor that is to die for.\n\nLavender white chocolate - I love trying new flavors. Lavender flavor was perfect! Nice and herby, but enough sweetness to fulfill a cookie craving. White chocolates complemented it well.\n\nGREAT COOKIES!!! The price is steep at $2.50 each, but it was worth it.  All the cookies were chewy on the inside and crispy on the outside, knowing that the baker knows what he/she is doing.", "author": "Stanley C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Good cookies, curated music, and sightglass coldbrew on tap.  Reasons to stop by this cookie bakery.  Next time I'm looking at the cold brew affogato paired with a fresh baked cookie.", "author": "Timothy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "Who doesn't love cookies and Cookie Love does a great job with them!  It's a small space with a friendly staff who is open to giving you insight into which ones to get.  I bought four cookies - good old chocolate chip, milk chocolate blueberry, peanut butter cup and campfire cookie.  All were really good but my favorite was the good old one.\n\nIf you're a sweets or cookie fan, you need to try this place out.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "Gotta love SF...so many varieties, choices...\nMy fam and I tried this place for the first time today and it was a thumbs up for me.  Even if parking is always so difficult in the city, if you have the opportunity to try something new, you gotta do it.  Today was one of those days again where we're having perfect weather, family day and time to make the most of each day.  We tried their ice cream and cookie and it was delish!  The price was pretty expensive, but I think it was worth every penny!\n\nCleanliness-5\nService-5\nCookie-4\nIce cream-5\nPrice-4", "author": "Coco C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-12", "description": "Came here because of the many high-rated reviews about cookie love's cookies but I sadly do not agree.\n\nCookie love is a tiny little place with little seating, a kind baker, bright blue walls, and trays of cookies behind a glass display. Just by the looks of it, the cookies looked unique, tasty, and fresh! Sad to say, that was not the case. The cookies are 2.50 each so I got two to reach the $5 credit card minimum. Got the double chocolate cherry and the campfire smores cookie (apparently a new creation). The double chocolate cherry had sea salt sprinkled on the top and added a nice salty touch to the bitter sweet cookie, but the cookie itself was close to stale, wasn't soft/chewy/crispy in any way, and was super thin. The campfire smores cookie was better in that it was less stale tasting, but the cookie itself had the same sad texture as the double chocolate cookie and the marshmallow on top make me feel like I was eating taffy. \n\nIt would be awesome if the cookies were less stale tasting, had a better flavor and texture, but from what I've had, I won't be coming back anytime soon.", "author": "Elaina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "Chocolate Chip Cookie? Cool\nDouble Chocolate Chip Cookie? Cooler\nTriple Chocolate Chip Cookie? Awesome\nLavender Chocolate Bacon Cookie? Fudge Yeah!\n\nThere's something inherently attracting when you combine flavor profiles from all over the place. And these folks do it right. I've seen some very cleverly done cookies here:\n- Macha White Chocolate\n- Ginger Spice\n- Maple Bacon\n- Potato Chip Pecan\n- And many more!\n\nAll cookies are $2.50, and they offer Sightglass coffee and ice cream combinations. And the store is super cute, as are the smiling owners. Overall a very positive experience, will come here again.\n\n---\n\nDistinguishing factor: Take one dessert, and do it right. This is the philosophy of this cute little store with so many burgeoning flavors of cookies, you have to try at least three", "author": "Nick A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Head was spinning when I walked in. Soooooo many cookie choices!", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "Delicious!! Try the Campfire cookie, if you happen to be there when a fresh batch is ready you are in for a special treat.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "New to the city - visiting a friend, we each decided to get a cookie to celebrate a dear friend's birthday at this cute little bakery. We all shared three cookies: the ginger spice, the chocolate chip, and the matcha green. \n\nVery satisfied with this place because it's close to my friend's new apartment. What stood out to me is the bakery's service. The cookie chef was able to beguile us into getting other flavors as well, but we managed to stick to our guns and get our favorites. \n\nThis is one of many other trips that I will make to this quaint bakery. A break from the hustle and bustle of the silicon valley for sure.", "author": "Stephanie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "I love this hole in the wall.  There's a few ways you can get fat in this place but I stuck with the classic chocolate chip, fresh out of the oven.  Gooey chocolate chips and all.  I didn't care for the matcha with white chocolate.  Not a good combo (bitter matcha) and seriously too sweet (white choco chips).\n\nBeing the cookie monster that I am, I shall return to sample all.  Friendly service.  Dig the stylish decor.  \n\nBTW, they serve Humphry Slocombe ice cream.", "author": "Kris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "Cookie Love follows the trend of most s.f. bakeries/cookie makers: just a service counter with goods on display/menu of offerings. no in house seating available. background is the baking area.\n\nofferings:  cookies, ice cream, sightglass coffee.  \n\nbrew:sightglass coffee(3)\n-delightful lite smooth brew\n\n-cookies (2.5)\ndetailed explanations on left blackboard of what's available.\ndeliz chocolate one.\nalmost a dozen varietals available\n\ncrumbs:\n-parking may be difficult during prime time.\n4ish stars since no longer a cookie monster (calorie issue).", "author": "Victor G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-08", "description": "Placed an order for cookies via Caviar at 7:40, and these guys cancelled at 8pm without the courtesy of an explanation or apology. They are now closed for the evening, leaving me empty handed on the street trying to find a cookie anywhere for a pregnant wife with a huge craving right now. Thanks! Reallllly not cool", "author": "Abhimanyu Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-20", "description": "Literally yelled at D to pull the car over when I spotted CookieLove as we were driving by.  I mean, who doesn't love cookies??\n\nMy fault for buying with my eyes and not considering my wallet.  I walked out $20 bucks poorer, with only 8 cookies to show for it (yes, that equates to $2.50 per cookie).  A bit on the steep side if you ask me as the cookies aren't large, and, especially because - I hate to say it - out of all 8 that I tried, none were anything special or memorable, despite their unique flavors.\n\nMaybe it's because I didn't eat them right away, but shared them with friends later in the day.  No one, including myself, was clamoring for more.  Perhaps I'll give CookieLove a try again sometime, but only purchase one or two and eat them on the spot - maybe that's the difference maker.  Anyhow, this was a let down :( \n\nCouple notes:\n- $5 cc minimum \n- Wish I had been offered a BOGO offer like another Yelper mentioned", "author": "Mel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "I feel like most bakeries I go to, the cookies are always the most underwhelming or least interesting part of their goods. So not the case with Cookie Love. I've ordered from here via Post Mates once and became seriously obsessed with wanting to get more again next time I visited SF since these cookies are for real SO GOOD. After multiple failed times trying to order or visit for lack of time or them not being open, I got to visit the store in person last weekend. I only got three different cookies this time but after eating them I seriously wish I got more because they were just as amazing as they were the first time. Their cookies are on the chewy / soft side and break apart fairly easily, which makes it easier for sharing (if you can bear it). I particularly loved the dark chocolate mint chip and campfire cookies. Will absolutely be coming here every single time I'm in the area!", "author": "Stephany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-22", "description": "Cookie monster status - check.\n\nWhat I love here:  Cookie a la mode.\n\nA fresh baked cookie (try the peanut butter chocolate chip, matcha or even the lavender chocolate chip) and pair it with Humphrey Slocombe Ice-cream (peanut butter fudge or Tahitian vanilla, anyone?) and add in some STUMPTOWN coffee to wash it all down ... DELICIOUSLY SINFUL.  \n\nIf you feel any guilt about it, go burn it off with a good run or by pounding some weights.  Put those carbs to good use!!!! Or, come crush some treats post-workout. (if you must)", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-18", "description": "When I saw Cookie Love during one of my walks, I knew I had to make a visit because I love fresh cookies. The place caught my eye because of the cuteness of the shop. It's just a walk-in with the cookies laid out behind the glass and the rest of the shop is made up of their kitchen. The cookies were quite pricey, but I can't deny that they were quite tasty. I ordered a baker's dozen - 13 cookies. Ordered almost one of each of their cookies ranging from matcha madness to peanut butter to blueberry white chocolate. Each one of the cookies had their own texture and most importantly, were still good the next morning. My most favorite cookie was probably the lavender white chocolate as I'm a sucker for the floral flavors. Cookie Love, please come out with an earl grey cookie!\n\nCookie Love is located in one of the busier neighborhoods of San Francisco. It's probably easiest to walk here or come with someone who can stay in the car while you jump in.", "author": "Cheryl Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "I am so in love with Cookie Love ever since I walked through those store's doors. The bakers/workers are so friendly here, too. When viewing their menu, I do have to say that I love their creativity on how they are able to create and bake cookies with such unique flavors. I decided to buy the Lavender White Chocolate and Matcha Madness. Both of these cookies are delicious with the right amount of bite & texture; (each cookie = $2.50). I definitely want to try out their other cookies, such as the Milk Chocolate Blueberry. I was told that it's a favorite! I'm excited for my next visit! Thanks Cookie Love!", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "The best way to describe these cookies is its the Bi Rite of cookies!!! Anthonys Cookies would be the Mitchell's of the cookies. Both very delicious in their OWN ways!", "author": "Sarina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "I've only tried one of these from a friend, but would definitely come visit the store to pick out more flavours.  Cookies are pricey at $2.50 each, but the Lavender White Chocolate was ridiculously good.\n\nUPDATE:  Visited the shop and got so excited by all the flavours and the fact that they sell ice-cream too!  Unfortunately someone bought the last two Matcha Madness cookies into an ice-cream sandwich right before our turn, but I still managed to try 4 more flavours (see reviews below):\n\n\n---- COOKIES ----\n\nLavender White Chocolate: 4.5 stars\nThe texture of this cookie is top-notch, 5 stars, pop-and-you-can't-stop.  But there is just a tad too much lavender in it, you come out of some bites feeling like you're chewing dregs of potpourri.\n\nPotato Chip Pecan:  4 stars\nYummy savoury cookie half-coated in chocolate, with crispy pecan and potato chip bits.  I thought the plain half actually tasted better than the overwhelmed chocolate-coated half.  If you like the potato chip chocolates from ROYCE' (Japan), then you'll love this cookie.\n\nPeanut Butter Cup:  3.5 stars\nBetter, more moist and interesting than the regular CCC.\n\nGood Ole Chocolate Chip:  3 stars\nThink the salt was a little out-of-place here.  I've had better CCCs.\n\nOatmeal Apricot:  3 stars\nIt was just okay, slightly salty / slightly meh.  I've tried a fantastic apricot flapjack recipe that tasted crispy and amazing, so this baked good containing similar ingredients did not meet my expectations.", "author": "Letitia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "I am writing this review with a simple goal: to kick Cookie Love up to a full five stars. \n\nI am most definitely a cookie expert (almost as expert as the Cookie Monster!) since I come from New York where it used to be that every bakery had great cookies in one form or another. \n\nFor a big city, there are only a few places to get amazing cookies in San Francisco - vs. say fancy, very expensive cakes which seem to be everywhere. \n\nIMHO there's: Anthony's, Batter Bakery and the singular cookies of Cookie Love. \n\nOwned by a Erika who got tired of traveling in her corporate job the cookies here are mix of familiar and exotic. My faves: Oatmeal Apricot, Chocolate Blueberry, and Peanut Butter Cup.\n\nI often make sure I go up Pine Street on the way home from meetings just to stop by and get some Cookie Love. \n\nLet me know what your favorite is!", "author": "Dennis S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-06", "description": "I tried to order Cookie Love cookies through Postmates.  I ordered 12 cookies for some office friends, one of them having a birthday.  I ended up with cookie flavors I didn't order, only received 7 of the 12 cookies and was charged for 9 cookies.  I tried to contact Postmates, they are only contactable thru e-mail and delivery person wouldn't answer their mobile after they delivered.  Cookie Love just wouldn't answer their phone after multiple tries.  This completely ruined the surprise of cookies for the office.  Hopefully someone will respond to my email about being overcharged.  It is unfortunate but I will not recommend ordering cookies from Cookie Love, or ordering any other items through Postmates again. \n\nBesides being overcharged, which would make any food not taste good, the cookies were just okay.  Maybe because they were not the flavors we ordered but even the classic cookies had too much salt in them, were small and thin for the price, and were just marginal tasting.  Cookie Love should probably rethink advertising on Postmates especially if they can't handle the workload of orders.", "author": "Prof. X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "Great local cookie establishment. Tried 7 different varieties: banana, campfire and lavender were the groups favorites. Enjoyed the \"tasting experience\". Many thanks to the ladies that helped guide our teams palate.", "author": "john j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "cookie love=cookie madness these cookies are insane! \n\nyou won't go wrong with any of these cookies. one is my favorite places to order from!", "author": "Corey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "Yes, it's pricey.  But what do you expect in SF, especially for a creative bakery in this neighborhood?  Delicious and beautiful cookies - the blueberry milk chocolate is especially wonderful, and such a great combination.  I almost wish it wasn't so close so close to my office because turning this into a habit is not going to turn out well for me.", "author": "Liz B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-23", "description": "Pleasantly surprised by how good the lavender white chocolate was. There was a good balance between both of the main ingredients. These cookies have a crunchy edge and soft center which I love. Minus one star for how pricey it was. $2.50 for a medium size cookie..ouch. But I guess you can't expect anything less in sf!", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "Chocolate chip cookies are the standard by which I rate cookie awesomeness in the city - and the one here isn't quite in my top list. But Cookie Love is pretty damn good. These puppies are thinner than I personally like, but there's a good amount of balance between chewiness and softness. Add extra points for the creativity of the flavors. Major con is they're pricier than competitors, but these make great gifts and treats when I'm in the area.", "author": "Lan T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-17", "description": "15 Dollars for 6 very flat and light approximately 2 oz (some were probably less than that) cookies? I don't care how high the \"quality ingredients\" are. They should wear ski masks cause to me that's straight stealing!\n\nI went in here on Saturday afternoon while I was \"taking a walk\" with my lady friend. Planned to get a dozen for a party we were attending that night but the price turned my order into only 6 cookies. The female working was friendly, did not rush us, and helpful. After paying 15 bucks for the 6 pack, I gave her a 20 and she gave me 5 1s. If I need change I will ask...I was expecting to tip for the good service but then didn't bother.\n\nIn conclusion, I think the price for one cookie is a tad high ($2.50) but not crazy. I just don't understand why they don't give a volume discount? I saw you get an extra cookie once you spend 30 bucks...Don't get crazy, cookielove! Although there were some different flavors (I enjoyed the mint chocolate) Cookies tasted like cookies you can get at any decent bakery for at least 30 percent less. Judging by the excellent reviews, Im sure there are lots of SF residents they can convince their \"small batch, made with love, blah blah blah\" cookies are worth the extra money!", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-18", "description": "Good cookies!\n\nThe shop is cute, located right off Polk on Pine (as in, right down the street from the neighborhood post office).  Cute almost teahouse like decor, a few small tables, tea for sale, cookies are displayed behind a glass window.\n\nStaff guy was very nice and helped me pick out 3 cookies, the sugar cookie, the s'more cookie, and some type of super chocolaty thin brownie like cookie.\n\nThe cookies here are of the thin and chewy variety.  At $2.50 a pop, the price is what you would expect from a specialty place in San Francisco.\n\nI loved the s'more cookie!  Chewy, chocolaty without being overwhelmingly chocolate with a bit of gooey marshmallow in the center.  \n\nI also absolutely loved the flavor of the sugar cookie but the texture of the sprinkles were a bit much for me.  SO....MANY....SPRINKLES!  The flavor was great but the texture combo of chewy cookie with alllll the sprinkles resulted in a texture of what I can only describe as what I think sand and glue would feel like in my mouth (albeit, delicious sand and glue).\n\nThe chocolate brownie like cookie had a great flavor and was not overly sweet but was so chewy that it felt like eating a bit of chocolate caramel with every bite. The texture for me was so offputting that I would not get this flavor of cookie again (I hate stuff stuck in my teeth!).\n\nNice staff guy, solid cookies, I can see myself heading here every few months as a treat.", "author": "Mailah G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "Cookies here you will love. The staff is nice and the cookies are great. This place is tucked away so don't walk by too fast or you won't find it. Use your nose :)", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "Great first experience. As soon as we walked in, we were greeted immediately. Gave us a small sample of the lavender white chocolate chip cookie. There were about 10 different cookies to choose from - all were unique and different than the average chocolate chip or peanut butter cookie. For $8 you can get the cookie sandwich with one of 3 featured flavors. They offer $15 for half a dozen and $30 for a bakers dozen. They have coffee and milk for an additional beverage. At the end of our cookie experience, we realized that the person who was helping us was the owner. Very sweet woman. Other than the price of a cookie being a little expensive, I would recommend this cookie shop over all others.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-19", "description": "They didn't expect a cookie monster like me to roll on through the door on a week day afternoon. I need a sugar fix and as soon as I looked through that glass display, I cracked a smile of content.\n\nPrice: $2.50 per cookie\n\nTaste: Now don't get me wrong, the cookie was damn good. I only wish it could've been a tad bit more moist, especially at its $2.50 price point. That would've earned it it's fifth star.\n\nIn typical San Francisco fashion, this place uses local ingredients. it also promotes a rather unique list of drink options for being a cookie house. Kombucha and green tea were amongst the list.\n\nI decided to wrap my mouth around a maple bacon chocolate chip and peanut butter cup cookie. I of course had to wash it down with some good old-fashioned milk.\n\nIf the Martha Stewart colored kitchen atmosphere doesn't draw you in, the awesome combination of cookie flavors definitely will. Needless to say, I will be back for round two!", "author": "Sam J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-28", "description": "Oh dear, this place is unsanitary and I hope they get shut down for it. I drove into the city to try out their cookies (yes, I do this because a good pastry is worth it) and it was a huge letdown. It's a small old store, as expected, but the cookie selection wasn't big. What disturbed me the most was that I saw flies crawling on their cookies. Is it so hard to get glass covers to cover up the cookies? \n\nThe guy working the counter was neither friendly nor helpful. Since I made the trip out here, it seemed like a waste to not get anything. I purchased two cookies and left. \n\nSince I witnessed how gross the inside of the store was, I gave the cookies to a homeless guy. Hopefully he was able to enjoy them.", "author": "Julia H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-29", "description": "Ordered some Yelp favorites: Lavender white chocolate and matcha madness\n\nCookies were $2.50 so a pretty decent price.\n\nLavender white chocolate: okay, not a standout\n\nMatcha madness: tasted like sugar, did not taste any matcha \n\nOverall, disappointing since I had high expectations after seeing it's four and a half star rating.", "author": "Guilliana J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-29", "description": "If you want STALE cookies and flies flying around all over the cafe. This your go to place. Didn't like the cookies at all. Think the reviews might be FAKE!!", "author": "Ronald S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-08", "description": "I've tried to come here at a 6pm, as well as 1 pm the next day. That is within their open hours, and yet the store was closed. No one answers the phone either. I don't know what's going on with this place..", "author": "Samantha E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-04", "description": "Pricey ($2.50) for cookies that weren't spectacular or ginormous. They had interesting flavors and options I've never seen before, so I'll give it that. The texture varies per cookie; I tried the Matcha Madness and it was on the tougher side whereas the Chocolate Cherry was moist. \n\nWe stopped in on our way to our car and the storefront was too cute to resist. Great place if you're just looking to try something new and don't mind the price tag.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-26", "description": "Cookie Love is a cute little storefront/bakery serving up some magazine cover cookies. They have a great variation of cookies, from blueberry milk chocolate to matcha. I bought a packed box for the house. Although everyone was excited about the selection nobody came away with the same level of pleasure. The cookies are good but for bakery solely devoted to cookies I was underwhelmed. For my cookie fix I'll be sticking to Anthony's or any other good bakery in SF.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "I love cookies and this little shop make some good ones. My only complaint is that I live in Atlanta Georgia. Sooooo maybe cookie love can send me a giant batch of chocolate chip cookies to make me happy lol", "author": "Collin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "This place is better than Hot Cookie. The campfire cookie is amazing and so creative. Choose this little gem if you're in the hood.", "author": "jared r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "What a pleasant surprise ! I had been craving a really good peanut cookie, so I did some recon and found Cookie Love..... I got the Elvis style peanut butter cookie and 1 smores cookie... ...yum, ok, I got a chocolate mint one too....haven't eaten it yet, a girl has to pace herself......Also today, they were celebrating their 2nd anniversary, so they were offering free mini cookies......Wooo-hooo.....did I hit the jackpot !!!! They are very friendly and not rude like the cookie joint up the street....I will be back !", "author": "Maddie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "Cookie Love makes delicious cookies! We had the Matcha Madness cookie and the Triple Chocolate Decadence cookie and both were excellent! The owner gave us a warm welcome and took the time to tell us all about her different cookies. The exterior and interior of the shop is beautifully designed and is a welcome addition to the neighborhood. I look forward to returning to Cookie Love to try more of their awesome cookies in the future!", "author": "Kevin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "Stopped by here today because it's been on my Yelp bookmarks for a while and I'm glad I did! I came at 2:30 and there was nobody around, so the owner was very helpful in helping me pick out some cookies. I sampled the matcha cookie and was immediately sold on it. Great flavor, and not too sweet. $2.50 a cookie is not bad at all considering that's pretty much the standard at any coffee stop. Definitely coming back to try all the different flavors.", "author": "Austin W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-29", "description": "I came here with high hopes, but left with the taste of a sorry cookie. The place is very nice and cute, but just looking at the cookies, it was not very pleasant. They have creative flavors, but the combinations were a bit weird. I bought the white chocolate lavender cookie and the potato chip pecan cookie. I thought they were very unique flavors but they taste gross. I do not recommend those two.", "author": "Ambur -."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "Oh, my.   \n\nWhat to do, what to do, when a) desserts are conspicuously absent from the menu at Spinnerie, or b) you want dessert after dinner at Darbar but just can't face rice pudding (and are too chicken to try the Gulabi Jamun), or c) you just KNOW your gluten-free dinner date is testing you, quietly evaluating your venue choices to see how much you \"really care\"?!\n\nSo glad you asked.\n\nYou get the dinner check, push back from your table, & waddle over to Cookie Love.   They've got all the crispy chewy sexy gooey and that ain't no phooey you could possibly want for $2.50 a fix.   Cookies like Grandma made, more cookies like Grandma never even heard of (....matcha?  lavender?!?).  Mix and Matcha!!   Just gimme 6 of all of them!!  \n\nFor the price of just one dessert at any other restaurant in the neighborhood, you can savor a sampler platter of deliciousness here -   even take a few home in a bag to your peeps.   And hey, there are even cookies here that your confection-starved gluten-free date can unabashedly ravish, without that nasty \"morning after\" experience.\n\nLest you begin to feel guilty about overindulging yourself, remember that there's no junk in these cookies.   The owner professes to use locally-sourced ingredients and top-notch quality.\n\nOK,  I'm officially jealous of my SF friends now.   Maybe I'll have to come by and hit up their pull-out a little more often.  But if I keep hitting up  Cookie Love the way I'd really like to, my hosts are gonna need a sofabed with higher load capacity.  : )  \n\n In the meantime, back in NYC, I'll just have to sigh deeply, make do with Magnolia Bakery, and dream that I am still...in Cookie Love.", "author": "AM K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "I love Cookie Love! I had heard good things about this place from a friend of mine and thought I would give it a try by ordering a bunch for a party. While most people wouldn't do that with a place that they've never been to I tried my luck and I was satisfied. \n\nI put in my order and Erika was really nice and accommodating with the order (you need about 48 hours before you actually need the cookies) and I even got some free ones since I ordered 3 dozen. I love all of the different and creative flavors - the best one to me was the matcha green tea one. Those disappeared at the party in two minutes and everyone kept asking where these cookies came from. The good ol' chocolate chip is also good and I thought the pecan potato chip one was also good too!\n\nWhile I had a really great experience with the excellent service and cookies I would say that you might want to plan if you have a budget (cookies are $2.50 each), but I think it was well worth it since these cookies are delicious and obviously made with love ;). Great place, great service and delicious cookies!", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Happy to get fresh baked cookies in my hood! My faves tend to be the cookies with lots of chocolate.", "author": "Josie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-25", "description": "Great place for a quick sugar fix. They have a good variety of cookies for the daring as well as the not so adventurous. The classic chocolate chip is yummy and not overtly sweet. The salt flakes were a great addition. The campfire (I think that was the name?) - graham cracker smore cookie - was just ok. Also agreed with other yelpers that the matcha madness was too sweet.\n\n$2.50/cookie and $5 minimum for credit cards.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "Parking across the street until after lunch time and then it starts to get full around 2pm\n\n***read the last part of my of the review***\nCookies!  Soft in the middle crunchy at the ends.  If you aren't looking you would never know its there.\n\n2.50 a cookie.  I really like the milk chocolate blueberry cookie she makes.  Also had a double chocolate cherry cookie which is definitely double chocolate.\n\nShe will go through each cookie she has made it waiting to cool down.  She has little signs but she sometimes hasn't put them out.\n\nA Major plus is....pick your favorite cookie and she has Humphrey Slocomb ice cream to make a cookie ice cream sandwich.  8 dollars for that.\n\nYou should know.  There is enough salt in each cookie you can taste.  That can be a plus or minus depending who you are.", "author": "Bing D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Walked past this place while with a man friend on the way to a movie date. The shop closed at 7 and we knew it would be a tight crunch, but vowed that if we got out of the movie and could speedwalk there in time, we would treat ourselves to some cookies. We slam through the door at 6:59 and the woman was nice enough to serve us before closing up shop. We both got the apricot oatmeal which was unique and truly delightful! I was ecstatic when I saw they were delivering free cookies on postmates the other day. Campfire cookies are bomb.com", "author": "Sharon R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Whenever we come to San Francisco to visit family this is one of our first stops.  I suggest that you get there early because what is made for the day is what they have and some favorites sell out fast.  On our must have list is the campfire, the bananarama, mint chocolate chip and the snicker doodle.  They are also nice, friendly people there too.  Nice to support a local small business who make great treats with love.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Mmmmmmmmmm best chocolate chip cookie I've ever had so gooey and salty and yummy. And the whole place smells like heaven. \n\nUpdate: had to go back the next day for another chocolate chip cookie and STILL SO GOOD", "author": "Ann P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "The only thing that could make me happier about Cookie Love is if they made the Campfire cookie with dark chocolate.  I've had way too many cookies here.  And all of them have been wonderful.  Definitely give them a try.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "best cookies ever for real, so flavourful and perfect texture you look for in a cookie.", "author": "Emilie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "Boyfriend brought me here when I was having a bad day. Bless him, and oh, how he knows how to cheer me up.\n\nThis place has matcha cookies, which floored me. The thing about matcha is that so many bakers tend to be afraid of using it in sweets because it's so bitter. CookieLove was like, \"w/e\" and made an entire cookie with matcha...and also my other favorite flavor in the world, black sesame. This made for a very smoky, almost savory cookie, which was broken by the super sweet white chocolate chunks in the middle. Amazing. That is how you blend flavors together.\n\nThey also have Humphrey Slocombe ice cream. Next time, I'm going to get my matcha cookies as an ice cream sandwich with black sesame ice cream. Oh my God. It's gonna be so, so good. Bit expensive for cookies at $2.50 a pop, but they are really quite good. Savor these.", "author": "Robbin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "I went to post office, and followed my nose to the delicious smell wafting out of here. I decided that self-care looked like having one of these delicious cookies. I had the peanut butter cup and the lavender white chocolate. The peanut butter cup was cookie perfection. Both cookies were fresh, chewy, with the slight crispness...mmm. Lots of interesting flavours, and they also have ice cream and beverages like cold brew coffee and kombucha on tap. At $2.50 a cookie, it's an affordable treat, too. Well worth the calories!", "author": "Robin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "Cookie Love has the most amazing cookies. There are tons of unique options. Matcha Madness, Lavendar White Chocolate, Milk Chocolate Blueberry and Double Chocolate Cherry. How cool do those sound? \n\nThe classics are undeniably good too. By far, my favorite is the Campfire cookie with the huge marshmallow smacked on top.\n\nThe cookies have the right amount of crunchiness in the beginning and they're soft enough to be chewy. Delicious gooeyness. \n\nEat these cookies!! It's the greatest afternoon pick-me-up.", "author": "Ingrid C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "Such a wonderful addition to the neighborhood. A guilty pleasure in a great way! The potato chip pecan cookie is insane!!!! Can't wait to try all the other varieties.", "author": "Lyz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "I was on my way to Bob's Donuts when I walked by Cookie Love. I figured a cookie would satisfy my sugar craving just as well as a donut. \n\nFirst of all, the space is super cute and clean and the owner was friendly. I love me some cookies and this place is right down the street from my house.\n\nI got a flourless chocolate cookie and a ginger cookie. $5 minimum for cards, so I had to order two cookies. Otherwise, at a $2.50, I would have just gotten one.\n\nThe chocolate cookie had great flavor. However, flavor was missing from the ginger cookie. I like a spicier ginger cookie, and this one was kind of bland -- even the candied ginger lacked kick.\n\nI really want them to succeed, but unless their cookies blow people's socks off, I'm not sure they'll last. Honestly, I kind of wish I had just kept walking to Bob's. :(", "author": "Emily B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "I must say these were the most delicious cookies I've ever tasted in my life. I was completely blown away. I've never even heard of most of the flavors but I was thoroughly impressed. They were warm, right out of the oven too. The tea they serve is really tasty too. There's nothing like warm tea with a nice warm cookie. It was a really nice and relaxing spot. The staff were super nice, friendly, & welcoming. I felt like I was part of the family. I will certainly be going back for more tasty cookie treats. Thank you.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "A profound cookie experience.\n\nThe potatochip prailene something something is the best of the lot... Although, the oatmeal with apricot is Damn good also...\n\nNow if they only made lemon bars....", "author": "j o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Best cookie spot in Sf HANDS DOWN.. bananarama and the s'more cookie is what I had.  And it was love at first bite.great customer service.", "author": "Emoni M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Great cookies, great people, great small local business.  I love the unique combination of flavors, \"normal\" size of the cookie, and that they serve kombucha!  I bring my kids all the time and it doesn't feel too cramped in the small store even  with the double stroller.", "author": "Kristina E Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "Totally great, and for San Francisco relatively inexpensive ($2.50 per cookie). I got the S'mores cookie and the Lavender White Chocolate. Delicious - soft and chewy in the center but firmer on the sides. I can't wait to go back and try more!", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Stopped by after lunch at Swan Oyster Depot. We tried the campfire cookie, the chocolate chip cookie, and the oatmeal apricot cookie. Mine and the Twin's favorite was the campfire cookie. It was thin and a little crispy but mainly chewy. The chocolate chip was good too but I wished that it had a little more sea salt on top. Even though the oatmeal apricot came in third, you can tell that ALL THE COOKIES were made with awesome care and delicious ingredients. None of the cookies I shoved down my throat tasted processed or generic like it was mass produced. I ate them so fast that I didn't get to take a picture. Service was friendly and I'm glad I stopped by.", "author": "Walerz B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "Ice cream cookies coffee on my that's a wonderful thing in the morning afternoon and night remember if you all have a sweet tooth and you only want cookies if your a Cookie Monster or you have cookies monsters take him to cookie love and they will make sure your monsters are fulfilled remember they do serve coffee and ice cream and cookies butter but most of all you will leave with a smile on your face remember cookies a day keeps the doctor away I'll go to the Moon and back for a cookie I remember to try their potato chips maple cookie cookie love We Will We Will cookie you we will we will rock you I got mud on your face big disgrace writing my name all over the place cookie love will make you smile and make you fall in love with all there delicious personalities and their cookies.", "author": "Rick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "Love, love, love this place!! To be honest I haven't tried their cookies yet, but their coffee and service is awesome. I come at least once a week to get some cold brew and have brought some coworkers who love the cookies (and ice cream sandwiches!!). They have unique cookie flavors and some yummy looking classics I can't wait to try!", "author": "Samita S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "This place is so cute! I found it walking down Polk street. I got the classic chocolate chip and it was delicious! Perfect amount of chocolate, not too crispy and soft enough! It melted in my mouth. I only bought one cookie and I wish I got more! Will have to go back!", "author": "Nia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "They are the nicest people and they have delicious cookies--win win situation!!!  We had a ginger cookie that was nice and chewy and a sugar cookie with sprinkles.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "Pretty good cookies! When we went the peanut butter were coming out and we're still warm. Before we left the mint were coming out so the cookies are very fresh. Matcha madness, white chocolate lavender, potato chocolate chip, and peanut butter were the ones we tried! Cute shop definitely something to check out if you like cookies! Reasonable prices too, $2.50 a cookie!!", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "Adorable new cookie spot and instagrammer mecca in Nob Hill if you're ever looking for a quick and photogenic dessert! Delicious and unique flavors such as matcha, chocolate cherry, and maple bacon chocolate take inventive twists on the classic cookie. Cookie Love also has about 4-5 flavors of homemade icecream in case you want to do a cookie ala mode or icecream sandwich. While the $8 icecream sandwich was surely more than I'd like to spend on dessert, it was definitely delicious and in my opinion, way better than waiting in line at Cream.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "seriously. delicious. cookies.\n\nYou must check out this new tendernob spot. Every bite on the menu is made with love from a business bakery owner who is just as sweet as her cookie treats. The flavorful cookie menu serves up mouthwatering combinations like cardamom snickerdoodle, blueberry chocolate chip, double dark chocolate, sugar, and matcha white chocolate. Each treat is perfectly baked and a \"close your eyes in happiness\" experience. Specialty drinks like sightglass coffee and kombucha on tap heighten the sugar high at this adorable Pine street bakery. Worth every penny for each $2.50 cookie. Cant recommend this place enough. Warm your heart and treat yourself by getting some CookieLove in your life!", "author": "Caroline J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-03", "description": "We went here becuase of the super high rating - but to be honest, I thought the cookie we got was just fine - it wasn't something that I would DIE for or that I would go out of my way to come back for - but definitely \"good\". I thought it was a bit hard, so after I took a bite, I asked the super kind worker to warm it up for me and she did! So it was a little better that way, but still just an average cookie.", "author": "Brittany M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-12", "description": "The cookies are delicious and they have a ton of innovative flavors (green tea, lavender, etc). My issue isn't with the cookie itself but the price point! $2.5 for one cookie? Fa real?", "author": "Tina J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Love these cookies and this new business in the area. Totally what the area needed. Get the gluten free chocolate cookie and the macha.", "author": "Michael V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "Really cute place and the cookies were very fresh. They don't have a lot available so it definitely feels like they're making them daily. I think it would be great if they heated them for you. I will definitely go back!", "author": "James P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Mmm the potato chip pecan cookie I had was super yummy. It had a nice crunch to it and was half dipped in ganache = winning! Of all the flavors displayed, this was the only one that wasn't flat, but it was still crunchy with that sweet-salty combo thats super addicting.", "author": "Alexis D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Love Cookie Love\n\nSuper cute new place to get sweets just off Polk street. Service is very friendly. The blond behind the counter was generous and patient, telling me about all the exotic cookies. I opted for the milk chocolate-blueberry and the potato chip-pecan. Both were delicious. The chocolate/blueberry was subtle and delicious. Loved the potato chip!  It was inventive without being strange.  I'll be back for more the next time I'm in the hood.", "author": "Christian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "I love this cute little shop and it's delicious and imaginative cookies! The oatmeal apricot is amazing but I haven't yet tried a cookie I didn't love from this shop. It's worth seeking out!!", "author": "Tricia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Wow! Not only are these cookies DELICIOUS, but their customer service is amazing. Erica worked with me to prepare a sizable order for a company event with minimum time to spare. I couldn't recommend more highly!", "author": "Megan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "DELICIOUS! And just what I needed after having a rough day. Chocolate chip cookie with sea salt? Why didn't I think of that before? Every cookie had the right amount of sweetness and simple complexity (if you can imagine that) - the right amount of chewy and crispiness...I fell in love. It'll be hard to not want this on a weekly basis. Oh, I'm so in trouble!", "author": "Ang L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "This is the cutest addition to the neighborhood. The proprietor is the sweetest lady and she's done a great job with the space. Cookies are delicious and come on come unique flavor a like chocolate blueberry", "author": "Leyla R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-17", "description": "A little pricey for cookies but I'd pay $2.50 for the Lavender white chocolate cookie.", "author": "Jasmine Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "We stopped by Cookie Love on the way to dinner last night.  Couldn't resist having a \"pre-dinner\" dessert and also took some to go.  Cookies were fresh baked with unique ingredients, mine had potato chips in it - Delicious!  Service was outstanding.  Decor was really pretty.  Will definitely be back.", "author": "Andrea P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "Amazing! I got about 8 different types of cookies and they were fantastic. I especially loves the old fashion chocolate chip (with a light sprinkle of sea salt, the lavender white chocolate chip, and snicker doodle (which was the group favorite). I wish they opened a little earlier, but it's better for my waistline ;)", "author": "Xochitl C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "I walk by this place 3-4 times a week and it's a struggle not to pop in each time.  I don't know how/why a cookie bakery came to be in that strange little space but I'm very glad.  Just a few types of cookies to pick from and yet it's still hard to choose.\n\nWhenever I need to bring cookies to something this is my go-to place.  Super chill, super friendly, super good.  That potato chip cookie, nom nom.  Even their sugar-sprinkle cookies are good!  I didn't know a sugar-sprinkle cookie could be good!  I never knew sugar-sprinkle could be anything but a sad sad tastes-like-Safeway-linoleum thing until I came here.  Who knew?  Cookie Love apparently.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-07", "description": "Nice place that specializes in cookies.  In addition to the standard ones, they have seasonal cookies like a peppermint & chocolate flavor now (December for the holidays) that was not on their website, so try those out.  Best for take out, since it's not a coffee house to sit.\n\nOne idea: If they told us when some cookies come out of the oven, those who like warm cookies can go there to get them fresh?", "author": "Dan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "Erica makes the most amazing cookies. She has some traditional cookies and some really great unusual combos like lavender white chocolate. Love love love cookie love!", "author": "Pierre K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-24", "description": "These cookies were ok. Very standard if you ask me, but the gentleman behind the desk was very sweet and helpful. Some unique flavors as well. I wish I was more wowed.", "author": "Melissa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "The cookies here are fantastic! I had the classic chocolate chip with sea salt. Very tasty. My husband had a gluten free seeded granola cookie. I normally don't like gluten free baked goods but I tried a bite of his and it was AMAZING!! Erica the owner is a delight! If you're in the mood for some cookie love, go to Cookie Love!!", "author": "Bob W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "Some of the best cookies I've ever tasted!  I tried the matcha and double chocolate, both incredible.  Can't wait to try the maple bacon next time (make sure you check when that's available).  Also, they offer select flavors from Humphry Slocombe ice cream, so it's pretty much the perfect combo.  The owner is super sweet and you can tell she's put her heart into these cookies.  I will definitely be back!", "author": "Yue X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "Stop #2 on our cookie adventure around SF!!  As a whole, the cookies were soft, moist, and full of flavor, especially their bananarama and campfire cookie!! The customer service was phenomenal and made the experience enjoyable and definitely one to remember!!", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "The cookies are baked perfectly. Unique ice cream flavors. Great atmosphere and excellent customer service.", "author": "Francesca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Love the cookies with interesting flavors. Great service. Would recommend any cookie lover to give it a try!", "author": "J Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "Really cool little spot. Had the classic chocolate chip and peanut butter cookie. I'd like to see an organic milk option!", "author": "chris t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "These cookies are so delicious and the woman at the counter made every effort to make our visit a special one and she succeeded. Delicious cookies. Perfect flavor. I strongly recommend.", "author": "Vivi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "No more driving to Hot Cookie. This place is off the hook. We bought a box of 6 and they were gone in 2 blocks. My kids loved the triple chocolate and my favorite was the peanut butter. They are chewy and crispy in all the amounts! ERIKA the owner was super friendly and fun. She gave our kids balloons! Love this place! I am definitely going back!", "author": "nikki s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "The best remedy for Monday Morning Blues - A box of freshly baked cookies from CookieLove!  The cookies are divine!  Very unique flavors, the blueberry milk chocolate one is my favorite... and is totally acceptable to eat before 10 am :)  I look forward to visiting the shop next time I am in the area.", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Upon entrance into this charming gem of a shop,  I was greeted by the proprietress, a cute, petite blonde named Erika who was very warm, friendly and welcoming. The space was modern, clean and uncluttered. I must say I love, loved, LOVED the cookies! There was a variety to choose from including classics like peanut butter cup  and double chocolate chunk. I must say the peanut butter cup cookie was unlike any I've ever had before. It was amazing! Some of my personal favorites were the lavender and the potato chip cookies. Devine!! Kombucha and spyglass coffee were also offered. I have never seen Kombucha and spyglass coffee offered on tap before. How unique! I would definitely come back here again!", "author": "Sheila C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "I have picked up a Baker's Dozen for the office a couple of times.  Everyone has their favorites.  White Chocolate Lavender made one of my co-workers definitely feel the love.  But, it is for those who have a special taste for lavender, for sure.  The Ginger Cookie was a favorite of another co-worker and mine is the Double Chocolate Cherry.  My boss is a traditionalist and just goes for Chocolate Chip.  My wife is strictly Gluten-Free and she prefers the Oatmeal Gluten-Free.  I still like to get a bunch of all that is offered and taste them all.  I keep meaning to make an ice cream sandwich out of one because I know that they serve ice cream.", "author": "Thomas R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Best darn triple chocolate decadence cookie EVER!  And it's gluten free.   AMAZING!  Love this place and you will too.  Check it out soon!", "author": "Dan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "This place is located dangerously close to where I live.  I haven't tried all of the cookies, yet, but I know I will.  So far the Maple / Pecan / Potato Chip (Yes, potato chips!) half dipped in dark chocolate is my favorite.  Some special flavors only available on the weekends - like the maple pecan bacon bite of deliciousness.  Yes, they're expensive at $2.50 each which is probably a good thing as it keeps me from buying all of the cookies at once and eating them all at once.  Much better for my waistline and my wallet!", "author": "Georgia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "Delicious and creative cookies! I loved the chocolate chip blueberry and the one dipped in chocolate with potato chips!  GREAT for client gifts or to bring to a party.  Good prices and really friendly staff!", "author": "Kristi N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-03", "description": "Loved the concept, liked the cookies. At 2.50 a cookie I was a little underwhelmed by the flavor and lack of freshness. Possibly because it was mid-day and they had been out for a few hours behind the counter? Either way, they were ok in my book. Sorry to say I've had better in the city, but I can always appreciate another gourmet cookie shop! Best of luck to them!", "author": "Steven M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "San Franciscans - Look no further for the best cookie! Cookie Love has hit it out of the park. Delicious twists on traditional favorites. Apricot oatmeal - wonderful and not too sweet. Peanut butter, crisp edges but still slightly soft in the center - Yum! And then this chocolate cookie with salt on top - outstanding! And I love the little guy/girl starting a small shop and sharing their art, especially of the edible kind!", "author": "Karla S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "I love the sugar cookie.  Brings back memories of making cookies with my grandmother when I was a kid.  I have to have a Triple Chocolate each time I stop.  If you want cookies that taste homemade, you will find them at Cookie Love.", "author": "Joerg O."}
