{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Yooo the hot dogs here are tight. They have so many to choose from. I can't wait to come here again. This place is a perfect spot to hit up after catching something at the Castro Theatre. The hot dog is reasonably priced. Below is The San Francisco. The fries is thick cut and decent. I must come back for more!!", "author": "Caitlyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "For dinner, the roommate wanted hot dogs. We decided to order delivery through DoorDash on Monday, September 3rd at 8:11pm. Our order arrived at 9:16pm. We live in Outer Richmond.\n\n*Chicago Dog: Pickle spear, tomato wedges, sport peppers, diced onion, neon green sweet relish, yellow mustard, celery salt on a poppy seed bun ($7.50)\n*Philly Dog: Sirloin cheesesteak, provolone, onion, jalapeno ($9)\n*Spicy Western Dog: Grilled onions, jalapeno, spicy sriracha BBQ sauce, topped with crispy tortilla strips ($8)\n*German Style Brat: House brat, onion, sauerkraut, brown mustard ($7.50)\n*Chili Fries: Topped with shredded cheddar and diced onions ($7.50)\n\nAll dogs ordered were Niman Ranch Beef Dogs. (You can also pick a chicken or veggie dog.) I started with the chicago dog. Simple and tasty. I always get a chicago style dog when I visit IL, so this was reminiscent of that. Next up was the german style bratwurst as I wanted a sausage. This one was okay. The sauerkraut was a little too mushy for me. The roomie got the spicy and philly dogs. The beef on top of the philly one was dry, so I would pass on this one next time. The spicy dog has a good amount of heat, so if you want spice, this is the way to go. I enjoyed the chili fries as there were no beans. (I hate beans so I always wonder if the chili served is beanless.)\n\nGood spot if you're craving a few hot dogs. Though for me, I'd suggest ordering two since one wasn't quite enough.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "Dapper: (typically of a man) neat and trim in dress, appearance, or bearing. synonyms: smart, spruce, trim, debonair, neat, well dressed, well groomed, well turned out, elegant, chic, dashing; informalsnazzy, snappy, natty, sharp, spiffy, fly. \n\nWell you don't have to be debonair for a dapper dog. On a recent foodie adventure I wandered into this tiny little shop called Dapper Dog. First thought... cute name! You obviously come in for the hotdog and it generally runs in the $8 - $10 range. Seems pricey, and I'm sure it is, but we want big and tasty, right? And in hotdogs and sausages it what counts most. So let's toss out price on busy Castro street and go with what's important...\n\nDapper Dog comes to the rescue for how a good hot dog should taste like. Great options, maybe a dozen or more to chose from, and all great choices. For me, I went with the Chili Dog with a load of Cheese as a topping! I think it ran me around $8 and with the Italian soda as a drink I paid about a Hamilton. Other choices include the classic which is the only hotdog under $8, the Bahn Mi hotdog for Vietnamese food lovers, Seattle, Chicago, New York, San Francisco hotdogs too. I was told the Salty dog was popular amongst the drunk crowds and why not since Dapper opens til at least 1am. \n\nIn the end, I recommend Dapper Dog to everyone, and heck no, you don't have to be dapper like Leonardo DiCaprio in The Great Gatsby. You can be an average Joe with a juicy hotdog fetish. And nope, this has nothing to do with fly Dachshunds...", "author": "Eric R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "I recently went to Dapper Dog in the Castro for lunch. It is adjacent to the famous Castro Theatre. As I walked into Dapper Dog to order my lunch there was a huge long line outside the Castro Theatre as patrons were lining up to experience festivities for the Jewish Film Festival.\n\nI have been vegan for 19 years now. Dapper Dog is veg-friendly as they will customize vegan any of their dogs in a whopping 15 styles. To customize it vegan they will omit non-veg items on the select styles yet some styles come default vegan if you are ordering a vegan dog. The vegan dog option is a Tofurky Beer Brat.\n\nI asked the gentleman working there what were the most popular dogs at Dapper Dog he said it was a toss up between the NY, Chicago, & the Philly.\n\nThe Chicago Dog looked interesting so that is what I went with as never had a Chicago Dog before. The Chicago Dog comes w/ tomato slices, diced onions, pickle spear, sweet green relish, sport peppers, & celery salt all on a poppy seed bun.\n\nI enjoyed it thoroughly. I'm glad I got to experience a Chicago Dog & awesome that they have vegan options here.\n\nMy family was born in NYC yet I now live in the East Bay & one of my brothers is in Chicago where his wife is from. I will be sure to take him here when he comes to visit.\n\nThe gentleman at Dapper Dog says a lot of Chicago transplants attest that it is the best Chicago Dog in San Francisco as they carry both the sport peppers & authentic green sweet relish that is hard to find.\n\nLook forward to returning to try some other customized vegan dogs!", "author": "Shane S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "When is a hot dog more than a hot dog? \n\nWhen it's a dapper dog. \n\nThe niman ranch all beef hot dogs here are wonderfully thick and juicy - but not sickeningly greasy. \n\nThe topping combinations for the multitude of viable options you can pick are pretty great. \n\nThe \"banh mi\" hot dog is my personal favorite. \n\nSecond to the New York Dog - a very simple yet classic dog with mustard and kraut. \n\nHot dogs and baseball - 2 things I love but only 1 is available year round. \n\nYes, you guessed it. Hot dogs. \n\nIf you're a workaholic like me and you use postmates regularly, this option usually shows up late night. \n\nTry it. \n\nYou just might uncover a better \"bedtime snack\" than fast food.", "author": "Jennifer C P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "I wanted spicy and I got spicy. I ordered the spicy western dog. It has tortilla chips, jalapenos, onions, and Sriracha BBQ. I devoured this thing. They have sooo many good choices. I got a kick but not an unbearable kick! \n\nThe hot dog was moist and the spicy mix was delicious and sweet. The onions added a nice touch. I want to try their other ones! Soo many to choose from. This is a tiny spot and there are some seats outside!", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "Review #116 - 2018\n\nWe showed up around 4:45 PM on May 5th and were able to place our orders right away since there was only one other customer inside the place.\n\nThe boys were extremely happy that we finally found a hot dog spot that was open.\n\nMy son got the Seattle dog, which he seemed to enjoy.\n\nOne of my nephews got a flaming hot dog, which seemed a little strange to me; but I guess teenagers enjoy weird food.\n\nMy other nephew got the spicy western, which actually looked very good since I do enjoy pickled jalapeños in my food as well.\n\nI ordered the Swiss brat, which was pretty good, but the cashier said he never heard my order so I had to wait until all the kids got their food to realize that my order never got made.\n\nWe got a large order of fries, which was tasty & very crispy.  Unfortunately, it was super windy so we couldn't really enjoy our food since we sat outside.\n\nI was pretty disappointed that I couldn't get any nice photos since the wind was blowing the papers all over the place.\n\nThe food is probably a 4-star rating, but I deducted a star because the guy seemed very inattentive and he charged us for 3 take out boxes, even though we ate there.", "author": "Sivilay T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-26", "description": "Located on Castro street is dapper dog. Was greeted by the lone person working who serves as cashier/cook.\n\nI settled on a bacon wrapped hot dog. Took about 10-15 minutes to come out . The dog was pretty good with all the fixings but not fantastic by any means .\n\nThey had a lot of different options to their credit and the gentlemen working was very friendly.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Got the munchies, come get your favorite HOTDOGS here. There has a variety of toppings and combinations to choose from, very satisfied after devouring my hotdog here! I'm normally not a hotdog lover, but this place instantly ranks up to my no. 1 hotdog place already, love how they put loads of yummy goodness and make it so cheesy for my hotdog. We got philly cheese hotdog and the classics I think, both of them are so tasty for good mid-afternoon snacks! Come stop by to give it a try, you are welcome!", "author": "Emily Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Stopped by here... and WUUUUUUT?!?!\n\nI got the \"Flamin Hot Dog\" - and like I said -- WUUUUT?!  This hot dog came with flamin hot cheetos, sriracha mayo, habanero onions, and cilantro.  Honestly, it was phenomenal.  The hot dog is a great serving size, it was juicy, and who would have thought hot cheetos with hot dogs? \n\nI honestly was shocked by how good it was.  Definitely recommend, and will come back.  Super quick, and you can take to go in a box that totally protects the dog.  Also good for IG - they have awesome unique flavors.  \n\nLoved it!", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "Great hot dog and lovely service from man behind the counter. Only detriment is price - think it is a little steep for a hot dog.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "First time trying out this place, I have to say the food was freshly cooked and tasted great. I had the pizza dog, and onion rings as a side and only thing I can say is the onion rings can be cooked just a tad bit longer but they are nice size. Typical box can feed two people.\n\nHot dog was great and had very good taste. The only thing I can wish to say was that there isn't a lot of space to enjoy the hot dog in the store itself; you would have to walk up to the street to enjoy it at the tables. I recommend this place if you want to have something then your average hot dog!", "author": "David R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-21", "description": "I had a hotdog here and it was just ok. If I was drunk and needed a quick bite, I will probably be back here. Either that or that pizza place further down the street...", "author": "Sam Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-22", "description": "Warning:  Three RAW, under-cooked, cold dogs on multiple visits.  PRICEY:  $12 for one dog and a basket of fries with NO drink!  I don't intend to return.  On the last visit, the dog gave me severe GI issues (cramping and diarrhea).  No bun ... just the dog, raw onions, and mustard.  I am concerned about the unprepared dogs sitting out and not chilled.\n\nThe fries, however, were spectacular, and put In and Out, The Melt, and Super Duper Burgers to SHAME:  HOT, lightly crispy, slightly golden brown, and perfectly cooked.", "author": "Bill S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "5 star hot dogs.\n\nJust imagine that your favorite sandwich married a hot dog and... voilá! A dapper dog is made! \nThese are some of the best dogs I've ever had. \n\nThings I love about this place: \nThe quality of the dog AND freshly baked bun are exceptional. \nThey're all under $10 and very filling. \nIt's open late and the guys are super friendly. \n\nBanh Mi \nSeattle w Cream Cheese\nCubano\nPhilly Cheesesteak,\nFlaming Hot w Cheetos\nReuben \nChili Dog", "author": "Mitzi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "AMAZING!!!! Hands down the best hot dog I've had in such a long time!! WILBERTH, great guy! He made everything perfectly and then some..... Great food! Great place to eat! Can't wait to go back! Here is a pic of us with WILBERTH", "author": "Kelly A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "Yummy chicken dog -- everything about it was perfect, except... I like a dog that's a little bit charred on the outside. They cook these a little too \"slippery\" for my liking!", "author": "Vivian K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "I've come here intermittently for a couple years now, but have been inspired to review after I ordered their chili last night for the first time. I loved it (with cheese and onions), it's enough for a light meal or heavy snack, and it's cheap (for SF) at $4.50. Would have gotten a bowl to go just to heat up another time if it had been convenient. Will get again for sure.\n\nI've had the hot dogs a bunch in the past, both regular and Bratwurst. Can't go wrong with those if you're in the mood.\n\nStaff has always been really nice in my experience.", "author": "J.P. M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-03", "description": "So not happy with this place. Tried calling in my take-out order several times and no one answered. When I arrived, the two employees were standing outside people watching. The food was mediocre. The bacon tasted like it was made the day before. The buns were really dry and the place smelled like the deep fryer oil was old. I was only there for a few minutes and my clothes smelled like I'd been working in a kitchen for 10 hours. No thanks...never again.", "author": "Demetri A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-16", "description": "Hot meat in a bun. \nI thought I would gag trying to get that big meat in my mouth. \nI tried the classic dog (it's big) with relish, onion, & mustard. Nice sturdy bun to hold that Niman Ranch beef dog and fixings. The dog was a little salty, but fairly good. Fries were fresh out the fryer so they were good. I guess I expected that meat to satisfy me...but as any female can tell you all meat ain't good meat. Lol.", "author": "Rene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "The next time I'm drunk in the Castro, I'll have to swing by here for some post-drinking food.  If you're not in the mood for one of the many pizza places in Castro, then Dapper Dog has a nice alternative.  I love the variety of toppings they have here.  I ended up getting the Flaming Hot Dog, which wasn't as spicy as it sounded (still great though).  It came with some spicy sriracha, cilantro, and flaming hot cheetos on top of a thick juicy hot dog.  Great combination.  This place is great if you're in need of a midnight snack or just something lighter.", "author": "Bryson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "Hot dogs are always delicious in my book, but dapper dog does it pretty gooood. Parking isn't great here, expect to look for a while. This place is tiny with only three seats outside and stand in tables inside!\n\nSubway ran out of ingredients so we headed over to check out the hot dogs here. We shared the philly cheese steak dog & the potato croquettes. The philly cheese steak dog was soo good, it was hearty, basically just meat on top of meat. It also had a touch of cheese and jalapenos to top it off, t'was really good and filling. The potato croquettes were okay, they were fun to split in half (cus of the melting cheese in the center), but wasn't my favorite. Shoutout to the workers too, they were really friendly & warned us to not burn ourselves w/ the fresh potato croquettes :)\n\nDefinitely going to come back to try the other cool hot dogs, probably the banh mi hot dog!", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Love Dapper Dog! We go pretty regularly because it's become our new favorite quick spot in the Castro. The Wake Up dog, the Pizza dog, and the Reuben dog are delicious. The classic is good as well. Love their hotdogs and the fresh buns! Quick, fast, delicious.", "author": "Ashley N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Late night on a Friday, this was one of the places around that stayed open late so I grabbed a weenie to-go. \n\nI ordered the Wake Up dog w/ a Niman Ranch Beef dog. Hearty and tasty, though pricey at $7+. Much juicier than other hot dogs I've gotten from hot dog carts downtown though and DD offers a lot of different hot dog options. \n\nI'll probably be in the mood for these in another late-night situation.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Ok so maybe it seems a little extreme to give a basic hot dog place 5-stars, but these folks deserve it. In addition to serving the drunken revelers of the Castro well into the night, they also offer fast-food without being fast food to the locals being lazy about dinner. Affordable and creative they win major points with me for having both chicken and veggie dogs. My favorite is the salty dog which comes with a pickle spear and bacon...because bacon. Plus, they use quality ingredients and don't even balk when I ask to skip the bun.\n\nThere is a dude who is often there wearing a Giants hat. I get the sense that he's either the owner or manager because he's there so often, but he's the bomb! Efficient and super friendly. I always feel so welcome there which is pretty dang nice considering it takes only minutes to grab your food.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-18", "description": "A banh mi hot dog?  I'm in!\n\nI went here while waiting in line for the theater next door to watch Hamilton.  I'm glad I did because the show was long and I would have been starving. \n\nThe banh mi was good, the toppings you'd expect with a hot dog and a solid bun holding it all together.  It's good the bun held up because otherwise, it would have been a mess.  How does it compare to a regular banh mi sandwich?  I don't think it's as good, but it'll do in a pinch.", "author": "Denis S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "This was a delicious experience. Fast and clean. Will highly recommend. Pizza dog was a really cool mix!!", "author": "Nick V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "I stopped in here after getting off the metro late (10pm) and in dire need of food before walking home. After searching around on Yelp, I saw Dapper Dog. I've walked by several times, but never gone in. I picked up a Seattle Dog and headed home. I wasn't sure what to expect, but my first bite was hot dog bliss. The dog was large and delicious, but I was surprised by how good the bun was. Nicely steamed, and the right amount of soft and chewy. I will definitely be back to try a number of their signature dogs.", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Dapper serves up Niman Ranch dogs, so naturally they're amazing.\n\nThe banh mi dog in particular is spectacular. The fries remind me of the kind you'd get at the pool with the only $5 in your pocket... so they're obviously great too.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "I really enjoyed their banh mi dog, the jalapeño with the carrots and sauce gave it just the right amount of crunch and flavor I needed. I regret I didn't order fries to accompany my hot dog. \nI sat outside and people watched while I'm sure people gawked at me happily eating this concoction with sauce all over my mouth. There's really only four small tables outside for customers only to exchange glances and enjoy the good weather if you're lucky. \nI was lucky enough to be mid chew jalapeño and shoving misplaced carrots in my mouth when someone in passing asked what I had ordered. Too good.", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-22", "description": "3.5 for this hot dog enthusiast, ai was able to sample their signature chicago dog and their san francisco dog.\n\nParking on the castro is always an issue and time limit on the meters usually 30min so do a grab and go of you can\n\nThere is no real seating area more like stand and eat. The dogs they offer are heavy, dogs have to be at least quarter pound based on the size. The chicago dog did not live up to its name, it had all the color and looks of an awesome dog but on first bite not snap, gotta have that snap, toppings included long wedged pickle two slices, diced relish then a mustard that had seeds in it. Taste wise it is ok, it is hearty but lacked that freshness I was able to sample once upon a time in chicago\n\nThe San Francisco dog was overpowered with the melted cheese, there was also bell peppers, grilled onions and more of that seeded mustard, if anything I would recommend the chicago dog over the sf dog\n\nAgain no seating area, just stand and eat\n\nif I am to come back the chilli dog looks more promising, add and egg and add bacon looks like a clear winner.\n\nHot dogs ***.5 for the chicago dog a B since it did look appealing but sadly lacked the super freshness if you ever had a real chicago dog. The SF dog sadly was a C- just that cheese was to overpowering again no snap when biting down on the dog\nPrice $ about 8 per dog, they did offer other dogs, brats and sides for more $\nService ***** no complaint here very helpful staff, one man shop it looked like\nAmbiance ***** its clean in here, everything is wiped down and presentable, I can literally leave my dog on the stainless steel bar and feel comfortable eating off the stand up table", "author": "Clarence A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "I went there on 8/12/2018 and this people messed up our order giving to some one else if you don't like your job then don't do it!", "author": "Charle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "I work pretty close to here so I eat a lot of hot dogs - I'm always greeted warmly and my Salty Dog seems to get better and better every time I order it! Great food, great service. They even have veggie dogs so I can bring all my vegetarian friends, this place is so good.", "author": "Angelina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Wow!  Awesome hot dog spot with a ton of options/creations. I had the Chicago dog which was loaded and excellent.  Nice guys running the show and will be back.  Highly recommended!", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Best. Hotdogs. Ever. Something for everyone - veggie, chicken, meat, lots of spicy options.", "author": "Gen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "Excellent service, vegan options and super quick, tasty dinner before a movie.    The place was clean and the food was freshly prepared.  I'm a fan!", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "Good hot dog! We got the classic chili cheese dogs and added bacon! It's right on the beginning of Castro street two or three doors away from the famous theater. Not much seating though. Still, I'd come again.", "author": "Karmina R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-09", "description": "Just 'ok'. Nothing to make return visit for. Had a reuben, sauerkraut and melted cheese, that was good. Rather plain hot dog and plain bun, no thanks. For the money charged, I'd think there would be more, and better, options on buns and meat. If you're in the Castro, and looking for repeat business, you have to find a way to be better than the other food options. This, unfortunately, isn't better than anything.", "author": "Richard V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "This was a great place for a dog.  The menu has a great variety.  We enjoyed the Philly and the German Bratwurst - we definitely will come back here if we are ever back in San Francisco!", "author": "Paul B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Such a tiny little spot but the hot dogs pack a lot of flavor.  I like the mix of options of what type of hot dogs to order.  I got the Reuben and it was big and fulfilling.  My sons got basic hot dogs and devoured them.  Great spot with options to sit outside.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "i know it's low key gay to have my favorite hot dog spot in the castro. what's not gay, is my girl telling me her fave hot dog spot is in the castro. i been deep throating these dogs since like.... 09'.\nthey get like ... iono, 18 different type of hot dogs and it's always gonna cost u a lot of money for sum stupid but on god, this the best hot dogs u finna find out here. \nif u don't like gay, fk u. this is a gay only event. GO HOME. \nthank u & goodnight \nedit: after we came in, bro closed the store for like 10 minutes and missed out on like 6 customers. then he opens again like it's nothing. made no sense.\nso if it's closed, stick around just a lil bit cuz homie will be back after chiefin or something", "author": "Jose S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "Have always wanted to try this place. I do like a good hotdog. After a noon film festival showing at the Castro I got a Bahn Mi dog to go and ate it for part of the walk home. Very good - such a pleasure to have good bread rather than the standard Wonder Bread type. Fast service.", "author": "Robin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "I don't usually eat hot dogs, but this place was DELICIOUS. Kind of pricey for a hot dog, but it was totally worth it. I would suggest going when it's nice out so you can sit outside (great views).", "author": "Jenny H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "I've been working at the Castro for quite sometime now, and I've always felt it needed a hotdog place such as DapperDog. I have not much negative things to say about this place since the food, service and cleanliness seem to all hit the mark of a fine food spot. \n\nThey have 3 different hotdogs to choose fro; beef, chicken or vegetarian. I really can't say much in regards to the last two, since I want my hotdog; thick, juicy and all beef! And their Neiman ranch beef dogs sure don't disappoint. \n\nI've tried several of their concoctions, cubano, Seattle, philly and their breakfast dogs. I must say that I'm not impressed with any of them. Aside from just going with the tradition hotdog on a bun, topped with mustard, ketchup and sauerkraut, only one type of their dogs can make it better- The Salty Dog. I mean it's bacon... You can't go wrong with that.", "author": "Jan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Oh boy, oh boy, oh boy, oh boy! I was starving after a show, and all I wanted was a hearty hunk of protein--I didn't want to sit down anywhere, get waited on, wait for my check--quick and dirty, as we sometimes have to have it.  Well Dapper Dog was quick but definitely not dirty.  I quickly fired up Yelp to monocle what was near by, and silly me didn't even realize that the fabled Dapper Dog was next door.  I submitted my customer bunless order on the Yelp app, and less than five minutes later I walked next door.  There was one solo guy manning the register and grill, and even with a line out the door, he greeted me when I walked in, could tell by my hungry bunless eyes that I was there to pick up my order, gave me some to-go utensils, and thanked me for my business.  The salty dog was EXACTLY what I needed, and it perfectly met my expectations.  The ease of yelp ordering definitely added a star.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-20", "description": "I was headed out to Chicago that afternoon so I got a hot dog for lunch - simple, easy and pretty quick. \n\nI ended up ordering the wake up dog (which has onions, bacon, and an egg). I added sriracha mayo to it, so it was nice and spicy. Honestly, I had trouble eating it since it was just a lot on top of the hot dog. All the toppings added to the hot dog were great, but it did overwhelm the dog honestly. \n\nI will admit, it was kind of awkward walking up to the store and the screens not being on. He turned it on quickly, but I honestly didn't know if it was open or closed at first. \n\nProtip: WAKE UP DOG!", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "I like the fact that there aren't any major fast food chains in the Castro, but I dislike how mediocre pizza has been the dominant quick (and late) food option.  Hence, Dapper Dog is a welcome addition to the hood!  With an array of themed hot dogs, they feel more bougie than bland concession stand.  Good size meat on an over sized bun that is usually too bready unless you choose a dog with a lot of toppings.\n\nLoaded Potato Croquettes: Who needs hot dogs when you have these deep fried balls of deliciousness?  Melty Cheez Whiz at the center of a mashed potato, bacon and chive ball with a crispy outer shell.  These should seriously be standard issue at every bar, bowling alley and fast food joint.  I actually like them better than any of the hot dogs I've tried.\n\nChicago Dog: Had the nice tang of a typical Chicago-style dog.  Maybe a little too heavy on the relish and too light on the celery salt.  But tasty enough for your Chicago fix.\n\nPhilly Dog: A little disappointing.  The \"steak\" was clumped to together like frozen Steak-umms you didn't bother to separate.  There was no Cheez Whiz just provolone; how can you have a Philly Steak without the Whiz?  And though I like jalapeños, I don't know what is very Philly about them.  However, the whole meat topped with meat is still a plus in my mind.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-09", "description": "$12 for a plain, under-cooked, barely warm hot dog with just mustard and onions without a bun and very hard, over-cooked French Fries with a glass of water?  \n\nMe think not, proprietor.  I would rather spend my money on a pack of Ball Park Beef Franks and a bag of Ore Ida Tater Tots and not even pay $8.  \n\nWhen I questioned the cost, I was given super attitude.  You can't give a celiac a break on the price since I can't eat a wheat bun?  Dapper you are not, sir.", "author": "William S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Best hot dog I have had in San Francisco. I had the Philly dog. Great food and service!", "author": "Flora V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-08", "description": "There's something highly contrived about this hot dog stand. And since it's the Castro, it's not really a stand but probably a placeholder for some failed leather strap-on shop which blows someone's theory that there can never be enough leather strap-on shops in the Castro. But wait, this is the gentrified Castro, so it was probably going to be a baby yoga studio. Instead, it's a compact spot where you can choose from a dozen specialty dogs, all just a little bit more excessive than at least what I want a hot dog to be. Two guys appear to run the spot. They are attentive to the orders but not very personable beyond that.\n\nNot that I was looking for a little chit-chat but even the battery-operated women at Saigon Sandwich say more than these guys. It was not as challenging to decide on which ones I wanted to try. I immediately discounted the Napa Dog which sounds like a cosmic joke with arugula, crumbled blue cheese, diced dried apricots and a house apricot sauce. Say what? The Philly Dog doesn't even sound like a dog. It's a cheesesteak sandwich shaped like a dog, right? And if I wanted a Classic Dog, I would have gone to Top Dog and eaten it off the top of a garbage can like I did back in my Cal Bear days. That pretty much left my order.\n\nThe first was the $6 Chicago Dog. That was quite an extravaganza with a Niman Ranch beef frank topped with chopped onions, tomatoes, yellow mustard, sport peppers, pickle spear, celery salt and a strange neon-green relish, all on a poppy seed bun (photo: http://bit.ly/1DZpkqE). Quite a glowing mess to eat but decent enough. I just had a weird feeling the florescent relish was making me look like an Austin Powers fem-bot extra. I rather liked the $6 Banh Mi Dog, a paean to the classic Vietnamese sandwich with a frank nestled with sliced cucumber, pickled carrot, jalapeño, cilantro, chopped peanuts and a splooge of sriracha mayo (photo: http://bit.ly/1x7qNZE).\n\nI liked the crunch of the ingredients although again, I have to say it was kind of a mess to eat. You'd think two topping-heavy dogs would be enough, but I decided to order a $3 side order of French Fries, and there were quite a few (photo: http://bit.ly/1Fwfj6G). The net result was that I ended up getting three little boxes of food with no offer of a bag, but I managed to snag one of the two stand-up sidewalk tables available to gorge. That was my good fortune since the 17th Street Plaza has reverted back to derelict central with the unexplained disappearance of the red chairs and tables. On crowded sing-along nights at the Castro Theater, you may want to carry your own folding stool if you want to have a seat.\n\nFOOD - 3 stars...big topping-heavy dogs in the Castro...so what's new?\nAMBIANCE - 2.5 stars...it's a stand\nSERVICE - 3 stars...not much for small talk but gets the orders right\nTOTAL - 3 stars...the distance between Chicago and Saigon is a whole lot shorter with these dogs on parade", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "I would not have stopped in, if it wasn't that I was talking to the owner Dad while walking to get coffee and he mentioned this place. I haven't had a hot dog in years. I had NYC style. The hot dog is all beef, large and juicy served with onions, kraut and mustard. I probably will go back to try the croquette potatoes and another hot dog.", "author": "Julie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-18", "description": "11:12AM:\nWalk up to open the door and it's locked. There's a sign that gives their hours and it says they open at 11AM. Their open/closed sign is turned to close.\nMe and my friend are waiting outside as the man inside sees us and continues on with his tasks. I'm guessing he was late to work.\nHe then opens the door and says \"20 more minutes\" and shuts it. \nMe and my girl are confused... like your business says it opens at 11 and it's almost 30 minutes after. \nWe stay in front of the restaurant to figure out where to eat since it was still \"closed\".\nThen the man opens the door and asks \"what do you want?\" But not in a \"what do you want I'll just make it rn\" but a \"what do you want? Get away from the door\"\nMy friend politely explains what she was going to order and that we're going to eat somewhere else.\n\nSo frustrating and inconvenient if you're on a strict lunch break.\nMaybe it was a one time thing, maybe he was having a bad morning, but that was my first encounter with Dapper dog and it was unpleasant.\nK.", "author": "Christy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-04", "description": "Service was friendly by the cute, young staff!   I asked what the favorite dog seems to be at the moment and they steered me towards \"The Chicago\".\n\nNiman Ranch beef is what the hot dogs are made up of--although you could choose from a chicken or veggie option too. \n\nThe $6.00 Chicago dog was loaded with condiments and all I can say is that the green relish was a color that I have never seen before--funky, funky.  A pickle wedge, sliced onions, peppers, tomatoes and mustard surrounded the dog in a good sized bun.\n\nI'm not a fan of the taste of Niman Ranch hot dogs--that's just a preference.  Everything else was A-ok!\n\nThe dog is  a meal in itself!!", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-27", "description": "Long schlongs and oozy balls.\n\nThe Castro, how I love thee!\n\nDon't worry, no protection needed.\n\nI saw Dapper Dog under hot new businesses on Yelp and immediately bookmarked it! A yelper saw my bookmark, paid a visit to Dapper Dog, and pre-paid for my Banh Mi Hot Dog (exactly what I would have ordered). Such a rare, random act of kindness. Thank you, Albertino M.!\n\nDapper Dog is a closet sized shop selling creative twists on the classic schlong...hot dogs taken to the next level to be exact. They're open every day until 11 pm and until 2:30 am on weekends. On the menu are 10 hot dogs, from a Classic dog, Chicago dog, to a Philly dog (w/ cheese steak), and even a Breakfast dog (w/ eggs, bacon & cheese). You get a choice of a Niman ranch beef, chicken, or veggie hot dog. Hot dogs are $5-$8 which is reasonable considering Niman ranch beef hotdogs go for over $4 apiece. There's also two sides available; savory side: Loaded Potato Croquettes ($5) and a sweet side: Cinnamon Roll Waffle ($3). CC's accepted.\n\nMy Banh Mi Dog ($6) was incredibly delicious with all the authentic layers of a legit banh mi: salty, sour, spicy, and sweet: http://bit.ly/1Dd8AO0. The toasted sesame bun nicely cradled the beefy schlong (good snap) and all its toppings. Loved the satisfying crunch from the fresh veggies (pickled carrots, cucumber) and the sprinkling of crunchy peanuts. A generous drizzle of sriracha mayo gave it a spicy creamy finish that had me licking all the corners of my mouth.\n\nYou can't have a good schlong without balls. The Loaded Potato Croquettes (4 for $5) were unlike anything I've ever had: http://bit.ly/1uxxzGN. Fried to a golden brown, the hot balls of bacon and chive mash potatoes had a cheesy center that oozed out like lava upon biting into. Even though they have a different filling than Porto's infamous balls, they may have them beat!\n\nMr. NSS also got into the schlong action with the Wake Up Hot Dog w/ bacon, fried egg, and cheese except he held the cheese ($8): http://bit.ly/1uYhD6i. He loved it. I didn't taste it but I could tell it would be bomb with the oozy egg yolk lacquering the schlong like lube.\n\nIt's a two man show and service was very friendly and efficient.\n\nThere's no seating but I think if they moved their condiment bar to the counter top in the kitchen, at least there will be a small standing area to wolf down that schlong.\n\nParking is very difficult but we got lucky. Next time, I would have someone drop me off while I get the schlongs and balls.\n\nAgain, thank you to Albertino M. for the yummy Banh Mi Hot Dog. Since I enjoyed it so much, the right and only thing to do was to pay it forward. I hope the next person enjoyed their free schlong as much I did. And, I'm hoping they paid it forward as well. Because the world needs good schlongs in their life...", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-04", "description": "D . dat banh mi dog\nA . also reuben dog\nP . plump n meaty\nP . plus fried eggs\nE . eat all the dogs\nR . really tasty food", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-06", "description": "Quick, affordable and delicious.\n\nLocated in a space smaller than my bedroom a few doors down from the Castro Theater is a late not hot dog spot that is worth stepping into. Actually there is a lot of great little spots around here, but hard to beat grabbing a dog before or after a show at the Castro Theater.\n\nThe menu has a variety of great sounding dogs, with a lot of variety. Sure, you can stick with something simple, or classic like a chili dog, or you could go all out and get a Banh Mi Dog, a Wake Up Dog, or Reuben.\n\nMy buddy and I went with the Philly Dog and damn was it good. The thick all beef hot dog was cooked perfectly, but wow was the philly cheese and meat perfect. Like I wouldn't be adverse to them making a philly cheesesteak it was that good. Now not going to lie, trying to get a bite with equal amounts cheesesteak and dog was tough, but in the end it turned into two delicious things between a bun.\n\nLot of options to chose from, and I will definitely be coming back for the Banh Mi, Cubano, and I just realized I could have added bacon to my Philly. Meat topped with meat topped with meat is usually the way to go.\n\nNote - there is no seating, but you can eat at the very tiny counter, or enjoy your street meat.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "I LOVE DAPPER DOG! I am a frequent patron and am always very happy with what I have. From plain dogs to fully dressed, they are phenomenal. I'm gluten free so I always get it without a bun and never have any problems. The dogs are fresh, ingredients are fun, and the price seems worth it (particularly for this area).", "author": "Min M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Good serving size and quality, great guy working the counter even gave a small but courteous deal for my first time, I'll be back!", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "Dapper Dog has a lot of reviews. Many of them are for hot dog variations that employ bacon, kraut, blue cheese and eggs, to name a few. I can respect that a hot dog is a blank canvas for many diners. \n\nFor me, there is only one hot dog. The Chicago Hot Dog, and it's the unit of measure whenever weighing the merits of a hot dog stand. \n\nI gave Dapper four stars. A very respectable mark. It takes into account the sesame seed buns, electric green relish, celery salt.  What makes a 5 star? \n\nSteamed Vienna hot dogs. Not grilled. Not any other brand. Also consistency regarding the sport peppers.  I've had actual \"sport peppers\" there and I've had substitutes. Both are hot /sweet, but the true sport pepper is about an 1\" to 1.5\" long, skinny and green. Not round-ish and yellow. Admittedly, the true sport pepper is very difficult to find and often \"imported\" from Chicago by those who appreciate the difference. \n\nService is excellent and so is the pricing. \n\nAs someone who has had a hot dog (or sausage) at nearly every vendor listed under hot dogs, I give Dapper the highest mark in town. \n\nps. Worst ...the wurst Chicago Dog can be found at AT&T Park. Hopefully that situation will change.", "author": "Sam G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "I guess I've always been blinded by Hot Cookie, because I seem to have missed Dapper Dog until now. It's one or two doors down... it's unassuming, and the interior is very minimal - even a little barren. I do wish they'd spruce it up a bit with decorations and maybe some chairs. Currently it's standing room only, and kind of feels like a good \"outdoor\" hot dog vendor that happens to have a roof over it.\n\nBut let's talk more about hot dogs. \n\nI'm not a \"hot dog person.\" But the menu of different varieties (topping combinations) and types of meat (pork, chicken, vegetarian, maybe 1-2 more...) caught my attention. I had a hard time deciding, but settled on the buffalo dog done up with chicken. It's SO interesting because you can't really even tell the frank is made of chicken - which could be a good thing or a bad thing, depending on what you're hoping for. I liked that it seemed to taste and feel like a true hot dog. Texture was right on the money - it had a very pleasant 'snap' when I bit into it. The toppings and the quality of the bun gave it a gourmet feel, and the size and flavor make it a very good value for the money ($5-$8 per dog). \n\nThe folks here were very nice and helpful, and service was speedy. I wish there was some seating, and more variety of sides. But would I come here again? In a heartbeat.", "author": "Catie F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-13", "description": "I believe what I witnessed last night could've been called a 'homophobic act'. \nRight in front of me was a group of 4 friends. 2 guys & 2 girls. They each ordered/paid separately. \nThe guys started making out. They appeared to be tipsy, but certainly not sloppy drunk. No more than anyone else at 2:00 am after the bars closed. \nAs I waited for my number (I was right after their group), I saw that 2 of their 4 were served, and then they called my number. \nWhen one of the guys politely asked if his order would be ready soon, the cook said, \"Your order has been ready. You were too busy over there to hear it.\"\nSeriously not cool. The cook wasn't calling the orders out in the order they were taken. He intentionally skipped those two guys. \nShould they have been making out in the restaurant? I wouldn't have. But should they be skipped over to allow their food to get cold?  \nNo. \nI won't  give my money to a company with obviously homophobic employees. If you don't like gays, don't work in the Castro.  Or maybe he's just a jealous queen?\nEither way. It almost made me cancel my own order before my number was called.\n\n** After reading some reviews where the staff are described as NOT being the friendliest, I came across a review with another complaint about the same employee that is mentioned above. He's in pic #73.   I guess some things never change. \nExcept my business practices after the bars close.", "author": "Reed S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-26", "description": "The cooks barely speak English. Need to get someone that can understand allergy issues. Had to throw out my dog over it", "author": "J D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "This place is so awesome for a late night spot to grab a bite! Great selection of gourmet hot dogs and sides in a small establishment that had only a few small tables to sit outside at. Just enough to satisfy after a show or a late night out in the city, to eat, and take in the liveliness that is the Castro. \n\nWe ordered the San Francisco dog, the Bahn Mi dog, and the potato croquettes. With a couple of sodas, it came to $25. Pricey but yummy!\n\nCroquettes had the texture of mashed potatoes that were fried into little balls with cheese in the middle. They came with a spicy/ tobsaco  tasting dipping sauce. \n\nThe dogs were delicious! They were quite big, and the meat quality was very good. Spicy mustard and Sriracha mayo were both delicious additions on either hot dog and everything tasted fresh and yummy!\n\nTotally worth the stop if you love hot dogs, or need a late night bite!", "author": "Hila P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-10", "description": "I'm not the biggest fan of hot dogs, I'm more of a burger girl myself. But oddly enough I was more than pleased with my experience at Dapper Dog. My friend and I came in about 30 minutes to closing hoping to snag a quick late night bite. Even though we came in so close to closing the person at the counter, Owen, still helped us out and had a smile on his face. He was super nice & super fun. I asked him what his favorite was and he recommended the Banh Mi hot dog. I trusted his recommendation and went along with it, as well as grabbing a drink and an order of fries. The place was small but clean, and it lacked any sort of tables to sit at inside and outside so keep that in mind. \n\nOn to the food! I wasn't expecting the flavors to mend well together, but they worked so perfectly together it was surprising how good it was. The hot dog itself was large and didn't taste like one of those phony, sad, chemical filled ones you get at the supermarket. So good. I miss it already. I haven't had this good of a hot dog ever. As for the fries I got, nothing special it's your average fry straight out the fryer. I'm definitely going to come back again soon and try out some more stuff! Someone take me back already. \n\nTip(s): Parking is a pain in the butt considering it's located right on Castro Street. There's no where to sit, but there is a counter to stand and eat at inside, and a couple tables to stand and eat at outside. So, take your pick or take it to go.", "author": "Elaine T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "BEST post drinking decision I've ever made!  I know, you're thinking that's not saying much, because we mostly make stupid decisions after drinking, but trust me Dapper Dog is amazing!  So much better than the alternative pizza places nearby.  My friend was having his birthday at nearby The Lookout...yep Sunday day drinking.  I stayed for a few hours, but then my stomach started to hurt; I knew I should have eaten beforehand!  \n\nSo we knew we were going to hit up Dapper Dog afterwards.  We decided on getting an order of the potato croquettes ($5 for 4), The Wake Me Up ($8)  for me and the Philly Cheesesteak ($8) for him.  I asked for to go since I didn't know if I'd finish my hot dog.  They charge 15 cents per box (his and mine) just an FYI.  I don't think they charged for the box for the croquettes since they best fit in there vs the hot dog dish thingy.  They let you choose from a veggie dog, chicken dog, or a beef dog. After a few minutes are dogs were ready to devour.  My Wake Me Up, looked slightly different than Cherylynn's pic.  Hers was a whole over easy egg, while mine was scrambled egg chopped up, and topped with bacon pieces, and grilled onion, and shredded cheese.  A lot of the cheese hadn't melted all the way though.  Nonetheless it was delicious and totally settled my stomach!  The hot dog though filled with fat filled ingredients actually wasn't that greasy.  His Philly Dog was pretty awesome too, beef hot dog topped with lots of sirloin beef pieces, melted provolone and onions and jalapenos.  A few minutes after we got our dogs our potato croquettes were ready.  These were like fried mash potato balls with diced up bacon and chives and filled with cheese.  They were piping hot and golden brown.  The cheese oozed out when we bit into them.  Overall, a very solid and satisfying affordable meal!  These guys are friendly too.\n\n4 stars for some delicious weiners!  Possibly my favorite place to get a dog in the Bay.  And of course they're open late, so Super Duper, they've got that on you.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "I'm generally not a fan of hot dogs, but Dapper Dog convinced me otherwise. What I hate most about most hot dogs is the quality of the dog and its proportion to the bun. Dapper Dog takes care of both these issues. They are very generous with their quantity of ingredients, placed over a tasty hot dog that is just about the same size as the bun. Plus this is SUCH an affordable price for a simple and filling meal!\n\nMy favorite part is the fact that they have their most popular items posted on a board separate from their whole menu because it's the question they get most often. More places should do this, in my opinion. Saves time and all. I got the Seattle Dog because it has CREAM CHEESE in it (omfg I love cream cheese) and my friend got the Banh Mi Dog.\n\nThey were boxed individually and carefully placed in a bag. There are a few places to stand inside and quickly devour your dog but it's probably better if you take your food to-go. The two people that helped us were very friendly and purposeful with making each hot dog. Certainly better than \"fast food\" quality even though they were \"just hot dogs.\" I already know that I'll be craving these in the future, especially since they are open late. That could be dangerous... dangerously delicious.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Hefty portions of the hot dog along with whichever toppings you decided on. I chose the philly hot dog. AMAZING!! It was like a Philly cheesesteak with a hot dog in it.", "author": "Alena T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-19", "description": "I guess its ok........the bun was stale, and the relish was just meh. I had the classic. It just wasn't very good for a place that is all about the dog.", "author": "R H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "A hot dog shop in the Castro is a little too on the nose, but instead of allowing the business to be fodder for campy jokes, they owner came up with a sophisticated name. But not to be taken too seriously, there's a sandwich board outside that reads, \"...because wieners are happiest between buns!\" \n\nHe ordered what some would call the best of both worlds -- the Philly dog -- a Neiman Ranch hot dog tops chopped sirloin, onion, hot peppers, & provolone. The cashier suggest he \"put an egg on it\" & the concoction was all the better for it. \n\nPortion of fries was more than enough for the two of us. Some were long & potatoey, others were short, well-done, & super crispy. The inconsistencies in size & texture meant we were both satisfied. You can guess which pieces I was most happy with. \n\nI ordered a veggie dog with raw white onions, mustard, ketchup, & mayo. Perfect drizzle of condiments, wonderful tasting sesame-seed bun. Next time I'll ask that they grill my dog a bit longer to get that nice crisp outside skin; each bite was missing that *snap* \n\nTotal with 2 sodas was about $22. Between the loud dance music, having no place to sit, & the handsome, flirty workers, I could've sworn we were in a bar rather than a premium hot dog shop!!! We'll be back (obviously.)", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Great tasting hot dogs with a big variety of a menu! We had the Seattle Hot Dog and Bahn Mi Hot Dog. Great flavors for a good price. \nHuge menu so we'll be back to try more and I'm dying to try the Potato Croquettes! Cheers!", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "Finally a late night spot to satisfy my forever chili cheese fries cravings.\n\nThe fries were fried to order. There is nothing better than crispy fries with melted cheese and chili.", "author": "Anne-Mary P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "When you think \"hot dog\" it isn't often you think of it as a cuisine, but dapper dog brings that thought to mind! The place is organized and clean cut, almost amazing compared to the other places on the street. \n\nThe workers there are vibrant and full of energy.. One in specific was super insightful not only with myself but with other customers (Carlos) . He gave great recommendations as to what I should try. \n\nI have tried both the Chicago and the Seattle dog. Let me tell you, the Seattle is AMAZING!! I'm not one to try new things, especially when it comes to hot dogs (I only eat chicken for years now) but they accommodated my likings with a chicken dog instead of the regular old beef. They also have veggie dog for the veggie lovers! But I was amazed with the way the condiments blended so perfectly together! My tastebuds were exploding with flavor! Loved it! If you like the cream cheese with grilled onions, this is the dog for you! \n\nOver all great experience, ambiance and super friendly staff. Definitely somewhere I recommend to all my friends and fellow food lovers. Dapper dog is the place to go! \n\nP.s. This place is also \"kid-friendly!\" Staff was so sweet and kind to my 3 year old daughter and suggested the croquettes with fries. Definitely a must try if you have kids! Such a great price for amazing tasting food!", "author": "Lorena M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-11", "description": "Wow. If I could give them 10 stars, I would - check out Dapper Dog immediately. Or if you're just in the area going Yelp hunting for a nearby tasty lunch/snack/late night treat, stop searching and go here. \n\nI'm generally wary of Castro food, but I finally decided to check this place out and am so damn happy I did. The Bahn Mi dog immediately caught my eye and the cashier confirmed it was his favorite...\n\nThe dog: they use a bun that's about twice as tall as the dog itself, which allows them to pack in all the ingredients you see next to each menu item. Brilliant. Dapper Dog just claimed the crown of best Bahn Mi in SF. Im seriously not joking...I've been to Duc Loi, Saigon, Bunn Mi, Sing Sing, Dinosaurs, etc. and this was way more delicious by far (while still staying true to the essence of the bahn mi flavor). Everything is super fresh and blends perfectly. Jalapenos, peanuts, cucumber, carrots, delicious sriracha aioli. Price of $6 is totally reasonable, especially compared to other nearby Castro haunts. I could not recommend this hotdog creation more highly. \n\nThe other menu items look equally as creative and well thought out, and I can't wait to try them all. When you consider they share a street with Sliders, La Tortilla, Sausage Factory, and Gyro Express - all incredibly subpar food establishments - Dapper dog clearly stands out. It's hands down the best quick bite in the Castro (Orphan Andy's and Mama Ji's are sit down but also worth a visit). \n\nFor some reason there's the strange phenomenon of rating restaurants in the $ price range no higher than 4 stars, but this is definitely a 4+ to 5 star joint. Check it out, you won't be disappointed.", "author": "Andres B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "I hate to put a review up when I have no eaten here, I plan to this weekend and I will update but for the moment I want to just note that their Yelp says they open at 11 but they actually open at 12.  I came here with a friend last weekend, so excited but we had to be somewhere at 12 and had to eat at Orphan Andy's instead because they actually do not open until 12.  Which sucks by the way!  I'm an early eater!  Open at 11 guys!! 11:30? Come on!  \n\nFor what it is worth, we walked by it later and the food looked incredible.", "author": "Emma H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-02", "description": "We don't really have very many fancy shmancy gourmet type of hot dog places in SF so I was excited to give Dapper Dog a try.  I'm not really a big hot dog fan, but always down to try new places.  This place is a grab and go type place.  There isn't much space inside to eat or scarf down your hotdog.  Their location is pretty ideal.  Right in the Castro near Bart where people could stop by if they were hungry.    \n\nWe decided to try the Banh Mi Dog and the Philly Dog.  The Banh Mi Dog was packed with flavor and had a siracha mayo sauce on top.  The Philly Dog was a hot dog with meat and cheese on top.  Both hot dogs were delicious, but again since I'm not a big hot dog fan...I didn't find it amazing.  Their open late which is a plus and you can see them making each and every hot dog with love - as in they're not just thrown together.  We also tried the potato croquettes which were tasty and worth the try.", "author": "Christine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Yum yum yum. I got Cuban and buddy got Philly. The bread is awesome and soft. Prices are fair and not crazy.", "author": "Sfclint O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "Great tasting dogs. Good customer service. Affordable and filling. I'm stopping by again next time I'm near Castro street in SF.", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-03", "description": "YES!  Good!  Go!\n\nFinally, SF has a decent hot dog joint.  (Sorry folks, What Up, Dog? does not count as a good hot dog place.  What Up, Dog? is exactly what's wrong with hot dog places in SF: lowest common denominator, no effort put in, no love for the product, and ignorant MFers just keep going back for more.)  \n\nDapper Dogs = Good-tasting hot dogs made with Nieman Ranch beef.  Nice and thick, and we all know girth is more important than length, right? Lots of interesting toppings, including EGG (!!) and bacon, pickle spears, and all the usual suspects (chili, cheese, onion, etc.)  \n\nHere's some tips from your ol' pal, The Food Dude:  tell them to cook the dog well done.  I know, hot dogs are made from cooked meat, there's really no reason why we couldn't eat them at room temp.  But hot dogs taste better the more you cook them.  So, let them know: \"I\"m not in a rush, I want you to cook the wiener til it's crispy!\"  \n\nTip #2: ALWAYS ask for the Brown Mustard.  Yellow Mustard is fine for your kids, but anyone over the age of 16 should be eating brown, \"deli style\" mustard.  Grow a pair, Margaret, and order the brown.  \n\nGood buns, thick franks, and they don't skimp on the toppings.  Honestly, what's not to love?  They're new - they opened for business for less than 3 weeks ago - so give them a little time to get their sea legs and work out the kinks.  But, they serve a good product, reasonably priced for the size and quality.  I can't think of a better dog in SF.", "author": "FoodDudeS F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "A hot dog place in the Castro...I'm surprised no one has actually thought of it before.  It's perfect.  \n\nI found this place after visiting my friend in Noe Valley.  We grabbed a coffee at The Cheesery and stumbled upon Dapper Dog.  I had seen the signs up, but was happy to see it had opened up after seeing \"under construction\" a few weeks before.  I'm always down to try new places and how often do you see a hot dog spot?  The place is quaint.  It is fairly small, but has a warm feel to it.  For the space they are working in, I commend the fact that they can handle all their orders in a prompt manner.\n\nThe menu has 12 varieties of dogs and a few side menu items like fries and croquettes. I like it. It's simple and easy to maneuver and I appreciate the fact that there aren't 30 things to choose from. They use quality Niman Ranch dogs and have other options like veggie or chicken dogs for you heathens out there.  \n\nWhat I have had so far:\n\nBanh Mi Dog:\nI would say this is my favorite one.  I love banh mi's, but wasn't quite sure how it would be on a dog.  The flavors meshed very well and the freshness of the carrots, jalapenos, and cilantro really cuts through the meatiness of the dog.  The sriracha mayo is a great touch and the crushed peanuts were a nice finish to it.  They killed it with this one.  There were a lot of flavors going on, but not overpowering.  Definitely recommended.\n\nChicago Dog:\nI have never had a Chicago dog, but from what people are saying on here this one is pretty legit.  I enjoyed it like all the other dogs on the menu.  It has neon green relish as if Homer Simpson made your hot dog, onions, mustard, celery salt, and a poppy seed bun.  Pretty traditional hot dog items for the most part so you can't go wrong.\n\nReuben Dog:\nI actually liked this more than I thought.  It has sauerkraut, thousand island dressing, and swiss cheese.  I was expecting it to make me feel heavy and full afterwards because of the swiss cheese, but the sauerkraut really helps with that by cutting through with its tanginess.\n\nSalty Dog:\nBACON.  Pickle spear. Mustard.  I don't really need to write anything else.  It tastes as good as it sounds.  They also don't use cheap, crappy bacon.  \n\nCroquettes:\nGet them if they haven't run out.  They make these by hand and run out pretty quick.  It's a delicious, crispy potato ball that has cheese oozing out of it.  \n\n\nThe staff is super-friendly, they've provided a fresh take on hot dogs, and they're open late which is nice too since most places in the city have a tendency to close early.  Check it out and see for yourself.", "author": "Jonathan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-10", "description": "First things first; it's no Hula (Puka) Dog. If you've been to Honolulu (and coming soon to Santa Clara), you'll know that Hula Dogs are the benchmark. Spicy Polish sausage (giggity) in my favorite, a Hawaiian bun (double giggity), with pineapple relish is the BOMB dot com. So I can't go five stars.\n\nThat said, it's a nice addition in the Castro, thank GOD it's not another coffee shop, they do a few interesting things here, and the banh mi hot dog, while not as tasty as the legit banh mi at Dinosaurs around the block, it tasty and fun.\n\nI need to come here drunk at 1am, when I think I'll give it 15 stars. But sober, mid-day, it's a respectable and solid 4.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-05", "description": "Needed a quick bite & tried the chili. Needed more meat & beans. Fine for a dog or fries but not as a bowl. Did have a nice spice though.", "author": "Tuesday R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-12", "description": "My boyfriend is a Chicago native who desperately misses his Chicago Dogs, so when we saw the 'Coming Soon' sign for this place a few months ago he was beyond excited. Every time we walked through the Castro we would walk by this place anticipating it's opening. Well, today was that day. The first time he walked in they informed him they weren't quite open yet, but to come back in a few hours. We stopped in for dinner tonight and he finally placed his order. While not quite a Chicago Dog, it was the closest thing he's seen since living here. \n\nA little pricey for a hot dog, but not terrible either. I had the Philly dog, which was pretty much a Philly Cheesesteak with a hot dog added in. Slightly bland, but still filling. Their choices are not what you'd expect from a hot dog joint, but I guess that's what makes them 'premium'. The potato croquettes would be amazing if they were filled with real cheese instead of nacho cheese, but the sriracha aioli was definitely it's saving grace.\n\nBest part is this place is open until 1, aka, we never have to suffer from the terrible decision of getting Curry Boyzz when we're drunk again. That alone is worth the trip.", "author": "Zoe T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-25", "description": "Came by on a Sunday night and they're closed, counting money at 1245 am. They close at 1 on Sundays. If you're not going to stick to your posted hours, what's the point? Utter waste of a lyft to get here. Who's going to satisfy my post work chili dog craving now???", "author": "Jon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "I normally am not a hot dog type of guy. I am more of a Super Duper person. And you can see this place almost like Super Duper but for hot dogs. \n\nIt's a pretty small place so do not expect it to send a mass amount of people inside. \n\nThe food isn't so bad. And I say this with my stomach still full from the breakfast Dapper dog. It had an egg, provolone cheese, onions and a little jalapeños to give it some kick. There is also this hot dog called the Orchard that is wrapped in bacon, green apple slices, Gorgonzola cheese, and jalapeños. Sounds yummy and a heart attack.", "author": "Vinson H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "I have had a lot of hot dogs - some might even say that I've had too many hot dogs (those people are idiots though because there is no such thing as too many hot dogs). Dapper Dog is without question, the best hot dog I have ever had. \n\nI had the Wake Up and the Cubano Dog. Both were easily awarded 10/10 on my rating scale (to be fair, I believe that all hot dogs are 10s, but these would have been 10/10 even if I didn't believe that).  If you removed the hot dog, these would be excellent sandwiches.  The addition of a delicious, perfectly cooked dog makes this something I would kill for.\n\nIt was hard to abstain from the hot dogs in the Mission as I left the bar, but I was rewarded for my patience. These weren't greasy dogs that only make your stomach feel worse when you wake up in the morning. They were absolutely perfect. I might eat one every day for the rest of my life and I'm pretty sure it would just never die because my body wouldn't be able to say goodbye to Dapper Dog.\n\nThe only negative is that they don't open until 11AM, because otherwise I would get one for breakfast every morning before I hopped on Muni.\n\nI love you, Dapper Dog.", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "I've eaten here a bunch of times, and have a few favorites.  The Chicago Dog (topped with pickle spear, tomato, onion, mustard, celery salt), The Wake Up (bacon, egg, cheese), The Banh Mi Dog (pickled veggies, peanuts, mayo), and the Cubano Dog (ham, swiss, pickle, mustard). I've also tried the Reuben Dog.   While the menu is very creative, I have to say that \"hot dog\" doesn't necessarily \"go\" with some of these themes.  I mean, there's a reason why when you order a Banh Mi at a Vietnamese restaurant (or a Cubano at a Cuban place), it never comes with a hot dog option.  Hot dog is a greasier, saltier meat than the meats normally put in these sandwiches.  That said, I order them and I largely like them, but have had a few moments where I've thought \"I'd rather be eating a Banh Mi instead of a Banh Mi hot dog\" if you catch my drift.  But when you're drunk on Castro Street, beggars can't be choosers;  you should try Dapper Dog for yourself.  Be aware that this restaurant is not a sit-down place, there's some very limited outdoor seating on nice days, but inside the restaurant itself has no tables, just two counters in the window you can sort of lean on.  This place is basically grab-and-go, which is just fine for a hot dog place, not unlike a street hot dog cart.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "Very tasty. Very convenient. Very attractive prices. Yum!", "author": "Ted C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-08", "description": "If you're a vegetarian or vegan I wouldn't say this is the best option for hot dogs. I ordered the classic veggie dog and it wasn't imitation meat, but tasted drastically different than any tofu hot dog I've eaten before. It was grey with specs of weird seasonings inside... I'm not sure how to describe it. I also wasn't a fan of the largely overpowering chopped onions. The service was great though!", "author": "Hoku L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Best hotdogs in the city. Big portions with a variety of different styles and sides. My personal favorite is the salty dog.", "author": "Donnie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-28", "description": "I wanted to give only 2 stars BUT I'm just not a hotdog person and I think that's the reason I wasn't head over heels in love. Also the one flavour of dog that I found online and wanted, they didn't have it on the menu, so an update for that might be in order.  They have a good selection and pretty much every combination you might want. Server was happy to recommend items and answer any questions I had. There are a few benches outside if you wanna sit and eat, otherwise I would just take it and walk. \n\nI ordered the Chicago dog, and my boyfriend ordered the philly dog which I have to say was a much better than my choice because it came with some yummy philly steak and cheese on top. \n\nProbably worth a try if you're a hotdog fan, and better quality than what you might find at a street vendor, but nothing super memorable or extraordinary that I would go back for.", "author": "Deanna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "Omg their banh mi dog was amazing! Had all the same ingredients as a Vietnamese sandwich but on top was drizzled in spicy mayo. Reminds me of the ones they use on sushi rolls. I really recommend if you're in the Castro and you need something quick to eat then come here and get the banh mi dog.", "author": "Frances T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "Best french fries I have had in decades!\n\nVegan dog was ok. But those fries. OMG tha fries!", "author": "Venus S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "Best hot dog in town anytime u on the castro u definitly should stop for a hot dog at dapper.", "author": "Victor M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "Good place for a slightly expensive Hot Dog (but actually a pretty affordable meal). Excellent variety and combinations of condiments. I got the Chicago Dog and the plump wiener was succulent. Only downside to the place is no indoor seating (not usually a problem but it was raining) and even outdoor is limited.", "author": "Gary B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "Had the veggie dog Seattle style. Was great! Hot dog was normal sized.", "author": "Nitesh D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "Yummy hot dogs with the choice of beef, chicken of veggie! It's a bit pricey(average range; $7-$8 dollars a hot dog)  but the portion size is huge! Love the onion rings and potato croquettes ! So addicting! This is a great late night bite.", "author": "Katherine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "Their veggie dog is amazing-balls! Texture, taste! Yum. You can get it with any of the toppings. My partner ordered some meat one and devoured it. The French fries were so crispy outside and HOT! Highly recommend it. 2 dogs with drinks and shared small fries was less the $25 in the CASTRO!", "author": "tom m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Fabulous! So unique and delicious, adorable staff.", "author": "Thurston T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Came here because I was craving a hotdog and also Sliders down the street was out of ho dogs. The hot dog was excellent. This black reminded me of Top Dog in Berkeley. I will come back here if ever I'm in the area and I want to hotdog. This is one of the best places in San Francisco for a hotdog. Hotdog plus chips plus a drink equals a good price.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "This is the best hot dog shop in the city. They have so many options and choices. I usually prefer beef hot dogs but I actually prefer their chicken hot dogs just a bit better. My favorite is the classic and my partners favorite is Bahn mi dog. I love their hours and it's great to find a place with such late hours.", "author": "Paul D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-23", "description": "Probably one of the worst hot dogs I've had in a really long time.  In fact, I had better hot dogs from the people selling on the streets.  \n\n1) Price was higher than expected\n2) Quality of the bun was cold; hotdog was actually too big and lacking flavor; relish was nasty green.\n3) Not a lot of space inside the store and when I finally got a space at the wall, the curb was weirdly high.  I'm 5'6'' but it just made it uncomfortable to lay down my hotdog in between chews.\n\nI'd be happy to give it another try but a lot of things made it not enticing.  If I have to pick between the hotdog and a slice of pizza, I'd definitely get more satisfaction from going across the street for a pepperoni slice.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "So happy this place is in the neighborhood. Quality hot dogs, many options. I like the \"classic\". Just yellow mustard and onions. Delicious!! Friendly, efficient service. The place is very clean.", "author": "Jane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "While waiting in line at the Castro Theatre, I was put on a mission to grab some food. When I was in line the previous day, I saw a couple eating some hot dogs that looked really good. And then I found out they went to Dapper Dog so I knew exactly where to go during my mission. I ordered the Napa Dog, which if I can recall, had arugula, dried apricots, an apricot sauce and maybe goat cheese. The staff seem pretty friendly and I didn't have to wait too long for my order. The Napa Dog was a hit and the mission was accomplished.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "Husband and I have been here so far five times and they're the best dogs ever.  Service is always fantastic.  Employees always upbeat.   Will continue to come here forever.", "author": "Joshua G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Just had to look in and there it was: the menu...so many choices and beef, pork or veggie dogs! The Banh Mi did it, and just a bit later there I was, reveling in the carrots and cuke slices and then it was gone! What a great dog! And there's a bunch more to try!", "author": "William M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Best hot dogs in SF!! Located @ the corner of Market & Castro, it's a tiny storefront next to Hot Cookie. Too small to eat inside, but there are 2 little tables out by the door. Menu has around 8 different specialty dogs & side items like French fries and potato croquettes. The hot dog meat is high quality, definitely not from a hot dog cart. I've tried all the different dogs from the Seattle, Chicago, to the Banh Mi. They're all good & different in their toppings. The Banh Mi seems to be the most popular; my go-to is the Salty Dog aka the bacon dog. One item of note is the Chicago dog: this is the only place in SF that uses the authentic neon green relish. Credit cards are accepted & this place is open late at night. In summary: high quality affordable hot dogs ($6+), more of a takeout place, best kept secret is their French fries: perfectly crispy golden brown & fluffy inside, simply awesome, but I digress.", "author": "Ron G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "I thought the food was ok, but the service was so amazing I'm bumping my 3.5 to a 4! \n\nTried their fries, chili fries, potato croquettes, Ruben dog, and Seattle dog. \n\nThe Seattle dog (3 stars) had too much cream cheese it was overpowering, the ruben dog (4 stars) was better. The wake up dog (4.5 stars) looked the best though with a fried egg on top!! the fries (2.5 stars) needed to be more seasoned and the chili fries (3 stars) needed more cheese. The potato croquettes (2 stars) were also not well seasoned, and the cheese inside wasn't fully melted and left a super cheap processed cheese taste in my mouth - eek!\n\nAsk for extra sauces -- they have a fun selection and the cashier is super friendly!", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-03", "description": "Over priced. But I love the selection. I ordered a Seattle dog and it was good, but I wish they put more cream cheese.", "author": "Fernilla S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-03", "description": "Not five stars until there's seating. \n\nI was very happy with my chicken banh mi dog. It was spicy and loaded with everything I like on my banh mi plus sriracha mayo. Yum.\n\nHusband's a purist. He got the beef New York with mustard, onions, and a ton of kraut. He said he likes Costco's better. But I had a bite and beg to differ. At Costco you have to plead to get barely enough kraut....\n\nSo now for the seating issue.  First we tried the 'parklet' at Castro and Market, but there were no tables as it has sort of turned into a homeless encampment. So we went back to Dapper Dog and  rudely moved the garbage can without asking so we could carve out a little space to stand and eat. \n\nHusband says three stars because he's not down with the concept and really not down with no place to sit and eat. He was hoping for Top Dog, where it's all about the sausage, and there is some seating. To me, this place is about the fixings. And I'm good with that. Ill be back when the seating gets figured out, and try the Chicago ( looked great)", "author": "El B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Came in search of a Seattle dog. As good or better than anything I've had in Washington! Sign in the window says \"the best hot dogs ever.\" Dapper Dog makes a strong argument for the title.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "Dapper Dog is delicious . It's about time the Castro got a good hotdog joint . It's clean with fast service and great food . The Chicago dog is as close to authentic as possible. The place also has a great price point too that will not break your wallet. It is a perfect spot for inexpensive great tasting  fast bite. I can't wait to go back !!!", "author": "Michael F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "My first time in came in on a whim. I was starving and a hot dog sounded heavenly.\n\nFor the most part, dapper dog delivered. I had their Beef Reuben Dog and the meat itself was fabulous. Unfortunately, I knew the dog would be consistent but I ordered it for the cheese and the sauerkraut. I don't think I got enough cheese and the sauerkraut was not the best I've tasted. As for the Thousand Island dressing, it was way too much. The bun was fantastic though - grilled and great!\n\nMaybe I'm overzealous on the stars - but the service was great. I think I just ordered the wrong thing for my tastes. I'll return and order something else for sure and can amend to five stars!\n\nAlso, limited seating so I wouldn't plan to sit and stay. Luckily it's on Castro between 17th and 18th, so you can always find a great people watching spot around the area :)", "author": "Laura C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-09", "description": "Asked for a chicken hot dog but they gave me beef! Didn't realize it until I bit into the hot dog... Oh god it was so disgusting and now my stomach is starting to hurt. I'd go back except I parked at least 15 mins away and there's never any fucking parking near the place. I'll just contact my lawyer instead...", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "Being a native of Chicago (grad school days), I mourned the horrible day mid-last year that I found out that the holy grail of all Chicago Dogs - Hot Doug's was shutting down. Such a sad loss  - and a loss that was in Chicago while I was perched in San Francisco. I put away my want, desire, and yes, craving for the perfect dog... never to be thought about again. \n\nThen came today! \n\nI saw another pleasant place pop up on Castro (right near market street)  - awesome little intersection. I walked in and there I saw it, a Chicago Dog! Wait, what, a New York Style. And, omg, the arch of the coveneant  - the Banh Mi Dog. I couldn't contain myself. \n\nBest location possible. Staff  were stellar. And the dog was beyond delicious as my eyes rolled into my head and I just kept on eating. And eating. And yes, eating. \n\nAbsolutely perfect experience. Hit the spot. \n\nRemember, these guys care about dogs so they take their time making it for you. Also, it's a real clean 'hole in the wall.' Don't expect some great views and more amazing seating - there's none. Get your dog, shake your bootie, and walk down Castro Street. \n\nHope you like it as much as I did! \n\nCheers!", "author": "Jane E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "Absolutely delicious! I wanted to go back the second I left. I am not someone who usually wants a ton of stuff on my dog, so the extravagance of available options was a little lost on me, but I got cheese, onion, and ketchup on mine and was in love. A bit pricey for a dog, but it's San Francisco. Def gonna go back.", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Great place to eat on the go! Reasonable prices and very friendly staff! Good selection of dogs for every kind of appetite! Also very clean , I would highly recommend . Only been twice now but it will quickly turn into my new favorite place to grab a quick bite in the castro. Staff tonight was great even gave me couple different sauces to try with my dog!", "author": "Angelo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "TL;DR - If you are craving a Chicago-style hot dog in SF, Dapper Dogs is really the only place around to do a proper one as far as I know.  If you are craving something new, definitely get the Bahn Mi dog, it's great.  If you want to make it a full meal, get the fries on the side.\n\n--\n\nWent back to try the Chicago Dog, and, to my delight, it now has proper sport peppers!  The poppy seed bun was also a lot fresher and soft this time.  The dog is still enormous and a bit hard to fit in my mouth, but I'm gonna chalk that up to local fare, we like our big wieners in the Castro.\n\nDespite my last review being entirely on the Chicago Dog, now that I can get over that mental hurdle and move on I think it'd only be fair if I review this place as a not just a place to get Chicago Dogs but as a place of many great hot dog offerings.\n\nThe Bahn Mi Dog is really great, despite sounding like a potentially bad idea.  The ingredients are very well balanced, which is super important in a hot dog, and gives a very consistent flavor across all bites.  The beef dog mixes very well with the cilantro and sriracha mayo and the chopped peanuts surprisingly go very well in the mix.  Another great SF fusion of street food and SE asian cuisine, definitely recommend trying it.\n\nThe Reuben Dog was pretty good, very much what you'd expect in terms of taste.  I think for the most part I'll be sticking with pastrami and rye for my Reubens (Rossi's Deli across the street has a pretty good one), though I can see myself having a hankering for this again.\n\nThe french fries are pretty standard fare, nothing fresh cut or anything, but they also hot, crisp, and plentiful so I definitely can't complain.  That they are now able to also offer fries in such a tiny hole in the wall is a plus in my book.  I only had the potato croquettes their first week, and didn't really enjoy them all that much.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "I really like this place so let me fix my recent bad review spree. \n\nFood 5 - Gourmet hotdogs with a couple sides. It's 5 star for a $5-$8 dog. I love the philly. \n\nService etc 4 - The service is great but the wait can be a little long. The wait was worth it though. \n\nAtmosphere 1 - Not a problem for me but it's just a hole in the wall, really tight inside & there's some stand up tables outside the shop. Just plan on taking it to go or chowing down outside.", "author": "Raquel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-12", "description": "Looking good.\n\nChicken dog smothered New York style with sauerkraut, onions and mustard on an oversized sesame bun. For $5 and change it was a well priced delicious mess.\n\nFriendly staff and minimal seating (hot dogs were meant to eaten standing up) add to the straightforward and efficient operation. \n\nDapper indeed.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Love the variety and the fact you can choose what type of dog you want (beef, chicken, veggie).\n\nHad the bahn mi dog and the flavors were awesome!  Definitely a go to for a quick bite when I'm in the Castro.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "HOLY SHIT! let me put it to you this way.... I got my vegetarian girlfriend to eat it", "author": "Farhad H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Juiciest, most delicious chicken dog I've ever had! Soooop yummy! I would definitely come back to this place. It's sooooo good!", "author": "Nandi R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "Great dogs! Had the salty dog and it was right on! Ordered the chili fries , also excellent! Ask for Owen or Rainey and they'll set you up nicely!", "author": "Curtis L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "I love hot dogs. And these are the best. Especially for a quick bite, I hit up this place often. Delicious.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Amazing take on hot dogs!! Salty Dog is my absolute favorite and their potato croquettes are phenomenal.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "Excellent beef and chicken dog. Love the new york.  Short and sweet", "author": "Daniel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "Holy crackers and cheese batman, this small hotdog stand is ridiculous! Great toppings BUT let's get real here. The hot dog. The red hot. The meat in tube form. IS amazing!! Nice snap with a little spice. Have a beer or 3 and come here. Do it. Now.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Great food, not many gems like this in San Francisco. Hard to find a hotdog spot that has great food. This is one of them.", "author": "Alli B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "You can get any dog in veggie form which I love. The buffalo dog was great. I'll be back because well it's the best thing after drinking in the 'stro.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "Now that los shucos is a thing of the past :( you are my go-to wiener shop!! The prices are good, the service is very friendly, and the dogs are delicious. I have tried the Bahn mi, Reuben, and good morning? It's the one with a fried egg and bacon....divine food coma.....right near the Castro muni stop, and nestled between hot cookie and the Castro theatre, it's really convenient for a treat yo self evening that won't break the bank!", "author": "Caddy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "Great Dogs. Friendly staff. It's my regular eating place when I stop by the Castro both drunk and sober.", "author": "Ben C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "Love this place, can't get enough of this when I'm black out drink. Thanks guys for being a staple in my life.", "author": "Captain Muffin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "Moving from the Midwest, I was thrilled to find a pretty legit Chicago style hotdog.  The bun was perfect and the beef seemed like good quality.  The place was clean and the service was excellent.  There's only about space for 4 people to eat inside, but it's awesome for grabbing a dog on the go.", "author": "Colby J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-12", "description": "What they're selling is condiments.  There just happens to be a hot dog in there, somewhere.  FIVE DOLLARS for the cheapest hot dog !?!?  Come on, it's a hot dog.  You can buy a whole package at a grocery store, for five dollars or less.  \nVery strange decor (a few sheets of plywood, tacked together.  Not at all inviting.\nWalk down the street, and check out, \"Sliders,\" where the burgers are sizzling over the flaming grill.  It makes me want one.  Plus, there's a whole buffet of FREE condiments from which to choose.  Plus, they have places to sit down, while you eat your burger.  THAT'S the set up that \"Dapper Dog\" should be emulating.\nAs things are now, I predict that \"Dapper Dog\" will be out of business by the Fourth of July.", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Now that they'e found their groove - I'm a big fan!   Great wieners, great toppings.  The tables out side are an added plus.", "author": "Ken P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-30", "description": "I think the hot dogs have too many bells and whistles.  I got the Wake Up Dog and while the the bacon was nice, the egg was perhaps too much as I couldn't actually take a bite with the egg and the hot dog at the same time.  It also felt dry because no sauce coated the bottom of the bun. I suppose I could have handled that by adding some ketchup or mayo (though it seems that they didn't have any mayo, which I find to be a bit odd and a super quick fix); however, with all the bells on top, it would have been lots of wet bites of egg and cheese and still dry bites of hot dog. I was also disappointed that they were out of the croquettes.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "This place is awesome and the staff are friendly and helpful. Chris was very helpful especially. I don't usually eat hotdogs, but the alternatives late at night are few. I decided I didn't want to eat pizza so I had a hotdog. I had a chili dog and it was awesome! Highly recommended. Thanks Chris!", "author": "Frank K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "I LOVE THE BAHN MI DOG! So delicious! I recommend it with onions and the chicken dog. So good. Also, the staff here is so sweet. Bassel, Carlos, and crew will take good care of your hot dog needs. Rumor has it, they're launching hot dog sliders. So innovative! Can't wait!", "author": "Zoe M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-10", "description": "4 Stars for the toppings and bun, 2 stars for the Chicken hotdog which tasted like a cheap supermarket dog.  It also took almost 4 minutes for the guy to make my Bahn Mi dog and I was the only person in the place.  Also they had one of those dumb ipad registers which took the guy over a minute of hitting and rehitiing buttos to ring up.\n\n$6 dog plus tip and tax was about $8, there are better things to get around here.", "author": "D H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Staff was very friendly and helpful, the place was clean and the food was delicious! Had the bahn mi dog, highly recommend it! Great experience :)", "author": "Kaylie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-25", "description": "Gross. Got the Reuben dog and the hotdog itself was not great, kind of salty and no distinctive flavor. The sauerkraut was alright but the \"cheese\" was horrible, not Swiss, something like feta? And the dressing was nothing like Russian. Burped up gross hot dog the rest of the night. Ew!", "author": "Tim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Great service. Great hot dogs. Got the San Francisco hot dog and it was nothing short of amazing. More surprisingly, the onion rings here are some of the best I've had in the city!", "author": "Jonathan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "Good place, the wake up and the banh mih are really good. Next time gotta try those ctoquettes! Nice that it's open late also. Only downside is it's a bit slow for a hot dog place", "author": "Kenjo H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "I'm not a huge fan of hotdogs, we'll let me rephrase, I am now a huge fan of hotdogs, these hotdogs! The loaded potato croquettes are my new favorite thing! I want them with every meal!", "author": "Joseph A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "SO GOOD! I've been looking forward to partake for weeks and it did not disappoint! Delicious dog & the best staff. :D Can't wait to return for more!", "author": "Alana D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-15", "description": "Just opened and I tried their classic veggie dog\nis was good, grilled not boiled\nand they had good buns\nI'll be back", "author": "Damion B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Great place.  Super tasty, quality menu, friendly, clean, fast, open late, checks all the important boxes. Thank you", "author": "jon s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-19", "description": "A place that knows what it wants to do and does it well.  First off, their hot dogs are creative and tasty.  I find myself thinking about getting a hotdog there on the way home.  In particular I like their Bahn Mi and Chicago Dogs.\n\nThe service is really friendly and the owner (Bazel? Basil?) is very passionate about what he does.  Every time I go back they make things slightly better and fix some broken processes.\n\nWhy not 5 stars?  Two reasons:\n\n1) I'm not a huge fan of the prices (i.e. could be a dollar lower), but it is high quality good food.  However, I shouldn't complain.  It's worth it.\n\n2) What makes me most unhappy is the lack of good sides (fries, salad, cole slaw, beans, etc.).  They have chips there and croquettes but nothing fantastic.\n\nI've heard that they'll be keeping their favorites up on the menu and changing/trying new dogs every so often.  I'm excited to try all their current dogs and the new creations that will be coming soon.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "the loaded potato croquettes we're my favorite. luckily this place wasn't full, good customer service.  the dogs are good too!", "author": "Octavio C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "a greasy hot dog place in the castro im a fan love this place ill be back", "author": "Leigh G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-29", "description": "I fear for the success of Dapper Dog as it seems to be very poorly managed in a dramatic way. We were so excited about the prospect of this place, it seems like such a great fit for the neighborhood and they have a unique product. The first time we went, at about 1PM on a Sunday, there was a sign on the door saying that they had run out of ingredients and that they wouldn't be opening that day. Really? They couldn't make a run to one of the many markets within walking distance to pick up supplies? The second time we tried on the subsequent weekend, this time at noon on Sunday (which is supposed to be the time they open), we waited patiently with other customers outside until about 12:10, when the sole employee unlocked the door, popped his head out and said that he needed another 30 minutes to prep because he was the only person there. This obviously is not the fault of that employee, he was gracious enough under pressure. The fault lies squarely with the management for understaffing and poor planning. \n\nWe will not be planning another attempt, needless to say. I can only imagine how many other potential customers are feeling similarly disenchanted. What a shame.", "author": "James W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "Tried a classic dog here for the first time today , and it was DELICIOUS !!! Good bun, excellent beef.  Will be back!", "author": "suzanne e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "Finally a good hot dog spot. Quick, fast and a nice array of different dogs to try - persoal favorites are the Reuben Dog, the Bahm Mi Dog (Genuis - A Bahm Mi hot Dog!) and the Chicago Classic.  Prices are affordable and a great alternative to a late night snack other than pizza.  This place is great.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-27", "description": "I found the \"New York Dog\" inedible and threw it away after a few bites.  Undercooked very salty dog with no \"snap\" to the casing. Sauerkraut was the wrong texture, mushy without much taste.  Yellow mustard? Not on a New York.  Ugly presentation, wrapped in foil which covered everything inside with mustard making it hard to eat.  An unappetizing mess, and it took 15 minutes. No Hot Link, Bratwurst, Bockwurst, Italian, Polish, etc., just beef, chicken, or veggie sausages.  Ugly, cramped space. Nice people, (they offered to refund my money) but completely overwhelmed by the Noir City crowds at the Castro theater.  They don't seem to have enough space to cook more than a few dogs at a time. Rosamunde, or Top Dog does a much better job.  But those places are more about the sausages than the toppings. Maybe I'll try a Chicago sometime, since Moishe's Pippic is no more. But I'm wary.", "author": "John R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "I love it!  Choice of Beef, Chicken or Vegetarian Hot Dogs.  All sorts of toppings and they are great Hot Dogs!  They even have great cole slaw and Fries!  The  buns they put the dogs on is great - not a typical hot dog bun - but almost like a roll.  Everything is made fresh and the flavor is awesome!  Try the New York dog!", "author": "Herb B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "Writing this review makes me wish I was there right now!  I came across this place on my way to get my beans at the ever wonderful Castro Coffee Company.  I had the Philly Dog and it didn't disappoint.  At first bites, I was loving the cheesesteak with toppings and then I realized there was still a tasty hotdog waiting for me!  Mmmm, I'm going to have to drink more coffee so I can head back there sooner.", "author": "Miguel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "Love this place! Great selection of high quality hot dogs, must try the chicago dog and the Banh Mi! Will decently be back for more.", "author": "S K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "The hot dogs are great. I've had the classic and the cubano. The cubano is tops. It's the best place to get a quick bite to eat while waiting in line at the Castro Theatre.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "They've got a cute space and friendly workers. I had their 'classic' hotdog which was delicious. I'm looking forward to coming back here late at night after a trip to a bar.", "author": "Mike B."}
