{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "My favorite tea place on the earth. Healthy and tasty. New concept of drinking tea.\nI often wait for the promotion 50% off for stocking teas. I think the price is a little high when you buy full price. There are so many favors so it might be confusing for you to choose. But you will find some of your favorite. My favorite is Peach Matai, or green tea.", "author": "Kev W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "It's a chain, but you probably knew that already, huh. It was founded in Montreal almost a decade ago by yes, Canadians, who must have seen a gaping hole in the market for tea-totaling Canucks. Apparently they don't all guzzle beer up north. They swept southward into our country about six years ago, and Oprah suddenly promoted them about four years ago. Well, that sealed the deal since her endorsement is the retail equivalent of the golden fleece. And the rest, as the French Canadians say, is histoire.\n\nJamie W. and I happened upon the one in the Westfield food court as we've been in a heavy tea mode of late. It definitely has the packaged look of a chain that paid a lot for image consultants. The ritzy Tiffany blue of the sign, the tea cups and even the tea tags attest to that. Dozens of uniform canisters were neatly organized on shelves behind the counter organized by what kind of tea (photo: http://bit.ly/2pI2Bzo). Perky staff were more than willing to allow us to smell any tea to which I showed even the slightest curiosity.\n\nAfter much staring, Jamie settled on the Mint Chocolate, and I got sassy and ordered the Sweet Ginger Heat (photo: http://bit.ly/2raw6v1). At a not unreasonable $3.50 a cup, both were satisfying with mine having a little bite that I welcomed. There is plenty of designer merchandise to peruse while you wait for your tea to steep (photo: http://bit.ly/2qd6sYM), though nowhere to sit. That meant we had to sit among the lobster-gorging, cream puff-devouring patrons out in the court. It was a calorific jungle out there, but we survived.\n\nTEA - 4 stars...rich tea flavors, endless variety available\nAMBIANCE - 3 stars...it's just a store with a lot of color-coordinated merchandise\nSERVICE...3.5 stars...they're a happy lot in here, must come with the training\nTOTAL - 4 stars...Oprah was right...these Canucks know how to make tea", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "I am a tad bit obsessed with tea and David's Tea in general and was really impressed with the service I received at this location. This is a pretty small storefront and I honestly didn't know what to expect since before my visit my DAVIDsTEA purchases have always been online or through a friend going to their home storefront. \n\nFirst off, I really have to give props to the employees here! My sister and I came packed with a bunch of questions and inquiries to smell the different teas and they never made us feel like we were wasting their time or we were annoying them by how excited we were about tea! They also offered us the available samples of tea (hot/cold) located in the front of the store.\n\nSecondly, the store was clean and organized. You could easily find what you need, but don't fret if it's hard to locate what you want the staff is there to help you and to also answer any questions.\n\nThird, DEALS! They have a sale section and you never know what you'll find here. Sometimes it's mugs! Sometimes it's iced tea presses. You just never know, so it's always worth stopping by just to check-in. Also in addition to their teaware also having deals as the seasons change so do the teas and the stocks of what they keep (for some, but not all teas) and sometimes teas go on sale! Keep your eyes peeled or just ask!\n\nOverall, I dig tea and I dig this spot. Definitely will return for more! \n\nRecommendations?\n- Iced Tea Press was a game changer for me. You basically brew loose leaf tea on the bottom, add ice to the inner cup, layer? Idk what it's called and press once it's done brewing and BAM yummy tea! \n- Goji Green - delicious. Just yum.\n- MATCHAAAA is yummy. They also have fruity flavors like Honeydew matcha! \n- If you're not sure you're going to love a tea, but it smells good and you like the ingredients opt for 2oz over anything larger.", "author": "Janelle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "David's Tea is the best.  Discovered it staying at a house rental in British Columbia a few years ago, and didn't realize this great Canadian import is now readily available stateside.  Cut forward a few years and there are several Nor Cal outlets, including this one in the lower level of the Westfield SF Center, adjacent to the food court.\n\nHere you can buy loose leaf teas, tea in bags, and some very well constructed infusers, brewing tools and tea holders.  Even if you are lukewarm on tea in general, you'll find something to like here and it's fun to explore their flavors.  The fruit infusion teas here are better iced than just about anything you'll find elsewhere.\n\nIts a hassle for some to get here, unless you are coming via public transport.  A major plus is that in the back of this tiny shop you can order fresh brewed hot and ice tea, in all flavors.  This is a must try if you are in Westfield Center.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "These people will actually give you a recommendation if you describe what you're looking for. What a concept! You can order hot or cold and even a latte. I opted for something refreshing and citrusy and iced. I ended up with the electric lemonade which is a mate - delicious! I'll be back!", "author": "Guisela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Join and you get a free tea!! I miss teavana and this is the just like it but more trendy and colorful. I love the colors and the ombré. Tea is so good too!! I love that they even have sales. It's a tea girls tea heaven inside the West field mall so accessible by Bart", "author": "Diane S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-10", "description": "I purchased a teapot \"simplicity tea for one\" for my hubby and the inside lip cracked after the first use. The issue is with store management treating me like I was a scam artist for returning their cheaply made merchandise. And a ceramic object that cracks after the first use is highly suspect in my opinion. \n\nThe fact is that my hubby loved the actual product, just not the fragility of the craftsmanship. The extra star is for the manager refunding the product albeit with major attitude accompanied by a tone of accusation: \"if I research you and find a pattern...\" he began his tongue lashing... as if I would give myself the task of returning your cheap teapot after intentionally cracking it. \"Well I've sold a lot of these and none came back,\" was his response. There are most likely many customers with hairline cracks in their teapots who've already tossed their receipts.", "author": "Ronald P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-11", "description": "Came to this location to learn that David got rid of my favorite tea!! Farewell Kiwi's Big Adventure! I guess the adventure has come to an end :(\n\nI've tried others and this time around I tried the Happy Kombucha. Nothing has beaten the Kiwi. I guess i will keep searching.\n\nThis location did not ask if my tea was okay (sweetness level, etc.), which the Palo Alto location always did so the service didn't feel quite as welcoming. \n\nRegardless, David's tea is still one of my favorite places for a nice cup of iced tea because of their bountiful selections and types of sweeteners.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Hot soothing tea is magic for the soul and David's Tea has a tea for everyone. Their cult favorites like Forever Nuts, Cream of Earl Grey, Red Velvet Cake, and Chocolate Covered Banana make for magical gifts for tea newbies, and their sublime Grand Cru Matcha and Silken Pu'erh would impress most tea gurus.\n\nYou can tell that the staff are true tea lovers and I've always enjoyed talking to them.\n\nThis past week - I bought one of their reliable travel mugs as well a travel matcha maker mug. Both have proved to be two of my favorite tea making accessories.\n\nFor your own motivating matcha magic - check out DAVIDsTea.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "I have a great love for this DavidsTEA location. I found out about them and their awesome tea because I was drawn to this store front 4 years ago. Ever since then, I've been a loyal customer of DavidsTEA.\n\nItems, especially if they're on sale, sells out fast here. I don't normally go to this location to buy loose tea or bottles but I do come here to grab iced teas. \n\nEmployees are usually quick and attentive but sometimes you'll come here and employees will ignore you and that really depends on how many people are in the store and who is working.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "3.5 STARS\n\nWe were gifted a box of teas from one of our talent for the holidays. I'm not normally a fan of fancy teas. I just drink chinese chrysanthemum bo nay all the time, but I had just ran out, so I decided to try David's tea.\n\nWe got the Sachet tea chest: whole leaf tea in sachet format ($40) which came with 8 different teas: Buddha's blend, Organic silk dragon jasmine, Organic the skinny, Organic cream of earl grey, Coffee pu'erh, The buzz, Organic cinnamon rooibos, Forever nuts.\n\nI've tried most of the flavors from the box. I'm a very simple tea drinker. I tend to like my teas strong and I don't add any sugar, cream or milk. Call me a tea purist, but I liked the more simple teas from the box: Buddha's blend, Organic the skinny, The buzz. I could taste the subtle notes of each tea which I started appreciating. Gave me a whole new view of drinking tea.\n\nAs a coffee and tea purist, I couldn't really drink the Organic cream of earl grey or Coffee pu'erh. The cream of earl grey had an overwhelming smell and taste of vanilla. For a girl that doesn't add anything to her tea, it was a big turn off. And the coffee pu'erh seemed like a watered down coffee. I like my coffee dark and strong, so I didn't care for that at all.\n\nFor anyone who loves different types of tea, a box from David's Tea would make for a great gift. But for me, I'm okay sticking to my normal boring tea. Rounding up from 3.5 stars for giving me a new appreciation for specialty teas.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-20", "description": "I'm not really a tea person... more of a coffee person for sure, but recently my stomach has had a different opinion on what I should be putting in me, so I headed over to David's to see what they had going on. As someone who only knows the super basics about tea, I was completely overwhelmed and confused when I walked in. Luckily, they have some incredibly helpful, knowledgeable staff that can help you figure out what it is that you're looking for, and explain what the hell a tea ball is, and how it differs from an infuser. Definitely ask for help if you feel lost, because they seem more than happy to tell you about the kazillion different teas they offer and what is in them, and how those things can help you. I walked away with 3 fancy pants new teas and some fill your own tea bags (who knew?!) I basically feel like the Queen of London now. Someone hand me some freakin crumpets! (What is a crumpet?)", "author": "Liz M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-18", "description": "I love the location in Palo Alto, but I've only had bad experiences at this SF store. I tried getting a sample because there was a pitcher sitting outside with some cups nearby, but one of the staff members yelled at me and made me feel like I had just tried shoplifting. I'm sure it's just because the staff here are more busy so they have to be curt, but it did hurt my feelings and gave me trepidations about ever returning.", "author": "Jeddeo P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "A place to come back! Finally I found infuser tea infuser mugs  they have so many great quality teas and really good deals! Come here to try cold/hot teas  thank you for high quality service", "author": "Evelina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "I like coming here when it's not that crowded just to ogle at their beautiful Nordic cups. I recommending buying one when they have sales or deals; they are really quite nice cups! \n\nI'm also a fan of their matcha lattes which come out pretty smooth and creamy. As for their other teas, I like their straight teas, but need to dive in to see what other blends I might like.\n\nI gave this place five stars because I think their SAs are really friendly and have good service. I'm indecisive and I exchanged teas two times, and they were more than happy to do so. Wherelse I'm sure most places would give me the crazy eye for doing so.", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-28", "description": "Small tea place on the side of the food court. \nNo big difference in the tea, but the products and holiday teas they have are worth getting! This weekend they have a holiday sale on the remaining Christmas products and tumblers and I'd definitely check it out. \nThe assortment of teas they have is average, with a whole wall of black, green, white, herbal, and much more. \nThe prices are average. \nThe staff is friendly and over zealous. \nCheck it out, see for yourself!", "author": "Lianne W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-26", "description": "I first tried David's Tea when I went to their Burlingame location which is wide open and allowed space for a tea newbie like me to ask questions and sample different teas.  Inside the Westfield Cellar Food Court area, it just seems like a congested non relaxing type of place to sample and taste tea in the proper setting.  The mall's ambient noise kiind of ruins it.  I wore my thick bulky backpack while I was in there and then realized later on that I almost smacked two or three people in the face when I was turning in one direction.  So I ended up sitting on the bench outside.\n\nProbably will stick with the ample roomy Burlingame location for me.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "In the mall by the main food court area but its small and cramp. Have a lot of selection of tea to choose from. You can either go by the oz to bring home or go by the cup either hot or cold.\n\nThe person who was helping me was nice and was very helpful on picking what kind of tea i wanted  for my cough/sore throat. They let you smell the tea leaf containers to see if you like the smell that they suggest for you. Totally forgot the name of the tea that i got by the cup to go. Usually i dont add any honey to my tea since i prefer the original flavor but decided to Add a little honey to my tea for my sore throat. If you add honey to your tea, it gives that extra flavor/sweetness. \nI'm a fan of David's tea and will come back next time i go to the mall", "author": "Julie N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-25", "description": "Worst first experience due to the older man at the register. Worst bitchy attitude, unwilling to help or even be cordial or serviceful even after we told him it was our first time. Pour honey on my iced tea... it's not going to dissolve. Asked politely for a spoon as he was watching me struggle to mix the hardened honey at the bottom and he just dismissed me by saying he didn't have any. I can't believe people act like they own the place or like they can behave like that and expect costumers to go back. If you can't be, at least, pleasant don't work in costumer service.", "author": "Johnny A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "DavidsTea X 3. \n\nMy third DavidsTea location. While the chain was founded in Canada, they've started to pop up around NorCal within the last year!\n\nAnd everyone knows OMGITSDAVIDSTEA. Yep, I love it!\n\nLocation specific:\n-In the mall\n-Lots of samples. Most locations give samples in glass cups, but I assume the mall location merits the throw-away cups.\n\nWhy?\n-Best tea flavors ever. Grilled pineapple tea, birthday cake, Movie night (yep, popcorn in the mix), cotton candy!\n-They don't hard sell like teavana. The Teavana handbook must teach employees to be in your face - Teavana is like a Macy's sell (besides the fact that the sales people are non-existent but stick with my metaphor please) and David's is more a Bloomies or Neimans. \n-Teapop= tea mixed with carbonated water. A cool concept.\n\nYeah, it'll cost you a pretty penny, but it is totally worth it!", "author": "Libby J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "Sooooo much different teas that I get overwhelmed on which ones to choose. Therefore before I go here I make a list of teas that sound good from their website . The staff is very helpful. \nRandom fact .... I did not know trail mix could be used as a tea .", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "DavidsTEA in the SF Westfield Centre is very colourful and full of any tea you could possibly fancy. I prefer coming here for tea instead of the dodgy tea shops in China Town. You can order any tea hot or cold which is lovely cos sometimes you just need a cuppa. I love their Autumn collection cos its very warmy. Try the Pumpkin Spice Chai Tea with milk and sugar. \n\nThe staff are friendly and knowledgeable and spend time with customers instead of rushing them. Their are plenty of gift sets as well that could be given to a Tea fanatic like myself.", "author": "Julian I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "Stumbled into this store after wanting a cup of tea while shopping around downtown.  I didn't want the usual Peet's or Sbux...right next to Ghirardelli, I spotted David's Tea.  Now, I can't wait to return!\n\nThe associate behind the counter utilized my usual preferences and found me a couple of their blends that I might like.  G did the same and had a couple of choices also.  They have single blends...but I wanted to try something different.  \n\nThey can brew you up a perfect cup of tea...or make it iced.  The iced option is actually super intriguing.  You have the choice between regular water or sparkling.  Add agave?  \n\nWe decided on one plain hot and one iced with agave.  \n\nBoth were fantastic.  I highly recommend getting the sparkling one if you get iced.  It's different and unique.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "I'm so obsessed with this store! They have a dizzying variety of loose leaf teas, ranging from the standard traditional blends to some pretty out there ones like a Cotton Candy Rooibos. I also love the design style of all of their different cups, teapots, etc. and definitely plan on picking something up at some point. If you choose to just get a drink to go, they brew your tea there fresh, and have a variety of different sweetener options as well. My favorites I've tried here so far have been mint matcha and forever nuts!", "author": "Stephany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-20", "description": "Well they certainly have a lot of tea!! It's literally wall to wall. At the front are small samples for their flavor of the day. Although not your traditional tea shop, they do have many interesting flavors. \n\nMy friend loves this place because you can go in there and tell them how you're feeling or what's hurting and they can recommend something for you. I'm not saying that it necessarily works but placebo is a powerful thing. ;-)\n\nWorst case scenario you get a delicious hot cup of tea.", "author": "James W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "Knowledgeable staff, fragrant loose leaf, refreshing tea! I encountered DavidsTea when I was wandering around the mall seeking something to satisfy my overwhelming thirst. Upon consulting Yelp, DavidsTea appeared with an overall glowing review. \n\nThe store is very bright, clean, and modern looking. I was promptly greeted by the two employees working that day, a lady with purple hair and a gentleman wearing a beanie, both of which were very patient, friendly, and informative. \n\nI was first provided a sample of the summer dragonfruit tea, and it was light and delicious. I however, was seeking some more caffeine kick. All of the teas smelled amazing, and I had lots of trouble choosing one. Ultimately I chose the Shooting Starfruit, which was fruity but not overwhelming. There is none of that artificial smell or taste found in drinks at other tea places. They use an agave sweetener that doesn't alter the tea, letting the flavor of the leaves shine through. \n\nThey also sell tea bags, tins of teas, hot drink thermos cups, iced drink cups, and their neato burrito steeper. I always have trouble making teas that water down after adding ice, but this is a nifty device for brewing, filtering, and dispensing right over your cup. \n\nI wish there was a location closer to the South Bay. I would revisit if in the area to try their unique flavors and buy some loose leaf for home.", "author": "Shirley V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "I just had a wonderful experience at the SF Center Location! \n\nDavid and the other associate (who's name I didn't catch) were so helpful! I walked in having an idea of what I wanted, but not really sure. They both were speedy, efficient, and conversational. \n\nI manage a boutique and I'm always underwhelmed by customer service these days. This is the exact experience that I love when I go into stores. Shout out to your manager for recruiting a staff of people that work together, are knowledgeable, have passion for what they sell, and do it with a smile. \n\nI took queen of tarts with me and I absolutely love it! If you like a deep, rich, citrus tea - it's spot on!", "author": "Devin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-24", "description": "Sssome velvet mornin' when I'mmm strup.\n\ndunh duhdunh duhduhdunh\n\nI'mmm gonnaa ooopen up yourrrrr cup.\n\nduhduhdunh duhduh\n\nAnnnnd maybeee tellllllll you 'bout David.\n\ndunh duhduh duhdunh\n\nAnd how he gaaaave me tea.\n\nduh duhdunh\n\nAnd how he brewwwed it up.\n\nAtchoo? Nettle tea. Iced.\n\nBirthday? Birthday Cake tea x Birthday Cake Oreos. Thank me later.\n\nNot Birthday? Still Birthday Cake tea x Birthday Cake Oreos. Thank me later.\n\n1960s Beach Cowboy? Some Velvet Morning. #googlethat\n\nAny Other Time? Cookie Dough Tea. Iced.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "What a contemporary tea store that is filled with wonderful, colorful selections of tea!\n\nYou get to smell the tea to get an idea of how it will taste.  \n\nThe flavor of the tea is subtle and great for refreshments.  You have the option of adding milk and sweetener.  \n\nA delightful spot to taste tea.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-16", "description": "They have good quality and variety in black tea. I like their creme earlgrey (but make sure there is no actual cream in it) and another black tea I bought the other day. I'm sort of done with flavored tea, so I usually skip their offer to taste them. I'm not impressed with their green, oolong selections/prices. I usually buy those in Chinatown tea store. \n\nOh, I LOVE their thermo. It was nearly $30, but it's worth it. It also has an extra pocket to store additional tea. It's my must have travel item, too.", "author": "Yoko S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-18", "description": "on 24-july-2017 i purchased a tin of organic saigon chai.  $28+.  the sales lady literally scraped the bottom of their tin, and that filled my tin almost to the top.    then she topped it off with a scoop from a fresh bag that she opened in front of me.  \n\nturns out that what was at the bottom of their tin was mostly tea leaf dust and very little of the spices.  when i brew the tea an amazing amount of it makes it through the very small holes in the tea infuser (also purchased from this shop).  the brewed tea is darker than usual (all the extra black tea dust, i guess), there's a lot of sediment at the bottom of the tea cup, and the taste is a bit bitter.  \n\nwhen i brought the tea back the sales guy assured me it was exactly the same as what i'd get from anywhere in their tin, and wouldn't make it right.  (if the bottom of the bag is so damn good, david's tea, you keep it.).  \n\ni wish my tea looked even remotely like the tea they advertise at https://www.davidstea.com/us_en/saigon-chai-1 ... that picture has a dozen cardamom seeds, lots of peppercorns and cloves, etc.  my pile of 5 ounces of tea --way more than what's in their picture -- contains exactly 15 cardamom seeds, exactly 25 cloves, about 30 peppercorns and *lots* of tea dust among the other stuff.\n\nfor selling me a crap product, lots of minuses.  for incredibly obtuse customer service, even more minuses.  i'll spend my money elsewhere.  bye, david's.", "author": "Jay P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "I usually stop at David's Tea at Westfield Mall for a tiny sample, today Sun 3/17/13 I had my green on for St. Patrick's Day & got a full-size cup of green tea!\n\nThe girl didn't ask if I wanted hot or cold, I should have told her I wanted cold.  I took the hot anyways & it's boiling hot!  Burned my tongue bad.  Flavor I got was \"green & fruity\"\n\nI liked it most because it was FREE!  Next year definitely Iced Tea!\n\nWorth a visit, I am following them on FB now!", "author": "Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "I just love this place. Overall, the ambience, the color, everything. I love their graphic and interior designer (Whoever you are! I love the color choices and simplicity design, font choices, interior, etc :)  I bought my tea set, tumbler, and matcha set here and they have a very good quality. The service was quick and very helpful. They will check with customer which tea you'd prefer; black, green, herbal, white, you name it and they will let you smell the tea. They often have a small cup of sample of their best tea. My favorite is Buddha's Blend. It is very relaxing and calming. You can let them know whether you want it to be warm or cold, or put some sweetener on it. Best!", "author": "Nesia A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-28", "description": "With the kind of service I received right now apparently this location doesnt need new customers.\nOne of my friends advised me David's Tea as the best place to buy tea in the city so I decided to stop by and purchase some.\nThere were 2 sales people present and one of them was helping another customer.I approached another sales person and asked her if they had any herbal tea.She pointed to the wall with 30 different choices and said \"there\",i asked if they used different herbs in the tea mix,she said \"yes\" and left.I was standing there for a couple of minutes just staring at the wall  waiting for another friendly sales lady to become available,but since she was in the middle of helping someone else I had to leave.Never again I will come back to this place!", "author": "anastasia a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "I am absolutely amazed by the knowledge and friendlyness of the staff. I just bought organic flavoured green and white teas. Everything is flavoured with natural flavours, or with natural ingredients like orange peel or jasmin flowers.\n\nAfter the desaster yesterday at Lupicia Tea on the 3rd floor, I can't wait to try these amazing teas from David's tea!!", "author": "C K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-21", "description": "I'm very new to this brand. Was trying to figure out what was good to buy as a gift. One girl was very nice and patient. Another one was acting very aggressive and angry because I took time and I heisted. But as I sad I was new to this brand. So I didn't know what to choose. Eventually I bought 180 dollars things. But the girl acted still sooooo unhappy and I m sure she doesn't welcome me. Really terrible experience.  I guess the company is not paying her well? But anyways, I'm very confused, because I really liked the tea. The terrible customer service made me difficult to share and recommend it to my friends. I'm carrying heavy tea bags waiting for the train inside of the station. After a tiring working day, spending money, now I'm feeling not great. Coz I don't want to share it to my friends because I don't want to have relationship with them but I already bought them. I just threw the money away I guess.", "author": "Zoe O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "I got more into tea from my cousin, but my friend Maria introduced me to DavidsTea. Can I say how much I LOVE DavidsTea? From the cups (love the infuser mugs) to smelling the tea, and even how inviting the store feels. I'll admit that I definitely liked the vibe and openness that the store exuded compared to Teavana's stores. (To be honest, the only reason I stop by Teavana is to try their samples.)\n\nEver since learning about DavidsTea, I've become more of a tea addict, and have my periodic binges of tea buying. I just wish they had a store in SoCal (hopefully soon??)  as I live in San Diego, so it saddens me when I hear about in-store deals and I'm unable to get them. \n\nThe staff was very friendly, and thank goodness for my friend Maria for being there to let me know how I could get more out of my purchases with all the deals I could combine!", "author": "Wilma M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-04", "description": "Best way to describe David's Tea is a less pushy Teavana.  Teas are still way over-priced and  the staff answered my questions by reading what was on the back of the tin.\n\nReally there are tons of better places to get your tea from in San Fran (or anywhere).", "author": "James O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "My boyfriend noticed this spot while taking an out of state cousin shopping in SF. He knows I love tea and like a good boyfriend he had to bring me here. We checked it out a few months back, and the employees were very friendly, helpful, and knowledgable. \n\nBefore Davids Tea I had never done loose leaf teas because it can be such a mess and hassle. But the girl showed us their products and cups that make it so simple and easy even on the go! She gave us some good recommendations and a sample of their Birthday  Cake tea which was really good.\n\nIt's a small investment to get started. Travel mugs are $25-$35. And 4 oz of tea is under $20 and makes about 15 cups of tea. We just returned last week to each get a travel mug and 4 oz of tea. I went with a fall favorite Pumpkin Chai and he got Chocolate Rocket which is a mate with chocolate, almond, and raspberry flavors. \n\nTheir teas are so fragrant and when you steep them their flavors remain. The Chocolate Rocket definitely brews a bolder flavored tea than the Pumpkin Chai which is a bit milder but they both taste amazing hot or iced! They have hundreds to choose from to satisfy all tastes and caffeine levels. Some of their teas are even organic.\n\nI love my 16 oz mug! The infuser twists on to a filtered opening for sipping, and has a twist on lid with a handle and a hidden compartment to hold tea leaves for a second cup on the go! Simple assembly, simple to clean. I was concerned that it didn't have a \"sippy\" style lid, but it gives a clear view of the tea in the cup, allows steam out without getting burnt, and has a nice lip to allow you to cool your tea before a sip. The stainless steel keeps the tea nice and warm too! Even if I leave the lid off for a few minutes taking sips here and there it's still warm. The insulated outer cup never ever gets warm. With the lid on it stays warm for hours in case I want to save some for later.\n\nMy aunt was over on Friday and was super impressed. Turns out my cousin loves tea too and my aunt said she paid double Davids Tea prices for 4 oz of tea at Teavana for him. I showed her the Davids Tea website and it is great. Shows pictures and descriptions of their teas for ordering online! They offer lots of promotions and have a rewards program. We got a free Apple Crisp candle ($20 value) for spending over $100 and while I normally wouldn't even consider paying $20 for a candle, this is the best candle I've ever had. It is fragrant just like their teas and covers smells from smoking, food, and dirty laundry.", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "If it weren't for me working a crappy retail job on the third floor or the Westfield Mall, I don't think I would've come across his wonderful little shop. I've been coming here for 2 years now, even after I have left my job at the mall. Every time I come here I'm excited to try new teas and spark up great conversations with the employees who work at David'sTea. The tea may be a little on the pricey side at times, however I promise you it is of the best grade. Seeing all the tea on the tea walls and being able to smell and learn what is in every single tea, just makes one feel reassured about their purchase. \n\nI'm normally the type of person who likes to do most of their shopping online, however when it comes to this little tea shop I'm always entertained by all the wonderful employees. You can ask them about any tea on their tea wall, and they can suggest any tea based on your taste. They're all very kind, and don't pressure anyone to buy their tea. I come for the tea and the wonderful service.", "author": "Irene C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "TEA TEA TEA!!!!\n(4.75 stars)\n\nQuality tea for the quality price. \n\n- Teas, variety variety variety\n- Prices, affordable\n- Service, on point and very friendly\n- Ambiance, clean and cute (love the rainbow affect)\n\nIf you are looking for variety, you came to the right place. Here's a few flavors you don't usually see at other tea shops: Mango Diablo, Exotica, Chocolate Chili Chai,Whiskey white, Coffee pu'erh, and Pineapple Oolong. Those are a few I'm itching to get my hands on. They have different kinds of tea: black, green, herbal, rooibos, white, mate, pu'erh, and oolong.\n\nThis is the place to go for some really amazing tea. They have tea everything.... tea tea tea. I've finally kicked my addicition of espressos and have turned towards a healthier track of drinking tea. I usually go to SF Shopping Center and get my tea at the tea shop there but why deal with the travels when this place is closer to my place. I've also found an amazing herbal tea (mother's helper) that will help with sleeping, valerian is key.\n\n\nWill I be back? Every other week to fill up on my tea canister.\n\nJABA APPROVED.... Until the next review...", "author": "Jane A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "I would totally recommend anyone who obviously like tea and for those who wants to try very exotic flavours. My favourite is the magic dragon and the dragon pearls. I also like DavidsTea because it has kosher options and it's a Canadian company. Definitely would keep coming here and would like to go to other locations within the city. The service is very limited due to small space but you get good service.\nI am content.", "author": "Nadav M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "I am a tea snob and it always bothers me when I go into a shop and no one knows anything about tea. You don't need to be an expert but when I have questions at least be able to answer some of them. \n\nI have come to this David's Tea location multiple times and all of the women who were working were very knowledgeable and helpful. I come in to stock up to avoid paying shipping and to smell a lot of teas so I can buy them on the website if I run out. \n\nThis store probably gets a lot of random non-tea drinkers because of its location so I really appreciated that they always take the time to let me smell as many teas as possible and answer all of my questions. \n\nThey also make good suggestions and their to-go hot and cold teas are always brewed to perfection so if you are a casual tea drinker/looking for a gift they'll be able to help you. I am not a big fan of the pop teas (carbonated),but they weren't made poorly. Just not my thing. \n\nAll in all I make it a point to come to this location whenever I come up to San Francisco and it doesn't hurt that I get points and free tea using their frequent steeper program.", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "This is a gem! The customer service was great, they were so knowledgable and we received a serious education on tea.\n\nI love that you can smell any tea. They also have a tea bar where you can buy fresh brewed hot or cold tea. I tried the Lemon myrtle iced and it was amazing. So refreshing. \nWalked out with 3 bags of tea that I'm dying to try out.", "author": "Monellelarissa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-26", "description": "I came to David's tea and they were celebrating their one year anniversary. So everyone was getting a few drink of their choice.  The staff here was friendly and would get to know that type of tea person you are before recommending their pick.. I ordered a hot tin kwan yin tea which in my opinion is a sister tea of oolong.  I didn't find the tea to be too strong and i did leave the bag there for a very very long time.  I did buy their jasmine tea and that smelled so good, very fragrant to be exact! I would probably come back here to buy more of this.", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "Very great service without being too pushy. I managed to smell lots and lots of teas, and all the helpers there were great at describing each tea, and managed to use plenty of adjectives. I'd need a thesaurus handy if I ever worked here. \n\nAll very fresh and I love the blends. I used my voucher for a free cup of tea, and managed to buy enough to get a second cup free. Albeit small, it's a lovely tea shop with great service.", "author": "Veronica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "Tea has become my new thing . \n\nI've been going to teavana but I feel like everything is so over priced there . \n\nI really like David's tea though. The workers are friendly and super helpful and not overly trying to push you into purchasing things you don't want . Which is nice . \n\nIt's close by to work so that's great too since that makes it easy to stop by on lunch breaks ! \n\nThey have a huge variety of teas . You'll love it", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "Thanks to being a part of their frequent steeper program and visiting their booth at the Ghirardelli Chocolate festival, I have been able to experience DavidsTea for free twice at their store in the Westfield mall.\n\nThere is a huge selection of tea here that range from white, oolong, black, pu'erh, mate, rooibos, etc. and a lot of them are pretty unique blends. They are all displayed in tins with a color-coded name tag, and they let you smell it upon request. So far, I've experienced very nice female staff employees here who were very helpful in deciding what kind of drink I wanted. The first time I came here, I got their hot chocolate rocket mate tea with soymilk and sweetened with agave. Needless to say, on a cold day in SF it was the perfect beverage to get! They don't make it overly sweet (unless upon request) and it is just all kinds of perfect. Today when I went, I tried their creme brulee rooibos tea with soymilk, this time iced. SO yummy. Another excellent experience from the staff. Their brewed tea of the day is $3, other hot and iced beverages are $3.50, and their newly-marketed sparkling teapops are $4.50. \n\nI love their merchandise here as well! Lets hope for Christmas I get one of their steeper mugs.. or a teapot would be nice.", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "I was shopping at the mall when I came across this shop. The bright, clean, and perfectly lined tins on the wall lured me over. I probably should have just turned and ran at that point, since the store was echoing \"$$$$$$$$$$$\" in my ears. But who can resist beautifully displayed color-coded teas. \n\nAfter standing there for 5 minutes, admiring the insane selection of teas (most aren't for the purists and have infused flavors) and dreaming about what \"red velvet cake\" or \"creme brûlée\" might taste like, the one associate in the store approached me with a sample of the Pumpkin Chai. Apparently it's in high demand, and maybe it goes better with milk, but YUCK. \n\nI was eager to find some fruit-infused flavors, since that's my jam. Had a debate with the associate over what is considered \"tart\" or \"citrus-y\" but nonetheless, he was very helpful and let me smell all the tea leaves I desired. At the cheapest, the tea leaves could come in small reflective baggies and would cost around $9-12. I decided to try a tea to help me make my decision. I ordered the mango madness and my friend ordered the spiced apple cider. We ended up liking each other's, so we switched. \n\nJust as a preface: I'm a big tea drinker. I usually like to go plain and get green tea or green tea with brown rice (YUM!) from Asian places. I also just returned from living abroad in Asia for 2 years so i mainly came here to try something quirky. \n\nThoughts on the teas:\n\n1. Mango Madness-This honestly tasted like nothing to me. The associate sweetened it with agave but it really did not taste like much. I was bored within a sip.\n\n2. Spiced Apple Cider (seasonal)-My friend did not like this and after pondering on it, I realize that it smells quite like apple vinegar. However, I don't like apple vinegar and I liked this tea. Had lots of flavor.\n\n3. Citrus blahblahblah-Don't remember the whole name, although I bought a bag. It has the taste but I would squeeze another lemon in for extra flavor. It's fine. Not impressed.\n\nSummary: I bought two small bags, the Spiced Apple Cider and the Citrus tea. Came to a total of about $20. Pretty expensive considering I don't know about the quality of the leaves. I've drank two cups at home so far and I'm decently satisfied. The five stars are mainly dedicated to the nice associate and the beautiful layout of the store.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "Very friendly and knowledgeable about the dizzying array of tea.\nThey serve it at what seems like 285 degrees and it took 20 minutes before\nI could drink it without burning myself.", "author": "George S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-13", "description": "Best teas ever! I think this is going to kick Teavana's butt goodbye. The experience here is far superior. Interactive, friendly staff, clean environment, and great products. Sure people can argue that it gets pricey, but so is teavana, and the flavors here are so delicious and creative. Where else are you going to get red velvet cake tea, or gold sparkly tea, or even champagne tasting tea... whoa! They also have an array of herbal teas, teas so good people swear it can cure colds. \n\nThe overall experience is fun. They have all these new gadgets and accessories for your tea, it's tempting to get all of them!", "author": "Trisha W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "I was so happy to find this tea store! I can't drink coffee, but I need a little jolt of caffeine to avoid the after-lunch food coma, so I was ISO some decent tea. \n\nMeh to the tea in bags sold by the coffee chains, plus they have no idea how to make a proper cup of tea: they pour boiling water over a bag of green tea, ruining it. I ventured into Samovar at Yerba Buena; they wanted $9 for a cup of to-go tea. No thanks, I am a poor student.\n\nThen I wandered over to the food court in the Westfield Center (or Centre, the correct and pretentious spelling for this mall)  & found a DavidsTea store! Yay! \n\nExactly what I wanted: good tea, properly made, at a reasonable price, which is about the same price as a cup of decent coffee. They have a good selection of teas, and all the green ones I have tried have been very good quality. Maybe not Samovar quality, but good enough for 1/3 of Samovar's price. The people who work there have been very friendly and knowledgeable about tea, and they know the correct water temperature to use for green tea.", "author": "Deb L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-08", "description": "I'll echo a sentiment that I expressed about Lupicia several days ago: SO MUCH BETTER THAN TEAVANA.\n\nSeriously, wow.\n\nI walk in and Jillian instantly welcomes me to the store, and we start chatting about the product and my lack of familiarity, she brought down a dozen teas for me to take a waft of (plus the hot samples), and gave me plenty of info without being pushy or just giving me a pre-rehearsed spiel. She seemed genuinely passionate about the product, and was a model employee that I'd think any store would want to have. I even found out you can purchase ounce and half-ounce portions of tea, allowing me to sample and ultimately buy much more than I planned on. \n\nThere's no \"OH YOU WANTED TWO OUNCES IS FIVE OKAY\" like at Teavana, she measured exactly what I wanted. Even better, the tea comes in resealable packages, meaning there's no obligation to buy tins.  When I was in the store a homeless man walked in and attempted to accost me, but she was polite and firm in getting him to leave. She shook my hand as Ieft, beyond professional and sealing my opinion of the store and of her.\n\nI wound up going home with portions of Lime Gelato, Birthday Cake, Jungle JuJu, and Pink Lemonade, and I can't wait to return and try several others that sounded interesting (Big Apple, Chocolate Chili Chai, and Brazilionaire to name a few.)\n\nI plan on calling the store to relay my compliments about Jillian and their product in general.", "author": "Alec M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "DavidsTea is really nice interior. I really liked the light blue color scheme they have going on. When you walk in, they offer you a sample, which was pumpkin (blech). Plen-tea of options here, ranging from white tea, green tea, matcha, black tea, you name it! The first row is very simple tea and then it gets more flavored as you go down the shelves. \n\nI got the Buddha's Blend, which was a mix of green and white tea with some hibiscus in it. You can get your tea, iced, hot, or sparkling! Crazy huh! The sparking is a super concentrated tea infusion with sparkling water. \n\nThe price was a little steep, $3.50 a cup for tea?! Seriously? But it's some really good tea though!", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-13", "description": "Quirky, dessert-y loose leaf tea flavors you can't really find anywhere else. The tea actually tastes like it smells! That has to be a good sign and definitely something I don't always experience at other tea shops.\n\nRed velvet is a must-have and it's a black tea too so great for a little caffeine boost! My friend got the \"Three Wishes\" and loved it. Other flavors that caught my eye were mango lassi, salted caramel, and the wide array of green teas! (including matcha, genmai hojicha, etc.) \n\nYou can smell as many teas as you'd like and purchase by the ounce which is great if you don't want to buy an entire tin of tea that you haven't yet tried. Most teas are around the $4 per ounce range which isn't too bad considering the taste, quality, flavor, and the fact that it's loose leaf.", "author": "Junes S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "I LOVE this store.  It's always a fun experience to sample and smell all of the teas and choose one that is just right for how I'm feeling.  Added bonus: many of the teas are Fair Trade Certified.  \n\nThis is the perfect place to shop for a gift for just about anyone.  Especially if their name is David.  Then you can get them a David's Tea mug and be a real hero.\n\nTea is the new coffee and DAVIDsTEA is making that a fun transition for everyone involved :)", "author": "Katie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-19", "description": "Ok so why why why can't these lazy kids pull up the price per ounce BEFORE you buy it? Even last time was a huge task for the girl to pull up the price when I asked for it! This visit on Sunday July 19th the girl refused, yes refused to give me the price before she poured it out and measured it. RUBBISH. This is just laziness! The store was empty! Sorry to have disturbed her from slacking off. How do they sell tea if they do not give the price like their competitor TEAVANA. Where you are never rushed to buy and the price is ON THE FREAKING SHELF. Poor employee training and/or just plain laziness. Bad business decision dot com! If you cannot give customers the price before measuring it out THEY YOU'RE JUST DUMB. I will not purchase tea from here again unless they post or give the damn price  without begging for it. Ridiculous.", "author": "Silicon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-06", "description": "Super cute tea place. Comparable to Teavana. They have a whole bunch of options and is clearly organized by type of team. The flavors are very simple and easy to understand as opposed to Teavana. My only complaints are that they do not do custom teas where I can mix two different teas in one beverage (but that's just me being picky) and that they only have agave as a sweetener. Not a huge fan of agave as a sweetener. It may be more natural and healthier but ya boy got a sweet tooth.", "author": "Gabriel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "I love the tea here. Whenever we are I this mall I make a stop here. I love how you can make a cup of hot, iced, of fizzy drink wth any of their loose leaf tea collections! Last time I got a ginger tea fizzy drinks and it tasted so good and relaxing. I was a little weirded out by the bright yellow color tho because it was artificially too yellow to be ginger.. Lol I love picking out new flavored each time. You can sweeten with honey or agave. They have cute cute thermos and tumblers on displays which are always so tempting to buy.", "author": "M H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "Im closer to the one in Burlingame, which is a larger and more luxurious space. This one you could miss if you weren't paying attention. They seem to have the majority of the same selection just packed into a small closet like setting. Got an assam tea to go. I think they steeped it a little on the hot side. It took a good 15 minutes before I could touch it and I eat things that usually scald others without question., so that's saying something. Friend got the tropicalia (sp?) and I also sampled the coconut grove. Interesting mixes and combinations or just straight ahead traditional depending on your mood.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-28", "description": "You can't taste the tea before you buy it? Somehow the fragrance is enough? I have to pay $3 for a cup of tea for tea that I might not even like and it will only be comped if I buy x-ounces of tea?\n\nWhat IS this nonsense. This is not a tea shop. I'll be taking my tea business to Lupicia, Red Blossom and that bougie place up in Clement that everyone at the office keeps talking about.", "author": "Margaret S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "I am OBSESSED with David's Tea! Not only do they have a wide variety of flavors and types of tea, but you can order your tea either hot, iced, or as a tea pop! (I mean, tea SODA? Holy crap!) They also have various sweeteners and different kinds of milk, so no matter what you like or how you like it, you'll find it at David's. \n\nMore than just having an awesometastic selection, the crew they have working at this location are WONDERFUL- what fabulous, lovely people! I always feel welcome walking into David's and they are not only very attentive and helpful, but very knowledgeable about their products; I learn something new about tea every time I go there! Their enthusiasm is contagious and I always leave already excited for my next visit. \n\nOh, and they're a great place to shop for cute tea accessories, like teapots and travel cups. Fabulous!", "author": "Teresa A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-25", "description": "Came here over the weekend and purchased the sampler pack of the organic,fair trade teas for myself. I am only in love with half of the 9 teas in the box. But for $24 it's a great price and gift idea. Though,I wished they had more organic teas for sale besides the 9 in the box. \nAlso,purchased a ounce of the chocolate chili chai since I saw so many fellow yelpers talking about it. Even though it's not organic I am so glad I bought it. Taste like chocolately heaven! A must buy. \nWish they offered free tasting samples since some of the teas are misleading. And they need to have two people working in the store at all times,or one person standing outside the store with free samples.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "I had plans to go to my normal go-to tea spot, Red Blossom Tea Company, but got deterred when I spotted DAVIDsTEA at Westfield. It may have been a blessing in disguise since I didn't have to trek to Chinatown and because I can never leave RBTC without spending around $100.\n\nDAVIDS is modern and cute - kinda like Sprinkles cupcakes meets tea. \nService was friendly and helpful - when I asked for a lemongrass tea, the salesgirl looked up all their teas in their database and brought down all the tea canisters with lemongrass tea for me to smell. (The Nettle Leaf flavor is amazing). \nI like that they brew and sell tea to-go ($3/cup, hot or iced) - it's a good alternative to Peet's and it's a smart way to start sampling their 150 flavors! \n\nI think giving DAVIDS a low rating for not brewing complimentary samples is kind of unfair, just as you wouldn't go to a Sake shop and expect samples. I mean, it's not Costco...", "author": "Douglas F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-07", "description": "Came here because they had some cute teapot sets for $20, so I picked up one for a friend as a Christmas gift. Unfortunately, trying to buy tea here is like trying to buy a car that you can't test drive from someone who has never been in a car.\n\nMe: \"Could I try a sample of the \"Bubbly\" tea?\"\nSalesgirl: \"We don't do samples, but you can buy a to-go cup for $3 dollars.\"\nMe: \"Hmm, if I buy a cup of tea and decide to buy the tea leaves, will I get the $3 sample deducted from the cost?\"\nSalesgirl: \"No, we don't do that, but... you can buy a cup of tea for $3 dollars!\"\n\nThis is utterly stupid. When you go wine tasting, most places will deduct the cost of your tasting from the wine you buy. Makes sense, no? That tasting costs them almost nothing, especially in the case of tea. And the to-go cups are full-sized 8 or 12-oz cups. Not only would it get pricey to try a few teas if you're trying to pick several out as gifts, but you'd need to pee pretty badly afterwards too.\n\nLater...\nMe: \"So what makes this jasmine tea $11.75/oz compared to this other jasmine tea that's half the price?\"\nSalesgirl: \"Oh, well... it's like, really legit, you know? I think they make it in China...\"\n\nFACEPALM.\n\nSave yourself the trouble and go upstairs to Lupicia. They will brew you whatever sample you want, have a much broader selection, and the sales staff can actually answer your questions.", "author": "Lillian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-14", "description": "Tea?  Yes, please!!!!\n\nI do love this tea store.....what makes it different from the rest?  I love the flavors here! The flavors offered will make me drink tea more!  I have a sweet tooth and tend to like sweet flavors...think cake, caramel, vanilla, buttery flavors.  What's great is that in addition to the sweet flavors, they have the traditional flavors.  There are a ton of different types of variations if what I like isn't what you like so take a peek if you're in Westfield SF.\n\nTypes of teas the carry:  white tea, green tea, oolong tea, black tea, pu'erh tea, herbal tea, mate tea, and rooibos tea. Within each of the types there are several flavors\n\nMy absolute favorite tea flavor:  Birthday Cake (caffeine free, rooibos, with a taste of birthday cake)\n\nOther favorites:  Red Velvet Cake (black tea with chocolate chips, beetroot and red sprinkles), Salted Caramel (black tea with English toffee, coconut, caramel and French sea salt). For Green tea I like: Movie Night (green tea with apple, maple and popcorn).  \n\nThe staff at this location are very friendly and overly excited to talk about the different types of teas, but that works for me because I like to smell the different types of teas they have.\n\nNOTE:  some of the descriptions are from the DAVIDsTEA tea book to give a precise description of my faves", "author": "Caroline A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-06", "description": "Me and my wife have been shopping at David's Tea for over a year now and they have been absolutely excellent with regard to both their products and their customer service.\n\nTheir Tea's are top notch! Some of our favorites are: Love Tea, Movie Night, Toasted Marsh, Salted Caramel and Birthday Cake (to name just a few).\n\nWe bought a tea pot and did not want the cups that came with the set for my grandmother and they happily allowed us to choose a different set for her (actually it was a single cup not a set but the point remains).\n\nNot too long ago, one of the three tea pots we purchased from them (yes, we have 3 tea pots, 6 small tea cups that came with the post and both of us have individual brewing tea cups that we tend to use more often than the tea pots) one of the lids on the tea pots cracked in half! \n\nWe super glued it together and it lasted another 2-3 months then broke completely. We didn't think much of it since we have some many other accessories to make tea with but today while back in San Francisco buying yet another $100 or so worth of tea my wife mentioned the defective product and Mia was kind enough to replace not just the top but actually gave us a new pot and lid!\n\nRemarkable customer service, excellent tea! Definitely recommend David's tea to any tea lovers out there (also I went online and sent all of my family members a good amount of additional tea from their website and it 'all' arrived before Christmas and everyone of my family members was ecstatic about their additional selections of teas!!!).", "author": "Eric P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-05", "description": "Tea that doesn't take itself too seriously. I feel that true tea aficionados may be put off by the creative flavors like birthday cake and chocolate macaroon, but that's what I love about David's Tea - it's never boring. There are always new flavors launching each season, yet I know they'll always have my favorite staples: \"Gold Rush\" , \"Mulberry Magic\", and \"Milk Oolong\". Lately I've found new love with \"Chai Guarana\" and \"Cinnamon Heart\" teas. The price of $3.50 per cup of tea is steep (even if they add complimentary milk/soy or sweeteners to it) so I prefer purchasing the loose leaf in 2 or 4oz increments. 4oz earns you a free tin, and if you bring back the tin for refills, you get a small discount for reusing it. They also have a \"Frequent Steeper\" loyalty program where you earn a point for every dollar you spent. Each 100 points earns you a free cup of tea and 2oz of loose leaf. Pretty good if you shop here often. \n\nThis particular location can get crazy because it's in the mall, so I recommend coming in earlier in the day especially if you are new to the teas and have specific questions.", "author": "Elaine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "I'm always amazed by the knowledge of the associates, who can tell you everything there is to know about every flavor they offer, and they have everything under the sun!  I also love the inventive combinations they make, like the OH, Canada! Tea with maple undertones. \n\nI only wish there was an East Bay location!", "author": "Monica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "I LOVE DavidsTea! Every time I go in I'm amazed at the customer service their staff offers. Sometimes I feel bad because I know I can be indecisive so they pull down like 15 tins for me to smell but not once have they seemed frustrated or put out by it. Kudos!\nThe last time I went in I was helped by Abby who was very helpful and fun to work with! She helped me figure out what kind of tea would help me with my cold (I wound up with Cold 911, you should get it if you're stuffed up). I highly recommend this place if you've been interested in acquiring some high quality loose leaf tea. David's definitely aims to please. High five!", "author": "Ben F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "What a fantastic selection of teas. I wanted to get an ice tea and the clerk gave me some recommendations on teas that I was in the mood for. I decided to go for the Buddha Blend, which had such a great fragrance and tasted just how it smelled. And they also sweetened it with agave. Delicious! I'll be coming here again to buy in bulk.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "I lived in Toronto for 2 years, and as an avid tea drinker, I became a regular at David's Tea as it's a Toronto based company.\n\nI moved to SF seven months ago and have been keeping an eye out for good tea shops. They are all over in Toronto with David's leading the market. I was so stoked when I discovered that David's had started to open up around SF. I knew there were a couple in NYC, but it didn't even occur to me that they would have made their way out to the West Coast of the US yet. \n\nThe teas are AMAZING, the tea products are good as well. I've owned 3. One of the tea steepers that pours out the bottom when placed on a mug, and 2 mugs with metal steepers. One of them the paint started to come off after only a month of hand washing though, but I still use it 2 years later.\n\nI admit that I haven't been to any locations in SF yet as I just found out 3 days ago about them here, and none are close enough for me to pop in to, but I will go out of my way when I'm in a hood with one from now on.", "author": "Kristen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-01", "description": "This location is much smaller than other locations, but still offers the same wide variety of delicious tea. This location is actually inside the Westfield Mall. It's downstairs near the Godvia shop. \n\nDavid's Tea has one of the largest collection of loose leaf teas that I've seen. They are always great about letting you smell as many kinds as you would like. Each tea can be purchased hot or cold to be enjoyed right away or as loose tea to take home. They also always have at least one sample of their tea of the day.", "author": "Kari G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-01", "description": "I'm going back and forth on this review because I had an okay experience. I loved the look of their tea wall and all the cute little teaware items (in all the colors I like, to boot). \n\nHOWEVER...the customer service could have been way better. When I walked in, I wasn't greeted or anything, which is fine since I like to shop kind of under the radar, but when the shop is that small AND you made eye contact with one of the salesgirls, it's a little awkward. \n\nWhat really irked me was having this completely unnecessary back-and-forth conversation about their tea-to-water ratio. \nMe: It says on the label, \"1.5 teaspoons for every cup.\" What is considered a cup here?\nSalesgirl #1: Well, a cup has a lot of teaspoons in it...so that would be a lot of tea.\nMe: No, I mean, how much water do you consider a cup?\nSalesgirl #1 calls over Salesgirl #2 \nMe: *repeats question*\nSalesgirl #2: Well, it's really up to you. Tea is really personal, you know? \nMe: Okay...your directions say to put 1.5 teaspoons in one cup of water. Is David's Tea's definition of a \"cup\" 8 oz? 12 oz? 14 oz?\nSalesgirl #1 holds up their cardboard cups, and Salesgirl #2 says: \"This is what we use as a cup. I'd say that's about 5 to 6 oz.\" \nMe: *thinking there is NO WAY that cup is only 5 or 6 oz* Uhh...okay, thanks.\n\nIt BAFFLES me that these two girls had absolutely NO IDEA what I was asking. Tea-to-water ratio is pretty important, imo. Yes, \"tea is personal\" and I totally could have experimented, but since I had only purchased 2 oz of tea, why would I waste tea trying to figure that out?\n\nIf you're looking to buy tea here, I highly recommend going in already knowing what you want (and knowing your ish about tea). The salesgirls are pretty unhelpful.\n\nBased on that experience alone, I'd give the place 2 stars, but because they sold small cheap tea tins in different colors, I bumped it up a star. Their Salted Caramel and Red Velvet Cake teas also smelled really good, so I'm hoping they taste just as good.", "author": "Faye S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "So I'm a little late with this review. I was here the day before and the day after David's officially opened in the Powell St. Westfield. The day before, the store was covered with unopened boxes, the staff was busy unpacking, and David's wasn't technically opened yet. However, one staff member was kind enough to answer my questions and give me a couple of coupons: one for a free cup of tea, and one for a free all-in-one infuser tea mug with the purhase of $20 of loose-leaf tea (your 4th star David's).\n\nDavid's sells a combination of \"straight\" loose-leaf teas (i.e. teas without added natural or artificial flavoring or aromatics) and flavored teas. However, the flavored teas greatly outnumber the straight teas. For those of you just getting exposed to tea, and wanting to wean yourselves away from teabags and Starbucks, then David's is the perfect next step. For you boba and milk tea fans, David's flavored tea selection makes excellent bases for do-it-yourself home brews, which is what I did with their \"Hot Chocolate\" rooibos mint-chocolate flavored tea.  For the tea traditionalist, you can go ahead and snub David's, there are many better sources of non-flavored, unspoiled loose-leaf tea in SF.\n\nDavid's Tea is a Johnny-come-lately to California, and it has plenty of competition on its hands (Lupicia for instance). It is a Canadian-based company and until recently with its move to SF, only had a smattering of stores across the East Coast of the U.S. In addition to this store, I've been to one of the David's in Vancouver. I was more impressed with the Vancouver location. Their menu included this wonderful chilled tea called \"Northern Lights,\" which was disappointingly not available at the Powell store. But I can chalk it up to a changing tea menu.\n\nThe day after David's opened, I came back. I bought $20 of genmaicha (Japanese green tea with toasted rice) and this thing called \"Cocomint Cream\" and got my free mug, which I love. In terms of aromatics, the genmaicha has none (most of their \"straight\" teas have no aroma). The taste did make up for it though. In addition to toasted rice, David's adds popcorn pieces to it's genmaicha recipe. When brewed the tea had a pleasant toastiness that is perfect for winter weather. The \"Cocomint Cream\" is going to be chilled, milked, and bobafied.\n\nIn conclusion, David's is ok. It appeals to a broad audience. But really, this is San Francisco! There are so many better choices than David's! Tourists, if you want a great tea experience, go one block up to Samovar Tea Lounge in Yerba Buena Gardens! SF specializes in Chinese tea houses! Go to Taste, one BART station over in the Civic Center/Hayes Valley. Or take a look up north to, dare I say it, Chinatown!?", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "What a great selection of tea that is perfect for my taste bud.\nBest part is DECAF TEA! (Since I cannot drink caffeinated drink).\nHowever, they have great selection of teapots, cups and everything to drink and keep the tea warm. \nGood customer service and the ambiance of the store has a warm energy.\n\nRecommend to go to this place if u want tea or buy a pack or 2.", "author": "Cindy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-26", "description": "This place is quite literally the place that got me into loose leaf tea drinking. So it'd be a little rude of me not to give it 5 stars.\n\nI walked into this store on new years day and was given a 101 on the diffrent kinds of teas as well as their spin on it. The key word hee is VARIETY- David's tea has a selection of traditional blends as well as their own unique kinds of tea in which they'll add sprinkles or mini peppermints\n\n...and they are ALL good. ALL OF THEM. \n\nOf course the best flavors are subjective, but all of these teas are of high quality- to add sweet to fantastic, a lot of them are Fair Trade teas. My favorites are Cinnamon Heart(Pu-erh) and Main Squeeze(Mate). Whatever you are into or think you're into, though, the customer service is so solid that if you're not careful you could find yourself with 6oz of new tea!", "author": "John C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-07", "description": "Eh...perhaps I've just been spoiled by Lupicia but I find that a lot of the tea from DavidsTea doesn't really live up to expectations. With Lupicia, there may be tiny bits of fruit or candy thrown in, but the overwhelming bulk of the tea is high-quality leaf that could easily stand on its own. DavidsTea...they just throw SO MUCH STUFF into the blend that it gets kind of gimmicky and you end up having to use loads of it just to get a strong tea base brewed. At this price point, that's not really cool. \n\nGranted, some are spot-on: Red Velvet Cake and Brazillionaire taste delicious. When DavidsTea is good, it is very, very good in that \"How the hell did they do THAT?\" way. But there are quite a few that don't justify the price tag.\n\nThe staff are great with the samples, but it's annoying to have to bother them to get everything single can off the shelves if you want to take a sniff. It would be better if people could just browse on their own and not have (really enthusiastic) employees hovering. Dunno, some people like the attention and suggestions when they're in a shop, but sometimes you just want to look things over by yourself and not get pressured to buy stuff, y'know? Especially when there's over 100 cans on the wall and you just want a couple minutes to see what's there in the first place.\n\nOn the plus side, they're pretty good with giving you th exact weight you want (2 oz is 2 oz, not 3.5).If I had any advice, it would be to trim the fat - don't have so many different kinds if tea, but rather just focus on making a smaller number of them a better quality. And don't make staff push sales *quite* so hard...it's kind of off-putting.", "author": "Julia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "I am drinking Banana split tea and I am happy.  The thing about Davids Tea is you don't feel bad for paying 8.50 for 2 oz. of tea because it is just that good.  I will pay for perfection.  And David's Tea is the Tea of the gods.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "I first encountered DavidsTEA in Calgary, AB, Canada and fell in LOVE with their selection of tea pots and mugs.  Of course, DavidsTEA is also a haven for every type of tea you could possibly want!  Their selection is extensive so feel free to peruse their menu and ask questions.\n\nNo, you cannot sample the tea, but they will let you smell it to your heart's content.  However, they always have a \"tea of the day\" brewing that you are able to sample.\n\nAll of their products you can order online, so if you're like me, indecisive in the face of 100s of choices, you can do your shopping comfortably behind your computer screen.\n\nThe girls behind the counter were friendly and VERY attentive.  Although I was not greeted upon entering the store (they were busy helping other customers), they acknowledged my presence and asked me if I could be helped with anything after attending to their current patrons.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "Doing some shopping in the area, we popped by to check out the teas. Lupicia is the go-to place for loose leaf teas but Davids offers a good alternative. \n\nThis store is super busy since it's located in the ever touristy and popular Westfield shopping mall on Market. Despite the busy-ness, the service was still above average as the staff were always willing to bring samples and offer suggestions. Unlike Lupicia, the tea samples are there for you to sniff on your own as they're stored behind the counter. A bit of an inconvenience but no biggie. \n\nWe also got lucky as they had 20% off selected tea mugs and teas so score! Other positives compared to Lupicia is that they have a larger selection of organic teas and prices are slightly lower. Lupicia is the better bet if you're into green teas though.", "author": "Norman S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "The lady that was here on Friday, April 24th, was the best. She introduced me to the best orange pekoe and gave me a hot brewed cup that was on the house.", "author": "Athena A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "Very cool tea shop, the employees are always welcoming and seem very knowledgeable about what they sell. The prices are high!.. but most of these tea places have really expensive prices for \"specialty teas\"   If you are in the mood for good, unique tea I would say try it out.. they also serve tea by the cup.", "author": "Frank C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-09", "description": "Good tea, but the service stinks. The girl behind the counter could barely look at me and I had to ask for milk. Where's the customer service these days people??", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-23", "description": "3.5 stars. The Vancouver location is an absolute 5 star based on 2 factors, one being huge:\n\nThe SF (Westfield Mall, bottom floor near the food court) location doesn't have a latte machine to whip the milk and tea together. The by-hand process took my extremely nice server, Hannah I believe, about 2 minutes to do. I ordered a strawberry, fruit mix (forgot the name), which was tasty, but it wasn't as great as the Vancouver ones which used a machine to 'latte-fy.' Once they get that, I'll be here all the time. The tea selection is great though, sniff away until you find something you like.", "author": "Chuck N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "This place has a great selection of Teas and the staff knew everything about each one. Abby and Shay were super helpful and I was stoked to be able to smell each tea. They had great options for sweeteners and milk which allowed me to stick to my diet. Ill be back soon.", "author": "Charles R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "Yay, another tea store! My tea cabinet probably shed another tear when this first opened because goodness knows that it doesn't need me to have yet another excuse to buy tea. \n\nSo yes, if you like tea, go here.\n\nI tried to slip in quickly but the sales associates roped me in and found like 10 types of tea that I would potentially like. Were it not for the fact that I'm the only one in the house that really drinks flavoured black teas, I probably would have walked away with more than just 5 types of teas (I have issues). I haven't tried them all yet but based on  the Organic Banana Dream Pie, I'll be back. \n\n - Organic Banana Dream Pie is supposed to taste like a chocolate banana cream pie and I will admit that I've never actually had that pie before. But if you loved Chunky Monkey ice cream, this is pretty much that is tea form. DELICIOUS.\n - Stormy Night: Chocolate, cinnamon, coconut, and vanilla.\n - Chocolate Chili Chai\n - Salted Caramel\n - Mother's Helper: Peppermint, lemongrass, hibiscus, and chamomile.", "author": "Shauna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "I come here when I don't want to drink my office tea. David's Tea sells premium quality tea and other goodies you need to go with your tea. You can also purchase drinks which are made right in the store and when you order. Today, I got the Sparkling Iced Mango tea for $4. Yep, sparkling. How fancy am I? If you want quality tea, this is the place for you.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-11", "description": "The three star rating is for the tea, not the staff. \n\nThe staff have been very friendly, knowledgeable, and helpful every time I have visited. \n\nDavid's Teas seemed like a good idea at first.  They carry a huge selection and you can buy a small quantity to try it so your not stuck with a pound of something you don't like. The flavors are adventurous and strong. Problem is there is too much flavor added. Pieces of candy, chocolate chips, popcorn, and... ARTIFICIAL FLAVORS. At 60+ dollars a pound I'm expecting all natural/organic. All the added flavorings take away from the taste of the tea, and after awhile it all seems fakey and overpowering. \n\nGood concept. Product needs work.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "Before I went there, I was skeptical about David's Tea, because I am VERY into tea (my family has English roots and raised me on properly-brewed black tea with milk) and weary of San Francisco cutesy cafe culture. But I have to say, I love this place! Shayna was extremely friendly and knowledgeable; she knew every single ingredient in every blend of tea that lined the shelf there, it was astounding! \n\nI had the Red Velvet Cake black tea, hot, with milk and agave. It tasted just like cake. My friend had the Midsummer Nights Dream cold \"bubbly\" tea, which was incredible - it tasted like a fruity cream soda. \n\nI also went home with some \"Cold 911\" and went through the small tin within two days! These blends are very delicious and not too overpriced, and customer service is excellent. I only wish there was a nicer place to sit at the shop to enjoy my tea, but after all, it is in a mall.", "author": "Sasha N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "I have tried teavana and I was very disappointed with their tea. A friend suggested this place. First off they have seasonal teas and I love all things pumpkin. Second off the girl that helped me was super sweet and let me smell and try a whole mess of teas. I ended up getting a tea pop of pumpkin cheesecake and I bought some of the brazillionair and pumpkin patch. I couldn't be happier. Needless to say I will most definitely be back!", "author": "Jenee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-09", "description": "So, first off, this is my new favorite thing.  I have been coming here 2 nights a week for the past month.  I LOVE the amazing selection & fun that the menu offers.  Punny & whimsical names for teas (Kiwi's Big Adventure!), & offbeat selections (Movie Night - it's popcorn-buttery-salty-mapley-goodness) to keep you inspired.  And a cup of tea is $3 flat, no confusing made-up sizes to memorize.  \n\nThe ONE draw back that I have found so far is that the customer service is OVERLY friendly.  Now, don't get me wrong, I don't want to be ignored, but I want a minute to look at the VAST menu.  Kinda back off for a sec so that I can read it & make a decision.  I don't need a 'tea tour' (as I was recently semi-forced into) while I wait.  It takes a team-member maybe 2 minutes to fill a tea bag, add hot water & ring up my delicious purchase; I can do without the \"origins-of-tea\" lesson in that much time.  I get it that you're trying to build a clientele, but please chill.  Pressure makes potential clients delete you from their LinkedIn accounts.  \n\nThat said, see you tea-morrow....oh, the puns!", "author": "Karyn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-18", "description": "The girl with the brightly colored hair, her name escapes me, she was so nice and helpful. She was super knowlegible. Her skin sparkled like diamonds in the sun, like a vampire from those movies i dont like. She was awesome and cudos to the guy with the Camo hat. You sir are awesome with your wigger ways", "author": "Alejandro B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-01", "description": "Chaotic, unprofessional, messy, disarray.\n\nLast night, I went shopping. To perk up, I stopped by David's Tea. We were quickly greeted upon entering the shoppe, however the whole experience afterward was so chaotic, it is unlikely I will return. \n\nThe counter was a complete mess with at least 15 containers strewn about the place. Too many employees made for additional chaos - as clearly they did not know what their job expectations were. Hippie vegan guy begins to help us. We already knew what we wanted, so he starts to brew our tea. We start to poke around the shoppe, as he shouts over to us the total for our tea, which I found rude and was unsure if he was speaking to us. I head to the cash register to pay when there is a question from a passerby er about tea being vegan. Easily distracted this one, hippie vegan guy shoots over to help her, leaving us in the dust to be helped by another associate. This associate only needs to take my cc to pay, when he is confused by whatever hippie vegan guy had done on the computer that a simple transaction takes far longer than one would expect. He gently scolds hippie vegan, but succeeds in charging us for our tea. Then, he gently scolds hippie vegan guy as he puts away all the tea. Now, for a small shoppe in the mall, there was 4 people working there, clearly Davids tea could reduce this number to save on overhead costs. This was a ridiculous tea experience. I could not wait to leave.", "author": "Jenn D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-22", "description": "Drink the rainbow.\n\nSkittles are still my favorite candy. Apparently not the only one who thinks red are the best: http://www.skittles.com/\n\nDavidsTea is my new favorite tea. More flavors than you could ever imagine, available for bulk purchase or by the cup. Design and branding are brilliant. Clean. Clear. Eye catching.\n\nQuality is also top notch. Coffee Pu'erh, with its hints of chocolate and caramel, was the perfect blend of coffee and tea. Can't wait to try more.\n\nWonder what a red skittle tea would taste like. David?", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "These people are so nice and respectful and you can get tea at a REASONABLE price unlike Teavana.   They also have a tea bar and I can when they were giving drinks away for free due to their birthday celebration. The service as great and I walked away more than satisfied.  I would happily tell my friends and family to check out David's.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-30", "description": "Maya gave me a sample of the pumpkin chai tea, which tasted and smelled soooo delicious! I ordered a matcha iced tea. I watched as she whisked the matcha powder with water and agave syrup .. so cool.. and she let me try it before she added any milk, to see how I would like it. I got it with whole milk and it was sooo good and tasted like real matcha, not the artificial sugary stuff.. So glad I found this place! Or maybe it's a bad thing because now I will be addicted! Yum!", "author": "Kirby T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-11", "description": "The employee this morning #900208 was rude and crass. Would not let us sample tea we were thinking about buying. She didn't honor a promotion that was going on. She was not friendly at all. Although the tea is a good quality, she didn't know what she was doing and made a horrible cup. \n\nI never heard of a tea company that only do 2 samples tea a day. So they can not make a sample of other tea if u want to try. \n\nI'm a avid tea drinker. I will not be going here again. I rather go Lupicia on the third floor. They have amazing and will let you sample. \n\nIf you ever drink Lupicia tea once you will never able to go back to regular tea again. Try Happiness green tea and cherries blossomed black tea. The best. \n\nWith this kind of business model in less then a year you guy will be out of business.", "author": "Jessica N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "I decided to stop inside this place to see why people love this tea establishment. I love the fact there are different varieties of tea flavors than Teavana. On the day I went, they were having a special promotion on their teas, when you buy a four oz tea, you can have the tea hot or iced. Which is a great promotion for those who are first-time buyers of David's tea like myself. I have the pink lemonade roobios tea, it has hibiscus, lemon flavor, lemongrass. The tea is good, I must say I will most likely stop by again to try their herbal & green teas.", "author": "Jaiesha C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-23", "description": "Great teas and super nice staff.", "author": "Raymond H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "I'm pretty much addicted to this place. First, let me explain: I decided to stop drinking soda for a variety of reasons, which is good for my health but leaves me a little sad when I go to the grocery store and see tons of sugary juices or sugary sodas, and small bottles of tasty but kinda pricey drinks. Le sigh. \nAnyway, I went to Westfield a week or so before Christmas to go to the Marbles store and I noticed that Davids had opened up, so I peeked in. This tall guy saw me peeking and said \"So what kind of tea do you like?\" I said \"Strong and black!\". He pulled down the lapsang souchong, and I was SOLD. I bought 4 different types that day, and I keep going back, usually at least once a week, to pick up a couple more. I have all the variety I could ever want, it's way better for me than soda, and it takes no time to make up. \nThe staff members are great (and I think a few are starting to recognize me) and the shop is very clean and neat. I can't say much about their products, aside from the small chain ball infuser and the pincer infuser, which are great...though I do want that big infuser they sell. Maybe next week...\nIn any case, if you like tea, if you want a soda alternative, or if you just want to meet some friendly folks and look at some cute teacups, head in the store. \nMy current faves are the read my lips, mint chocolate rooibos, and the honey bee mate. That'll probably change by next week...", "author": "Jamie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-29", "description": "This place is good. They have a million teas to choose from. But I am not a super fancy girl and like my tea kind straight up and not mixed with every different kinda fruit from brazil. So when I went in to get just a natural black tea with maybe a hint of a little something, like a black teas with a hint of raspberry they girl informed me that they had black tea or a black tea mixed with mango, mint with a hint of banana and chamomile. I was like WOW all that in one tea hum okay. So they like to mix a lot if stuff into tea which can be good if you like that. So I left with a straight up black tea in a cute little tin. When I was there they had over 50 different kinds of tea. They will let you smell any of them. All the teas are differently priced based on the oz. They also have cute tea pots and tea cups for purchase. Very nice cute little store.", "author": "Cris F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-03", "description": "After my initial review, they contacted me to try to get more information for their internal follow-up. I appreciate this gesture and this updated review reflects it.  Just because of the actions of one of their employees does not reflect the rest of the company.  I just want my review to be fair.", "author": "Goshen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "i like this place for one main reason. You can buy tea by the .5 oz instead of having to buy an entire tin which is awesome. the lady that was workin that day was also really helpful and patient with questions. I think they also have a bigger variety than teavana", "author": "Tao Tao W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-18", "description": "They are really great I made not only healthy changes here but great friends the staff is super kind", "author": "Josh A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-11", "description": "I LOVE DavidsTea at the Westfield mall in Union Square! The employees are amazingly helpful..plus they don't give you that fake, overbearingly friendly welcome that Teavana does. They're genuine, sweet, and know what they're talking about. One of the girls with really short hair asked me what my name was and the next time I came in, she remembered my name, and greeted me immediately, asking me how my day was going. They're just seriously SO nice! I feel very comfortable, and you can tell that they care more about the customers happiness over making sales. I highly suggest going here. It's the least expensive tea in the city, but unmistakably good quality as well. Want a good tea experience? Go to one of their locations :D", "author": "Eve F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-19", "description": "Tea shops are popping up all over the place.  Took home some of the black loose leaf and it was good.  There are beginning to be too many of these shops to choose from but maybe that will keep prices in check a bit?", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-12", "description": "I am so glad this store opened up close to my work. I bought my first Davids tea here last week and it's amazing! The employee that helped me was nice, but in training, so she wasn't quite up to speed and labeled one of my black teas with a rooibos sticker, but I'll let that go because she was new. I bought organic stormy night, the brazillionaire, and organic coffee chai. I love them all! Stormy night is delicious with chocolate and cinnamon, the brazillionaire is nutty, and the chai spices were nicely complimented with the coffee...kinda chocolately actually. All three are like dessert in a cup with milk and sugar. I'll definitely be back!", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "The girls working the Black Friday shift are awesome! Great customer service, will be back!", "author": "Men A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "i'm a total davidstea addict. and this location is now my favorite strictly because the bubbly manager is so darling to me everytime i come in. i wish i remembered her name because she deserves the shout out! her customer service and attitude is second to none and i just love being in her presence. kudos, davidstea!! i love you!!!", "author": "Elise H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-27", "description": "the tea selection is good and tasty. the workers are WAYYY too friendly. the lady asked where i worked, and when i told her, she screamed \"AWESOME!!!\" and then asked what department. When i told her i sold handbags, she threw her hands up in the air and went, \"WOOO HOO!!!\" i do not have an exciting job or work for an exciting company. this lady was insane and it was fairly jarring.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-19", "description": "i am beyond in love with this place! service is always exceptional! the people in here are always so warm and fuzzy! i also love the fact that they make suggestions and does not push me to buy teas! i am a ginormous fan of their teas but im equally maybe even more a fan of the people that work here! i love you guys!", "author": "Ocho B."}
