{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "This spot is such a hidden gem! IMO it's more authentic than any other spot in Chinatown, and more convenient than venturing out into Richmond/Sunset (for downtown SF folks like me). This place is so low-key that, despite having lived in the city for several years, this past weekend was my first time hearing about it. \n\nMy friend and I came here at 12:30pm on a Sunday, and we were seated within 15 minutes. There was a small crowd when we arrived, but the line moved fast. \n\nMy favorite items that we ordered: \n\n1. Steamed BBQ Pork Bun (cha siu bao) - 5/5\nWow, we were *muy* impressed. Fresh pork and the perfect pork-to-sauce-to-bun ratio, nestled in a soft, fluffy bun. \n\n2. BBQ Pork Noodle Roll (cheong fun) - 5/5\nThe skin was *on point* (the make-it-or-break-it factor for cheong fun). I've had so many \"soggy\" cheong fun experiences in the city that I was convinced I'd have to go back to HK for legit cheong fun. Happy to say that Dim Sum Club's cheong fun is legit!\n\n3. Pan Fried Turnip Cake (loh bat go) - 5/5\nPerfectly pan-fried with a crispy top layer, and not at all greasy!\n\n4. Pork & Shrimp Siu Mai - 5/5\nA HK girl knows a good siu mai when she has one (:\n\nWe also ordered the Preserved Egg w/ Pork Porridge (comes with a side of Chinese fried donut) and Stuffed Eggplant w/ Black Bean Sauce, but those were meh. I'd recommend saving your tummy for their other items.\n\nAll in all, I was very impressed with Dim Sum Club and highly recommend all you dim sum lovers give it a try!", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "Not in a typical location for dim sum since it isn't inside Chinatown....it was still very close to our motel in a residential neighborhood next to a hotel and was a quick enough walk that we decided to check it out after finding the pretty decent reviews on Yelp.\n\nWe walked in and it was relatively busy but were still seated quickly.  The server was quick to set our table, we passed on the tea due to an upcharge (seems to be a thing in SF).  The older gentleman watching over everything was super nice and came over to us to chat for a bit at the end of the meal.  \n\nI loved their take on the shrimp & chive dumpling, you can see it from my pictures....they were more like globs and not closed off on top but super yummy.  The scallion pancakes were a bit too thin and fell a part in your hand.  The salt & pepper tofu was anything but and probably the biggest disappointment overall, not what I was expecting and practically flavorless.  The chicken feet were some of the biggest and meatiest I've ever had, the star of the show here....if I could get those shipped back home 3000 miles I totally would do it.    \n\nThe prices keep it from being a full five stars, we stuck to the cheaper options and still had a bill over $40 for what didn't seem like a lot of dishes.  At least all of the prices are posted on the menu, many dim sum places don't do that for you.  If you live in the area, this will definitely do the trick to get your Chinese brunch fix in.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "Low-key, not-sure-if-it's-any-good frontage and decor, but don't let it fool you. The dim sum here is AMAZING. I have searched around SF for decent dim sum, and convinced myself that a few (not to be named) spots were good. This is the spot that reminded me I was kidding myself with the other restaurants. \n\nRecommendations: Shrimp dumplings, spare ribs, Shanghai dumplings, sticky rice in lotus leaf \n\nPros:\n- Every dish we had \n- Friendly, quick service \n- No line \n- Reasonable price ($25 each and we stuffed our faces)\n\nOkays: \n- Tea wasn't super satisfying \n\nCons:\n- N/a", "author": "Perry H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "I came here based on Yelp recommendation, and it's pretty good Dim Sum for an exotic location. The service was friendly and the most importantly, the dim sum was hot and tasty and very affordable.", "author": "Andrea Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-28", "description": "Got here at 2:50 when advertised open until 3pm.  Were refused service and told they were closed.  We had driven over one half hour to get there, very rude especially aince there were several people still dining.", "author": "Robin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Still the best dim sum I've had in SF. Reliable and charming, with efficient service. It keeps getting more and more crowded but still a bit of a hidden gem.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "yummy & no frills, no chaos of chinatown. \n\nI would not recommend the buddha veggie noodle roll - it tasted a little strange to me, but the shrimp noodle roll was great. If you're vegetarian, there's another veggie noodle roll i'd try instead.", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "-great prices, fast and very friendly service \n-my favorites were the shrimp dumpling and the pork and shrimp sui mai, I didn't love the steamed BBQ pork bun \n-awesome green tea, you have to get it!", "author": "Shawn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "We drove to this restaurant after seeing a long line for the Dim Sum place we originally planned on going to. The service was fast, the owner was very nice, and the food was great. My favorite dish, though not seen in the photos, was the 'Deep Fried Pork Puff.' It was savory and melted in my mouth. My sister who is a huge fan of soup dumplings loved her order of soup dumplings. All in all, each dish was thoroughly enjoyed and the bustly  atmosphere was reminiscent of an utterly enjoyable dim sum experience.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-25", "description": "The food here has gone downhill since the last few times dining here. The Shanghai dumplings were way undercooked (pink pork meat) and the outside was gummy and like clay in my mouth. The vegetable gyoza/pot stickers were also gummy and very underdone, and the insides flavorless and a mix of random sodden vegetables that didn't pair well. The pork puffs had an incredibly fishy smell and taste to them inside and out, perhaps they were fried in the same oil as a seafood item. Many items we ordered this round were definitely inedible and we left much of it behind because we couldn't eat them nor were we at all interested in taking them home to-go. \n\nService was touch and go. No air conditioning so the heat from the kitchen really fills the venue and makes it stuffy and uncomfortable. Floors were questionably clean. I'm sad that this was once featured in SF's Weekly Yelp and now it's really taken a nosedive.", "author": "Alison A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Dim Sum Club has consistently gotten better over the past two years. Yup, five star worthy now. It used to be a little too oily (many of the dishes) but I feel like they took note and listened to customers - or got a new chef. Our last visit, we were so impressed with every single dish. What stood out: salt and pepper chicken wings (perfection) shanghai dumplings (perfect), pork chow mein (epic!) and onion pancakes (heaven!). I also like that they're friendly. Most dim sum experiences are impersonal - you order and there is no interaction with your server. Here they actually check in on you and ask you how you like everything. A little goes a long way. Yes, a Cow Hollow motel is a random location for dim sum, but heck, it works. And it's worth trekking to the area for if you are on a dim sum kick.", "author": "Meredith R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "One of my favorite Chinese spots in SF, right on Van Ness. Don't judge it for being part of a motel! The food is pretty darn good. Parking can be an issue with being right on Van Ness, especially with all that construction going on with the lanes. We try to park a couple of blocks away and walk over. \n\nFood: They have congee! I ordered the pork and century egg congee, with ginger and scallion. Good sized portion (enough for two to share, or just be one hungry congee eater like me), and was served with the traditional side of deep fried dough cut into strips. I rather mine be whole, but it was fine. We also ordered the har gao (shrimp dumpling), and siu mai (shrimp + pork). Both delicious and fresh. The orange chicken was perfectly cooked, with a nice coating of sauce that wasn't overly sweet. The salt and pepper pork really should come in a entree size. Crisp and delectable. \n\nService: The food does not all come out at one time. As with many Asian restaurants, dishes come out as they are cooked, and we're used to that. That does mean food is cooked to order, and everything was hot and fresh. Water glasses were kept filled, and we gave them a wave when the teapot needed refilling, but that was done quickly. \n\nCost: We had SO much food. We clearly ordered too much. It was about $70 after tax and tip. And for 3 people with the amount of food we had, that was pretty decent.\n\nOverall: Give it a try. Food is good, and the ambience was decent. Parking can be a bit of a pain, but if you're up for walking a couple of blocks, you'll be fine.", "author": "Shirley B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-03", "description": "This restaurant seems to be geared toward non-Asians (probably because of the location), and because of that, prices are really high compared to other dim sum places. Siu mai for $6.25, are you forreal?! That better be the best darn siu mai I've ever had (spoiler alert - it's not). \n\nBuddha vegetarian noodle roll ($6.50) - full of veggies, including bamboo, carrots, and fungus. Noodle was thin and soft as it should be, while still being able to hold the contents of the roll without breaking apart. \nChinese donut w/ noodle roll ($5.50) - came out looking a bit messy and deflated. The Chinese donut didn't taste like it had just come out, and so the whole thing was just kind of chewy. Didn't include sesame paste or sweet sauce, boo.\nPork & shrimp siu mai ($6.25) - looked good, decent size, juicy and tasted good too. But not so special that I can't get it elsewhere for a couple dollars cheaper. \nSteamed homemade dumpling ($5.50) - not personally a fan of this anywhere, but parents said it was good\nPan fried turnip cake ($5.00) - this was the best dish of the meal. Delicious and pan-fried beautifully with that nice crispy top!\nPan fried bean curd skin roll w/ shrimp ($6.75) - this was also fried very nicely so the bean curd was light and crispy. Very generous portions of shrimp inside.\n\nOne shocker is that tea is only $1 here, awesome! Menu doesn't have much variety outside of the standard dim sum items. They do have some rice lunch specials from 11am to 3pm. Service is good, restaurant is clean. Bathrooms are shared with a couple other office spaces in the back, but the door leading to it is broken, so you can't come back the same way and have to exit the building to go into the restaurant again. \n\nI wouldn't go out of my way to come back again because the prices are too expensive for food that isn't spectacular.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "Dim Sum Club is a great restaurant downtown that knows how to prepare classic Chinese dishes.  We ordered an array of dishes including :\n\nShanghi Dumplings - These were great!\nFried Rice - Absolutely delicious' and would recommend\nChow Fun - Hot and tasty to eat!\n\nI would not recommend the wonton soup, wontons were not that tasty but it was a huge portion meant for 2 or more people.", "author": "Alana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "Really good spot for Chinese. Food came out quickly and the wait staff was attentive. Dumplings, calamari and pork buns were all really good. Egg rolls were decent. Prices were very fair for the quality. The hours are a little weird (closed at 8:50pm) but would definitely return if staying in the area again.", "author": "Al C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-03", "description": "Have you ever known a restaurant that serves dim sum for dinner? Yeah, me neither. Despite the name, DSC does not serve dim sum all day! \n\nThe dinner menu was instead a concoction of dishes conducive to family style dining. Food was pleasantly nice and had the \"home cooked\" flavor without being too oily or salty. The Chinese broccoli with garlic, pork strip rice noodles, and soft tofu were all solid choices.\n\nYou know what would make things really great? All day dim sum.", "author": "Cici T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "Pros: no wait for tables, friendly staff/service, pleasant environment, not far out in chinatown or the richmond. Food comes out fast and some dishes are comparable to any good dim sum spot (the chinese broccoli, the congee). Great for large brunch groups who hate to wait. \n\nCons: not the best dim sum in terms of quality. It is pretty obvious that a place like hong kong lounge has higher quality in certain items, such as the egg tarts. The choices are fair in range but again, its somewhat limited. Also the price is very high for dim sum, given the okay quality and small portions.\n\nRecommend: the shrimp and peashoot leaf dumpling, the panfried mixed mushroom dumpling, chinese broccoli, the fried sesame balls.", "author": "Crystal Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "This review is only for take out. \n\nI actually wanted to dine in here but the employees seemed to say something like we could not due to a chef calling in sick. Their English was very poor but I was able to ask if we can get takeout. \n\nThe prices are pretty steep but the quality is excellent. In addition, the interior is well kept so dining in is probably a nice experience. \n\nRice Noodle with Fish- I usually order this with shrimp but I actually really enjoyed the fish filling! The fish was very flavorful and the noodles were soft and fresh. \n\nSiu Mai- Very tasty and meaty. On the smaller side. \n\nHouse Chow Mein- The noodles were cooked how I like, thin and crispy! Lots of toppings and different meats. The Chinese Broccoli was a surprise add instead of bok choy but it was tasty and soft, not too stringy either.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "We came in and ordered food to go. The place was busy though not packed, so we were told we would have to wait 25 minutes. The food was ready in like 15 minutes.\n\nI got the house pan-fried noodles. This had chicken, pork, shrimp, and squid in it with Chinese broccoli. The flavors were good, and I enjoyed the bits of crispy noodles as well as the parts that were soaked in sauce.\n\nDon't miss the baked pork buns. These were the most delicious pork buns I've ever had, with a crisp outer layer and soft inside stuffed with sweet BBQ pork.", "author": "Ariana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "I'm super excited to have found Dim Sum Club because 1. It's not in Chinatown there was no wait on a Saturday morning and 2. The dim sum is LEGIT!\n\nThe location is pretty random on Van Ness in a hotel but once you enter it feels and looks like an authentic Chinese restaurant (aka no frills but hey, at least it's clean!)\n\nOur group of two ordered way too much and the final verdict was:\n\nGet:\n-Shrimp dumpling\n-Sticky rice in lotus leaf\n-Steam Spare ribs\n-Chicken Feet\n-Turnip cake\n\nSkip:\n-Taro dumpling: too much mush, texture was off\n-Shanghai dumpling: dough was too thick\n\nHouse pan fried noodles were acceptable but other items were probably better. \nAll in all a great find! Will be back when I feel that dim sum hankering!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "Great noodle rolls, har gau, etc. A little more expensive than the east coast but I guess that is expected in this city.", "author": "Doven M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-23", "description": "Overcooked, not very tasty food, and difficult to digest. Not terrible, but would.not come back.", "author": "Federico P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Not sure why this place is not more highly rated but love this sit down dim sum gem. Very family friendly accommodated a baby and 6 adults. Perfectly located for our party as it was a short stroll to a Fisherman's Wharf after lunch. We pretty much order everything including the staples shumai, pot stickers, bbq sweet pork pastries, taro, Singapore noodles, duck, beef... sesame seed balls and durian for dessert. Everything was fresh, tasty and yummy. The service was top rated and felt more like a family restaurant. Even though the food was not cheap it was well worth the value in my opinion for the quality and tastiness. Will definitely look to revisit in the near future.", "author": "Mark T B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-05", "description": "Excellent vegi noodle roll and pork bun. Def worth a try.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "Exactly what I was looking for. Greasy, hot, decent Chinese food.\n\nI was really appreciative of the picture menu - perfect when you just don't have the brain to think about exactly what you want.\n\nBoyfriend and I came here on a Wednesday evening, and were seated right away.\nWe ordered:\n- Dim sum (har gow, siu mai) - made to order, which is rare for dim sum - came out steaming and delicious!\n- Mixed stir-fry veggies - tasty\n- Seafood chow mein - tasty, standard\n- Mongolian beef - tasty, standard\n- Two orders of white rice - nice and dry, the way I like it\nEverything arrived at our table STEAMING hot. I was pleased. \n\nEverything was exactly like I expected and pretty yummy! A little on the pricier side for basic Chinese food; all this ran us $60 before tip, but not bad considering how many leftovers we took home. \n\nWould come again!", "author": "Vivian N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-01", "description": "If you're looking for late night dim sum and you're in the Marina or Russian hill area, this is the spot. It might be the only late night dim sum open...\n\nWhile the variety of true dim sum is limited (~12) they offer the typical dishes. \n\nMy favorite was the dried scallop egg white fried rice. The chicken broccoli was unsurprisingly poor. Very dry meat and broccoli was over cooked. \n\nI came on Sunday night after Chinese New Years. Service was good and had friendly staff!", "author": "Jasper L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-20", "description": "We ordered soup dumplings as an appetizer. They were amazing. I got hot and sour soup. The portion is ginormous, definitely split this with 3 or 4 people. We also ordered the samosas. Everything really tasty, just terrible service.", "author": "Mandie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "Last minute decision to come here for lunch. Overall we had a nice lunch, efficient service, good portions and decent pricing. There were 6 people total and we spent about $100 and all left pretty satisfied with leftovers.", "author": "Andrea I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "Got there at opening time to get a table and avoid long wait. Food comes out quickly and is good authentic Cantonese style dim sum (or \"yum cha\" as they call it in Australia). It was nice that they didn't try and push us out even though it was starting to get very busy.", "author": "Rozie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-23", "description": "This place is a solid three stars and, on a different day, may have been a four. It's not a bad place. The service was good - but don't try to ask the red flash (waitress) any more than one question per table visit - because by the time she answers the first, she is disappearing into the kitchen.\n\nThe food was quite good in a deep fried sort of way. \n\nWe had our hearts set on a really good Dim Sum experience and, while it was a nice place with a good selection of Chinese food on the menu, we thought the Dim Sum was a little ordinary. However, we did arrive at night and Dim Sum is a daytime sort of thing. But, if you offer it at night, it should be just as good as at lunchtime.\n\nAnyway, we had a nice time here despite being a little disappointed in the DS offerings. We would go again...but probably during the day.", "author": "David F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-23", "description": "Going by the name, you would think this is the place to be for dim sums. That's what we expected when we showed up here but we were slightly disappointed. Once we entered, the staff was least interested to take care of us. The jasmine tea is not complimentary here, just a note that we didn't realize in time. Eventually we got to placing our orders. The dim sums arrived but it was just average. We had better at other places and didn't feel this place lived up to our expectations.", "author": "Oly M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-06", "description": "MEH, we were in the area on a weekday, felt bad there were no patrons.  We came, we ate, we left.  Who came up with the name \"Dim Sum Club\"?  Not too clever, did they even try?  \n\nThis definitely isn't Koi Palace or Mayflower, not even close!  The usual stuff like baos and noodle crepes were alright, nothing superb.  Some of the stuff tasted like it was frozen overnight and taken out the next morning to steam or cook.  The chicken feet was overcooked, and we mentioned it to our waitress.  She was nice enough to exchange it with something decent, which was the chive & pork dumplings.\n\nGrowing up in San Francisco's Outer Richmond, there are a plethora of authentic dim sum restaurants to choose from aka Hong Kong Lounges and Cantonese foods.  I've been too spoiled in the Avenues.  \n\nOverall, wouldn't come back.  They also charge for tea per person.  If my mama knew that, she would slap me Madea-style!", "author": "Christine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "I tried Dim Sum Club when I was visiting this neighborhood, and boy am I glad I did. This is better than all the dim sum restaurants I've had in SF Chinatown. It's much better than Yank Sing, which is the definition of tourist trap. The pricing here is a bit high but they make up for it in very satisfying portions--4 items are plenty for one person. Do yourself a favor and get their baked bbq bun, shrimp roll and, of course, the shrimp dumplings.", "author": "Carl W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "Oh yum! There is less than a handful of dim sum places in the city that I would consider great and Dim Sum Club is one of them. They don't have those ladies pushing the food carts around so the food is prepare by order which is actually better. The food comes out piping hot and super fresh. The siu mai is super juicy here! I highly recommend getting a few orders of that and the shrimp balls! Those perfectly fried meaty balls are huge! The biggest shrimp balls I ever had for dim sum.  LOL. It's a little pricey but the quality and service is worth it. I would definitely return and yes, I would recommend this place. Oh, and they take reservations so call ahead.", "author": "Judy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "Been walking by this place for years but was always a little weirded out that it was on the ground floor of a motel. Finally tried it one day and it's now our go-to for when we are craving dim sum but too lazy to drive out to the Richmond. The place is a little old and dumpy but the food is pretty good and gets the job done. Service is fast and surprisingly friendly. Haven't waited more than 5-10 minutes for a table during peak times. You order via marking quantities on a piece of paper that has both English and Chinese.", "author": "Sarina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "Pretty good dim sum. Not too expensive, good service. Egg tarts were a little small, but everything else was a good size. Would go again!", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-01", "description": "Soooo, I'm going to be the odd duck in the bunch and rate Dim Sum Club two stars. After reading my co-workers compelling write-ups, I was extremely let down by the food quality and the service. \n\nWhat to know before dining:\n\n1) The wait staff doesn't speak English.\n\n2) The food is served piping hot. Don't make the same mistakes I made.\n\n3) Yelp has placed a consumer alert on their page due to poor health inspection scores.\n\nThe only two items I thoroughly enjoyed were towards the end of our meal. Those being a Turnip Cake, which is most comparable to a hash brown, and the Salt & Pepper Squid. All the other items, primarily the dumplings, were not up to par for me. \n\nI left stuffed to the brim, but I have no reason to ever go back. Sorry, but you can kick me out of the Dim Sum Club!", "author": "Matthew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-14", "description": "Never had Dim Sum before, first time today 1/13/18\nThere was a menu to choose from ( I thought it was going cart to choose from) prices were reasonable. No pictures of food so you might want to google what you are ordering first or else you'll be surprised like us haha. Two of use ate for $41 we ordered about 4 different dishes. flavor of dishes were good. The food is some what greasy but good! Non-English speaking but you get an authentic fell", "author": "Yvonne m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "Great dumplings! Avoid the Shanghai dumpling- it wasn't as good as everything else. The shrimp dumplings were awesome!! Get the green tea- it makes the meal! The noodles were delicious!!", "author": "Gita K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "We happened upon this restaurant during our annual Christmas in the city day!  Delicious from beginning to end.  The pork buns were our unanimous favorite, but all of it was super yummy!  We'll definitely be back!", "author": "Denise R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-31", "description": "Do NOT be fooled by the ratings. This place is extremely unprofessional & does not know how to tend to a customers dissatisfaction. \n\nLet's first start off with what I ordered:\n\nSEAFOOD TOFU CLAY POT: Ok, so the title of this dish says it only has tofu and seafood right? WRONG. There was a bunch of beef & chicken along with the seafood and tofu. I am a pescatarian therefore I have a problem with beef and chicken in my food when the title of the meal obviously says only seafood and tofu. I asked the waitress if she got my order wrong and she kept saying, \"Oh that comes with it too.\" I understand that she, along with everyone else at the restaurant does not speak English well so I gave them the benefit of the doubt. I asked if they're sure this is what I ordered and if they can double check. She constantly said yes beef and chicken come with this dish and I said but the title of the dish is seafood and tofu AND it was under the seafood options so why is there beef and chicken? Knowing that the other options were beef and chicken I specifically chose from the seafood menu for a reason.\n\nI honestly don't wanna review the other items I ordered because those items were not all that great either.\n\nCUSTOMER SERVICE: Whack. \n\nAfter all that happened they even asked us for a tip; they literally said, \"Where's tip? Where's tip?\" I always tip when I'm out to eat due to common courtesy however, definitely not in this case.", "author": "Phuong H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "Surprisingly decent Dim Sum in SF!  The place is filled with Chinese people so you know it's gotta be decent.", "author": "Byron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "The BEST SHRIMP ROLL & STUFF MUSHROOM I have ever eaten. Compared to many ma y of the restaurants I've ever been too. They just melted in my mouth lol  everything else here are good also!! :)starting my 2018 right.", "author": "Hannle P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "This place is a hidden gem a solid 4.5 stars!  Not fancy to look at but service is quick and the food is an excellent! \n\nWe were saying goodbye to our son and daughter-in-law before heading out to Yosemite and wanted to fine a place for lunch at open at 11 AM near our hotel. The Dim Sum Club turned out to be a great choice!  We order 7-8 dishes, vegetable spring rolls, shrimp dumplings, Shanghai dumplings, fried tofu, steamed BBQ pork buns and sesame balls for dessert.  All of the food was good and the price exceptional considering we had eaten earlier that week at Yank Sing in the financial district and it was good but for the price I'd pick Dim Sum Club.  \n\nFood - 5 stars food was very good and freshly prepared as we were in early and the kitchen started to crank out the food. \nAtmosphere- 3 stars not great but clean and in good shape.\nService - 4 stars Considering the time of day, they did great in getting our food out and keeping up with us on refills. \nPrice - 5 stars  - We had a great early lunch for about $20 a piece before tip!", "author": "Ron P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "We wanted something different than what we were getting with the ACRONYM events, and Chinese was chosen.  We Ubered up there and Ubered back.\n\nThe food was good....not great wow-a-riffic eyeballs rolling into the back of my head good.  But good solid food for a decent price.  I really enjoyed the dim sum sampler I got.  Everything was, of course fresh...something that I don't get very often in Reno.   I also loved the duck and the salt and pepper calamari.\n\nI won't go with the old trope of looking at all the other Asians in the place to gauge the \"authenticity\".  It was also nice to have a nice \"family\" table to sit at, I know these tables aren't the best for floor space but they really do encourage great sharing and socializing over a meal.\n\nAnd while good...I probably won't go back.  Because there are only so many meals I am going to be able to have in SF!", "author": "Robert S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-07", "description": "This restaurant was walking distance from my hotel. Very small restaurant with limited seating. Menu has various Chinese dishes along with dim sum offerings. We tried the shrimp dumplings which were steamed and delicious we tried the potstickers and bao. Dishes were cooked fresh to order in portions are very nicely sized for the price we had leftovers for breakfast the next morning the staff is nice and helpful ambience of the restaurant seems very small, but hey this is San Francisco. Parking is limited especially on Van Ness.", "author": "Rhondi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "For selfish reasons, I almost want to keep this place a secret, but I must tell ya'll, they have a TON of vegan / vegetarian  options here! Honestly, dim sum can be quite scary for the Veggie eaters out there because mostly all things are packed with shrimp, pork, beef...etc. This is why I was super stoked eating here.  They even mark their menu items with a, \"V,\" if it's vegetarian! Now this is a place that gets it! I'll always order their veggie dumplings which come in these green wrappers and stuffed with wood ear mushrooms, bamboo shoots, ginger, and cilantro.  Their salt and pepper tofu is probably one of the best in all the land...and they have have the most perfectly fried sesame balls....oh oh, and Ja Leung!! YESSSSS!!!  Clubbin at Dim Sum Club keeps me young. Love this spot!", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "Take this review lightly, because after getting pretty hammered with #bosslady and fellow co-workers about an hour or two beforehand (and by hammered I mean this lightweight drank three tall beers), neither my tongue nor brain recalls much from this late night dim sum splurge sesh. But I'll tell you what I did remember: dim sum is some damn good drunk food. Oh, and that you have to these weird ascending steps in the back to get to the bathroom. \n\nOkay, okay. I remember other things:\n*****\nI. FOOD & DRINK\nFor drinks, they have your typical coke products, tea, and Tsingtao. Get a Tsingtao, because it's like the best worst-beer, ever. About the food:\n\n*Har Gow: Pretty solid. The skin didn't stick to each other and the shrimp was deliciously juicy. I couldn't ask for more.\n\n*Cheong Fun: My favorite - the shrimp crepe smothered in a sweet soy-sauce. I could eat this everyday of my life. I don't care that doing so would probably give me really high blood pressure.\n\n*Shu Mai: Plump pork awesomeness. Why can't I eat this every time I'm tipsy? \n\n*Turnip Cakes: All right! Dip them in lots of soy sauce, and it's whatever...\n\n*BBQ Pork Buns: I think they were pretty nice. I was pretty tired at this point.\n\n*Xiaolongbao: Hmm, kind of thick with the dough. Juice was hot fire, though. \n\n**Deep Fried Pork Chive Dumplings: There were crumbs on my face and grease stains on my pants. So I would say good! \n\n**Singapore Street Noodles: Don't know why we got this, but it was all right. I wouldn't order it again.\n\nSo yeah, overall, the meal was pretty legit considering the circumstances. Definitely have this place on your radar if you're the type to inhale ice cream in the morning because YOLO. Lol.\n\nII. SERVICE\nPretty fast! Not super friendly, but who cares. #dumplingsinmymouf\n\nIII. AMBIENCE/ DÉCOR\nNothing too fancy. When we went, there was an empty buffet bar and wine bottles out. Bathroom is in the back up the ascending stairs to the right. Somewhat clean. Lol.\n\nIV. PRICES\nCompared to other restaurants in The Bay, this establishment was pretty affordable!\n\nV. OVERALL\nSo if you're in San Francisco...\n-forget the greasy burger\n-look away from that Korean BBQ taco (errr maybe not)\n-and disregard the gigantic slice of pizza that's larger than your head, which could probably give you diabetes in one bite...\n\n...because your stomach will thank you for journeying to the Russian Hill hood to check out Dim Sum Club. Holla!", "author": "Jonathan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "Rebecca and I stopped in earlier today. We chose this place by chance. I am glad we did.\n\nWe started with sticky rice and turnip cake. The sticky rice was warm and had great flavor. The turnip cake had wonderful flavor and texture. We then had shrimp and shumai; we enjoyed both. We ordered two orders of steamed buns. They were some of the best I have ever had. The dough was sweet, the filing warm and flavorful and the soy sauce enhanced the whole. \n\nI was surprised at the variety of reviews of this place. We could not have been happier with our meal, the service or the cleanliness  of the restaurant. We are very we stopped in.", "author": "Ronald A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-29", "description": "When my buddy suggested we go grab dim sum for lunch yesterday, I was super stoked because I hadn't had it in a while. He mentioned that it was located inside a hotel and it's a \"hidden gem\" mostly because of it's proximity to where we both live. I was super intrigued because I have a pretty good handle on dim sum spots in SF (none of which I've had outside of the normal dim sum neighborhoods). \n\nAnnnnnnnyyyywaaaaayyyy. We were greeted by a friendly host and the servers were super nice. That's not typical for most dim sum spots, so props to the staff for that. I was surprised to see the prices so high for dim sum, especially at lunch. I'd say the average per item was just over $5, which may not seem high, but in the world of dim sum is quite pricey. \n\nWe ordered a number of dishes (see pictures) and they were all just ok. Everything felt a bit greasy, the fillings heavy and nothing really wowed me. Perhaps it was because my expectations had been built up, perhaps it just wasn't my style. Who knows. I will say that the duck was pretty damn good and the skin super crispy.\n\nAll in all, it's a passible spot if you live in the area. However, I would suggest making the trek to the outer richmond district to find the legit dim sum spots in SF.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-04", "description": "We went for dinner, not for weekend dim sum. The dim sum selection is a lot smaller in the evening; we got the $10 dim sum sampler, which was a small but tasty selection. I was impressed by the texture of the pork bun, and the skins of the har gaw were decently thin. I'd be interested in coming back for weekend dim sum for sure! We also got the bbq pork noodles, which were good but not anything spectacular. \n\nThe food and price would probably be 4 stars, but the restaurant had a serious fruit fly problems. Luckily none were in the food, but they were zooming around the dim sum and noodles the whole time...", "author": "Hali M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "Food is great not salty. Dimsum was perfectly cook. Parking was bit issue. But everything is good", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "The Dim Sum Club was another place  highly recommended to me by my Yelp Community Director.  We had an enjoyable, delicious dinner here.  If you're looking for a nice sit-down restaurant for dim sum this is your place. Finding it was a little challenging.  It's on the first floor in the middle of a multi-story building.  I didn't realize until I researched it later that it is on the ground floor of a hotel! \n\nThere is ample seating available.  We told them we might have some people joining us later and they were happy to seat us at a table that could accommodate them. Part of the fun of a place like this is trying many different dishes.  We each ordered individually but shared with each other.  One unexpected bonus was that the extremely friendly gentleman who welcomed us to the restaurant rolled a cart over to the table and cut the duck into bite sized pieces to put into buns.  It was interesting getting to watch that. Everything I ate was quite good.  The pork potstickers that I ordered were my favorite and a sesame ball was a great way to finish the meal (thanks Robert!).\n\nAs much as I enjoyed the food I did have some complaints.  The glasses for water they give you are the size of a thimble, which is a nightmare for me because I tend to drink a lot while I'm eating. I had to flag down our poor waitress at least three times for more water.  When I was ordering I asked for separate checks and that was met with resistance. When the bill came we asked if they could just divide it by four and that was refused also.  They would only divide it in two. Weird but definitely not show stoppers for coming back for more great food from the Dim Sum Club!", "author": "Chris W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-26", "description": "\"Poor food safety alert\" was what we saw on Yelp when reading the reviews on this place. I love mom and pop shops so that didn't deter me from wanting to try it. \n\nService was okay, it wasn't busy. \n\nWhat we ordered:\n\nSalt n pepper calamari: it had good flavor, tender, not too salty and lots of jalapeños which I loved. \n\nX.O. Turnip cakes: this was yummy. A twist on the regular cakes, deep fried to perfection. The mister is not a fan of turnip cakes anytime I order it at dim sum but this he actually enjoyed. \n\nShrimp rolls: meh, nothing special. Same like every where else.\n\nPork and shrimp Sui Mai: these were bigger than the norm I've seen around town. It was really juicy and had huge chunks of shrimp it in. The only thing I still can't wrap my head around was its sweetness. At first I thought ok, maybe it's the shrimp...but the more I ate it, it definitely was not the shrimp. I dunno....\n\nChicken feet: I have been craving this for a while and was looking forward to it. This however was a huge let down. It too was sweet....really sweet, like too much sugar or something. It was almost inedible. \n\nMaybe this place really like their food sweet.", "author": "Tuyet N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-26", "description": "This dim sum place is not bad. I would come back again but I don't think I would put this in my favorite dim sum places.\n\nOne of my favorite dishes the beef rice noodle roll had cilantro in it. I've gotten this dish plenty of times at other dim places and didn't have this problem. I took one bite and was saddened by the taste.\n\nTheir other dishes weren't bad. I liked their eggplant dish. The sauce was really savory. I thought the Shanghai dumplings were decent as well.\n\nDecent food, but still felt like something was missing though. They also don't bring the carts but have the menu for you to choose from.", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-23", "description": "I don't even want to tips this restaurant. The food is okay but their service at night is very poor.\nCustomer experience: BAD.", "author": "Lê H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-21", "description": "Ate here on my last visit to San Francisco's Chinatown, I'm going to save you the trouble of coming here for dim sum, the name can be deceiving. This is not a true dim sum restaurant, this is a Chinese American food restaurant.  Don't expect traditional Chinese, Cantonese, Hunan, or etc.... it's Americanized.  The service was ok, water drinking glasses are super small, they give you kid size water glasses, I mean come on.  Had the Mongolian beef stir fry, it was greasy, really small portions for the price you're paying.  I would say in a pinch this place is ok.", "author": "Vic C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-16", "description": "Dear Mr. Lunchon,\n\nWe accept the fact that we had to sacrifice a whole Wednesday in dimsumtion for whatever it was we did right.\n\nBut we think you're hangry to make us write an essay telling you what we think we eat. You order us as you want to order us: in the dimmest terms, in the most summent definitions.\n\nBut what we found out is that each dish of us is a CRISPY DUCK brain...\n\nAnd a PORK NOODLE ROLL athlete...\n\nAnd a SHRIMP CHIVE DUMPLINGS basketcase...\n\nA CURD SKIN BEEF BALLS princess...\n\nAnd a smooth SPARE RIB NOODLE ROLL criminal.\n\nDoes that answer your DURIAN PUFFS?\n\nSincerely yours,\n\nThe Breakfast Dim Sum Club", "author": "Dan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-13", "description": "After our meal, my sister had wrote a $0 for the tip part on the check because she was going to give cash. Before my sister was even able to pull out her cash, the lady who was checking us out had the nerve to say \"excuse me\" and point at the $0 amount on the tip. RUDEEEEEEEEEE! I would have not left a tip!!!!! But knowing how nice my sister was she still did. Bitch pleaseeee.", "author": "Newzong Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "#19/2016\n\nI was in the mood for dim sum but I was *not going to head to Chinatown on market day (I've done that before, madness), I didn't feel like getting it \"to go\" and heading home.\n\nAfter all, isn't the fun of dim sum eating it piping hot, fresh from the steam cart?\n\nWhile you won't get the rolling steam cart experience here- you tick off your own selections on a thin, pink paper menu- you'll get very good service & probably eat a little less since those tempting little baskets won't constantly be passing you by.\n\nMy little boy and I bounced around the menu getting the BBQ pork noodle roll, Won Ton soup (outstanding!), XLB (Shanghai soup dumplings), Shrimp & chive dumplings, pork siu mai, har gao, pineapple baked buns, an entree (huge portion!) beef and rice with egg\n\n(raw egg poured over the top of this huge steaming bowl of beef & rice, simply stir in).\n\nFor those hard core foodies, they have deep fried durian dumplings. I bet you haven't seen these at Yank Sing, nope!\n\nThe service is crisp, quick and friendly, the restaurant looks very clean and the dishes are very good. Most of the clientele are Chinese, always a great sign.\n\nFor a sit down, dim sum experience without breaking the bank, I highly recommend Dim Sum Club.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-28", "description": "Sadly, after years of enjoying Dim Sum Club as my go to place, and being on friendly terms with the owner, I can no longer recommend it. This isn't one bad experience or a fluke. Over time ingredient quality has gone down, prices up, portions smaller, it seems like corners are being cut, and the bottom line execution and taste of the dishes isn't what it used to be. The repeated bad health inspections point to the same thing... the thrill is gone. Sorry.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-31", "description": "Who'd have thought you could find good dim sum in a motel? Yes indeed, it's in the DaVinci Villa at Van Ness and Filbert, and at first, I scratched my head wondering how good could it possibly be? Y'see, I've been on a bit of a hunt for good soup dumplings ever since Jamie W. and I returned from Shanghai a few weeks ago where we had what we think were the best ones at a place called Din Tai Fung. It's ironically part of a Taiwanese-based international chain, but they treat dumplings like little pieces of culinary art complete with step-by-step instructions on how to eat them. Even their menu was gorgeous and inviting.\n\nNot so much here. It's the standard pink sheet with the checklist (photo: http://bit.ly/1OwfNMF) and gratefully no rolling carts like at Yank Sing where I always end up getting stuff I had no intention of eating. Alas, we still ate pretty heartily starting with a $6.95 bowl of Wonton Soup since it was too cold outside not to. It was good with a lighter broth and plenty of Chinese broccoli (photo: http://bit.ly/1VuwOMW). Jamie ordered the $4.50 quartet of Pan Fried Pot Stickers, and they were stellar, meaty with the right amount of crust and no need for the sweet sipping sauce (photo: http://bit.ly/1kxjvxL). I decided on the $5.75 BBQ Pork Noodle Roll just because I like the softer texture (photo: http://bit.ly/1MKmsBQ).\n\nJamie enjoyed the pork filling a lot since they use liberal chunks of chashu. Of course, we needed to try the $7.50 Shanghai Dumplings because that was our primary reason for being there. Served in the traditional bamboo steam basket, the half-dozen dumplings were plump with broth, so it was a good thing we were trained so well in Shanghai on how to eat them lest we lose all the soup on our shirts (photo: http://bit.ly/1YV6XOw). We followed those up with a $4.25 basket of Vegetarian Dumplings which of course came in green wrappers, but they were surprisingly savory with mushrooms giving good unami flavor (photo: http://bit.ly/1SpIMYA). Methinks we'll be coming back to this motel.\n\nFOOD - 4 stars...surprisingly good dumplings in a most unlikely place\nAMBIANCE - 3 stars...fairly generic inside but plenty of booths and tables for large groups\nSERVICE - 3.5 stars...speedy and friendly enough\nTOTAL - 4 stars...if you can't make it to Shanghai, this'll do", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Great food served hot and fast! As far as Dim Sum platter goes it is the best I have had. I'm going to go as far as saying this Chinese Dim Sum is as good as it gets! I cannot wait to return, I visited yesterday and I cannot stop thinking about that Dim Sum Platter.", "author": "Michael P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "Great food.  Enjoyed the sesame balls dumplings eggplant and noodle rolls.  Food came out quick and hot.  Staff was not friendly however did their job efficiently.  Would go back. Left with a happy belly.", "author": "Dena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "I've had dim sum in Los Angeles and Monterey Park, two places that know how to do dim sum.\n\nThe food here was on par with the best!\n\nThe har gow was tender, not gooey. And the shrimp was flavorful. We mistakenly ordered boiled spare ribs and discovered they were delicious!\n\nThe salt and pepper calamari was especially tasty with just a squeeze of lemon. \n\nLight and fluffy steamed buns for the BBQ pork filled me up too much for the salted egg dessert, but now as I'm home writing this, I sure would love to have one.\n\nThe atmosphere is casual, the service friendly and the food, mmmmmm, mmmmm, good!", "author": "Patty H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "This place isn't great but I will say I keep coming back for the hot and sour soup. The one with dumplings is so good! Everything else is okay.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-25", "description": "A dim sum place in RUSSIAN HILL/MARINA?! That is amazing! And the fact that it is actually pretty good. I crave for dim sum once in a while but I don't want to travel to Chinatown. So happy there is one near me now. \n\nYou can make reservation which that is awesome. The staff is nice and friendly.\n\nMy favorite dim sum is their X.O turnip cake and chicken wings (for lazy people, because they take out the bone for you). Their main dishes, such as noodles are really good, favorite is their seafood crispy noodle.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Tried this for lunch and was frankly surprised and pleased by so many things. It's a very clean and open atmosphere with kind, attentive service. I looked for the $10 dim sum sampler but it wasn't on the menu. My guess is that it's a goner. \n\nThe shu mai pork and shrimp filled dumplings were juicy and well seasoned. They really were supple and fresh. That was the first dish that came pretty quickly. Ordered a small cup of steamed rice too. The salt and pepper chicken wings were delicious but they weren't glazed or dry flavored too much. The fresh scallions and jalapeño peppers on top were a nice and welcome touch. I accidentally ordered the pan fried turnip cakes but they weren't too bad. I liked the texture--firm but still moist too. The pan fried pot stickers --what I really meant to order--arrived just at the end, plump and sweaty a bit. Glad I always had the soy sauce and chile oil sauce for me to dip in the whole time. The sauce that came with -- well, it didn't have much flavor. This place is a great find.", "author": "Alfonso L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "Good food but they don't do carts which is always fun. Location is good and noise is not too bad.", "author": "Emile K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "Classic Chinese dim sum nothing fancy but delicious food & fast service at a reasonable price.  I don't think they have carts though we ordered off the menu which is becoming more standard for dim sum restaurants these days.", "author": "Matthew D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "Haven't been to that many dim sum places in SF but this was one pretty good (and my friends who do go to a lot also agreed) \n\nWe ordered pork buns (steamed and baked - baked was amazing), shrimp dumplings, porridge with century egg, pork rice and egg dish, Peking duck, seafood pancake, sticky rice balls.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "Yum dim sum! \n\nTraditionally a breakfast thing, I was happy Yelp helped us find a spot open for dinner. I was also thrilled to be dining with a couple people that knew exactly what to order, and in the right language! \n\nPRO TIP: Wait for everything to cool off before you start feasting. NO MATTER HOW HUNGRY YOU ARE. There's nothing more painful than a boiling hot soup dumpling bursting in your mouth and running down your throat. You've been warned. \n\nNow that that's out of the way, I enjoyed everything we tried. From the fried dumplings and steamed pork buns, to the shrimp siu mai and turnip cake (first time!). The food came out quick and our table kept eating and eating until we almost had to be rolled out. We got a little ambitious and also ordered some noodle dishes at the end. Those were good too!\n\nI would definitely recommend Dim Sum Club for a super casual and enjoyable dim sum experience! It's best with more than a couple people so you can order lots and share among the table.", "author": "Cassie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "All the dim sum here is good and on the level.  Try the shanghai steamed dumplings and shrimp dumplings.  They are fantastic.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-02", "description": "This is my first one star review. At first, I went to the restaurant because it had good reviews, but it turned out to be the most disgusting experience that I have ever experienced at a restaurant. I almost swallowed plastic pieces that was inside the stuffed mushroom I ordered. One plastic piece that I pulled out of my mouth was bigger than a quarter, and the second piece was the size of a nickel. The food tasted alright and when I told the waitress about the stuffed mushroom, she cancelled the order; however, it is not worth it. I don't recommend the place.", "author": "Helena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "We came here for dinner tonight.  Order Dim Sum dishes and pan fried noodle.  I was pleasantly surprised that they were willing to make pork and bean sprout pan fried noodle dish since it wasn't on the menu.  We then ordered dumpling (very good and homemade), ha gow, siu mai and steam pork bun.  Everything was delicious and they don't use MSG like other places.  Service was great!  Definitely coming back here again.", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-09", "description": "Most reviews on Yelp are for the dim sum served here during the day.  A few reviews positively mention dim sum for dinner, failing to note that at dinner the dim sum menu is greatly abbreviated.  Most of the dishes offered are for larger plates at a heftier tab.  At my dinner this past Sunday evening I was alone in the restaurant for some of my meal and only a single couple showed up throughout the course of my meal.  But service was spot on, caring, and all of the food arrived piping hot.\n\nAn appetizer of shiu mai was just OK.  There were four shiu mai to the order and each was somewhat smaller than those I have had at other places and surmounted by a whole individual shrimp.  Yet the taste of these was pallid, not bad mind you, but not at all bright.\n\nNext up was lemon chicken, a main course priced at 13.95.  Actually, this was quite good as the white meat chicken wasn't overly breaded and there was plenty of chicken on the plate.  And the too abundant lemon sauce wasn't much too sweet.  This would be a good plate to share.\n\nI finished my meal with potstickers.  This plate of dim sum was only OK as the wrapper was too thick and not well filled with pork.  \n\nSo the surprise of my visit was that at dinner the main courses seemed better prepared and a better bargain than the vaunted dim sum so positively commented upon most notably for lunch.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Yes! A spot that serves Dim Sum for dinner! Apparently they are really hard to find. No idea why, it makes for a delicious dinner!! \n\nWe called ahead for a party of 8 at 7:30pm and when we arrived, there wasn't even a wait so win win for sure. This is not a fancy spot but the staff was nice and the food was delicious. Beer and wine only.\n\nLuckily I was with two dim sum experts so I just sat back and ate what was put in front of me! It came out HOT! I mean really hot. I had to wrestle with desire and put some serious patience into waiting to try each piece.  \n\nEverything I tried was delicious. My favorites were the Siu Mai, Steamed BBQ Pork Bun and the Pan Fried Shrimp & Chives Dumpling. \n\nOverall our group left stuff, happy and craving more Dim Sum for days. =) \n\nOne tip for the business: lazy Susan in the middle of the table so you can share the dishes better.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-28", "description": "Mediocre dim sum. Nothing really stands out here, just your typical msg filled unfresh chinese dim sum. Unfriendly service. Long wait. Prices are not cheap either, would not come back.", "author": "Janelle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "After reading reviews good and bad, including a warning for a low food hygiene score, we went anyway. DSC has the usual 2-sided dim sum checklist, with the usual suspects as well as some larger dishes (including congee). \n\nThe overall impression can be summed up thusly: everything that came to the table was piping hot, fresh, and very tasty. Tea refills were instant and prompt. This is not the cheapest place, not the most expensive either. The plates are perhaps a little more generous than I usually see.\n\nWe say check it out.", "author": "Torgeir H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "I am a fan of any restaurant that offers dim sum any time of the day!\n\nTraveling with an Asian parent (hi mom!) means that we need to eat Chinese food Every. Single. Day. This makes my life difficult as I am supposed to pick all of the restaurants. Dim Sum Club saved my butt by being a reasonably close Chinese restaurant with decent ratings AND lived up to the hype with solid food. \n\nFood: My favorites were the crystal shrimp dumplings. The beef with broccoli was not greasy and generously portioned. The seafood with tofu was generously portioned and tasty but IMO needed more seafood and less tofu. The rice was apparently very good according to mom. My siblings loved the Shang Hai-style steamed baozi. The duck was pretty standard. \n\nConclusion: a decently authentic Chinese joint in a non-Chinatown area of SF that won the Chinese Mother Seal of Approval. If you've ever dined with an Asian mother, you should know that they disapprove of almost everything.", "author": "Diya L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-15", "description": "Dim Sum Club has gone down since the first time I was here shortly after they opened in 2014. Seems like they've gotten lazy and don't take pride in their work or food at all. \n\nWhen I approached the door, the signs all said closed even though they were clearly open. Fruit flies were rampant at our table, with one flying by every few seconds. After we finished our meal, two of them promptly landed on our plates and started feasting away. Worst of all, the soup in the Shanghai dumplings was way too hot and actually burned my lip, causing a blister that turned a dark color and peeled off a couple days later. That type of disaster should only happen at a place like McDonald's, but really shouldn't happen anywhere. They were soupy though, I'll give them that. \n\nFried taro balls didn't have enough crispy fried parts and tasted room temperature. This place isn't cheap either. It was $5.75 for the rice rolls for and $7.75 just for porridge (rice and water). That's almost like daylight robbery, but I guess that's most of SF.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "Excellent food. We had a mix of Dim Sum and Chinese fair. We found the Dim Sum (containing veggies, pork, and shrimp) to be very fresh and succulent. To our surprise when the Chinese food came out we were also delighted by the freshness and flavores. Dynamic and savory dishes without being drenched in sauces. Highly recommend the Chilli Chicken and a String Bean dish. \nService leaves much to be disired but nothing really bad happened and the staff is smily and warm.", "author": "Leo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "We came here on a friend's recommendation and we were so glad we did...dim sum is delicious and the service is friendly and quick. \nWe were the second table seated at 11:30 am. By 12:30 pm there were two large tables of nine and six, and five more 2-tops.\nThe dim sum is made to order, served hot and fresh, generous portions, and tasty.\nTwo of us ordered the steamed spareribs with black beans, har gao, deep fried taro dumplings, turnip cakes, curry samosas, bacon shrimp, and beef noodle rolls. Hot tea.  $50 includes tax and tip.\nStreet parking is easy.\nWe'll return for more delicious dim sum.  I am curious about the $10.95 lunch plates with rice.", "author": "Geri S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "I'm a huge fan of Dim Sum Club for the following reasons:\n+ No wait if you come before 11:30am. It's not huge, but it's less popular than other dim sum places. By noon, though, there was a line out the door.\n+ The food comes out immediately.\n+ Friendly service. They actually smiled and refilled our waters.\n+ The food isn't as greasy as other places.\n+ The buns (char siu and pineapple) are so tasty here!\n\nOverall, an excellent choice for dim sum if you don't want to to wait or trek to Chinatown or Inner Richmond. There are only a few tables for larger groups (6+), which I found a bit strange, but that means more seating for groups of 2-4.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-20", "description": "TL;DR - I've never food coma-ed so hard from dim sum... and not in a good way.\n\nOk. Maybe it was an off morning? Or I just ordered the wrong things. But regardless, I left feeling queasy and sad. \n\nWe got the shu mai, shrimp dumplings, steamed bbq pork buns, golden yolk buns, xlb, and the beef roll with the rice noodle. \n\nGREASE. Everything was greasy and overly salty. The char siu in the pork buns was so sad... there was more gelatinous sugar \"sauce\" than actual char siu. The shrimp dumplings didn't have nice big pieces of shrimp... but more of like... a paste. \n\nBut I think the most disappointing was the XLB (xiao long bao, shanghai dumpling, whatever you wanna call it.) The soup was not even flavoured well. Instead of a nice mix of soup and filling, the filling was almost... overcooked? You know, when meat gets too cooked and starts to crumble. Imagine dry, overcooked meat in greasy soup and you've pretty much got an idea of what this xlb was like.\n\nMaybe my standards are too high, but even dollar dim sum over in china town beats this place. If you're going to charge legit dim sim prices, please deliver sit-down dim sum quality food. This place? Overpriced and mostly trying to appeal to tourists. (which is shocking because the dollar dim sum in chinatown is better than this place.)", "author": "Crystal Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "Good, not spectacular. I would recommend for good Chinese but not as much for dim sum. We had the shrimp dumplings which were tasty but we enjoyed the \"entrees\" more. Sesame chicken, soy sauce show mein and vegetable egg rolls. All pretty tasty.", "author": "Manda P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-18", "description": "I really wanted to give this place credit. The food is good, but I just can't not share my experience.\n\nWe arrived around 2:45 which is 15 minutes before the closing time but they were nice enough to seat us. They gave polite service when serving my older relative who had a lot of demands and is very challenging to deal with. The food came quick, too. \n\nI chowed down my House Pan Fried Rice and was halfway done with my meal when I flipped over a piece of chicken and FOUND DEAD FLIES on it. I was too much of a hurry to actually look at my food earlier; what a huge regret.\n\nThere were flies swarming everywhere! Should have known there would be many in the food. A fly landed on my spoon and as I tried to shoo it away, it flew into my soup! The fly committed suicide onto my food! \n\nAt first I assumed there was just dirt on the napkins they gave us but when I looked closely, it was a dead fly. Ugh, the thought that I was eating flies this whole time is revolting! \n\nThe workers were on their lunch but we called them over to tell them what we saw. They cancelled the order that contained the flies but we lost our appetite and didn't finish the rest of our food. \n\nThe waitress told us that they had a fly problem and abruptly brushed off a 'sorry.'", "author": "Murphy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "YUUUUUUM. Visited this place for lunch and appreciated how clean and cool (temperature-wise) it was. The servers were very friendly and patient. We greatly enjoyed their lo mein - tasted like the noodles were homemade. We also got steamed bbq pork buns, dumplings, and rice wrapped in lotus leaves. All of which we enjoyed - everything was delicious. We would definitely come back if we were ever in town.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-19", "description": "Awesome little Chinese joint. You have to take it for what it is, it's cheap but delicious and nothing more. Nice service too compared to other Chinese restaurants!", "author": "VZ D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "Food: Best dim sum I've found so far, including places in Chinatown like Dol Ho and Lai Hong.\n\nService: Prompt and to the point. Sometimes you get items in an unexpected order, but I guess they bring everything as soon as it's ready.\n\nAtmosphere: Had to dock a star for a serious fruit fly infestation. Got to the point where both of us were swatting as we ate to avoid adding extra protein to our diets.\n\nPrice: Fair.\n\nHighlights: Baked pork bun, sponge cake, and pan-fried turnip cake.", "author": "Ananya M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "Came here during lunch with group of co-workers while we were doing LEAN Six Sigma training next door at the hotel.\nWe ordered a mountain load of food and everything was actually really good.", "author": "Linda W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-24", "description": "Update: YIKES!  Found an insect/small roach in our soup AND the duck meat was clearly rotten, too soft, and inedible on the first bite.  Sent both dishes back.  We made the mistake of eating the other couple of dishes before leaving, and felt pretty queasy afterwards.  Had been to this restaurant many times and had enjoyed the food in the past, YET always wondered why the health score was so low (below 70, which is the cutoff).  For a while, there used to be a \"health warning\" on Yelp.  Now, we finally and clearly know why.  They must have pretty poor practices and hygiene habits for keeping food safe and clear of pests.  To their credit, they have very friendly service, and they waitress was very apologetic, so they deserve a star just for that.  But until they address the health and safety issues: BEWARE!!!", "author": "candide o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "By far my favorite dim sum restaurant in San Francisco for several reasons:\n\n1) The food is bomb. And I'm talking about every single dish, from the Shanghai dumplings to the sticky rice wrapped in lotus leaves.\n\n2) There is never a line. The location is so unusual for a Chinese restaurant (on S Van Ness Ave in Russian Hill) that most people probably don't give it a second glance... which only works to our benefit ;-)\n\n3) Prices are higher than what you'd be paying in Chinatown, but again well worth it for the convenience.\n\n4) Service is amazing. One time my boyfriend and I came in at 2:55pm, not realizing they close at 3pm, and the manager came over to us to explain the situation. It was obvious he cared about his employees yet did not want to deny us food, and he said he would make an exception for us, with a smile on his face all the while. I see him every time I come back and always feel well taken care of.\n\nPrior to discovering Dim Sum Club, scheduling a time to eat dim sum was always such an ordeal... we'd have to mentally prepare ourselves for long lines and wait times. Now it's just a matter of walking in and out with our bellies full!", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Just ate there one week ago and the place is clean and the food is delicious good. The price is higher due to available in the area but worth it. Be careful not to over order but again you can have a late snack! Noodle dishes are very tasty and cook  just right.", "author": "LL Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-01", "description": "Want dim sum, but don't want to drive to Sunset/Richmond? AND you don't want to wait around forever because you're impatient and/or too hungry?  Solution: Dim Sum Club!  \n\nName and location may make you question the authenticity and quality of the food, but don't doubt!  All the staple dim sum dishes are available and while they don't do the dim sum carts, service is fast and the food comes out fresh!", "author": "Janel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Dim sum club has a small menu, but is still pretty good. Perhaps the best part about it was that it was busy on the Sunday around noon, but we still didn't have to wait. I really hate having to wait 90+ minutes for a table at some of the better dimsum places on weekends.\n\nEverything that we ordered was pretty good. in particular, the ha gow and xiao long bow were standouts. Unfortunately, there weren't any Chinese ladies pushing carts around, since you order by checking off items on the menu, but at least everything was delivered to our table within 10 minutes, and everything was piping hot and fresh.\n\nDefinitely will come back again when I want a sitdown dimsum experience, and I don't wait to wait an hour.", "author": "Allen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-06", "description": "In my limited Dim Sum eating experience, DSC is pretty solid. My boyfriend and I stumbled on this place yesterday and I had heard good things so we decided to give it a shot. There was (surprisingly?) no wait on a Sunday at noon and we were seated promptly.\n\nNow, this isn't a cart Dim Sum place. They give you a paper menu and you mark down what you want and how many orders. The waitresses come around and make a note of what you ordered. I think we waited about 10 minutes from when the waitress came around until our first dish arrived. Between the two of us, we had:\n\n-Steamed BBQ Pork Buns: We agree that THESE ARE THE BEST WE HAVE EVER HAD. Keep in mind, neither of us are very experienced in our Dim Sum cuisine so its possible that these are actually average and we just have eaten worse. Either way-we really enjoyed them!\n\n-Steamed Spare Ribs: These were ok. We ordered these to try something new and while they tasted good, they were difficult to eat. I probably just am not a fan of this dish in general rather than DSC's execution\n\n-Steamed Homemade Dumpling: Really good and had a bit of a kick! I am not sure what these are filled with, but I am pretty sure there is shrimp and pork from what I could see. These were really big and generous.\n\n-Sticky Rice in Lotus Leaf: Standard but enjoyable. \n\nFor these 4 dishes, with tax, it was $18.50 which is reasonable. The one thing we didn't like is that they charge for tea which I have only seen at Yank Sing. This is a very minor complaint as the charge was only $1/person but it did sway us not to order it.\n\nOverall, I would come back if I were in the area. I have had better Dim Sum in SF but this was a solid option and for no wait and for how organized and clean this place is, I cannot complain.", "author": "Carrie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-29", "description": "This was somewhat disappointing for me.  It could be because we ordered too many deep fried items.  \n\nPros - \nThe seafood jook was very good.  Plenty of whole shrimp.\nThe steamed Ha Gow dumpling was good.  Plenty of shrimp\nThe shrimp stuffed mushroom was good.\n\nCons -\nThe Chinese broccoli was overlooked.   No snap at all.\nThe deep fried taro tasted old and smelly.\nThe other fried items were oily & greasy like the bean curd and minced pork dumpling.\nThe Chinese donut that went with the jook was oily & greasy.  \nThe chicken feet was over steamed.\n\nAnything shrimp related was good.  Anything deep fried was oily & greasy.\n\nI don't think I'll be back.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-27", "description": "My parents live in Nob Hill and our choices for dim sum are either go to Chinatown or drive to Richmond for dim sum. \n\nThis place is walkable for us and has decent dim sum. We never have to wait super long for a table, we are always seated right away even though this place is pretty tiny.\n\nThis place def hits the dim sum spot but only thing is that it's pretty pricey compared to CT and Richmond. My family and I've only been here three times but each time we racked up a bill of over $100, where as elsewhere we eat for less than $100 for 6 people. \n\nDefinitely a place to try out once but there's really nothing special that you can't get elsewhere for cheaper.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "I know its not your typical dim sum dish but, bacon wrapped shrimp was really tasty.\nDishes exceeded my expectations.", "author": "Dorothy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "Great spot for dim sum without the hassle and crowds of Chinatown.  The food is not as heavily salted as other spots but the taste and textures are much cleaner (no guessing whether or not your dumplings contain actual meat).  They also have an open kitchen so you can watch some of the action and you will notice that most of the things you order don't get cooked until your order goes in, so dumplings come out hot and juicy!\n\nPrices are higher than what you'd get at cheaper places ~$5 per order for most items but the quality is there, the service is excellent, and the street parking is free!", "author": "Eric N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Amazing service, and really quick food! Recommend the Thai noodles and the dim sum is only available for lunch btw. (Apparently that's well known)", "author": "Saideh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Amazing food with very attentive service. The inside was also a lot cleaner than some of the other dim sum restaurants in the city. I'll definitely be back.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-04", "description": "There's a reason this place has no line out the door and isn't stuffed with large Asian families and Chinese grandpas on a Sunday morning. This is the kind of dim sum place you go to if you're new to dim sum, want English menus, and have never experienced Chinese food in the Richmond.\n\nFood:\n1) Chinese Donut Wrapped in Rice Roll\nThe donut was (surprisingly) not over-fried, but the texture of the rice roll was not right at all. It was dense, bland, and didn't have the bounce and chewiness of good rice rolls. Also, this dish did not come with the traditional peanut sauce and sweet sauce that is served at every other dim sum place.\n\n2) Vegetarian Dumplings\nBland. Tasted like eating water. Don't get them.\n\n3) Shanghai Soup Dumplings\nMy friend is a XiaoLongBao aficionado, and he rated these dumplings a thumbs down, 2/5. The soup was too tart and the skin was too thick and sticky. If you want good XLB, go to Shanghai Dumpling King instead :)\n\n4) Salted Egg Yolk Custard Buns\nThe only good dish we ordered! Just the right amount of saltiness, and the custard was oozing out like a proper salted egg yolk bun (unlike an egg custard bun). I was pleasantly surprised!\n\nService was good, but since only 1 out of 4 dishes was tasty, this place gets 2 stars from me.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "Pretty standard in terms of food and price. Parking is available and the tables turn pretty quickly so usually no wait.", "author": "Eddie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-02", "description": "We come here specifically for the baked pork buns and I'm sad that it's not the same anymore. The buns look completely different, smaller in size, and are just like any other pork buns from other places. The other dim sum items are just whatever to me and aren't much of a difference compared to other places. I don't think I'll be coming here next time.", "author": "Maggie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "The food here was amazing, hot fast and full of flavor. AND for $32 me and my hubby got filled up! I was a little cautious because of a less than desirable experience at the highly over priced and publicized Yank Sing place we had been to just a few days ago. \nService was a little shaky at first, then our waitress disappeared and a more \"seasoned\" lady appeared and rocked the service.  I would highly recommend this place for good Dim Sum especially the Deep Fried Taro Dumpling!\nThe only thing missing are the steam carts, you order by form but that's fine because the food was so good.", "author": "Stephen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "Fewer places to go now in Chinatown, this place serve traditional dim sum Hong Kong style.", "author": "Catalina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "Best chicken wings I have ever had. The poultry is filleted from the bone and the result is the most crispy delightful taste you will ever experience. The spare ribs, Shanghai dumplings, steamed pork bun and pork and shrimp sui mai are a must!!\n\nThe service is friendly and attentive, they keep open late past closing to accommodate their customers. This is the best restaurant and service I have found in San Francisco a must must try!!", "author": "Gabriel O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "Definitely not your cheap Chinatown dimsum place, but I'm certainly a fan! Came right when it opened on a Sunday, so there was no line. Service was really quick. Food was really fresh, and I love how the shui mai and shrimp dumplings are very plump and juicy. Their portions are smaller than other dim sum I've had, but the quality is really good! Averaged about $30 per person.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Great food!  We loved every single dish we ordered (dumplings, potstickers, satay beef, soy sauce chow mein).  Even my 6 year old who refuses to try Chinese food, tried the noodles and loved them.  Definitely recommend this for a delicious meal.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "I really like this place for dim sum. The ambience leaves something to be desired, but the food is spot on!", "author": "Taylor J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-03", "description": "LOVE LOVE LOVE! \n\nI stumbled in after passing by and noticing that the restaurant had changed (tied to a hotel). I snuck in and ordered off the menu. The owner was there and he was super nice and friendly. Told me he owned other restaurants in SF. Since there is no local dim sum spot, I was praying the food would be a hit. \n\nBoy, it was! Everything is made to order (my order took a bit long- suggest you call in). It came out piping hot, fresh and so yummy. I highly recommend! I hope they stay because I will miss getting my dim sum fix.", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "If you want great Asian food this is it. Perfect for sharing.\nMust haves:\nHot and sour soup\nSalt and pepper wings \nBeef chow fun\nPeking duck\n\nThe off the menu item of orange chicken tastes like funnel cakes so hard pass on that.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Food was great, service was excellent . We stayed at the hotel above it, so it was ver convenient", "author": "Fernando A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "Great location, since we were staying in the hotel. Food was tasty. The Kendall Jackson was priced reasonably. The only negative was that the wait staff barely spoke English. I would eat at this restaurant again if I visit that area.", "author": "Mark R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "Why 5 stars? Because I sat back and was fed dim sum like royalty.\n\n   ---   ---   ---\n\nI never get tired of dim sum, but it's especially wonderful when you have people at the table that handle all of the ordering for the group. My contribution was, \"make sure you get the one with the shrimp in the thing!\" Outside of that, I sat, and I ate.\n\nEvery single bite was an easy 5-stars. Because I pretty much never even saw a menu, and I'm far from a connoisseur, I honestly have no idea what any of these lovely items were called. So just know this, reader of this review: order a lot of things. They are all wonderful.\n\nOne interesting fact that I learned about dim sum is that it's traditionally a breakfast item, and many dim sum restaurants in SF close before dinner. I definitely was not aware of that, and I think there's an untapped market here! Dim Sum makes for a phenomenal dinner, so stay open later SF dim sum restaurants!", "author": "Brett N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "\"Ouch!!!!\"\n\"Just burned my mouuuuffffff!\"\n\"Ah! That's hot...that's hot!\"\n\"Uhf dawt iz zoe hawtt!\" - mouth full of burning hot dumplings!\n\nThese lines and variations of them were spit out all night long from my tablemates (and myself) but they were always followed up with - \"BUT IT'S SO GOOD!!!!\"\n\nI arrived with a group of 8. This place is no frills - but real deal. \n\nIt took us a while to find a place that offered up dim sum for dinner - and after a fairly long search we came across the Dim Sum Club. Apparently dim sum is traditionally served for breakfast....but let's face it...any breakfast is delicious for dinner. Especially so, when it comes to dim sum. We shared a ton (and I mean a TON) of items...but here's what I remember:\n\nDeep fried pork dumplings\nSui Mai\nHar Gow (might of been my favorite!)\nXiao Long Bao\nPork buns\n\nAnd I'd say a few others - really nothing we got was bad. We left super stuffed...rolling out of this place. GET IT ALL! Share with the table!\n\nDim sum all day! DIM SUM ALL DAY!\nI wish I had gone back for one more fix....I was super jealous when I saw co-workers grabbing some to go the next morning for breakfast/for their flight.", "author": "Blue A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "First ever Dim Sum experience and it did NOT disappoint! My group decided on Dim Sum because I hadn't ever had it. It was great to go with people that knew what they were doing! We allowed the two most tenured Dim Sumers to order for the table.\n\nAlthough I didn't really know all of the names of the different dishes I can tell you that they were ALL AWESOME! Each came out with 4 or 5 pieces. What I loved the most about this was as soon as the Dim Sum was cooked, it came right to the table.  Super fresh!\n\nDim Sum Club did not disappoint this first timer! Definitely stop by if in San Fran!", "author": "Kellie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-28", "description": "This place must have gotten worse since earlier reviews.\n\n1) Yelp now warns you this place is in the bottom 5% of all SF health ratings\n\n2) There is no longer a $10 sampler\n\n3) prices are now about $6.50-$6.95 per item, so pretty expensive for dim sum\n\n4) we ordered 9 things. 1 was tasty, 2 were okay, and the other 6 were pretty bad. The Shanghai dumplings has no soup on them and seemed pretty shriveled/ dehydrated. The pot stickers were pretty tasteless\n\nNot the worst, but definitely doesn't deserve 4 stars on Yelp", "author": "Lilly D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "I was a customer at their sister restaurant on Irving and 22nd Ave.  I saw the business card and recognized that they were in my neighborhood so I opted to give them a try, especially since there are limited options for dim sum in my neck of the woods. Glad I did.\n\nin all the years that I have frequented dim sum restaurants, this is the only one that ALWAYS steams the Chinese broccoli to perfection.   same goes for the sticky rice, dumplings and taro. \n\nI have been going to the Dim Sum Club for about 2 years. no reason to ha to Chinatown, Richmond or Sunset for dim sum. this place rocks.", "author": "Allan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Brunch review. \n\nDim sum - 3/5\nStandouts - 4/5 - beef puffs, sticky rice\nDesserts - 4/5 - Mango pudding is huge and awesome. Custard tarts are good as well.\n\nOverall, quality dim sum, also open for dinner. \"I'm a fan.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "Solid dim sum in a city with a lot of it. Service is quick and food is always hot. Highlights are Shanghai dumplings; good examples are hard to find! Shui mai, har gao and steamed noodle roll are all excellent. I'd avoid chow mein and Chinese food, however. They don't compare with dumpy quality.", "author": "Andrew J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-28", "description": "Worse dim sum I ever had in my life... Similar quality and worse than Chinatown. I have to say prices are not equivalent to the quality. Too much oil on the steam items...not impressed at all.", "author": "M W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-08", "description": "You're better off heading a bit further to eat in the Richmond. Or, if you're on the opposite side of the city, check out Shanghai Dumpling King. While the food is solid, this place is very overpriced, relative to equally good Chinese joints.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "Really great Chinese food. Was very pleased with everything we had, particularly the Shanghai Dumplings and the green beans with chicken. Soups are meant for sharing - they are huge. Portions are also very generous, also great for sharing.", "author": "Nikki K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Love this place!  The food is tasty and the price is reasonable.", "author": "Mason W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "A really great Dim Sum place with everything freshly prepared. It's not in Chinatown, but that may be a good thing as the food appears to cater to locals more than tourists. The salt and pepper squid was perfect, with the steamed pork buns being the one thing where I thought the filling was a little lacking.  No fruit flies, as I see in a few reports. The closest good Chinese to the Fisherman's Wharf area!", "author": "Brian R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "Delicious, non-chinese speaker friendly Dim Sum establishment.\nDon't get me wrong, the place in Chinatown are amazing and authentic, but sometimes I'm not in the mood to practice my Chinese.\n\nEnter... Dim Sum Club. \n\nAttached to a hotel, the Dim Sum Club offers delicious dishes at a slightly elevated price, compared to their Chinatown counterparts.\n\nHowever, everything is delicious, juicy, and satisfying.\n\nGet:\n- sticky rice in lotus leaf\n- shu mai\n- turnip (daikon) cake\n- congee\n\nSkip:\n- shrimp roll (the rice paper was too thick and chewy)\n- shrimp dumplings (too expensive at $6)\n\n5 stars for food... minus 1 star for the price. Also tea shouldn't be a dollar a person!!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "The food is great.  The staff is friendly.   Great dim sum.  Oh, I think I'll have to run over there soon!", "author": "Karen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-07", "description": "The Dim Sum Club has pretty solid Chinese food... Not extraordinary but definitely not bad. \n\nThey do have a pretty extensive menu. \n\nWe tried broccoli beef (nothing special but not bad), general tso chicken (slightly better than average), and mixed veggies (didn't care for the sauce they came in). \n\nService was quick, and it's a very convenient option if you're staying at the Da Vinci Villa hotel that they restaurant is connected to.", "author": "Angela Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-05", "description": "Idk. Maybe I'm just not a dim sum person? I don't have much experience in this area of food honestly, but it looked good and it tasted decent. \nWe just got a bunch of appetizers. Shrimp dumplings, pork and shrimp sui mai, steamed pork buns, and shanghai dumplings. Our favorite was the shanghai dumplings and the sui mai. They had the most flavor. The shrimp dumplings were a bit dull and the steamed pork buns, well... no. It was my first time trying them and they were not what I expected them to be like. But at least I tried them! They tasted kind of like a cinnamon roll which threw us off. It all looked good so I think if you like dim sum more then you would like this place. However, I've seen A LOT more inexpensive places in the city. \nThe service was good, although we never got the tea we asked for. That's fine though because we weren't charged and honestly we forgot about it by the end.", "author": "Samantha O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-11", "description": "Good luck not eating a fruit fly during your meal. We were attacked by flies the whole time, and it got so bad my girlfriend had to go outside because they wouldn't leave her or her food alone. The man sitting at the table next to us confronted a waitress about it and said the flies were like this 3 weeks ago too and that he wouldn't be returning. I have the say the same for us, this wasn't a place I would ever dine again or take anyone.\nThe food alone wasn't great, and I would have given 3 stars without flies. The xiao long bao had hard tops and leathery skin with smoothie like insides. The BBQ pork buns have lots of sauce on the inside. The porridge was not salted at all, but my girlfriend preferred that actually. \nI'd say you could try getting stuff to go, but with all the flies, I'm not sure of the cleanliness of their kitchen.", "author": "Adamme K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "We had the pork dim sum, hot and sour soup and broccoli and chicken.   All were fresh and great flavors.  Great choice while traveling because of the fresh veggies and great flavors.", "author": "Scott C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "This place is GREAT! My husband is chinese and we have been eating dim sum for several years now. We use to venture out to Clement St but now we come here! The food is very fresh!", "author": "Karen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Best dim sum for this area!  Freshly made! Large portions for lunch specials. Hardly ever crowded. Attentive staff. Great price.  FINALLY good dim sum in the Marina!", "author": "Vivian E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "got a late lunch at the dim sum club whilst staying in San fran.  The food was excellent. We got loads of different dim sum dishes. Highly recommend the sui Mai really big and juicy.  service was a little abrupt but acceptable.  Food came out really fast as soon as it was prepared meaning it was all really piping hot and fresh.", "author": "Tobias S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-14", "description": "Very slow service. Food was good but plates came out in odd individual, ten minute intervals for our table of four. One order was wrong & they treated us as a nuisance for asking that it be corrected", "author": "Jon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Love love love this place. I've come here two separate time with different sized crowds and they've been able to seat us promptly all around lunch hour. You order via a menu sheet and they'll bring the items to you which seems to contribute to their speedy service! \n\nI personally love steamed dim sum items vs fried items so I usually order the pork/shrimp shumai, shrimp dumplings, bbq pork buns, rice noodles, wonton soup, etc. All of which are fresh and tasty without being too salty. Also, the price is pretty fair, particularly compared to some options in the FiDi.\n\nAll in all, this is a really solid dim sum place and I am definitely returning!", "author": "Alex P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "This place is great for a quick lunch. They have standard cantonese dishes such as Chow Fun, dim sum and other chinese dishes. The service isnt that good, but it works. The staff aren't that fluent in english so I wouldn't ask for recommendations. A good tip is to use google and other yelp reviews to know what to and not choose. I really liked their Shrimp Ha Kow dumpling. It tasted home-made but I did not have any time to confirm this with the waitress.\n\nAll in all, a great place for lunch that is not costy. I ate lunch here twice during my stay in SF.", "author": "Kai C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "The experience was a 5.  The food was probably a 5.  I think the service is the only reason I am giving this a 4.  Service was about a 3. They would not split our check 4 ways and allow us to pay.  They took too long for water fillups as well.  But despite that and if you are not splitting checks and if you do not drink like a camel you should really go here.  The food was fantastic.  We all got apps and split them up.  Everyone's favorite was my salt and pepper calamari.  This is a must.  I then got the $10 Dim Sum deal.  What a crazy amount of food for $10 and I did not like one of my 5 items but had already had plenty.  I was not a fan of the steamed pork bun.  But the shrimp dumpling and the shrimp and pork siu mai were perfect.  You can not get this kind of stuff from where I am from so I tried it several times over the weekend.  This was also the only place I had the Peking Duck while there and was impressed with their tableside preparation.  The steamed buns and scallions and sauce were fantastic together and the duck by itself was also extraordinary.  The eggroll was good as well.  If they were a little better with groups of 5 wanting to split a check I may consider a 5.  But definitely worth the trip!", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "Finally a club where I can be my true self at.....\n\nI'm the type of girl who craves dumplings for breakfast, lunch, and dinner so whenever I go to San Francisco I head out to Good Mong Kok bakery in the wee hours of the morning to get myself a bag o' dim sum to munch on throughout the day. With Dim Sum Club, I no longer have to subject myself to hours old dim sum, warmed up by the radiator of my hotel room.\n\nThere were two parts of my meal. Regular menu and the special pink menu that they only reserve for the real Asians in the know (apparently Xerxes and I don't count).\n\nA few standout dishes (which is hard to remember since our table was literally plates on plates on plates):\n- Har Gow: Easily, one of my favorite dumplings we ordered a basket for each person at the table...plus more. We were hungry using up all of our brain power that day ok!?!? These shrimps must have come from radiated waters because they were cartoon size! Not that I was complaining. The dumpling wrapper was delicate and the perfect carby foil to those big ass skrimps.\n- Shrimp Crepes: Pretty much har gow in crepe form but as I said we used a lot of brain power that day. \n- BBQ Pork Buns - An even meat to bun to ratio and stuffed full of tasty, tasty morsels of red tinged meat. The breading was soft and fresh.\n- Turnip Cakes: On point \n- Singapore Street Noodles: Dumplings are not exactly the most filling thing in the world so this was a good way to coat our tummies with something before we got into the real deal pink menumeal.\n\nWhich...I cannot even talk correctly about since our table leader ordered everything in Cantonese. Let's just call it even and say it was delicious.\n\nMy favorite menu item was an egg omelette with more of those big ass shrimps tossed in. The eggs had the texture of Charmin Ultra Soft + Fluffy White Clouds + Unicorn Magic all mixed together. It was a simple, homey dish that had me googling recipes as soon as I got on the plane.\n\nIf I were a local, I'd be clubbin' here every weekend.", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "Low key, inexpensive, and tasty dim sum in Pac Heights. The servers were very friendly and helpful and we enjoyed everything we ordered. The highlights were the fantastic hot and sour wonton soup (large portion so share with a big group!), turnip cakes, the fried pork and chives dumplings and the pork buns, which were huge. Off the regular menu we tried the fried rice and chicken Kung pao. Both were fine but I highly recommend coming here just for the awesome dim sum.", "author": "Sol C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-31", "description": "This restaurant is on the ground floor of a hotel on Van Ness, and felt pretty different from typical grungy SF dim sum places in the Richmond. It was fairly quiet inside, service was really friendly, and it was clean....even the bathroom was pretty clean. \n\nHow was the food? Well it was gorgeous. Everything was so beautiful I almost didnt want to eat it ( got over that quickly enough.)  Ingredients were pretty good quality \n( e.g. whole shrimp in the har gow) and there were some interesting/unusual offerings. It was nice to try something new, and I liked everything except the salt and pepper calamari which was deep fried in some sort of thick sweet batter. Blech. Well, and the bean curd roll was only ok ( not blech, just kinda meh.)\n\nBe warned that tea is not complimentary, but that means it's really good. We had a rich, smoky black tea for a dollar...worth every penny (wow Im cheap...nobody else even cares that the tea isn't free, huh?)\n\nI'll be back.", "author": "El B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-28", "description": "Came here for dim sum brunch. Loved the BBQ pork steamed buns, shanghai dumplings and stuffed eggplants, the rest of the order was so-so (fried pork puffs, pork noodle rolls and chives dumplings). I wasn't really a fan of the diner vibe I got from this place.", "author": "Thewanderingmutt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Service was very friendly and attentive. We made a mistake on the bill and they were kind enough to return the excess money", "author": "Monchito R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-07", "description": "The place is just ok. This is not an authentic dim sum place. I don't know why they call it dim sum club, but it at least it satisfied my hunger.", "author": "Mitos E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "The dim sum here is surprisingly great!\n\nLocated in Russian Hill inside a hotel, it couldn't be in a less appropriate location. When you step inside, it's missing that frenzied, warm, well-lit environment you'd expect. The interior feels more like a diner. It even has bar seating.\n\nPrices are high compared to favorites like Lai Hong Lounge and Hong Kong Lounge; e.g., shrimp dumplings are $6.50, shrimp noodle roll is $6.75. Given the environment and prices, I had low hopes for this place... until our food came!\n\nTheir beef w/ cilantro noodle roll is the best I've had in the city! Really great flavor, not too oily, good quality meat. The baked BBQ pork buns were freshly baked and just crumbled when biting into it - really good. Overall, the dim sum felt well-executed and healthier with quality ingredients.\n\nAlso, there was no line!\n\nOverall, if you just want quality dim sum and are willing to pay for it, you should come here!", "author": "Jeffrey Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "At first, I was a little hesitant walking into the Dim Sum Club. Growing up, I was used to going to dim sum in large ballrooms with the ladies pushing the carts. Dim Sum Club is more of a traditional sit-down restaurant feel. There are plenty of booths and some tables. The service is fast and efficient but there are no ladies pushing carts. You select your items from the menu in English. Having been to Dim Sum many times before, I knew exactly what I wanted and was surprised to see so many items to choose from. \n\nMy table of 5 ordered:\n-BBQ pork buns\n-banana leaf with sticky rice\n-thick noodles with fish (one of my favorites)\n-steamed shrimp dumpling\n-soup pork dumplings\n-shrimp and vegetable dumplings\n-egg tart\n-steamed egg custard bun\n\nI was thoroughly impressed. The quality of the food was very good and the price was very resonable. I think we spent $17 each including tip. I will definitely come back!", "author": "Norah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "Smaller than expected and order from a menu as opposed to from carts, but the food was really fantastic...better than expected. Some friends thought it was cheap, but I thought it was a little more than other places. \n\nThere were 11 of us in our group, and we were treated well. The total came out to about $20 a person. The owner came over a few times to check on us and I think he sent a free dish (or maybe we were charged for it, I didn't inspect the bill).\n\nI'd certainly go back and would highly recommend this place. \n\nServers didn't speak English all that well, which is typical and in my opinion a sign of a great dim sum place, but one friend was allergic to shell fish and later found out one of the dumplings was made with shrimp, not fish. (She's OK)", "author": "Penguin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "The $99 dinner for 4 is SO much food and a great deal! For $99 you get:\n\n- the biggest bowl ever of delicious shrimp tofu soup\n- fried rice or noodles\n- Peking duck with buns\n- your choice of any 4 additional entrees!\n\nFor our additional entrees, we had a dim sum platter, prawns and broccoli, a spicy tofu dish, and a fish fillet dish (also with a bit of spice). Everything was delicious!\n\nOur waitress was very attentive and made sure our water glasses were always full. A nice older gentleman who I would guess is the owner also came by to check on us a few times and gave us each a delicious mango and coconut milk dessert to go with our fortune cookies (which had strange fortunes!).\n\nThe meal could have easily fed at least 6 people and we took tons of leftovers home. I'd love to go back sometime when I feel like feasting!\n\nNote: the space is not fancy and there were not a lot of other guests. I think Dim Sum Club is just a well-kept secret for now!", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "I was very satisfied by our choice of dim sums...the Shanghai dumplings actually had soup broth in it and was placed in aluminum plates that helped not to break. It was really good and so were the sui mai dumplings.", "author": "Divya R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "While the food is still fresh and piping hot, they certainly have increased their prices. Previously many of the offerings that were $3-4 are now $6-6.50. We ordered about the same as last time again but our total came to $60ish for 2 (previously was roughly $40ish for 2). \n\nStill, if the quality stays this consistent I'll continue to frequent! Service is also good for a Chinese restaurant. Space is open and has a pretty decent layout but does have that cafeteria vibe, so this won't make the most romantic ambiance for dinner, but it's perfect for a lunch spot. Great for couples, friends, families and larger groups.", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-15", "description": "The shrimp in the fried rice was rotten and the chefs had no idea what to tell us and there are bugs crawling around the place. If you want to eat rotten, undercooked fish whilst staring at cockroaches and getting food poisoning, this is the perfect place to go!", "author": "Ariana T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-03", "description": "There is dim sum near Cow Hollow, in Russian Hill.\n\nYes, you read that correctly.\n\nIf you want your Chinese food or dim sum fix and are too lazy to venture out, this is acceptable.\n\nIf you want to get the most authentic food (with the most authentic prices), head elsewhere (Chinatown, the Richmond, Sunset).\n\nThe food tasted like what it's supposed to - really no complaints, but nothing spectacular either.  The restaurant is nice and clean, and service is nice and polite (which is probably a good indicator that it's not as authentic as it can be, hah!).  Menu items for dinner included things geared towards the Americanized tastebuds: General Tso's chicken, walnut prawns (personally this is my favorite of the whitewashed menu), broccoli beef, etc. but you can find stuff like ma po tofu or XLB here.\n\nThere didn't seem to be any porridge on the dinner menu, but apparently it's online for their lunch menu, and it's a really nice, piping hot meal for cold SF days.  I'll have to go back and try during lunch/dim sum times to get a full picture of their dim sum items, since we only tried the appetizer platter (2 har gow, 2 siu mai, an egg roll - bleh, 1 pork bun, and 2 sesame mochi balls with red bean).\n\nDecent.  Not the best obviously, but for a lazy night in the area, it's just fine.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-19", "description": "\"The chair is dirty!\"  Well you don't have to eat the chair so ... I liked DSC.  Off the beaten Chinatown path and everything seemed to be cooked to order.  I like that.  The \"Crispy Roast Duck\" got good comments from everyone at our table and the leftovers tasted good later in the day.  The decor leaves a bit to be desired but it's a cool walk in place, they know what they are doing and if you want, you can watch them make your food if you grab a counter seat.  Skip the char siu bows (pork buns), those were pretty weak for the price point.  Made me miss Cafe Bakery on Noriega Street.  But minor disappointment.  \n\nThe calamari had a nice light batter and was fried with skill.  They are making an effort here.\n\nFor what it is, it is good.  Nothing fancy but it's not priced fancy so I will be returning since it's also walking distance from my flat on Russian Hill.", "author": "Terry A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "Super convenient and no line, a nice alternative to the better known dim sum options in the Richmond. Fast service and food is served hot, definitely would come back. Dim sum food quality is not stand out, but definitely good enough for me on a Sunday when I am not looking to wait an hour in line.", "author": "Shirley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-29", "description": "I work in the heart of Chinatown so I have access to great Chinese food and dim sum at great prices every day.  Dim Sum Club has a little higher prices but the quality of the food is very good.  It feels like a $$$ food with $$1/2 atmosphere and $$1/2 price.  Today we were there very early so got $$$$ service.", "author": "Jayn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "So happy to have found this gem in Russian Hill. Seems a little strange to have a great dimsum restaurant in this neighborhood but we like this place a lot more than many of the dimsum restos in Chinatown.\n\nIt's always busy and buzzy, but we never have to wait too long when we come at lunch time on Saturdays or Sundays. Great selection of dimsum favorites (shrimp dumplings, shu mai, baked/steamed pork buns, Shanghai soup dumplings), as well as regular Chinese restaurant fare (fried rice, stir fried veggie, Peking duck, etc).", "author": "Anna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "I've passed this place almost everyday for the past couple years, and finally gave it a try today. The inside decor is simple, and nothing to cheer about, however the dim sum is spot on. They serve almost all of the same things during dinner that you would find at a lunch, which is atypical for dim sum. The food was all piping hot, and served very fresh. You could tell it was all pan fried, steamed, or wok'd up right before coming to the table. Don't be scared that it's in the bottom of a hotel, give it a try the next time you're in the marina.", "author": "Josh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "Best bang for the dim sum buck.  Pleasantly surprised by service & spacious ambience.  Ideally, come after 1pm for a non-line on Sunday.\n\nCons: Street parking may be hard to find; allot time for this.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "What a great place to spend Mother's Day.  I'm glad we arrived early because as soon as we were seated, this place packed up!  \nService is your typical Dim Sum but the Manager occasionally checked in on us.  The food was delicious.  Way better than most Dim Sums we've been to.  Large selection as well as non Dim Sum food.  It's served straight from the kitchen, not from carts being pushed around, which means your food is fresh.", "author": "Arlene M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "We really enjoyed the dim sum and wish we lived nearby.....\nOur waitress was very friendly and courteous. The food tasted excellent \nWe had shrimp and sticky rice and it was gone !", "author": "Andy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "Love this place! Clean and fresh! I highly recommend the Dim Sum and Won Ton Soup.\nFriendly service and food is fabulous. I work a block away and happy to have them close by.", "author": "Dawn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "I am a bit skeptical when it comes to high prices for food. I want to save money on food. But at the time we were looking for something with not a big line and of course we were on our last day of our trip and it was a weekend. So, of course most dim sum places are going to be busy on the weekend. Thankfully, we got parking and this place was not too busy. The dim sum dishes were filling and appetizing. The signature dish that pulled it off was the chow mein (HK Style) which means it's crispy noodles that compliments the ingredients. You can guess why the prices are high, because it's connected to a small hotel. That's the main reason why. The staff is quite welcoming. Although some of the dishes had been sold out because of the time we were there,, we did get a complimentary dessert which was mango pudding. I, wouldn't mind coming here to eat dim sum again. The quality was A+. Sometimes, you have to aim for quality than quantity. I left Dim Sum Club not full, but satisfied. That is when you know the meal is great. As to restrooms, they are in the hotel which you have access if you eat at the restaurant. The kitchen is visible to the naked eye and the staff is quite accomodating. I would definitely recommend coming back here again! Favorite dim sum dishes were the sui mai, fried radish pancake, and HK style chow mein.", "author": "Arthur W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Food is great and fresh out of the steamer/ kitchen\nGreat selection of food at a reasonable price \n\n1 star off for the awkward setup - restaurant is also used as hotel breakfast so it has the buffet table and booth unlike traditional dimsum restaurant", "author": "B N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-12", "description": "After hearing my friends rave about it, I decide to try dim sum for the first time. Overall the experience was okay. I ordered the house pan noodle which was decent but my complaint is that the dim sim platter fell short of expectations. This food was extremely oily as well, do not order the egg rolls!", "author": "Rachel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Had a variety of items here with my family, including several dim sum items, fried rice, and chicken tofu. One of my favorites was the pork and shrimp siu mai, which had good flavor, texture. In general, we were happy with the taste. The variety of dim sum available could have been improved as well as their menu itself; there weren't pictures of the items, and maybe it's just me, but I never remember the names of the dim sum, but know it by look. I sure do miss having more push cart dim sum places!", "author": "Will H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "SO. MANY. DUMPLINGS.\n\nFood: 5/5\nService: 2/5\nAtmosphere: LOLZ.... Think cafeteria\n\nAiiight, so my friend and I hit this place up on a Friday after one of the longest weeks on record, totally ready to grub out and relax. Our verdict: This place totally slayed the food game, but the service game was hella off. \n\nIt's commonly known (Thanks, Yelp) that the service here is kinda just touch-and-go, and it's very true. Does that mean you shouldn't eat here? No. You probably should because the food is amazing. I'd definitely come again. Why? Because when it comes to dim sum, I care about food more than service. Why? Because dumplings.\n\nThings you should absolutely order:\n- Salt and Pepper Calamari (amazingly fresh and delicious)\n- Shanghai soup dumplings (FLAVORful)\n- Walnut Shrimp (so sweet and delicious)\n- Pork buns (superb flavor)\n\nThings to consider: \n- Shrimp dumplings (The same as everywhere else)\n- Pork potstickers (strange sauce, but good)\n\nThings NOT to waste your $ on: \n- Shrimp and Pork Fried Rice (Flavorless meh)\n\n\nSUMMER TOURISTS AND WHALES BE WARNED: If you're thirsty, ask for water sooner rather than later. It's a scarce resource up in here.", "author": "Andrea D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-24", "description": "Dim Sum Club replaces Cafe Como(an ill-fated mexican eatery) with dim sum and cantonese cuisine at lunch. \n\narriving prenoon, i signaled to persons standing at cashiers counter   i wanted a table for 2. she stared at me strangely.  turns out she's waiting for a table also.\n\nno greeter on duty. just 2 frantic associates running around dispensing food checked off on a list.\n\neats:\n-pan-fried potstickers (4/3.75)\nundercooked, insides just warm, sent it back.\n-bbq pork bun (3/3.25)\ndoughy bun texture, fillings tasteless but loaded with msg\n-beef chow fun (8)\nwaiter forgot to order, tasteless when it came out, beef very tender\n-shrimp in noodle crepe(5.25)\ncrunchy shrimp, almost tasty, crepe skin fell apart. \nsmall portion.\n-spareribs(3.25)\nfatty ribs pieces makes this tastier than it is.\nlittle meat taste, portion ok\n-tea 1@person, tea nice,\n\ntake outs:\n-dining area just 8 booths, 7 tables ,seats about 50.\nbooths too cramped, couldn't fit my mansize body in.\n-no hostess, buspersons on duty, 2 associates were energized bunnies, unable to provide adequate services.\n-Dim Sum Club outside signage difficult to see, partially obscured by trees.\nrating: service-1 (sparse), food (2.5) msg, pricey, small portion, tasteless\n-worst food experience in a while with SO, she keep reminding me, so 2 stars\nside note: food comparable with Jack's: misguided.\n-food came out quickly. service memorable as to effort.\nfwiw: with a few minor twerks in the food and service, 4 stars easily attainable.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "Great option for decent dim sum without a crazy line. Soup dumplings threw me off at first because they come in little tins, but tasted great! Everything else I ordered tasted good, too!", "author": "Betty H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "My cousin wanted to have Sunday lunch near her house at this dim sum place. I was skeptical of this place, especially when my cousin told me it was a little dinky place attached to a hotel near her apartment. After the trek up the hill onto Van Ness, I was surprised. It was not as dinky as she described it was, or maybe my definition of dinky is skewed.\n\nWe were promptly greeted by a waiter that recognized my cousin. Apparently when we went they just opened at most a few months ago and it used to be a hotel restaurant. Whatever that means. It was a bit busy, we had to wait a few minutes for a table. We were offered a booth but figured since we wanted to taste... I don't know maybe the entire menu we opted to wait for a bigger table.\n\nAfter a few minutes a table left and we were prompted to sit and peruse the menu. We ended up ordering a lot of food, we had an extended table and that filled up too. I have noticed they don't utilize the space of the restaurant well enough, it seems they could do better but that's just me. They have an open kitchen in the front with another smaller one in the back.\n\nAs we placed the order we started talking about what is going on in our lives and after a while we all thought, hmm it's taking a bit of time. Wrong statement to say because after that our half a roasted duck came, our shrimp dumpling came, then the chicken feet, then the Shanghai dumplings, then the Shu Mai and on and on and on quickly too one right after another, until all our dishes came out and it all smelled and looked amazing. We spent about 80 bucks for 4 people and we were stuffed. \n\nThe color on the roasted duck was really nice and it wasn't too fat. The steamed rice rolls tasted fresh, just made and not sandy at all. They also include a side of vegetables with the steamed rice rolls. The rest of the dim sum tasted so good, I can't go into detail on why it tasted good because frankly I can't remember everything we ordered.\n\nAnother thing that was delicious was the salt and pepper fried chicken wings. The light batter along with the almost perfect frying time for the chicken wings accompanied with the salt and pepper. MMM makes me want to go back for more. I think the only things that we could've skipped was the dumplings (some soup dumplings) and the pan fried green chives dumplings. The soup one you could get better at San Tung in Sunset district and the pan fried green chives dumpling, the skin was too gooey. Now gooey isn't a bad thing, but too gooey gets stuck in your teeth and is a bit of an annoyance to eat.\n\nThe waiters and waitress are all so pleasant. I was told they have dim sum in the evenings also. I must go back. In one hand I wish them all the business they can possibly have, but if that happens, then I can never get a table when I want to.\n\nOh well, I hope this place stays fantastic. Trust that I'll be back.\n\nCheers!", "author": "Harry P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "I was directed here after my friend told me that this place is not nearly as busy as the other famous dim sum places but still really good.  I got there at 11am and there wasn't a wait.  All of the famous dumpling items were delicious.  The soup was also very good but the vegetables were just okay.", "author": "Ted Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-04", "description": "For dim sum outside of the Richmond District, this place was pretty good. There was no line and we were seated quickly. The service was attentive for a Chinese restaurant, and the food came out rather quickly. Overall the food was okay, it wasn't super memorable, but not terrible either. If I didn't want to make the trek to the typical dim sum neighborhoods in SF, this place would pass for satisfying a dim sum craving.", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "Sweet, a good dim sum place in SF that doesn't have monstrous wait times! (assuming you arrive by 1130 or closer to 1pm) We ordered too much food here and walked out with a little bit of leftovers; $16pp for 4, but could be a few bucks less if we ordered in moderation. They had some slightly different variations on dishes than I've seen in other dim sum places, e.g.: salted pork bone porridge, spare rib noodle rolls - thought those were gonna have the paiguat rolled up inside, but it was served on top of the steamed rolled noodles), a lotus paste sesame ball (really yummy). Liked it all, except don't bother with the durian puffs, which are quite pungent, haha. Oh yes, the XLB are my new SF favorite I think!", "author": "Linus W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-01", "description": "I usually drive to Daly City for dimsum but was excited to hear of Dim Sum Club opening up in my neighborhood and decided to give it a try. \n\nPrices here are definitely a little bit higher compared to your average dimsum restaurant, but the quality is actually pretty good. They have a good sized menu with your typical dimsum dishes: spareribs, chicken feet, siu mai, shrimp dumplings, shanghai dumplings, egg tarts, buns, etc... + additional rice and noodle plates. \n\nService was good and the food came out pretty quick. Since this is a rather new establishment, you can tell that the employees are still somewhat adapting. Nonetheless, if I dont feel like making the drive to Daly City in the future, I will definitely be back.", "author": "M W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "Loved the Dim Sum.  I would eat here again next time I'm in SF.  The lightly breaded and then fried spare ribs were tasty, as were the steamed pork buns.", "author": "Johnnie O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-09", "description": "I wanted to like this place coz I like dim sum made to order, it's a lot more fresh that way. But sorry, apart from this aspect this place falls short in everything else. \n\nWe went on a weekend and there were plenty of vacant tables, which isn't a good sign. But that's not the first thing that you notice - the smell hits you right when you walk in. It's soooooo oily and stuffy in there! \n\nThere aren't a lot to choose from, but we managed to order some of the usual items. The food came pretty quickly, which is kind of expected because there weren't too many tables and the staff seemed to be idle most of the time. \n\nI'll just comment on the things NOT to order (in case you REALLY want to try this place still):\n\nRice roll (Cheung fun) with fried dough - the original name is called 'ja leung' in Cantonese. It looked good but when I took a bite, I realized the dough was toooooo deep-fried there's no 'dough' in it, it's just a crispy piece. This is NOT what ja leung should be like, but granted, most if not all Bay Area dim sum places don't get this right. I'm just disappointed because it looked really promising. \n\nSteamed bun with egg yolk - these looked horrible when they landed on our table. They looked as if there was an explosion and the egg yolk bursted. They just looked so wrong! The taste was okay though but I still find them slightly over-steamed because the egg yolk wasn't in liquid form. \n\nWe also ordered har gow, siu mai, sesame balls and some vegetable dumplings. They were all okay but nothing to write home about. \n\nAgain, if this place charges what most other chinese restaurants in the area charge, then it's not terrible, just nothing I would recommend. But the prices are way higher than other places (most dim sum items being at least $1.5-2 higher than other places in the area), so you naturally expect more, given there's also no decor to speak of (not to mention the stuffiness). I would say, avoid this place, there are many much better options in the city.", "author": "Essie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-25", "description": "3.5 prices are up, but still decent hot, greasy, standard offerings.  had shrimp dumpling, nice and plump, with combination panfried crispy noodles (a little less sauce and could have had more crispy noodles) and fish tofu claypot (fish very limp)", "author": "Rob C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-05", "description": "The Dim Sum Club is hard to quantify (as in Yelp stars).  On one hand, the food is pretty good, service acceptable, room is OK and it serves dim sum for dinner.  On the other, it's kind of expensive and the room is actually the hotel's breakfast buffet room.  \n\n3 of us went there the celebrate a friend's birthday for dinner.  Thought it would a little different than your standard Chinese restaurant.  On a Tuesday around 6:30pm, the place was pretty empty and we had our pick of tables or booths.  Service came quickly and brought us tea and water.  We ordered some sui mai and cha sui bau to start.  Both were very good.  Turns out the dim sum is made to order.\n\nLater we ordered their ma po tofu and chicken with double mushrooms and some rice.  Both dishes were also very good, although the ma po tofu was a little spicy for us.\n\nThe bad: prices are high.  Not Yang SIng high, but Dim Sum Club is not that nice.  Paper napkins, hotel buffet room, not really high end.  More like good Chinese restaurant quality at twice the price.\n\nWe figured they were catering more the tourist crowd or the local Union St crowd.  For my money I'd rather go to Chinatown or Richmond.  Unless it's dim sum for dinner, in which case Dim Sum Club is a good option.", "author": "Steve G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "In the (dim sum) club, VIP, no guest list!!! \n\nDon't even need to be on the guest list to get in this club.  In all seriousness though, this is probably my favorite dim sum place in the city.  There's never a really long wait and this place much, much cleaner than anything you'll find in Chinatown.  \n\nI'd recommend the typical dim sum plates like shumai, shrimp dumplings, shrimp noodle roll, etc.  But I think their baked pork buns and wonton soup are some of the best I've had.  Enjoy!", "author": "Candace C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "UPDATE: Just went again (11/2) and the prices have nearly all gone up. Lowest priced dim sum is $4 now :( I would drop the rating down to 3 1/2 stars now. \n------------\n\nFrom our visit in October:\n\nOverall excellent choice outside of Chinatown. Not the best, but very good.\n\nShanghai Soup Dumplings ($5.50) - Good, but should be steamed over a cabbage leaf as a couple of dumplings ripped :(\n\nCurry Samosa ($2.99) - really good, never see this in dim sum\n\nBBQ Pork Rice Noodle Roll ($4.25) - thin rice wrap good meat filling\n\nPork and Perserved Egg Porridge  ($5.50) comes with side of fried donut/condiments. Not watery - very good\n\nBeef and egg (your choice of style) over rice ($6.50) was delicious and could've have been a lunch on it's own!\n\nSalt and Pepper Calamari ($5.50) was good, but be warned, like most other chinese places, they do use MSG. Tip - Salt and Pepper includes MSG.\n\nService was friendly and attentive.\n\nBathroom was clean...now try and find it...door #1, #2, #3?!? You'll see :P\n\nDm Sum Club is located in the Da Vinci Villa hotel and it shares the same space as the Da Vinci Villa Cafe, which opens from 7-10am. That explains the funky cafe/diner style set up of Dim Sum Club. The middle table and side tables setup for the morning continental breakfast stays in the restuarant 24/7, so it looks funny. Not DSC's fault.\n\nGuangdong Barbecue Tea House on Irving is on the opposite side of thier business card, so I assume it's a sister restaurant.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "My husband and I have eaten here twice and we love it.  \nGet the salt and pepper short ribs if you know what's good for you!\nSoup dumplings are fantastic. Siu Mai is fantastic. They have a nice, but small selection of wine.  We haven't checked out the beer or sake but I'm sure it's sufficient.  \nThe older gentleman server seems to be running the joint, though I don't think he's the owner.  Very professional and knowledgable. \nI don't mind that it's not super traditional dim sum.  Everything is piping hot, fresh and made to order. \nOnly thing I can say negative I always get a little heartburn after, but probably my fault from eating so much of their house made hot sauce with everything.\nDim Sum YUM!!!", "author": "Christiana G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-30", "description": "The food was OK but the service was terrible. 3/4 dishes came out within five minutes of each other. No one came to check in on me after that. I waited 20 mins for the last dish and it was obvious they'd forgotten about it. I told the waitress I'd like it taken off my bill. She then runs to the kitchen tells them to make it (it's an open air kitchen) and then comes back to tell me that it's coming. I don't like being cheated and I really don't like liars. Too bad it's the only dim sum place in the area.", "author": "Jackie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "Because my grandparents made a rule that I MUST have dim sum with them at least once a week, good dim sum is really important in my family.\nThis place is still fairly new and part of a hotel, so the decor is somewhat weird still, but that's the only negative thing about it.\n\nService is excellent! The waiters and waitresses all had a friendly smile on their faces. One of them even poured us more tea! SO NICE.\n\nAll of their dimsum is made fresh and HOT. \n\n-Beef w/ Cilantro Noodle Roll ($4.25): Very nice. The rice noodle crepe was thin and smooth. The beef was also very tasty! I did ask them to drench the plate with sweet soy sauce though haha. Excellent dish!\n\n-Shanghai Dumpling ($5.50, 6 pieces): to my surprise, this was really good. I've ordered this at countless dimsum places and the outside was always thick and the inside was never juicy. This was pretty legit! Thin outer layer and the meat was very juicy and aromatic. They even give you spoons on the side so the soup won't spill out (:\n\n-Salt and Pepper Chicken Wing ($4.50, 4 pieces): definitely not what I expected. It was pretty interesting; they made it into a \"lollipop chicken style\" by taking one of the two bones out and pushing all the meat to one end to make it look like a lollipop. It was pretty fun to eat, but they added too much batter to fry this so the crust was too thick. The flavor was great though. Came with a mayo dipping sauce.\n\n-Deep Fried Pork Puff ($3.50): this was \"whatevers\" to me, because of my own personal preference. I like the outside to be thicker and more chewy. This was thin and crunchy. My grandparents loved this because they like crunchy stuff so I guess it's really up to you.\n\n-Curry Samosas ($2.95): wow. This was surprisingly really good. The flavors really hit us and it was a great snack to have. The dipping sauce was pretty good and wasn't watered down. Definitely give this a try!\n\n-Deep Fried Taro Dumpling ($3.25): man oh man I LOVE DF TARO DUMPLINGS. Dimsum Club made it happen! The outside layer was very loose and \"fluffy\". The taro on the inside was smooth and tasty with the meat and sauce. UUUGH SO GOOD.\n\n-Shrimp Dumpling ($4.75): this was okay, nothing special. Just your average shrimp dumpling I guess. \n\n-Pork and Shrimp Siu Mai ($3.75): another okay dish. I do have to say that the fatty pork versus the lean pork ratio was pretty good, so the texture was good.\n\nI would definitely come back to try more stuff! (:", "author": "Jackie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "I went passed this place so many times without knowing it's there while running in the neighbourhood. My co-workers suggested to go for dim sum. We got there around noon on Sunday. We got a table right away though after us there was a line to get the table. There were lot of locals and not many tourists which we thought was a good sign. Food was delicious! We will definitely go back there. The only thing was that we could not communicate well with waiter when we asked questions but that was expected and minor issue. Highly recommend this place.", "author": "Tomoe S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-28", "description": "Everything I had was good and I'm glad this is an option in the neighborhood when I'm in the dim sum mood. The Shanghai dumplings was the best dish of our meal. I thought the pork buns, onion cakes and walnut shrimp were solid but I have had better. The vegetarian dumplings left me wanting more and was bland. Generally for the price it is hard to complain but it's not on the level of yank sing.", "author": "Derek S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "As a Guangzhou Zai（Cantonese），it really suits my taste. Especially 凤爪（Chicken feet), 肠粉（rice noodle rolls），粥（porridge）. If you want to eat local guangzhou food，you must eat here.", "author": "Jun X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Officially my favorite cantonese food in San Francisco! (coming from a Chinese person if that's worth anything) \nDon't be fooled by its generic name and label as a hotel restaurant. The price tag's higher than I'd like to pay for Chinese food, BUT it tastes so good and the food quality is great!\n\nIt's the only Chinese place that I crave almost weekly. Unfortunately it's far from Soma so I'll either drive to pick up (20 mins), or pay a ridiculous premium for a Postmates delivery ($20 to Soma, argh!)\n\nHouse crispy noodles \nRoasted duck (YUM)\nStir fried big pea sprouts (healthy delicious offset to the other flavorful dishes)\nMushrooms with Tofu (not your average tofu, SO GOOD!)", "author": "Nattie X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Delicious! Everything is made to order fresh so the dim sum is always hot off the oven or pan. The other dishes like house pan fried noodles are gratuitous in serving and worth the money! There is never a wait here and service is so fast and efficient. I think this Dim sum restaurant is the best in the city!", "author": "CHristine J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Not as cheap as Chinatown but seriously some of the freshest shu mai I've ever had. I fell in LOVE with their baked bbq pork buns oh my gosh...\n\nService here is very friendly and quick, plus it feels clean. It's located right by the Da Vinci hotel, so at first you might not notice it but it's definitely worth a visit.\n\nAlready excited for my next trip here!", "author": "Denise R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "Best. Dim Sum. Ever. This is a must!!! The atmosphere is friendly and open, and that is just beginning. We came only for Dim Sum, and they serve it all day long. The steamed pork buns were the best I've ever had. The Shanghai dumplings were perfectly done made an came when an incredible soy/vinegar sauce. The Shrimp and Pork Siu Mai were amazing. I have no idea how they get that much shrimp flavor into a dumpling!!!! The best...we had two orders of pork buns, one order of Shanghai dumplings, and one order of the Siu Mai with tea for two...and the grand total was $22. Amazing. A must for anyone wanting dim sum!", "author": "Ellen N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-29", "description": "I would definitely not go here for the ambiance, little ordinary and plain inside. The food was also just ok in my opinion. The dumplings were pretty good, but the fried rice was not my favorite and I was really disappointed in the BBQ pork bun (which is usually my favorite thing!). Service was pretty good and it was very affordable, so those were pluses.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "The dim sum here is delicious! Some of the choices are unbelievably  stellar. Take for instance, the shrimp rice noodle roll otherwise known as ha cheurng fun. There is a rather generous size whole shrimp in each cut piece. The deep fried taro puff is on the smaller side. It's mostly taro but not greasy at all.  the Shanghai dumpling had an ample portion of filling but it didn't have enough broth. \n\nContrary to the posted pictures, the dining room is very nice. there are some booths and some banquettes with hard chairs on the aisle side of the table. Service was friendly and efficient. \n\nThere are no carts.  Mark  your choices on a menu.  Many of the dishes had 4 pieces. Perfect when there are four of you.  I didn't pay but I assume the prices were more reasonable than some of the other more popular dim sum places. \n\nParking is difficult in this neighborhood. Muni was my ride. This is definitely a San Francisco go-to dim sum place  for me.", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "Can only speak to the vege options but the dim sum is fresh and delicious. Not difficult to get a table on a Sunday brunch time and service is excellent. And a good deal!", "author": "Jerry R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-24", "description": "More like a 3.5.\n\nIt'll do when you don't want to wait in lines, but still want a sit-down experience. A little pricier, but still not more than $25/pp even when we ordered more than we could finish in one sitting. \n\nThey have the basics, but if you're looking for tripe or beef haslet, you won't find it here. \n\nDim sum is served to order. I actually prefer that over the carts since everything's piping hot when it gets to the table.\n\nThe beef chow fun is good enough. Reheats well for taking to work the next day, in case you're like me and have to bring lunch to work!", "author": "Tinna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "Tried out a new Dim Sum place while visiting my sister in San Fran. This place is besides a hotel and away from Chinatown. We went the day after thanksgiving. Place opened at 11am. Staff was friendly and served food quickly. The menu does not have pictures like most dim places have but they explain what each item is.We ordered the basics and tried out some new dishes since my sister turned vegan. All the food was out of this world! \nWe ordered pan fried turnip cakes, chinese broccoli with oyster sauce, har gow, shrimp & chives dumplings, shrimp and vegetarian rice noodle, noodles with xo sauce, chicken feet. The new foods were mushroom steam buns, soy sauce fried noodles and these salt and pepper tofu. They were to die for. They were little square fried pieces of tofu and the inside was soft,steamed tofu not chewy or spongy. \nI recommend this place to anyone that likes dim sum or looking to try it.", "author": "Michelle P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-29", "description": "The dim sum here is ok. Do not order anything else.\n\nThe chicken dishes, specifically the Kung pao chicken and chicken and broccoli dishes do not taste like chicken. The \"meat\" in them is chewy and does not taste good. They also have a bad problem with flies. We will not be going back.", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "The food is excellent! !!\nThe service is very good! !!\nThe price is right! !!\nThe place is neat and clean \nNice place for good dinner!", "author": "Juan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "The dim sum platter is def worth all the monies!! And we also had the dried scallop and egg white fried rice, which was delicious as well. :))) oh and their happy hour appetizer, which is free with a purchase of a beer/wine, is pretty small but i guess I can't complain haha happy hour is 5-7pm everyday!", "author": "Christine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "Solid dim sum in the neighborhood, not crowded, no line, reasonably priced for the win! We tried the classic shrimp dumpling, shrimp with peashoot, rice noodles, fried rice, chow mein, bbq buns, chicken feet, egg tarts, all legit good dim sum.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "Dim Sum for dinner? Count me in\n\nCame here with a group of rowdy frat boys on a Thursday night ( it borders the Marina).\n\nIt's a restaurant connected to a hotel. \n\nThe ladies that work there are very nice and accommodating. \n\nWe brought our own alcohol which they had no problem with, but be courteous,clean up, and leave with what you brought in.\n\nFood was surprisingly really good. \n\nHitters:\n1) HK Style Pan Fried Noodles\n2) Steamed BBQ Pork Buns\n3) Calamari\n\nGreat for a big group who are frugal. You will not spend more than $25 a person here unless you order everything on the menu.", "author": "Virginia Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Cheap, fast, delicious. Almost always we find a table and the place is always moderately busy. My favorite are the spare ribs.", "author": "Rubail B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-11", "description": "Super disappointing place. Actually SOUGHT IT OUT as we love dimsum wherever we go - and assuming it's literally in the name, went straight for it on a Cold rainy evening. \n\nThe server was slightly rushed, she and a man who seemed to be the manager were rushing through taking our order. Not many dim sum options, with more Chinesey options like baby broccolini in oyster sauce and Chinese noodles etc. \n\nThe ventilation (does not exist) as they have an open kitchen in the middle of the dining hall, and the windows were al Sears shut. After a hails the heat from the stirfry really got my cheeks burning and I was kinda hot (and the food wasn't!) so it made me even more ready to get the cheque and get on moving! The dimsums were okay, and I'm pretty sure there are better ones out there. All in all.. Womp womp", "author": "Pia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-21", "description": "It is part of a hotel at Van Ness street. We didnt expect there is a dim sum restaurant there. It wasnt as crowded as Hong Kong Lounge or Yank Sing on Sunday afternoon. My boyfriend and I got seated right away. We ordered stuffs we usually order at Dim Sum restaurant such as siumai and shrimp dumpling. \n\nBeside that :\n- oolong tea : it tastes weird\n- siumai : it was good, freshly served and taste good. It was the first dish that came to our table so it raised our expectation on the other dishes.\n- chow mein : it was okay. But they put tons of meat, seafood, veggies in it.\n- chicken feet with black bean sauce : it was too salty for me so i ended up not finishing it.\n- deep fried durian pancakes were pretty good. \n\nService:\nQuick and friendly. \n\nParking :\nA bit hard to find parking spot here on Sunday but i am not sure about the other days.\n\nAmbience : \nEven though it is like a place where you will get a breakfast buffet during your stay at the hotel, it is clean enough for chinese food restaurant. It is not that big, compare to hong kong lounge.", "author": "Ulrica J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "Highly recommend for \"steamed salted egg yolk custard Bun\",\"Shanghai dumpling\". \"steamed spare ribs w/plum sauce\" is nice but a little bit oil, \"chicken feet w/ black bean sauce \" tastes sweet, but I personally prefer the salty one.", "author": "Jie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-14", "description": "My wife ordered Chicken with Double Mushroom,  I ordered Mongolian Beef (spicy), and we shared an order of steamed rice. \n\nThe Mongolian Beef came out first and it was very bland with little to no flavor. Several pieces of beef, white onion, and green onion in a brown sauce, which was soaked up in the crispy noodles they served under everything.  I would not order again and if the server bothered to ask, I would have recommended they look into changing the dish.\n\nThe Chicken with double mushroom dish was very good and was twice the portion of the Mongolian Beef dish, which was good,  because we didn't eat much of the Mongolian Beef. The mushrooms were fresh and cooked just right so they weren't mushy. The chicken was also very good: Not fatty scraps a lot of restaurants use. \n\nThe rice was the normal sticky rice found everywhere: no better,  no worse.\n\nService was mixed: We were seated promptly, water was refilled several times, but there was no follow up after the food was served and the beef dish was served several minutes before the chicken dish.\n\nIt's what you would expect from a restaurant attached to a hotel.", "author": "Pat T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "impressed by the authenticity and quality of this place! came here for lunch (by myself, lol) on a monday during my funemployment week. it's a weird location - lobby of a hotel on van ness - for a chinese restaurant.  the interiors look a little run-down.. i ordered four things (cuz im a certified fatty) - soup dumplings, gai lan with oyster sauce, beef chow fun, and half of a roasted duck.  the first two items were kind of a fail - dumplings tasted a bit sour (withOUT the vinegar) and gai lan pieces were HUGE and literally just served with oyster sauce for dipping. yikes. can make this at home for 3 cents.  however the beef chow fun and duck more than made up for the flop.  massive serving of perfectly stir fried chow fun! nomomnom and their spicy sauce is delicious!  the roasted duck was fatty and flavorful and i had to resist eating the entire dish in a single sitting.  $52 after tax and tip for this meal (with plenty leftover) and $1 for tea (?!). would come back!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Dim Sum on Van Ness!?!?   Real dim sum on Van Ness!   \n\nYEAH!   Good price and amazing selection.  Near my work and has clean tables to boot.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-18", "description": "This place was recommended as a great place for Shanghai steamed dumplings by San Francisco magazine. They are pretty dismal, go to Yank sing instead.\n\nThe dim sum is about average. I like Cityview near Chinatown better. If you're a dim sum newbie, this place would be fine for you\n\nAny restaurant that has dim sum at night is automatically on the suspect list.", "author": "Ellen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "Loved our meal here, where the dim sum was made fresh to order rather than wheeled out on carts which is how we usually experience it.  Delicious dumplings,  barbecue pork buns and pea shoot dumplings, followed by a to-die-for mango pudding.  Awesome!!", "author": "Anita B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Amazing! \nA hole in the wall Dim sum spot that have only 1/3 of the line compared to other popular dim sum spots around town.\nNot to mention that their Shanghai soup dumplings are amazing! The skin of the soup dumpling is not too thick compared to other dumpling spots.\n\nThe decor is a little less glamorous compare to Yang Sing or Hakkasan of course.\nThis is the \"traditional\" canton style dim sum. \n\nMust order: \nShanghai Soup dumplings\nSiu Mai\nShrimp Dumpling\nSticky rice in lotus leaf\nChicken feet \n\nComing from Hong Kong I didn't think that any other place can top the usual spots you find in china town.\n\nNot a single dish is ever served \"warm\" \nThey are \"hot\" and fresh. Simply delicious.\n\nThe quality of the food is amazing for the price you pay.\n\nDon't come here if you're looking for a place for ambiance or fusion dim sum.", "author": "Alui L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-15", "description": "I chopped off 3 the stars after the health score plunged and I have not been back. I always check the health score before I head out. \n\n I went for the dim sum they get it right.\nMade with Quality ingredients, made with care, \nGood textures, nicely seasoned and served piping hot, \nThe dim sum is nicely sized so the stuffing balances with the shell size and thickness.\n\nThe ingredient in the steamed dumplings are tastier and have a better texture in every case than at other several other over priced big name rivals.\n\nIn the evening you can order right off the menue and they make the dim sum fresh and piping hot especially for you \nYour dim sum will not be roving around the restaurant on a trolley looking for takers on getting cold and rubbery\nEven at 6 pm there is a sufficient selection of delicious dim sum on the menus to satisfy your dim sum cravings. \n\nFor price and quality The Dim Sum Club is right in my sweet", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "Awesome place!! Happy hour includes complimentary egg roll and the dim sum was incredible!  Best pork & shrimp Siu Mai I have ever had!", "author": "Brian H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-05", "description": "We read pretty good reviews about this restaurant. But i was disappointed by pretty much everything. Parking was hard to find, waitresses were rude, chinese donut that comes with the porridge tasted terrible, walnut shrimp for $15 was smothered with mayo (panda express has it better), Shanghai dumplings were okay but i had better and even the soy ginger sauce they made for us tasted weird i made my own sauce with their condiments. \n\nIm still looking for a good dumpling spot in sf but this place definitely is NOT the one!", "author": "Yoon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "This place is pretty amazing since they offer dim sum at all hours. Just when you get the hankering for dim sum but it just so happens to be 6 p.m., they're open and serving. This place was my introduction to dim sum and I must say that this place has got me hooked.", "author": "Abraham A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-02", "description": "The food tastes really good.  The place looks really clean.  But it gets really scary when you realize that your food could be recycled from other customers'.\n\nStory:\n\nWe forgot what we marked in our dim sum sheet - it was too many.  So we didn't realize we didn't order turnip cake.\n\nA waitress delivered the turnip cake to us.  We couldn't wait and 3 of us had our chopsticks dug into the cakes, trying to break it up into quarters.\n\nThat's when a chubby / pale skinned (head) waitress with dyed hair came by and told us that's actually not ours and took it away.  Fair enough.\n\nWhat comes next is disturbing... \n\n3 waitresses crowd around the plate of turnip cake at the end of the kitchen and started discussing what to do with it.  What the (head, pale skinned, jade bracelet) waitress (that doesn't smile) ended up doing was slicing it even more with a scissors to make it look intentionally chopped.  Then she delivered the cakes to the table right next to us!\n\nSo the table next to us ended up eating turnip cakes that we fondled.  Sorry boss!\n\n---\n\nAlso updates with the quality:\n\n- Roast duck dish got smaller, no sauce.  Still crispy though.\n- Fried donut rice crepe got smaller as well.\n\nBut in general things still taste good.  Just suspicious where things come from!", "author": "Koalie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "There aren't too many soup dumplings or restaurants that rival Din Tai Fung, and this one does. The soup dumplings are incredible, as well as the rest of the menu. This restaurant is by far a hidden gem. I would come back here in a heart beat!", "author": "Alexis A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "No matter that a warning comes up about the health rating. And what others have said, my wife and I found no overt sign of this. The place is still busy, the food was good and served hot, tho' the onion pancakes were over fried. Service was mediocre and it took a while for them to collect the bill. Still a go to place for a quick dimsum fix.", "author": "Ifti K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "If you're looking for a quick dim sum fix,  this is a good spot to go to. Good service and decent food.", "author": "Arking G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "{ OVERALL :: 4 stars }\n^ would i come back : YES, and frequently do\n^ would i recommend this place : YES, depends :) \n^ dim sum better than HKFL : NO\n^ if no, why go : typically no wait, closer to me, parking is relatively easier and the most important part, food is still pretty good\n^ similarly to HKFL, you order by marking the items on a menu. ensures your item is hot and items don't 'run out' by the time they get to your table :)\n\n{ FOOD :: 4 stars }\nWHAT TO GET:\n^ duck, i get the peking style w/the buns and boneless\n^ pan fried shrimp + leek dumplings\n^ har gow\n^ baked bbq pork bun\n^ steamed custard bun\nCLOSE, BUT COULD BE BETTER:\n^ shrimp noodle roll - they make these fresh, you can watch if you sit at the counter pretty cool to see!\n^ XLB - needs more broth inside and more dipping sauce\n^ sui mai - may even be a *skip* item\n\n{ SERVICE :: 3.5 stars }\n^ waitress, so far most of our waitresses have been pretty good. they don't necessarily come around and ask if you're ok or need anything, however they do proactively fill up your water, and you're not necessarily wanting anything... making eye contact usually gets their attention\n^ host, 9 times out of 10 the guy who i assume is the manager oversees the restaurant.  the flow is pretty spot on when he's there.  he greets guests, directs everyone, etc.  but when he's not there chaos ensues (new years day)\n\n{ ATMOSPHERE :: 2 stars }\n^ decor : little to no decor, buffet area in the middle of the restaurant also kills any ambiance it might be able to achieve, reminds me of a cafeteria \n^ cleanliness : so far so good, nothing negative to report\n^ noise level, not too bad. you can hear the other conversations next to you - which isn't always a good thing\n\n{ MISC }\n^ parking, street.  we've been luckily and have typically been able to find parking within 5 mins (2 rounds of circling the restaurant at a max)\n\nhappy eating!", "author": "Tina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "Amazing! Had all sorts of dim sum. Also, they serve dim sum for dinner - very rare. Had imperial peking duck carved tableside as well. Great service.", "author": "Victor O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-03", "description": "Bad experience - service was good, but quality of dumplings was off and paid for it later when I got very sick and had food poisoning.", "author": "Charles F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Flavorful and authentic mapo tofu - good selection of dim sum.  Ordered several dishes to split and paid $20/each.  Restaurant is clean and was pretty empty on a Friday night around 7:30pm for some reason.  Will be back!", "author": "Emily W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-05", "description": "Wow, do not believe the hype on these reviews for anyone with dimsum standards. Yes, it's true there's no other dimsum in Russian Hill, but it does NOT, I repeat, does NOT compare to the quality of dimsum you can get at HK Lounge or Good Mong Kok Bakery.\n\nI ordered the dimsum dinner platter and XLB, and the dimsum tasted like it was store bought and frozen minutes earlier. Terrible quality, not juicy. Just... overpriced and mediocre. They should be offering a full dimsum menu during dinner if you are to call yourselves \"Dim Sum Club\" -- there were so many entrees on the menu, I was feeling very confused about expectations. XLB was okay... some of them were extremely smaller compared to the others and didn't have any soup in them.\n\n$20 without tip, and I wasn't full at the end of the meal. Is that what a dimsum meal is supposed to feel like? The only good thing was that the wait staff was nice and friendly, and you don't have to wait for a table. But I'm here to rate the food and it was not all that. Just something to fulfill the cravings if you're too lazy to go to Chinatown/Richmond District.", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "Hidden gem, best Chinese food in the city. Very clean tasting and yummy. We like the dumplings, wonton soup and chicken with broccoli and Mongolian beef. Just wish they delivered.", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-05", "description": "What is with these reviews? Huge huge Yelp miss. I'm not exaggerating when I tell you this is probably the worst Chinese food, maybe any food, I've had in my entire life.\n\nThis place opened and I was curious about it, especially with the predominantly positive Yelp reviews.\n\nI honestly tried to block out this place from my memory, but a few friends and I ordered a few non-dim sum dishes here. I believe it was a chicken and vegetable dish, chow mein, and 2 other dishes. \n\nEvery single one of us were very unsatisfied with our dishes. For me--my gripe was that the chicken was extremely low quality meat and tasted as if there might be cartilage or something in it. It was extremely tough and chewy.\n\nPerhaps their dim sum is actually better and we should have stuck with that, but after the experience we've had here there's no way I would return", "author": "Issa A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-04", "description": "The dim sum was okay, not great.  The staff is friendly.  I'm very surprised this place has 4 stars.", "author": "J. D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-26", "description": "Food was good and everything till it came time for the bill. We paid in some cash and the rest on the card and didn't expect not to have a tip. So as we are leaving the waitress come to get the bill and sees no tip then asked about the tip?!?! I understand completely about the tip but when we explained why we couldn't tip she hour upset and instead that we tip her with the card and we continued to tell her we didn't have enough for the tip and we paid for our food tipping is not a right you deserve of you act like this after not being tipped. So as we are going back and forth she would not let my friend get out the booth so we can leave instead she kept insisting that we tip her for her services. I also asked to speak with a manager and she ignored me I even went over to tell her how unprofessional that was also to my surprise ignored again. Overall food was great the place is nice but your staff needs to respect when that can't be tipped as long as we paid the tax and for the food we should be able to leave and not harassed about a tip especially the way they act after being told I'm not getting a tip.", "author": "Jhon D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-18", "description": "Honestly this was the dirties restaurant I've ever been to. Dead bugs in dishes!!!! Gross!", "author": "Marissa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "With 9 folks total,  my family and I celebrated my mom's 76th birthday with dim sum lunch.   We ordered  and enjoyed the following:  \n\nShanghai dumplings   $7.50\npotstickers, $4.50\n beef porridge, $7.95\n Preserved  egg with pork porridge,  $7.95\nhai gow,  $6.50\nSui Mai,   $4.95  \npork crepe $5.75\n shrimp crepe  $6.75\n vegetarian crepe,  $4.75\nsteamed chicken feet,  $4.25\nsticky rice,  $4.25\n veggie dumpling, $4.25\n deep fried calamari,  $6.95\nsteamed bbq pork buns,   $4.25\nBaked Pineapple crust covered Bbq pork buns $4.25\n shrimp paste mushroom,  $5.50\nshrimp paste with eggplant,   $5.50\nblack sesame mochi, $3.50\nsesame balls $3.50\nSpring onion pancake $4.25\nFried Taro dumpling $4.25 \n\nThe  tea and water were refilled constantly.  Great customer service.  Spent a little over an one hour in the establishment. Took home leftovers!    Will come back again!  \n\nMy mom came here a total of 5 x.   This is my first time.", "author": "E. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "The hotel was once, drug dealers and users famous hang-out, and the most famous Drug-Whore House in SF. The location used be \"little Joe's\" before? And,.. in a short time, it was a Mexican, whatever...\nBut not anymore, because the Dim Sum Club is here for change!\n\nThe waitress forgot our order and the waiter doesn't speak English, but so what?\nWhat I saw was that many really hard working Asians giving their best to keep this dim sum business going.\n\nThis is what we had:\n\nPan-fried potstickers (4/3.75)\nwellcooked, really hot insides.\n\nBBQ Pork bun (3 for $4.25)\ndoughy bun texture, fillings taste was OK, I don't mind that loaded with msg.\n\nBeef Chow Fun, $10\nWhat a Great portion! Taste less salty, the Beef was very tender.\n\nSteamed Chinese Broccoli w/ oyster sauce, $6.50\nthe Chinese Broccoli was Steamed and the oyster sauce was on the side.\n\nShanghai Dumpling, $5.50, 6 pieces: \nThis was surprisingly good. I've ordered this at countless dimsum places and the outside was always thick and the inside was never juicy, but this was good! Thin outer layer and the meat was very juicy and aromatic. \n\nCurry Samosas, $3.95: wow. This was surprisingly really good. The flavors really hit us and it was a great snack to have. The dipping sauce was pretty good and wasn't watered down. Definitely give this a try!\n\nVeggie dumplings, $4.25, 4 pieces, Excellent dish! hot and fresh green dumpling was nice and chewy, w/ diced mushroom inside, \n\nFried Chicken Wings, $4.50, 4 pieces, Excellent, by taking one of the two bones out and pushing all the meat to one end to make it look like a lollipop, and deep fried, come with sliced jalapeño, Salt and Pepper, the crust was not too thick. Nice and juicy flavor. Came with a mayo dipping sauce but I did not need it!\n\nBeef w/ Cilantro Noodle Roll, $4.25, Very good! The rice noodle crepe was thin and smooth. The beef was also very tasty! \n\nThe place seems safe, no more drugs, but msg and soy sauce.\nI will support this restaurant because what I had and the service.\nI will be back!", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Great dim sum find North of Market! Get the fried sticky rice, soup dumplings, pan fried shrimp and chive dumplings and the shumai.", "author": "Bethany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-25", "description": "I agree with the previous Yelp reviewers. Dim sum club is a gem in the Cow Hollow-ish area! The restaurant is smaller but we got seated for 8 people at 1pm easily. \n\nThe caveat is you order from a menu, not from people pushing carts. Nonetheless, everything was good, nothing was average. \n\nThings we ordered:\n-Shu mai\n-har gow \n-fried taro root\n-fried pork puff (football)\n-shrimp noodle (aka shrimp chow fun)\n-curry Samosas\n-spare ribs\n-soup dumplings\n-porridge\n-shrimp chives dumplings\n\nEverything tasted perfect, nothing tasted horribly. It was an extremely satisfying meal for some of us hungover people.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "The food is really good, but be careful, the restaurant itself gets HOT - probably from the open kitchen. If you're looking for some good dim sum near the marina this is a good option. They don't have the carts that they push around, but they have a wide selection on their menu. Super cost effective too :)", "author": "Alison Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "It looked sketchy from the outside, didn't seem like a good place to eat in. But luckily we logged on to yelp and read some reviews, they all recommended it. We went ahead and orders a lot of food, mostly dumplings. Probably the best dumplings I've had in 18 years. The manager came out to ask us if we were enjoying our food and seemed like a friendly guy. It was mostly Asians in the restaurant which I guess can be interpreted as a good thing.\nI'm glad we went in and I recommend you all to do the same if you enjoy good Chinese food.", "author": "Lucia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-11", "description": "11.08.14 | bookmarked 09.24.14\n\nMy usual routine is to venture out to the Richmond for dim sum. But I keep passing by this place on the way to work. And Yelp had it at 4 stars. I just had to check it out for myself.\n\nWe arrived around 1:30 and were seated right away. It's a basic cafe feeling, no frills, bells, or whistles. I'm cool with that, as long as the food is good.\n\nWe get to our usual: chinese donut with noodle roll; siu mai; beef balls; bean curd roll; turnip cake. We added two noodle dishes.\n\nEverything was fine. The flavoring was a bit bland on all the dishes for me. Maybe it's missing MSG (haha).\n\nTotal damage for five: $70", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-08", "description": "Still can't get over how bad our experience was! HOW is this place 4 stars on yelp???\n\nWe have dim sum once a week, usually at Yank Sing or Hakkasan.. so when I heard about this new place in Russian hill we were super excited to try!\n\nUnfortunately, the food and service were so disappointing we will not be returning! In fact, it was SO BAD that we walked up the slope to Loving cup so that we could cleanse our palettes with some yummy frozen yogurt.\n\nAmbience is like a food court, but hey if the foods phenomenal that's okay. \n\n* Xiao Lung bao / shanghainese soup dumplings: Meat to soup ratio ALL WRONG and just not good. we ate 3/6.\n\n* Shrimp dumpling: Filling was ok but skin way too thick.\n\nActually I'm not going bother listing out all the dim sum we had because nothing was memorable. The curry samosas were probably the best, lotus sticky rice was alright and so were the baked BBQ pork buns but that's about it.\n\nWaste of calories, bad service, dirty glasses and take away boxes.. A place that is almost empty at 12 noon on a Saturday is never a good sign.", "author": "Amber S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-31", "description": "Good not great. My group liked the shumai and pork buns a lot but thought the XLB were bland. Not sure that the higher price is worth it.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Love it! The crispy duck is delicious, steamed pork buns are wonderful and the pork & shrimp sui mai are a must have!!!", "author": "Ashley W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "Really really good dim sum and quality Chinese food for people living in pac heights / Russian hill / cow hollow who do want to go all the way to Chinatown or Richmond area for authentic Chinese food. We ordered shrimp dumplings, shanghai dumplings and pecking duck on lunar new year night. The dumplings were steaming hot and well made. The duck was carved in front of us. All made with quality ingredients and less oil. This will be my go to Chinese food in the neighborhood.", "author": "Josie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "Dear Dim Sum Club, please please please please please don't change anything about how you currently prepare your dim sum, because it is SO GOOD.\n\nHonestly, I was very skeptical about this place, being that it's in Russian Hill, bordering Cow Hollow/Marina land. However, I was very pleasantly surprised. All the way from very good tea to super fresh dim sum - I left a very pleased (slightly food coma-ed customer).\n\nThe only downside is that my XLB (soup dumpling) stuck to the container and either broke before I could taste the soup, or had very little soup in it. I think I just had bad luck because my bf (see Jeff N.'s review) did not have any issue with his XLB - all of his had a lot of soup in it. \n\nI will definitely be back.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "The dim sum here is worth chasing down. Took us a half hour to locate a parking space, but the exquisite shao long bao, Shanghai-style dumplings, made it all worth it. Tables on the side were a tight squeeze, which only added the feeling of being in Asia. Highly recommended.", "author": "Bruce H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "Loved everything about it. best pork sticky buns ever. i ate so much food all by myself", "author": "Sierra B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "If I could give this place 3.5 stars I would. Not quite a 4, but definitely good for the location and price. I came here looking to get my dim sum fix but not wanting to travel to the Richmond or Chinatown. The ambience was lacking, but there wasn't a wait and all the food was made to order. There are no carts here so be sure you know what you are looking for. Luckily the menu is in Chinese and English with descriptions that give you a pretty good idea of what you are ordering. I ordered the standard Siu Mai, BBq pork buns, Hagao and some chun fun. One thing to note here is tea is not free, but only $1 a person. This place definitely caters to novice dim sum goers as well as seasoned ones. Their selection could grow a little, but definitely if you are looking for your staple dim sum selection in the Marina/Cow Hollow area, this is the place for you!", "author": "Alex L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "This place has a good location, easy to park, not like most of the Chinatown restaurants. Overall this place is nice and is a little bit pricey comparing to Chinatown's Dim Sum. I can tell there are more white people here as well. Everything is nice, good service. The only thing is that all dishes are not as tasty as in Chinatown, but I don't know why. Especially the fried dumplings, it is obviously made from frozen ones. However, If I am really annoyed by the parking in Chinatown I might consider coming again.", "author": "Chen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-17", "description": "I was not impressed by the food, everything was pretty bland and some things seemed to be not so fresh. In addition, there was an invasion of fruit flies - it was so disgusting. They were everywhere, buzzing in front of our faces, landing on our food, plates, chopsticks, and drowning in our glasses and the black vinegar sauce for the dumplings. If it hadn't been a friend's birthday dinner I would have walked out right away. There must have been hundreds, my seat neighbor and I killed a combined total of at least 30 - we lost count at some point - and didn't even make a dent in the swarm surrounding us. It is beyond me why the owner decided to keep the restaurant open besides such an obvious and disgusting insect problem, especially since the place wasn't exactly busy. There was our table and I think two or three other smaller tables were occupied, otherwise it was empty.\n\nThe food (I didn't do the ordering, so some names may be vague):\n\nWalnut shrimp: bland and starchy/slimy; walnuts were good;\n\nSalt and pepper shrimp: bland but otherwise ok - at least for the first few bites; didn't want to continue eating it after multiple flies had landed on the plate;\n\nSoup dumplings: the top of them was too chewy or almost hard, like it dried out before steaming. The soup inside was pretty flavorless and the meat felt grainy, the texture was definitely off. \n\nBeef chow mein: The beef had a weird sponge-like texture, noodles were greasy, not very well flavored;\n\nChinese broccoli: this dish actually seemed fresh and was ok if slightly overcooked.\n\nSiu mai: again, flavorless and weird grainy meat texture;\n\nThe owner seemed apologetic about the flies and brought us complimentary steamed buns, but that in no way redeems such a huge hygiene problem and mediocre-to-bad food - sorry. The quality of  the food was nowhere close to what I have had at other places in the Richmond and Sunset. I guess I have to keep going there.", "author": "Anna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "This place is great! Went in and had great Dim sum and didn't have to go to Clement st or China Town. Food was very good service was great and it wasn't a million bucks. You will have to flag down servers for any extras but they were super nice and very efficient. I will go back for sure.", "author": "thomas P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "Dim Sum Club is a great restaurant because of the unique combination of the following:\n\n1. Location: Within walking distance of Russian Hill, Nob Hill, Pac Heights - areas that traditionally lack good dim sum eats.\n\n2. Dim Sum at all (open) hours: You can get dim sum for dinner! For takeout! To supplement a meal! As your entire meal!\n\n3. Decent food: Of course, (1) and (2) would be meaningless if the food wasn't good - but it is. Set your expectations in that while it's not the absolute best the city has to offer, it is consistent and delicious. The sesame balls are most definitely above-par. The sticky rice dishes are great too. Xiao long bao has a slightly tough skin but is still quite good.\n\nOverall, I feel lucky to have this as a dim sum option nearby for dine-in and takeout.", "author": "Alyssa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "I was pleasantly surprised by the quality of their dim sum. Made reservations for 16 and they easily accommodated us. Next time, we'll bring some bottles of champagne for Sunday fun day brunch.", "author": "Vicky T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Great value for the quality of dim sum. Usually, we give a place a few months to get to a decent level of consistent quality. This could be my go to place for dim sum for a while. \n\nLocation kinda sucks. I mean, who goes to van ness? This might be a problem since you need to find parking, but I didn't have a problem on a Saturday morning. \n\nInside, there is a review below that says they only have 7 tables. This is BS. Its not a big place, but they have north of 15 takes and can probably seat 75. \n\nThe dim sum is great. Shrimps are big, there is not really a bunch of undesirable filler, not to salty.   E also think they make their own chili because it is potent!  Dessert dim sum were kinda small, but tasty. \n\n5 of us over ordered and had some dishes from the main menu and still got put for under $100.", "author": "Wes W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "The food is pretty good overall. The only complain is the air circulation is bad. The kitchen is right in the seating area. I end up walk out smell like food.", "author": "Kristina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "We have been to this place a few times. Always has consistent good food and the value is great. Doesn't have trolley service but the food is ready quickly. \nThe noodle roll is definitely my favourite", "author": "Renata M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-17", "description": "The food here was really bland. I guess it's something I'm not accustomed to. My husband and I ordered the pork buns and the beef and scrambled eggs over rice. Again, a bit to flavorless and bland for our liking. The customer service wasn't great either. :(", "author": "Vielka V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "Food is here not bad. It is awkwardly located next to da vinci villas. Food here I must say is really good and at a very good price. We tried the vegetable mixed and fried calamaris and it was awesome. This place is very hidden and not many people come here but food is very traditional cantonese food. It is not the best but certainly has great flavors.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-02", "description": "I wasn't super satisfied at Dim Sum Club. I was intrigued by their interpretation of the baked pork bun because it has a flaky top and isn't glazed, however it was very interesting and definitely tasty. And the steamed bao was on the same level-- although you can tell they use a lot of fatty pieces. I like it fatty but it doesn't need to be artery-clogging. But the shu mai and shrimp rice noodle were lacking in flavor BIG TIME. We chose this place because it's one of the few sit down dim sum spots around, but probably would go somewhere else if I was looking for a Chinese breakfast.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "I am overjoyed to have an authentic spot within walking distance. Clean, newly taken over location with friendly waiters. I can't wait to bring my friends & family here. The idea of Chinatown or Inner Richmond seems like a chore. Then followed by finding parking and crowds of people. It's a nice surprise to find the reasonable prices & tasty dishes close to my own neighborhood. They do accept credit cards. Also huge plus & peace of mind as I noticed the 94 Health score next to the checkout register !!! \nGood luck I hope you guys stay around", "author": "Sunnie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "So, so good! I have been craving Egg Fu Yung for months! Not on the menu, they so graciously made it for me and it was the best I had ever had. My hubby had General Tso and it was full of chicken and veggies. Even though rice is sold separately, the value is there because the portions are huge. The staff was so sweet. The restaurant was lightly lit and very clean. We will def will come back.", "author": "Sherrie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "Really liked this place a lot especially considering it just opened up.  The dim sum was made to order versus the carts which I thought would be kind of a bummer but actually made for much better quality.  The value is great, the owner (Francis I think?) is very nice and the quality of the dim sum I would say is almost as good as Yank Sing for half the price.\n\nI got pot stickers, baked pork buns (must have), lotus paste sesame balls, shrimp shu mai, everything was good, the baked pork buns were excellent.  Would give 5 stars but the service is always a little off (no water, etc) and there are usually fruit flies.   A little nit picky I know, but if those were fixed, it's 5 stars for sure.\n\nCan't wait to go back.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-18", "description": "Given the wealth of dim sum options in SF, I'm surprised this place is so highly rated. The food is good but not amazing. Price is decent though - we paid $13 per person after tax and tip. Location is also convenient. Also some bonus points for being willing to take a bunch of credit cards without any complaints! \n\nWhat works here:\n- fried shrimp dumplings\n- noodle rolls with BBQ pork or shrimp\n- pan fried shrimp and chive dumplings\n- baked pork buns\n- turnip cake\n\nWhat's better elsewhere:\n- Shumai: filling could be more flavorful\n- shrimp dumplings: skin is too thick\n- pork ribs in plum sauce: again not that flavorful \n- fried sesame balls: so few sesame seeds :(\n\nOverall, would not go out of my way to eat again.", "author": "Han Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-14", "description": "I am so thrilled that we have an affordable food option in Russian Hill.  We have had our second experience and both times where spot on.  Fantastic service, great food and well priced.\n\nI hope this place becomes a fixture!", "author": "Henry B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-12", "description": "It met my expectation in general. There was no waiting time. Dim sum was good with reasonable price. A lot of choices.", "author": "Stella S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "Soo good!\nSo i am a huge fan of dim sum. its like the best type of meal. So i heard this place was open and had some pretty decent reviews so we checked it out.\n\nIt is in a hotel which is kinda weird...but ill take it. No alcohol...i like alcohol. But the food other wise was really tastey.\n\nI was expecting some exciting extensive dim sum menu..but they did not have it. They did have a pretty good selection of pretty much everything you would need in a dim sum place. Shu Mui, shrimp dumplings, shanghai dumplings. All the good stuff. They had fried rice which was sooo delicious!!! We ended up getting tea instead of beer which is okay. Service was good as we were pretty much the only ones there. They would not give us little saucers for the soy sauce...but well chalk that up to the language barrier...which i am totally okay with. Over all li think this is is  great no frills place for really good dim sum on a quiet night. I am actually looking for to ordering from there again. Maybe take out:)", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Everything was excellent-the food, the service, and no wait even during Sunday brunch hours.  I'd give it 4.5 stars if I could (but I am very stingy with 5-star ratings).\n\nI didn't note this in other reviews, so I'll mention that this is a place where you order off a menu instead of choosing things from a cart.  This means everything is cooked to order and very fresh, but it loses some of the sense of adventure you get from picking surprise treats as they roll past.\n\nAnyway, this is the real deal.  It's easy to see how this place made so many best-of lists.  We'll be back.", "author": "Sofia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-09", "description": "This place is unexpected for sure. Although not your typical dim sum house, Dim sum club has excellent food! I don't know where they found their chef but he is amazing and I have been to a LOT of dim sum places growing up in the city. unlike most dim sum places, our party of 6 Got seated right away and the servers were very attentive to our needs. Order the shumai, BBQ pork wrapped in noodle and the bao. You must try this new place for dim sum!", "author": "Eve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Really enjoyed this new place! They have really great quality food and I hope locals catch on. I first noticed the place when they were giving out free shrimp egg rolls as I walked by. It was AMAZING! Enough to make me come back.\n\nI was a tad disappointed when I came back for dinner with my boyfriend that they did not currently have the shrimp egg rolls and had replaced them with veggie rolls. Still good, but I was craving the shrimp! Hopefully they bring them back :)\n\nWe also got broccoli, pot stickers, shrimp dumplings, kung po chicken, and steamed pork buns. All great! Definitely coming back!!", "author": "Alexandra W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "Great dim sum in an unassuming hotel lobby restaurant in the Cow Hollow/Van Ness corridor.  The soup dumplings were prepared to near perfection, just enough soup, just enough skin and just the right size.", "author": "Rafael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "Everything was delicious & parking was much easier to find here than it was in the financial district or china town. Plus it's a low cleaner too. Food was delicious and service was great.", "author": "Denise P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-27", "description": "This is a follow up to an earlier review where I also gave 5 stars and comented about the dim sum quality (as noted by how thin the skins are on the Shanghai soup dumplings - a sign of the chef's skill).  Only downside is that the menu is a bit more limited than some in Chinatown. \n\nWent back again today.  Still good dim sum.  Noticed that the service is much better than you would find in Chinatown - guess that is because their customers are about half non-chinese, who would not accept standard chinese service.  Starting to get more crowded - no wait at 12:30 on a Saturday, but the way things are going, likely will be lines at the most popular times before long.", "author": "Peter D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-22", "description": "Super delicious. Around the block from the Airbnb I stayed at when visiting San Francisco. This place has really yummy and authentic dim sum. The soup dumpings were delicious! I preferred all the steamed dishes over the fried dishes but that is just my opinion. Be careful when eating right away because we chowed down everything as it arrived to our table and nearly burned the roof of our mouths.", "author": "Debbie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "My first time here, much more convenient than fighting the crowds in Chinatown or Clement St. I love this spot, great service and food!!\nCan't wait to go back.", "author": "JoAnn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-02", "description": "The service was less than average, which is one of the reasons for my three star review. We asked for waters and waited about thirty minutes until they came, even though there were very few people in the restaurant at the time. The Shanghai dumplings were very tasty, however, and that certainly compensated for less than great service.", "author": "Serena L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-06", "description": "VERY unspectacular. We were excited about the high ratings and went here with high hopes on a Saturday night. Had read that they don't serve any alcohol, but they do appear to have wine at least. Pot stickers might have been the only mildly redeeming dish, but lemon chicken was completely soggy and inappropriately sticky/sweet, chow fun was bland and green beans tasted burnt but were tastelessly undercooked (who knows what \"XO\" sauce is - we were told it was garlic but I didn't taste any). Service was typical to this type of place, water was only filled upon request and we had to bag our own leftovers. This was a one time kind of place, and I wouldn't even recommend that.", "author": "Natalie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Awesomely good food in an out-of-the-way location. \n\nThey have a comprehensive menu. You can choose dim sum small plates to share, or larger entree-size portions. \n\nAt lunchtime, my friend and I ordered several small plates, which are made to order. But there wasn't much of a wait for the first plates to arrive.\n\nAs others have noted, the place can get quite warm because the cooking takes place in the same space as the dining. And it doesn't rate very high on 'ambience' but is truly authentic; it's all about the food.", "author": "Daphne O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-26", "description": "You can enjoy the excellent variety and great taste of a Cantonese tea house lunch with out waiting as in the usual crowded restaurants of Chinatown. Go try it yourself soon. Open 7 days a week.", "author": "Ellen D C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "Cannot get enough of tihs place!  SOOOO GOOD!!!  Love the variety and the prices, and the service is quick and friendly.  It's dangerous that I live a block away.\n\nDefinitely try the:\n\n--preserved egg porridge\n--stuffed eggplant (stuffed with shrimp)\n--curry chicken\n--kung pao chicken\n--house noodles\n--fried rice\n--steamed pork bao\n--curry samosas\n--mango pudding for dessert", "author": "Dena M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "I love this place - fast service, no lines, and the only decent dim sum place in nob hill/marina area. The beef congee is amazing, comes with fried doughnuts.", "author": "Gina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "The dim sum club is a good place to eat breakfast, service isn't too bad and they have a fast meal for us.  It was a really great dim sum restaurant that Ive never eaten before (even Hong Kong) . After I  ate,I  gonna have a nice day.", "author": "Shih Ting W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-31", "description": "Maybe im a \"yum cha\" snob so this is what I think how a good tea house should be. Ok let me break it down for you: \nFirst the tea should always be boiling hot. It should be so hot that once you pour the tea in the cup you cant quickly drink it you have to slowly sip it becuase dim sum is some heavy shit. You would feel shitty eating dim sum with out drinking hot tea. Does dim sum club serve tea like that? Nope. To top it off, the tea pot that they gave us was disgusting looking. It had that dried out tea scum all over the top. Come on man!! You are not a hole in the wall place ok. If you going to charge me for tea, you best clean that shit up! U know wat im sayin!!\n\nOk. Now lets move on to the dim sum. First of all, there's not too much variety to choose from. Its just your basic dim sum. You would think they would get it right? Wrong!!! We ordered cilantro churng fun, leuy sa tong yoon, loh bak goh, fung jau, loh mai gai, and seafood jook. The churng fun(rice noodle w/cilantro) was ok but the sweet soyu they used was a lil off. So that was wacked. The leuy sa tong yoon(mochi w/sweet sesame filling was horrible. The mochi part wasnt fresh and the filling was dddrrry!! Wacked. The loh bak goh(daikon cake) just tasted like flour. Wacked. The fung jau(chicken feet) was saaaaalty!!! Wickety wacked!! The loh mai gai (steamed sticky rice) was ok but very oily. Sorta wacked. The only thing that i actually liked  was the seafood jook (rice soup). The consistency was good and the seafood was fresh. Yhat was worth 2stars. This place should be called the jook club.\n\nFor those yelpers that gives this place more than 3stars, shame on you!! This place is WACKED!!!", "author": "RICKY C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-19", "description": "I was a huge fan of this place when it first opened up, however quality has since gone way down. There are always flies in their soy sauce containers (ew) and their food isn't as good. The soup dumplings we ordered tonight were all broken and soup-less :/ It's a great addition to the neighborhood but they need to get their act together!", "author": "Maria Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "My boyfriend and I journeyed over 2 miles of SF hills on an empty stomach to get to this place and it was worth every step. Probably the best siu mai and hargow I've ever had. We decided this place should be our new dim sum staple. The servers were friendly and attentive (exact opposite of those nasty women at Daimo). Everything tasted really fresh and the they did not skimp on the filling. Not like some of the other places where you get more dough than filling. The place was clean and not too busy so it was easy to get a table. I would like to come back and try it again when I'm not absolutely starving so that I don't shovel everything into my face.", "author": "Gaby R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-03", "description": "I came by myself for lunch since I was craving dim sum and it was right before they were going to go on break. The food is not bad at all, however, the selection is really limited, no joke. I order the beef ball, siu mai, ha gao, sticky rice wrapped in a leaf, and turnip cakes. I already know what you are all thinking.... I order too much for just one person, a 5'1, 105 lb girl. Yes, yes I did. I managed to finish 2 and whatever was left over was for dinner that day. The food is not bad, but I left feeling unsatisfied due to the lack in variety. If you don't mind limited selection, this is your spot for dim sum. The service was better than your typical Chinese restaurant, thank God. The place is also quite clean on the inside, which so far,I have found as a rarity here.", "author": "Jeniece C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-24", "description": "Bad. Horrible food. Got the lemon chicken and it was not good. Also the kung pow chicken and the tofu and chicken. Don't get.", "author": "Morgan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "Really good quality. The food came out quick...one of the best dim sum spots I've been to...", "author": "Jenee D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "Dim Sum Club is simply amazing. From the delicious dim sum selection, all made to order, to the scrumptious lunch and dinner plates -- this place has it going on! For under $15 per person you can feast on some quality Chinese food. These are some of our favorite dishes so far: Kung Pao Chicken, Pork Jook, Stuffed Eggplant, Curried Samosa, Fried Onion Pancake. I can't wait to try the Shanghai Dumplings (XLB) on our next meal.", "author": "Drew W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-04", "description": "I had high hopes for this place. It was average for the price point. Had the hot and sour soup, shanghai dumplings, dim sum plate (hai gow, siu mai, bbq pork bun, veggie spring roll and it usually comes with the sesame dumplings but they ran out so they provided additional siu mai as a substitute) and pork pot stickers.  Plus, they have little flies that just won't go away. I actually killed one on my plate and left it there to see if they would say anything since they were watching me swat them away during my entire dinner there. When they cleared the plate, they saw the dead fly and said nothing.", "author": "S C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-15", "description": "The short: Dim Sum was requested last minute and wandered in on a whim and WOW!!! I think I'm going to crave this for a long time to come.\n\nThe long: I hate to write this review because I want it to stay a unknown secret. Had family coming into town and they had been saying they had to go to San Fran while they were in town, but couldn't tell me ANYTHING that they just really wanted to do there. Until they got there and at the last minute rattled off their requests after we parked halfway across town from anything they wanted to do. Yeah I was pulling my hair out. So after doing a few stops they tossed out they wanted dim sum and I fired up my trusty Yelp app. Well all the touristy spots were far away, but there was this new and hot place with a lot of amazing reviews and it was close. Away we went. The place is kind of one of those places you would walk right by and never see if you were not looking for it. Once we got inside it was full of ethnic diners which is an amazing sign in my book. We got sat and given a menu and we scribbled out everything we wanted and just waited. There were 6 of us in total and we all ordered about 3-4 items a piece not really knowing what to expect. Then the food came. Oh crap we ordered WAY too much. We worked our way through the waves of food that came to the table and not a single thing was complained about. Everyone loved everything and we had at least a good 15 different items on the table. We were expecting a heart attack when the ticket came and we were right it took my breath away. For the feast of yummy goods we got our total bill was just under $30. I thought it had to be a mistake but everything was on the bill. I will definitely be coming back here on my next time in the area.\n\nWhat works: AMAZING food and insane prices. As a bonus it isn't loaded with tourists so no screaming babies or people complaining because they didn't know what they were in for.\n\nWhat to improve: Service was a little slow to get going and there seemed to be a communication problem, but nothing that couldn't be overlooked.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-30", "description": "I had a good experience here - it's Chinatown food without the Chinatown prices, ambiance, annoyance, and service. It is mildly pricey but I do love that everything was made to order. I would like to see more things on the menu though. Overall, it was not bad - food and service were good and it definitely satisfied the Dim Sum craving. Finally a decent Dim Sum place for this side of town!", "author": "Sandy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "The food here is original Chinese. The chef here must be really good. I recommend everyone who want to try original Chinese food try here. The pepper sauce is original. It's just top notch food.", "author": "Lizhi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-09", "description": "Honestly, I wasn't expecting much of this place. The people hanging out outside the hotel portion were kind of sketchy but once we sat down and ordered, my mind was totally changed. The food was fantastic. Not the cheapest dim sum around. In Chinatown you could probably get the same amount of food for a lot less but you also won't get angry stares if you don't speak Chinese. Everything tasted great and the service was super fast. I'd definitely recommend this place.", "author": "Kahyo E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "The food was tasty, I really enjoyed the dim sum platter! I loved the sesame balls. So tasty and all for 10 dollars. The service was very friendly and although their English was not perfect it was effective.", "author": "A T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "Delicious food. Friendly service. Clean restaurant with lots of staff. It seems like they good your dim sum as you order it, so everything is very fresh. They have a good selection of dim sum and even a good selection of vegetarian items (which is important in this neighborhood). The sesame balls for dessert were superb.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "Dim Sum Club was good..not just good for the area, located on the outskirts of Marina where you wouldn't expect good ethnic food, but good compared to some of the best dim sum you can get in the city. The big difference between this and many others I've been to is the fact  that you can taste all/most of the food is freshly made rather than sitting around for hours. I selfishly hope they stay in business but not get too popular such that the food quality goes down or the wait is long. To top it all off, the staff is very attentive and friendly; things you rarely get at dim sum!", "author": "Jeff N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "Love the siumai's and porridge. Great duck too!! their dim sum is as good as yanksing but less expensive. Great service too.  Sesame balls are delish.", "author": "ThuZ W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "I've done takeout a few times here- reasonably priced & consistently good.\nShanghai dumplings, shrimp dumplings, eggplant with shrimp, and salt pepper chicken wings are all excellent. Wonton soup is very good. Chinese broccoli & steamed pork buns are just ok- broccoli was a little undercooking & buns taste a little too doughy. \nAll in all, a great addition to the takeout options in the neighborhood!!", "author": "Maggie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "This is right next door. I have seen it be various failed restaurants, so I hesitated to try it. But, I did this week, and it is WONDERFUL. The dim sum is fresh and delicious--the shrimp are not defrosted. The sesame balls are the best i've had anywhere. \n\nI highly recommend this place. Delicious food.", "author": "Lady L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "Great food and excellent service!  Last time we walked all the way from Chinatown because we thought parking might be critical. But actually parking is not hard to find. So we drove here this time and easily parked our car. It's quite busy around noon time. But love their dim sum! Will defintely come back again!", "author": "YueLi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Don't let the facade fool you... The food here is very good!", "author": "Scott H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "Excellent crispy duck, fried taro, shrimp & chive dim sum, and coconut/red bean dessert.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-10", "description": "I stumbled upon this amazing dim sum place by chance one day and have been back regularly. This place wins in quality, price, service, and cleanliness. Definitely worth going to for a fantastic dim sum experience! It's he best I've had in SF.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-12", "description": "I had a pretty terrible experience there. The service was incredibly slow. We had to ask multiple times for water. The food itself was mediocre at best. One item that we ordered was literally inedible and we asked them to take it back and refund us to which they just flat out said no. Poor customer service if you ask me.", "author": "Alison M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-21", "description": "Solid place. Not as good as Great Eastern in my opinion.\n\nGet Shanghai dumplings, shrimp dumplings, and shrimp noodle roll. Egg rolls were solid as well.\nOverall, just not a spectacular place but good value and easy walk to in the neighborhood.", "author": "Dave C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "Good dim sum at a great price in the neighborhood! I've had better, but nothing beats the location!", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-27", "description": "Wonderful experience this morning at dim sum club! The owner Francis was very hospitable.\n\nLeft full, portion sizes were bigger than expected and everything was tasty. We ordered :\n\nShrimp and chive dumpling pan fried, pan fried pot stickers, half roasted duck, shanghai dumpling, salt and pepper calamari, salt and pepper spare ribs, and hot tea.  We went out last night and after a night of drinking there is nothing like yummy dim sum. So glad you moved to the neighboorhood... Welcome!", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "This place is legit.  There are real Chinese peeps in there so that must be a good sign.  Dim sum was very good (not as good as Koi Palace good) but pretty decent.  Service was fine.  Prices on par.  I thought some of the portion sizes were big compared to other chinese dim sum places.  It was just a little hot in there temperature wise - they need to turn on the a/c or a fan especially on a warm day (schweatty!).", "author": "Mr. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "Delicious entrees, fresh ingredients, friendly staff. No pretentiousness but high quality food and relaxed environment, very enjoyable! We will return!", "author": "Jeanne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "This place rocks they offer basic dim sum items but it was so tasty made as you ordered it was fresh tasty service was good,manager or owner came out check on us. Been to other dim sum places in China town even Koi Palace in Daly City but Dim Sum Club will be my go to place when I visit from Texas.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-13", "description": "Great find. We are vacationing and had a craving for dim sum in the evening. Instead of rushing to china town, find parking and beat the closing time, we took a chance with this restaurant and the dim sum was delicious!!", "author": "Rachelle O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "Excellent Dim Sum!  The duck was outstanding and xio long pao was the best!  Definitely going to come again!", "author": "Sandra B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-15", "description": "We were first time customers.....the place seems clean and spacious.  Mostly empty tables and\nyet service is still slow.  The main problem I see is that the help speaks little or no English\nand it is very hard to communicate without repeating yourself and not understanding\nwhat the help is saying.  \n\nFood is okay, but we found the chow mein a little pricey for what you get which was more noodles than the main ingredients and also a bit too oily.  Dim sum was okay, good but nothing great.  All items have the same identical price, which is strange.\n\nThere is a great opportunity for them to do very well here, but they seem to lack the know how of running a business and need to hire English speaking help....because most all of their customers only understand English.  They also need to reevaluate their pricing.\nThe menu does not clearly describe the dishes they offer and so it is super important\nthat you have a waitress that speaks English to clearly describe what you are getting.\nWas hoping to make this one of our favorite Chinese food eating place, but we were left disappointed.", "author": "Girly Foodie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "i think it might have been the best Dim Sum I ate in California.  I've tried place in Monterrey Park and San Gabriel but I liked this place better.  Everything was really good.  Give this place a try when your in San Francisco.", "author": "Mark H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Recently moved to Russian Hill and needed a dim sum/Chinese restaurant that wouldn't be too inconvenient to walk to. Found this gem and enjoyed it. Great place to go to if Chinatown is out of the way. \n\nPro: \nDim sum options available for dinner \nClean \nBBQ pork bun was awesome \nGood quality food \n\nCon: \nWish that dim sum was available all day\n\nWill definitely be going back.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-19", "description": "Very disappointing.  I read the reviews and they made this place sound like it was worth checking out.  \n\nThe dim sum is sub par.  Very small menu and the dim sum was not good.  Will not go back", "author": "Beth K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "first time here. it was great! craving dim sum? eat here! the bbq pork buns and shrimp dumplings are my favorite. no long waits and the food comes quick!", "author": "Cake L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-03", "description": "I really wanted to like this place but this is NOTHING like Yank Sing but also much worse that average Dim Sum available in San Francisco.  I hate giving bad reviews but you can taste the MSG and the food actually made me feel ill.", "author": "william c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-07", "description": "Fast service Still food has too much fat and not tasty. Missing description of dishes. Waitress does not speak well English.", "author": "Yannick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "I'm a pretty big Chinese food snob. I mean, I like the Americanized stuff like Panda Express but it's not Chinese food. I always tell everyone about how disappointed I am by Chinese food in San Francisco for being Americanized under the guise of authentic and expensive. I'm from the San Gabriel Valley of southern California where good Chinese food is everywhere because the population is so densely Chinese. I have always said and maintain that the worst Chinese restaurant there would be one of the best here. Long story short, I've eaten a lot of Chinese food in my life and a lot of dim sum.\n\nI was shocked to find that a pretty legit Chinese place (with dim sum, no less!) had opened half a block from me and in a shady touristy hotel I ass daily. I was skeptical at first but the good reviews inspired me to take a stab at it.\n\nI tried it out for lunch and I pleasantly surprised. Here's what I got to go:\n- salted pork bone rice porridge - huge portion and comes with fried cruller (you tiao), green onions and pickled stuff on the side. It was delicious and I greatly appreciated the condiments. The meat was on the bone and very flavorful. The porridge itself had a lot of green onions and other greens in it already, so in the future I may request green onions on the side only if it's possible. \n- black bean chicken feet - yeah, I'm THAT Chinese. It was a good portion for the price and was very flavorful. In restaurants, it usually comes with more sauce but it may just be because I got it to go. It was also cut up into smaller pieces than it's usually served but that's not a big deal.\n- salted custard buns - it was as advertised but still not what I expected. The saltiness was not what i had anticipated but it was in the description so it was my own fault. I still ate it and thought it was good.\n\nThe staff was very nice and helpful when I asked questions. The packaging is very nice, especially for a Chinese restaurant. The prices are pretty good, especially for San Francisco. How do I get those free pineapple buns though!?\n\nWould love to try dining in and testing out the other dishes. So far though, VERY promising and perfect to scratch my dim sum itch in between visits to LA.", "author": "K C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "This place has really tasty, fresh dim sum.  The bbq pork buns (baked), siu mai, shanghai dumplings(xiao long bao/soup dumplings), and scallion pancakes were all amazing.", "author": "Joel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "GREAT food, great service (with a smile and what seems like a genuine desire to provide a good experience), and a strange location....but not a bad one.  As a bonus, it's terrific to have such a high quality dim sum restaurant in a different part of town. Okay, it's my part of town, but nonetheless.....only thing is it's a bit noisy in there -- it was half full when we were in for lunch, and we had to speak loudly to hear each other.  But who cares? As soon as the food arrived -- which was very soon indeed -- no one wanted to talk any more!", "author": "Mini N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "My wife and I ordered half Imperial Peking Duck, and we were pleasantly surprised by the quality and taste of what we got. Particularly, the duck skin had been well prepared, since all the fat under the skin were carefully removed before serving. We also tried Beef w/ Cilantro Noodle Roll, Egglpant w/ Black Bean Sauce, Bean Curd Roll w/ Oyster Sauce, and Bean Curd Skin Roll w/ Shrimp. We like all of them. Overall, we would rate the taste of the food in Dim Sum Club one of the best in San Francisco.", "author": "Dan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-21", "description": "DSC was a big disappointment.\nWe come once a year to SF for a foodie trip and dim sum is one of our favorite food particularly in SF. We were so glad to hear about \"good\" dim sum place in the area where we stay and did have our hopes high.\n But our experience was not good at all and we are so sorry to waste our money and time here.\nThe taste of the food was very mediocre. Eatable but nothing flavorful or interesting about it. The choices are very limited.\nThe service was ridiculous. Trying to be\" more modern\" then the regular places of Chinatown, but at the same time not knowing elementary rules about servicing the client. Our waitress literally took it as an insult when we tried to ask her to bring extra little spoons for the vinegar that comes with XLB. We HAD to explain to her WHY do we need it and even after the explanation she acted like we hurt her feelings and she was kind of rude for the rest of the time. Probably couldn't wait for us to leave as soon as possible. We also observed how she was acting towards other patrons commending them to the seats she chooses for them, not the ones they pointed out to her were they would like to sit. And BTW the whole room had only 2 tables occupied. Very impolite. \nFinally the value of the meal was WAY overpriced for the quality of the experience.\nToo bad we didn't take in to consideration the negative reviews points.\nNeedless to say we are not going to be back or recommend this place to anyone.", "author": "Tatyana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "Very good dim sum, and unexpected for the location. Not just \"good for the location\", but actually at the upper end of SF dim sum.", "author": "Gerald K."}
