{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-01", "description": "Legit hangout spot for basic cocktails and a brew. Old heads abound with a dark and sleepy vibe.\n\nJust one long bar and the characters you find at it, essentially.\n\nI had the pleasure of meeting the head bartender and he was definitely an interesting gent. \n\nAll in all the bar is great you can tell it's been around for awhile. \n\nIf you aren't trying to cheese up the vibe and want some peace and quiet from the annoying buzz of the Mission, I highly recommend you come here.\n\nIf you are young and you live in the mission though, your presence is probably cheesy and as such you should stay far far away.", "author": "John W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-08", "description": "Usually love this spot, usually the bartenders are cool. The lady on tuesday mornings, quite rude. Asked for our IDs without a greeting and then left me with it in my hand while she finished her convo with another patron. \nTo top it all off she couldn't even remember my drink order correctly. Should I say cared enough to remember? \nI know I may look young but I bartend too and am sick of getting attitude from older bartenders because they have a complex. \n\nCould have scored $5 tip on two drinks but instead left her $2 ($1 per drink, minus $3 for attitude) \n\nWon't be back to spend my hard earned money here for a while.", "author": "Chelsea L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-30", "description": "Oakyish bar, but they only accept cash and the atm didn't give me my 20 and felt like it stole my bank information.", "author": "Andrew Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-23", "description": "Bouncers at the front door actually tried to steal my friends ID. They let him through but then the bouncer put the ID in his pocket. My friend, completely sober, was bewildering asking for his ID back. The second I suggested the best action was for everyone to empty pockets, the bouncers suspiciously flipped out and started accusing us of racism and telling us to leave. After pointing at the exact pocket the ID was in and telling him to empty it, we eventually got the bouncer to cave and give the ID back. The organized effort to keep the ID was bizarre, if you come here be careful.", "author": "Mitchell M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-20", "description": "CASH ONLY\n\nAn okay spot to pass the night in the Mission. They have a long bar area and some small tables good for 2-4 people in the back. They do play music but it's not so loud that you can't hear yourself when trying to have a conversation.\n\nSo why my 3 star review? There are no servers working and only had one bartender working the bar even on a Friday night, so that means 1) you have to get your drink at the bar, which is fine, but also 2) the service is incredibly *incredibly* slow... \n\nWe grabbed a table when we first arrived and two of us stayed there to hold it while one friend went off to the bar area with our drink requests. Since there was only one bartender working, it was really hard for my friend to get her attention, only to be told that he needed to show the IDs for everyone drinking. He went back with our IDs and *cue another round of waiting* had to wait a while before she was free to take his order.\n\nI think the bartender must have felt bad about making my friend wait so long, since she ended up charging him only 20 bucks for our 3 drinks. I went with my go-to which was an amaretto sour, and those usually set me back at least 10 bucks at a bar, so there was definitely a heavy discount in there somewhere. \n\nWe ended up chilling here for a good 1.5-2 hours though, so it was a pretty chill way to pass a Friday night in the Mission. There's also a shuffleboard table in the back so different groups of people were taking turns playing on it which was fun to watch. Plus it's close to a lot of taquerias so you can easily grab some drunchies afterwards :D", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "A very chill dive bar. Came here for farewell party. Love that they have shuffle board. Prices are decent. There's no food here but there's a good selection of drinks", "author": "Chelsea H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-13", "description": "Other people have said it, the staff thinks its cool to be rude\n\nThere are PLENTY of other places to get a drink...", "author": "Willy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-23", "description": "Went there last night and the bouncer tried to steal my friends ID. He clearly saw him put it in his pocket but the bouncer kept on insisting he gave it back. There was another manager (think he was a manager) that got abruptly defensive/aggressive when we asked the bouncer he could check his pockets. He eventually fessed up to taking it and gave it back to us. I don't know how he thought my friend wouldn't notice; this guy literally put in his pocket in front of my friends face haha. The whole situation really sucked to say the least. Hope this doesn't happen to anyone else.", "author": "Israel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-02", "description": "No pros and cons here... just pre's and post's....Sometimes you need to go deep into the brain to remember a place! Post drag queen bingo, post dinner, pre sleep, I entered Doc's Clock with some work buds. \nThe dark, slightly dingy, slightly packed full dive bar was just what the Doctor ordered post midnight for cheap brews and no thrills end to the evening pre Uber back to our hotel! \nDrink prices were pre modern and on the cheap for the San Fran, then again we were post buying anything other then Highlife.\nI slightly remember the conversations were post remembering them in the morning and the bar tender was post caring about being real polite since he was pre having to clean up after a very large full bar! \nAll in all, I would be back. It's the perfect spot to cap off an already good night... Post Party!", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "This place is a real community.  \n\nBartenders are efficient like any good dive bar.  They are very friendly & chatty when they have the time, but, if they don't have the time to socialize you can guarantee the drinks are coming & they will be lovely.\n\nPrices are freaking CHEAP without losing the quality.  \n\nJukebox is a rare treat in these digital days.\n\nAnd they give.  Don't be surprised to wander into a fundraiser for some local worthy cause where a portion of the bar receipts & tips are given to make this world a better place.\n\nThanks Doc's Clock for being human & fighting to stick around.", "author": "Anne Marie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-18", "description": "Wow.  The bartender we had the misfortune of observing was a man who totally hates his job, and anyone walking in for a drink.  Emotionally unstable, this guy is a Trainwreck - He snarled and yelled us about having our cash in hand like he was the bitter angry milk lady on her third shift at a school for ridiculous children.  We said f this and walked out without ordering - you win, cranky pants bar guy, hope this review prevents a few other nuisances and burdens (aka customers) away.", "author": "G D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Priced right, dive bar, with hot specialty cocktails that warm you up like hot Apple pie", "author": "Meagan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-14", "description": "Not that I have to write another review criticizing this place because it looks like the job has already been done however because the staff was petty as hell I figure I might as well be too. We walked in and got a very unfriendly greet at the door where the bouncer couldn't even pause his conversation to check our ids and say thank you for doing so. We walked up and took two empty stools at the bar where we decided on drinks and got passed by a multitude of times. After waiting patiently for approx 15 minutes at the bar and seeing that the bartender had no interest in serving us we lost interest in spending our money there. The fact that she would rather pass customers by and proceed to loudly talk trash about other customers who she pegged as tourists to her regulars right next to us was also a turn off. We decided to leave, we got up and as we were leaving she yells \"BYE THANK YOU GUYS!\" Please tell me exactly what you're thanking us for? \n\nIt's a shame, cool dive spot HORRIBLE SERVICE but if you're one of the types that enjoys sitting in a bar without a drink definitely the spot for you!!!", "author": "Sofy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "It's always OK here I did take somebody who soon posted a picture of themselves there with somebody else this is not the place to seal any kinda deal, just pleasant and queer", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "I love this bar. It is all that is classic San Francisco mission. The staff takes care of you and it's in the perfect location.", "author": "Liz R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-20", "description": "Cash only.  Don't expect anyone to come ask you for a drink order - you will need to go to the bar.  Which is fine, just something to expect.  Definitely more of a dive, but have a decent selection of drinks and my gin & tonic was well made.  Bathroom was pretty gross for 7pm on a Saturday. \n\nNothing special to set this place apart - would not come back.", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-25", "description": "A nice little bar in the Mission. Inside are a few booths, a bar, and a shuffleboard table.\n\nBeen here a few times, the bartenders are friendly. There's not a large amount of seating available, but it's not bad. Drinks are cheap if that's what you're looking for, but you can also get something better here too. It is definitely an interesting interior, hilarious is how I've been describing the painting near the bar. Good spot to go out with friends on a random night.", "author": "Rajeev S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "I'd like to give it a zillion stars. Hands down the best place for a proper cocktail, a laugh, and good times. With friends it's fantastic, but I also find that it shines when I just want a nice bourbon out alone. If I'm thinking it's time to have a drink, I'm already on my way to Doc's. The new bar keeps the ambiance of the old bar, and that's not easy to do. Thank you Doc's.... you continue to bring the magic.", "author": "SisterMable S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "I love Doc's. It's a cozy home away from home where you can get away from all the precious craft cocktail spots that have been cropping up all over the City and have a good stiff drink with an unpretentious crowd. Whether coming here alone or with friends, a good time is always had. I also like that they regularly host fundraisers for neighborhood causes and local animal rescues. Oh! And it's dog friendly!", "author": "Amy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-21", "description": "Respect is not something you demand from customers by yelling & screaming at them. So I had just had a shot & started to feel a little warmer in this rainy weather. My friend touches a beat up Trump Pinata & then our night went sour real quick. (Someone else had already destroyed it before I stepped foot into this nasty place.) The bouncers were incredibly quick to judge & started yelling at us for touching a piece of trash pinata that was left on the side. They felt we \"disrespected the bar.\" Bunch of candy fell out but we cleaned it up. Everyone was pretty much sober. No one was being biligerent or out of hand until we started being verbally attacked. We didn't do anything but clean up the candy off the floor when we got yelled at & she kept going. The other bouncer even joined in. Really professional guys.\n\nI understand being upset someone ruined your precious Trump Pinata but you were yelling at the wrong people. We didn't know that piece of trash on the side was oh so important to you. Maybe you should have kept it behind the bar or in the back if you didn't want anyone messing with it? Reading from other reviews we're not the only ones to be treated this way by workers here. & what a coincidence, most of the other bad reviews are from or about people of color. Don't ever come here. Not worth the drama or the cheap drinks if you have to deal with these kind of people.", "author": "Vee L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "After reading the other reviews, my bizarre experience here makes more sense.\nTL;DR don't bother, especially as a non local.\n\nWent in stone sober around 6:30pm, dressed very nondescript. Got cash from their ATM and sat down at the bar. I read their \"Doc's Clocktails\" board where they list 5-6 specialty cocktails with gimmicky names. There was one named the \"[Something] Prohibition Highball,\" which I ordered. (First part of the name was illegible where I was sitting.)\n\nFemale bartender (must be the one others said is very unpleasant) laughed at me, acting confused and annoyed, and asked what I was talking about. I was baffled and explained I read it off their board. She goes, \"ha, a Prohibition is a beer... a highball is a highball\" and gesticulated dramatically, demanding I tell her which board I'd read it on.  Meanwhile she's making a big production out of scrutinizing my PA drivers license. I explain again, pointing at the board, and she finally turns and looks at it, the cocktail name staring her in the face. Without missing a beat she goes \"well that's completely wrong. You know what, why don't you try another bar.\"\n\nHer explanation was that my ID and my order were \"weird.\" I'm in my mid 20s and have never gotten denied at a bar, at home or abroad. She clearly didn't know what the drink I ordered was, or didn't feel like making it, or was just messing with me as a non-local. Or maybe all of the above?\n\nLots of good bars in the area. Skip this one.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "The best! Great bartenders, great drinks, great people! I was afraid it would go downhill after the move, but its still a perfect neighborhood bar", "author": "Margaret C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "By far the friendliest bar in the mission. Lisa was the most hospitable. I will definitely keep coming back.", "author": "Annemarie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "Bartenders are awesome. A very comfortable place for everyone.Drinks are poured in an honest and profesional manner. I love this place and don't forget to be nice and tip your wonderful bartenders!", "author": "parker f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-24", "description": "It's Always Time For A Cocktail! Yes! Yes! I agree Doc's Clock! A seedy place with a sense of humor totally characterizes this place. I bought my favorite grocery bag ever from here that says \"Shut Your Whore Mouth\" in cursive. It's just enough where people don't really read it but I feel better wearing it to.. oh say, a Whole Foods. At any rate, the cocktails were ok, even though I thought mine was a little watered down. Very dive. NEWSFLASH: you will not meet the love of your life in this bar!!!\nFun place though if you don't take yourself too seriously.", "author": "Monica C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-29", "description": "If I could give this place no stars I would , walked in with my cousins today to get a drink and the security at the door asked to see our IDs. I hand him my el salvador ID which I had to bring with me because I recently lost my wallet on the way to this place. He made a joke on me being illegal and laughed it off as if it was some type of joke. I grabbed my cousins and walked out not saying a word. He decided to step out behind us and claim he is \"half mexican\" some how thinking this is going to to make it alright, ive served in the military & given more then enough of my life to this nation to have someone treat me and my family in that manner. Luckily im involved in a lot of activism in MY neighborhood to get this news across. Hopefully for those reading you can have some understanding in what type of customer service youll get coming here. Ive been coming to docs for 5+ years this is now the end and my friends as well definitely agree, lost my business for the the rest of my LIFE!", "author": "Gary M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Lisa is an amazing bartender! Me and my room mate both work in the neighborhood and decided to stop by. The location is clean and well lit and laid out. Awesome beer selection with combos of shots and beer you can get. They also carry drinks you can order and the proceeds go to good causes. All around great place to hang out! Thanks again Lisa! \nAshley from Alamo Drafthouse\nNicole from Purple Star", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-07", "description": "Ohhh Mission, you NEVER seem to fail me! \nI love the bay b/c of this area! \nCame for the weekend to visit my brothers. Since I haven't seen them for almost a year! \nOne of them is fortunate to live in the Mission.  That's where I usually stay when I come and visit.  \nWe have always came here to grab a drink.  This was actually bar 4 on our bar hopping night.  I was sad to hear this establishment is closing after all these years.  \n\n3 stars only because it was cash only.  I RARELY carry cash.  Luckily, I had a $20 for emergency.  \n\nAs I'm 5 years older than I was when I first came here, the bar seemed smaller.  Or I was buzzed.  Either way, I had good memories with my brothers in this bar.", "author": "Remie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-25", "description": "Bartender is rude as fuuuuuuu*k ... I went in and asked what beer they have on tap.. telling her I'm legally blind at night time. She responded with  \"next time you should bring you glasses.\" I'm not usually the type to write a bad review or say anything negative but I felt it was necessary this time.", "author": "Flower F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-19", "description": "Bar is great: nicely low-lit, long with lots of stools, and fun games in back. Unfortunately when I went in the bartender was snippy to the point of being unwelcoming. It was starting to get busy plus the bartender was announcing to people to have their cash out and ready, so I decided to make things easier on him by ordering off the mixed drink menu on the chalkboard hanging behind the bar. He immediately snapped at me \"I don't know what that is.\" Taken aback I told him it was on his board behind the bar. He turned his back to me and shrugged me off as if he didn't care and couldn't be bothered to mix a drink. I was so dumbfounded and felt so unwelcome that I walked out. He started yelling after me that it wasn't his fault because he's not been at work for a few days, but I didn't care. If this place is trying to be one with the kind of hardcore reputation where actual hospitality doesn't matter -- and that style of bar is a thing -- then they are a complete success. If that's not your thing, if all you want is a bartender to serve you a drink that they have listed on their own menu (and not some frou frou request), don't go here.\n\nUpdate:\nI read a bunch of Yelp reviews for Doc's Clock tonight and it seems the bartenders make a habit of abusing people who order off their chalkboard cocktail menu. I am not the first person who a bartender has told that they had no idea what the customer was talking about.\n\nSo, the chalkboard menu is a trap set up to give the bartenders a chance to abuse potential customers.\n\nThis is a level of bullshit that makes me want to burn the place to the ground. It's not funny. I burst into tears out in the street because the bartender was yelling at me as I was walking out the door. They are abusive bullies. The bartender was mean to me for no reason other than sport.", "author": "Laura L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-04", "description": "Never have I been more appalled by the way my friends and I were spoken to/treated by one of the bartenders at this bar. There is nothing else to be said besides BAD ATTITUDE. This lady went nuts on us because I 1) wouldn't spit out my gum 2) didn't want to take out the ingredients for the drink I asked for. UM HELLO ISNT THAT YOUR JOB?!?!?!?!?!? \n\nShe said \"fuck this. I tried to help you (referring to her handing me a napkin to spit out my gum). I'm over this shit. I'm off. You're on your own\" and then stormed away and was never served a drink. \n\nI wish this post was just a joke but it's true and people like that actually exist and work at this bar. So if you want to be yelled at and not given a drink for just existing, then you should come check this place out! Drinks r cheap so that's good?", "author": "Isabel B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-16", "description": "If you look/sound fairly local and your drink choice only requires opening a can, this is probably an OK bar. If that's not you, expect to have attitude thrown at you by the bartender - and not in a way that can be written off as the bar's 'character'.\n\nI thought the service we received might have been an off day, but after reading other reviews we won't be coming back. \n\nThe bartender complained loudly about having to make any drink that involved pouring two things into a glass. She was also reluctant to make any of the drinks that were promoted on a poster right behind the bar and had something rude to say about us or our drinks choices every time, despite the fact we were tipping generously as she was the only bartender on duty.\n\nSimilar to another comment here, we also then experienced verbal abuse from the same bartender for not returning glasses to the bar, when one of us hadn't even finished drinking. \n\nThe crowd is good and other patrons were talkative, but we noticed everyone was using the bar as a place to meet friends or stayed for just one drink. Now we know why.", "author": "Heather O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-05", "description": "Great dive bar! \n\nI discovered Doc's Clock while waiting for my dinner reservation at Foreign Cinema. It's a no frills and unpretentious cash only bar with cheap drinks and friendly service. \n\nThe dimly lit bar has some \"interesting\" decorations, some of which are NSFW. It's kind of a breath of fresh air, as compared to  some \"fancier\" bars out there in San Francisco and even in Mission District (ie. Laszlo across the street). \n\nAs mentioned before, drinks are cheap. I believe they have a daily happy hour between 5-9pm, with half-priced well drinks ($3). \n\nApparently a dentist owns (used to own?) the bar and that's where the name comes from. Anyways, it's a nice low-key bar to enjoy a cheap drink if you're in the area.", "author": "Arvid Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-20", "description": "Don't come here for fancy cocktails - it's not that kind of establishment. But do expect stiff drinks and rude bartenders - all part of the character of this dive bar.\n\nNice shuffleboard in the back, with plenty of seats and booths. Cash only - there's also an ATM in the back.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "Fun place, great crowd! Sean is a great bartender and always a pleasure. Definitely don't go when the long-blonde haired female bartender is working. She's incredibly rude and makes clear that if you're not one of her favored regulars, your presence is an inconvenience to her. If you see her, just walk out and head down the street to Mission Bar!", "author": "John O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "This is a great bar - when Lisa is working ! She's the real deal - warm, welcoming, knowledgeable and just a really fun woman. I have never written a Yelp review before but please try this bar when Lisa is there - she's very special.", "author": "Richard M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "Happy hour till 9pm on Friday. Oh yeah!\n\nDive bar vibe. Super cheap drinks. ($3 for gin and tonic? HELL YEAH!) Cash only.\n\nLike other bars, drop a tip and your next drink is super strong.\n\nGreat place to hang out and chill without breaking your bank.", "author": "Christina N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-10", "description": "Absolute dump with an absolute beach as a bartender....9 of us went here to spend the night drinking but left after 1.....the female bartender was a disgrace ....i cant understand how bar owners spend so much money opening these bars and then put complete assholes behind the bar.....its baffling....we would have spent hundreds in here but we ended up giving our money to The Gashead bar up the street,,,,,keep away if u wanna be treated like a piece of garbage", "author": "Captain C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "Doc's Clock is the awesomest bar on Mission St. It's been my fun happy place for a whole long time. Lisa makes it all go- so funny and such good peeps. One of these times, though, I'm gonna make beer come out of HER nose. I'm working on it.", "author": "Bernal R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "Doc's is a total dive bar. Hell, the whole back area smells of pee. \n\nHowever, you can get a $2 PBR here during happy hour and they've got a Ms. Pac Man machine. I'm easy to please.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "My go to place for a drink in Mission. Only gripe is they accept only cash.", "author": "Neha H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "Bouncer was terribly rude and assuming. My friend tripped (he has broken both ankles and is just a little goofy-footed) and bouncer accused him of being wasted and advised him a couple times... Don't cause trouble in my bar! Before we had even gotten in there. I told him again... That no my friend was not drunk. \"That's what they all say\" was his response. \n\nThen while inside just hanging by the door trying to decide if we should even stay after that unkind welcome we chatted and waited for the bartender. There are few old and mangy pit bulls manning the door with unfriendly bouncer, which were harmless enough but make people nervous. \n\nBartender was curt and then rudely handed me a bottle that still has the cap on it. (That's illegal isn't it?) she watched me struggle to twist it off using the cardboard coaster and didn't offer to help. I realized it was not a twist off and had to use my own bottle opener... Which she also just watched us struggle with (it's a small multi-purpose knife). I immediately took her tip back and then saw that she had won \"best bartender\" award in 2010 hanging on the wall. I think her times up with that accolade. \n\nI know people have bad nights, or back pain (that I heard her complain about to someone else)... But between the rude bouncer and the very unkind and seemingly malicious bartender... I'm fine not spending my money here..ever again. \n\nThis place didn't seem like they cared one bit about people's experience. I feel a bit sorry for them, but my energy is likely wasted because they obviously did not give 2 shits.", "author": "Jey E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-15", "description": "Seriously and honestly the WORST bar in SF. My experience was so surreal I am still wondering if I was on a show like Worst Bars in America or Worst Dive Bars Ever because it was that bad. First off, the sobering smell of hamster cage will hit you upon walking in. It's pretty pungent and gross. The bathrooms are on another level of disgusting with its sticky floors and piss laden toilets. \n\nThe interior grossness is excusable for a dive bar with $3 drinks (well drinks). But the horrible service destroys any chance for decency.  The bartender Lisa or Lysa was utterly the worst garbage of a bartender EVER. Incredibly rude and aggressive from the moment we stepped in the bar. She gave my friends shit for not knowing what a PBR was. As if drinking Pabst was a sign of maturity or something. She also snidely remarked about me not tipping her when my friends purchased my drinks and between them tipped her $8 for three drinks equally $9 (greedy much). \n\nThe peak of this ill-mannered thunderstorm that was passed off as service occurred when the bartender decided to go on break mid-service. She stepped out to get a cigarette and my friends decided to innocently pose behind the bar. One of the bartender's friend came and yelled at us asking what we were doing accusing us of stealing and ran off to find the bartender. When the bartender came back instead of asking us what happened, she starting going off on us accusing us of stealing and cursing and just being a level 10 bitch for no reason. She even took it racial and told me and my friends (the only minorities in the bar) to go back to \"Compton\". We were yelling back and forth at each other for a good 10 mins before she went uber racist and we just lost it. Needless to say we left the bar and wouldn't come back if the drinks were free and if they febrezed  the entire bar.  \n\n\nI say come here if you want to be yelled at degraded and if  you want to  pick a fight. But DONT leave a tip especially when its not appreciated.", "author": "Jenelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-16", "description": "Bring cash and bring your Fun.\n\nOne of the best dive bars I've ventured into.  Why you ask?\n\n1/ It's a dive bar in the Mission....in SF...that's almost enough.\n2/ PBR\n3/ I like to play me some shuffleboard with my bros/ho's\n4/ Should you desire a more intimate gaming experience, grab the Connect Four, \n    double fist some PBR and enjoy the tuneage quietly at your dive bar table.\n5/ Good music....yeah....good music\n\nEnough to make me want to schedule a business trip to SF right about now.", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "Dirty Frank's in Philadelphia is quite possibly my favorite bar on the planet.  Doc's Clock is like the San Francisco equivalent but with friendlier bartenders.\n\nCome for the cheap beer and friendly crowd.  Stay for the local dranks and the ability to order half-pints if you're not in the mood for a full one.", "author": "Richie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "When we first walked in here the bartender was verbally abusing a table of people for not returning their empty glasses to the bar. The bartender was yelling, \"do you want me to wipe your asses too.\" It wasn't long until this individual started yelling at us to.", "author": "Jeremiah M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-24", "description": "I would give thisa zero if I could, what type of service/bar yells at customers for accidentally touching a TRUMP piñata? Making us patron, who ordered drinks feel terrible because a doll fell to the ground AFTER we cleaned the innards (candy) up. If you want to have a good time, don't go here. Fyi - you don't disrespect a bar when you clean the mess up yourself.", "author": "Tho N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-22", "description": "Sometimes you really don't know the city as well as you think. Here I thought I knew the Mission until I realized that I have never been to Doc's Clock. Guess it was about time! \n\nWith one of the longest bars I've seen and a fine list of on tap beers, Doc's Clock is a great little divey spot. Although quiet enough for our conversation, the place was pretty lively. From empty to crowded, people move through bar stools sipping pints and cocktails. \n\nMy eyes always gravitate to people watching, checking out things on the wall and such. The little needlepoint over the register that said \"Shut Your Whore Mouth\" made me laugh and made me want to learn how to stitch.\n\nAnd if you needed more excuses to try this place, the pints were about $4.00 and it's close to BART.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-16", "description": "The older woman bartender here is a real asshole.  \n\nWas visiting two bartender friends in SF and they thought this would be a good place to check out.  I ordered a beer and the bartender told me I should try a sample first, I told her I didn't need to (since I've had the beer before), but she put one in front of me anyway.  \"Oh she's making me\" I said to my friends and we laughed.  The bartender didn't think it was as funny and said \"Yeah, SHE is making you.\"  I got really nervous that I maybe called her a \"he\" and spent the next few minutes feeling awful for offending her.  Ordered another round and it was a beer that reminded me of the first time I hung out with the two friends I was with. Figured it was a chance to connect with her and told the anecdote when she brought the beer over.  \"Wow, that's great. You owe me four bucks.\"\n\nWhen she wasn't treating me like a dickhead, she was yelling at other paying customers for not being gentle enough with the jukebox or something. \n\nIt was just off putting and really strange.  I've been to divey places where the bartenders don't take any shit, but this woman seemed to be seeking out altercations the whole night.    \n\nOne of my friends spent the majority of his time buttering her up and was able to do it effectively by letting her know he recognized her from coming into his bar.  We ended the night sharing a couple of shots with her and my two friends thought she was great.  I wasn't able to find any charm in her whatsoever and am left wishing I spit in her face while she was drinking the shot with us.", "author": "Mark T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "What am amazingly awesome little dive bar!\n\nWas in the area and up to no good, as typically will happen on the Sunday of a three day weekend.  Found out, through Yelp of course, that Doc's Clock had shuffleboard, so we were sold to mosey our way on over.\n\nCash only dive bar, no surprise, great locals, not too many hipsters, and...did I mention a scrabble board?!?  That's right, there's not just shuffleboard, but also Ms. Pacman, Pirates of the Carribean pinball, Scrabble, Connect Four, Jenga, Trivia Pursuit, and all other sorts of goodies to enjoy the night away.\n\nAnd, hold the phone...  $2 PBRs!!\n\nYep.  Totally sold me over on this place.  Add in to that the awesome customers that made matching up with shuffleboard fun?  Totally sold.\n\nFor life.", "author": "Jes G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Rad place to go out in SF to. Cash only of course...it's SF. However, cheap drinks! Some fun cocktail options too. There were 1 or 2 video games I think you could play like pacman, otherwise it's mostly a chill and hang out bar.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "Just a stinkin' good time whenever I come here.  Cheap drinks especially Sundays (all day happy hour!!) and they have arcade machines to pass the time.  Don't expect anything classy -- this is a dive bar after all -- but you get all sorts and it's always all good.", "author": "Janis P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "Unpretentious and unassuming dive bar, perfect for a casual drink with good friends, old or new. \n\nReasonably priced drinks, and a sort of wonky shuffle board table.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "If you love Dive Bars then this is the place.  We had a blast in here, the bartender was super nice and friendly... we had a few chats while she was on her smoke breaks.  They have lots of board games, pinball machine, pac man, and shuffle board... Which is RAD (Cuz yes I am a nerd).  We had a great time, with great service and I would definitely come back to this place.", "author": "Bryanna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "\"Dive\" here for \"beer\"-y good prices (cash only!)\nThey have shuffle board (just give the bartender your ID)\nThey have games like Connect 4 and Jenga to keep you entertained", "author": "Emily C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-22", "description": "I truly believe anyone who gave this place more than two stars is smoking the PCP Rodney King had when he was pulled over. The \"lady\" bartender is the worse!!!\n\n\nDon't GO HERE!!!", "author": "Jasmyn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "This is a dive bar with a good atmosphere and friendly staff. Cash only, which kinda sucks, but what can you do. Easy to get to by walking or transit depending where you're coming from, since there are a bunch of buses along Mission and Doc's is also close to BART. Great place to hang out with friends", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-21", "description": "Worst. Bartender. Ever.  When you work in the service industry, which both my husband and I have done in the past, it is all about tips.  Telling your patron f*** you, when they are just asking you a question, and asking said question nicely, not in a bitchy or patronizing way, is just rude and not a way to ensure a good tip.  This used to be a fun divey bar and we have been coming here on and off for 20 years, but no more.  But hey, it will probably get bought out any day now by a speculator looking to put up condos and honestly if it goes under - at this point - why should I care about preserving something unique if the people that work there don't even give enough of a damn to treat their patrons decently?", "author": "Laura M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "Good for a beer. Cash only. It's in a grimier part of the city but It has a lot of charm. Really cheap happy hours can't beat the shuffle board.  Good alternative for a drink if you don't the cocktails in the Alamo.", "author": "Zac B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-12", "description": "This place sucks.  The door man declined a real California ID for no real reason, only really because it didn't \"look the way his did\".  There's no reason why I need to give my money to a place like this.  I think he was racist and thought all Asians look alike and that I was  using a fake ID.\n\nUpdate after 3 months.\nThis place has 4 stars currently! I re-read all the reviews and it looks like there must have been a change in management or it's some strange social experiment they are pulling, but the majority of recent reviews are in line with my awful experience.\n\nSo sad to see a dive in the mission go to hell like this.", "author": "Jing L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-18", "description": "Terrible customer service. First time in. Bartender said 'talk to your bartender instead of your phone' and told my friend 'move your ass\" to do something to the shuffleboard area. Hopefully you don't get the same jerk.", "author": "Tatum H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-17", "description": "So, I went to a birthday event, and somehow ended up doing a mini-bar crawl and tacos run. Epic win FTW! Use this as a template. First stop was \"Mission Bar\". Second stop was \"Lone Palm\". This was the third stop - I was finally was buzzed enough to remember to take some pics. hah!\n\n- It's not small, nor does seem cramped (http://static1.px.yelpcdn.com/bphoto/zSe1gmlRb8OfcdSJkwD5KA/l). \n- The people are fun, what with some movie projected on the back wall (http://static1.px.yelpcdn.com/bphoto/YXAPLFJwRAAudA4DtQ7GOQ/l)\n- Shuffleboard (http://static1.px.yelpcdn.com/bphoto/ujK6pA-0r2mMfDjnP2asAQ/l)!\n- A video game machine (http://static1.px.yelpcdn.com/bphoto/ObR1HpcwCwyEKProdt_8vQ/l) with four games!\nThe Krak 'n Cider (http://static1.px.yelpcdn.com/bphoto/xh3De8XPoH80-lcNO-ql1w/l) was awesome as it really helped my cold, hah! They also have Sunday brunches, called Three Papayas - Cultural Liberation Brunch, from noon to 5pm each Sunday.\n\nOn the way to the restroom, saw this blast from the past:  (http://static1.px.yelpcdn.com/bphoto/lpiIXD0n1Btdd5TZsmn0TQ/l). Wanna \"Benny Hill\" your youtube videos (http://bennyhillifier.com/)?", "author": "Peter L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "Bartender was more than happy to take our cash but then became a complete asshole when politely asked about the shuffleboard table. Thanks but never again.", "author": "Elise R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "Terrible service and incredibly rude bartenders. I'm a fan of dive bars but not this place.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-25", "description": "Decent bar. Didn't have as many games as I expected, but it's a neat dive bar. Good bar to catch up and chat. Plus there's a bonus to having games of course. Bartenders are really nice. Cash only bar like so many bars in the mission. My friend had a really good time getting a high score there on one of the games that has a plane shooting at you and you're shooting at the plane. Something like that. Anywhoo, maybe it's better at a different time, but I liked it overall.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-07", "description": "Docs clocks is the worst bar I've been to. The bartender is clearly unstable and consistently yelled at everyone in sight. Rude, inconsiderate, and overall uncalled for could sum up the service. I would avoid this place at all costs!", "author": "Shardae S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-16", "description": "Last time I was there, the bouncer was smoking with the front doors open. He may as well have been smoking in the bar since the smoke was just wafting in and filling the bar.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-16", "description": "Been my go-to for since 2012. Good prices. Good location. Got games. Over the years I noticed that all the familiar bartenders and bouncers are still chill and friendly while all the new faces are assholes. I miss the attic club...", "author": "Henry T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-17", "description": "Came into this bar on Monday the 16th for the first time and despite the actual bar being cool (the Shuffle Board is a nice addition) the rude bartender ruined the experience for myself and the group of friends I was with. \n\nThe management needs to educate the staff about \"tips\", tips are given for good service and even for Ok service. The bartender was tipped 20% (generous considering he messed up the order which was written down on a piece of paper, numerous times) but failed to recognise this before he insulted a member of the group based on her nationality for not tipping when she had.\n\nOther reviews have also highlighted this issue. Good service = Tips.\n\nWill never be coming back to this bar especially when surrounding bars offer superior and friendly service", "author": "Erin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "The Clock means business. Always efficient and friendly service. The drinks are strong and cheap. Bourbon/coke $6 bucks. Beer. Cheap cheap cheap. \n\nShuffleboard and always a friendly drunkard sitting on next you", "author": "Sigorney S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-02", "description": "I wish there is a 0 star option because this bar deserves a 0. Went there one night with a friend and received the rudest service at any bar. I called the bartender a 'sir' by mistake and she was clearly offended (in my defense, the room was dark and I apologized right after she corrected me). I had 2 drinks thus far and would like to try something new, so I asked the bartender for a recommendation for a well drink. She looked at me and asked me if I heard of a thing called Google, and walked away. I waited for a while for her to come back but she didn't, so I waved my hand to get her attention and when she came by, she asked if I learned my patience yet. I was very angry at that point but I didn't want to make a scene, so I said 'yes, and I would like a Long Island please'. She said you should eat first because that will mess you up, and walked away.. At that point, Its obvious she does not want to serve me and I have had enough of her attitude, and so I got up and left. Yes this place have cheap drinks during happy hour, but the service killed it for me. I tipped well and tried to be as polite as possible, but that bartender had some serious problems. Would not recommend this place to anyone.", "author": "Jack W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "4 stars for having shuffle board! Eff yeah! The vibe is very relaxed and casual, good beer selection and friendly crowd. Not sure if the pit bull walking around is a regular customer, but it was really friendly and cute!", "author": "Judy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-21", "description": "I liked the space.  The crowd was cool too.  But man... I have never experienced such a rude and VICIOUS bartender.  She yelled at my friend for only tipping 10% after our first round.  We go out a lot and usually start slow.  If she wasn't the most terrible human being I have ever come across I'm sure she would have ended up with at least 20% tips from us... like we always do.  We understand that tips are a bartenders livelihood, because, well, my friend who the bartender berated is a bartender himself.\n\nWe drank our drinks and left.  So did the people next to us who were scared to death of the bartender after she ruthlessly ripped into my friend and tried to embarrass him in front of other bar patrons.  Jokes on her though in the end, I saw other people flicking her off behind her back!  Maybe we weren't the only people she mistreated?  LOL.\n\nI would love to go back... but I think I'm too scared.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "Personable bartenders, great dive bar. Love the décor and the random barbies everywhere. Definitely coming back on a regular basis!", "author": "Zara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-30", "description": "Great happy hour specials: well drinks $3!!!  That's retro 1980's pricing. The bar was pretty empty at 5:30 on a Tuesday.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "Neat divey bar with cheap drinks and random games, ranging from shuffleboard to connect four. I saw a bunch of people eating pizza so i think you're free to just bring pizza inside.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-11", "description": "Doc's Clock, you win life. You already had me hooked with your fun game selection - Pacman, pinball, shuffleboard, drinking Jenna and more. But then you offered a large selection of warm winter drinks and I fell in love. Yep, you won me over with that krak'n cider. \n\nSo there you have it boys and girls. Doc's Clock is a chill, fun dive with good drinks. Stop by and fall in love.", "author": "Talia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "Dope spot can't complain, chill atmosphere great place to meet up with friends and get a quick drink. Oh one more thing drinks are super cheap", "author": "Kency A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-14", "description": "Solid dive bar option.  As others have said, cash only (which is to be expected), cheap strong drinks, good bartenders, friendly clientele and happy hour till 8pm even on Saturday's.  $2 cans of Olympia? Why not.", "author": "Nick G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-31", "description": "Eh, how about a huge big sign that says we only take cash before I have to come inside. That would be great.\n\nThe staff is friendly enough, and the drink are your usual, but considering the other better places around I am not sure why you would choose this place over any of the others that will happily take my plastic.", "author": "Luis D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-07", "description": "The bartender was very rude.  I wouldn't go there. Many more bars in the city to choose. Some Midwest \"girlfriend\" got a job there and she may have had too much of \"San Fran\" for her own good!", "author": "Kari S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-17", "description": "Dive bar.  Shuffleboard.  Juke Box.  Cheap beers.  Happy Hours.  Decent Selection.  Hipster Crowd.  Booths and tables.  \n\nThese things pretty much define my favorite bars, so apparently Doc's Clock is one of my new favorite Mission haunts.  And to play shuffleboard on a Sunday we just had to exchange our ID for the pucks...hey-o free game!  And we met some likeminded strangers who challenged us to a game until the rest of our party arrived.  The jukebox has a good mix of artists/genres.\n\nI may brave this place on a weekend night for comparison, but on a Sunday evening with a few people at the bar and one other group at a booth, we had room to move around and table hop as the shuffleboard got heated.  Oh, the table is slightly warped though, so if you're hardcore about your shuffleboard, you've been warned.", "author": "Anne Marie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-25", "description": "I love everything about this place, except that their doorman (the scrawny one with the black hair) is a total jerk. But their bartender Lisa is awesome, and the rest of the crew seems pretty cool too.", "author": "Dave R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "So much freakin fun. Love the Mission, never been to this particular spot. The manfriend said it was awesome, so in we went. This bar has a ton of character with a lot of SF history/culture, and the bartender, Lisa, is AMAZZINGG. Perfect place to chill, play games, have a beer and great conversation with all. I most definitely encourage everyone to stop in!!", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "Dark, divey-ish bar with great staff. It's cash only, like a lot of bars in this genre in San Francisco. The music selection was good, the crowd chill and the bartenders attentive. They make good drinks and I would def go back.", "author": "AT P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-22", "description": "I have no idea why this place has a scotch menu when the bartender completely ignores the order and just gives you a scotch ale instead, despite numerous protests that what I wanted was, in fact, a Bruichladdich.  Granted, I realize that that's not the easiest word in the world to understand, but the response is to not pretend you heard something - again, after numerous attempts to explain how the bartender was wrong - and just go through with it.  This is not a \"Oh I misheard\" type of situation, but rather a \"Oh, I'm not even going to try\" type of situation.  Of course, neither is acceptable when you're in an area as hyper competitive for getting people drunk as the Mission.", "author": "Norman S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-15", "description": "I love this place. I somehow always end up at Doc's Clock when back in San Francisco because everything about it is excellent. The neon sign, the shuffleboard and random board games, a badass jukebox (no newfangled TouchTunes here) with Sleater-Kinney, Dead Kennedys, and Otis Redding - it's all aces. \n\nHappy hour is daily (!) from 5-9pm, with well drinks 1/2 price. That's right, 3 bucks a pop for my whiskey diet coke. Doc's also sports some pretty solid top shelf choices, including emphasizing the local with Hangar 1 vodka and Anchor Distillery selections. Props for the monthly doggie happy hours, with 50% of the bar donated to a local dog rescue and they are a SF certified green business. \n\nDoc's Clock might be elevating the dive bar, but don't get it twisted - cash only, now and forever.", "author": "Emily G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-10", "description": "Nice dive bar on mission street. Tables and shuffleboard in the back and plenty of quick eats nearby to help you through your night. Bartender was friendly and speedy which nicely countered the craft beer loving crowd who demand a lot of attention. Will go back if I'm in the neighborhood but apparently the bar is closing shortly.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "Cash only bar. Fun environment for a chill night. They have a few games inside...shuffleboard, Ms. Pacman, Connect Four and a few other fun ones.\n\nI played connect four which was awesome, one of my fave games to play at home while drinking/chilling. Had a moscow mule, it was good although tasted like it had no alcohol :( Good crowd. Music playing.\n\nI would come back!", "author": "Lina K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-21", "description": "Started the night here, wasn't all that impressed. \n\nPros: \n\n1) Cool games \n2) No cover\n2) Diverse crowd of people and space to talk to them! \n\nCons: \n\n1) They were out of their signature bar beer Anchor Steam... how is that possible? Replacement recommendation from bartender was terrible. \n\n2) They served some strange IPA in a Chimay glass. Again, who does that at a bar? \nThis isn't some house party where \"all of the other glasses are dirty\" is a valid excuse. \n\n3) The connect 4 game didn't work :(\n\nI probably was there on a bad night.", "author": "Ryan V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-05", "description": "Any bar that makes decisions about who can come in based on race is no place for me. I was completely mortified last night when the bouncer did not allow one of our friends to come in reasoning that she was \"too brown\" in her ID picture. She was the last in our group of eight people to enter when the bouncer denied her entrance. Unfortunately everyone who entered before her was white and there was no problem with anyone else's ID. Honestly, not being let into the bar was whatever we just took our business somewhere else. However, the fact that the bouncers reasoning for denying her entrance was because of her race was absolutely unacceptable. If he thought the ID was fake he could have said something else, asked her a question about the ID, or called the cops and let them decide if it was a fake ID or not but instead he decided to deny her based on race. I didn't know people like that existed in San Francisco but after last night I was proven wrong. \nAfter the situation occurred I wanted to read other reviews of the bar to see what others had to say. The place has pretty good reviews however the bad reviews all dealt with different racial slurs and commentary made by the bouncer and some bartenders. I think reading that others have been denied entrance based on race, told to \"go back to Compton\", or that there have been multiple times that they have denied darker Asian women from coming in, makes the situation a million times worse. Because now it just proves that racism is an underlying theme of this bar and that the bouncer didn't just accidentally use the wrong terminology when denying her entrance. He honestly felt the way he did. I guess you can't change racist people but I will chose to not support a racist place like this.", "author": "Briana N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "What a great bar. I haven't been to a packed place and was able to get a drink in under 4 min in forever. That's how get it done. And free soda water. Served fast! WTH? And they were donating half their proceeds to the Mission fire victims. You guys rock! Thanks for the hospitality", "author": "Nicole O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-30", "description": "This place was awful. The bouncer/manager was really rude and yelled at our table because we place our pizza box for min to on the jukebox to organize the plates. Get it, but you can tell or ask us to put the box on the table without screaming. Rude service all round.", "author": "Jacqwi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "Stepped in, ordered a Jameson, read Dostoevsky.\n\nThe bartender chatted me up intermittently, left me to my book when needed, brought me water when I was feeling parched, and poured me another Jameson... just because.\n\nHow can I NOT love this place?", "author": "Adena B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "This place is one of the last true San Francisco Dive Bars. Lisa, the bartender, is a fine mixologist and a kind person. They have regular dog rescue events and so far, it is blissfully free of the millennial hipsters who have ruined The Mission. In fact, judging by the people who wrote the negative reviews, they would rather not be here, which is JUST FINE with me. This place is homey, fun and the drinks are well-crafted with fair prices. What a hidden gem!", "author": "Susan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-27", "description": "Pretty slow for St. Paddy's day. Cash only, but fair prices.", "author": "Greg F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-10", "description": "Shut Your Whore Mouth.\n\nNo, not you.* That's just what the embroidered sign behind the bar says.\n\nAt first, I hated this bar. Not because of the sign, that's clearly fantastic. Mostly because they were screening an independent movie that seemed to consist only of shots of a passing train, a man tearing apart a chicken with his hands, and various rodeo activities. This would not have been a problem if it was not accompanied by a score comprised of DEAFENING mooing.\n\nWhen I yelled over the mooing, \"What the FUCK is this bullshit?\" The guy to my left kindly informed me that the \"filmmaker\" was sitting on the other side of him. Luckily, she didn't hear because of her absurdly loud soundtrack choices.\n\nDoc's Clock improved dramatically after that screening ended. The bartender is appealingly grumpy, they serve up $2 pints of PBR which are ideal for a chugging relay race (that my team won, of course), and the next film featured women in lingerie involved in a lot of spanking and eventually, dildo-sucking. Which could still be construed as offensive to some, but I found it to be marginally more palatable, as I could hear what my friends were saying.\n\nI didn't even have to make any of that up. \n_________\n\n*Actually...yes. You.", "author": "Peter D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "Doc's Clock is everything I like in a Mission bar. Hilarious staff, strong drinks, an unpretentious crowd that was always busy, but no line spilling out the door like the places up the street. \n\nIt gets a little jammed near the bar (I swear, there's some law in the city saying you can't have more than four feet between the bar and the wall), but they have a great draft beer selection if that's your bag. It's hidden away a bit amongst all the noise on Mission, so I feel like I wouldn't have found this place otherwise, but if I need a pint in the Mission that's fairly priced (we all ordered beers/cocktails and I don't think anything came out to over $5, bless), I'll likely be back to Doc's Clock", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-17", "description": "Any bar that has a hand cross-stitched sign that is framed and hung behind the bar that reads \"Shut Your Whore Mouth\" instantly gets at least 4 stars.\n\nSadly I was not there long enough to do more exploring, but overall this is just the kind of dive that I like.  They also have a better than average selection of beers for a dive and good happy hour deals.\n\nI shall be returning soon.", "author": "Brian E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-28", "description": "The atmosphere here is a bit weird.  Dark (not like interesting, emo dark... just literally a bit hard to see) and a bit dingy.  That's part of what people find as its charm, I suppose.  But the whole feel was a bit depressing.  Also, when I was there, there was a grand total of 6 people at the bar, but the bartender was wildly inattentive.  I felt like I was inconveniencing her by ordering beer.   When I had a question about a certain tap, she was visibly annoyed that I asked.  Prices aren't bad, but it's not a place I'd go on purpose again.", "author": "Tarah D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-20", "description": "Inexpensive drinks, good vibe... but it gets very crowded and not the best beer selection.  The happy hour is long and every day, which is outstanding!  The games at the back are cool too.", "author": "Allison M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-22", "description": "What the F! Came in for a happy hour drink. Treated us like we just got off the the Google bus. Sorry I didn't have drink order memorized. I have lived in SF for over 20 years, not the kind of hospitality I expect to find when grabbing a local drink.", "author": "Resto L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-03", "description": "\"What's that place? Clock's Dock? Knock Clock? Ah, Doc's Clock!!\"\n\nCheap $6 cocktails, friendly chill bartenders, games (arcade and board), eco-conscious \"turn off the lights!\" sticker in the bathroom!\n\nCash only, hit the ATM beforehand! Moderately crowded on a Friday around 9ish, but could find a table without waiting too long.", "author": "Suejung S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-30", "description": "Splaloosh!\nDoc's Clock gots me that way. That way is wanting to fall on the sidewalk and just sleep there. (oh the sweet embrace of concrete, I could love you) In the morning the headache still told me that it was a good idea. In retrospect it would have been the end of me.\nDoc's Clock is a dive and it is hipster happy. It's a fine place to get a drink, they even have cheap champagne! That my friends is what separates this joint froms the others on the block.\nCool place", "author": "Alexander R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-16", "description": "came here many years ago, im a fan dont drink anymore so not my stomping grounds these days", "author": "Leigh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "I probably shouldn't feel comfortable in this bar but it just so happens that I do.\nIt's never really crowded and that's unfortunate because it is the kind of bar you can make your home. You shouldn't make any bar your home, but if you're like me and you can't live with out beer after a really long day...this is the bar for you.\n\nIt doesn't really follow a theme (which I like) .\nIt's located near 24th Street Bart (which I like).\nThe bartender was super nice when he kicked us on New Years ( which I like).\nThe bar is also near someone that I like ( which I really  like).\n\nDrama free, dimly lit, cheap drinks. That's all I ask.\n\nOh, Cash only. Don't be the douche who throws your card on the counter . Doing something like that would justify the parental tone from your pal who is a regular.", "author": "Hannah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "Love this place.\n\nCash only, full bar, awesome bartenders, plenty of space, SHUFFLEBOARD!, board games, jukebox, and cheap drinks. Who doesn't enjoy a 2 dollar Olympia while playing shuffleboard or a board game?", "author": "Zoe H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-23", "description": "They have a pacman table! I understand that it's just plexiglass over an old arcade game, but still fun. Shuffleboard too!\n\nSweet happy hour drinks. We had $3 porters. The place definitely felt like it could be a sports bar structurally, but instead of big screens, there are murals and hipsters. Nice chill place to conversate.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-14", "description": "There are two reasons I love this bar:\n\n1) They have the best happy hour in town. \n\nMonday-Saturday 6-9 PM and all day Sunday\n\n$2 PBR\n$3 drafts\n$3 well drinks\n$5 Chimay\n\nThat's right, three dollar Anchor Steam until 9 PM\n\n2) Once a month they have a charity happy hour and silent auction to benefit an animal cause. 50% of all drink money and 100% of the auction goes to the Charity\n\nEach of those reasons deserve five stars so I give them TEN stars.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-17", "description": "Normally i like this place.  But the bartender on monday nite (dec 16th) was awful. There was a big group of us, probably 10 - 12 people, a mixture of english, irish  and american, with at least half of us all bartenders. It can be daunting when that many people want served at the one time, but we were organized and had the money and drink order already together. it was all shots and only two of us(one english, one irish) actually went to the bar to place the order, to make it easier. Pretty straight forward. \n\nBut the bartender had serious attitude. After he had mispoured a drink (and acted like it was our fault,. - don julio gold instead of blanco, which any good bartender knows, you always ask dark/white when you have both types of a brand) poured a drink we didnt ask for, and missed one completely, we paid our $50+ tab, left a $10 tip and did our shots. \nAs we turn around to leave, he leans over the bar and says \"Just so you know, in this country, its customary to tip the bartender\". \nSeriously??\nAt this point am too shocked by his rude behavior to say anything other than \"but i just left you $10\". His response - \"oh, that was you.... ok.  ....thanks\" \n\nThere was nobody else around us!!! who else do you think left it????? \n\nI dont know what this guys problem was, but next time i think we.ll just keep walking to the next bar instead.\nAnd now, that's at least 7 bars in the neighborhood that will not be recommending Doc's Clock to anybody.", "author": "J F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-26", "description": "Good beer at good prices. Interesting, funny decor with that feeling that people love the place and want to make it welcoming. The service experience was kind of manic - she was attentive, full of suggestions, chatty but she was also having some sort of conflict with a buzzed guy sitting next to us (told his friend to get him the hell out of there) and at one point she got testy with me for \"interrupting\" her, which surprised me because I thought we were having a conversation and I wanted to point something out. I would go back though, because everyone has an off day.", "author": "Linda F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "The place rocks, the bartenders rock, and the cheap drink prices are legit for what's popping up in the neighborhood.  The nightly specials are fucking awesome (4 roses bourbon for $4 all day Tuesdays? That's a steal).  So long as things remain the same at Doc's, it will forever be my go-to bar in the area.", "author": "Keith P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-12", "description": "Definition of sacrilege: A bar in the Mission running out of PBR. Seriously, PBR paraphernalia all up in the whole bar, your \"drink special\" chalk board outside says PBR... so where the hell is it? Lame.\n\nLast night came to the conclusion with a group of folks that at night, when the bar closes, ghost cats take over the place to party. Like a ghost cat after hours. They show up, get hammered, do lines of catnip, and then pee all over the back of the bar. There has to be some logical, scientific reason for why it smells like cat pee everywhere, and this is what we came up with. Sorry Doc's, but maybe you should put out some ghost cat litter boxes or something. Doc's used to just smell like feet, but it's somehow morphed to cat pee. Not sure if that's an upgrade. \n\nOn the positive side, rocked some serious Lord of the Rings pinball. I love pinball because no one really knows how the scoring works. Sometime special sounds or lights go off, a ramp opens, or the score board says something like \"Secret Cave Adventure Bonus x200!!!\". Everyone agrees, you just \"try and hit stuff\". So I have no clue what all the Lord of the Rings stuff is really, but I'm all drunk like \"Yeaaa, Gimli bonus woooo!\" or \"Oh man, did you see that 'Ent War' ramp bonus? So sweet.\" Had an entertaining conversation about what the full name is of the Elf chick played by Liv Tyler and we settled on Arwen Sexyface. Her face is like smack under the right paddle and she's staring straight up at you. Kinda creepy if you're drunk enough.\n\nBetween pinball, board games, table shuffleboard and PBR specials (when they aren't out of it), I do like Doc's. I ignore whatever the funky smell of the month is and always end up having a good time. Mellow crowd too, very social. Plus, it's the only bar I know of where I can yell things like \"Oh man, I whooped that Balrog's ass\" and not be looked at like I'm mental.", "author": "Justin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "Happy Hour. ($3 well drinks, $1 off of drafts, and $2 PBRs)\n\nGames. \n\nDarkness. \n\nFriendly Bartender. \n\nI wish I were there right now.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "I grew up in the Mission/Bernal (~30 years) area and I'm disappointed in not discovering this spot sooner.  It's divey, hipster with just the right amount of shitty to add to its charm.  Its busy, but not overly crowded on the Friday night I was there.  Bartender w/ the long beard was attentive and helpful.  Drinks were cheap and potent.  Apparently, the owner gives back to the SFSPCA; a huge plus for a dog lover like myself.", "author": "Leland H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-29", "description": "My low star review is only about the woman bartender I had when I went in this last weekend for my 21st birthday  - I normally love this place.\n\nI came here around 9:45 Tuesday night to start off my 21st birthday. I hand my ID to the woman bartender and she tells me that she can't serve me until midnight. This is such crap because midnight on my birthday wouldn't be my birthday any more. I asked if she meant midnight on the night before and she said no. She said it was CA law and that she couldn't serve me. I was so angry because that is not the law so I fought her on it and she wouldn't budge. She ended up saying she would \"be nice to me\" and sell the drink to my friend and I could secretly take it but it was just such bullshit to have to go through it. She came over later and yelled \"21 year old bitches\" at us. \n\nI went to many other bars that night which all let me in because, duh, you are allowed in on your 21st birthday. Very disappointed and sad in this service because I normally love this place. She definitely ruined it for me. Bummer!", "author": "Simona M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-10", "description": "I've been here at least twice... my first time was a pretty average experience. Was with one other friend, cheap cocktails, whatevs. \n\nI came here with a large group on a weekday night as a friend was back in town. We were visibly their main source of business that night. No one was obnoxiously drunk or anything but a couple drinks had been spilled by some people. My friend was really apologetic about it and grabbed a handful of napkins to start cleaning it up as it was dripping all over the place, and the bartender scowled \"Don't waste a tree!\" or something like that and grabbed a towel. I'm all for saving trees, but don't be a dick, be quicker with the towel, and, like, don't be a dick. \n\nAlso, don't try to order a vodka + diet tonic here, the bartender will just look at you confused (it's as if he either doesn't know a diet version exists or that you can drink tonic with alcohol other than gin. ok fine mostly he just can't hear you) and suggest a vodka + diet coke, which just sounds disgusting. \n\nAnyway, I really don't know why I'd go back here. Cheap drinks are hardly a selling point when they're standard drinks I can make for cheaper at home, without the 'tude.", "author": "Richa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-25", "description": "Any bar with shuffleboard is alright with me. The bartender was hella cool and poured stiff tasty drinks. The vibe was chill and relaxed. \n\nI'm all about it and would definitely return.", "author": "Kiristen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-19", "description": "A great, affordable dive bar that's easy to socialize in - especially after losing your hearing at Lazlo across the street. Treated friends to a scotch, rum and coke and g+t for...$12. Amen.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-01", "description": "Didn't seem that divey to me... drinks were kinda soft and wasn't much there...", "author": "Adidas W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-10", "description": "My favorite Mission Bar! (other than Mission Bar, of course.) I am a huge fan of all things dive-y, dirty and in the Mish. I discovered this lovely spot after a crazy night of theater at The Dark Room. The drinks are strong, the happy hour is LONG and the price is oh hell yes. Bring a $20, leave drunk and happy. I love this place because if you're a teetotaler like me, you appreciate a cool dark bar that you can crawl into and curl up in right after work to drown your sorrows with a nice cold pint (of which they have several crafty types on tap!) It's very nice before 8, very few hipsters, just the regulars and the die-hard drunks. :) Oh. and don't be dumb. What good Mission bar takes cards? Use your brains, stupid tourists, and get the hell our of my neighborhood with that fancy plastic stuff.\n\nEDIT: they have Anderson Valley Winter Solstice Cerveza Crema on tap. I DIE.", "author": "Miquela S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-25", "description": "Time for some complex algebra:\n\n[(Mission + Hipsters) / (Shuffleboard + Board Games)] + [(Surly Bartender - selection of booze) + (Hipsters x Juke filled with punk)] = Ironic but good, in a dirty, ironic way.\n\nThere's a needle-point sign above the bar that reads \"Shut Your Whore Mouth\". That's worth an extra star right there.", "author": "Don B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "About as good as you can get for a dive bar.  Great location, very cheap drinks, nice homey service.", "author": "Ric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "Best place. Friendly bartenders, always. Especially Lisa. Jukebox has a good range of different types of tunes. All in all, very easy going type of place. I enjoy it every time.", "author": "Alyssa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "Really pleasant staff.  \nNice long bar.\nFriendly crowd.  \nGreat Happy Hour prices.", "author": "Jag A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-25", "description": "A great down to the earth dive bar that I love! Good selection and good people behind the bar. \nOnly one thing -- Cash only (thats the star off) \nGreat bar! My local...", "author": "Lonnie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-10", "description": "Came here the other night for happy hour. Pleased to find $3 well drinks that were actually worth more than $3. Pleased to learn that HH lasts from 5-9 daily, giving us peons who work for a living time to enjoy it. And pleased to hear Doc's cares about the community: it's a green business, and it hosts HHs that benefit animal charities. That's pretty cool in my book.", "author": "Allison B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-14", "description": "Great Bar! Came here on a Friday Night - place was packed and drinks were cheap! Vanilla Vodka Coke and a Vodka Soda for $10 and they appeared to be quite stiff! One of the better bars I visited on Mission!\n\nPlus - they even allow dogs in the bar!", "author": "Brian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-20", "description": "This review is based on a few awesome things that made this a shined turd among dive bars: 1. any place where the bartender playlist has Slapshot 'Hang up your Boots' and other hardcore once in a while just makes me happy 2. any place where the bartender is from the east coast just makes me happy. 3. any place with shuffleboard makes me happy 4. cheap beers make me happy", "author": "A A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-26", "description": "a favorite dark divey hangout for pre-parties and meet ups. I love the strong drinks, the board games, and the shuffle puck and the fact that they did not kick us out for inventing a game entitled wafflepuck for a scavenger hunt task.\n\nhttp://www.youtube.com/watch?v=Hj_SLylSphQ", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-27", "description": "It. Was. Packed.\n\nI came here for a celebration! It was amazing. And also a small world, because one of my coworkers was there, at the same time, for ANOTHER party. Of course, Jaime was driving and therefore not drinking. But I managed to sit down with Janney, Fong, Keane, and some other cool cats I didn't know. One guy actually introduced himself and interrupted my conversation to tell me I had french bangs and I was one of the most beautiful girls he's ever seen. Um, thanks? \n\nThen I pointed out a guy I thought was unbelievably attractive, was apparently loud enough for him to hear me because next thing you know he's pointing to me and this girl is glaring in my direction. OH HEY KEANE MY WONDERFUL BOYFRIEND HOW ARE YOUUU! (thanks for being there for that). \n\nThe guy who told me I had french bangs asked me to join him and his friends at the 500 Club to blow some coke, and I turned him down because if I ever do a hard drug more than likely I'll fucking kill myself. Here's the conversation:\n\n\"Hey, you want to go blow some coke at the 500 Club with us?\"\n\"Sorry man, I'll kill myself. But thanks!\"\n\"You know, you're beautiful, but it's not like that means anything in this cold, cold world. And beauty goes hand in hand with intelligence, but I just don't see much of that with you.\"\n\nWhy do you need to go to the 500 Club? It seems like you've already been snorting. You got a little..um...white stuff..*points to nose* right there. \n\nThen to top off the evening, I was dared to go up and ask these guys if they were wearing cologne, because someone was wearing an amazing scent and I wanted to know who it was. None of them, but they invited me out to Wish, and I would have gone but I ate a bacon dog instead.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "The first time I went to Doc's Clock was merely by chance.  A couple of us stumbled in there while to kill time waiting for some other people to meet us in the Mission.  A friend who was with me said the next day that my words were so slurred and unintelligible that he thought I had been roofied.  Guess their drinks do the job!  \n\nThe next time I went to Doc's Clock was because said roofie-accuser had developed a strange love for (a) the shuffleboard table and (b) this owl picture that sits in the corner above the bar on the left side.  While I am skeptical of any activity like shuffleboard that rewards participants for being weak, I ended up having another solid time here. \n\nNow I go to Doc's Clock because I have realized it is pretty awesome -- never super crowded, generally innocuous clientele, spacious interior, large bar, etc.  I don't live or really frequent in the Mission (and when I do go there I prefer to be a little farther west if I can help it) so I'll probably never be a regular.  Close to BART as well. \n\nI won't go so far as to write home about the place, but I will write this review.  Not exactly worth going out of your way for (there's a good dive in most neighborhoods, no?)  but it's a definitely solid choice if you are in the area.", "author": "Molly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "They open at 4pm on Friday, before Make Out Room or Shotwells.\n\nUnusually good selection of local, artisinal distilled beverages. Summer 2012, local go-to drink is \"summer salad\" some parts cucumber vodka, basil vodka, ginger ale base, some tonic. \n\nAdorable \"public teacher happy hour\" pricing. Intriguing use of \"tres leches\" liqueur in various cocktails: Very personable bartender, authentic mission vibe. This bar has been a fixture for years, and will be for years to come, a mission standby.\n\nCan be intolerablly crowded on the weekends and, let's face it, when normal people are out of work and wanting to party on the weekends. Don't discount it though,they throw down for real.", "author": "Allonsy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-30", "description": "Pretty good  Mission dive bar. They have  pinball and shuffleboard table to keep you entertained. We played pinball for hours,  but we  really wanted to play shuffleboard. Unfortunately we were on the bottom of a very long list and never got to play. The drinks are priced well and come in pint glassses, which is rare for SF. The atmosphere is fun and the crowd is young and friendly. The bathrooms are very gross though and they only have one stall for men and one for women. With nicer bathrooms this place could have received 4 stars.", "author": "Jena M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "Shuffleboard! Good service. Fun atmosphere. Lots of good food nearby. Definitely one of the better Mission bars.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "Came here on a Saturday afternoon, the day after they had some bizarre \"mutilate Barbie\" party, so there were random, disfigured Barbies everywhere. they had a decent selection of beers and alcohol - we were there during Happy Hour and had a blast!", "author": "Tammy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-15", "description": "This place always surprises me. It's divey, lurking there near 22nd but cheap, cheap cheap. Nothing fancy, just a long bar, shuffle board, and friendly staff.\n\nI also appreciate that they have a large collection of local booze. Ask around and check out the range, you will find a lot of stuff made within 100 miles.\n\nAnd yeah, the bar only takes cash. Just about every bar in the city is like this. that;s the way it is, get used to it.", "author": "Geoff H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-03", "description": "Sat night - 11 PM - and Doc's Clock was full of fun-loving people. A good crowd playing shuffleboard and having a few beers. Not too hipster!\n\nBest part of the night - running into PAWS and playing with the adorable dogs they brought along. Dog-friendly bar? YES!", "author": "Madeline N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-15", "description": "Always a good time (and buzz) at Doc's. Super chill atmosphere, cool-ass bartenders and a long bar to sit yer butt down and drink to be merry.\n\nThe best part is the embroidered sign on the wall behind the bar. It reads: Shut Your Whore Mouth. Any bar that has that up is worthy.", "author": "Meredith R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-08", "description": "When I got kidnapped from a DYL by 3 beautiful women and brought here, one commented that I was either brave or insane. My response was that regardless of how the night turned out, it would make a great story! (Cop: Wait...he was \"kidnapped\" by 3 women? Wherever he is, he's probably thrilled and doesn't want to be rescued.)\n\nGiven that I had a great time hanging out with all of them at Doc's Clock, that assessment would be perfectly accurate. The velvet curtains near the door created a classy feel, accentuated by the dim but adequate lighting. Bartenders were efficient, drinks we well-priced, and my vodka Collins was perfect. The narrow walkway along the length of the bar creates a choke point near the door, but the bar opens up in back into several tables and booths. Bathroom in the back was narrow and graffiti'd, but clean and otherwise fine; no complaints.\n\nThis bar is a great place to hang out--in addition to good drinks, they have a jukebox, a LARGE pile of board games (including my favorite, Scattergories), and a shuffleboard table. I rocked a perfect winning throw one game that earned me a beer in admiration from my opponent! \n\nNext time I'm in the Mission, Doc's will be high on my list of bars to visit!\n\nTRIVIA: I have no idea the origin of the bar's name, but it makes me think of \"Back to the Future\", and that alone makes it cool. This place is 1.21 jigawatts of fun!", "author": "Bill B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-29", "description": "Friendly bartenders and good prices. Also, a great selection on the juke box.\n\n Unfortunately, last time I went here (possibly my mistake b/c it was a friday) this place had turned into Jock's Clock! What the heck. Too many dudes with flip flops =/\n\n I guess it isn't the bar's fault...", "author": "Leuwam T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-08", "description": "Went to Docs Clock last (11/7/15) night to support Muttville that had a fundraiser/silent auction to raise money for shelter dogs. One of the supportors, a woman that was well dressed and about 40 something, went out side.....4 steps outside the door to calm a dog that was tied up. Apparently she had a glass of wine in her hand and the bartender, Lisa I believe, started screaming at this poor woman about bringing her drink outside the bar. The woman looked shocked and brought the drink back in the bar and apologized. The woman behind the bar went of on her....calling her a F-ing asshole and a f-ing C word. People at the bar were mortified including the dog rescue group she was attending with. Then she would not drop it.....she threw the woman out of the bar. The woman was crying, she was with a group of shocked friends and the bartender is still going off on her. I felt so bad for her....the majority of us left at that point. I am thankful to Docs for supporting dog rescue groups but will never go back there again with that unstable person behind the bar. To bad, seems like a decent dive bar minus the staff.", "author": "Shawn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-17", "description": "I love this bar. My preference is dive bars with good style. A little ghetto fabulous. Shuffle board and table video games. He tamale lady with her out of this world tamales. Dark and grungy. Love it. Always meeting great people.", "author": "First P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-15", "description": "Cheap drinks, dark bar, efficient bartenders with the perfect side of attitude.", "author": "Mel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "Great place to come hang out and have a drink. The owner gives back to the community ex. The resent event held to help raise money for the SFSPCA. Way to go!!!!", "author": "Rolo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "The bartenders are over the top amazing! Great conversation, delicious bargain beverages and shuffle board. In addition they are dog friendly with dog treats behind the bar!!! Remember though... Cash only. A must visit bar in Mission!", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-12", "description": "This place looks kinda sketchy from the outside but when I walked in it posed different. With a shuffle board and a pac man machine I was set. The drinks were strong, the staff was friendly and great. We decided to come back the next night.\n\nI will be coming back here for sure.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-19", "description": "Ok this place is pretty awesome. A 2 block walk from Bart, a pretty decent bar. The bar tender is pretty cool and drinks are priced right. There is a rather large shuffle board table setup along one wall of the bar. While I am not a shuffle board player, I am a pinball player and yes Doc's Clock has pinball. I believe it is an Indiana Jones Tournament variety to be exact. Man I was so happy to see that. I didn't get to play it though because sadly there was a line.\n\nBut what I found in here that I haven't ever had at another bar before ... Hot Drinks :) Like a Hot Toddy, which is basically hot tea with whiskey and lemon. Or a \"Snuggler\" which is basically hot cocoa and peppermint schnapps (very good festive on a cold SF night). There was no spiked egg nog though so I was a bit sad. I contemplated whether I was asking for too much ... I think I was.\n\nOverall I am a fan.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "My buddy Chris brought me out to this joint last week to show me some of the rad Mission bars I had been missing out on.  This place did not disappoint.\n\nAwesome local beer selection, paired with some shuffleboard makes me super amped to come back here.  Plus they do a shot and a beer combo (on Mondays I think but I could be wrong).  Anyway, I totally dig it.  If you wanna go, let me know.  I'm signed up.", "author": "Nicholas N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-30", "description": "It was awesome on an empty thursday night. Pints, neon lights, Indiana Jones pinball (!)", "author": "Emily D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-25", "description": "The dyke behind the counter was awesome..strong drinks and a friendly attitude. SUCH a rarity in the \"oh-so-cool-hipsterville\"\n\nCLEAN place, also rare in the Mission.\n\nGreat drinks, good drink specials, huge variety, cool people who actually converse with strangers!\n\nWould have given this place 5 stars, but it's stuffy inside, they need to invest in ceiling fans or some sort of cooling system.", "author": "Ted K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-17", "description": "Docs Clock, yet another amusing and fun Mission bar. Not quite a dive, but it could be if they went more that direction. \n\nImpressive hand made bloody marys were really good. After 2 of them I was feeling great. The bathrooms are a bit weird, but hey, it's a bar in the Mission, not some fancy place in SoMa.\n\nThey have a great selection of beers and alcohol, and they are priced fairly cheaply when you look at the generous pours. I mean the bloody marys were $5/each, so after dropping a mear $15 I was a happy camper.\n\nNot much to look at, not a lot of art and only 1 partially working TV. But they do have a shuffle board in the back along with a few old pinballs machines.\n\nOverall I'm a fan and would totally wonder/stagger back in there again!", "author": "Erik B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-13", "description": "Wow, used to love this place, haven't been there for a long time and won't be going back.  Met my husband there years ago, went there with a group for pre dinner drinks, the bartender is condescending and treated everyone in our group with contempt.  Bartender had the nerve to say to my husband in a very non funny sarcastic way (believe me I know sarcasm, its the only sense of humor we have where we come from!) 'welcome to the mission', we've lived in this area for years, she told another friend to 'back the f**k off' when he approached the bar to order a drink.  Really?? You have a job???? Maybe you think its 'cool' to act nasty, you were in diapers when we started coming to this bar.  You're attitude won't get you very far in life and maybe you should consider a career where you don 't have to have human interaction.", "author": "bealeasa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-12", "description": "Doc's clock is located in hipster-central on Mission, but despite providing its clients with the standard swill beer and tatted bar tenders it avoids many of the otherwise negative stereotypes of Mission hipster bars. I like that.\n\nTo the point, there is an awesome, ***** (5 star) shuffle board in the back. It truly makes a night. Amen for shuffle board.\n\nThey do offer $2 Oly in the can here, which, for a guy who went to school in Montana, is like coming home. Draft Pabst is $2.50, and you can't beat that. The juke box is great, but it's a little too loud in here to actually hear the music on a Saturday night.", "author": "Wes T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-17", "description": "Ten years ago when I was working in the Mission I had some friends who would go to Doc's Clock.  I guess you could call them hipsters.  They listened to Modest Mouse and the boys panted their nails and wore thrift store threads.  \n\nThis place was in the news over and over again.  I would constantly hear stories about vioence in the bar or right in front of it.  Then I would hear even more stories.  Jesus Christ.  People were calling for the bar to be closed due to violence.\n\nHowever my friends told me how cool it was so I went in there.  A bunch of ugly old drunks were in there.  What the hell.  This place isn't cool, it's lame.  I am not going to waste even 5 minutes in this joint.  I walked by tons of times and looked inside and it always looked really lame.\n\nI am not going to risk my life for a drink.  Maybe it is safer nowadays but I have heard too many stories about the violence that surrounds this bar so screw it.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-22", "description": "Great drink prices, shuffle board, connect four,this place is the shit", "author": "Holly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-16", "description": "This was our second stop for our Mission Bar crawl on Saturday night (after dinner and margs at Velvet Cantina down the street) and this place has something for everyone!  At 9pm, it wasn't too crowded and we staked out the back area, setting up Jenga and Connect Four.  Our group (mostly non-Missionites) made new friends playing (aka getting dominated) shuffleboard and overall a fun time was to be had.  Drinks are reasonably priced and the kitchy decor along the wall was cute.  The quintessential neighborhood dive bar...though I never did figure out what that smell upon entering was :-/", "author": "Mengo Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-06", "description": "Stiff, cheap, quick, cash only.\nBest Jukebox in town.\n\n\nMy favorite neighborhood dive bar, hands down!\n\n\nB Movies projected on the wall, board games, shuffleboard, and just all around no frills loveliness.", "author": "Chanel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-08", "description": "Doc's is my favorite bar in the area! It's spacious and cozy, great service, a great rock jukebox - no internet jukebox bs here - and shuffleboard. It's also dog-friendly complete with dog treats and water bowls. They have charity events as well for all sorts of causes.", "author": "Kate R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-17", "description": "Aside from the two times I've been here and someone (who under the age of 14 even does this?) let off stink bombs, I enjoy Doc's Clock.\n\nFirst of all they serve Olympia beer - that is wonderful fun. And it's like $2 or something super cheap. They also have fun games and the crowd is great. A hipster crowd but older, legit hipsters. Good times.", "author": "C P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-01", "description": "Probably my favorite dive bar.  Where else will the bartender play Scrabble with you while you drink an icy cold beer?\n\nThis place has the perfect combo of grimy bar + cool patrons + great, cheap drinks + BOARD GAMES!!  \n\nNerd alert, but I love 'em and a Ms. Pacman arcade?  Swoon.", "author": "Christina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "Nice little dive bar. \nI came here right before Halloween and the place was decorated with freaky, mutilated barbie dolles. It was actually pretty cool!\nBeer selection is nice, definitely come during happy hour.", "author": "Sam C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-23", "description": "I really love this place. The atmosphere is chill, friendly, yet just crowded enough that it feels fun, the staff are great, and there are interesting board games and shuffleboard in the back. There are both cheap and non-cheap beer options available, and you never have to wait long for service.\n\nThey're quite dog-friendly, which can be a positive or a negative depending on personal preference.\n\nIt's always a reliable good divey experience that's great to start off or end a night.\n\nOn the negative side, they do run out of beers occasionally, which is annoying.", "author": "Ned D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-17", "description": "I have only been here twice, and it is a nice little neighborhood bar, at least early on a Friday.  They are cash only, and make a decently strong drink.  The bar comes equipped with shuffleboard, so be prepared to play.  The bar is pretty dark, and has never been packed that I have seen, but like I said, I have only been twice, and both times were early on a Friday.  Nice place to stop after work if you are in the area!!!", "author": "Dick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-11", "description": "Came here Saturday afternoon with a buddy of mine. There was no one inside the bar except us and the bartender. Yikes. \n\nC'mon people, $2 PBR's! \n\nHello? Where are all the Hipsters? Donde estas en la Mission?\nI'm surprised they aren't drinking this place up.", "author": "Zam M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-21", "description": "Yea for incredibly efficient, tolerant, and forceful-when-needed bartenders.  Doc's Clock has at least one of them, and she's worth probably more than she makes.\n\nYea for cute greyhounds that put up with annoying people who patronize Mission bars and just want to pet greyhounds when said perpetually sad-looking dogs are just trying to rest.  Double yea for said cute greyhounds that occasionally jump and rest their forepaws on the edge of the bar.\n\nBoo for patrons of Doc's Clock.  Most of you suck.  Yes, I'm talking about you.  And you.  And you too; don't think I didn't see you trying to dance on the bar.  Yes, you were drunk, but this doesn't give you the right to almost ruin the efficient bartender's night.\n\nSometimes, I hate the Mission.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-03", "description": "This place has the three P's: pinball (the first time I was there, it was one of my favorite tables, The Simpsons; the second time, it was Indiana Jones), punk music (that juke box has some amazing music on it,) and Pac Man... Ms. Pac Man, to be more specific, which is WAY better than the original. My first childhood arcade game was the Ms. Pac Man table top arcade machine, and they have that here.\n\nI guess they have a fourth P... Pabst... but I actually HAVE taste in beer so I'm not counting it :D\n\nI've been here a couple of times with friends, and I have to say this is probably my favorite bar in the Mission... and it's probably my favorite bar in the City overall. The place is fucking cool. The bartenders aren't pretentious, they have games including a shuffleboard that is rarely not used, and on some nights, they project B movies on the wall near the bathroom. Of course you can't hear anything when the bar is crowded, but whatever... it's not like it's the main reason why people come to this bar.\n\nThere's only a couple of problems I have with this place... the bathrooms could be way better, and if someone is using the Ms. Pac Man game as a table, you're probably not going to get to play... unless you have a nice group of people sitting at the table. Other than that, this place is great.\n\nIf I was hanging out in the Mission with friends and we wanted to go to a bar, I'm totally suggesting this place. Their prices for drinks are really cheap compared to most bars in the City that charge way too much, the atmosphere is great for groups, there's entertainment, they make Hot Toddies, and even when it gets busy, it's not all that bad. I feel sorry for the person who can't have fun at this bar... and this is coming from a guy who doesn't like too many bars, especially crowded messes like the Beauty Bar.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-10", "description": "When traveling, I love to pull a stool up to the bar and talk to the bartender about the prices and the beers on tap. Not only did these stools swirl, but also they had a great late night happy hour that included cheap well drinks and $2 PBRs. I liked it and as I am trying to be a local in San Francisco... I would like to be future regular.", "author": "Kylie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-19", "description": "Solid dive bar usually filled with friendly people. Not achingly hipster and \nenough room so you don't feel crowded even on a Friday night. \n\nThe free games give it a nice vibe and the bartenders are extremely friendly and go the extra mile with their service.", "author": "Ali B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-05", "description": "Shuffle board! Shuffle board! Shuffle board!\n\nA full size table too. This is hard to find in SF so this place is definitely a favorite.\n\nIt's one of those bars that I prefer on a mellow night or afternoon when it's not super crowded, but then again what bar isn't better when it's not crowded?", "author": "Jackie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-15", "description": "I love you, Doc's Clock. You are really close to my BART stop, your pours are legendary, and your bartendresses are great at both putting up with asshats (like the juggalo down below who slams \"hipsters\" in the same bit where he bemoans the lack of \"beautiful people\") and soothing ladies, like me, who often have to put up with them.\n\nI love a bar with games, dogs, movies, and booths - you have them all. Thank you for being awesome while many other Mission bars near the 24th St stretch just ooze \"too cool for school\" bravada and reek of STDs.", "author": "Jess F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "Good dive bar that I should go to more often.\n\nIt is pretty cheap.  That is good!\n\nIt has many references to Milwaukee, where I am from - so that is also awesome!\n\nBoard games and table shuffleboard type game... awesome!\n\nWhen you walk in you don't feel like you are in the mission anymore - you feel like you have been transported to a dive bar in a po-dunk backwoods town.\n\nI like!", "author": "Kristina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-16", "description": "Cheap drinks, bartender was fantastic. A bit of an adventure, but we loved it!", "author": "Matt N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-26", "description": "What can I say???????? Doc's Clock is a Rock around the clock!!!! came here Monday July 25th after dinner. I went with Couchsurfers and was surprise to have shuffle game and 3 video games in the one machine. a very rare machine to have 3 in 1. stayed until 11:00pm playing galaga like crazy because I was kicking ass on the galaga. Yes,the bartender dose goes an extra mile they are very friendly as well as the hipster are friendly too.\n\n4 star for this place\n\n1. Friendliness of Staff\n2. Free game of Shuffle\n3. 3 video games in one machine Galaga, Ms Pac Man and one more cannot remember the name.\n4. the price is right on the drinks.\n\nI take away the star did not like the restroom it had orange light kinda hard to see when you walk into the restroom I though the restroom was Okay. \n\nHighly recommend if anyone loves to play shuffle board.", "author": "Mat Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-09", "description": "Wandered over to Doc's Clock after an meal at Foreign Cinema. Definitely impressed -- as far as dive bars go. Even more impressed that they offer Fernet. No dive bar (and barely any normal bar) in Minneapolis offers this fine Italian digestif. \n\nHow I missed the board games and shufflepuck game, I'll never know. Probably because I was busy kicking ass in a beer chugging game.", "author": "sarah p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-22", "description": "good standard dark/loud dive bar, close to 24th & mish, and they have shuffleboard.", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-09", "description": "It's located close to a couple non-descript Latin storefronts, and you'd almost miss it if it weren't for the achingly kitsch facade that immediately gives this place its charm. It's not a dive bar; don't let these hollow hipsters fool you. But it is no frills, with daily drink specials and bartenders who call you hun and ones who could give two shits if you were alive or dead. Don't you worry though; each one has a hand of stone. \n\nThe bar itself is a hodgepodge of various libations from seemingly around the globe, with something called \"Unicorn piss\", a light yellow concoction in a bottle shaped like a horse put out to pasture going for $10,000 a pop. Water is self serve, bathrooms are moderately clean though don't think you will do your disco drugs in there. There's consistently a squirrely traffic of hipsters brimming with PBR coming in and out.\n\nNow my girlfriend and I usually go to Doc's to drink the 5$ Chimayo tequila on hand and drunkenly grope each other in the leather padded booths in the back. If you're adventurerous you can get away with more. The jukebox will only play dirty music from a bygone-era, and the shuffleboard sometimes leaves some patrons in a frothy competitive frenzy. I haven't randomly talked to many people there, which is odd, as most people in San Fran will give you their life story if you happen to make half-lidded eye contact with them. Nonetheless If you are in the mood for a cheap, stiff drink that will leave you feeling fucked, then this is the place.", "author": "Charles S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-30", "description": "How is it that I have not yet written a review of Doc's?\nStashed inside an old theatre, lights and all?  Awesome.  Cans of Olympia or shots of cheap whiskey?  AND shuffleboard.  I've spent the end of many a good night at Doc's.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "Four of us went here last Friday night in search of shuffleboard.  We were so happy to find it - and it's free!\nThe bartender could have been a little more friendly but the happy hour prices until 9 pm were cheap!  They were showing old movies on the back wall and have some vintage arcade games at the back tables.  Had so much fun playing Miss Pac Man.\nThere was kind of a foul smell coming from the bathroom once the place warmed up.  Not sure what that was about.  Just don't sit too near the back.\nIt was freezing cold when we got there so if you are going early in the winter dress warmly.", "author": "Janz P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-10", "description": "Pac Man! na na na na na na Pac Man!\n\nThe arcade game makes my inner and outter geek so incredibly happy. Strong pours, good beers on tap, friendly patrons. One of my favorite spots!", "author": "Allegra F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-22", "description": "I love bars like Doc's Clock. Old, worn in, lived in feeling... it feels like a diner from the 50s. Lots of neon signage and Christmas lights with tiled floors and old lighted beer signs (think 1970s Miller ads). Good stuff.\n\nCash only (which seems to be a trend with these older bars in SF) but since the Ketel One & sodas were only 5 a pop, I was fine with that.\n\nGreat juke (Dead Kennedys, M. Ward, Otis Redding, Sleater Kinney) and a really long functioning shuffleboard table (puts the one at 9LB to shame!) make this a great spot in the mission for a super laid back evening. Lots of board games if that's your thing and a great vibe make this a no brainer when I'm in search of low key drinks in the Mission.", "author": "Katie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-06", "description": "I dunno about this. I think this is where all the bitter, aging hipsters accidentally on purpose wind up after a long night. I honestly can't think of a time I've come here and NOT had someone say something unnecessarily rude to me while falling into a cheap can of PBR. Once, some guy (who was coincidentally pretty fug) tricked me into playing \"guess my age\" and then told me I looked 40 and haggard while he pinched my ass. Um, please read the sign, shut your whore mouth, and get your paws off my Phillip Lim. If you need me, I'll be in the back playing shuffleboard while looking youthful and expensive. Thanks.", "author": "Rebecca P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-04", "description": "I went here sober last Sat night and asked the bar tender for the Sierra on tap. The bar tender said, \"Do you want the Pale Ale or the Red?\" I responded with \"I want the Sierra on tap.\" She gives me a can of Pale Ale. I have never had Pale Ale in a can before, so feeling like an ass if I said anything, I decided to try it. It was awful. I handed it back to her and said I wanted the Sierra on tap, not in a can. She said, \"You need to specify!\" I responded with \"I did specify\" and she just ignored me. I said Can I get the Sierra on tap then, because this is garbage, and she said okay and rolled her eyes at me. Came back saying that the tap was warm. So, all that basically came down to her not giving me the tap beer, because it was warm and blaming me on not \"specifying.\" What happened to customer service? This place is a dive and that lady bartender was not nice.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-15", "description": "Shuffle puck!  Too drunk to deal with anything else, but they had real shuffle puck.  Minus a few stars for the not-nice bartender, but plus one million stars for shuffle puck.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-15", "description": "Growing up, I had one of those healthy moms. You know the type -- gives carob instead of chocolate, serves rice cakes as snacks and requires 100% fruit juice instead of things like Kool-Aid. So it's no surprise that the first time I had Sunny D was an adult in this delicious concoction they serve at Doc's Clock called Trailer Park Punch. Now, I am not one to generally like fruity drinks, but this stuff is pretty freakin additively good and chock full of Sunny D goodness. \n\nOther than that, drinks here are pretty cheap and the crowd is not too annoying. You can actually carry on a conversation in here on a Saturday night. \n\nPlus, as an added bonus, once a month they have a happy hour to benefit animal rescues. Any place that's down with helping animals is all right in my book.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-17", "description": "Best bar on Mission Street. Generous happy hour until 9 every night. Awesome Sunday brunch. Benefits for dog rescue places. Just don't order a Mojito!", "author": "Ethan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "A respectable little dive - drinks at decent prices (and especially cheap beers), dimly lit, some games for your entertainment, and usually a good crowd.  Remember that it's cash only, and it can get packed around happy hour.  But even when it's busy, the bartenders are still attentive and quick to get your drinks.  Close walk to Bart, and a good halfway point between bars near 24th and bars near 16th.  Woooo Doc's.", "author": "Jenna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-22", "description": "This is one of my favorite bars in San Francisco.  Board games.  Dice.  Cheap drinks.  I would frequent this place all the time when I lived in the Bay Area...and it was only a few blocks from one of my buddy's house.  I now live in Brooklyn, but I still do think about Doc's quite a lot.\n\nThey also have a pretty good selection of hard liquor here.  On one particular evening, I was feeling particularly daring.  I asked the bartender to give me the WORST shot of liquor at Doc's Clocks.  Yes.  I asked that.  The barkeep promptly searched in the abyss of a cabinet behind the bar.  He pulled out some sort of Indian liquor...and then he warned me.  My friend and I took the shot.  And...HOLY SHIT it was awful.  But that's what I ordered.  haha.", "author": "Victor S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "I love coming here. They have great drinks for cheap. The happy hour is pretty good and the bartenders are very charismatic. My friend even got her iPhone recharged when the bartender offered to charge it for her while they made her a \"trailer trash\". So nice! The shuffle board in the back is where you want to be once you get a few drinks in you. Oh, and it's a green bar!", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-05", "description": "It is smaller than I thought it would be from the outside. I came in with a bunch of plastered out-of-towners who couldn't go more than a few feet without another beer. It was that kind of night. The bartender was surprisingly pleasant given our sloppy state.", "author": "Jordan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-11", "description": "Had a great time this past Saturday when trying to get out there and meet new people. Played a bit of shuffleboard (go figure - I'm not so bad!). A little chit. A little chat. And generally a good time in a relaxed dive.\n\nHaving said all this, I didn't get the \"chatty bartender\". Maybe his night off. I got the grumpy guy that hates his life. Oh well, the other stuff made up for it and hopefully \"chatty\" will be on the Clock next time.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "the best goddamn bartenders in the whole city. a phenomenal dive during the week and early weekends. and ever reliable cheap drinks and pups to pet. during the winter months, they have plenty of strong hot drinks to keep you warm and buzzin.", "author": "Megan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-05", "description": "People of all genders, sexualities, colors, ages are warmly welcomed here.\nThe drinks are decently priced, well made, people actually interact with people they don't know here and there's no attitude. And, once a month (or more?) they do a benefit for wonder dog rescue, family dog rescue, and other dog rescues (you can bring your well behaved pup here and there's a bed and a bowl of water for it even).....And, you can find parking nearby, or easily walk here from other bars or BART.\n\nFor those of you that don't understand tip etiquette...here's a tip...10% is insulting...it is saying the service was less than adequate. 20-25%, particularly in SF where the cost of living is high and bartenders make most of their money by tips is a good tip. (Or just think $2 a drink...If it's a simple squirt of soda, $1 is good, because it still takes the same amount of energy and time to squirt the soda button as it does to pour from tap....but don't stiff them just because you aren't drinking a beverage with alcohol! They are still working for you!) If you're too broke to tip your bartender, then you can't afford to go to a bar, and need to stay home and drink. Hell, I was tipping $1 a drink in 1989...drink prices have gone up...shouldn't their tips?! If you would like more solid advice on tipping...here's a link http://www.tripadvisor.co.uk/Travel-g191-s606/United-States:Tipping.And.Etiquette.html ... If you don't care, then don't be surprised if the bartender calls you a douchebag, or starts to ignore you...you made your bed. For the most part, I'm treated extremely well by bartenders, because I'm not cheap, and I don't treat them with disrespect. Funny how that works  And before you get huffy about taking to long...stop...look...is there just one bartender, and a whole long bar, with a lot of people? Well don't punish them for that!\n\nEnd of tipping rant...\nDoc's is one of the few places that still has that good, down home Mission feeling that most bars have lost to douchebags...Anyone I've sent here...all different types of cool people, have appreciated that...And there are plenty of good Mexican food, cheesesteaks, and street bacon dogs around!", "author": "Nick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-24", "description": "Doc's Clock is a default Mission spot.  It's large enough to meet friends and have a decent shot at a table.  Other than that, it's a solid Mission bar.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "Great dive bar.\n\nSimple yet serves up some good times for all.  We walked over after a night at the Foreign Cinema.  They had quite a collection of tequila.  A jukebox and a chatty bartender. Everyone one wants for our fav dive bar.", "author": "Rebecca Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-27", "description": "I dig this place - I don't know about it being a hipster bar (aren't there hipsters at pretty much every cheap bar in the Mission?), but they have a great happy hour that goes until 9, so it's my favorite place for a post-6:30-bikram-yoga-class drink.  Bartender is never overly friendly, but shes fast and pleasant and I don't expect her to be mz. chatty w. the guy ordering cheap drinks.  The 50 cent pretzels are stale, big surprise!\n\nIt's definitely picked up in business since I started going there a year ago...one friday night I even passed because there were too many folks there.  I wouldn't spend my whole night here, but for a few drinks it always hits the spot.", "author": "Tmon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-28", "description": "In a wasteland of bars that I would rather blow up, and get incarcerated for the act, than actually step foot in this is actually one I would take the rap for if they blew up some of their neighbors. \n\nI haven't met anyone who said \"Bro\" here. I haven't seen the place infested with people who will mock me because I do not own skinny jeans, footless tights, ironic tees or chucks. I have not overpaid for a weak drink and have not had service that was inattentive despite the fact that you probably get into the triple digits counting your steps from one end of this bar to the other. \n\nAll of that is great, really, but what about this place makes my heart melt?? They have board games, and tables to play them on. Lots and lots of board games. Board games that I can play while drinking since I am no longer allowed do this in my own home because the wicked witch of the west, who has not been laid, well, probably ever, lives downstairs and calls the cops if I sneeze past 10PM. Oh, and they have shuffleboard, and my place just wouldn't be large enough for that anyhow! \n\nIsn't it ironic that at this bar I actually do not have to watch the clocks like I do at home?? I guess that irony replaces the hole in my wardrobe where the ironic tees are supposed to go. Thanks Doc!!", "author": "Drue C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-06", "description": "This is one of the worst bars I have ever been to.  The beer selection is small, the seating is uncomfortable and the service is awful.  I've heard of being kicked out for drinking too much, but I was asked to leave on a dead Tuesday night because I wasn't drinking enough.  Seriously, what the Hell?", "author": "Brandon F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-23", "description": "Woot toot toot. I need to find more places that has IPA on tap. This place will defiantly get my patronage again. Out of all the dives I've been to, all the clubs, and hole-in-the-walls, this place not only had great beer but they have shuffleboard.\n\nThe location is great, spacious and plenty of places to stand or sit. The bar tender was cool and I liked how the bathroom was actually clean for it being a bar. Ladies, you'll have no fear of sitting down at this joint.\n\nAll in all its a great place for great beer and great times.", "author": "Wayne W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-11", "description": "OK, so I'm trying to stick with the Senryu review thing and so I'll say: \n\ndrunk on Wed-nes-day \nthe burritos across the street sound good \nConnect-4 tiles MIA cry \n\neh, it's not working for me. So, instead I'll quote the second best famous person at making the blazer with pushed up sleeves over t-shirt look work for him (after Miami Vice era Don Johnson), the Chicken Lady's cool older brother; Rod Stewart. \n\n\"God I was glad I found her \nAnd if they had the words I could tell to you \nto help you on the way down the road \nI couldn't quote you no Dickens, Shelley or Keats \n'cause it's all been said before \nMake the best out of the bad just laugh it off \nYou didn't have to come here anyway \nSo remember, every picture tells a story don't it\" \n\nLet me put a little oomph of emphasis on that second to last line. \n\nSo come on down and sift through the board game rubble with me and marvel at the stalwart lack of concession to hipness that the jukebox has going for it. \n\nRoll your eyes as I overreact to my cocktail straw being repeatedly lost in my drink because they ran out of cocktail straws and have been reduced to cutting regular straws in half (which just does not work for shit). \n\nAbsorb the unspoken wisdom of their bartenders as they apply Buddha like aplomb to the clientele who refuse to acknowledge Rod's penultimate line of lyrics from \"Every Picture tells a Story\".", "author": "Milk N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-23", "description": "It was love at first sight of the pink neon DOC'S outside and I've been coming for years since.  It's a local bar, a blue-collar bar, a hipster bar, a let's stop in for a shot on our way to dinner bar, a let's take shrooms and play shuffleboard all evening bar.  \n\nPlease do not walk in and expect to pay with your black AMEX card.  Please do not concern yourself with the odor that rises from the back.  The drunk making noise in front will leave soon, or be kicked out.  If you are looking for good clean fun, please plan your retreat back to Union Street.  \n\nThere are good things here for good people, and bad things here for bad people.  And yes, sometimes yes, good things for bad people too.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-31", "description": "Things you can learn at 9pm on a Thursday night in a really cool little dive bar in the Mission...\n\nSuede boots and rain don't mix.\nA stellar jukebox can pretty much make your night.\nDrinks are far cheaper in SF than LA.\nStrong drinks are good.\nCrazy burgundy flower bathroom walls are kinda the awesome.\nOld people on dates are pretty damn cool.\nDogs chillin in bars are rad.\nOh and Shufflepuck is shit tons harder than it looks.\n\nThat is all.", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-22", "description": "This is a nice hole in the wall bar...not quite a dive.  The drinks are strong and they have shuffle board which is a plus.  The bartender that served us was super rude...she flat out said you need to leave me a better tip and then would hover around our group looking for money.  Not cool...I won't be back.", "author": "Lindsey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-01", "description": "lets face it, the mission is like Mecca for douchebags. I usually stick to my local bar on the weekends to avoid dealing with em. As Oscar Levant once said, \"I only drink to make you interesting\" \n\nbut\n\nCarey is the best bartender/owner. She's always having small fundraisers to support local groups like the Barbie Deconstruction Party (for a youth writing group & the bay area oil spill clean up). Next time you're in Docs look for decapitated barbies hanging from the walls.\n\nI like going on weeknights or on Sundays...the douche to nice-person ratio is much lower then.", "author": "chandra g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-17", "description": "Cheap Drinks Cheap Drinks Cheap Drinks. And the staff was very nice and the people in the bar were very friendly, plus plus plus.", "author": "Nicholas A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-07", "description": "Nearly deserted on a Saturday night?  What's going on?  Is it the rain?  The stink-eyed bartender?\n\nBut hey, they've got $1 PBR, $3 well drinks, a juke box, and a shuffleboard.  Hell, with those amenities I can fill the place with my own friends!\n\nSort of.\n\nOk, I can drink dollar beers with two friends and kick ass at shuffleboard.  Still a recipe for a good night.\n\nSHUFFLE-MASTER M TRIUMPHS AGAIN!!!!", "author": "Mari C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-26", "description": "As long as it's not too busy, Doc's Clock is a great generic Mission bar.  I think it's great because it doesn't really have much character of its own; it takes on whatever character its patrons bring.  \n\nThis is not to say that Doc's Clock lacks characteristics.  For instance, it has dimensions much like a skeleton key of sorts, in that there is a long hallway along which the bar stretches, and ends in a rectangular room at the back; and there is a shuffleboard table in this rectangular room and seating for people to enjoy.  \n\nThis is also not to say that Doc's Clock cannot be characterized, because if you asked for such a summary I would tell you that it is a down-home type of place, and that it is generally patronized by reasonable-seeming and reasonable-looking people, and that the pours are strong enough and the prices cheap enough and the help, helpful enough.\n\nBut in the way of things, characteristics and characterizations do not character make, and Doc's Clock remains charmingly generic.  And I like it fine that way.", "author": "Oliver N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-02", "description": "Under my sweater, I was wearing a two-sizes-too-tight plain black tee shirt that says \"I'd rather be masturbating\" that was supposed to be reserved for when the drunker more assholish Rocco came out.\n\nUnfortunately Doc's Clock was like an African jungle--about 105 degrees with high humidity.  So I had to unleash the skin-on-bologna masturbating shirt a tad too early.\n\n:-(.\n\nTwo stars for shuffleboard, and interesting and \"cheap\" drink specials.  Try the sidecar!\n\nSeriously though, put some fans in the back, and this place wouldn't be half bad.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-27", "description": "Stand outside from across the street and take in that sign for a minute. I think this is the single greatest piece of nightlife signage in San Francisco. This part of the Doc's Clock experience is free to boot. One extra star.\n\nOnce you're inside, you'll find some other nice touches, like a very long shuffleboard table and Connect Four. Drinks are reasonably priced and I'm pretty sure I saw a bottle of Basil Hayden behind the bar.  That's the good stuff.\n\nBut be advised that this bar is kind of like MUNI in that it's long and narrow, and there are all different kinds of people in here from marina types to hipsters to crazy people, and they tend to bunch up in spots so dense that you can't shove through while there's plenty of standing room in other places. And late at night the bar starts to shake violently like MUNI* and there are no overhead bars to hang onto like there are on the bus. If they ever start serving cheap drinks on the 38 this place will have some serious competition.\n\n*No one else I've talked to remembers this part. It might have just been me.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-28", "description": "This is a cool bar.  It's dive-y and friendly but not really hip.  The space is really narrow and it gets pretty crowded on the weekend so you may find yourself striking up conversations with spirited strangers as you squeeze by.  It's comfortable and I had a fun time.  I'm sure I'd wander over again, if I weren't completely traumatized from my last experience there...\r\n\r\n[The following story contains comments which may be considered age-ist.  I advise sensitive readers to press Back now.]\r\n\r\n--------Rewind a few months--------\r\n\r\n...I've only been to this bar once and I definitely felt a little young.\r\n\r\nPerhaps \"new\" is more accurate.  You see, I was single for the first time since turning 21 (a few years ago) so the whole bars-and-meeting-boys thing was novel and exciting!\r\n[READ: dating maturity of a teenager.]  \r\n\r\nI met some nice people there including a couple of interesting men (how exciting!).  One, in particular, was about 55.\r\n[READ: danger danger!]\r\n\r\nBut he was really interesting (like a family friend or an uncle or upper management).  Two beers later when he asked me for my number, I thought, \"Well he seems interesting, maybe it would be fun to chat with him again...\"\r\n[READ: light weight.]\r\n\r\n--------Fast Forward one day--------\r\n\r\nI get a flirty text message from old guy and call my friend for sympathy.\r\n[READ: eeewww]\r\n\r\nBut what do I get??  Big belly laughs!  And a lesson about \"my number\" - the first step of some complex romance/sex ritual called \"dating\".  An alternative ritual \"platonic friends\" was quite familiar to me, with the exception of a previously unknown symbol: \"email address\".\r\n[READ: quick learner.]\r\n\r\n--------Fast Forward 2 months--------\r\n\r\nI'm making late night stop at the corner store to get Electrolyte Replacement Fluid before heading to bed.  I pay for my drink, make a little small talk with the clerk, and head for toward the door, when I hear, \"TESSA!\"\r\n\r\n\"Meh?\"\r\n\r\n\"IT'S THE LOVE OF YOUR LIFE!\"\r\n\r\n\"Huh?!?!\"\r\n[READ: looks MUCH older under fluorescents, hardly recognizable...]\r\n\r\n\"Oh wow!  Ha!  You must have had a few too many beers that night!\"\r\n\r\n\"No...\"\r\n[READ: horrified!  These other people in the store INCORRECTLY think I did something dirty with old man!]\r\n\r\nI run home despite him calling after me.  I close the blinds and hide under the covers.  And I blame it all on Doc's Clock.  They must have really strong beer or something...", "author": "Tessa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-25", "description": "Doc's Clock is the kind of place that makes me glad I live within stumbling distance of the Mission.  Cheap drinks, board games which get turned into drinking games at the drop of a hat (my Trivial Pursuit skills get no worse, no better with alcohol.  Win!), a shuffle board, and a good crowd make for a fun night  anytime.  I can walk here, drink my fill, hang out with my friends, then walk/bus home and my total night out is a reasonable $20.\n\nThis place is super laid back and the crowd never sways too far towards any one stereotype.  Definitely one of my favorite hang outs.  The bar can be hard to access as the front of the bar is very narrow, but you can still get served because it stretches out pretty far.\n\nAnd that's all I have to say about that.", "author": "Zhi Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-29", "description": "The one star is for the self-serve water dispenser sitting on the bar so you don't have to wave down a bartender who is just going to give you the stink-eye for not ordering something alcoholic. \n\nPerhaps I went during a particularly unfortunate time (Friday night around 10-ish) but this place was DOUCHEBAG CENTRAL. \n\nGross.", "author": "J N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-01", "description": "... moves too slow most of the time. This place is boring!\n\nBut, it's far less obnoxiously crowded and FAR LESS expensive than 12 Galaxies next door, when I'm there for a sold-out show. \n\n12 Galaxies, which is too dumb to have figured out the no-ins-and-outs rule...\n\nTherefore, by the law of bar relativity, I hereby give Doc's Clock 3 stars instead of 2. \n\n(And to reap its full benefit, I highly recommend you go there on the weekend, after patronizing another annoying Mission establishment.)", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-09", "description": "\"Hey you guys! Let's go to Doc's Clock! They have shuffleboard!\"\r\n\"No! Doc's Clock is where you go to make the night die.\"\r\n\"Oh. No it can't be that bad!!!\"\r\n\r\n\"Hey you guys! There's the shuffleboard... oh... well it's being used.\"\r\n\"Does it smell kinda funny to you here? Like wet mice?\"\r\n\"Well the vodka still tastes like vodka and hey I'm too drunk to care!\"", "author": "Tanya F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-03", "description": "Ended up here since Laszlo was super crowded. The big neon sign caught my attention so had to go check it out. \n\nFor a late Saturday night the bar was not really that crowded. Was able to easily snag 3 chairs to sit. The noise level was not over bearing either so it was easy to have a conversation.\n\nDrinks were good and cheap! \n\nWhat was neat about this bar was the shuffleboard and the LOTR pinball machine. My husband, of course, had to play a few games on it. Also they have a selection of board games to play, which I thought was kinda cool, even though we didn't play any. \n\nOverall nice experience.", "author": "Jenniffer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-30", "description": "Perhaps the retro neon marquee sign over the entrance provides inspiration. Perhaps I never have to deal with the Mission hipster crowds because I drop by at 6 and leave soon after 9 on off nights. But what stands out about Doc's are the fine people running the establishment. Although Erica the bartender may have inspired some of the less useful comments below, she inspires many of us to return with some of the finest service I've seen anywhere outside of a down-home diner in a friendly middle-American Lake Wobegone kind of town. Your needs are attended to, your feelings are smoothed, your well-being is accommodated, and your order is served with a smile and a pleasant voice. It's like being served booze by mom, if mom was twentysomething with creative hair and tattoos (and there'd be nothing wrong with that).\n\nThe bar didn't provide the cupcakes we ate during the last visit, but I feel like they contributed to promoting the kind of atmosphere where cupcakes are served. With beer.", "author": "Matt R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-19", "description": "I had to wait twenty minutes to take a piss, while a couple fornicated in the bathroom.\n\nBut it's not too dirty, relatively uncrowded on St Patrick's day, and they have shuffle board!\n\nI'll come again.", "author": "Crystal R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-07", "description": "A clean bar with cheap, crappy beer like Hamm's and PBR in cans.  They have a pretty good liquor selection, but apparently can't make cocktails as basic as an old fashioned (at least I was refused when I went recently).  Service was otherwise alright, and a Ms. Pac-Man tabletop is always a plus.", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-05", "description": "Good music, nice bartenders, cool atmosphere and a shuffle board!", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-28", "description": "Don't forget the Olympia beer.  Looking for a pool table.  No pool table.  Oh, a shuffle board.  Wow.  Looking for a pool table. No pool table.  \n\nExtra stars for $1 PBRs and the decorative theme of plain white walls.", "author": "greg e."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-03", "description": "\"too busy to make a bloody mary\"???  \n\nI hope this bartender was not too busy to grab tip dollars from her customers!!!", "author": "binh l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "$1 pabst specials. $2 cans of Olympia (memories of college drift back to me), a list of hot drinks, and shuffle puck. All great things about Doc's Clock.\n\nI like how the mirror has all the specials randomly displayed on homemade signs. It always helps me decide what I want to order. This is a great place to keep on hand, when you want an inexpensive place to chat with your friends.", "author": "Netty L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-12", "description": "Saturday night:\nI go to a show at 12 galaxies...\nIt is so fucking hot in there that my friend and I go next door for a drink....mmmmm gin!\nWhile my friend is in the restroom...a lovely, cleavage d, blond comments on my hat (my friends hat resting on my head for a moment)\nShe said:\n\"Nice hat and I just cock blocked my sister!\"\nI said: ummmmm...why?\nshe said: \"I'm a lawyer...blah blah, cock block, blah blah, my sister is mad, blah blah\"\nI said....well...at least you have a nice rack and it won't take long for another cock block opportunity to come along\"\nIt was a great night!", "author": "Elina D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-03", "description": "If your pants are so tight that they've squeezed the sense right out of you, perhaps you'll like this place. Doc's clock is purgatory for the non-hipster crowd. The juke box is loaded with painfully pretentious and rightfully under-appreciated bands. They have board games in case you get bored, and of course, they have everybody's favorite game shufflepuck. Who invented this asinine game? Is this Canada's fault? Let's take curling, shrink it down, and put it in a bar so drunk morons can agitate everyone else within earshot. No wonder the bartenders here are such assholes.\n\nBy the way, don't ask the bartender for change. l needed a quarter, but only had 2 dimes and a nickel. I asked the bartender for change and she looked at me like I had just shot her mom. She then self-righteously informed me that she had no use for 'that', turned her back and walked away. Terrible", "author": "Dan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-09", "description": "recently checked this place out..sad that i never made it when i lived in walking distance. \n\nall around its cool as fuck. weeknight of weekend.\nthe bartenders were on top of our drinks, chatty and really loved what they were doing.\n\nits the right price in an area where all the douches come out on the weekends hipster and idiot free!\n\nso hipsters and idiots stay away!", "author": "dawn a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-27", "description": "This is a good pit stop on Mission, as there is a little void of bars between 16th and 24th, with a few exceptions. The mixed drinks here surprisingly are also really good.  Cheap beers on tap. I think some for 3? Can't remember for sure... Clean place too....", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-24", "description": "They have Root! If you don't know what I'm talking about, go to Doc's Clock immediately and ask for Root with Ginger Ale. You won't be sorry.", "author": "Allison S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-26", "description": "Strong drinks, chill, shuffle board, chill crowd...good local dive bar.", "author": "Emy s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-06", "description": "Time was, Doc's Clock got more 911 calls than ANY other dive in The City. That was years before I made out with a girl in the john (the jane if the ladies?) or drunkenly fell ass over teakettle at the bar (meant to do that).\n\nI love this place Sunday through Wednesday when it's just a rocking neighborhood bar. But ever since Foreign Cinema opened, at weekends it becomes a waiting room for bridge and tunnel slummers to knock a few back before their foodie frolics.\n\nNo jukebox. Good lighting. I really hope after their remodel they retain the glass brick facade. Also, El Rio needs to take a page from Doc's book as regards non-pain in the ass shuffleboard table placement. \n\nThe best times I ever had here, beside the ass over teakettle episode, were the Chimay Cheese promotions. Chimay makes cheese from their beer, like three kinds, and they brought in huge wheels of the stuff, apples and french bread to choke down on the free with $4 Chimays. Woot!", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-17", "description": "Free shuffleboard and Happy Hour until 9pm, even on Saturday! \nThey also have board games ready for your drunken playing pleasure.", "author": "Adriane K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-13", "description": "The $2 cans of Olympia are nice.  As is the happy hour that lasts until (I think) 9pm.  My favorite aspect of Doc's Clock, however, are the guaranteed, awk interactions you'll have with dozens of people in regards to the shuffleboard table.  If you want to play shuffleboard, be prepared for a lot of finger pointing, dirty looks, and confusion.\n\nEDIT:  Uggghhh.  If you're the a$$hole that we almost had to fight to play shuffleboard here on Sunday, October 14, 2007, you can seriously buttsecks yourself.  You might be the world's biggest doucheflame.  You know who you are.", "author": "Sam P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-26", "description": "$1 PBR till 9pm happy hour is so freaking sweet. Add some shuffle puck and your in like Flynn. Great place to get started but the fact that it's apparently a lesbian bar means non-coupled folk will probably have to migrate before the end of the night, hence the one star lost.  When we went last weekend Frank Chu stopped by and was having some very eccentric conversation, as he's known to do. Seriously great place to hit up, but I'd BYOG (Bring your own group/girls)\n\nBest Punk Jukebox in the city. They have Gogol Bordello, seriously that alone is worth a visit, Yelpers trust me when I say. Go inside, order either a PBR or Olympia (oly in a can!), leave your license with her after she checks it, pick up some shufflepucks, head to the jukebox, feed it 5 bucks and play Gogol Bordello's whole album.  A great night will ensue. Also they have more than punk so mix up the tunes after that.", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-21", "description": "We owned this bar.\n\nWe owned the poor suckers who dared challenge us to a game of Connect Four.\n\nWe were on top of the world.", "author": "Beth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-27", "description": "Maybe it was the joy of the carnaval parade outside that made me overlook the smell of ass that pervades the back of the bar, but I had a great time at Doc's today.  \n\nI don't usually drink bloody Marys, but since I hadn't had lunch, I figured I should get my veggies while getting my drink on.  Two drinks later, I realized that I like them more than I thought I did.  Moving on to margaritas (it was carnaval, after all), I also thought that drink was great.  Normally, I'm a beer drinker, but it was definitely worth passing up on just beer.  Oh wait, I had beer, too.  \n\nNo wonder I forgot about the smelly bathrooms.\n\nI will be back to play shuffleboard - a highly-underrated sport.", "author": "Surf R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-09", "description": "Doc's Clock has a great, retro vibe...kind of feels like stepping back in time. Drinks are cheap and strong...just how I like them! Crowd was great, too. \n\nCheck out their Sunday night specials for really great deals...", "author": "Brianne K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-26", "description": "Ok bar.  Basic hole in the wall neighborhood bar.  Nothing special but good.  One bartender, lots of people and he needs some help!", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-17", "description": "Too bad we didn't make it to Doc's Clock till the very end of the night on our last night in town- even though it was across the street from our hostel the whole time!! This was the bar we were looking for our whole trip- divey, cozy, seating, board games, and good strong drinks. I don't even know how much money I spent here- that's how strong the drinks were. \n\nEveryone was really friendly, and there seemed to be some sort of shuffleboard-off in the back while we were there. I also really liked the back-lit bottles of booze lining the lower part of the wall- it made ordering easier for the slightly blurried-eyed with booze patron (namely, me).\n\nAlso, when we ordered 2 red-headed slut shots, the bartender screamed (over and over) \"where are my sluts?\" until we pushed our way back to the bar. Which I found endearing.", "author": "Tori B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-07", "description": "What?!  You don't open until 6pm?  But 5pm is quittin' time!\n\nI was pretty disappointed to find Doc's Clock's doors chained shut shortly after rounding up a small group of thirsty coworkers for a nice cold (cheap) one.  I had gone on and on about how great DC's happy hour was and how there's a juke box and games and shuffle board!  Cool, right?!  Unfortunately, I didn't even think of the possibility that they'd be closed =(  wah, waah!\n\nUntil next time Doc's Clock...", "author": "Nicole N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-07", "description": "Shufflepuck!!!\n\nAnd Trumer Pils. And a really nice crowd. I've made really good friends there. \n\nI'd hate to be the bartender on slow nights because you have to hail a cab to take you from one end of the bar to the other. \n\nThe girl's bathroom is a little unsightly and too well lit. They should dim it down in there. We always look better dimly lit, especially while drinking.\n\nAnd I wish they'd get the shufflepuck scoreboard working again. That thing is a relic, but awesome. \n\nBut shufflepuck in my 'hood? It will keep me coming back.", "author": "Rachel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-04", "description": "Good place to drown your sorrows in cheap pints of PBR (from the tap!).\r\n\r\nCan't say I love the music selection played at ear-splitting volumes on some nights, but that and the eclectic Mission-type clientele gives it a good divey vibe that I've come to enjoy.\r\n\r\nIt's the unpretentious, \"come as you are\" kind of place where you can nurse your drink without people f'n with you.", "author": "Bono B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-17", "description": "Doc's Clock isn't my favorite bar by any means, but the thing is, I had one of my favorite nights EVER there...which in part was due to the bartender. This is why I'm giving the place 4 stars. \nWent after band practice to meet a dear friend's sister, who was in town from Chicago. It was low-key(oh, how i love low-keyness), not too busy...we were having a great night. I wanted to get a second drink, but had no money,  the friend had no money, we didn't want to ask her sister for some cash... we were bummed.  The bartender senses our need for another drink, tells us this one's on him...no worries. Just like that...he gives us FREE DRINKS. Do you know how much free drinks mean to me??\nAnd this...dear friends is why I love Doc's Clock.", "author": "Joanna R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-27", "description": "Cheap beer.  Check.  Standing room only.  Check.  Wasted on $10.  Yep.", "author": "Bibi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-18", "description": "Doc's can get a bit packed and rowdy on the weekend, but should be your destination spot for Tuesday nights. $1 PBRs (draft, mind you, not cans) starting at 6PM and going until... I have no idea.\n\nThe problem is we always get too wasted by the time 8PM rolls around (which is stuble-to-random-Mission-burrito-place-time). Maybe it's $1 PBRs all night long. Grabs some beers, form a couple shuffle board teams, and have a great night.\n\nOh they also had a special of $3 non-PBR drafts, and $2 shots of some liqour I have never heard of before.\n\nAnd a confession... I spilled my beer in the sandpit of the shuffle board last night. I am sorry, Doc. I dried it up as best I could with napkins.", "author": "Trey F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-22", "description": "Good ol' Doc's Clock (more like Doc's Glock am-i-rite?)... laid back and has crazy redneck drinks (Trailerpark punch is girlfriends favorite), also, they have Olympia beer!\n\nThey have the worst sound system in the universe, but I really don't care. At least you can have a conversation here unlike *cough* casanova *cough*. \n\nAlso, I'd like to add that the space freakishly elongated, seriously, it feels like I'm drinking in a damn hallway!", "author": "Jesse S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-22", "description": "1 Dollar PBR\r\n *1 DOLLAR PBR*\r\n  **1 DOLLAR PBR**\r\n\r\npretty average little bar, but they have pbr for abuck until 9pm every weeknight.  I know, I know, it's just pbr.  Haven't we aged to the point where we desire more sophistication in our libations?   No.  Not for 99 plus 1 cents.\r\n\r\n-------------------\r\n- pretty quiet almost every night\r\n- I agree with thadd l. that coming with a big group is more fun because you dominate the scene\r\n- they also have connect 4 and some other wacky bar games\r\n- bartenders are friendly\r\n- never heard the lesbian bar thing, but maybe that's because I'm deliriously lost in my pbr happy place.\r\n- did i mention these are not cans of pbr, but pints?", "author": "Jonathan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-23", "description": "Chill, small place. We got the 360 Vodka with cranberry and grapefruit, and the alameda ass (it had sour and ginger ale in it and something else). Both drinks were very strong. Bartender was friendly.\n\nThere's a good happy hour on Sunday.\n\nThey only accept cash!!!!", "author": "Angela H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-05", "description": "Parking for my friend's car after endless circling: $15, split four ways.\n\nPints of Anchor Steam: $4 x 2.\n\nPlaying shuffleboard with a bunch of cute boys: priceless.\n\nI like this bar.", "author": "DD B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-24", "description": "I was there the same night as Beth L, and had an equally good time...  We strolled in with mullets, mod wigs, and tiaras and shut the place down in the wee hours. Pretty awesome that a bar allowed us riffraff to run amok as we did. And our bar tab wasn't too outrageous either.\n\nside note:Dave H. and I positively whipped Beth L. at Connect Four, don't let her tell you different.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-17", "description": "Yet another Mission-bar-turned-psudo-intellectual.\n\nUsed to be cool until the Guardian does their annual \"Best of the Bay\"\n\nI guess it is still cool, depends on the crowd. If I look in and see a few people I know I'll stop. There are better places to go in the Mission.", "author": "Danny S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-07", "description": "My internal thought process when evaluating Doc's Clock goes something like this:\n\nDo you want to hang out in a place that smells like a big port-a-potty?   \"No.\"\n\nWhat if the port-a-potty has shuffleboard?  \n\"Hmm... not really.  If I have to go to the bathroom, though, it would be pretty cool to play shuffleboard while doing it.\"\n\nThere will be a lot seedy characters around, and no, the shuffleboard table is not actually reachable from the toilet. \n\"Well, then... negative.\"\n\nBut for the occasional seedy character with great taste, there is Chimay on tap.  \n\"I'm confused by convergence of all these positives and negatives into one bar.   Please stop.\"\n\nI really don't know what to make of it, so I'll average everything out to 3 stars.  It honestly does smell like a toilet within a 50 ft radius of this building, though.  Girls, if you plan on getting a kiss, take me somewhere that smells prettier.", "author": "Joe K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-24", "description": "For a place that's supposedly lowbrow and divey, they have a really impressive selection of bottled delights. Luxardo! Pimm's! American Honey! CYNAR!!! Of course, when it's packed on a weekend night, the bartenders don't have time to mix a schmancy cocktail, but it gives the place a totally unexpected secret touch of class.\n\nAlso, they carded me. Yeah, baby!", "author": "Fawn F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-04", "description": "This place was crowded and noisy, so we decided to go in.  There wasn't much room for us in front, so we decided to make our way to the back of the bar.  After \"excuse me\" and \"pardon me\" all the way down the long bar, we realize the back of the bar is hotter, smellier, and the shuffleboard table is taken.  Boo. \n\nI didn't think this place was anything special, and I'd go again if it were 2pm on a Saturday and I had to play shuffleboard to save my life. :)  Nothin' special.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-29", "description": "Something about this place just feels right.  Maybe it is the smell of the shuffleboard powder, the odd diner feel or the really long mens bathroom (that does not seem to have a lock).\n\nWhatever it is.. it's evil.  It makes me buy everyone shots of Jim Beam, and I don't even LIKE Jim Beam!!!\n\nHang out there for a few hours some night and watch the ebb and flow of the crowd.  You're bound to witness something good.\n\nIt can get pretty loud so it's better to go with a group than just a date, unless you're both really into watching people or just making out (in which case Supperclub is where you should be!)\n\nCheck it out, and if you see me there buy me a shot of Jim Beam.", "author": "Kyle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-08", "description": "On a Sunday at 10PM, we had the entire bar to ourselves (there were folks in the back). They let us bring in slices and tacos, though they had set out PB&J, a knife, and Pabst Blue Ribbon toaster on the bar. B&W film on screen; Chimay on tap; cute dog on patrol. 'Nuff said.", "author": "Faith A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-19", "description": "This place always has a good amount of people in it, the bartenders are attentive and on their game, and speaking of games--\nthey have board games like Connect Four here to play as you get trashed.\nI love this idea, although sometimes it's not easy to get access to a table for gameplay.", "author": "Light Bulb J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-20", "description": "Cheap PBR ($2). Expensive quality beer on tap ($7 for Duvel). \n\nClientele varies from friendly and interesting to boring and drunk. \n\nWould be a 2-star if not for the awesome shuffleboard!", "author": "Rene R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-21", "description": "More than its compatriots The Attic & The Latin American Club, this place emphasizes the *dive* in hipster dive;  PBR specials, for instance, are displayed prominently.  Our group instead opted for the Trailer Park Punch (it's got, let's see, OJ, purple stuff, and...alright, Sunny D!)--I think we probably drank 20 of them by the time we left.\n\nThis place has two other prominent features that confirm its true hipsterness: the first is the shuffleboard table (sweet!).  The second is the booby-trapped jukebox...seriously, you have to be the Indiana Jones of jukebox heroes to get through it unscathed.  If you get lured into the Ramones, it will probably set off a silent alarm, so choose wisely.  If you want to play it safe, stick with the hipster Green Zone that is Velvet Underground.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-21", "description": "Great dive bar!  It can be unpleasantly crowded at times.  Also, when I was there last there was a nasty smell coming from the bathroom which had emptied out the rear of the bar.  Great selection of cheap beer, including $2.50 PBRs, $2 Olympia cans and Chimay on tap.  I can't remember the last time I bought cans of beer at a bar, but it was very fitting of the place.\n\nI like that they have board games, but I feel like I'd be judged if I ever played them there.  Shuffleboard seems cool- I never played before, but now I know where I can learn.", "author": "Jeff A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-03", "description": "Have you ever experienced that awkward feeling of being in the Mission and not wanting to dance or stand up and talk to semi-drunk people wearing fedoras and smelling of Parliaments? There aren't many options in this neighborhood for that type of situation--most Mission dives are loud, sweaty, and scene-y. Not so at Doc's Clock. It's one of those refreshing Mission bars with actual seating, a tolerable noise level of interesting music, inexpensive drinks, shuffleboard, and the occasional dog. (Watch your step!) I dig. It's nothing dazzling, but sometimes you need that.", "author": "Stefanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-15", "description": "Going along with Meredith R's review (since she was my date for the evening), all I have to say is, \"Shut your whore mouth!\" hahahaha I was tempted to jump over the bar and steal this sentiment right off the wall. Another great one was, \"I love juggs.\" LOTS of laughable reading material for your inebriated eyes. \n\nLoved this establishment. It was the perfect precursor to an eventful evening.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-01", "description": "One day,..Way back when, I stepped off the Muni @ around 20th and Misssion; Everything and everyone looked dangerous and unclean, I spotted Doc's Clock!! Immediately upon entering I knew everthing was going to be allright! They had,..Old Crow in the well!! The rest is History!", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-07", "description": "Had an event here Saturday...These people are AMAZING! The bar has so much going on and I love Puka the former race dog :)", "author": "Katrina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-21", "description": "great prices on beer especially during happy hour.\n 1great pinball machine and  awesome shuffle board\nlots of fun", "author": "michael d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-04", "description": "Scrabble: check\nConnect Four: check\nShuffleboard: check\n\nAdd \"Chutes and Ladders\", \"Twister\", and Stella on tap and they'll get a five star rating.", "author": "Jay B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-01", "description": "One word- Shuffleboard.\nI come from the middle of America. We actually have these things in a lot of our bars in the mid-land of America. And I must say- it tickles the shit out of me when i can come into a bar and beat the hell out of the Chicago-land, NYC, So Cal trust-fund hipsters at the almighty shuffleboard!\nThank you Doc's Clock. Truly, I am in your debt.\nAlso, you have good, strong drinks.\nI spent my 30th birthday kicking young-en's asses. A birthday well spent, as I am a bitter old lady now.\nIt also has really weird deco vibe, which I like. \nI can stand the hipsters- as long as they want to play shuffleboard with me...hahaha suckas!!", "author": "shannon t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-27", "description": "It's a good vibe, the hand shuffle board is lots of fun, but it ALWAYS smells like urine. And not just by the bathroom, unfortunately -- one star off for that.  But despite this hardship, we've had many a good time here", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "So I've been to Doc's Clock before. It's a cool dive, but what I'm TOTALLY digging is \"Doc's Cold Remedies\" which is a list of hot temp alcoholic drinks. I had their apple cider, which was like an adult holiday drink--totally boozy and delicious. Buuuut their MAKER'S MARK hot chocolate (and I emphasize Makers Mark because that's my favorite.liquor.evarrr) was SOOO good. It was like the two best things in the world--chocolate and Maker's Mark--came together to make LIQUID AWESOMENESS. Cold weather or cold-flu, I would drink any of these creations any day. *love*", "author": "Alex H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-18", "description": "Cheap beer and connect four? \n\nBrilliance.", "author": "Krissy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "Get your cheap drinks here!  Quite a few beers on tap and great mixed drinks for no more than $4.  Also stumbling distance to a bomb taqueria.  \n\nShuffle board: +1\nBoard Games (I swear, next time I'll be coherent enough to play): +1\nCheap drinks: +1\nDive bar atmosphere: +1\nDive bar bathroom: -1", "author": "Kathleen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-19", "description": "A Great Bar!  What a Mission bar should be - good folks, good booze, great atmosphere, and good prices.  What its not - foofy drinks, trendy, or Marina d-bags looking to \"slum it\" in the Mission.  This place kicks ass, takes names, and has got shuffleboard to top it off!  Love this place!", "author": "Mo P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-16", "description": "When I'm out with Friends drinking I like to have some kind game or contest. I think it's hilarious to watch people get more and more competitive the drunker they get. This place has a 30' long shuffleboard table and several classic games you can play like trivial pursuit, connect 4, etc in the back. \n\nTip: Order a Phil Collins and see what you get. It's the house specialty.", "author": "Nate S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-21", "description": "Very standard bar.  Not that it is bad.  Just so typical.  I mean, ok, you are in the mission and you have a dirty bar with mis-matched tables/chairs/stools and some PBR in a can. Wow.  No great tunes.  No pool table and only an 'ok' shuffle board.  In this area you have to do something different.\n\nthe best time to go here is with 10+ people because you will own the bar, it is dead just about every night.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-02", "description": "Sometimes it's stinky, like a half-heartedly sanitized dive bar bathroom is, but it's totally worth it for the free shuffleboard and pretty cheap drinks.  I don't know what that says about me.\r\n\r\nUpdated 9/26/06: Ok, seriously? I have decided this is my favorite bar in the city.  Judge me as you will. Ditto the above reasons, plus add that the crowd is generally a great bunch.", "author": "Shannon V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-18", "description": "Tuesday night this place smelled like raw sewage that had been in the sun for a month, I couldn't even go past the front door. Whoa...\nUpdate:\nThe staff are really friendly, the place is much sweeter smelling since last time. Good selection of beer on tap.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-16", "description": "Good place to chill at after some burritos down the street.", "author": "Jorge H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-13", "description": "The sign out front said PBR 2 dollars.  I ordered one, she said 3 dollars.\n\nI was pretty cranky after that but I tried to shrug it off and hang out with some Meet Uper's and Yelpers and all in all, it was a good time.\n\nThen they ran out of PBR and a few of us got a little upset, but you know as adults, we tried to not make too much of a scene.\n\nThey have a bunch of board games there which I didn't get to play, but if I go back I probably will.  I am a rather mean scrabble player.\n\nI recently had to deal with some cat pee drama and it has quite a unique smell.  I don't know why but Doc's has the same odor in it.  \n\nBut since when are Dive Bars supposed to smell good?", "author": "Adam C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-16", "description": "I like pink lights.  I like it when the people I came with are the only people in the bar.  I like a bar with a good selection of board games.  I like that I don't have to refill my own Singapore Sling while playing Scrabble.  I like that I didn't even see shuffleboard and was still a happy camper.\n\nHence, I like Doc's clock.  I made myself thirsty, let's go get a drink.", "author": "Beth V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-14", "description": "All I can say about Doc's Clock is this: I like a bar that is just a bar.  This place is narrow, its mildly grimy and poorly lit (in other words perfect); its rarely too packed to get a drink and service is generally pretty good.\n\n*personal note* I'd give it a sixth star if I could because they have Oly in a can.  I'm new to the city, but so far this is my favorite bar in SF.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-20", "description": "Another great MIssion bar. We stopped by there after the Prince concert and met up with some friends who had been drinking all night; we had a couple hour booze break at the concert so there was some catching up to do, and boy was the bartender helpful in that endeavor: Shots and Stellas--yummy. Last ones to leave, and I was so buzzed I invited our wasted friends over to our house. One broken glass and a red cosmo stain on the wool rug later, I kicked them out 3:30. \n\nHey it isn't fancy, but the people are real and drinks are strong.", "author": "Deborah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-25", "description": "Cheap drinks + chill crowd + quick service, makes me a happy chica!  I'm always a fan of kickback dive bars, that have cool people and enough room for me to stand or sit.", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-03", "description": "I have this really funny story involving a rainy night  and an old dude of mine and this bar. I will not tell this story.\n\nDocs is aight, I mostly just come here to use the bathroom if its too long of a long at 12 galaxies(SHHH DONT TELL NOBODY).\n\n\nahhhh the story of the rainy night, ill tell you when you are older", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-09", "description": "I'm not sure why a bar would smell like cat pee, but the fact that that didn't take away from the great vibe this place gives off says something.\n\nArt deco meets retro meets swinger meets punk atmosphere. \n\nThe drinks are cheap and good. The people there, especially the bartenders are incredibly friendly and the music fit the mood of the place...eclectic yet almost not, but definitely fitting in with the decor.\n\nSpeaking of the decor...I loved it ranging form the bottles along the back to the ironic 70s beer ads. Everything looks like it belong in a non-contrived way.\n\nWhen it's empty, it's a great place to bring someone to talk...when it's full it's an even better place to absorb the atmosphere and people watch. \n\nThe only downside is that they don't take credit cards. To make up for it they do have an ATM in the back.\n\nGo!", "author": "Paul W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-20", "description": "This place does not have \"hipness\" or even \"chicness,\" but it is really cool. It is this huge bar in the Mission, with tons of interesting people and activities.\n\nI went with some friends after dinner and we had a great time. We played connect four, some other game, and shuffleboard. Shuffleboard was the best. The truth is, the bar is big, so they can fit a cool game like shuffleboard inside.\n\nThe drinks were cheap. Eight dollars for a beer and a well. Not super cheap, like happy hour cheap, but still a great place for the now \"trendy\" mission district.\n\nThey even sell Halloween-size candy in a little machine for $0.25, which I liked. I love chocolate and I love machines from the 80's, which this was. If it steals your money, the bartender will give you more quarters.\n\nIt's a great place, a little hidden, a little bit of a dive, but super cool. You should go with your really cool friends and you will have a great time. It gets a five because it's my new favorite \"local\" bar.", "author": "Christopher W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-11", "description": "Shuffleboard. Board games. Frogger (only if it worked, the code still made a pretty awesome tabletop). Cheap drinks. All in all a winning combination.\n\nJust turn down the lights.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-06", "description": "Typically a bar doesn't sell PBR if they sell OLYMPIA.  Well this shitty dive bar does and for that it will be forever in my heart!\n\nOh by the way, I'll kill anybody in shuffleboard under any rules!", "author": "Justin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-13", "description": "It's a fun laid back bar with a good bartending  team. Affordable prices and fun holiday drink menu. Peppermint Schnapps & hot coco? YES!!! Just a nice chill place to end the night!", "author": "Marissa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-18", "description": "Thursday night HH will knock you out. Maybe it's every night hh? Idk, but I had fun. Pretty decent selection on the Juke Box! And I LOVVVEEE playing shuffleboard...not too many well sanded ones in this city..note: it curves to the right!", "author": "Krystha B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-22", "description": "Walking down Mission Street I was amazed by the activity in the street. The Mission is always busy on Friday nights but I've never seen it quite like this! Crowds of people of all ages cruised up and down the sidewalks. Parents escorted their costumed kids from storefront to storefront trick r' treating, which a motley flow of folks dressed in work attire or their Halloween best zipped up the 24th Street BART station's escalators on their way home or ready to hit some Halloween festivities. The mood on the street was both spooky and joyous on this windy autumn night.\n\nThe bar de jour turned out to be Doc's Clock and I knew right away that it was a good find. I was greeted at Doc's Clock by two women dressed in black handing out candy to the continuous stream of kids. With knickknacks and tchotkies adorning the walls, Doc's had a distinct trailer park feel with an extra layer of Halloween décor. Settling into my seat I selected a Big Daddy as my beverage of choice.\n\nFor more check out http://www.missiononmission.com/2008/11/docs-clock-2575-mission-street.html", "author": "Gadiel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "After a long day, I like to have a drink or two (maybe even more than that) to unwind and relax. Doc's Clock has that calm and friendly vibe to it which I like. It doesn't get overly packed and the crowd ranges from young adults to the middle aged. Every time I've gone, everyone is extremely friendly.. including the bartenders. They are always cheerful and attentive. Their sort of like specialty drink is the trailer park punch.. it's a must try. It's only $4 bucks and it's super delicious. \n\nThe first thing I remember noticing about this bar was the four foot tall unicorn head bottle of booze... with the sign referring to it as \"unicorn pee.\" Where can you see that at?? It's awesome. Not to mention the shuffle board and the old school video arcade games. This is definitely by far the best dive bar I've been to. \n\nLast thing, if you get the munchies for some bomb-ass mexican food, El Farolito is literally two blocks down. Booze + Burritos = A good time. :)", "author": "Rosa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-05", "description": "I don't even really drink but I loved this bar! Why? Plenty of places to sit, a dog named Henry, and board games!!", "author": "Conny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-26", "description": "Went on a slow night but the mixed group of folks were cool and the bartender was happy to serve up anything I had in mind. I'll be going back when it's rowdy.", "author": "Wilfred C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-07", "description": "Went to Doc's clock several times and had a great time. First time the morning after was a little painful but that is what follows a fun night. Cheap drinks, and definitely a place with character.  Staff is friendly and easy to become a regular and enjoy a beer or 10 after a hard day of work. They allow food from outside and host Thai. They also used to host tapas on sunday nights", "author": "Candido B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-15", "description": "Doc's Clock...what a San Francisco gem.\n\nLove a bar where there are other things to do than drink beer and shout at your friends trying to have a conversation.   Great date place...you can get some one-on-one time thinly disguised as a \"game\" called \"shuffleboard\".   And, for those with a competitive tendency, added bonus.\n\nDefinitely a hipster bar, and definitely a bar with \"shuffleboard regulars\", so be careful who you challenge to a game; I've seen some pretty incredible spin moves here.\n\nMinuses:\n* very limited selection of beers on tap\n* on Fridays and Saturdays it gets really crowded and hard to get on the table (but its fun to just watch sometimes and heckle)\n\nGo early on a worknight with a few friends and your likely to hold table until around 9:30-10pm when the regulars roll in (you'll know them by their swagger and the PBR or Tecate (and the occasional Chimay) in hand)", "author": "aekta s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-31", "description": "Anywhere with PBR gets an automatic 3 star.\n\nA nice mixed crowd, actually really fun mixed crowd.\n\nFelt the place had that really pleasant not trying to be anything more than it is charm.  \n\nAttentive bartenders who won't coddle you, but who cares. \n\nWorth a visit.", "author": "E C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-26", "description": "Very fun local bar in the Mission! Lisa is an AMAZING bartender she is fun, funny, fast and a joy to be around she is the reason to go to Docs! I LOVE LISA! Go see her she will make you smile.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-16", "description": "Doc's Clock is the best no nonsense bar in the Mission. I always meet the nicest people/ prices are good/ emphasis on local brews/ games/ cute pictures up in the bathroom...I love this place.", "author": "L T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-16", "description": "The door dick is a dick.  At least this time, I remembered why I don't come here before I got in.  I wanna meet him in a dark alley.", "author": "Emilio O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-31", "description": "I've only been here on Sundays for Three Papaya's Brunch. I enjoy the staff very much and the food is amazing if you aren't a veggie. They do have a really amazing green papaya salad for veggies though.I take all my friends/couchsurfers here when they visit the city.  I love the atmosphere and staff. Also lots of games to play with your friends or strangers in the bar.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-21", "description": "I know bartenders have a tendency to come and go, but I hope the ones I had are there to stay, they were awesome. Also, shuffleboard and cheap beer rocks my socks, I will be back in due time.", "author": "Matt F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-26", "description": "With Jason K as my best friend and stylist, I tend to leave the house looking like a two bit hooker when we hit the town. I can honestly say that if you're going to spend an hour taping your sluttiest dress to your chest and applying flawless makeup, Doc's Clock is not the way to go. I never felt like my looks and my legs were more wasted than during the two hours I spent here. I don't know much about this place (I was three sheets to the wind when we arrived) but I do know this: it is too narrow and too crowded to navigate in 5\" stilettos, the bathroom lines are too long to comfortably wait in in 5\" stilettos, the crowd isn't attractive, and the drinks aren't strong enough for me. Still, it didn't suck and I've spent a lot more time in much worse places. Plus, it's a decent choice if you happen to be in the Mission. Just wear sensible shoes.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-06", "description": "I love Doc's Clock! And no one loves it as much as I do. I have had some amazing good times here, but my favorite is one night when I was super sick and dragged myself in, wanting to say goodbye to a close friend who was leaving for the east coast the next day, and when the bartender asked me how I was, I was honest and said fucking miserable. He immediately made me a hot toddy in a pint glass, without even saying anything. He promised it would make me feel better. And it did! It was a beautiful, pure moment that only could've been possible under the pink lights of Doc's Clock.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-02", "description": "Yeay for their $2 beer specials.  All day everyday.  The beer pong table is interesting to watch as well; however I wouldn't dare play on it for fear of contracting any hipster transmitted diseases.", "author": "Ivy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-09-25", "description": "Definitely my kind of bar. Very mellow on all counts, not too loud, good drinks, not too crowded and not too hipster pretentious, either. It's this nice narrow bar and you never have to fight for a drink. Shuffleboard is kind of a cool novelty to have in a bar, although you have to wait forever to even get a spot on the table. Just an all around nice place, I can't believe I don't go here more often...", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-05", "description": "Dog friendly to the point of donating its happy hour proceeds to on Friday Wonderdog rescue. Speaking of happy hour - a beer and vodka tonic for $6?! YES.", "author": "Mirabella Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-27", "description": "doc's clock rocks!  \n\ntheir amazing happy hour hours (6-9p) and shuffle board knock my socks off.", "author": "jane d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-02-03", "description": "A true Mission hipster bar, it's good for drowning some sorrows. They have a great shuffle board table in back as well.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-25", "description": "did i really stay here til 1:30am last night? this bar is your run-of-the-mill mission district bar. so many freaking hipsters. drinks are cheap, but it's cash only. they have shuffleboard, pinball, and an old school jukeboard to give it some character. it can get a bit crowded. really, it was just OK. there are better bars in the mission!\n\npersonally, i was more interested in going next door to the blue macaw but we didn't want to pay for cover...damn. next time.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-19", "description": "Definitely a dive bar.  The sink in the men's bathroom was filled to the brim . . . with vomit.  All in all, pretty hip.", "author": "Khurram N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-05", "description": "a bar so long, that stretches across the room\nand it beckons, offering multiple second chances\nfor you to stop by, rest an arm atop the counter\nand order glasses after glasses of $5 whiskey", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-23", "description": "meanest doorstaff ever. gosh, bitch, sorry i don't live up to your cool-factor, but you don't have to lie -- bitch said my ID wasn't valid because it wasn't from California. NICE.", "author": "Amy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-11", "description": "Again, automatic 4-stars for shuffleboard. Pretty damn good besides.", "author": "patrick g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-03", "description": "This place is NOT SAFE.  A bartender here, \"Antonio,\" tried to pick a fight with a friend of mine here, walked outside and repeatedly shouted at my friend to goad him into coming out to fight him.  The bouncer did nothing about it.  The owner of the bar, a dimunitive woman, told the bartender to take a \"time out,\" which she explained was her solution to the problem because she couldn't tell who started the confrontation.\n\nSo to be clear: Her employee was shouting at a customer to come outside so he could BEAT HIM UP.  And both she and the bouncer refused to act.  The bartender is still working there.\n\nThis place is really dangerous.  Do NOT COME HERE, especially if you are a girl.", "author": "Donovan X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-19", "description": "Maybe it was the tequila, but I had hella fun at this little mission bar a couple of weekends ago.  Next time I'm wearing a white tee shirt cause this place has that feel -like- there- could- be- a- random- wet- t- shirt- contest- but-in-a -hot- way- not- a- spring- break- way kinda feel.  Ya know?", "author": "Claire C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-02", "description": "I love this place!  Why have I never been here before?  Maybe it's something about the pastel neon sign outside that is somewhat offputting...but HEY it keeps the bridge/tunnel peeps at Medjool out and the hip hipsters at bay.  That alone gets my 5 stars.  I can't wait to go back and play some shuffleboard.", "author": "Tabatha Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-09", "description": "They have Connect Four. I met and had a conversation with Frank Chu there tonight. For those two reasons combined......5 stars.", "author": "Abby W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-13", "description": "i like that you can play board games but there's no gamekeeper and people kind of leave the boards and pieces in whatever box they want. the bar was pretty empty during happy hour, but started to fill up as the night went on. warming up a friday night with connect four and $3 dollar well drinks is always a fun time though. i recommend at least stopping in for a cheap drink!", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-03", "description": "This bar is designed to fit in a rail train - way too narrow and long.  and there aren't even windows on the side.  Also, weird kind of elvis/50s scene?!", "author": "Kurosh H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-23", "description": "You can learn a lot about a band based on how they handle folks occasionally needing to get in and out of the bathroom behind the stage.  Glass of whiskey + bittersweet country tunes = very good times.", "author": "L W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-18", "description": "I could literally sit for hours watching people play shuffleboard. I was mesmerized. Unfortunately during that time I was attacked by a mosquito and got four bites all up my arm. Gross! I know this may not technically be the bar's fault but it has tainted my memory of it irrevocably.", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-19", "description": "Many get excited over the shuffleboard, but I'm all about the Connect Four! They have Othello, too, but that just doesn't feel like a bar game to me.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "it was fun playing shuffle board here.  never played that before\ni guess there's also other games you could play..\ncame here before going to watch a band play at 12 galaxies a while back", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-14", "description": "this bar is ok. i don't find myself here unless I'm in the neighbourhood (seeing a show at 12 galaxies or the make-out room). but whenever i do come here, i always have a pleasant experience. i was just here last night - before i saw a show at make-out room. it must have been a while since i've been here because i don't remember them having a jukebox or a frogger arcade game before. the jukebox is pretty decent ... pretty well stocked with indie rock (with the odd misfits, sex pistols, and buzzcocks cd thrown in there). i won't be going out of my way to come here ever, but i will drop by here for at least one drink when / if i'm in this area and i'm thirsty. \n\np.s. supposedly their happy hour goes until 9pm and pbrs are only $1. too bad i hate that piss water.", "author": "James J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-10", "description": "Doc's Clock is the best place to go if you want to \"get to know\" someone. Doesn't have to be biblically a friend will do but bring some extras to tag along because the shuffleboard is funner that way. Don't expect a huge crowd because it's usually empty but it makes for a better chance at the table.", "author": "cindy n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-14", "description": "Shuffle board, cheap drinks, the mission!  What more could want from your favorite dive bar.  OK well maybe a photo booth", "author": "Eric M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-10", "description": "decent hangout and would go back again but didn't really have too much of a sway either way.\nthey have shuffleboard in the back that sounds like it would be fun but you have to wait your turn to play.\nwasn't too crowded (thursday night) but still filled with a good amount of people.\ndrink selection pretty good and service was decent.\nwouldn't make it a \"must-go\" on your list of bars to frequent but it's okay if you're looking for somewhere to drink and you're standing right outside.", "author": "Lily B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-16", "description": "Divey bar with stiff drinks what more can you ask for?", "author": "Manny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-05", "description": "You can't beat a bar with a shuffleboard table, although you've got to show up hell of early to use it. The $1 Pabst pints during happy hour can't be beat.", "author": "Tim T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-12", "description": "As far as bars go this place is pretty cool.  They have a shuffle board table, board games (pictionary, trivial pursuit, sorry, scrabble), two arcade games (only one was working though), plenty of seating (4 booths, 5 mini tables and bar seating) and a juke box.  Their decorations include old school mystery novel advertisements and my Washington Apple was delicious.", "author": "Hillary J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "stopped in for a quick drink on a friday night. great people, great bartenders, great games, and great bacon wrapped hotdogs sold outside from shady vans with children playing inside of them.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-01", "description": "My favorite mission dive bar. Period.", "author": "Joel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-07", "description": "A good bar.\nNothing too special though.\n\nShuffle board and Connect 4 are awesome.", "author": "Henry C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-10", "description": "You Know this has got to be one of my favorite Mission bars. For some strange reason I always end up here in the middle of the night. I know it's not for the board games. But one things for sure and that's the draught PBR.  Some weekends it's pretty packed but you'll probably end up catching up with some people that you haven't seen in a while. Don't forget to bring some cash, as this place doesn't take credit cards. Trailer Park punch bitches.", "author": "Jacob S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-14", "description": "any bar that has a happy hour lasting until 9pm is worthy of five stars.  \nwednesday night, it was dedd.  and i mean that in a good way.  they have chimay on tap, and at a decent price, happy hour or no.  also, for those who want to while away the hours on a random weeknight (or weekday, for that matter) there are board games for everyone.  i'm not a risk girl, but i might go back for some trivial pursuit.", "author": "Aimee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-11", "description": "Best bar in the best drinkin' part of San Francisco.  Don't miss the jukebox, pinball and shuffleboard!", "author": "Tod G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-02", "description": "This was the last stop of our Saturday night. I like this place because it's laid back, long extended bar, with a back room of tables and booths. People were playing shuffleboard and other table games. Some people even brought their dogs.", "author": "Nancy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-31", "description": "I couldn't have had a better more classic bar experience. I was spending the evening solo because Jenn had to work. I had a couple of hours to kill before heading downtown to catch my buddy's band. She recommended I stop in here because of the vibe and the jukebox. She couldn't have been more right. The jukebox was magnificent. Tons of classic punk, soul, rock-n-roll. The vibe was purely \"old-school\". Just a long dim room with a very long bar, a pool table, a shuffleboard table and a couple booths in the back. And that killer jukebox. They had Lagunitas Pilsner on tap, $2 PBR's and all around cheap drinks. But what made my evening there, besides the music, was Lisa the bartender. I have rarely encountered a friendlier, kinder, or more cool, barkeep. She was curious about me, having never seen me there before and wanted to chat with me about myself and what I was doing in town etc. even though she got busy. She seemed to make time for all the solo drinkers. But she was completely genuine with every single person. She also insisted I help her \"test\" some whiskey and bought me a shot. I had a few more pints and was on my way but not before she could say goodbye and wish me a great trip. I did have a great trip and stopping by Doc's that night was one of the best time's I had this time around in SF. Cheers Lisa!", "author": "Frank M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-26", "description": "It's a bar. What more can be said? The music is good, not too loud, if there is music. Lighting is good - you can actually see who you're talking to without squinting. It's cool. Not much to say. I'd recommend it for a chill night with friends.", "author": "Melissa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-22", "description": "Doc's clock is a great place to go to get your mid week drinking going.  Find me there on Tuesday evenings drinking $1 PBR and a bourbon.  Nice atmosphere.  Good crowd.", "author": "oliver w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-01", "description": "It seems like this place doesn't get a lot of love, but it should.  They have a great selection of draft beers and the long bar that leads into the back room is a nice touch.  The jukebox also boasts a rather good selection of rock n' roll (yes, rock'n'roll, not stink 182 or some other radio bullshit).  My one con comes from when I was standing at the bar empty handed for about 5 minutes, waiting patiently, noticed one of the bartenders look over at me, keep cleaning, look over again in about another minute, then after about another two minutes finally come and ask if I needed something.  \"Well unless you serve food, then what am I here for, bitch?\" was my answer in my head but I calmly ordered a beer.  Beyond this one exchange the bartenders could use a little lesson in \"What can I get you?\" with a smile instead of \"I rule this fucking bar, do you need a drink?\" with a smug look.", "author": "Steven R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-07", "description": "i'm here every sunday. i don't know why this is the spot we've chosen but it is. we could have a good time drinking forties out of paper bags in the alley as long as we were together- but doc's has turned out to be a lovely alternative. \nwhether we're playing drinking shuffle board, or talking shit over a heated game of connect four- this has proved to be a good spot. \n\noh- we invented a lovely drink named after the occasion we enjoyed it on: a purim (pronounced: poor-um)  it's sapphire on the rocks with a splash of tonic, tomolive brine and tomolives. delicious!", "author": "gertie s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-17", "description": "I went here as part of a friend's birthday pub-crawl. I wasn't knocked out by it, but it was mellow. Not a great beer selection, but tolerable.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-25", "description": "I'm definitely not a hipster and definitely not a fan of the Mission's hipster dive-bar scene, but this place is somehow awesome. It avoids the pretension of other places and has a really cool vibe. There was even this really cool dog roaming around. Drinks were also really reasonably priced; my friends and I were headed off to Ruby Skye, but I secretly wanted to stay at Doc's Clock.", "author": "Eston B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-14", "description": "This place would probably annoy the hell out of me on some Friday or Saturday night when the bar is full and there's no way you're getting on shuffleboard, but for a cozy place to catch up with some old friends like I needed last night, it hits the spot. Cheap beer ($3!) and an easygoing atmosphere, we could actually all hear each other and people were pleasant. That sort of thing is my bag, baby.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-09", "description": "I saw the Pixies documentary \"loudQUIETloud\" here just a few nights ago. I didn't realize we were going to be watching a movie at a bar, so I didn't have my ID with me. This is one of the few bars in San Francisco that didn't card me when I ordered a drink (I look like I'm 15). Also, happy hour was going on till 9, so we still got cheap drinks. It's kind of a weird space to see a movie (a little cramped, very few seats) but it was cool nonetheless. \n\nI was wondering what the thing pushed off to the side was, now I know it's a shuffleboard table. They also have the Frogger arcade game, but it looked dead.", "author": "a a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-10", "description": "Dimly lit dirty bar that smells slightly of bleach - but definitely a nice bar hop down the strip. Good local ambiance, but not the best Manhattan. Great place to stop in for a drink, but not nice enough to stay for two. Manhattan rating: Very sweet. Tasted slightly like nyquil.", "author": "Gwenyth K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-25", "description": "Good bar for a date.  Usually dead, so not the best pick up bar.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-10", "description": "In all my visits here (my friends really need to learn to embrace variety), I have never played shuffle board. After 6 games and no wins, I am convincing myself that I need to practice. Looking forward to a lot more shuffle board (its going to make variety hard to get).", "author": "Alicia J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-21", "description": "I like this bar that is dark. I like the keg of guinness that sits directly below the tap. I like that local musicians will hang  out in the back and play. I like it when I'm with a few friends and the rest of the world is somewhere else. I like the heavy pours. I think the new owner is super nice and cute, too. I like it when people give bad reviews to my favorite bars. I hope that the word doesn't get out that this bar is really really cool.", "author": "Jon F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-12", "description": "I like this place,but I left my umbrella here a few years ago. Did anyone happen to locate a Burberry-knockoff plaid full-sized umbrella hanging off the middle of the bar?", "author": "Rene D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-03", "description": "Coolest thing about this place is the shuffleboard. Usually fairly dead or empty for some reason, but I kinda like that. You don't want to many people around you as you're drinking and playing shuffle board.", "author": "Eric O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-17", "description": "Laaaid Back. All I ever wanted in a bar. Fun, no BS people. Cheap Cheap drinks.", "author": "Sita B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-20", "description": "Low-key bar with good drinks.  I wish I remembered more about the bar itself but I was too busy chatting with the people I came with.  Overall, it must have been pretty good if we left at closing.", "author": "Naomi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-14", "description": "Stiff pour, good juke box, cute bartenders.", "author": "Brandy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-27", "description": "My favorite bloody marys ever. They put practically an entire salad in them. Olives, green beans, celery, sometimes the asparagus I think...and they will make them nice and spicy hot for ya...yum...", "author": "Kate S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-16", "description": "This bar has somehow managed to keep the same chill vibe through tons of changes in the Mission over the years.  Rarely too crowded even on weekends, great drinks, good prices, laid-back crowd, just a great place to chill out and have a few drinks.  And shuffleboard!", "author": "Deva H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-12", "description": "Very much enjoyed the shuffle board in the back.  The drinks are well priced.  This is a cash only bar and the ages ranged up to the mid 30s the Friday night we were there, though everyone looked like babies.  Between, Dominoes, Scrabble, and other various game options we were entertained.  The crowd is friendly and classic mission district.  There were a lot of locals hanging out that evening.  I have not tried the bathroom's at this point.", "author": "Diana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-26", "description": "A pretty good bar to start out the night. Good happy hour specials. Games in the back. I've met a lot of people here to spend the rest of the night with. No, not like that! Just bar-hopping and \"clubbing\" and such.", "author": "Linda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "I have only been here during the week and always have a fabulous time. In general Tuesdays and Wednesdays are not crowded - just scattered groups or couples having fun with their friends. I particularly like Doc's Clock because I can hear my companions and we can settle into a comfy booth to talk or get competitive with board games (connect four!) or shuffleboard.", "author": "Abigail R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-06", "description": "You can read b/c it remains fairly light inside while partaking in $2 fernet shots on Monday.  Always less crowded than surrounding bars which can be good or bad depending on the day and your mood.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-16", "description": "Who gives a crap about the bar. You can get drunk anywhere although I suppose the price will vary. Anyhow, I advise anybody who hasn't been here to go and try the shuffleboard. If you're like me and couldn't stop watching curling at the Winter Olympics, you're going to be batty for this game. The rules are a touch complex, but you can get the hang of it quick enough. It's like that old cheeseball saying, \"Minutes to learn, a lifetime to master.\" Was that Rubik's Cube?", "author": "aaron f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-01", "description": "The first thing you notice is The Sign. It's all old-timey looking and cool. The inside of the bar is long and skinny (reminds me of someone I know :-)) but a little bit kind of dingy. Not that it has to be all foo foo or anything, it's just a neighborhood bar. But the thing I really loved about it is they sponsor screenings of new films in the back part of the room. That's why I went in the first place, to see Kurt Weitzmann's new film \"Last Call.\" There was also another documentary being screened and although there were technical difficulties, the staff was \"on it.\" I really appreciate a place that will support local artists. I have to admit that I had nothing to drink at all because I was driving, but they did seem to have a full selection of the usual suspects. Next time I go I'll order a drink or two to support this establishment that supports the arts!", "author": "Beth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-11", "description": "love this place. completely unpretentious. shuffleboard. friendly bartenders who don't appreciate hipster attitudes. love love love.", "author": "amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-11", "description": "Just a happy little place to hang out and drink with some friends.  It's got a great central Mission location, making it a perfect launching point/crash site for an evening.  Good times.", "author": "Jesse H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-06", "description": "Typical SF Bar.  The shuffle board table can be a lot of fun, but only if there is not a band and it is not crowded...which is not often.", "author": "Pele N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-07", "description": "The shuffleboard table is completely fucked up.  The people who played after us looked like total pros on it though.  One of those tables with long slippery paths and big sticky patches, beautiful once you learn how to work it.", "author": "Kasey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-27", "description": "since Im a fan of bar activities, the shuffleboard makes this bar top my list of good bars to do activities at. Long and skinny and sometimes loud, I generally avoid it on the weekends but do enjoy it week nights!", "author": "Inome C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-15", "description": "Great bar to relax in and have a couple of beverages.. The new owner has done a great job of keeping this place one of my favorite bars to go to!", "author": "Rafi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-02", "description": "Dont you at times just wanna go out to the city and just get blastered drinking without having to worry about a guestlist or even a dresscode. You might just find yourself frequenting this bar more than just once. The crowd is cool, and the drinks strong, and to make things better the bartenders there always seem to have a few of their very own cocktail recipes.", "author": "Raj K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-17", "description": "Lagunitas IPA on tap and $2 Olympia = good enough for me.", "author": "neil o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-16", "description": "lesser known points from from the official tournament table shuffleboard rules:\n\n* Short foul line rule is in effect. \n\n* If there is no score in a frame, the hammer switches. \n\n* No double release shots shall be permitted. \n\n* A shot of Fernet is required before playing game point\n(ok, I made this one up)\n\n* If the object weight has wax on the side which may result in a \"soft\" or \"mush\" hit, you may have an official wipe it off and re-spot it", "author": "Dave K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-10", "description": "You wanna play shuffle board and have a group of friend at a dive bar? go to doc's clock. It s great little spot that you can pretty much own if you go with a group.", "author": "Isaac N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-25", "description": "Greatest attraction is one of the very few shuffleboard tables in the city (although you may want to get there early - it gets popular later in the evening). Drinks are cheap and strong. Atmosphere is everything you'd want from a dive bar - relaxed, slightly grungy, and inviting of deep inebriation.", "author": "Alexandra F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-26", "description": "Whenever I pay this dive bar a visit, I'm only going for the happy hour.  It's the quick stop to start your night not end it.  Everyone here's unpretentious and that's the way I like it.  And it's the only place I know with a shuffleboard.  How cool is that?", "author": "Eileen Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-06", "description": "I really like this place. Weeknights, especially for happy hours (until 8PM, I think?) are awesome because it's quiet and the bartenders are friendly. Great bar, lots of seating, friendly vibe.", "author": "Liboo K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-26", "description": "one of the few bars n the mission where you don't have to worry about looking cool enough to be there. no one there was trying too hard, i loved the easy going vibe!\n\nalso, $4 drinks\nbitchin juke-box (four plays for a dollar! on a real juke-box, not one of those lame internet ones)\nboard games galore!\n10 o'clock on a saturday night and i could actually sit down and have a conversation without yelling.\n\nloved it!!", "author": "emily w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-11", "description": "Ideally, Doc's Clock promotes to be the kind of place that has no prententions. Recently they have proven themselves otherwise.  The people that go to the bar are great, the space comfortable, and the \"games\" amusing, but the recent staff has made me think twice of going again. If you were civil and nice to the bartenders and bouncers, they treated you like meatwads.  You lose.  If you were a prick, and acted raw, they treated you like dirtballs.  You lose.  It was a lose, lose situation, and it is sad, because it always used to be a win x 2.", "author": "Erin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-11", "description": "supposedly a lesbian bar but both times i've been here i've seen drunk straight couples dry humping on tables in the back.  i think maybe there were a couple of lesbians sitting at the bar.  who knows, i am no lesbian detective.  not that i don't love lesbians, i do.  although i am not one.  anyway, this place has shuffleboard and it's the only place i know of in sf with shuffleboard.  also, the bartender was really nice.  but maybe she was hitting on me?!  just kidding!!!", "author": "Laura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-26", "description": "wow i live in the mission and cant believe i just went to this place. great vibe with smiley happy people. the shuffleboard table was a cool idea. what better way for a bunch of drunks to spend their time? and i had a friend who randomly got a bingo game going in the back as well...hilarious.", "author": "Susan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-15", "description": "not sure why i've never been here before tonight. huge bar, good drinks, a shitload of boardgames, shuffleboard (shuttlepuck? what the hell is it called?), and amazing color combinations.. doc's is definitely on my list for future visits.", "author": "Jeremiah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-29", "description": "If you stand near the entrance at the start of what is a ridiculously long bar, with hundreds (?) of back lit bottles of the sweetest elixir, and face said doorway, sooner or later you'll see the 14 Mission Muni bus glide by powered only by the cables and its indifference to \"official schedules\", filled with junkies, thugs, Mexican restaurant workers, and the homeless- it moves nearly silently continuing its all night quest to deliver person x to place y- but as it passes Doc's Clock, something downright ephemeral happens; the multi-hued light bulbs that illuminate the bar's signage reflect on the bus windows, completing a kind of you-are-here- feedback loop letting you know that even though the bathrooms are unsafe and small, and there's not enough stools to go around, you've now become to witness to your own placeness in the mission, and as the lights complete their return trip to your irises, while simultaneously wishing for a camera on a tripod, you thank (your own, private, small-g,)god that whatever walks in through that same open door would never, ever, walk in to Foreign Cinema (shudder), so that when the 14 has finally passed on its way to deepest darkest heart of Soma it's okay to just be somewhere simple, without din and hue of \"out\" - no you're just having a drink, on a weekend, in the Mission, why is that so hard, so revelatory?", "author": "Olu J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-26", "description": "How can you not love this bar? A great selection of booze at a reasonable price and shuffle board! . I always have a grand time whenever I walk under the great sign that adornes this Mission wonderland. I always feel like I'm in the 1940's in this bar which has both it's good (\"Hey kid, beat it. You're messing up my business here, see\") and bad (\"that damm Truman!\") aspects to it. This place is also a great place to meet some friends for drinks because it's right near the 24th st. BART and also is a great after show place for sips being close by to 12 Galaxies and Brunos. Speaking of 12 Galaxies, you know that cat who walks around town with that sign that says 12 Galaxies? He was in Doc's Clock the other night. It was a little more than surreal to see drunk women posing in typical drunk woman ways (the Charlies Angel pose. You know what I'm talking about. Whenever 3 or more drunk women get togther and pose for a picture, they always do the Charlie's Angels pose. You know what I'm saying!) while the 12 Galaxies guy kept talking about all 12 of his galaxies. Anyway, this bar is wonderful. Stop by...", "author": "Benji T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-30", "description": "better than I thought it was going to be.  but first thing: it's not a \"dive bar.\"  dive bar = dirty, old, with a grizzled crowd of bar vets who you know have been coming there for 20 years.  doc's clock = fresh, airy, clean, and full of fresh, airy, clean people.  at a dive bar you watch your step, don't look at your glass too carefully, and feel like you can hide in a corner all night.  doc's clock - none of those things.  which, by the way, means that's it's a very nice place, decent place to get a drink, with lots of room and a nice staff.  But you shouldn't be in a \"dive bar\" state of mind when you walk in the door", "author": "James R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-17", "description": "I would agree with the gent who said the barkeep's a bit like mom. Since Arrow Bar closed in my lovely SOMA backyard I've had to make the trek out to Doc's in order to get a drink. It's the only place without an in-crowd desperately trying to ruin my 30 minutes of intoxicated peace. The folks at Doc's aren't trying to be cool, sexy, or even trying to not to be trying (this of course is less true on the weekends when it gets crowded with a different crowd). On a normal day, it's a place anyone can roll off the couch and go to for a beer field trip without having to worry about the things one finds in city bars- like men in suits dancing to techno. Instead you will find a row of stools and some nice, everyday ruffians sitting on them, drink in hand. Yes, it would seem such a bar does still exist in San Francisco. Word of advice: try the trailer park punch. You won't admit it, but you'll like it.", "author": "M J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-13", "description": "how could a bar that concocts trailer park punch specials be bad? there are a few things that i miss about living in SF and doc's clock is one of 'em. shuffle board, cheap beer, BART station right nearby for the east bay folk...i think it's perfect. multiple thumbs up. more than i actually have...", "author": "Loarah P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-12", "description": "if you like to drink in a hospital ward or locker room, then this is the place for you.", "author": "chreesh b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-29", "description": "you always need a good neighborhood \"go-to\" bar on your list of places to enjoy some down time. how cab you beat still being able to get PBR on tap!?!?", "author": "c k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-26", "description": "i would say who knew - but obviously the yelpers did. this is a great, chill bar that i somehow missed up until a month or so ago. it's the kindof place where wednesday feels like saturday and midnight feels like 9 pm.", "author": "julia r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-03", "description": "i can't think of anything really good or bad to say about this place. my gin and tonic was ok. maybe it would have been better if doc was bartending. maybe it was the giant neon sign that drew me in. come for the sign, stay for the drinks. yes, that's it...", "author": "Oleya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-09", "description": "i never leave here even remotely sober.   seriously, there is crack in the drinks or something.  i don't care if you leave after 5 min, you're drunk.  also home to the greatest bouncer ever.", "author": "Bernard W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-28", "description": "They've got shuffleboard.  Which I'm sort of good at.  Because it doesn't take skill and isn't dangerous, like other bar games (pool, darts, spitting game) are.  Plus, last time I was there, someone left part of a (chocolate? vanilla?) birthday cake on a table in back, and I'm pretty sure that I had a piece.", "author": "Hannah J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-15", "description": "This place is decent.  good beer and if you're there mon-wed, you can get a good deal on one of their specials.  There is lots of space, booths, barstools, tables, pool and mangy dogs.", "author": "pauline e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-17", "description": "good strong pour, doesn't really get packed since i've been there, easy location and great selection of poison for debauchery!  i'll be back.", "author": "regina k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-08", "description": "go here and play shuffleboard all hammered, its rad. a buddy of mine puked in a hat here. there's cheap beers and sometimes half way decent mix drinks for cheap. the weird part of about this place is that when you walk in it smells like you walked in to a bathroom and when you're right next to the bathroom it doesn't smell.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-12", "description": "our attempts to play shuffleboard were stymied.  cash only bar. lots of hipsters. bitchy bartender.  par for the course in the mission.  still, SHUFFLEBOARD.", "author": "K H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-06", "description": "two dollar oly's is all that needs to be said.  this is perfect for a cheep insecitive prick such as my self.  you get wasted on twenty dollars and only have a minor head ache.  the girls behind the bar are great, they give hell to anyone who is drinking a lemon drop, especially all the douchey duds that wander on over from the more expensive, but offering the same prodcut bars across the street.  not to mention they have the bad ass shuffle board in back, and jameson for dirt cheep as well.  anyone who does not respect this dive bar, and one of the last true dive bars in the city is a fool.  get over your self if some one was mean to you, if you had to deal with all the assholes that came into a place like that you would be less then cordial as well.-uncle al", "author": "Uncle AL J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-28", "description": "i love shuffle board and i think this is the only one left in the city. usually find a bag of dope or some money on the ground, if your into that kinda thing.", "author": "Jeff B."}
