{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "I am so satisfied with the double play turkey sandwich. I could live off of those, for real. Just saying.\n\nTurkey Tuesdays and Wednesday's for the win!", "author": "Jamila G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "I felt like I stepped back in time when I entered Double Play. $2 Hamm's beer? All the time?! Numerous specials under $8?!! What is this, 2006?\n\nI visited Double Play with friends to catch a Giants game. It was a chill Saturday afternoon and the World Cup was also playing. In attendance were some older regulars and younger sports fans. All very chill. The bartender was incredibly welcoming and friendly. She was definitely one of the most pleasant bartenders I've met in recent memory.\n\nMy biggest regret was that it took 12 years of my living in SF before I visited Double Play. This bar is wonderful, and if I lived by it, I'd be here almost every day. The world would be a better place with more bars like this one.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "I come here on my work lunch break and the atmosphere is great! It's a chill bar vibe with great breakfast food. I've never came here other than breakfast. \n\nI get the corn beef hash with grilled jalapeños with English muffin. \n\nThe portion size is decent but you really don't need to eat that much in the morning anyways. \n\nThe staff is super nice and holds great conversations. \n\nKeep it up!", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Good deal, great people! We stopped by while waiting for  a friend to purchase Halloween decorations at party city  across the street and loved it! Will definitely be back!", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "A wonderful homie dive bar. Awesome baseball memorabilia everywhere. Great bartender, and even better specials. Love the Giants baseball? Gotta come here to check it out and watch a game. Just an all around great American classic spot.", "author": "Nina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "This is one of the last of a dying breed of great, real SF joints. Inevitably, the soulless, rude, loud, self-entitled, boorish bros and bro-ettes will begin invading, parties of 8 or more as always, and turn this into death, as they always do.", "author": "Yowz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "Came to this place on a Sunday to watch football games. Simple setup and nice. We got a seat at the bar and could see six different tv's. They had one game with the audio on and it happened to be a saints game - perfect. :)\nOrdered breakfast and it was even better than I expected. I went with the eggs (scrambled), bacon, and English muffins with breakfast potatoes. Fantastic. I highly recommend it.\nThe place wasn't very crowded for the morning games, but as the day went along more and more people poured in. There was only one bartender working for the bar full of bar patrons but he handled it just fine as there was never much of a wait for service. \nLooking forward to going there again. The staff was great, the food and drinks were awesome, and it was all reasonably priced. Divey feel and a good place to catch the football games!", "author": "Lyndon G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "I've come here a couple times to watch football on Sundays. It's a pretty simple, no frills bar and restaurant. The decor is cool with lots of baseball paraphernalia. They have the NFL package and a good number of TVs so you will likely be able to catch the game you are looking for. The only catch is the TVs are a little small and if you want to watch multiple games you might be at a slightly awkward angle to see some of the TVs. \n\nBoth times I have been here I have ordered the breakfast food. They serve up simple breakfast food done well and more importantly done at a reasonable price. The two egg any style meal is only seven dollars which is basically unheard of in San Francisco. I will without a doubt be back.", "author": "Alissa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "I just ate the breakfast burrito with chorizo. It's the best breakfast burrito I've ever had in SF.", "author": "Oliver H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "This place is awesome! It has a great family feel. The food is awesome, always hot and fresh. The drinks are newsworthy and priced affordable. The TVs display the latest sports and sports news. The family-owned business is very personable. The family won't forget your name and always has great welcoming smiles. I've come here, after working overnight many times. We've celebrated birthdays, retirements, and Thank God it's a day that ends in \"y\". You should try it!", "author": "Candice W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "One of the best Americanized breakfast burritos in the city. Delicious, packed with potatoes, cheese, great bacon and I don't know what else. It's as big as a burrito from farolito so make sure you're hungry!", "author": "Mario T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Solid, neighborhood restaurant. Lots of history. It's SF shiny example of Cheers: a place where everyone knows your name.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Double Play, secret kitchen in a fabulous old time bar and grill.  Their specials kill.  The BBQ plate?  Never have I finished it, bringing a doggy bag every time.  Run family style with a waitress prone to giggles but still has my second beverage on time, before I am aware I'm due.  My friends claim the salmon is best in the city, but they are prone to exaggeration.  Did I mention free popcorn?  If I didn't, there you go.  Six tvs, viewable in mirrors so if the company is bland you can discreetly catch up on all the sports, with your back to the sets.  Mix of old guard and new people.  You won't regret the BBQ..", "author": "Eric W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "Junior is awsome!! So good... Junior is awsome. Bloody Marys are Great Clips breakfast burritos are awesome", "author": "Sara W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "My buddy and I came here for breakfast before a day game at ATT Park. Giants were home playing the KC Royals. I knew this place was a throwback to the Giants playing at Seals Stadium. My buddy being 70 had gone to see the Giants there before Candlestick was built. Double Play did not disappoint on nostalgia. It was great. What surprised us was how great the food was!! Best bacon ever!! Good portion of everything and great service. Thanks Jr. you did your Papa proud. We will be back for sure.", "author": "Terry M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "Had to get my window fixed at Safelite because some assbag thought it would be fun to break it for no reason, so I headed to Doubleplay for a bite and a beer. Cool spot with a lot of history going back to 1909, and this bar was across the street from the old SF Seals Stadium. Good beer selection, decent menu (not exactly a \"fine dining location\", but very satisfying), and a great local crowd.", "author": "Bryan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-02", "description": "We live in the neighborhood, and we were breakfast regulars but:\n\n1. We were told several times that this establishment takes cash only--no credit cards. Then, lo and behold, with a new bartender/server, we learned different.\n\n2. Unfortunately, this new server (she has dark brown hair and heavily mascara'd lashes) provided terrible customer service. We asked that they turn down the TV (truly, it was BLARING at 8:15 in the morning), and this seemed to set her off because she then ignored us. We waited five minutes for a menu as she talked to the only other customer at the bar.\n\nWe left.", "author": "Kathleen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "Yo this bar is excellent for lunch! Much better than some cafes that are in the city and are overrated. Plus, you can grab yourself a nice beer on tab. The bartender was very nice.\nNote, they have direct-tv, so they cannot carry the Pac-12 networks, if you're looking for a particular game on that channel. Not Double Play's fault, but it has everything to do with tv politics.", "author": "Andrew J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "Came here on a Sunday to watch the 49ers game. Great service delicious food!!! Good selection of beers on tap had a awesome time with family and friends. One of the last true Gems of San Francisco Mission District !!!", "author": "Mario G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-18", "description": "Visiting from out of town and went here because of Yelp ratings to watch some Sunday NFL football. The place was very small. The menu was limited. The girl behind the bar was not attentive and very aloof. Limited number of TVs and most were small. We did not feel welcome at all. Shared one beer and looked at Yelp to find another sports bar which we did and ended up having a great experience at another bar with good food and drinks.", "author": "Marcella H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "Tino the bartender - 5 stars!  And they have all the games on at the same time so you can watch them all here.  Ample street parking.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "I really enjoyed my cornbeef sandwich here but I did get a sense that I wasn't totally welcomed. Maybe it was because I sat at the bar and didn't order a drink ( I was feeling a sore throat coming on and didn't want to chance it) or maybe it was because he knew everyone else at the bar besides me. Regardless, I ordered food but the service was very curt. It seems like a very local bar and I can appreciate that. I wish I came earlier because people talk a lot about the breakfast burrito but you can't order it after 11. \n\nI'd come back.", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-25", "description": "The food here is decent but it doesn't deserve 4 stars! Disclaimer: I am vegetarian so I can't speak to the quality of the meat dishes. \n\nThe meal I got was the vegetarian breakfast burrito. This is a relatively simple dish to make at home. Usually when I get a good breakfast burrito I expect the sum to be greater than the parts. This wasn't the case unfortunately. The food was very average, not bad but not good.", "author": "Ashwin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "Great sports bar and known for their famous breakfast burritos you can get them from 7-11am. I still have not found another spot that has delicious breakfast burritos like they do, so when I am not lazy to get up I like to order for pick up! I like to order my breakfast burrito  with bacon,  sausage, and avocado.  It also comes with ham,potatoes,cheesy goodness and eggs of course! A must if you're in the area!", "author": "Jennifer R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-29", "description": "I'm not sure where this Yelp listing gets the word \"restaurant\" from, as the place I went to this morning specifically said \"bar and grill\" outside, and was a bar. But there were seats for dining in, and a (reserved) dining room toward the back where some sort of meeting going on- it appeared to be a regular thing, complete with a podium and mic. Perhaps they rent it out for events, I wasn't really sure.\n\nIn any case, has a good, relaxed neighborhood-bar feel to it when we went in. As we ate, several police officers came in to grab breakfast and shoot the shit together. Easygoing bunch, added to that neighborhood feel, as everyone seemed to be a regular.\n\nGot the highly-recommended-through-yelp-reviews breakfast burrito with sausage- was pleasantly surprised! Hefty size, served with orange slices, and good flavor- packed full of eggs, potatoes, sausage, salsa, and cheese with green onions and possibly a few other veggies. Very filling and tasty, I easily could have stopped at half but BF was chowing down on his own food- the steak and eggs bfast. I tried a bite of the steak and thought it was okay, BF inhaled it along with his sunny-side-ups and side of potatoes. I barely managed to finish 3/4ths of the burrito after BF took a few good bites, also agreed it was good. Never would have expected this decent of a burrito from a bar, of all places. Then again, thats great marketing- anyone who was there last night and woke up with a hangover could just pop back by!\n\nService was good. One bartender, appeared to be another woman helping bring food out and keep an eye on things. Food was all good, they had Pacifico on draft (which I sadly was not allowed to drink at breakfast before my nearby interview), and had fliers up advertising the Snake Bite beer- part lager, part cider, made right here in SF. Gonna have to hunt that down for a taste...", "author": "Stefany V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-07", "description": "The food here is fast, large portioned, and consistently good. Obviously it's not fine dining but this place really fills me up with over 80 grams of protein a meal. I watch the bundesliga and Bpl a lot on the TV here and it's literally a minute away from my place. The corned beef hash and French toast are my staple dishes.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-14", "description": "Decided after lunch to go someplace different to watch the Giants game. Somewhere close.  Ok....DOUBLE PLAY. I haven't been here in years.\n\nIts in the vicinity of the old Seals Stadium so it definately has a lot of sports memorabilia.  Bar was pretty packed with die hard Giant fans.\n\nDidn't drink a whole lot but did have couple of beers (Draft).\n\nThe game was like a roller coaster, many ups & downs but who cares!!! End result--Giants won Game 3. It may not have been pretty but ITS OCTOBER BASEBALL, BABY!!\n\nOh didn't try any food at the DOUBLE PLAY as we were full from lunch. Bartenders 'fairly' friendly.\n\nUber'd it home.\n\nGOOOO GIANTS!!!", "author": "Janet T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-07", "description": "Great sports bar for football.\n\nExcellent bartenders, free chips/salsa, and plenty of big screen TVs.\n\nBonus: Fairly easy street parking in the area. :)", "author": "Kenny J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "I can only speak for their breakfast burrito, but isn't that all you need to speak on? I've been on a breakfast burrito kick the last few days between the neighborhood I work in and the one I live in, but nothing has hit the spot quite like this burrito. Though I do enjoy the picante sauce and even balance of their closest competition in the area, Cafe Taboo, I can't get over how many toppings they managed to throw in this burrito without it just feeling like an omelet in a tortilla -- I'll be back...I'll always be back.", "author": "Thomas J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-13", "description": "Do yourself a favor and get the frittata.  Who knew they had breakfast?! Family-owned and operated, a great local bar and good spot to watch sports on TV. Friday drink specials and friendly service.", "author": "Alyce K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "The fam come here after the game and some happy hours .. the food here is awesome and service is fantastic .. I recommend if ya in the area", "author": "Miguel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "Something was just so spot-on about their French fries. Light and crispy, yet not oily at all. It almost tasted like they were baked and not fried, but that's pretty much blasphemous.\n\nI ordered a cheeseburger, and was pleasantly surprised when they asked me how I'd like the meat cooked. And even MORE pleasantly surprised when my medium rare patty came out exactly as described! Most sports bars (at least chain ones, in my experience) always bring out some well-done brick despite what you requested.\n\nBecause this place is across the street from my job, I have a feeling I'll be coming back a lot to catch a game and grab a bite. And I'm definitely intrigued by the reviews concerning their breakfast burrito.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-03", "description": "I want to be fair & very clear. The only reason I'm rating this place 2 stars instead of 1 is because I frequented here during the Warriors post season last year & really enjoyed the environment/service. not the case this time around.\n\nI decided to treat some of my staff members to some drinks & Warriors basket ball the week before last. I get to the bar around 5pm waiting for my staff. I'm standing at the bar for 8-10 minutes waiting for the bartender, no one was around, no biggie. 6 of my employees show up. We walk to the back room (just like we did last year) to watch the game & relax. As soon as we sat down a lady walked in behind us with, what I can only describe as, a very confused look on her face. I asked her if it was okay for us to sit in the back room (the TV is much larger & it's roomier). The young lady reluctantly replied \"Yeah but if you need drinks, the bar is over here.\" I felt the comment was unnecessary so I reciprocated the attitude by informing her I was waiting for close to 10 minutes to order a few pitchers. Her response, \"Yeah, well I'm here now\". Then to top off this entire ordeal She asks \"What time does the game even start?\", \"7:30\" I reply. Get this, she says\" well we close at 9:00\". My employees & I stared at each other & said , & I quote, \"let's get the fuck outta here!\"\n\nThis situation bothered me on a few different levels. Not to sound pretentious but I manage a company of roughly 70 employees. We're a customer service oriented business. One of our company core values is \"Customer First\". This value is not negotiable, we don't put the customer first when we're in a good mood or feel like it. The value is lived every day in our company. We put the customer first, period.\n\nI couldn't believe that someone would  speak to a customer the way this lady did. Granted I'm not a repeat customer year round but still you don't treat customers this way.\n\nI ended up taking my staff to Dear Mom, on the corner of 16th & Harrison. I've been happily watching the Warriors kick ass at Dear Mom every game.", "author": "Christopher D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "Amazing dive bar with cheap drinks, local feel, and mouthwatering food for all meals.", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "At a time when everyone is trying to make super fancy burgers/burger experiences, it's nice to just have a normal old fashioned burger that tastes like you're at a Sunday grill out. It's also nice to see people chatting and having a good time, bonding over baseball. This place is the real deal as far as an old fashioned sports bar.", "author": "Davin A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "Neat little neighborhood bar with a local following.  8:30 PM on Friday night, I was looking for a burger and beer.  No go.  They only serve breakfast and lunch.  Beer selection is OK for a beer snob like me.  The place was kind of dead though, which may be because it's more of a morning and afternoon place.  Bartender was friendly, but unattentive, more interested in comiserating with the 3-4 local yokels that sat at the far end of the bar.  My 1st beer was empty for about 5 minutes before she took some notice, a small tenure in the grand scheme of things, but I expect a little more from a bartender.  This is how it goes though with neighborhood bars.  If you're not one of them, you're basically a walker (walking dead), where you'll find a crossbow pointed at your head if you raise any kind of commotion.  Check please.", "author": "M T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-29", "description": "Bar fronted by a Resturant - as tables in the back room clearly allude to a dining \"experience\" - yet no food is served except for left overs after 6pm (time I walked in BTW) served as.... Bar ambience is tepid at best with a bunch of regulars but darn! Disappointing for a block of from a couple of blocks away", "author": "Madhusudhan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "Nice neighborhood bar.  Would be 4 stars but the owner recently converted the parking lot to condos.  Bully for him and make your money, but now parking sux, so deal with 3 stars.  The beer is cheap and cold, the staff is friendly and the breakfasts are awesome.  From just bacon and eggs to the outstanding breakfast burritos, this is a go to place for breakfasts.  Unfortunately, they stop serving breakfast at 11, and the lunch menu is not so great.  Really high prices ($12 for a sandwich) and so so food.  Skip lunch here.  Come for drinks, breakfasts or ball games.", "author": "Ken P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "this place is cool. came here for lunch while I was getting my windshield replaced at safelite next door. the food was good, the bartender, junior, was very friendly as well.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "My Breakfast burritto was full of goodies it was also Fresh & hot  off the grill! This spot fits the bill for a  non-chain casual  bar & grill with good tasty food, & good service. Will return", "author": "Ron P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-20", "description": "all the responses are years old...decent breakfast\nthe cops seem to like it.\ncloses early...8ish bartenders will cause you to lose your appetite.\nIF there is 5 people at night THAT'S a real busy night\n\nDIVES LOOK DOWN ON THIS PLACE", "author": "Mike H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-13", "description": "They have great specials and the perfect set up!! Nice and roomy! One of the best things about this place is that there is a parking lot.. in sf!! yay! Staff is awesome.. very helpful and friendly.", "author": "Courtney J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-11", "description": "This review is for brunch only. \nWas in the neighborhood on Saturday morning and was starving. Looked up local spots and this place had good reviews for the breakfast burrito so we decided to check it out. First, this place sort of smells like any dive bar's bathroom stall which didn't make a great first impression. We ordered the burrito with bacon and there were these really gross thick chunks of chewy bacon (not crispy). The greasy aftertaste lingered in my mouth for hours reminding me how much I did not enjoy the breakfast. Maybe this place is a cool dive bar but I would skip it for breakfast.", "author": "Lindsay A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-20", "description": "This is usually our go to burger spot for lunch during the week. It usually only takes 10-15mins and its a block from the office. Cheeseburger and fries are about $9.50. I haven't had a bad burger yet.  Yeah, it's a little on the pricey side, but its also just a block away from me.\n\nSince its a bar they don't have drinks to go. If you need a soda, Safeway or the Chinese restaurant (Jade Cafe) across the street are your best options.", "author": "Craig I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-01", "description": "The atmosphere there was absolutley great!  This is definatley old San Francisco.  I would definatley go there to watch any San Francisco sporting event and put a couple back (if i am not working LOL).  I had the prawn meal and it was very good.  The slad and the grilled veggies were extremely fresh and very apetizing.  The sauce that they used for the prawns was light but very flavorful.  The service was so, so and they do not serve desert.  I am definatley going back here to watch a game off the clock!", "author": "Kavon M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-25", "description": "I went for a home Giants game.  Was hungry, but didn't eat b/c the kitchen was closed by the 7th inning.\n\nI'm a history buff, more specifically a baseball history buff so I was very excited to visit the Double Play.\n\nThe Double Play was in its day the SF version of Chicago's Murphy's Bleachers, since it was located just outside the Right Field entrance of old Seals stadium of the Pacific Coast league.\n\nI've been struggling to find a good Giant's \"local\" pub.  I've been assured that plenty of places around ATT Park would fit my needs:  game audio played in the bar, cheering fans, camaraderie, historical crap on the walls, etc.  However, I don't want to go to the Park; I want a neighborhood local in Noe Valley, Mission, Lower Haight, Potrero. \n\nThe Double Play was nice.  Loved the stuff on the walls, the old back-bar and even the regulars were polite and into the game (just wasn't very many of them).\n\nI really enjoyed being served by the older bartender.  I've spent too much time in the Mission; rude, hipster, tatted, pierced bartenders who in an attempt to individualize themselves have become one-in-the-same.  Maybe if I dressed like a scumbag and ordered shit beer I would get better treatment?  \n\nThe Old Timer bartender was slow, but friendly and I couldn't help but to call him Sir.  He's earned it.\n\nBeers were cheap and cold.  Nuts on the bar were fresh.  When I asked for a menu and learned the kitchen was closed, the Old Timer checked back with me a few minutes later and told me the kitchen would make me a cold-cut sandwich, and I thought that was very nice, although I was feeling more dinner at that point.  But props to them for trying to scratch that itch. \n\nI'll go back to the Double Play for a big Giants game, because I trust the fans will be there and the audio will be on. Until then my search continues for a good Giants local.   So far I think the Phoenix on Valencia is the spot.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-05", "description": "Go in here pretty often after work. Beers are cheap, tv's are always showing some good sports and Jimmy (although perpetually cranky) is awesome. Great local crowd and a good dive bar feel. Breakfast burritos are pretty good and incredibly filling. \n\nPlace closes early though so if you're a night owl, not your kinda place. Definitely check it out and say 'hi' to Jimmy.", "author": "Brian N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-12", "description": "Breakfast Burrito review only.  So the sign out front beckons to try their breakfast burrito so I had to do it!  Well it was not quite up to the expectations that I had for it based on the fact that it was promoted exclusively on the a-frame out front.  First off it had mushrooms in it which for a breakfast burrito wasn't quite my thing.  Also the bacon was not crispy enuff for my tastes and it was a little rubbery.  So although it was a big one, I can't say I'd go back just for the breakfast burrito :(", "author": "Gene X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "I'm surprised more locals, especially the kind that arrived in the last 10 years or so, don't know about, or show sufficient reverence for, the Double Play.\n\nAn outing to the Double Play is an actual event for me and the missus, and we've been going a couple times a year for more than 25 years.  Just be sure to sit in one of the booths in the bar area.  Wait an hour if you need to (but you probably won't).\n\nThe food is actually quite good, especially the burgers and fries, the drinks are relatively cheap, and the pours are generous.  Plus, you can't beat the memorabilia and the people watching.  Hard not to notice that everyone is happy to be there.\n\nEverything about the Double Play is delightful, and every local should go there at least once to see why it is loved by so many.", "author": "Hal M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "Order the Jessica Rabbit and thank me later! This is a great spot to enjoy a beverage and watch whatever game is on. They are apparently know for great breakfast and lunch food. I would never know since I get there always after work. Quick tip they sometimes close earlier than a normal bar so get there by 7 and relax and enjoy yourself.", "author": "Dustin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "Great memorabilia from the old Seals Stadium, which was located on this very spot.  Went in and had a couple of brews today - great spot to watch the game, and there is some seriously cool old baseball and football memorabilia on the walls.  I'm just really sad that they demolished the room with the old mural of Seals Stadium.  Wish I'd have come in sooner for that reason alone.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-07", "description": "I have always wanted to come here and finally did on my way to the ball park. Initially we got some hate when we came into the place cause we were rocking our Padres gear. After a few minuets we were all friends because of our mutual hatred for the Dodgers hahahaahahha. Everyone was cool and laid back. The bartender asked if i needed another beer when i had a drink left in my glass,which was cool. The beer was average priced and they had good beer on tap. My only regret is i got here too late for lunch. The menu looked good and i may need to come back to try the food.", "author": "Raul R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-02", "description": "Just got back from here after the Giants and Dodgers were stalled by rain during the top of the 5th inning with the score 1-1.\n\nGreat beer prices, $3 for a large glass of tap (stella, bud, and others).  They have two tv's.  Nice.  it's fairly quiet.  The crowd consists of bitter drunks, but the place is a bastion of SF history since across the street used to be Seal Stadium where Joe DiMaggio once played for the SF Seals.\n\nIt's great to look around to visually scavenger hunt for pieces of San Francisco history.  There's even a 1944 War bond underneath the glass on one of the tables.]\n\nNeat.", "author": "Tony U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-31", "description": "Huge portions of food, strong coffee and booze. A good combination to make your trip there worth it.\n\nThey have lots of tvs playing every sport which is nice, even soccer which is a nice break from the constant baseball and basketball games. \n\nIt has a full menu of plentiful portions of pasta, burgers and sandwiches. A bit pricier but well worth it for food, drinks are normal priced and the selection is pretty good. \n\nIf you are coming off an all night bender this place is the spot to recover and need the needed liquids and solids back into your system.", "author": "Kate D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "My requirements for a sports bar are simple. Give me a place to sit, price the drinks reasonably, show me the baseball and leave me alone. I've been in this place before when it was crowded, but even then I found a place to sit. Last night was the best though:\n\nFour screens with the Giants game on them and the Cranky Old Bartender (let's just call him \"Cob\" from now on) had no objection to one of them showing the A's game, provided I could tell him what channel it's on. I didn't know. \"You don't know? What kind of sports fan are you?\" \n\nThe kind who doesn't have a TV, otherwise I'd be home watching the game. Fair enough - he hands me the remote so I can figure it out myself. Because clearly he can't. \"They got so many things programmed in there - you do it.\" I do. \n\nOnly five people in the place total - so quiet I can hear both games being called. I order a vodka tonic. He says OK. I say \"mostly tonic though\" and he nods. \"You gonna order one drink at a time?\" \n\n\"Is there a discount if I order in bulk,\" I ask but I don't get the answer because the phone rings and Cob grabs it. He says cranky things to the caller, hangs up, turns around and says to me \"Guy wanted to know if we were watching the Olympics... only he has his girlfriend call for him. Because he's smart - see? He knows men would rather talk to women. But I can hear him in the background, telling her what to say. So I said 'Let me talk to the fella next to you: No we are not watching the Olympics!' Goddamned cowards,\" he concludes while mixing me a vodka tonic that is half vodka and half tonic. It takes me seven innings to finish it but he doesn't push me to order another. \n\nWhen my glass is finally empty, I ask for a short glass of tonic only, just so I'll have something to drink and not feel like a freeloader. He gives it to me on the house. By the end of the ninth, it's just me, Cob, and one other guy, Cob having locked the front door around 9:45. I do believe he would have stayed open for us until the Giants game ended, but the A's went into extra innings first so I tipped well and said goodnight. \n\nNew favorite (weeknight) sports bar.", "author": "Will R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-20", "description": "Great place for breakfast! The staff was super nice and attentive, the food was good and reasonably priced and their bloody mary tasted awesome! It just needed some olives and the standard celery to beautify it. \nThis is a good place to meet with coworkers before or after work.", "author": "Celeste A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-04", "description": "Their food is great.  FRESH sourdough bread with your meals. I am a big fan of their shrimp salad. :)  The staff is always pleasant and I always get great service. I need to go back!  I haven't been in a long time!", "author": "Stacey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-25", "description": "Hate Cosmos. Hate Mai Tai's. Hate sweet drinks. I'm not a cocktail girl. Jordie made me a Cosmo and I was gonna drink it just to be polite... I ended up coming back two nights in a row just to drink her Cosmos! Amazing! She also made me a Mai Tai... The first time I've ever finished a Mai Tai in my life was the one that Jordie made me the other night. It was perfect! Not too sweet at all and easy to drink! She makes the best cocktails! I totally have a crush on her now!", "author": "Christina B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-07", "description": "(Pub Commute Stop 1)\n\nAnyone can write a review while drunk; the trick is being able to write them while hungover.\n\nAnd so begins the bleary-eyed, coffee-assisted tale of the Tuesday night \"pub commute\".  That's where you walk home from work via a series of bars.  Well, ok, you walk until you're at the last bar, and then you run like mad to catch the last Muni up that colossal hill that you're now far too drunk to...but I'm getting ahead of myself.\n\nAnyway, the night started rather inauspiciously at Double Play.  I chose it mostly because they were rumored to have food.  Turns out, though, it's only breakfast and lunch.  In other words, great spot to come catch a game over beer and grub on a weekend, but for after work....eh.  My biggest complaint was that it was impossible to get either of the bartenders' attention.  I guess priority goes to the rowdy, tequila-downing regulars.  So, to use a sports metaphor, this one was a 3-and-out (down your pint of beer in 3 large quaffs, and move along).  Especially because we needed to squeeze in an unscripted food stop...", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-06", "description": "The service is great! I took everything I needed from neighboring tables. No one seemed to mind or care. Highly recommended!", "author": "Jennifer Holly W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-17", "description": "If your going for cheap beer and to watch a little of the game.... great.  Although there is a delay between the TVs in the bar and the TVs in the tabled area....... which was sooooo annoying during the world series to be in the delayed room.\n\nFood .... gross.\n\nI know this is supposed to be a historical location but the food is so gross and the bar area is very small.\n\nYuck.", "author": "Andrea B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-25", "description": "Seriously one of the best breakfast burritos I've had, and I wasn't even hungry when I ate it...", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-14", "description": "Really delicious breakfast in a great atmosphere.  Perfect for drinking after working all night.  Friendly bartender.  Breakfast burrito is up there with the best I've ever had.", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-16", "description": "I'm starting to realize how many of my reviews revolve around places that serve alcohol...eh...no matter.\n\nAt any rate, the DP is one of my favorite haunts because I can almost always find a staffer or volunteer from the SF/SPCA there after the shelter closes down, and it's a great place to recap the day. No pretentiousness + no dress code = my kind of party.\n\nThe people who frequent the joint are eclectic, crazy, funny and personable, and the ones who serve us all are so patient, it's ridiculous. So thanks, guys ;)\n\nOkay, so you also have endless peanuts (yes, I like peanuts with my beer) and a huge, drafty back room, both of which make this an awesome corner spot. You just have to have the right attitude. Seriously girls, if you show up in a halter and mini, I'm pretty sure you won't have the best time...in which case, I highly suggest Vertigo or the R Bar - both of which are fun in their own right. It just depends on what (or who) you're lookin' for.\n\nIn sum, this is my \"Cheers\"...not a place to hunt for a one nighter; more like a place to start an all nighter. Most of the time, my combo of Coors and JD lead right back to my own bed before 10pm, but I'm a dork. Regardless, this place isn't the worst place to end a day (or start a morning, for that matter!) Tip: Ask for recommendations - the bartenders are the best. The juke, however, could use an update (I swear, if I hear \"Dead or Alive\" one more time...)", "author": "Hilary L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-13", "description": "this place is nothing spectacular... i only went because it is right by my friend's house.  my quesiton is, why does it smell like the onions that are in a hot dog condiment tray in there?", "author": "Tina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-14", "description": "i work nearby; so I call Double Play periodically for lunch pick up. I'd heard legend of the breakfast burrito but they typically stop serving it (around 11am i think) before i can make the call. This morning I was lucky and was able to get it together and call them about 1059. they were kind enough to make it and I was so beyond excited to eat it! definitely the best breakfast burrito i've ever had. and it was ready in less than 10 minutes and $7. Its huge!", "author": "Holly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-13", "description": "BURRITO, AMAZING, COFFEE AMAZING,\n\n   This is a great place to nurse a hangover with a breakfast burrito a cup of coffee and perhaps a little hair of the dog. Nice cop memorabilia, a little surly service so you pay your penance in regards to the previous evenings festivities.", "author": "Atom H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "reviewing Double Play for a couple pretty limited reasons: \nwe went by for a mid-day meal yesterday (Sunday, but somehow \"brunch\" doesn't sound right), and I ordered pork chop-and-eggs....over easy...the pork chop had that charcoal-grill mark & taste that I haven't encountered on meat in donkeys-and-donkeys years.  reminded me of my 1950's-1960's childhood.\nThen we asked the bartender about Seals Stadium (site where I fell in love with baseball) and the guy--young enough that his parents couldn't have remembered the facility--was really generous with information about how the field was oriented, where entrances were etc.  it was great.\nSadly, the Seals Stadium murals (ref'd in other reviews) are gone--that whole room demo'd for the housing going up on what had been the Double Play's parking lot.\nI meet friends at DP a couple times a year, plan to continue", "author": "Bruce C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-24", "description": "Meh. \n\nI guess this place is ok if you're looking for a regular old dive bar with a flavory regular crowd. I came here to watch a football game the other day and wasn't very impressed with their setup as a sports bar, however. \n\nThey have 2 TVs, both on the sides of the bar so you have to turn 90 degrees in your seat to watch. Maybe I'm really lazy but I like it when the TVs are set up so you can see them easily from the seats they provide. \n\nThey stop serving food at 2:30, which I was a little sad about, but the nice bartender gave me a handful (sanitary?) of peanuts and later offered my bf and I free hot dogs and chili. He quickly regretted eating both. \n\nTwo big perks- the drinks are cheap, especially beer, and they have a parking lot! What bars in SF have parking lots? Yeah, it seems kind of ironic, since you shouldn't be driving and leaving a bar in close proximity to each other, but it was convenient for me since I wasn't indulging.", "author": "Amber D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-17", "description": "Go in with the right expectations and Double Play won't let you down.   It's a divey play with cold beer at a decent price, really solid burgers and fries, with enough HD TVs to see the game.   Lots of interesting memorabilia from the Seals stadium days. Great spot to watch afternoon Giants games while your having lunch.", "author": "Dave C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "I met a friend for beers after work on a Saturday. The bar was about half full with a mostly working class crowd. The beer selection was decent - a bonus star for having Speakeasy Prohibition Ale on tap. Bartender was super cool even giving my friend and I a couple of cigarettes.", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-12", "description": "If you enjoy lively ridicule from an 83 year old, caustic bartender with a chip on his shoulder, this is the place for you.  \"The Bishop\", as he refers to himself, is the most classic, old skool character I have run into since the now deceased, fabled owner of Zam Zam on Haight.  He has the gift of storytelling and will have you in stitches in no time with his expletive filled yarns.  Listen carefully, though, depending on how many of his own mistakes he has had that night he can be difficult to decipher.\n\nLocated somewhere near home plate at the old SF Seals Stadium (16th and Bryant), this sports bar provides the perfect pulpit for The Bishop to sermonize.  Frank Sinatra and Cab Calloway play overhead, providing an appropriate soundtrack, while old photos from days gone by capture a very different time.  \n\nIf you want prompt and courteous service, don't go here.  If you are looking for a throwback watering hole where the bartender IS the entertainment, this is the place for you.  The Bishop himself provides a caustic point of view on just about any topic, from senior sex (like pushing a marshmellow into a peanut bag) to war(why don't they draft all the old people to fight who are ready to die anyway?).  Want advice on how to keep your marriage exciting?  The Bishop will tell you, whether you like it or not.  He is a self-described expert on the ladies even at his advanced age, currently dating a Korean lady 25 years his younger.  I don't know if it makes him an expert but you gotta give him props!   \n\nI went in for a quick beer and stayed for well over an hour listening and laughing hysterically at the Bishops take on life.  He's been around for a while and has defenitely earned the right to wax poetic.  Go see him and join the fun!", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-18", "description": "Enjoyed an Anchor and a part of a football game. What? It's a restaurant, too?", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-08", "description": "The food here was alright. Good sports memorabilia on the walls and strong enough drinks", "author": "Patrick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-19", "description": "I had this place bookmarked and happened to be in the area. Reviews suggested to try the Breakfast burrito. Great recommendation! Burrito is huge so you should be prepared, come hungry.  Enjoyed it at the bar while watching some World Cup soccer. The service was down to earth and friendly. If in the area for breakfast I will not hesitate to return!", "author": "Ivan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-09", "description": "Classic.  I opened the door to walk in and six 50 year old guys turned to see what young buck had stumbled on to their turf.  The bartender was about 70, Sinatra was playing on the stereo and Seals memorabilia adorned the walls.  \n\nWe got settled in to a booth, enjoyed some strong drinks, and watch the basketball game.  You don't find many bars like this anymore.  Don't go out of your way expecting some kind of scene but if you're in the neighborhood and want a cheap drink and a blast from the past I highly recommend Double Play.", "author": "Garrett D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-23", "description": "great place to hang out and have a few drinks. the bartenders sally and jim are great. both will set you in your place if you act up so don't mess with them.  \n\nbreakfast burrito - be hungry. be ready to eat. it is stuffed with everything you can imagine for under $6-$7.\n\npeople are great. friendly. come grab a beer and support your giants!", "author": "Lee D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-25", "description": "This place is a disaster, and if you eat here, you're a disaster.  If you drink here, I hope it's in abundance.  Enough to obfuscate the sad, dead life you have led.", "author": "JJJJJ M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-06", "description": "Some friends and I were attempting to go to Slow Club down the block but unfortunately (fortunately?) when we arrived they were only serving coffee.  Refusing to wait or return to our respective domiciles for some Quaker instant oats we stumbled upon Double Play.\n\nThere are 2 important things to know about Double Play. One is that they start serving breakfast at 7am and the other is that they start serving alcohol at 7am.  God bless you Double Play, a sports bar that serves breakfast!  Now if only you weren't so far away, I could regularly get tanked on those weekday mornings when I want a breakfast burrito and some tequila.\n\nFrittata = Pretty damn good\nFrittata + Salsa = Awesome\nFrittata + Salsa + Jameson = My type of establishment", "author": "Justin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-12", "description": "Came here once with my supervisor for lunch. They had really good burgers and fries. The place has a very nice decor with many many photos of the city and the restaurant's history. Apparently, they have a mini baseball diamond in a room for private parties. I peeked it, and I thought that was pretty cool.\n\nI didn't experience the sports bar though. But it was very packed. I would definitely come back for food or their sports bar!", "author": "Sam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-16", "description": "1st Scenario:  What do you do when you get off work at 8AM and had a screwed up night at work, OR MAYBE, you had the greatest day at work and it just screams for a celebration bitches?  THAT feeling, that \"I gotta get mine right now\", and I can't wait till I get home to open one feeling...\n\n2nd Scenario:  You get TO work at 8AM and you want the greatest breakfast burrito in San Francisco.  And wished you had one of those tall glasses of Sierra Nevada.\n\nFormer after-party joint for the San Francisco Seals, when Potrero Center used to be the San Francisco Seals Stadium, been around since the early 1900's, and a local treasure chest of family-oriented service.  That's right, this place made my day, many a time.\n\nTIP: Thursday Nights, lingerie night.", "author": "Roland L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-04", "description": "Poor customer service... Nasty attitude when I called to confirm an Eagles game was going to be playing... I tried to give them another chance when I wanted to reserve a table (like yelp indicates you CAN do) and I was rudely told \"oh you called earlier... First come first serve\". Please and thank you...  My goodness learn your manners! So sorry you suck! I didn't even have a chance to bring ten friends (who if they had a good time would have spread the word about the place).  Just bc you were rated best in the city 200 years ago doesn't mean you can be turning away business! Trust me... I'll be spreading the word. News flash: get someone with a brain to answer the phone.", "author": "Kristen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-07", "description": "I just discovered this bar...such a great regular crowd!  Have been twice in the past week.  Went on Thurs for \"lingerie night\"--hilarious and super fun!  A girl in lingerie goes around and sells raffle tix in her lingerie.  If you win, you can get free drinks or free lingerie.  Good times.\n\nI also love the Sunday night bartenders, Christopher & Kristen!  Fun music on the jukebox...  and good drinks!  I also totally appreciate the fact that they have a big parking lot for patrons behind on the 16th Street side. Priceless!  Check it out & go there and meet people.  Such a fun & interesting group!", "author": "Sara W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-13", "description": "BOOM! Yeah. Try and buy a drink there. Tricky. Bars sell beer, I buy beer, there seems to be no intersect.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-14", "description": "Breakfast Burrito from Double Play, made only until 11 am or something silly like that if I remember correctly = 5 stars.\n\nSeriously, I do not eat burritos often, breakfast or any other variety.  I never crave a burrito, EXCEPT these things are amazing.  \n\nService = 0 zero stars.\nAmbiance = 3 star \n\nSo I averaged the stars and rounded up.\n\nI've been to this place a few times, back when I worked in the 'hood.  And yes, that hood sucks.\nTheir hours are silly, their service is spotty at best. \nThe food is pretty good bar/American food but a little expensive. But those burritos sure were great.", "author": "Nilu r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "Always craving their breakfast burritos! Great size for a great price!! Friendly staff, great drinks! They are the BOMB!!", "author": "melanie d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-26", "description": "This is the establishment that drove me to yelp. I came up from LA and my mom drove down from Tomales Bay so that we could watch game 5 of the World Series together. I picked this place because I read that it was rich with baseball history and seemed like the perfect place to watch my Giants win. Unfortunately when we arrived the bar was dead despite there only being 30min to game time. Not only that but instead of having the kitchen open they just had one lady making tacos. My mom is a vegetarian and since they did not have a taco option for her I went to Safeway to get her a salad and some chips. When I returned they told us that there was no outside food allowed. THIS MEANT THAT MY MOM WOULD HAVE TO STARVE FOR BEING A VEGETARIAN. She had already ordered a beer but because she was drinking on an empty stomach, ate 1 chip. She was then promptly kicked out of the restaurant. Now we're left with nowhere to go, ruining what was supposed to be a wonderful World Series night.", "author": "Sairus G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "I feel like I shouldn't really be writing a review for this place since I've only tried one item here....but I think people need to know how freaking awesome their breakfast burritos are!!  Splitting their breakfast burrito (italian sausage) on Saturday mornings has somewhat become of a ritual for my partner and I.  They have many different options too...they have bacon, ham and vegetarian.  I've also seen other delicious breakfast items on their menus---which we will try someday!!  But for now, we are hooked on the italian sausage breakfast burrito!!  The burritos are FAT and CHEAP!!!  What more could you ask for?!", "author": "Cin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-08", "description": "Breakfast burritos are amazing and the size of your head. Drinks are awesome and strong. Will continue to go here especially since the bartender they call Jr is hot!!", "author": "Juliana H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-19", "description": "Double Play is amazing.  I have never been there after 11 in the morning so I have a slightly different perspective methinks.  To clarify, I often work the night shift nearby and this is where my coworkers and I go for breakfast happy hour.  Lindsey, the morning shift bartender, treats us right with her intense homemade bloody marys and oh-so-spicy English accent.  Whoever is creating such amazing breakfast burritos (choose ham, sausage, bacon or combo) deserves to remain anonymous, like the Wizard of Oz.  Best I've ever had.  And the salsa, which is made daily from roasted tomatoes and peppers, makes the seemingly-unimprovable burritos that much better.  I'd imagine the place is even more fun after noon....", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-21", "description": "It's a sports bar. (So?)\n\nIt's got good enough food. (So what?)\n\nIt's a sports bar that's used to be a post-game haunt for San Francisco Seals fans in the 40s and 50s. (Wow!) \n\nIt's a living relic of old-time SF, so for just being there it's pretty awesome.", "author": "Flynn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-21", "description": "Great place! Right across the street from the old Seals Stadium site, it just reeks of SF baseball nostalgia. It's been serving fans since 1909! I love the Seals Stadium mural in the pool room and the awesome memorabilia on the walls.", "author": "Gina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-25", "description": "You know how the Oaks card club is the only remaining remnant of the Oakland Oaks who used to play across the street (where Pixar is now) in the Pacific Coast league?  \n\nWell, the Double Play is like that, but for the SF Seals who played in the PCL on Potrero Hill where that huge Safeway shopping center is now.  This is a dive bar, full of baseball memorabilia and San Francisco from a time gone by.  \n\nThey have their own Pale Ale (delicious), small booths, and a side room painted like the inside of a baseball staidum including baselines, crowds, and a pitcher.  \n\nWe just came here for the bar, so I have no idea if the food is good or not (I wouldn't expect too much from it, but a friend and I wasted some time in here, drinking beer and playing dominoes on a rainy Saturday.  \n\nLoved every minute of it.", "author": "Cory G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-08", "description": "Went in with my running group after a run. The bar tender was very friendly and served as fast as she can (we had more than 30 people in the group). The drinks are priced very reasonable as well.", "author": "April E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-30", "description": "I went here solely to eat the breakfast burrito and look at the memorabilia and I was thoroughly impressed. The burrito was huge!  I finished the whole thing, although I really shouldn't have.  Can't wait to go back .", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "Dude the breakfast burritos rock!  Can't speak for much else.", "author": "Julienne G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-04", "description": "White collar dive bar- check. Surley bartender named Jimmy- check. Pool table- check. Can bring your dog - check. Smoke kinda indoors in the covered patio and no one will bother you- check. Basic one plate menu served by overdyed blonde older waitress-check. Diane Feinstein eating at the next table because this place is a ' SF Establishment\"- check. Way cool photos on the wall- check. Really nice women , wearing nighties, selling raffle tickets on Thursday nights-check. Need to just go get a beer without dealing with bullshit- check. A-Ok.", "author": "Macy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-28", "description": "Me and my best friend visited this place after the Giants-Phillies game and when we walked into this bar, it definitely was a throw-back bar of the golden days of the Pacific Coast League and the Seals. Lots of baseball memorabilia on the walls which was wonderful. We met this bartender, Jimmy, who is surely but quite nice. He bought me and my pal Jose Cuervo 1800 Silver Tequila shots for my birthday which was very nice of him. The crowd is blue collar and real people, no pretentiousness at this place. I enjoyed this place and will no doubt be back to my old hood,", "author": "jack d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-29", "description": "This place is great. The food is really good. Make sure to try a breakfast burrito they are chronic! I mostly eat breakfast there, but I have also had lunch there too on a few occasions, and it's nice. The bartender on Sunday mornings, who's name I forgot, always recognizes my girlfriend and I and hooks us up with either a bloody marry (very tasty) or a mimosa for free. Service is always good, they gladly took back my girlfriends french toast when it was under cooked and cooked a new order (didn't re-cook the same toast). Don't miss this place especially if you're into baseball.\n They do have a strange system with how they use credit cards, but there is an ATM if you feel like paying cash.", "author": "Garrett H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-21", "description": "You know, I wanted to not like this place.  From the outside, it looks like a dingy bar...but when you walk in, you realize...this is a pretty nice sit down restaurant with white linen napkins! \n\nFood was great in fact.  Server was hilarious, hot and on top of everything.  \n\nIt's great to find a local establishment with such history in a neighborhood...this is a definite must at least one time in your life.", "author": "Matt V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-23", "description": "Yesterday, a friend and I went in there with a friend.  The bartender wasn't helpful, and he gave me back a $10 bill when I presented him with a $20.  When I asked for change, he told me no need and brushed me off.  I won't be back.", "author": "Gabrielle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-20", "description": "Try the Sand Dabs when they're on special!\nInsanely great (and the waitress may even offer to bone them for you). \nBut, that's really unnecessary anyway, cause it all comes right off the bone.\nEverything there is too good to be true.\nLove it!", "author": "No M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-28", "description": "Not bad. My burger was cooked well-done and the service was fast and efficient. Good place to hang out too.", "author": "Joe V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-14", "description": "I used to eat there often and it was very good but the service was slow.  They recently changed management so I am not sure how it stacks up now.  Cool bar too.  \n\n** I have been back a few times since the new managment and I would say the food has gone down hill.  The service is slow, the prices are so so, the food is nothing to remember.", "author": "Enzo S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-26", "description": "pretty good spot to watch the world cup!  i wonder if they like the giants here?!  we managed to snag a table on the bungalow thing in the back, which worked to our advantage since we noticed about a 10-15 second delay with the TVs inside.  everyone inside ended up with spoiled surprises since we had already cheered or boo'd!\n\na trusty friend had the breakfast burrito and said it was good, goes for about $5.50.  i had some potatoes off someone else's plate and they were so-so.  breakfast starts at 7, ends at 11.\n\nseems like a good place to catch a game, not sure how regular nightlife plays out here.  it's a little too isolated from other bars if you're looking to hop around, but it's very laid back and good for a group of close friends.", "author": "eric f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-17", "description": "The fact that Double Play only has 25 reviews on Yelp speaks to the fact that we're just not the crowd they cater to!  Younger people, that is.  You see, across the street, where the Safeway shopping center stands, used to be the home of the Seals.  The interior of the bar is chock full of baseball memorabilia.  Celebrating it's 100th Anniversary, I think it's safe to say this place is truly...Old School  \nMain highlights of the Double Play experience:\nThe bar begins serving at 7:00 am, you might find off duty postal and UPS workers at the bar, lots of working class folk mixed with guys from the office- and for a San Francisco bar, the place is crawling with straight men!!  It's definitely a sports bar/restaurant.  \nThey have pretty decent Italian food the kind you might find comforting, but not great if you are from the East Coast.  Lately I've ordered take out from their kitchen, and I give them props for using eco-friendly to-go containers made of potatoes, of all things.  I usually get fettuccine Alfredo with grilled chicken, and the pasta is actually really good.  Thanks for the patience with my order, Double Play!  \nA couple more highlights include their own parking lot, with a valet, and large banquet tables in the back for big groups.  I've seen many a holiday party roll out of here mid-day, looking very Jolly.", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-06", "description": "so, when i walk in, sally has my drink waiting. am i a regular? no. they just remember you here. this is the real thang, peeps. jim and sally rock and kasha did, too. if you want an authentic SF bar where the service is extraordinary, plop down at double play. consider: the folks from sfspca wouldn't lead you astray (sorry for the bad pun).\n\nin short: the shizznit.", "author": "mindy a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-04", "description": "i love double play.\n\nyou can usually find me here if theres a game on during lunch hour.  or if theres a game on after work.  or if i just need a good laugh on a thursday. \n\nanyway, i love this place so much that i began helen's day o'fun (aka, my birthday) here with their breakfast burrito.  oh yes.  their breakfast burrito is a big giant wrap of deliciousness.  i have to talk myself out of getting one every single day i pass by this place on my way to work.  the \"famous breakfast burritos\" sign outside the door doesnt help either.  because its not lying.  \n\nmy day o'fun continued onto anchor steam brewery, but unavoidably ended up back at double play because it is just that great.  we sat in the amazing back room where all four walls are painted to look like you are standing in the middle of the baseball field before a sold out crowd at the ballpark, complete with a pitcher on the mound, pitching to you.  this, of course, led to ridiculously fun \"batting\" pictures.\n\nlove. it.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-27", "description": "a friend and I went here to watch the marchmadness games & it started out good.  The bartender came right over and we asked if they had happy hour.  He told us that most beers are 3$ and we were excited.  We had several rounds and asked for a menu.  He gave us the menu, we ordered what the prices were, but when the bill came, the charges were inflated on the food and our beerz were $5.  When we asked about it, he told us that our beer was the only beer for that price.  He should of told us that when we ordered.  It is very unprofessional!  We also observed the bartender giving multiple on the house drinks to his buddies while we were there for 1 1/2 hrs.  I gues the bartender had to make up the price differences to the house.  Better spots to watch the games, get better deals, food is mediocre @ best.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-30", "description": "Tuesday's special at lunch - homemade spaghetti and meatballs! You just can't miss it. Honestly, one of the best plates of spaghetti and meatballs I've ever had. Large portions too, so you can save some for later.", "author": "Judy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-24", "description": "wow.  the portions are gynormous here!  and so is the place (surprisingly)!  \n\ni actually really liked the food here; it seems pretty good to me!\n\nit has tons of cool baseball memorabilia in the back room and a couple of tvs.  not particularly the nicest place, but pretty cool to check out.", "author": "H. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-11", "description": "This place has great character.  The B.L.A.T. sandwich was great, except I had to slice my own avocado and put it on the sandwich.  Good fries, friendly service, good deal.  A bit rundown goes with the character, it's easy to see why it was packed for lunch.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-09", "description": "A gem dive bar full of regulars drinking stiff drinks and rolling dice...the food is good and the bartenders are better.  Wayne and Jimmy are classic.  Flat out love it!", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-03", "description": "Food and atmosphere...blah blah blah!  Can't believe nobody mentioned the hard core old school waitress!", "author": "Mary S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-16", "description": "I want to give this place more than two stars, but I can't. The chicken sandwich was delicious, and the fries didn't seem the greasy. But I cannot believe they gave me a single tomato for two the huge halves of my sandwich, and then there was the extra long hair in my soda. Was thinking I'd get that comped, not quite.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-14", "description": "I used to have a really shitty job down the street from Double Play. The employees were in a seperate office from management, so we would often skip out and spend the afternoon at Double Play drinking and playing dice before returning back to work. Ah...good times. We referred to these days as our \"off-site\" days. Many happy lunch times, afternoons and evenings were spent here. I hated the job, but I miss the Double Play...", "author": "Jason D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-23", "description": "I consider any dive bar where people over 40 frequent a \"townie\" bar, so this qualifies.  It does have some decent qualities for the under 35 (is 35 the new 30? I don't know anything about 30 somethings yet -- let's say under 30) crowd.  The food is decent diner/bar food.  I especially like the tuna melt -- they give caramelized onions on the side that you can throw in the sandwich.  The waitress(es) are friendly.  They have a small and fairly respectable collection of draft beers.  They don't call me a sissy to my face when I ask them to change the station to a soccer game.  I couldn't ask for much more.", "author": "Avi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-07", "description": "5 stars for the Breakfast-- most notably the amazing, I'm talking AMAZING, bacon fritata.  Its filling, delicious, cheap and comes with some awesome homemade salsa.", "author": "L J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-27", "description": "The history of this place alone makes it worth checking out. The bartender was cool and I enjoyed the beer on tap. The food was OK, but that's not why I went there.", "author": "Justin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-21", "description": "MISOGYNISTS\n\nWow.  I came here with my girlfriend to have a drink while we waited for our friend to get off work nearby, with no warning as to what was to come our way.\n\nThe bartender proceeded to tell my girlfriend (in almost as many words) that she is a whore because, as a woman, she chooses when to open her legs for me.  Because of course when she doesn't it's considered rape.  I was flabbergasted.  My girlfriend immediately left the bar and ran to our friend's work.  I tried to get a check for ten minutes before I was finally able to leave; the whole time the bartender kept trying to joke with me about women.  It took all I had in me not to smash something over the old man's head.  \n\nNEVER GO HERE.  EVER.  If you are a woman, a man who respects women, or any other type of person with any decency you will avoid this place at all costs.  It's well worth the walk to another bar.\n\nThe bartender in question, if you're interested, is named Jimmy.  He comes across as an old, charming man, but be forewarned: he is a nasty, woman-hating *sshole.", "author": "robert b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-08", "description": "Good food, good bloody mary's.  normal sports bar kitsch.  parking lot out back for free.", "author": "Andy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-04", "description": "good portion but the food is so-so.  Only ate here because it was close to my work place.  Customer service is a hit or miss.  Bring your jacket if you are sitting in the backroom.", "author": "L C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "What can I say, OUTSTANDING FOOD, OUTSTANDING CUSTOMER SERVICE, OUTSTANDING ATMOSPHERE. Sugar Lounge should take notes. My girl and I go there every Friday night for a great time. The owner rocks and the girl bartender rocks, as well as Jimmie. The food is top quality, we have never had a bad meal or appetizer. Thank you for your service, we love you guys you rock!!!", "author": "joy e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-12", "description": "5 stars for the breakfast burrito, 3 stars for the BLT and fries, and 5 stars for the friendly dude behind the counter who made small talk with me while I waited for my food.  Anyone who can do the friendly-bartender thing at 8:30 AM gets my vote.", "author": "Kat W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-12", "description": "Food is great, Chris and Kristen are cool bartenders. Just got some new tv's. Good for private bookings too. But easy on the Jameson shots guys, geez", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-08", "description": "We had a private party here and it was great! Rafael was accomodating, reasonable and prepared some great food. The place is so fun that's all you need. We had about 75 and it was no problem. You get both rooms and all the atmosphere that comes with it. If you want fancy this isn't it, but if you want fun check it out.", "author": "Shelly C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-05", "description": "Remembered this place from a job I did here years ago and was totally disappointed.  Food was Ok and it is a decent lunch place but as a sports bar it is  still in the days when Seals Stadium was across the street.  Crowd at night looked like a rest home.   Better off heading to the Overtime.", "author": "Brian R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-14", "description": "although this is technically a \"restaurant\", i find it's a great place for a saturday afternoon - the friendly bartender, Casha, will make you an excellent mixed drink, or just a cold beer on a warm day.  friendly crowd hangs out there - mostly locals - which makes for a very entertaining and sometimes enlightening experience!  there's a nice pool table in the back, and a great space for groups.  i've even had a birthday party here - everyone enjoyed it.  and although people do act up sometimes (as they do at bars) the staff are infinitely patient and always keep a smile on their faces.", "author": "Stacey R."}
