{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "While in San Francisco to Run the S.F. Marathon we visited this gem of a chinese restaurant to replenish our calories from running the race and it was perfect.  we love chinese food and eat it a lot in Los Angeles and this restaraunt ranks up as one of the best. \n\nWe started our meal with rhe lettuce pockets filled with minced chicken...Delicious! As our main course we shared Mushu Pork, Honey Walnut Prawns and Mongolian Beef.  everything was absolutely delicious.  We enjoyed our meal so much we took what we didn't eat back to our hotel to eat for breakfast (cold chinese for breakfast is the best!).\n\nSo, if you are ever in San Francisco and want chinese food,  this place is a must!  You won't be sorry.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Super yummy meal in this cozy, modern Chinese place in Cow Hollow.  We enjoyed the chicken lettuce cups, Mongolian beef, walnut shrimp and mu shu pork.  All were exceptional, with very fresh ingredients.  Even the mu shu pancakes were clearly homemade.  Business was brisk, but we were not rushed.  Tables and chairs are close together, so get cozy and make friends.\n\nWe will definitely be back!", "author": "Debby C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "My go-to Chinese restaurant in San Francisco! Why? Quality food and great customer service. Isn't that what we all want!\n\nYes it's probably more Americanized Chinese. But Gary and Christina, owners extraordinaire... are full-blooded Chinese! They provide a beautiful, intimate restaurant.... I would call of contemporary design on Chestnut Street in the Marina District of San Francisco... one of my most favorite areas. It is truly an area where the locals live, eat, shop, work out, and get their hair and nails done:-). My point is, in order to stay in business, you better provide a great product in this neighborhood. It is not a tourist-only locale.\n\nThe food is fresh fresh fresh! I say this with confidence because I have eaten here so many times. Always different food items and each one never disappointing. I have my favorites for sure but I try and order one new thing each time. The wine list is incredible. There are not too many Chinese restaurants where you can dine AND  have an incredible California wine from which to choose. Or a really good beer to pair with the spicy food. They offer a Navarro Gewurtztraminer wine which pairs the best with Chinese food. My favorite, however, is their Duckhorn Sauvignon Blanc. I'm sorry I make no apologies for wanting really good wine with my outstanding Chinese food :). And I love they take reservations. I also want to note the takeout business they do. My goodness... you would think they were giving the food away. Again these are the locals who live in the neighborhood wanting quality food at home. And I see these people in the restaurant with their families and I love it. My last visit I noted two solo diners ,  obviously locals ,  enjoying their food. Their wait staff have all been there for a long time and that is certainly a good sign. The young woman that waited on us this last visit is just so nice and so accommodating and always wants to make your visit an outstanding one.\n\nThe price point for this quality food is incredible. I don't know how they offer the quality ingredients and generous portions at these prices.\n\nThis last visit was as outstanding as ever. I always enjoy seeing Christina at the front taking care of business now that her children are grown.\n\nThank you Christina and Gary for providing such a quality restaurant.\nP.s. did I spell Gewurztraminer right LOL", "author": "Lizz Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-22", "description": "I have been going to this restaurant on and off since it opened.  They must be finding it difficult to employ good cooks because it has become so unreliable.  Prices keep going way up and portions keep shrinking. Ordered the pork pot stickers (4 for $12.00), I thought they made a mistake and used some kind of tasteless chicken, the texture was completely off and it was mushy.  Never had a pot sticker like that and hope to not have another one.  Another time I ordered the Hong Kong Noodles ($15.00), was a soupy concoction that again was without acceptable flavor.  I know good chinese food, and this is not it, especially now.", "author": "B.K. M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-02", "description": "I've been here once before about 8 months ago and thought the food was excellent but this time around it was a disgrace. The one star is mostly for our server John who was great and attentive. The food was cold, lacked flavor and just bad. I had to asked for salt as the food was that bland. Don't waste your money here.", "author": "D. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "Bottom line:  Cozy, quality, friendly Chinese dining experience.\n\nContext:  Visited a few times over the past few years, either solo or with my boyfriend.  We live nearby; for some reason we haven't gone much in the past, but I think we may visit more often in the future.\n\nService:  Very friendly and attentive.\n\nFood:  On our most recent visit, we ordered green tea; beef chow fun; savory, sweet, stir-fried beef; and tea-smoked duck.  This was enough for two people's dinner, plus leftovers.\n\nDragon Well Green Tea : Mild and enjoyable.  The menu said it was wok-roasted.  I did not pick up on the roasted flavor, but my boyfriend did.\n\nBeef Chow Fun : Satisfying.\n\nSavory, Sweet, Stir-fried Beef : We both liked the texture of the broccoli, which was cooked, but still a bit crisp.  My boyfriend really enjoyed this dish, though I was not quite in the mood for sweetness.\n\nTea-Smoked Duck : Overall good.  Had a definite smoked aroma, and tasted of tea. It was interesting, but in general, we like the taste of duck on its own, so probably prefer more traditional preparations of peking duck.  The buns, though, were perfectly done - warm, fluffy, and mild in taste.", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-10", "description": "I used to love their Kung Pao chicken. But now the diced chicken cubes are getting smaller and smaller, and there are enough peanuts to feed an elephant. To top it all off? The takeout container is only three quarters full at best. They really shouldn't be cutting corners like this when they charge $14 for the dish.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "I have been really impressed every time I've dined at Dragon Well. The dishes are flavorful, but not greasy at all. \n\nThe chicken and vegetable stir fry is one favorite - a nice mix of veggies with chicken, cooked in a light sauce. I've also enjoyed the lettuce wraps and found the fried rice not unnecessarily heavy. Additionally, whenever I am sick I order a large hot and sour soup to go and it always seems to do the trick!", "author": "Holly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "I love this place.  In fact, I like it so much I eat here several times a month.\n\nThe dragon beef is delicious, the lettuce cups are served in very large lettuce leaves, the sautéed veggies are made with carrots, bok choy, broccoli, mushrooms, in a light garlic sauce.  \n\nEverything is ala cart. \n\nThe chicken salad and veggie salad (tofu added) are light and tasty.  The dressing is delicious.\n\nThe won ton soup (small cup served)  includes 3 or 4 won ton, fresh spinach, scallions in a tasty broth.\n\nI could go on and on.  You won't be disappointed.  It's a great neighborhood place, with lots of regulars frequenting it.  It's consistently good.\n\nProfessional service, and you're never rushed.", "author": "Lois L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Great Chinese food experience. I went there with a group of six. We made reservations beforehand since the place is small. There was a one minute delay getting our table together and the manger gave us an order of chicken lettuce wraps on the house for our trouble. \n\nThe server was very good. He made menu and wine recommendations and didn't come off as pushy or like he was trying to get us to buy the most expensive things on the menu. \n\nMy wife is gluten free, and even though the restaurant had a separate GF menu, the server still pointed out good choices for her.\n\nWe ended up getting six dishes, plus two orders of pot stickers. The potstickers were very large and tasty. The Kung Pao Chicken (GF) was great, as were the Mongolian Beef (GF) and Beef Chow Fun (GF). The Chow Fun, in particular, was nice... Light and with a smoky flavor.\n\nFor non-GF dishes, we got Mu Shu Pork, Walnut Prawns and Savory and Sweet Beef. The mu shu was the weakest, but still good. Walnut prawns had a light batter coating on them, but they still had the tails on underneath. Everyone liked the beef.\n\nSome people have complained about the prices of the meals, but I found them pretty reasonable for downtown San Francisco. The servings were pretty large, and each dish was $15-20, which I think is fair. That's about the price of a decent cheeseburger at a lot of downtown places.\n\nOverall, it was a great experience. My in-laws, who regularly visit San Francisco, said they would be going back.\n\nMy one recommendation is that you make reservations because the place is kind of small.", "author": "Tom D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-31", "description": "For starters I came in because I Uber and I picked up a lady who purchased food from you guys and it smelled good. So once I arrived to the area again I decided to give it a try. When I came in i had my work clothes on so that may have thrown the two men off that were at the front counter (the place seemed to have a really nice dressed older crowd)They did not acknowledge me and finally one of them came back and asked if I could be helped and I told him I was there to pick up my order. I picked up the order and it was mediocre at best. The food was very bland. I had ordered the barbecue Fried rice and potstickers. Needless to say I will never come back", "author": "elise j."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "The venue looks nice and cute! The food are ok! We ordered beef chow fun and chicken vegetables! The staff are friendly but the service is a little slow. Another thing I don't like is that rice doesn't come with main dish, we had to order and paid extra. Asian dishes should always come with rice. Probably won't be back!", "author": "Green B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "Abolsutely horrible customer service. My 85 year old grandmother came in to pick up a phone order and we accidentally ordered one more item than we wanted. When she asked to take that item off of her order the manager refused and laughed in her face telling her she either takes the whole order or nothing. Called to talk to the manager about this incident and he actually laughed at me. Horrible customer service and manager is a pompous JERK. Don't spend your money here.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-19", "description": "Pretty good food but recently raised their prices by more than 70% on some items. Bummer, we used to go about once per week but will have to find a new spot.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "This is an upscale Chinese place.\n\nI ordered the hot and sour soup and a tea. It was good, the soup clearly had great, fresh ingredients and very little (if any) added msg. It's the kind of place I'd take my parents versus going here myself.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "Dragon Well, on Chestnut Street, has been a family favorite.  But, it is my first time here.  The restaurant is bright and decorated with colorful photos on the wall.  We received a friendly greeting and even though is was Friday at noon, we had our pick of seating.  Come 12:30, the tables were filled.\n\nFor lunch, we ordered family style:  Won Ton Soup, Beef Chow Fun, Salt and Chili Pepper, and Ma Po Tofu with pork.  The calamari came in medium sized pieces on a bed of fried Won Ton strips.  It was a little greasy, but crispy with the an appropriate amount of salt to bring out the flavor.  The Jalapeno jalapeno pepper slices were more of a garnish.  I ate all of the slices, since my Mom and sister left those to me!  The Ma Po Tofu with pork had a nice spicy kick to it.  Enjoy it with rice.  The small cup of soup was crammed with four Won Tons.  I liked the Beef Chow Fun.\n\nThe service was well-paced, with a small break between and appetizers and our main meal.  At the conclusion of our meal, a bowl of fortune cookies was brought to us, regular and chocolate.\n\nI recommend stopping by while you are in the neighborhood, but since this is Chestnut Street, you may have to circle around for parking or walk a bit further if you park in the neighboring streets.  Three stars for the food and one extra of the good service.", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "This Chinese restaurant is pretty good.\n\nI visited this place a few times.\nThe last time I went there, I took a Jook and the Chicken noodle soup. They told me to wait 15mn, so I walked around on Chestnut Street, I came back 15mn later and It was ready. Both soups were delicous, and my friend even told me she will come back for that Chicken noodle soup.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "We are from out of town and wanted to try out some local Asian food and I have to say that this place did not disappoint us at all. My boyfriend and I got 3 different types of food and shared them, because we couldn't decide on just 1 each. So if you're local or just visiting I highly recommend it and the prices are reasonable. Also the staff are friendly and attentive.", "author": "Leticia J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-14", "description": "This is more like a mall food court's Chinese food: salty, greasy, with huge chunks of scallion or onions everywhere.  Avoid this place for both food and service! \n\nI have received consistently bad customer service for both dine-in and takeout.  After a couple times of each (there isn't much choice for Chinese food in the neighborhood), I refuse to come here again (especially after prices went up).  The older Asian lady (manager?) is always rude and condescending.  $10 for 4 potstickers is no bueno in my book and $16 for Mongolian beef (let me tell you, the $16 doesn't buy you flavor)!\nThe potstickers tasted fine, but having tried a few entrees, nothing else tasted good at all.  Lemongrass chicken- gross.  Beef chow fun- grisly pieces of beef. I grew up near Monterey Park in LA and know what delicious Chinese food should taste like.", "author": "Kari L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-30", "description": "Ordered $150 worth of lunch to-go today and was endlessly berated by the owner because I called and asked (VERY NICELY) if they could please bring it to the sidewalk, and that I will gladly tip. I explained how there was no parking anywhere so I stopped directly in front of the restaurant... so close that I could throw an egg roll and hit the front door with it. They could see me waving at them when they picked up the phone. What REALLY pissed me off in the whole rant was when he angrily said something like \"this is asking for a lot!\" - regarding my request to bring the bags and credit card slip to sign (TO THE SIDEWALK IN FRONT OF THEIR DOOR). I didn't want to get a ticket, which is why I stayed in the car. \n\nIf the owner ever reads this: For me to have requested that you walk out to the sidewalk and hand me two bags and a check to sign is NOT asking a lot... especially for a $150 order. Consider the average bill for this place, and how many times you'd have to walk back and forth from the kitchen to service a table. \n\nAs I'm signing this check, he continues to angrily berate me about how there's a table upstairs, and people on the phone, and how they don't do this... etc etc etc.. AND THIS GUY IS THE OWNER! There was maybe one or two tables seated in the main room, and I could see that because I was right outside. Even if there was a table of eleven somewhere, it wouldn't have made a difference in the very inappropriate manner in which he behaved. Insult on injury- he voluntarily told me (as he walked away) that there were no utensils and that I would have to figure that out myself. \n\nI didn't say much to prompt this type of behavior... I was stunned and shocked that I could barely get words out of my mouth. I can't believe I even followed through on my promise to tip for a to-go order to be brought to me, in front of their door. \n\nThere won't be a next time, and I will refuse to bring food from this place to ANY of the offices I work with. I told my clients this today as well. They won't be patronizing your establishment again either. My clients told me that I should have just left and have him eat the $150 order... I'm too nice for that, even though this establishment didn't deserve my kindness or business.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-04", "description": "i go here easily once even twice a week i love it here. The food is amazing but i am not giving it a one star at all over food if not for the lack of disrespect i felt from the waitress. I asked for chili oil which he brought me yet it was empty. I asked him for another one and it was empty. I asked again and the third time was the charm. IT was a bit over 68 dollars for our food and im the person who tips by how good the customer service was and his was not the best. I tipped him 10% of what my check was. As my husband and i are leaving he stops us and says if we can leave a 15% tip because at the restaurant it was a policy. I told him thats all i had in cash we had paid in card and could have easily left a tip on it but it was a lack of service. My husband told me to add on the card and i was about too but i simply told him you know what i always leave what i left depending on the person and the simple fact that you asked for more tip is absurd. We left and i was very upset and not sure if i will be back.", "author": "Lizz C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "This place is fantastic! We have ordered from here so many times when we are looking for a delicious hearty non-greasy meal. The chicken chow mein is DELICIOUS and non-greasy. Lots of fresh veggies in it as well. We also absolutely love the pork pot stickers and the hot and sour soup. We would also recommend the my shu pork, eggplant and kung pao chicken. Order extra and you can make a stir fry of the leftovers the next morning! This is the place to go if you're looking for some delicious Chinese food!", "author": "Emily R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-08", "description": "The Dragon Well could be something great...\n\nThe menu here is limited all fitting on one page but even with a smaller menu the food doesn't get enough of the attention it needs, in my opinion the food needs a lot of help most of what I've had here was either bland or salty.\n\nThe waitstaff here is very kind and friendly so that is a huge plus and the only reason for the extra star.\n\n\nAppetizers :\n\n- Salt and Chili Pepper Calamari- 2 stars on a good day but it will either be too salty or soggy and bland which was what I experienced with the dish last night. Definitely not worth the $13.\n\n- Tea Smoked Duck - 4 stars, It's very tasty but even for being an appetizer the portion is on the smaller side.\n\nSoups: \n\n- Won Ton Noodle Soup - 2 stars - The broth on this soup is very bland , I always see everyone adding large amounts of soy sauce or chili to it in a failed attempt to make it better. The noodles in this soup seem to just be in one big block and when you actually taste them they just taste like the were covered in flour or left sitting in some starch. The won tons are the only thing in this soup that is quite tasty on it's own.\n\nVeggie Courses:\n\n- Stir Fried Vegetables - 1  star- Once again what could be a great dish is hit with the curse of blandness. This would be great with something as simple as a little more salt and pepper. \n\nVeggie Fried Rice - 4 stars - This dish  was as tasty as it was hearty, If I ever come back this will be my go to.\n\nDinner/Main Courses:\n\n- Chicken Chow Mein - 4 stars The noodles are on the thinner side but overall this was dish was tasty and the pieces of chicken were tender and flavorful\n\n- Kung Pao Prawns - 0 stars -  This was a huge disappointment and a dish I'd advise against ordering if you love Kung Pao Prawns. When I think of Kung Pao Prawns , I think of crispy prawns with enough heat with celery and peanuts. This dish reminded me of buffalo wings :(  The sauce the prawns where tossed was so tart and vinegary that none of the heat that was supposed to be there came through. It came with a mix of broccoli and cauliflower and peanuts which were the best part of the dish.  ** For switching out the chicken for prawns there is a $4-$5 fee which would be fine if the dish was  actually good but it's not :// \n\n- Stir Fry Chicken and Vegetables - 3 stars - The chicken was quite tasty and flavorful while the veggies were lacking.\n\n- Seafood Bird's Nest - 3 stars only b/c the best part of this dish is the actual nest made of potatoes and who can hate on potatoes. The scallops were and prawns were ok in flavor not too great but also not entirely disappointing, the calamari I had to actually stop to make sure it was in there because of the tiny mini pieces you get in the dish. \n\n- Stir Fried Salmon - 4 stars This was the tastiest dish imo , The salmon was tasty and the tofu while I thought the pieces were too big very nicely absorbed the sauce they they were served in, If I'm ever dragged here again I'll make sure to order this dish. \n\n- Crystal Prawns - 0 stars this dish could be great but once again there is no seasoning. It comes covered in a mound of soy beans too many for the size of the dish. \n\n\n\nThe Dragon Well is one of my least favorite places for Chinese food. I've been here about 4 times b/c of family and unless I'm dragged here I won't be back.\n\nSave your time and money & just  find another Chinese spot.", "author": "Glenda A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Excellent food that doesnt make you feel like you drank a gallon of milk real fast..... very and delicious. You taste the food not the grease!", "author": "Tim J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-29", "description": "Small spot where people cram into the narrow entrance for either take out or to get a table. Food portions were a good size. The flavor just was not worth the $30 for Hong Kong Noodles and pork dumplings. \n\nThe noodles came as a fried side which requires the liquid from the meat and veggies to soften up.  Was expecting actual noodles. Reminded me of opening a pack of top Ramen and dumping sauce on top. Won't order it again. Don't know if I will be back.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "Dragon Well might just be my favorite part of SF. Seriously though. I have Celiacs and normally can't eat Chinese food... like ever. I can't even really eat at most places that offer GF selections because they don't have a 100% GF kitchen, I'm that sensitive. It makes dining out super stressful but at Dragon Well let them know you're GF and they'll give you a full GF menu so you can browse freely and don't need to ask about every dish. For a minute I can pretend I'm normal, in a normal restaurant, ordering like a normal person AND I didn't get sick! It's a miracle, Dragon Well is Chinese heaven on Earth.\n\nGet the Bird's Nest. It's definitely my favorite but I also am a big fan of the Chicken Chow Mein... just get both, Dragon Well leftovers are the best. \n\nIf you're a spicy food person the Mongolian Beef is good, the Lemongrass Chicken is even better. \n\nThe service we found to be mixed, some nights we went it was incredible and then other nights not as good but honestly, for me, it doesn't even matter as long as I get my Dragon Well fix.", "author": "Emily B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-28", "description": "I had high hopes for Dragon Well. I was there once previously, and although did not find service all that spectacular, had no real complaints. The food was good \"Chinese gourmet.\" \n\nMy second time at Dragon Well was a complete disaster. The phone was already ringing when I entered. I waited to be seated. A waiter approached dragging his feet. Instead of acknowledging me, he took his time putting away some receipts. I tried to ask about being seated. He cut me off before I could produce a full word, saying he had to answer the phone. \n\nHe took the phone order. I looked around. There was a family seated in the front and another waiter eating lunch in the back. \n\nFinally I was seated. As I looked at the menu, another man walked in and seated himself. He asked the same waiter for the menu. Instead, the waiter answered another phone order and then took mine. \n\nThe man asked for the menu a second time. I shook my head in disbelief of the terrible service. I tried to settle down, but as I was looking around the restaurant, the waiter eating in the back had a napkin stuck up his nose.\n\nI had it. There was no way I was going to pay $20 plus tip at a restaurant where waiters don't take there jobs seriously and the customer is ignored.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "I love this place. Best Chinese food in San Francisco. The pot stickers are thick and yummy, not the hard tiny mass manufactured like other places.  \n\nThe chow Mein is to die for. I get mixed with all meats. If off menu but they do it for a little extra and it makes great breakfast the next day. \n\nYum yum!", "author": "Jason H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Very good food and service. Place was clean. I recommend the Mongolian beef. It had a nice spice to it.", "author": "Kenia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Yay! Gluten freee menu! So exciting. So hard to find great gluten free Chinese food! Yum!", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Really good spot for Chinese in the Marina.  The best potstickers in San Francisco, and a host of dishes that are significantly fresher and more thoughtfully prepared than the average:  especially the Mu Shu Pork, unique and more mindfully done than the dense mash of julienned cabbage and meat you get everywhere else.  Friendly service too.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "Superb food, mostly good service, welcoming feel.\n \nBUT, we were appalled when a customer with a dog was seated.  It seems every dog in SF is labeled as a service dog.  Although I'm a dog person, I believe animals don't belong in restaurants.  The host did not say a word to the patron.", "author": "darcy f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "The hubby and I were pleasantly surprised by Dragon Well.  The food is very fresh and flavorful, and we really appreciate the use of high quality ingredients for traditional dishes, which can be difficult to find in SF.\n\nI was craving rice porridge and Dragon Well's delicately seasoned chicken porridge hit the spot perfectly.  The hubby enjoyed his veggie mu shu and also the tea duck.  Surprisingly, the stand out in the tea duck dish for us was the super fresh buns.  \n\nThe sizes are modest but suited to the price point, quality, and location.  The service was friendly and efficient.  We went on a rainy Sunday evening and the restaurant was half full but we saw a steady stream of folks coming in for pick up.  We look forward to returning here and trying other dishes!", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-09", "description": "Poor customer service and bad food. We have been customers here for about a decade. After tonight, it was the last straw and we're not coming back. I was already thinking that their food was poor quality. What tipped the scales tonight is that I got reprimanded for taking 5 of their cookies with my to go order. The soup is big enough for me and the kids and my son was in a bad mood and so 2 of those cookies went to him. I was already overwhelmed and this was just another unneeded kick. That'll be the last time I'm coming there.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "Dragon Well was a solid gluten free find in San Francisco, and you can bet I'll be back next time I'm in town. \n\nWe walked from Ghirardelli square, after being all touristy and checking out all the chocolate, and found this restaurant to be in the cutest hipster neighborhood. Around dinner time, there are so many 20 and 30-somethings walking around, and the street is alive with restaurants and shops alike. We only waited maybe five minutes on a Saturday night for an open table. I read a review that stated this place is somewhat like a local P.F. Changs. It isn't at all. The flavors were way more original, and it reminded me way more of going to a hole-in-the-wall Chinese place than some Americanized chain.\n\nI was so excited at all the gluten free options on the menu that my dad and I way over ordered. We got the lemongrass chicken (surprisingly spicy), Mongolian beef (drier and spicier than I'm used to), and the chow fun noodles (a little bland and thicker noodles than I expected). Each dish alone would have left us with leftovers. But on the plus side, we had enough extra food for lunch the next day! \n\nAlthough I wasn't particularly blown away by anything I had, I definitely want to try more things on the menu. The prices were SO good (around $12 a dish), and the variety, atmosphere, and location really can't be beat.", "author": "Kate L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "The fried rice had a very \"clean\" flavor--finding fried rice without grease can be a challenge.\n\nHad a mix-up on what I thought I had ordered and they knocked 50% off the price of the dish that was served (and eaten)!", "author": "Miriam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "The place that always hits the spot!  \nDragon Well.\nDragon Well.\n\nWe always start with their wonton noodle soup, so tasty and always fresh.\nMushu Pork is wonderful.\nMongolian beef perfectly spiced.\nPot stickers large and juicy.\nSeafood nest, melts in your mouth.  If you like fresh ginger, you'll love this dish.\n\nWhether you dine in or take out, it's consistantly superlicious!", "author": "Michelle A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "This place has the BEST potstickers in the entire world. My Chinese Grandmother is turning over in her grave right now for me saying this! \n\nTo put it lightly, I am a potsticker enthusiast. A connoisseur, if you will. I have spent many years in search of the perfect potsticker: not too doughy, not too thin, not filled with bullshit cabbage and skimping on the meat, perfectly crispy and so on. I could wax poetic on this for days. \n\nI have lived in the Marina for 13 years and for the better half of it, I avoided this place like the plague for a number of reasons. Mainly because I left like it was fancy Chinese food and the place is filled with the standard annoying, yoga pant wearing women and bros of the marina. The menu is also lacking in that I think there are something like only 14 entrees offered. And cashew chicken isn't one of them! Major fail. \n\nAnyhow, one hungover afternoon, after having already tried and written off all the potstickers within walking distance, I bravely entered Dragon Well, determined to ignore all the exposed toes on the flip flop and salmon colored shirt adorned bros. I ordered the pork potstickers, well done with a side of hot oil: standard operating procedure. My order was ready before I was able to analyze and think terrible thoughts about all the patrons and moseyed on home with my bag of delight.\n\nI opened the box expecting disappointment and was blow away at the sight and smell: they were the perfect color of brown, beautifully crisped and smelled of absolute heaven. Eagerly, I took my first bite. I was instantly hooked and was transported to a happy place I never knew existed. Complete perfection on every level. \n\nAfter weeks of ordering the same thing, even sometimes getting two orders (4 pieces of this perfection is just not enough sometimes), I had to compliment the host on these delicious little wonders! He told me that there is one lady who is the dedicated potsticker maker. That is her one and only job: to make these fabulous and perfect potstickers! How could this be?!! One lady who's sole purpose of employment was to make these little bundles of joy? I was bewildered and amazed. But it makes absolute sense: these fucking things are so perfect, they found their ace and realized she was worth the specialized role as I don't even know if anyone else on the planet could ever replicate such perfection. \n\nSpeaking of perfection, the hot oil is so delicious I could bathe in it. I also had to ask about this. It turns out it is made with garlic and is pressed to perfection and is void of all those annoying chili flakes that can make an otherwise perfect oil have moments of bitterness. \n\nIf you enjoy life, like to eat, then you MUST have an order (or 3) of their potstickers. If you don't, please go fall down some stairs as the world doesn't need your kind! Now get off your phone, laptop or computer and do yourself and your tummy a favor: go to dragon well and get the MF'n potstickers. \n\nYou can thank me later.", "author": "Lucia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "Very good food served by an agreeable staff that was so attentive our teapot was refilled before it went empty.  This is a small restaurant, simply decorated with a moderate noise level when full.\n\nTheir moo shu pork came with steaming fresh pancakes, I liked the kung pao chicken very much and their steamed dumplings were the best I've ever had. The shrimp with walnuts, though tasty, had mayo on them and lacked flavor so I can't recommend that dish. The hot and sour soup is more on the sour side, but excellent. \n\nI thought this Chinese restaurant was a good value because of the high quality of the ingredients and the exceptional service.", "author": "Lynn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-16", "description": "Good for a quick meal or takeout.  Unfortunately they only answer the phone half the times and will also leave you on hold forever. The service is also pretty disinterested.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-07", "description": "Got raw pork in my potstickers with no apology. Were surly about \" we won't charge you.\"  Uhh that's right, you won't. And I won't be back.", "author": "Roberta D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-27", "description": "The service was good and the staff was friendly but the food was disappointing. The Kung pao chicken was a joke. It was mostly onions and peanuts with a few small bits of chicken thrown in. The flavor was good but I didnt want a plate full of peanuts I wanted chicken and they did not deliver. I really wanted to like this place but overall I wasn't satisfied and won't be returning.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "I highly recommend this place. Food is great, service is excellent. You should try their hot and sour soup.", "author": "Dunja Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-22", "description": "Ordered the Chicken Jook, and some beef and salmon entrees, but there was hardly a taste to any of the food at all. The white rice was also soggier than it should be (and is also not Jasmine Rice, at all) They do have a good brown rice though, a semi sweet brown that was actually pretty good. \n\nThe jook was the most disappointing. It's like it's just made with a weak broth, meat simmered rather than a bone simmered stock.  Was hoping to get a soup to beat back a cold, but this one definitely won't be doing that.\n\nMaybe Out The Door's rice porridge has spoiled me, but this stuff is way too expensive for it to be so tasteless.", "author": "Annie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "This place is a SF favorite year in and year out.  The food is absolutely spectacular.\n\nIt is a busy restraint, expect a wait most nights and realize at least 40% of the food is take out.  \n\nGreen Beans, Kung Pao, Butter Fish, Chinese Salad, walnut prawns are to DIE for.\n\nThe Duck is outstanding.  I seriously have not had a single thing on this menu that had not blown me away.  Beetle Nut on Union was inspired was inspired by Dragon Well and the owners are always here making sure the food is perfect.\n\nDownside:  not a full bar\n\nBEST DISH OVERALL:  Tea Smoked Duck", "author": "jennifer w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "I love this place. A friend of mine brought me here for dinner and it couldn't have been better. \n\nThe service was great, we got to chat with the owner who was so nice, our server was great and made sure to check on us and make sure we were taken care of. We got the tofu and vegetables and the won ton soup, and some vegetable potstickers to share. All was so yummy! Great flavor, cooked well, will definitely come here for dinner again soon.\n\nI would definitely recommend this restaurant, being half Chinese I have eaten so much Chinese food growing up and so many restaurants, this place has good Chinese food. Good atmosphere, nice people working, great experience.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Very yummy indeed! Ordered through Postmates and was very pleased with what we got: Spicy Hong Kong Noodles and Scallop Yi Mein. We also ordered potstickers which were very well seasoned and fresh. Please note you will be served the thicker potsticker rather than the thinner gyoza style version. Even though gyoza is obvs Japanese, a lot of Chinese restaurants serve them and call them 'potstickers' (a la Trader Joes) so I like to include them in my order when trying a new place just to see. I look forward to trying this place again! \n\nMy usual go to place is San Tung in the Sunset, but Dragon Well may become my second favorite soon!", "author": "Nina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "Closed out Sunday Funday with a Chinese meal from Dragon Well last Sunday.  The food was solid.  The quality of the ingredients was apparent.  Had the calamari not that memorable, the lettuce cups which were amazing, the Dragon beef was ok could have used some more spice, the salmon was delicate and tasty,  the walnut prawns were again amazing.\nSolid food but could be a bit more spice.", "author": "Robert H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "Nice Decor and fast Service (lunch). Lemongrass chicken was awesome. Wok fried prawns were ok and chowmein was ok.\n\nFood was just warm...I wish it was hotter. It got cold by the time we ended up eating the dishes.", "author": "Nitin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-14", "description": "In town on business, and I wanted some famous sf Chinese food.  The food does not disappoint here, though the decor is more modern feeling than I was expecting. That did not affect my review, but I mention it in case someone reading this is looking for a certain vibe from this place.  \nI had the pot stickers, steamed, the wonton soup, and the Mongolian beef.  All were very good, and the only reason the review is not 5 stars us that the food needed more seasoning.  That's all that was wrong. Service was friendly, quick, and accurate.  Ovetall, a great experience!", "author": "Smitty S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "I eat here all the time.  Best Chinese!! Great Gluten Free Menu.  Dragon Beef is Legit.  Definitely order it.  Lettuce cups are also a fave.  This place is worth your while and if you order to go you can eat it at the Marin Lounge next door, and get a decently priced cocktail.", "author": "Kitty B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "Special because of cleanliness, better than average atmosphere, pleasant service and great food.\nFood is prepared without the usual excess of oil, but still with great flavor and preparation. It was amazing to have moo shu pork that was not taking a bath in oil; served piping hot, and with perfect, just steamed wraps. Yum!\nRe the pot stickers, yes they are unique for their freshness and delightful unique pork filling. Perfect combination of crispy shell but so soft and fresh in the middle.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "This little restaurant is located in the heart of all the action on Chestnut. Arriving without a reservation on a Saturday night, we were greeted by a very friendly front desk woman, later learning she is an owner. We scored with the front table that opens on to Chestnut. We skipped ordering an appetizer and went straight to ordering chicken chow mein, savory sweet stir fried beef, crystal prawns, kung pao and streamed rice. I noticed a lighter touch with the dishes, a good thing. The stir fried beef was a bit too sweet for our tastes (this is our error because \"sweet\" is in the title and we should have known better!). The crystal prawns lacked a lot of sauce flavor but the flavor of the prawns themselves came through but was just a little plain. I will admit to always wanting to find Kung Pao chicken that matches my favorite from another restaurant. This Kung Pao was good, just did not match my favorite. But good food overall. What sets this place apart is their service. Our water glasses were refilled constantly and our waitperson was so attentive. Meanwhile, the owner continued to greet each new patron and phone call with the same friendly and welcoming manner. This was a pleasure to see and we look forward to a return visit.", "author": "Jillian R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "I've eaten here on average once every other week the last 10 years. It's the best Chinese food you'll find in the Marina, no SF, no ANYWHERE! Always fresh, lots of vegetables, better cuts of meat, and not greasy like so many other Chinese food restaurants. I've had everything in the menu and it's all tasty.\nThe owners and staff a some of the nicest and attentive people.\nDragonwell is a gem!", "author": "Jon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "Celiacs and GF peps this place is for you! The food is awesome they have a full GF menu for us. The staff is very nice and well knowledge of gf. One of the only gf Chinese food places in the city. Definitely will be coming back!", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-16", "description": "My only favorite Chinese food restaurant in the Bay Area that does not have MSG in their food! \nTheir Black Bean Chicken is the best dish on the menu! Loooove it! It has just the right amount of spicyness to it.\nThe service has always been good and kinda stay away from the chocolate fortune cookies, they look good but the chocolate tastes funny. Stick with the regular old fortune cookies.", "author": "Cherie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "We had a delicious dinner and can't wait to go back! We had chicken in lettuce cups (appetizer), hot & sour soup, lemongrass chicken, and pea shoots. Everything was great with good seasoning & flavor. Clean restaurant, nice ambiance. \nWe are also fans of Hong Kong Lounge 2, Dragon Beaux, Ton Kiang, Yank Sing and Eliza's (for reference) - so we've eaten good Chinese food to compare. \nWandered in after a movie, but Dragon Well will now be a destination for us.", "author": "Ruth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Awesome hot n sour soup...the Scallops and wild mushrooms in a sweet salty tender and tasty noodles.  A great lunch...the scallops are fresh and flavorful...all goes perfectly with a Tiger beer.  Of couse in Singapore at the Maxwell Food center this dish is $3 bucks...here you need to multiply that by 4x plus....but...this is the Marina district....a great neighborhood.  I will be back to the Dragon!  Great service and ambiance.....lots more on the menu.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "I order takeout from here every few months and eat here less often but every time I do, i ask myself \"why am I not eating here WAY more often?\"  The food is excellent - fresh and delicious  - not at all greasy or salty like one of the other reviews mentioned. I can't profess to trying everything though I would expect if I ordered a deep fried entree, that it might be greasy....but that isn't what I order.  The salmon dishes are excellent, the fried rice dishes and noodle dishes hit it right out of the park for us.  The service is great and it is a great place to take kids.  Will continue to be a staple and we will be going here more often even!", "author": "Coco L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "Dragon Well is our favorite place for gourmet Chinese food. \n\nThe food is always excellent. We have so many items in rotation. We love the Pot Stickers and Minced Lettuce Cups appetizers, Won Ton Noodle Soup, the Chinese Chicken Salad has the BEST citrus vinaigrette, and the Sichuan Green Beans are a perfect balance of spicy and savory. \n\nThe above items are our personal favorites, however, everything we have had on on the menu is delightful. \n\nThe only drawback is because the food is outstanding, sometimes it's hard to get through on the phone! If at first you don't succeed, keep trying, it's so worth it!!", "author": "Lauren O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "7/12/2017 Was not prepared for chilly weather in California in July,   Boy was this New Yorker surprised.  I needed soup in July, a sentence I didn't think I would be saying.    Hotel  suggested we go to Dragon Well,  EXCELLENT suggestion.   Ordered the Salt and Chili Pepper Calamari and the Won Ton Noodle soup.   Afterwards had the hot tea. There was more than enough food for two people, the soup was filling, it had everything.  The \" kitchen sink \" of soup!  Our waiter was extremely friendly, as he told us about additional areas to visit in the area.  Meal was leisurely, we never felt rushed.   From the outside the restaurant is unassuming, very easy to pass up, I would recommend if you are in the area to try it.", "author": "Liliana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-24", "description": "Got lunch at this place the other day and it was super good. All I the Chinese food that I have had lately is kinda sketchy and chewy so I was pleasantly surprised to get such tender meat. I was also pleased that it didn't have the typical tacky decor. \n\nI got the Mongolian beef and it was very flavorful and had a great texture. The best part was that it was only $14 with tax and tip and I had left overs to bring home! \n\nThe staff wasn't suuuper friendly but I was on my break from work and wasn't looking for small talk anyway. \n\nOverall, it was good ad will go back.", "author": "Jessi G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-18", "description": "I remember when this place opened service has gone down and so has the food. \nWhen the wife runs it it's great, when the husband does it's a no go. \nSad it went downhill.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "I love dragon well!\nEvery time I go to the marina I try to stop by.\nLettuce wraps are yummy appetizers.\nI wish the Mongolian beef was spicier but it's still very good.", "author": "E A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "Always solid. Every time. Been coming here for years. Love the Kung Pao and their Chinese Chicken Salad is fresh, healthy, and delicious. Super friendly staff as well.", "author": "J P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "Probably simply the very best Kung Pao chicken I have ever try. Always crave for a good Chinese inspired food and this place never disappoints. Simple, delicious food which is cooked at the extreme high heat of wok which cannot be replicated at the home kitchen. \n\nSweet and sour soup was super tasty as well. Small but very well composed menu with all dishes proved to be a great take out place as well. \n\nRecommended ! Two thumbs up!", "author": "Xela H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-30", "description": "I've been going to Dragon well for over a decade, and having lived close by it quickly became my favorite restaurant. It can be very busy and noisy for evenings and the wait can be long, but I love the consistency of the menu and can always rely on my favorite dishes to be there, like walnut prawns and the garlic eggplant.", "author": "N S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-31", "description": "Small portions for a large price.  Taste ok, but not the usual Chinese Cuisine.....very sterile mixed with Japanese flavors.  Seems like they are trying to be ultra-modern..... not a traditional Chinese Restaurant at all.", "author": "Annette C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-05", "description": "I ordered the Pork Pot Stickers. Although I prefer my dumplings/potstickers to have a thinner wrap, these were very good. The filling was tasty and flavorful, you get 4, and they are on the larger side. Add a lychee iced tea and call it a happy snack!!", "author": "Shawnta W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-20", "description": "For a restaurant which embraces its longevity in the neighborhood I was extremely disappointed by the food, service and atmosphere at Dragon well. The entire restaurant feels sterile, and the food matches this blandness in taste, texture and overall plating. The wonton noodle soup lacked almost all flavor, lest it be drown with enough soy sauce to compensate for it's  flavor, but absolutely nothing could be down to minimize the rubbery noodles that we were served. I don't know how this business has been open 18 years, but I strongly recommend you take your pallets elsewhere for tasty food in the marina", "author": "Rob R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "Wow! Delish! Yum!\nI can't believe this place only has three and half stars. I was immediately impressed when I entered the restaurant. I was promptly greeted by the owner and seated by the lovely window seat. The restaurant was quite busy, but the owner and other staff were very attentive throughout our meal. My husband and I ordered three dishes: pork fried rice, walnut prawns, and moo shu pork. Within a ten minutes all three dishes came steaming hot from the kitchen. Everything looked and smelled DELICIOUS! The pork fried rice was served on a fairly large dish. It could feed four people if you had other entrees. The walnut prawns were cooked and seasoned to perfection. The moo shu pork came with four tortillas and was also AMAZING! I wish I could have eaten more, but I was stuffed by the end of the meal. At the end of the meal, the waitress brought a huge bowl of fortune cookies. It was a  mix of chocolate or regular. We each got to pick out our fortune. Not only was our meal good, but was so was our fortune!\nSupport a family owned and operated restaurant in San Francisco! I would highly recommend this establishment. Thanks for the wonderful evening and memories!", "author": "Stella K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-30", "description": "Food was okay, a bit pricy for being only average.\n\nService wasn't good at all. We ordered for takeout and when we got home we noticed an item wasn't included. I called the store to see if we got charged for the missing item and the woman on the phone said she didn't understand what I was talking about, she instructed me to go online to check the food prices and hung up without another word.\n\nAfter comparing my bill with the online menu prices it appears that I didn't get charged for the item that was left off of my order which was a pleasant surprise. As I went in to pick up my food I overheard an employee tell another customer that they were unable to make the item I was missing but I was never given the same notification throughout any of the process, I would have ordered another dish instead.\n\nTook a little over 30 minutes to get which was a few minutes under the 45 minute estimation. Enjoyed the food for its convenience but with so many other restaurants in the city I find it hard to imagine I'd give them my business again.", "author": "Chris K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-11", "description": "The chicken the China...the Chinese Chicken!\n\nOh, Pardon me as I  Reminisce  about my teen-aged years.\nAnd the on going success of the \"Bare Naked Ladies\" \nI only bring them up because, the lyric and connection to Chinese food.\n\nBrings me to the same thought.....I DON'T LIKE EITHER OF THEM!\n\nOkay, at gunpoint, I would eat Chinese food, or if (My opinions are outnumbered\ndue to the majority) who want to suggest OTHER Food.\n\nNow since, I am about as pompous as the \"Marina\" crowd\nbasically, as shallow as a shower. I think I am entitled to good food.\n\nI want good quality food, I really didn't think it was going to be in the \narms of \"Dragon Well\" and it is American television style Chinese elegance.\n\nThe food has a good sense of healthy grit to it. \nNot overruned by MSG or food flavored subitutes and it should be this way\nit's delicious dishes are very common but the service is the thing that gets the stars.\n\nNow the place is very small, but that's what makes it a adorable...\nwith it's \"take me out on a date, please it's our 3 month anniversary type joint.\" \n\nThey were accommodating for our table of 5.\nWe all ordered separate dishes, but they were all pretty good.\nWe had to wait about \"20 minutes\", which turning until \"an Hour\"\n to get seated, and because of the longer duration for seating,\n\nManagement gave us the complimentary. \"Spring rolls\"\nthey were awesome, the wait staff was beautiful, friendly, good eye contact,\npolite...enough to make their mothers proud.\n\nHere is how I will scale everything on a scale from 1-10\n\n*Springs rolls = Crispy, refreshing, free..the bamboo shoots threw me off. (7)\n\n* Stir-fried Chicken w/ Vegetables is delicious it has bok choy, and carrots, \n   mushrooms, ginger and garlic. Didn't taste frozen, but good enough to feed \n   two people, and I think I was scammed on the chicken. (8)\n \n*Savory, Sweet, Stir-fried Beef 11 \n  Flank steak stir-fried in a rich, sweet and tangy sauce; served over stir-fried broccoli.\n\nYeah, they are legit, as far as Chinese food goes.\n\nP.s. - There was a alcohol beer that was there, It had a large percentage of alcohol.\n           If your reading this, and find out what it is, let me know!", "author": "Michael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "Yes, it is Americanized.  Yes it is both pricey and often has small portions.  Still, in my decade in the Marina, this was a place I frequented, particularly for the soups.  It was a luxury to eat here, but a modest one.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-18", "description": "I had the chicken stir-fry and it was bland as bland can be. It sucks because this is one of the only \"chinese\" places in the Marina.  I would go with something else.", "author": "Matty S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-22", "description": "One of the worst, most over-priced meals I've eaten in SF.\n\nFor about $45, I got fried rice, walnut prawns, and stir fried vegetables (wow, a little pricey?!). \n\nWalnut prawns were covered in globs of gross mayonnaise; I would've asked for it without but the menu never even tells you there's mayo on the dish! All of it is just thrown on a bed of stale lettuce taboot; yuck.  \n\nFried rice was boring, with only pork, scallions, and egg cooked inside. The menu says there's peas and carrots (which would've made it taste better), but I didn't see one piece of either.\n\nVegetables had no flavor, and were barely cooked. I still have a gross aftertaste from whatever was in that crap. Also, tons of tofu. I know it's vegetarian, but I expected more real vegetables, and not tasteless soy product. \n\nAll of this would've been okay had the price been apt, but $45 for three dishes?! Absurd. And on top of that, it took about 40 minutes to make my food (it was a to go order!), even though they said it would take 15-20 minutes. \n\nI will never go back here, and I don't recommend you do either (there is another Chinese place down the street).", "author": "Noah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "Excellent service despite being packed around dinner time. The hot n sour soup is delicious, and tastes fresh and flavorful. Ordered the wok tossed prawns, which was tasty and although not a huge portion, was a perfect portion to share. Would highly recommend!", "author": "Tiffany B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "Over the top \nOne of the Chinese restaurant EVER \nClean and modern great service \nLoved every bite \nGreat value fast and the staff first class", "author": "Stefan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "Food and service always excellent. Our \"GoTo\" for healthy, high quality Chinese. Very nice family run restaurant. Love their pork fried rice, wonton soup, walnut shrimp and moo shu pork.", "author": "S R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-08", "description": "Great service. Came here with 7 children, the waitresses were very helpful, they had fried rice and some chicken and veggies, they loved everything. Colorings are also provided for little ones.\nAdults had a mix of good starters, spring rolls, calamari, lettuce cup and gyoza (latter dough was too thick).\nEntrees, we took Mongolian beef, HK noodles, won ton soup, all plates can be shared for 2. Waitresses again advised us well on choice and we ended with a full bowl of fortune cookies that ended the evening cheerfully.", "author": "Emilie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "This place is a MUST while visiting the Bay Area- phenomenal Chinese food, great menu. Best potstickers and lemongrass chicken I've ever had.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "I hate giving restaurants undeserved stars for mediocre food simply because they're the only place in a neighborhood that dishes up a certain type of food (Saiwalks).\n\nLuckily, Dragon Well is not one of said restaurants.  Sure, it's a bit white-washed Chinese food, but it's actually pretty darn delicious, and it's become a quick pick-up staple for Husband and myself, especially on a chilly night.\n\nMy favorite is the chicken jook, though it's really pricey for mushy rice (try Chinatown joints for a huge bowl for only $5).  I've actually never had a bad meal here, and considering its location in the Marina, where real Chinese food is practically nonexistent, it's really a pleasant surprise.\n\nIf you are stuck in the Marina and crave Chinese food, Dragon Well is a solid pick.  If you want a more budget-friendly and authentic meal, definitely venture to the Richmond, Sunset, or Chinatown.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "The Mongolian beef here is some of the best I've had. The wonton soup is awesome! My wife and I always crave it when it's cold out (you know, July in SF..). Tip: Always go for the cup of wonton soup. For some reason the bowl is different. They add other stuff to it that isn't as good as the cup.", "author": "Vlad B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "Tried this place on a whim while walking by. Had the Mongolian Beef and my husband had the steamed Salmon. Loved every bite", "author": "Jay R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "I'm not sure why the total score for Dragon Well was lower than I had thought but after reading some of the reviews, it appears that many are from out of the area, complaining about take out etc.\n\nThis place is the BEST for healthy, non-greasy, bright al dente cooked vegetable and multi-layered full flavored food !!  I have been in San Francisco for decades and this is the only place I crave when it comes to Chinese cuisine. The others are just Meh and often overcooked, greasy and off flavor.\n\nThe staff are very professional, kind and yes, when the place is booming with the others who realize the food is THAT good...........and your here with the other 250 getting take out, there may be a glitch or two ! ...How about checking the bag before you leave to avoid a mistake cause they will gratefully correct the error.\n\nWE LOVE DRAGON WELL !!!\n\nPS........I am not a family member, owner or have any other connection with this tasty place !", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "Dragon Well is my favorite Chinese restaurant.  Really unique tastes, no msg, very healthy.  The minced chicken lettuce cups are so tasty, the wonton noodle soup is my mainstay with plenty of prawns and chicken, the chicken chow mein is my husband's favorite -- not greasy and a real fresh taste, the crystal prawns super healthy and light, the hot string beans are outrageously wonderful.  We've been going there since it opened, and Christine and her husband are really great hosts.  Makes locals like us return and return for our Birthday parties and special events.  I like the food at Dragon Well much better than a recent $1300 bill for 2 at SF's 3 Michelin star restaurant.  WPJ", "author": "W P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-15", "description": "I know Monday is not prime time, but everything was just off tonight. Service was slow, rice was cold, and the formerly wonderful fish was slathered with too much soy. Server was nice but completely forgot the drink order (surprising as this is usually a profit center. Sadly DW now appears to be past its glory days (and nights).", "author": "Boris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "I usually come to Dragon Well for casual dinners w friends. Love this place, it's super clean and the staff is soooo friendly and accommodating.\n\nFoods to try:\nDragon Beef - it's amazing! Get a side order of rice for this dish\n\nWalnut Prawns- yummy, I think it's the best I have had at any Chinese restaurant!\n\nWok-ness Prawns- it's a little sweet but really yummy battered prawns in an awesome sauce.", "author": "Sepi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "I don't know where to begin!  My father and I stumbled across the restaurant on a Friday afternoon and ordered the wonton noodle soup and the dragon beef.  We were so impressed with the quality of the food (the beef was like filet) and the service that we had to stop again for dinner before flying home on Sunday.  We re-ordered the same two dishes but as we had a 3rd person we added he Ma Po tofu and the hostess treated us to an order of the beef Chao Fun.  We definitely have a new favorite on Chesnut!!  Oh, order the Ma Po Tofu extra spicy!!!!", "author": "J J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-07", "description": "The best Walnut Prawns! Ever! \nMongolian Beef was also really tasty! \nI'm glad that I discovered this restaurant.", "author": "Victoria A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-16", "description": "Love this place! Been here several times and it never disappoints. Here's the scoop:\n\nAmbiance: nice decor, more for a low key dinner, more intimate but not too fancy.  Versatile restaurant that is great for dates, family, or groups. Friendly service and I notice they do pick up.\n\nFood: fresh and good quality. Always get the chicken chow mein, and sometimes get the sweet beef dish, and walnut prawns. Usually have leftovers and they are great the second time around! Also the chocolate fortune cookies are a nice touch!\n\nPrice: around 9 to 13 an entree, and definitely shareable. For a group of 4 I would suggest 3 entrees and a regular size brown rice.\n\nAccessibility: takes reservations but it's usually not too difficult to get a table for a smal group.", "author": "Roya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "This place deserves way more stars. The area where it's located is nice, clean and safe. Food is delicious and it is ready in no time. Portions are big enough to share if you are not extremely hungry but not huge for a good lunch for one person. We ordered noodles with chicken and bbq pork fried rice, both for $12 which was the only adequate price we've had lunch for in San Fran this weekend. Our server, Alexander, was super sweet, attentive and helpful, and chocolate fortune cookies just put a cherry on top. If I ever come back to San Fran i will have lunch there every day!", "author": "Katya G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-18", "description": "Poor management dirty if you see where they store there food you will never eat there again it's next to about six waste can next to the building the Asian guy is a jerk I don't kno if he is the owner or not but how he treat his employee burns me up this place need to be shut down but lucky for him well just send the healthbroad  there instead no stars I hope the picture of the food store next to the waste bend don't shut him down oops", "author": "Jade V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-22", "description": "I normally eat here pretty regularly but after my experience last night with the owner, I won't be back.  I always add extra Bok choy to my wonton noodle soup.  Extra implies that there is bok choy already in the soup.  This soup is the main reason why I kept coming back.  Now apparently there shouldn't be any bok choy in the soup, which is news to be since I have been eating here for almost 2 years.\n\nMy main issue is that I, very nicely, called and said that normally when I ask for extra bok choy, you can tell that there EXTRA bok choy - the soup appears greens due to the amount that they kindly add for me.  The woman on the phone very nicely says she is sorry and to come over and she will give me the extra bok choy on the side.  She also asks if I would like some more broth on the side and I say sure and thank you because i think it is very nice.  \n\nI walk all the way back to the restaurant to have an owner blatantly disrespect me verbally.  She very obnoxiously tells me that I am wrong and that she has had the restaurant for 15 years and never has it included bok choy.  I explain that I know what I am accustomed to eating and only recently started asking for EXTRA bok choy.  She continues to contradict me in front of many other patrons in the restaurant.  How embarrassing.  She tells me it is just spinach.  I know the difference between bok choy and spinach.  But thank you for trying to imply my ignorance.\n\nI choose my battles wisely and wouldn't just for the 'sake of it' call and tell them that they didn't include what they normally do.  I wouldn't take time out of my night to walk all the way back to a restaurant for no reason after I already returned home with my fiancé.  This restaurant is not cheap and yet we continued to go because of their service and there BOK CHOY IN THEIR WONTON NOODLE SOUP!!!!!\n\nThis owner really needs to take a step back and realize that how you treat people will directly affect your business.  This is one of the first times I have dealt with her and my suggestion is for her to stay in the back with the kitchen or stay home.  She absolutely ruined my experience.   I am beyond disappointed in her lack of tact in handling this matter and will be certain not to come back.  I have also gone ahead and told all of my friends who live in the Marina and Pac Heights not to eat there anymore.\n\nOh and I never got the broth either.  Don't offer something and then decide not to give it.", "author": "Christina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "Good food and nice atmosphere!\nAsk for the beef chow mein, it's not on the menu but they will be happy to make, it's delicious\nParking is hard..", "author": "Keri A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "My and my boyfriend were looking for somewhere to eat and stumbled across this place. \nWe started out with the potstickers and then shared the Chicken Chow Mein and the Wok Fried Prawns. All three were delicious! \nThe service was great and the food came out fast. \nI was overall very satisfied and would recommend this place to anyone.", "author": "Abby A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-28", "description": "I had a craving for Chinese and  found my way to Dragonwell.\nHostess was charming and lead us to a perfect  table as soon as we arrived.  Water glasses were filled as soon as we were seated, with lemon-wedged water.  Our server was absolutely delightful and arrived as soon as we were settled.\nWe ordered potstickers and Spring rolls as an appetizer and several additional items for the main.\nAppetizer were hot and delicious , served with tasty sauces .\nOur waitress monitored the meal meticulously, and as soon as we finished appetizers , the mains arrived.\nMongolian beef; walnut prawns ; fried rice;  each dish was hot, tasty and well-prepared .  We gorged , enjoying every bite .\nSome reviewers have complained about lack of seasoning .  I suggest ask for soy sauce and salt and adjust to your taste .\nI love this place !", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "This is best in city fresh not greasy cook to order \nthe hot & sour soup is just right not a bowl of corn starch  \ntheir chicken Chinese salad has a lot of chicken with a sweet dressing topping it off\n \nHave been coming since they opened & continue to come here bringing family & friends it makes an impression on them they tell me when they come to sf have to go dragon well", "author": "Jay J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Best spring rolls I have ever had. (Mustard sause is spicy but can just be ignored for the red mild one) Combine with rice and soya saus and you have a whole meal. Fast service a big plus! Would def go back.", "author": "Hanna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "Love this place food is amazing and it is sooooo clean\nI would go everyday and everyday if I could", "author": "Hasmik N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "Ate here by myself while visiting the city. They were pretty busy but still gave quick and attentive service. I ordered the wok-tossed prawn and when I took my first bite I thought it was one of the best things I ever put in my mouth. Very tasty! The oolong tea and jasmine rice were an added bonus. Great place for a quick tasty meal. Price reasonable for what you get. Comfortable atmosphere.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "This review is way past due.  We've been coming here for several years and every single time we've eaten here has been a great experience.  The food is always great and every member of the staff is extremely nice.  \n\nIt's so nice to have a reliably great place to eat.", "author": "heather h."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-14", "description": "Very poor take out experience.  Ordered fried rice and was told it would take 25 minutes - which seemed a little excessive to me.  Came back 20 mins later and saw the rice sitting on the counter.  However - the front was slammed and very crowded.  Took them 15 minutes to even acknowledge me.  Cold food now and expensive for what you get", "author": "Peggy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-01", "description": "Here for lunch around 130pm on a Wednesday.  My bias is for relatively quiet, uncrowded venues with some elbow room, and they did not disappoint (other lunch spots along Chestnut, even at this hour, were pretty packed).  \n\nVery friendly, quick service.  Some jazz music in the background.  I had brown rice with vegetables, enjoyed it; my friend had the kung pao chicken.  I also had a cup of the hot and sour soup, great, especially on a cool, foggy day.  Chocolate fortune cookie!  Lunch special prices I felt were reasonable given the very nice ambience, quality food, and good service.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "We have only had one take-out experience with Dragon Well, and not yet eaten in their restaurant.  We were craving good Chinese take-out recently, and my parents had previously suggested this restaurant, so we gave it a try.  We were very pleasantly surprised with the food and overall experience, and we are sure to try them again, and perhaps eat in their restaurant sometime as well.\n\nWe arrived on a busy night to make our pickup- the restaurant was full and many people were waiting, and since parking is hectic around there- my wife ran in while I double-parked.  Our food was ready on time, and as we discovered when we arrived home- very well packed.  We had their very excellent pork pot-stickers- a great crisp and delicious through and through.  We had the tea-smoked duck with buns- this was my favorite dish and I will make sure to order it every time.  We also had a beef chow-fun, which was a bit bland for my tastes however my wife enjoyed it, and an order of crispy spring rolls.  Last but not least was the walnut prawn dish, which we both enjoyed very much.  The menu was not 'overly ethnic', but still lots of variety and quality ingredients at decent prices.\n\nMy lack of excitement over many other options will surely have me ordering from here again.  I'd rather drive here than have several of my 'regulars' deliver to me, if that means anything.  Worth a try if you are in the area/live nearby- I think you will enjoy.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "Incredible food. Hands down the best chinese i've had and i've travelled to china. As an aperizer I highly recommend the chicken in salade leaves and for a main dish I loved the spicy chicken. The staff was super as well. Very attentive, helpful and friendly. The waitress actually noticed that we weren't served a dish yet and made sure we had it asap. A great finish to the evening where the chocolate fortune cookies ! Overall great exlerience - definitly coming back when I visit San Francisco again.", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "My friend came to SF and was craving gluten-free chinese food. She wanted something more authentic than PF Chang's so she was thrilled when we found this place. They have an excellent Gluten Free menu for anyone with Celiac disease.   We ate off that menu and it was good!  Our favorite dish was the lettuce cups - the chicken was flavored just right with ginger, cilantro and broth.  The vegetable fried rice was actually not very oily or greasy, but it also lacked flavor.  That worked out well because both the beef and the green beans were super super spicy.  Service was also really good.  Definitely recommending for anyone that is gluten-free due to Celiac or other real actual gluten intollerances.", "author": "Miri R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "Favorite Chinese food in SF. Fresh ingredients, consistently great. Family owned, very friendly.", "author": "David D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-03", "description": "I wasn't very impressed with Dragon Well.  Actually, the only Chinese place in the city so far that has really impressed me was San Tung in the sunset.  \n\nI came here with my family from out-of-town because the wait for Delarosa across the street was too long.\n\nWe ordered:\n\nHot and Sour Soup - 2 stars (one of the most bland I have had)\nMongolian Beef - 3 stars\nLemongrass Chicken - 3 stars\nChicken w/Vegetables - 2 stars (needed some extra flavor, but the fresh veggies were nice)\nVegetable Chow Mein- 3 stars \n\n\nOverall, an average dining experience.  The service was a little on the slow side.  I probably won't go back, but if you are hungry, the food isn't horrible.", "author": "Juliana K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "Good food and good service.  Slightly over priced but the food was fresh so thats okay. For the most obvious reasons why its overpriced is because its in the the Marina area.  I will keep this place in mind next time in the area and looking for some Asian Fusion food.", "author": "Lilly K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-20", "description": "Not Gay Friendly\nHave been to this place several times. When I'm alone it's great service. When I'm with my partner it's poor quality. There is one server in particular. My partner and I visited last night (11/19/12) and had the same waiter as previous times visits. White, stalky guy, blonde/brown hair. He always get a part of our order wrong, takes a long time to serve us and completely ignores us during our meal. For refills or extras we have to bother a busser or other staff. \nWhen the bill comes, we wait and wait and wait. Last night we walked up to the register to pay. Wait, wait, wait.\nSad. Poor. Bad. Shame on you.", "author": "Dustin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "Dragon Well is easily my favorite chinese food place! I wish they delivered!!! They are pickup only :( but it is so worth it!! Their chicken chow mein is probably one of my favorite things on this planet. Its what I would take with me on a desert island. The chicken and vegetables lunch menu item is a perfect healthy pick me up for lunch. Don't get me started with the pot stickers, I dream about them. The mongolian beef is super yummy, I ask them to make it very mild because I don't do spicy well and they always do it for me. \n\nThe staff is always so friendly and personable. I've only ever ran into one young, tall, brown haired guy who wasn't very friendly but maybe he was just having a bad day but I've seen him on multiple occasions and he wasn't very nice but oh well...\n\nI highly recommend you try this place. Its a little pricer for Chinese food I will admit but to me the service, ambiance, and quality of food is so worth it!", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-28", "description": "I generally go by the rule of thumb that a real good Chinese Restaurant has a B-rating on their window and a waitress or server that I feel hates me but Dragon Well is the exception to my rule.  \n\nWith a beautiful layout and Chinese flare to it, Dragon Well is a nice place to go if you are looking for a nice family restaurant for reunion, anniversary, or fancy first or second date.  High ceiling and large windows are perfect for this place.  \n\nThe chocolate fortune cookie just put a smile on my face for the rest of the day.  \n\nWas a bit uncomfortable with the low MSG/healthiness of the place at first, I have to admit, but I forgave them for that.  But, If you're used to the hardcore Chinese places, you might want to ask for 2 bottles of soy sauce because you might have to add a little to your rice and entree.  I'm not gonna lie, I added about half a bottle.", "author": "Hazel K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-25", "description": "Somehow, I ended up getting take-out here.\nTheir Chinese chicken salad is decent. The place gives you a good amount of roasted chicken breast meat that is moist/not dry. The dressing is this lemon-soy vinaigrette, and it seems they also put in dry mustard for a slight kick. Good leafy ingredients. I felt healthy eating it. I'll give the dish a 3.5-star rating for being a non-dry chicken salad in the Marina District.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-08", "description": "Bland and mediocre Chinese food with no flavor. No General Tso's chicken on menu. Kung pao chicken is decent..Vegie spring rolls were good.", "author": "JP S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "I love dragon well. Maybe it's just me. Yes it is just me. This place has great chinese food especially their hot-and-sour, veggie dumpling, and kung pao chicken. I probably go to this place twice a month. I always ask for extra peanuts in my kung pao and they deliver every time. I always leave this place feeling like I had a feast so make sure you wear your loose fitting pants.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-11", "description": "I want to start with this: For the love of God chopsticks are NOT DRUMSTICKS.  It is not that funny, nor is it really all that creative, but it is highly, highly, HIGHLY annoying. It's bad enough when it's kids, but adults? Really?\n\nMoving on...\nThe food has always been great. I REALLY want to like the ambiance. But when they have an off night, boy do they have an off night. For example, last night we went. They kept telling us, \"It won't be too long\". 25 minutes later there were still 4 uncleaned open tables, several people working and a lot of attention on the check out. It really didn't seem like the right hand knew what the left hand was doing. It felt really chaotic. And not in that \"busy night at the restaurant\" kind of way.\n\nI do love the fortune cookies at the end, but wish they'd use some tongs and not let everyone put their hand in the bowl. Always creeps me out and generally pass on the cookie.", "author": "Brie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "Maybe 5 stars is extravagant for a simple, local Chinese restaurant, but I've been a loyal customer for years at lunch and I think there food is excellent, inexpensive and easy.  Occasionally I wish there menu would change it up a bit, but my truth is I order the same things over an over, anyway..  Chicken salad, moo shoo, chicken won ton, and a noodle dish that includes shrimp, beef and so much more.  Portions are large enough to share. Service is always kind, responsive, enthusiastic.  A side note, I love Chinese food, but don't like \"gloppy\" food.  This is a clean version of what I love.", "author": "Barbara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "Great sit down Chinese food. I'd definitely like to come back and try more items. My first time here and first time anywhere in the marina.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-19", "description": "Everything was super yummy and the service was good.  Great place to go with a group and share plates.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-17", "description": "How could I have neglected to write a Dragonwell review after all this time?\n\n\"Neighborhood Chinese Place\" taken to a whole new level.  Consistently excellent preparation of both creative and classic dishes.  Sure they've been slightly Americanized, but here all that means is better quality ingredients and less grease.\n\nGreat setting and the finest staff in town.  Much better wine list than your local joint too.  \n\nA neighborhood gem!", "author": "Mitchel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "Great place for a Chinese lunch or dinner in the Marina District.\n\nMy favorites are the pot stickers and the Kung Pao Chicken. The latter is done right, with just chicken, peanuts, scallions, peppers, etc., and none of the filler veggies that a lot of places use.", "author": "Doug L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-28", "description": "Everything was amazing. From service to the food.\nStopped by because everyone else was packed due to the Giants game. Quickly got seated and greeted by Emily. She was very accommodating and tentative to needs. Had a glass of Navarro wine? I think that was the name, it was a little too sweet for my liking but paired well with the food I ordered. I will be coming back for sure. Thanks", "author": "Harley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-17", "description": "Oh hey, Dragon Well staff. I'm the girl who was talking about porn with her male companion the entire time (I'm sorry if we were too loud, but it was really funny) and kept dropping grains of rice onto her arm. Ugh. So embarrassing. And in fact that was the only negative thing about dinner - it was pretty hard to eat my Kung Pao Chicken with the chopsticks. But the taste was well worth it, I assure you.\n\nNice decor, also, and super friendly waitstaff. Plus, hello, chocolate fortune cookies? I thought at first they were just \"well done\" - yes, sometimes my cluelessness amazes even me.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-08", "description": "Americanized Chinese food, but not that I have a problem with that.  Heck, I'm Americanized Chinese.  So then what is my problem with Dragon Well?  Um, Panda Express tastes better than you.\n\nThe Marina would never be my go-to spot for Chinese food, but the bf had Dragon Well takeout on a late worknight and, the good bf that he is, brought home his leftovers to share.  The hot and sour soup tasted as if a bunch of spices and tons of pepper had just been thrown together.  I felt like I was drinking a peppery spice rack concoction.  The beef chow fun wasn't any better, and I had to douse the dish in Sriracha to give it any flavor.  Also, the dish was all noodles - there were only about three pieces of forgettable beef along with a few strands of bean sprouts and some green onion. \n\nThis was quite possibly the worse display of Chinese food I've had.  I am so glad this meal wasn't on my dime, and needless to say, you won't find me eating from here again.", "author": "Mel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-03", "description": "Wow; surprise to my palate... simply did not expect this nicely decorated and invitingly busy place along Chestnut to have good Asian flavor. \n\nIt surprised me! *plus the name of this high quality tea from the famed Hangzhou lured me in as well (well done, marketing)~\n\nI humbly apologize for not recalling the dishes that about 5-6 (all of us rather well-eaten Asians minus one token fellow) of us shared on a balmy early evening. The wait was about 15 minutes, dishes were not particularly large (order more if ravenous), and prices are typical if not slightly 'economical' for that area of town, but I do remember a yummy savory noodle dish, and a sliced pork dish.\n\nTo sum it up, would label this a place that has Asian persuasion, still flavorful, but created for the non-Asian palate. How can I elucidate further? i cannot; simply cannot. But it's all true....but left smiling and glad that I patronized.", "author": "Jana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "For a local spot in the Marina to consistently have great, original food and service with a smile when consistently crowded is awesome.  I love this place, as do all of my kids.", "author": "randal w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-13", "description": "Been here a few times and love it- hard to get any other Chinese food after them. If ur looking for something super Americanized or basic and don't want to try anything new, might not like it... Last time we got reservations, parking was lame so 3 min late-- we go in and two older couples were there w/no reservations and had been waiting 4 table - I was hungry and it kinda ticked me off that they gave tables to the two older couples before me and my gf (who had reservations)... I made a joke (bad joke) that 'it's ok I'll just get on yelp and note that', manager hella heard me-- they seat us next open table and bring out complimentary spring rolls and soft beverages for us!!! That's service!!! I was just being a D saying that yelp stuff and they took it serious, for that they got another notch in my book", "author": "John O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-06", "description": "Who goes and gets Chinese food on Cinco De Mayo?  Apparently we do ... cause we were drunk and hungry.  \n\nIt's in the Marina ... so lots of white people and white people Chinese food.\n\nHad some wine and shared some appetizers ... spring rolls and the lettuce cups.  The spring rolls were pretty standard ... a lot of double dipping in the sauce.  The lettuce cups ... while hearty with meat, were rather bland.  We used the sweet & sour sauce from the spring rolls to add some flavor.  \n\nThe service was really nice and the décor was dark and romantic .", "author": "Kathleen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-26", "description": "Very good hot and sour soup.    Pleasant surprise in an area with few Chinese cafes.   Mongolian beef and potstickers are also very good.  On the pricier side but good for the neighborhood.   Will return next time in town.  Good service with friendly atmosphere.", "author": "E C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "Great little place. Awesome food. We had an appetizer of spring rolls then pork fried rice and chicken with vegetables. All were so fresh, flavorful and not greasy at all. Wait staff was great.", "author": "Holly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "Service- check\nGreat food - check \nLettuce wraps are delicious - fresh crisp lettuce filled with tasty filling \nDumplings - a tasty filling but the dough is a little thick for me \nPork fried rice - fresh and full of flavor.  Made with those fresh veggies - not frozen!  Can substitute for jasmine or brown rice.  \nBrewing real tea.   Try their dragon well tea.  \nNothing is too salty - which is a huge plus.  No MSG!   \nLooking forward to a return trip.", "author": "Jules T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "My wife and I stumbled into here.  Seating at the open window with sun on\nmy back was a treat.  I had the seafood in a potato basket.  The squid,\nscallops, shrimp were super fresh and very tender, unusual for squid and\nscallops.  Service was friendly helpful.  I appreciated the red logo dragon which\nmimics the shape of the character for \"dragon\" in Chinese.  Kid-friendly.\nHighly recommended.", "author": "Ladislaus R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-02", "description": "This place is quickly becoming my favorite Chinese restaurant. Great potstickers, kook, mushy pork, and Kung pao chicken. Excellent service,", "author": "Leigh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "I live in sacramento and every time we visit san francisco we always stop here for lunch or dinner. Their calamari appetizer is what always brings us back! It's always perfectly fried and has just the right amount of spice. Just thinking about it makes my mouth water. They also offer white or brown rice with your meal. The portions are big and perfect for sharing with 3-4 people. It hasn't ever been too busy the times we've come here and we are always seated right away.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "Dragon well is the best Chinese food I have ever had. The reason for this is that it doesn't taste as salty as other Chinese places I have been to. I love the BBQ pork rice and chicken chow mein the most but I could really eat anything they make that isn't spicy.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-24", "description": "Perfection! Have walked by this restaurant forever...tried it, loved it, can't wait to go back. Two words: \"lunch specials \" fabulous! Eggplant, brown rice", "author": "Kae D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-17", "description": "This place used to have decent \"american version of chinese food\" but now it's just bad chinese food. Tonight I had 2 plates: Hong Kong Noodle and Lemongrass chicken.  Hong Kong Noodle was blend, it tasted like they just mixed some vegetables with some meats and noodles together with water and cornstarch. The Lemongrass Chicken tasted spicy but still insipid with few sad snap peas. \n\nIt's over priced and frankly you can get better chinese food at Panda Express.", "author": "Jenn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "Fresh, simple, Chinese American refined Pan-Asian taste. Very busy, upscale restaurant. The food is catered to the Western tastes, not with heavy soy sauce, but with freshness and lively ingredients for a balanced and deliciously healthy meal. Service was attentive, and the experience enjoyable with the high ceilings and contemporary Asian decor. \n\nParking is tight in the cow hollow so be prepared for alternative transportation or parking off the main street.", "author": "Wilson T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-23", "description": "This is the best Chinese food in the Marina/Cow Hollow neighborhood! The menu offers some great choices not to mention the best Walnut Prawns around.  The Chicken in Lettuce cups and Wonton Noodle Soup are tasty too!  Best of all the ingredients in all of their dishes are fresh, flavorful and healthy without being overly seasoned and greasy.\n\nThe staff is friendly and the owners are very polite and accomodating.  The prices are reasonable for the portion sizes and the decor is simple and tastefully done.  The photos on the walls are super cool too!\n\nI have been eating at this fine establishment for many years and recommend it to others whenever I get the chance.  I even brought some relatives from Europe to eat here and after ordering nearly everything on the menu for our group, I can honestly say there were no leftovers to be found.  That's the sign of some really good chow and I have no complaints!", "author": "Rob L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-09", "description": "The Chinese Restaurant conundrum - everyone has a mindset that Chinese food should be CHEAP.  The only way to make Chinese food CHEAP is to use CHEAP ingredients and mask this with MSG and Soy Sauce (Na+)  \nI don't like CHEAP ingredients - I like organic produce (all of it doesn't have to be organic but most should be) I like my meat/chicken to AT LEAST be antibiotic free - organic is even better.  \n\nMSG gives me a headache-cotton mouth-spacey feeling afterwards, copious amounts of soy sauce means I will wake up bloated.  Also long term use of these ingredients dulls the taste buds. \n \nSo when a restaurant DOES use organic ingredients and quality meat without MSG and excessive soy sauce - you can expect complaints about price/portion size and blandness.  \n\nBeing able to taste the underlying ingredients of a Chinese dish does not mean the sauce is bland - MSG and sodium dulled taste buds can be retrained but one has to go through a period of \"withdrawal\" until food taste good again.   \n\nThat being said Dragon Well is one of the few Chinese restaurants in SF that I can enjoy.  I wish some dishes used even pricier ingredients - I'm willing to pay for quality food - but that would garner even more complaints.", "author": "Susan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-27", "description": "Went here for dinner with my friend, I had the Soup ($10) it was delicious!  I'll def. be back to try the other things on the menu!\n\nService was excellent as well.", "author": "Rebecca W B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "Excellent, and authentic.  The garlic eggplant, and any shrimp dish were especially good.  Great accommodations for most groups.  This is the best Chinese in the marina!", "author": "George O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-17", "description": "This is one of our go-to places in the neighborhood!  But it also can deserve less than 5 stars if you don't know how to order correctly.  Some things are outstanding, and others aren't as great.  I give it 5 stars because we have the menu down to a science and always LOVE our meal.  Plus, the staff is very friendly.\n\nThese items are very good:\nHong Kong Noodles - a must have!\nWon Ton Soup - My fave version I have found in the city!\nMinced Chicken in Lettuce Cups\nBlack Bean Chicken\nMu Shu Pork - They make their own pancakes\nSichuan Green Beans\nPot Stickers\n\nDon't come here expecting authentic Chinese food.  Their ingredients are fresher and the food is not heavy and greasy, which is why I love it.", "author": "Alexis L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "Great place to come for some tasty Chinese food in the Marina! A group of 4 of us shared a bottle of pinot blanc, calamari, string beans, beef, brown rice, and kung pao chicken, and it was very good quality food, and a perfect amount for our group.", "author": "Steve F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "Very good food! Yummy Garlic NaaN and chicken tikka! Raj was wonderful and we will be back again for sure!!", "author": "Kristi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-15", "description": "I've only had the chow mein here, so I can't really fully judge this place completely yet - but my boyfriend and I actually stopped here one night on our walk home because we were randomly hungry (not the first time this has happened.) We got the chow mein to go, and went home and both commented on how healthy and not greasy it was! Low and behold, when i finally went back and looked at their website, I saw they pride themselves on being healthier! I LOVE that! More chinese places should follow suit! \n\nAnyway like I said I can't really comment on the other food, but I will definitely be back to try it. I like that they use healthier ingredients and not msg processed garbage. YAY!", "author": "Danielle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-14", "description": "I've lived in San Francisco for over a decade and eat out at least half the time. Love Chinese food but often frustrated at the craptacular quality of most places near my Russian Hill home. My husband and I love this Marina gem and usually order extra food so that we have leftovers for the next night or two. Favorites include their awesome Ma Po To Fu, Scallop & Chive Yi Mein, Pork Fried Rice, and all fish dishes. Service is very fast, It is family friendly and never a bad meal. Highly recommend.", "author": "Harmeet D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-23", "description": "I used to be a customer, and that I had an awful experience with the incredibly rude owner.  I will never come back here again. This is the second bad review I have written in my life, the other one is for the DPT. Gary of Dragon Well is worse than the DPT.", "author": "Gina K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-04", "description": "After my friend decided to walk out on Betelnut (he was being snobby), we walked around for an hour before finding a restaurant that had a table which is what brought us to Dragon Well.  Located in the Marina, you know this isn't your typical Chinese restaurant serving authentic cuisine but when I took a glimpse of the kitchen I did find a couple of Chinese chefs so there was hope (I thought).\n\nWe ordered spring rolls, tea smoked duck, lettuce cups, black bean chicken, mongolian beef, and barbeque pork fried rice.  Spring rolls were well made but the lettuce cup had tons of chilies or jalapenos which made it too spicy for me.  The tea smoked duck was the surprise of the night; similar to peking duck but a few pieces of duck meat perfectly seasoned put into a bun, this really was a very good dish.  The beef and chicken both had a bit of heat to it which means I couldn't really eat it without sweating so I opted to stay away from it.  The barbeque pork fried rice had diced carrots in there usually a no no for fried rice but the quality of the barbeque pork was very good which made the fried rice a success.  \n\nService was good, prices are average; we spent about $80 before tips which included tea, wine and six dishes.  \n\nWould I come back?  I'm not so sure.  There are a lot of places to eat in that area but if there aren't any tables or I had a hankering for Chinese food I might stop by.", "author": "Pierre L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "Hab a very pleasant stay - great food & very friendly service!", "author": "Kalle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-22", "description": "Outstanding!!! I have been coming to this restaurant for more than 5 years and go out of my way to come here.\n\nDelicious Asian Fusion:  \n\nAmazing Dishes - Dragon Beef, Kung Pao chicken is the best I've ever tasted anywhere in the world.  The green beans are off the hook and the brown rice option is a must!\n\nMy favorite in San Francisco.", "author": "Bryant G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Went here with some local relatives while visiting SF and really enjoyed our dinner!  We have food sensitivities to gluten and soy so rarely ever each Chinese food, but since our family made reservations here (one of their favorite Chinese restaurants), we went along and were pleasantly surprised!  Not only did they have an extensive gluten-free menu, they don't use soybean vegetable oil (yippee!!) and were able to make us anything from the gluten-menu.  Ordered the chicken and veggies, some rice and another veggie dish.  All were delicious and very fresh tasting.  Not the typical thick sugary sauce and wilted veggies I'm used to seeing in Chinese food.  Prices were reasonable and restaurant very clean.  Would definitely like to return here during our next visit.  btw - regular and chocolate fortune cookies are given after dinner which was kind of fun to have the selection (although we don't eat the cookie, we still like the fortunes!)", "author": "L S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-30", "description": "Date and Time:  Various lunch hours and dinners for the past decade\nCompany:  The Husband\nCrowd:  Mix of hip Asians and Marina Peeps\nAtmosphere:  Casual & Unpretensious\nDecor:  Comtemporary, comfortable dark wood tables and bench in the front\nService:  Nice servers\nImbibe:  Lychee ice tea\nDevour:  Sweet and savory beef, Peking duck with buns and yummy sauce, lettuce cups with mince chicken and walnut prawns(listed in that  exact order of favorites, so definitly get the first two or three)\nNotes:  This is the kind of food Asian parents would cringe at, but their ABC children love.", "author": "Genevieve Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-19", "description": "LOVE the Crystal Prawns.  Portions are huge, so Hubby and I usually split a plate with some brown rice.  I also love the Mongolian Beef.\n\nI usually see families with kids there, so FYI for the anti-kid types, or for parents looking for a kid-friendly place.\n\nStaff is always on top of things, and they give you a choice of regular or CHOCOLATE fortune cookie after the meal.  That's worth a whole star right there.\n\nI've only dined in, but they have take-out as well.", "author": "Emily F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-07", "description": "Chinese food adapted to the Marina palette. No it's not as silly of an Asian adaptation as say Mas Sake, but familiar dishes did seem milder than usual. \n\nThe hot and sour soup was not all that hot or sour. The dragon beef and crystal prawns were okay, but not memorable. The one standout was the lemon grass chicken, which carried some kick and was our favorite.\n\nWe had to wait 30 minutes for a table (hostess told us 15), but once seated the service was great. The ambiance is casual but nicer than a mom and pop Chinese joint. Volume-wise it's a bit on the loud side.\n\nOverall: Ok, but I won't be rushing back for a second visit.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-14", "description": "My five year old son took me to the Exploratorium this weekend and asked if we could go out for Chinese food beforehand. What are you going to say when your adorable kid asks you out for Chinese food?  Of course.\n\nThere don't appear to be a lot of hard core Chinese restaurants left in the area, so we went for the clean, predictable and friendly experience at Dragon Well.  We had Spring Rolls, Beef Chow Fun and Mixed Veggies with Tofu... all of which were fine but none of which were particularly good.  \n\nOur server was very friendly and our window seats (with the blessing of a gorgeous sunny day) provided a world class setting for father-son lunchtime bonding.  So I may not remember the dishes themselves as the best I've had, but I will still take a fond mental image of Dragon Well with me into the ages.", "author": "Geoff D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-20", "description": "quick summary: better than PF Chang's  but nowhere near Koi Palace. \nAt least there are Chinese cooks working in THIS kitchen. It's clean, service is pleasant, and the food is good.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-15", "description": "Had been to Dragon Well about a year ago, so I was looking forward to going there again.  \n\nThe tea smoked duck appetizer was excellent.  However, the Mongolian Beef was HORRIBLE.  \n\nThe dish was cold....The rice sticks were greasy and uncooked (they weren't fried evenly, so they had a nasty crunch/chew).  The sauce was horrible, and they seemed to go overboard with the hoisin....\nFar better places in SF....", "author": "SG D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-25", "description": "Delicious! Will definitely be coming back. I was there for lunch and ordered the wok tossed prawns. Great food. Good service, very friendly and accommodating.", "author": "Shei H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-01", "description": "Just ate here with my girlfriends for the first time since moving out of SF. I love this place! The veggies always taste fresh and the staff super warm and friendly... Not always the case in this neighborhood.", "author": "Marissa A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-26", "description": "Was waiting for my 2nd appt. at Apple & I was starving & it was drizzling . I ran over to eat at Dragon Well . They provided me with a Gluten Free menu. Yeh ! Lunch time ! love this spot . Clean & good !", "author": "Angela G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-11", "description": "Soups here are off the chain.\nIn the mood for more broth? Order two small Won Ton soups in one large bowl.\nThe Jook is also banging and very very filling... a food coma may ensue. \n\nThis place has a very warm inviting interior and some choice photography on the walls.\n\nChocolate Fortune Cookies are not to be missed.", "author": "Evan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "We had dinner tonight. It was wonderful. I loved the Tea smoked Duck. The vegetables were crisp and perfect. The place was clean and friendly. I intend to go back often.", "author": "Chris N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-08", "description": "Eh, you know. Not authentic, not super fake. I for one love my Chinese food at both polar extremes. This place is more like a not-quite-efficient P.F. Changs. 2 stars for everything plus an extra star for it being pretty cheap.", "author": "Michael A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-13", "description": "Stopped in here for some chinese food one night while on chestnut. Can't remember what I ordered.. but I do recall the ambience in the dining room being decent but my wife and I both being a little disappointed with the food -- which is the usual Americanized Chinese flair a la PF Changs. \n\nI think the Bay Area has better to offer in terms of great Chinese food.", "author": "John A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-08", "description": "You guys killed me.  Couldn't get my order right, tricked us into buying rice with nothing to go with it, made my wife drive all the way back to pick up the food (I'm sick), didn't offer to even deliver since you made the error, WTF!?!\n\nNatalie, your service has ruined my experience of Dragon Well FOREVER.  Next time, apologize, admit your error, throw in something free and move on.  That's all it takes.  Don't be defensive and laugh at the suggestion of delivering the take out food 9 blocks away.\n\nGo ahead, keep on spitting in people's food for take out, I don't care anymore since I won't be coming back.", "author": "Jacob J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-16", "description": "give it up to the marina for an uppity, americanized chinese restaurant. unlike its slightly filthy counter parts in chinatown, d. well here is spending their goods on the decor. which, i concur, is part of the experience. yet, the portion, the portion - always disappoints. \n\nwhat i enjoyed here is their won ton noodle soup - clear broth with alright wontons, chicken, shrimp, and vegetables. very refreshing treat when you're indoors with a stuffy nose. \n\nmean dishes are just alright. reminds me of \"house of same sauce\" - house of nankin - but cleaner and, again, way smaller. \n\ndo NOT order their tea smoked duck appetizer. it comes with tine pieces of overly-smoked duck meat, so much so my nose wanted to run away before the bird's flesh reached my tongue. the \"buns\" that came were a bit wonky. \n\nall in all : recommended for non-sushi asian in the marina when everywhere else is packed. that is all.", "author": "Fiona S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-12", "description": "Great food and great service. A little expensive but worth it generally get 2 meals out of it. Recommend the wonton noodle soup", "author": "Corey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-27", "description": "Most underrated Chinese restaurant.  \n\nMy girlfriend and I come here on Friday nights.  It's consistently our go to place. \n\nThe food is extremely FRESH and the service is excellent.  In fact, I can't say enough about the service.  Everyone from the owner to the entire wait staff have clearly put customer service at the top of their priorities.  Our drinks are constantly refilled and the servers are so genuinely friendly.  \n\nFood wise, you cannot go wrong with the calamari, wonton soup (freshest I've had), or Mongolian beef.  You can tell they just use quality ingredients. \n\nGo here and you won't be disappointed.", "author": "David L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-13", "description": "Hands down- best, freshest Chinese cuisine in marina district. Good service- and damn good fortune cookies! Hot green tea hits the spot on a cold evening!", "author": "Matt H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-04", "description": "Discounting the awful parking situation aside, I thought that Dragon Well was a really nice dining option while escaping from the cold outside.\n\nThe place is small- but they really made the most of it, with simple [but chic] interior decorations and dark wood panelings.  It can definitely be a great place to go for date night... if the crowd isn't too loud.  The last time I was here, there was two huge parties with little kids... so... the decibel levels raised quite noticeably.\n\nSince it was ridiculously cold outside, I opted for a cup of WONTON SOUP- which was actually quite good!  I know this place has a rep for being too 'Americanized', but the flavorings in the soup were spot on.  Then we ordered the DRAGON BEEF and BEEF CHOW FUN.  I absolutely loved the seasonings on the Dragon Beef!!  It was slightly spicy, but the beef that they served didn't smell funky [like you would usually get if you were say... in Chinatown.  Sorry, but you know it's true.], and the 5-spice tofu on it was a wonderful combination.  The beef chow fun was just alright next to it.\n\nUltimately, I would definitely go back again.  Dragon Well is clean, nicely decorated, and had a really nice waiting staff too.  Plus you can't forget about the CHOCOLATE FORTUNE COOKIES!!", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-15", "description": "If you love fresh , clean flavors for your Chinese food  - Dragon Well is it .", "author": "kimberly k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-24", "description": "Great little hole in the wall. Delicious chinese food for a reasonable price. Ask to get the general chicken extra spicy. It is fantastic.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "Very nice Chinese place in the Marina.  Soup (won ton) was excellent, and so was the kung pao chicken.  Small and intimate place - nice wine list for a Chinese restaurant.  Service was very good, and the prices were fair.  Recommended.", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-02", "description": "Way too little Asian food for way too much money. \n\nDragon Well is a yuppie \"Asian food\" place for Chestnut Street residents. \n\nThis place blows!\n\nIf you want a good Asian food experience go where the Asians eat in SF and almost anywhere else.", "author": "Mr. O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-11", "description": "I really wanted to like this place. The inside is very nice, the staff super friendly, service was fast, my water refilled frequently and the menu looked great. Unfortunately, the food was disappointing. The pot stickers were too doughy and my chicken and vegetables very bland with no flavor to the sauce. \nI'd like to give them another try, but with so much competition in the neighborhood, it's unlikely.", "author": "Izzy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-11", "description": "Great value for the money. \n I have enjoyed everything that I tried but my favorite is wok tossed prawns.  They are crispy and have a lightly spicy and tasty sauce. \n The prawns always taste fresh.  It is very filling and I usually eat only half of it at one meal.  \nNice simple decor as well. \n Service is quite good also.", "author": "Maureen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "I thanked my lucky stars when Dragon Well opened because it was FINALLY healthy, yummy Chinese food.  It has been my \"go to\" restaurant for the past 16 years in San Francisco.  Everything on their menu is great.... but their pork potstickers are the best.  My family and I would order 3 sets of them every time we go!  We even had Dragon Well cater my work party.", "author": "Lena E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-08", "description": "I gave this place a few tries, but was disappointed each time.  Some of friends swear by this restaurant, so maybe I'm missing something, but I found the food unexceptional and not nearly tasty enough to justify the unhealthiness of eating Chinese food (nor the price of the food).\n\nDon't get me wrong, I'm a fanatic for Chinese food, just not the boring kind which is served at Dragon Well.\n\nI found the cuisine to be overly salty, and pretty homogeneous.  That is, the appetizers and mains all taste the same, and include the same sauces.  \n\nI much prefer Feng Shui on Lombard, which has perhaps equivalent quality of ingredients, but has much more diverse flavors and far lower prices.", "author": "David A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-01", "description": "The owner of this restaurant is absolutely INSANE.  The employees and kitchen staff are all saints for having to put up with her blatant and open verbal abuse.", "author": "J. R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-03", "description": "8 of us were looking for a good place to eat in the area and we were lead here by the great reviews and reasonable prices.\n\neach of us had different dishes, from the pork fried rice, to the chicken  chow mein, to the mongolian beef everything tasted wonderful and very fresh..\n\nRyan,  I believe was his name, was our server and was great. \nWe visit this area of San Francisco often and now know where to go for great Chinese cuisine", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "Had the beef chow fun and the Hong Kong noodle. Both were pretty good. The service is fast and the wait staff is very nice. \n\nNot a large selection but the restaurant is very clean and cozy.", "author": "Cindy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-27", "description": "take out only.\n\nno frills chinese for the marina folks.  from ginger chicken, hot and sour soup to the chicken lettuce cups.  be sure to load up on the chili sauce should you want any kick in your food.", "author": "Anh V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-07", "description": "Delish! If you want a treat get the wok fried shrimp. You will not be disappointed.\n\nThe service is great, too. Once I was in the restaurant with a huge group. A lady next to us complained to us that we were too loud. We didn't even complain, but the staff was quick to bring us a free dish to apologize for her. I've never had that treatment before. I will be going back for sure!", "author": "Emily K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "Dragon Well does a good job with making good Chinese Food that doesn't feel like you're eating from a hole in the wall like a lot of places in SF.  The ambiance is nice, staff is attentive, they can accommodate small groups and do well with kids.\n\nThe food is good and tastes fresh.  There are some traditional Chinese dishes (Chow-mein, Kung Pao Chicken) and some unique dishes (Hawaiian Butterfish), all of which are good.  \n\nThe only down side is that the menu isn't huge, so if you go there a few times (or many like myself), you start to feel a little limited in options.  If you're looking for a vast culinary experience, this Dragon Well may not have the options for you.\n\nConvenient and reliable place to eat in or get Chinese take out from.", "author": "Randy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-02", "description": "This is not your typical Chinese restaurant. It's more of an americanized Chinese style; they serve dishes prepared with organic ingredients and the restaurant is very well kept. \n\nOn cold days, I love to get their hot and sour soup. It really hits the spot. Sometimes, they add a teensy bit more pepper than I'd like though. Their won ton soup is quite delicious as well. The steam hawaiian butterfish was very melty, but the portion was a bit small.\n\nI would suggest getting their lunch specials because they're pretty filling and their brown rice is bomb as well.\n\nNot my go-to Chinese place, but hits the spot when I'm craving it during work. I probably wouldn't go to Chestnut specifically for this restaurant neither, as parking may be hard. Also, as a Chinese-American, Chinese food is usually my last choice when i dine out.", "author": "Helen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-18", "description": "Obviously, if you continue to go to a restaurant more than 5 times a year, other than McDonald's, it's a 5 star!\n\nI've been here for over 8 years...  that says a lot!\n\nThis place is great for freshly made, non-greasy Chinese food!  We order almost the same thing when we go here... never look at the menu any more! haha\n\nHot and Sour Soup\nWok Tossed Prawns - mmm, sweet prawns! So Good!\nMongolian Beef\nHong Kong Noodles\n\nMy 10 yr old daughter learned to use chopsticks here at 2 yrs.  They are definitely kid friendly!\n\nThe owner, Christina, and the staff are great and friendly!  \n\nThe prices are decent and good for small groups.\n\nDefinitely will always come back!!!!", "author": "Natalie O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-14", "description": "BLAH!\n\nI grew up in San Francisco, and yes, I may not be Asian, but I've eaten my fair share of Chinese food and this place just doesn't cut it.\n\nOver priced, mediocre, attempting and failing to be high-end Chinese.\n\nThe veggies did not seem fresh and the chicken almost seemed as it was fake chicken breast meat - definitely not fresh - probably thawed pre-cut breast pieces.  Ugh...\n\nThere are not a lot of Chinese places in the Marina - you are better off going to the Richmond district or eating at one of the many sushi places in this area.  \n\nThumbs down.", "author": "AIMEE C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-06", "description": "My friend and I went here for dinner.  He said it was really good, but I've definitely have had better. \n\nI only tried the chow fun which had minimal vegetables (I approve) but it was really oily and bland.  \n\nThe tea that was served wasn't complimentary (seriously?) and it tasted weird too, I prefer oolong.  \n\nThe service was okay and restaurant is cute but It's expensive for what you get. \n\nThe search for good Chinese food continues....", "author": "Marisa R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-04", "description": "This is for takeout: BEWARE, their prices are jacked up in the store compared to what they advertise on their online menu. I wouldn't normally mind, but it madea a $9 difference in my bill for just 2 entrees and rice! Food was ok though.", "author": "Sangita A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-22", "description": "..The first time we went there when they first opened say the first year, they were great. Food was fresh, sparkly, pretty. Last 2 times we were there (today will be our last time going there) the food was not fresh. \nThe noodles arrived still not hot, everything had the taste and feel that it had all been cooked earlier a few days previous.\nThe brown rice was not fresh tasting, the vegetables were not so fresh, the tofu cutlets seemed like they were all batter and no tofu and also been cooked days ago, and slightly heated for our meal.\nI am not sure if the restaurant has changed hands a few times or the quality has just slid down to non existent. pass on this Chinese restaurant with high prices for stale food.", "author": "KatBob b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "I'm not sure what took me so long to try Dragon Well but I'm glad I finally did. The food was great and tasted very fresh and high quality. No \"mystery\" type ingredients or low quality meat that you sometimes see at other places. I tried the veggie potstickers (which are ginormous) and chicken low mein and both were great. They have a pretty good selection of wine too. Another big plus... the place is very clean. Hope to go back soon!", "author": "Gina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "The BFF & I ate at Dragon Well because it won a coin toss. Seriously, we flipped a coin (heads for Dragon Well, tails for kabobs) & Chinese-fusion won.\n\nWe were seated at the table directly in front of the huge, open window, which let in equal amounts of sun & breeze.\n\nDecor: simply, modern, narrow but airy, lots of pictures on the wall, dark wood tables.\n\nWaiter: totally cool guy, funny & genuinely friendly. 5 stars for him! Food was brought out super fast.\n\nFood: \"Bird's Nest \"with brown rice for the BFF and mu shu pork for me, which I thoroughly enjoyed & devoured. Perfect lunch portion. Not your typical Chinese food; definitely caters to the palates of suburban Marina-ites by being: not too salty, not too greasy, & seemingly healthy.\n\nAnd the icing on the cake: lunch prices were very reasonable (about $30 for 2) & the chocolate fortune cookies (different & definitely chocolaty.)\n\nSuffice it to say, fate did not steer us wrong today. If only every decision in life could be made with a simple toss of a coin...", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-23", "description": "I love it. I crave Dragon Well all the time, I love their veggie potstickers so much, so gingery and yummy! Everything is really tasty, non-greasy and healthy. Also, really friendly servers and the place is super modern and clean. A great dinner and a movie spot, there are 2 theaters w/in walking distance, one is right across the street. Go!", "author": "Kylie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-08", "description": "We started with the Spring Rolls stuffed with shiitake mushrooms, veggies, and a lot of garlic. For our main course, we had the Mongolian Beef and Sichuan Green Beans, along with rice. \nIt was all good but nothing spectacular. I recall the flavors being vivid and punctual, but that could have been the red pepper sauce or the four gin & tonics I sucked down in the Marina Lounge next door.\n \nI have words of advice: The lighting is a bit unwelcoming. I suggest adding warmth by a deep red hue for the bottom portion of the wall. It would bring out the dark furniture and complement the customers' skin. With the all-white walls, customers look pallid. Your food would look more vibrant too.", "author": "Maureen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-05", "description": "This is seriously my favorite Chinese restaurant. The Kung Pao Chicken is sooo delicious. The servers are great and always so welcoming with a nice smile and good service. The best part is that the food is healthier compared to other chinese restaurants.", "author": "See P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-13", "description": "I remember this place being better.  It was aight nothing spectacular.  For some reason I feel like the flavors had potential but they didn't really pop.  The chow Keon was disappointing and when you have to drench your noodles in soy sauce, something is missing.  The lemongrass chicken was just alright too.  Don't think I'll be back.  The is better Chinese food closer to me.", "author": "Kirsten M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "love it, great food, great tea and super service....yeah, we are coming back.....thanks girls", "author": "Andre S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-16", "description": "I love SF, diversity of neighborhoods, people and great places to eat. Dragon Well is one of the places that makes for a great hood. \n\nWent in for lunch with a friend and was met within seconds and offered a table that looked out to the street. People coming and going, table next to me filled the room with laughter and combination of english and Italian. \n\nVegetarian Pot Stickers: you won't miss having meat, awesome.\n\nVegetarian Salad has fried tofu, oh my golly golly. It was like light custard with crispness that is indescribable.  \n\nBeef and Tomato, tender and full of flavor with the tomato skin just slightly blanched. It takes great skill and timing to pull this off, who ever is the wok master, you should take a bow.\n\nGreat food, excellent value!", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-14", "description": "Hadn't been too Dragon Well since the days when Chinese food was in my dog house, and so, along with all other Chinese joints, I hated it.\n\nThings have changed somewhat...\n\nStopped in yesterday with a couple of friends and I can say that for 10 bucks a pop you can have a non-greasy plate of freshly prepared, nice Chinese food. \n\nAnd who doesn't love that?", "author": "Jason R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-18", "description": "This is one of my favorites Chinese places in the city. Food is mostly American adaptation of Chinese food, but that makes it even better. Dragon beef, garlic eggplant and hot and sour soup is what I usually order there. Love photos on the walls. I have taken there all my friends who visit windy SF for Chinese heart-warming food.", "author": "Fedor I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "I gave Dragon Well another chance, and am upping my stars. The lunch special is a good deal and the food is good. I had the snow pea shoots and it was yummy and fresh tasting ($10). I also had the lunch tomato, beef and tofu with brown rice, which was also tasty. If you are vegetarian, they can easily accommodate changes to menu items, unlike most Chinese restaurants. Service was good and I like how they have chocolate flavored fortune cookies.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-24", "description": "There is a lot to like here - reasonable prices, quick service, generous portions, an unrushed atmosphere, complimentary chocolate fortune cookies. Food is good too - the chicken lettuce cups are more entree than appetizer, and the steamed salmon with black bean sauce was tasty.\n\nSo why only three stars? Because outside of the salmon itself and the lettuce, everything was an oily mess. I have no doubt they could cut back and everything would still taste delicious.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "Not bad, reasonable prices, especially for San Francisco. It's no Mission Chinese, but good for what it is.", "author": "Mark R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-10", "description": "Dragon Well, one of my favorite Americanized-Chinese food restaurant, fills the niche of a crowd, who would not go to Chinatown for Chinese food.\n\nSome yelpers complained that this place has non-Asian servers.\nWho cares and that could be a good thing. Since most\nChinese restaurants have the reputation of rude and non-attentive\nservers, the owner(s) have taken that challenge out of the equation.\n\nAlso kudos to them for providing tasty, affordable food in a CLEAN environment,  where diners enjoy the food and tip well.  I don't wanna read anymore Yelp reviews about cockroaches or flies in their soup. \n\nTry their killer tossed prawns!  Best I've ever tasted.", "author": "CT L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-17", "description": "Dragon Well is an American-Chinese place that is less greasy than other joints and MSG free (and I know this because I did not get sick after the meal as I typically do after ingesting MSG).  \n\nThe jook was very yummy and we also enjoyed the chow fun and pea shoots.  All were good sized portions.", "author": "Romeo And Lola K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-12", "description": "I view Dragon Well as a healthier, lower priced, Asian option in Marina that is good for a quick dinner on a busy weekend or week night.  \n\nI usually go for the Hawaiian Butter Fish or the Birds Nest Noodles.   \n\nThe menu is definitely non traditional Chinese with heavy American influence. \n\nUsually they'll let you substitute veggies between dishes.\n\nI wouldn't come here for a formal date or a large group.. only out of convenience.", "author": "Peter G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-15", "description": "Delicious!\n\nFor an Americanized, over-priced Chinese restaurant with nice sit-down atmosphere, Dragon Well is very good.\n\nDishes I usually get are lunch specials, eggplant stir fry, green beans something something, and prawns-make-me-happy (I forget all the actual names).  Everything I've ordered is really good.  Quantity is not the biggest priority for me.\n\nMenu is limited - a great tack for them, so the dishes they DO make, they make well.\n\nSure, they charge for rice, but I find this is a trend at many San Fran Chinese places, lately.  \"A+\" for service, too.", "author": "Bamboo T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-14", "description": "A WASP Safe Chinese.\n\nIt's Wal-mart here!\nCheap labor and ingredient and high middle men and women management.\nDo you know that I can tell buy just looking at who can and can't speak English very well in the kitchen?\nI see that 100% Chinese in the Kitchen and Non Asian waitresses and waiters.\n\nPretty clean place.\nBut i have a feeling that I couldn't ignore.\nIs that bad feeling to serve Chinese food by non-Chinese wait stuff?\nIs there anything wrong with me?\nAm I thinking too much?\nBut is it true that that is why the price is high. isn't it?\nBecause I think all menu in here is pretty much REGULAR Chinese food.\nWe had,\nChicken Salad\nPot Sticker\nChicken Chowmein\nBeef Chowfun\n+tax= OVER 40 BUCKS!\nWHATTHE FXXX?\nIt wasn't crappy Chinese for sure.\nLet me say, It is \"WASP-Safe\" Chinese.\nBut it wasn't bad as Nanking.\n\nAll Asian restaurants that WASP like, Ask your self again, do you feel lucky?\n\nLet's say,........\nIF Dragon Well is in the different  district, or Chinese waitress.\nI BET YOU ALL THE PRICE GOIN' CHEAPER!\n\nHey wait, Did I say it's Wal mart here?\nI still think yes because it's in Marina.\nMarina is pathetic anyway.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-24", "description": "Good place for a casual dining spot with friends.  I liked the casual atmosphere, menu selection, and reasonable prices.  \n\nI went with two friends and we shared the chicken fried rice, green beans, spicy beef dish, and lettuce wraps.  Overall the food was pretty good - but I had better elsewhere.  The portion size is good.  Service was excellent - waiter was prompt and friendly.\n\nOverall a good place if you feel like chinese - quick and affordable.", "author": "Gina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-06", "description": "Dragon Well is to Chinese food what the Marina is to San Francisco - very white!  \n\nI'm not putting it down - it was actually pretty good, and seemed somewhat healthy as well (unlike something like PF Chang's or other Westernized Asian restaurants - which load you down with fat and calories).  I would describe the food here as very \"clean\" - not exactly bursting with flavor, but thankfully not swimming in grease either. It's kind of the eating equivalent of being on Prozac - very even.\n\nI enjoyed a very pleasant lunch here with a friend, and our server was very nice and friendly.  We had the pot stickers and Spring Rolls for appetizers, and I had the Chinese Chicken Salad for my entree.  That is one enormous salad, let me tell you - I couldn't finish it.  All were decent, if not especially memorable.\n\nOther menu offerings are as expected - chow mein, lettuce wraps, walnut prawns.  Prices are more that what you would find at your neighborhood joint, but you are paying for higher quality ingredients, atmosphere, and completely identifiable parts in your food.\n\nI'd go here again for lunch - not as a destination, but if I were in the neighborhood.  The best seat is by the window where you can appreciate the beautiful light in this part of the city.  Easy, unfussy and guilt-free, with a reasonable glass of wine - not bad for a sunny Friday afternoon.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-05", "description": "Whenever I get into the city I'm always in a hurry, I'm hungry, and for some reason I need to pee. Why? I'm not sure, consdering I always make sure to use the bathroom before I get in the car.\n\nAfter fighting for parking, not being able to return my shoes to Neiman Marcus, and traversing through the endless accessory department at H&M (newly dubbed by me from this evening as Hipster & Moron due to those working at this fine establishment), I paid my expensive parking fee and got back in the car with one of my closest crew members. \n\nDid I mention I'm hungry? Oh, yeah, and she's ready to go to bed and doesn't want to even stop for food. Not a good combination for me. So I pick up my trusty cell phone and dial in an order to go from Dragon Well on Chestnut Street. It's gotta be good food for me to have to deal with the non-existent parking and the meat-head Marina people that always seem to take up two spots in their Porsche SUV's. \n\nSteamed veggie potstickers with nose tingling spicy mustard. Crystal prawns (sub the prawns for soft tofu) with big chunks of fresh ginger and edamame. Crispy and light vegetarian spring rolls with flavorful dipping sauces. \n\nThe best way, FYI, to get this delicious food in this impossible hood is to travel tandem. I double park the car, your bro gets out, gets the food, plastic fork, some napkins, and throws money at them and gets back in the car. You drive off not pissed cause you didn't find parking, cause you know you won't, and you've got the great food without having to even wait for a table, in just 15 minutes. \n\nI sat in my car, devouring the deliciousness in my lap until I turned the togo containers upsidedown to grab all those tasty juices. Loving every minute of my not-greasy, no MSG, light and healthy Chinese food, rationalizing once again how I spent 26 dollars on dinner for myself tonight. Feeling no remorse, I put my Basic Marin Wheels back into drive from park, openend the sun roof, fat and happy, and decided to head back home....but I did stil need to pee.........", "author": "Danielle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-28", "description": "I've never eaten in-house, but have gotten take-out here on a couple of occassions.  Bustling with diners in the evening, the front staff are upbeat, exuding friendliness.  The veggie salad is like having fresh spring rolls without the wrapper.  Served as one large order, it surely challenges the notion of not being able to get full off salad.  \n\nI doubt Muni's on time arrivals will improve any time soon, so my only recommendation would be for them to change the container in which they put their food in.  Waiting an hour for the 22 makes for one soggy paper bag.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-03-07", "description": "This is my favorite chinese restaurant in the city!  I love it!  Everything on the menu is great, but my fave are the wok tossed prawns!\n\nUpdate: I still love Dragon Well, but thought it'd be fair to share my opinons of dishes:\n\nPotstickers (only had non-vegetarian) - delish\nWonton soup - delish\nDragon beef - delish\nWok tok prawns - delish\nLemon grass chicken - delish\nMinced chicken in lettuce cups - okay (betelnut's is better)\nDragon beef - delish\nSavory sweet beef - delish\nWalnut prawns - not a fan at all\nGreen beens - ok (betelnut's is better)\nDuck - good, but small", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-23", "description": "I should first preface by saying I have never liked Chinese restaurants, I have found their food to be greasy, salty and soggy. \n\nHowever, last Friday I took yet another chance, but this time at Dragon Well.  Anticipating only the worse, I was completely amazed and literally speechless, as I wiped my plate clean.\n\nWe started with the won ton soup, pot stickers and spring rolls, all fabulous.  The entrees were even better.  We varied the entrees with a meat, fish and chicken dish each was so well done and beautifully presented.  As we ate, we ooed and ahhed as the food melted in our mouths.  (I'm making you hungry aren't I? ) We didn't have room for dessert, but I found a place for my chocolate fortune cookie. =)\n \nBy happenstance, we were at a friends place the next night and that's what they ordered for dinner.  I'm glad to not be the only fan!  Yumo!", "author": "Tamz O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-18", "description": "The only reason I know Dragon Well is because of my good friend Rita made us go there years ago and have been going ever since for two reasons--their pot stickers and Wok-tossed Prawns.  Dragon Well is very American version of Chinese food--you have to remember that.  The place is small, loud and reservations are good for the typical busy nights (thursday, friday, saturday).  Order half regular pot stickers and half veggie--getting the best of both worlds!  The Wok-tossed Prawns are spicy and are amazing!! Another good dish is the Tea-smoked Duck. \n\nOh and if you have to wait, just go to the bar next door....", "author": "Kristine F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-14", "description": "Not impressed. Sub par Chinese food. It's Americanized which isn't always a bad things (PF Changs). But it falls short in hitting the right flavors. 2 stars for nice decor and presentation on Chestnut but the food is really what's lacking.", "author": "Nelson C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-24", "description": "I came here with a Filipino guy and a Japanese guy, I myself am not asian but I've tried lots of asian food.\n\nThis place is not Chinese. It's American food which is Chinese inspired.  The flavors and ingredients in the dishes are not correct and the food is bland and oily. We were all really disappointed.\n\nWe aren't hard to please but this place just really didn't meet our expectation of Chinese. We ordered:\n\nVegetarian Potstickers\nThese were not even potsticker size or shape, and you can get better ones in the frozen section of asian supermarkets.\nHot and Sour Soup\nThis soup was not spicy at all, and it had tomatoes in it which was weird. It just didn't even have the flavor of hot and sour soup.\nGarlic Eggplant\nThis dish was the only one we finished, it was decent but not great\nPrawns\nThis dish was fried and it was in sticky sweet sauce. It was so heavy and unhealthy.", "author": "Adrianna G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-22", "description": "Went here for lunch today.\nVery clean\nVery boring food\nOkay pot stickers\nToo much batter on the crispy prawns\nYou can't sub chowmein or fried rice for the white rice with the lunch specials\nMeh. underwhelmed.", "author": "Natalie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-19", "description": "Blahdy blah.  After walking around the Marina for half an hour with my drunk ass boyfriend who didn't want to pay Marina prices, we settled on Dragon Well.  \n\nThis is a dumb name, and this restaurant (which is classy looking inside) sports the worst signage in the city.  I had the salmon stir fry which was great and Ed had some beef thing he liked.  Wine sucked, but I need to learn wine is not always a good idea.  The spring rolls were too greasy, bland and typical.  Our favorite part about the food was the siracha like homemade hot sauce with a pickle flavor.\n\nWhy oh why am I reviewing at work - gotta go", "author": "Dana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-29", "description": "Dragon Well is good eats.  Sure, you can give it shit for being on Chestnut Street.  You can give it shit cause the menu's small and it's not cheap.  Or because you are more likely to get a glass of Pinot with your meal than a large Tsing Tao, but the food is freaking great. \n\nSwitch the Mongolian beef to Mongolian chicken, double up on Potstickers (4 in an order is weak), whack in some white rice and a couple sizzling shrimp and take that shiz back to the home piece.  It really is good food and you probs won't feel miserable when its over, as long as you don't finish all 8 potstickers.  \n\nI'm hungry.", "author": "Eamonn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-12", "description": "I've been to Dragon Well a few times and haven't been disappointed. The atmosphere is clean and open, prices reasonable and service is good. \n\nFor food I've tried the Fried Calamari (really good), Mongolian Beef (really good) and a dish called the Bird's Nest. (good, but not my favorite). My boyfriend always gets the won ton soup and Kung Pao Chicken. We'll definitely be back! \n\nDon't forget the chocolate fortune cookies...so good!", "author": "Kim D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-30", "description": "I used to love coming here...but the food just isn't very good anymore and way too salty and oily for my tummy....", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-26", "description": "I'm not a big fan of super greasy Chinese food.  Thankfully, Dragon Well is not that at all.\n\nFrom stir fried salmon to wok tossed prawns, they always hit the right note. They also have some of the best pot stickers around! One of my other top picks is their chow fun with chicken or even better, with prawns.\n\nMy only, only gripe is that they don't have brown rice.  I know, I'm delusional to think that I can make the whole meal healthy with a side of brown rice, but a girl can try, right?", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-05", "description": "Dragon Well is healthy, clean Chinese. Very tasty, but I would prefer the oily, greasy, choke my arteries style. Hmm... NYC Chinese food... gooood.\n\nMy wife loves this place and believes my \"no love\" to Dragon Well reflects the reason why I'm 30 lbs overweight. Doh!", "author": "Bernard M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-14", "description": "Dragon Well is one of my favorites! \nIf you are looking for authentic Chinese cuisine, then this isn't the place, but their food is very tasty and affordable. \nthe decor is nice, soothing lighting and a great display of photographs on the walls. And whenever I've been there my server has been very nice.\nThe last time I was there I made a reservation and they were late seating us, not a huge deal. Once we were seated the owner came out and gave us a free appetizer and apologized for the delay in seating us.\nthe best dish on the menu, in my opinion, is the Garlic Eggplant. The flavor is perfect! I also really like the mongolian beef.\nThe serving sizes are quite generous, so you'll be able to get anoher meal or two out of it as well.", "author": "Kyle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-19", "description": "Ever since my college friend introduced me to this place in '99, I've been a loyal patron. The wor won soup is the best in San Francisco, in my humble opinion. I'm a soup fanatic, especially won top soup, and Dragon Well uses a water based broth that is light and doesn't weight down the noodles and won tons. The key is in their broth, I swear!\n\nThe walnut prawns are especially tasty if you're not keen on watching your cholesterol. I'm not, so I dive into them! Wok tossed prawns and steamed assorted vegetables are also tasty, light and amazingly filling. \n\nOnly downside: It's in the Marina so you're dining amidst a bunch of  old money WASPs. Aside from that, no other criticisms really.", "author": "Lara D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-27", "description": "I think Ali G.'s review sums D.W. up perfectly -- \"So the chinese food is on the healthier side, and the quality of ingredients is high for chinese food (so is the nice restaurant).  The only problem is the food is kind of boring in flavor.\"\n\nThis is a good place to take relatives from out of town, especially for lunch while showing them the Marina (believe me, I don't like the Marina, but as a good hostess, you have to do it!).  Because the food is kind of boring, it's hard to affirmatively dislike D.W.  So, it's safe.  Also, the prices are reasonable, especially for the Marina.\n\nMy biggest complaint -- Three times I have come here and ordered veggie dumplings.  The second time, meat dumplings came out and I sent them back and got veggie dumplings.  The third time, 5 veggie and one meat dumpling came out.  I bit in and had pork for the first time in years.  In my opinion, that's a pretty big mistake.  I told the waitress - all I got in response was one veggie dumpling to replace the pork -- 10 minutes later!!  Crazy, right?", "author": "Cara C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-21", "description": "One of my favorite go-to restaurants in the Marina.  It is reasonably priced and good food.  The service it great and I always leave with leftovers.  On Friday and Saturday night it can be hard to get into but you can wait next door at the Marina Lounge.  The host will come get you.  I highly recommend the beans and the pot stickers.  \n\nBottom line:  Good food, reasonably priced.", "author": "Karly N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-28", "description": "I'm giving it 3 stars only.  May I start by saying I love the food and the staff is SO nice...but, two things: \n\n1) Short but sweet - THEY COOK WITH CORN OIL.  THAT IS NOT HEALTHY.  THAT S--- IS NOT HEALTHY.  Which, I believe, probably relates to the fact that they are CHEAP, an issue conveyed in the much more detailed second reason I am not inclined to give this place any more stars.  Oh - and probably because it's CHEAPER to use plastic (which, when containing hot liquid, may be more likely to leach toxins into what you're eating) they now put some to-go items in plastic containers.  \n\n2) The management and ownership of any dining establishment goes a long way with me.  I've recently tapered off my visits (and MONEY, please pay attention, Dragon Well, the MONEY is not going to be coming so fast from me) because of the ownership.  The ownership (the girl who is always there, forget her name, but she's Asian and I know that doesn't help to narrow down anyone's identity) is just short-sighted and cheap as it can be. \n\nI usually don't think to write a review unless I have a really bad experience, whether isolated or overarching, or unless I love a place.  But my experience today just bugged the snot out of me. \n\nBad day.  Actually decent day, til about 1:30.  Suddenly things went wrong.  Decided to grab something to eat from the old DW, to go.  Walked in, paid by credit card, distracted by my bad day. \n\nThen realized, crap! I need a beverage.  I tell the very sweet server I forgot to ask for said beverage and would she mind.  As the very sweet server was filling my beverage (nothing had been said yet about charging me or not, but server knew about my bad day) Manager/ower comes stomping up.  I bring in new people, four tops, get take out a LOT at this place.  She doesn't greet me.  No customer service for this girl, no way.  She sees server filling my beverage and doesn't make eye contact - she just makes a beeline to see my ticket.  She almost stabs her hand on the little metal stand that the paid tickets get stacked on, she can't grab my ticket fast enough.  \n\nShe's checking to see - did I pay the $2.71 for my beverage?  She's gotta catch this shit, quick like, before I can get out the door with my $2.71 in my pocket still.  FAST!  PRONTO.  \n\nI hadn't paid yet.  And I didn't want server to get in trouble, and the situation was innocent and no payment had been discussed for lack of an opportunity.  The server is standing at the beverage counter, I'm ten feet away at the payment counter, and the place is loud.  But I could see how it looked \"bad\" (if it can look \"bad\" to give a long-time customer a free overpriced beverage once in a while). \n\nI made a couple pointed comments - the same comment twice, actually.  \"I saw you immediately grabbed for my ticket to see if I had paid\" (read:  you're a cheap, shortsighted pain in my ass who I can't stand that I am making you any money and if it weren't for your sweet - although sometimes on the slow side - staff, convenient location and edible food, I'd never darken your doors which probably are made of cardboard because you're just that cheap).  Owner/manager happily took my money, totally didn't take my point, and then I got outta there.  Whatever, some of her workers give me free stuff all the time behind her back, and they talk about how cheap she is.  So I'm not all that buzzed up about this incident - just the oppressive mentality and its long-term effect.  \n\nOn the way back to work I thought about it.  I like this place, but I'm too annoyed.  I've said it repeatedly, the staff can be slow but they are all great.  I think I'm going to keep tapering off my visits, paying them nice tips in cash when I do go in, and pray that something happens to the owner/manager that makes her see that while money may be necessary to eat, there are more important things in life.  Like, I don't know, maybe 5 stars on Yelp?  No, seriously, any businessperson can stand to free themselves a bit from the clenches of corporate greed.  \n\nWe're all in a recession, and that will be over, but people won't forget how you made them feel when our wallets were all a little lighter.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "The location can't be beat and the food is consistent. Not the best Chinese food ever but yummy and you know what to expect. The self serve vanilla and chocolate fortune cookies next to the register are nice touch.", "author": "Elizabeth K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-26", "description": "Just okay.  I went here the other night and it was not bad, but not memorable by any means.  I had vegitarian pot stickers, kung pao chicken and hong kong style noodles.  However, it was very amusing to see how far Marina parents will let their kids go before one gets up to escort them out while the other eats and settles the tab.  Now, that being said...the staff was really great and seemed to know most everyone coming in.  \n\nPS.  The beer is very tasty! : )", "author": "Jess S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "Great fresh Asian-fusion food.  The highlight was always the won ton soup - my husband and I could feast on the large bowls of those alone. Also good was the garlic eggplant dish.  \n\nAlso a great place for tea. I recall ordering something like the Bang Bang Monkey Goddess green tea. Very good.\n\nThey have chocolate fortune cookies - yum!", "author": "Love Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-05", "description": "When someone asks me where to go for a good meal on Chestnut, it's  always on the list (along with A16, e'Angolos, and Pacific Catch).  \n\nI have to agree with Lambert about the food.  The preparation just seems so much cleaner and less greasy than the typical Richmond Chinese restaurant.  For lunch, the steamed sea bass with bok choy is amazing.  Ditto the tea-smoked duck.  Ditto the minced chicken in lettuce cups.  Come to think of it, I like everything I've ever eaten there.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-09", "description": "This would be one of my first Yelp review as I discovered yelp not too long ago.  Anyhow, here goes....\n\nI am always skeptical of an Americanized chinese food.  If the restaurant has next to no chinese people, it must not be authentic or even good.  Well, I was wrong as this is one of the few Americanized Chinese food I would definitely come back to.\n\nAtmosphere:  Very clean, trendy, open atmosphere.  The staff upfront were very nice and we got seated rightaway.   The restaurant is narrow, but is very open as the ceiling is very high.  The place was half full when we were seated.  It seems buzzling, but not loud.  \n\nFood:  We ordered the lettuce cup, mongolian beef, walnut prawns, and pot sticker.    Let lettuce cup was very good.  I would say better than the other in SF that I have eaten.  I cleaned out the plate and wish I could have more.   The walnut prawns were retty good as well, tender and flavorful.  The Mongolian beef were not as one typically finds in a chinese restaurant, but it was good.  \n\nOverall, this is a very good americanized chinese restaurant.  There is nothing wrong with them mixing chinese with some bits of fusion and creating their own.  Good food is good food and I would come back here.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "Great food for a great price! The spring rolls, vegetarian salad and stir-fried salmon are among my favorites. Service is quick and staff is friendly. Overall an affordable dinner spot in the Marina. \n\nGood place to order and pick up too. Seats are limited.", "author": "Alicia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-22", "description": "Two years ago I would have given 5 stars, but in the last two years, my two best friends stopped working at Dragonwell (one a manager, the other a server) and the quality has declined slightly. On the one hand, that means I am biased, but on the other, I got to eat there many many times and try the whole menu.\n\nIts no secret that this is not traditional Chinese food, but that is the point. Its dressed up American Chinese food for the Marina set. All the basics are what you would expect from any good Americanized Chinese place sans copious sugar glazes and MSG.\n\nI love the Hong Kong noodles and chicken salad.", "author": "Zac H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-18", "description": "I've only been for lunch so I can't say that I've ever dealt with a crowd.  I kind of like that it's been quiet.  They have no problem leaving you alone to talk and enjoy.\n\nMy favorites are the Mongolian Beef and Kung Pao Chicken.  Potstickers are good but they're enormous!  I'd prefer more, smaller pieces.  I don't like having to pay for plain old tea.  I really don't like having to venture into the Marina to go.\n\nPretty good little place.  It's not someplace that I'd wait to get into.  Not bad for lunch out with a friend.", "author": "Melissa Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "Food and service is very good.  Dishes are pricey compared to Chinatown and Clement Street restaurants.  It's a great place if you want Chinese food near the Marina/Cow Hollow area.  They have a great traditional menu including Chow Mein, Chow Fun, Won Ton Soup, and even Jook.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-27", "description": "The neighborhood was slightly irritating. Oh yeah, it's the Marina. What's with all the spandex, people? And every shop on Chestnut street was about as wide as Michael Phelps wingspan... Good for swimming, not good for walking through to get to the bathroom. But I hold none of this against the restaurant. \n\nThis was supposed to be a Chinese place but it just didn't feel Chinese. It felt like an American-trying-to-be-Chinese place. And what's a good way to make an otherwise cute server not cute? Put a bull ring through her nose. Call me old fashioned. Maybe I was just in a bad mood. I was sick and I needed hot and sour soup. Dragon Well's was neither very hot nor sour. It was just ok. And a note to the delivery people: Use the back door. It seemed wrong to have to move out of the way for the hand truck of broccoli to come through the restaurant. I did get a chocolate fortune cookie though. Yeah, real Chinese. I hear the pot stickers are really good and that they have a dedicated pot sticker maker lady but I didn't get one. Maybe next time when I'm not sick.", "author": "Hunter G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-28", "description": "Great little neighborhood spot! The Mongolian beef, lettuce cups and butterfish are absolutely fantastic, however I've had some other dishes that have disappointed. The tea selection is great, and the oolong being my favorite.\n\nThe small space is decorate simply, and it can get a little loud at times, but all in all a great spot and very reasonably priced. I wish they would deliver, but am very happy to go pick it up!", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-17", "description": "I hadn't been to Dragon Well in over 2 years and was craving their Chow Fun which had always been a favorite.  This visit was to go and I specifically requested \"light on the oil\".  What I feel I got was REVENGE from whomever prepared my order.  In the 10 minutes it took me to walk back to work, the oil had soaked through the takeout container, through the napkin below it and the brown bag carrying it all. \n\nWhat I actually found when I opened the takeout container was globs of noodles stuck together in a gluey mass drowning in so much oil it literally dripped off my lips as I was eating.  I could only eat about 1/4 of it before feeling sick and throwing the greasy, globby mess of totally flavorless \"food\" in the garbage.  \n\n$11.06 I will never see again.  I hate spending money on bad food!  I will never go back and will never recommend this place to anyone ever again.", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-07", "description": "I like Dragon Well.  I think they have some good dishes.  And the portions are generous.  The one thing I don't like about this place and the reason why I gave it a 3 stars is that they are not consistent with their food.  When they are on, the food is as good as any Chinese food in the city.  When they are off, the food tastes like a poor man's version of Panda Express.\n\nSome of my favorite dishes:\nWon Ton soup (ask for chili sauce and mix it in, if you like things spicy)\nKung Pao Chicken (ask for breast meat, the taste is so much better)\nDragon Beef (ask for it extra spicy; also, this is THE dish where you get the most bang for your buck.  They pile on the food)\nWok Toss Prawns (this is their version of the Korean dish kam-poong-gi)", "author": "Chad N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-25", "description": "*Update 6/11/07: I really like this place.  It was busy for a Monday night but service was great and the owner (I think?)  was very friendly at the front and she was checking up on us which was nice. We ordered the Mongolian beef and curry mi fun noodles.  The noodles I thought could have used a teeny bit more salt, but with the mongolian beef dish being flavorful it more than made up for it.  Actually the two made a great combination of dishes to get, I though.  Yummy!\n\nPleasantly surprised with the food here.  Typically I'm not a fan of the P.F. Chang type Chinese food, but I liked this place a lot.  First of all, I absolutely loved the decor inside.  High ceilings, cool hanging lights, and there's a nice display of vases in the back, great atmosphere.  \n\nI got the lychee iced tea..it tasted like regular iced tea with just a hint of lychee.  Not quite what I was expecting, I thought it would be a sweet drink but it was still good. We ordered the spring roll appetizer walnut prawns and dragon beef.  You get 3 spring rolls cut in half, served with a sweet and sour sauce and mustard sauce.  Without the sauce, I thought they were a little on the bland side but really really good wtih the sweet and sour sauce.  The walnut prawns were so good, and the walnuts are perfectly crispy and also come with dried garlic slices.  The dragon beef was very good also, but be warned that there were more scallions and chives than slices of beef.  But I like scallions and the flavor was good.  Overall I thought everything was very light tasting and I didn't feel heavy afterwards like with regular Chinese food.  Prices are very reasonable, dishes are $10-$15.\n\nService was excellent as well, it was a busy night but the waiter kept checking up on us and was very prompt.  I would come here again.", "author": "Emiko M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-31", "description": "I've been going to Dragon Well for four years now and watched as the food and value has consistently declined. The two-star review is really a comparison against itself. It's still better than your average Chinese place, just headed in the wrong direction. \n\n\nValue:\nWe all know prices rise, but Dragon Well has been particularly brutal - slowly reducing the portion size then finally just swapping out half the portion of dishes like Kung Pao chicken with a serving of rice (that I didn't want or order). \n\nService:\nMost of the time I've gotten food to go, and it just kills me that they can't even be bothered to throw a few napkins in the bag (you have to help yourself to napkins/forks/sauces). If you provide zero service I'm not going to tip you - please don't give me a bad look about it. The table service isn't much better. Clearly this isn't an area of focus for them. \n\nIf service and value aren't important to you, Dragon Well is still a decent option for Chinese food. However, I'm just more and more disappointed every time I go there, so I'm done.", "author": "Dan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-01", "description": "well well well dragon well....finally we meet\nmeh....pretty good....not great...not bad\nnice atmosphere (BUT, why oh why do parents bring babies to restaurants and let their faces turn red from screaming their heads off, ruining everyone else's dining experience while they continue eating and pretend like nothing is wrong?!??!?!) anyways, good service, tiger is one of my new fave beers, inventive (but small) menu. i would like to give them three stars, BUT and this is a big ol BUT since i haven't eaten a potsticker in almost 7yrs (pre-pescatarian era) they earned themselves a fourth and shiny star for serving veggie potstickers with delish dipping sauces.\nill prob be back here, but id much rather go for thai or sushi\nalso, nice try on the chocolate fortune cookies, but i'd rather have the orig", "author": "Kaylan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-17", "description": "I went here for a first date. The date was OK. But this place made up for it because of their quick service and good food. \n\nThanks Dragon Well for leaving me with a  good taste in my mouth.", "author": "Cat R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-21", "description": "Seeing as we don't have any chain restaurants in the city, this place could easily replace P.F. Chang's. It's not authentic Chinese. It's not pink bag, China Town Chinese. You won't find a single Chinese person in this entire restaurant (OK, maybe some of the clientele..?) But this is seriously good American Chinese food. I def wouldn't trek afar for this place, but it's a few blocks away and I can't resist. \n\nMy favorite item on the menu is the walnut prawn dish. It's a little rich (just the way I like it) because the sauce seems to be mayo based. But the prawns are nice and juicy, the sauce is SO good and the walnuts are candied and golden delicious. The spicy eggplant is another fave dawg of mine. It's super garlicky, so again, beware. If you're going out after wards, do everyone a favor and pop some breaf mints. I can't remember the other dishes that I had: one chicken (with cashews..?) and a crispy beef something or other, but everything I've had here is good. The service is good and the place is nice and clean.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-29", "description": "An upscale Panda Express (aka my favorite Chinese food), this place has the right price, right service, and right food, with enough spice, grease, and everything else.  \n\nAnd my chocolate fortune cookie told me, \"You are not illiterate!\"  \n\nI am definitely going back... \n\nNow can someone fix that awfully scary-bright Apple store across the street?  It hurts my eyes...", "author": "Shirley F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-07", "description": "***UPDATE***\nWe had a reservation and still had to wait 20 min before we got seated. I understand that waiting for a couple of min is usually a given but 20 min is a bit too much for me.\nThe Hot and Sour soup which I usually like has been very peppery the last couple times.\nHave to take one star off .. sorry guys....\n\n***Original*****\n\nThe key is to order the Chicken Kung Pao extra spicy! That alone makes it one of my fav Chinese restaurants.", "author": "Doro P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-31", "description": "This is kind of a low 4.  I'm not vegan but I like vegan food, props to the place for having multiple vegan choices, but the food on the whole was not that exciting. Service OTOH was excellent. Nice ambiance as well, but you can't eat ambiance.\n\nThe food:\n\nvegetarian pot stickers - 4+ stars - plump and yummy, with a nice soy dipping sauce with a whole chile sitting in it, good portion size\n\nvegetarian ma po tofu - 3.5 stars - might be the dish itself - tastes good but gets boring after a bit - generous portion size\n\nvegan chocolate pudding - 3 stars - I broke my rule of thumb about never ordering a chocolate dish in a Chinese restaurant, and now I'm sorry. I think the quality was good; it just wasn't to my taste, as the tofu imparted a sour quality that covered up most of the chocolate taste. they also have a mango version, and I would try that next time. I definitely wouldn't get the chocolate version again; your milage may vary\n\nThe service: 4.5 stars. water refilled without asking. fresh plate brought after the apps. utensils transferred from plate to plate rather than putting them on the table. offer to box up the leftovers followed by prompt doing so. no suggestion selling other than for rice, which you would expect when ordering an entree at a Chinese restaurant so not offensive.\n\nI would each here again, but try a different entree and the mango pudding.", "author": "Charles B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-03", "description": "This is still my go-to place for white people chinese food in SF. \n\nBest veggie potstickers in the city. Tofu salad is off-the-hook. Also delicious: crystal prawns, lemongrass chicken, eggplant, pea shoots, salt/pepper prawns.", "author": "Anna K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-16", "description": "Forgettable.  Forgotten.  Forgone.\n\nWeak food and decor, blah blah blah.  Ugh, bland and boring seem to be the leitmotif of the Marina.", "author": "A. N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-28", "description": "Great Service and Good Food!\n\nMy buddies and I came here on Saturday night before our fundraising event at Gravity.  For a small place, they were very accommodating.  They allowed us to make reservations for 10 people on a Saturday night and provided superior service (all the wait staff were very nice and friendly).  In true fashion, we ordered a ton of food as well.  Here's what we got (my 1-5 star ratings per dish are in parentheses:\n\n2 orders of the Minced Chicken in Lettuce Cups (5 stars)\n2 orders of the Tea Smoked Duck (5 stars)\n1 order of the Salt and Chili Pepper Calamari (4 stars)\n1 order of the Steamed Hawaiian Butterfish (5 stars)\n1 order of the Tomato, Beef and Tofu (5 stars)\n2 orders of the Dragon Beef (3 stars)\n2 orders of the Scallops, Prawns and Calamari in a \"Bird's Nest\" (4 stars)\n1 order of the Garlic Eggplant (4 stars)\n1 order of the Hong Kong Noodles (3 stars)\n2 large orders of Steamed Rice\n\nAll of this food fed more than 10 hungry people with food left over (all of this could have easily fed 12-14 people).  The total came out to $139 before tax and tip (~$14 per person for a group of 10).  Overall, this place was solid and great for Americanized Chinese Food.  I'll definitely be back.", "author": "Herman N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-15", "description": "Good food.  It's not your traditional Chinese food. Light and flavorful, not greasy.\n\nI highly recommend the Salt and Chili Pepper Calamari, Mongolian Beef, Tomato Beef and Tofu and hot or cold Lychee tea.\n\nWarning, the take out portions are rather small.\nThe service is fast and friendly. Reservations are recommended for dinner.", "author": "PictureGirl F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-13", "description": "2.5 stars\nNice place for casual P.F. Chang type Chinese food.  Clean and relaxing decor.  Fun with friends.  Nice place to go for Chinese in the Marina.  Non greasy, and seems healthy to eat.  That part I liked. \n\nOverall, not memorable except the bill at the end.  Pretty expensive for Chinese food that wasn't that great.  \nService- Was actually very good.  Attentive waiters.", "author": "Chase F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-06", "description": "I really like this place.  \n\nWhen it's cold and raining outside, nothing hits the spot like a big bowl of their Won Ton Noodle Soup.  It has chicken, shrimp, pork Won Tons, noodles, mushrooms, carrots, and delicious-ness.  I drop a few spoonfuls of chili oil in there, and it's perfect.\n\nWhen we order the Won Ton Noodle Soup, we usually accompany it either some spring rolls and/or a beef dish.  Everything has been great except I won't order the Tea-smoked Duck again.  It's good, it just isn't what I was expecting.\n\nThe staff has always been great and if it is really cold outside, relax and get a pot of their tea.  The chocolate fortune cookies are a novel treat too.\n\nAuf.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-05", "description": "I went here with My Love! When we were just starting out so many many years ago! We were starving Teens that didnt have more then 10 bucks to eat with. We were strolling along chestnut and decided to split something at the dragon well.....\nIt was amazing we only had the BBQ pork chow mein but it was alot and filled us up :)\n\nFor years we could not find the dang place then finally we  found it and it is still amazingly good! We will always remember those young crazy days we spent in the city! Aww and the chow mein!", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-12", "description": "The pork pot stickers and sweet and savory beef are a staple in my diet. Come dine here or get carry-out if you live in the hood.  You won't be disappointed. Come with a few friends so that you can share the dishes.\r\n\r\nWhat you'll get: Good quality gourmet chinese at a reasonable price.", "author": "Allen X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-19", "description": "I describe Gary & Christina's restaurant as \"California Cuisine Chinese Food\".  They and their staff are friendly, attentive and serve decent food at a reasonable price.  I have been a patron since they first opened in about 1998 and have NEVER been disappointed!\n\nUpdate 11/14/06:\n\nEarlier I stated that I had never been disappointed here.  They are still so nice and do a good job so I will not take away a star.  BUT ... tonight I ordered a dish, the Mongolian Beef (to-go), which I have had a number of times in the past.  Tonight it was so laden with chili peppers that it burned my mouth and I had to throw it away & go to bed hungry!!!", "author": "Debbie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-01", "description": "I found this to be the SF equivalent of a PF Chang's down in San Jose.  Or, as I like to call it, Man Jose.  The interior is a bit cramped but they have very attractive waitresses. Sadly, the woman servicing my table this evening had a ring on her left ring finger.  This leads me to one of two conclusions: 1) It's a cubic zirconium pest control device , or 2) She settled.  \n\nOh, yeah, the food is quite good, too.  The pot stickers in particular were delicious.", "author": "Anthony D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "Went here last week for dinner and really enjoyed the food and atmosphere!  Won ton soup, lettuce cups, mongolian beef ...all was delicious!!!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-23", "description": "In my opinion, the best value for your $ in the Marina.  You won't go wrong with anything on the menu.  Try the potstickers, which are excellent, and I'm told are hand made every day.  The atmosphere is lively and good for a small group, probably not the best place for a date.\n\nThe only reason you don't get 5 stars is because you are consistently sold out of your amazing beef chow fun.... note to other yelpers: will you please stop ordering it so I can have more.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-10", "description": "Went here with a friend for a quiet Monday night b-day dinner.  She raved about this place and then went on to say how she likes PF Changs type of chinese food, so I immediately assumed this would be ho hum bland chinese food. Another lesson in life to not assume before you know.  This was some flavorful stuff.\n\nStarted off with a tiger beer, loved the name and haven't seen it before.  Was good but was like an asian Heineken.  \n\nStarted with the salt and pepper calamari.  Which was actually pieces of calamari steak and not the little rings or horrible tentacles! Nice touch.  Perfect spice and flavor and had these good crispy noodles under it.  \n\nNext we had the vegetarian salad which was the only semi-disapointment.  Really good crispy tofu but the dressing was bland and barely there.  And there was so much cilantro that was all I could really taste. \n\nOn to the wok tossed prawns that I was told we would order before we got there.  They did live up to their legacy and more.  We also had the sichuan green beans which were good.\n\nI don't know what kind of rice they use as their steamed rice but it has an amazing flavor. Didn't even need soy sauce!!\n\nService was great we had a cute, sweet blond girl that was always there to check on us or when we needed her.", "author": "L B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-25", "description": "I have been going to Dragonwell for years even though its not authentic but I like it when I like to hangout in the Marina. I love their mongolian beef, calamari, pot stickers. Its good for taking a group who are visiting and are not from sf which my family and I do. To me its a introduction to chinese food or just light food and for people who have sensitive dietary needs but don't get me wrong I still do like the authentic chinese food too.", "author": "Nadia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-13", "description": "This is a favorite.  The food is never greasy and is consistently tasty.  We've tried most things on the menu over the last couple of years.   Hard to go there with just 2 people b/c I find that I'd rather order more food to share - but if its just 2  - I recommend appetizers and 1 entree to split as I find the portions to be relatively generous.", "author": "Madhuri K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-24", "description": "I definitely agree with Jenny S. on this. This isn't traditional \"chinese\" food by any means (sorry Marina folks) but it is a great healthy substitute. Food here is pretty light and as such, you'll feel all the healthier for eating here. The green beans remain to be my charting topping dish but the mongolian beef wasn't too bad either. While it looks strictly like a sit down place, they do offer the take out option which is great for those in the neighborhood.  \n\nDrawbacks? If you're wanting down home chinese cooking, head to the sunset district.", "author": "Jonny Bobby G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-11", "description": "3 1/2 Stars\n\nChocolate fortune cookies, tasty chicken chow mein, & a nicely designed menu, all sum up why I frequent this spot on a monthly basis. I've taken my parents & friends here a few times and they've all really liked it.\n\nThe food could be a little better in terms of consistency, as there have been a couple of times when my chow mein was a bit too greasy, but for the most part I've walked away full & satisfied. They have a variety of items that are hits: Lettuce cups, Chicken Vegetable Stir Fry, Walnut Prawns, Chinese Chicken Salad, & of course the Chicken Chow Mein. I don't recommend getting a plate of their vegetables if you're going to order the Chicken Vegetable Stir Fry since it's basically the same exact vegetables sans the meat. The only menu item I haven't been impressed with is their Hot & Sour soup which in a bad way, just didn't seem like the typical Hot & Sour Soup. Two of my co-workers had poor opinions of the soup as well. On the other hand, their wine selection is excellent w/ a full bodied Pinot Noir from Laetitia Winery & a refreshing Chardonnay. \n\nService has been good w/ friendly waiters & a great manager. When I was there for my brother's b-day dinner, the large dinner party next to us was being obnoxiously loud (the sound in there echoes easily given that they have such high ceilings) and when my dad complained to the manager, he quickly took care of the problem.\n\nTheir overall ambiance is just OK- they have a slight modern feel to it w/ dark wood tables & chairs along with a few authentic images of SF's Chinatown natives, but it tends to give off a cold & empty sort of vibe that's a bit worn around the edges. \n\nDragon Well is a good go-to place for lunch breaks since I work just around the corner, but I still think that they could perfect a few more things.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-16", "description": "In my quest for good Chinese, Dragon Well is just about the best and the healthiest place I've found in the city.\n\nEvery time I've been it's been crowded but the wait was always surprisingly short.\n\nOne thing I could bitch about:  The Marina crow of young mothers that frequent this place by the thousands and decide that it's a cool idea to keep their strollers out in the aisle.  Hey Dumb Mothers abound - you are not the first or last d-bag to get knocked up, and no one thinks it's cute if you act like a social retard and disregard other diners just to dine out with your little Timmy One Tooth.  Fuck that shit is annoying.  Aigh't, back to my review.\n\nOther than the sometimes annoying crowd, the food is good and healthy (or healthy-er), by Chinese standards.\n\nTry the Spring Rolls, the dipping sauces are good but be careful not to choke yourself on the hot mustard like I did, that shit burns the nostrils if it gets wedged up there, fwiw.\n\nThe Won Ton Soup is also good, not too far from your everyday, classic Won Ton, but it does the trick and hits the spot.\n\nThe Savory, Sweet Stir-Fried Beef is always solid.  I've since stuck to ordering this as I felt the Tomato, Beef and Tofu plate I got a couple times always left me unsatisfied.\n\nMy bf typically gets a serving of their Steamed Rice with the Stir-Fried Chicken and Vegetables or the Lemongrass Chicken - both are good, but Chicken is probably my least favorite dead animal so it's only fair that I don't go too far into a description.\n\nI'm also down with their Lychee Iced Tea, so overall I can't really complain.  Dragon Well has gone me good", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-14", "description": "Food is good and reasonably priced.\n\nAmbiance is simple; it's a small place after all.\n\nAll around a good go-to local Chinese place but nothing to cross town for.", "author": "Nate H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "This is one of my top take-out places.  I might actually eat here 2-3 times a week.  I crave their Hong Kong noodle dish regularly- it's crunchy chinese noodles underneath a broth-based assortment of meat and veggies- very yummy!  Their portions are easily split between two people, or if you order take-out, I always take half of the left-overs for my to-go lunch the following day (warms up great in the microwave).  If you go to the restaurant, I suggest sharing food with your friends so you can try multiple things.", "author": "Kimberly C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-01", "description": "I have never met a really good Chinese Food in SF. \n\nDragon well is OK. Service is pretty good.\nIf you want a pretty good Chinese Food. Here it is.\nNot yet VERY good. \n\nI like the layout of the place. It's pretty comfortable. Hmm.", "author": "Green Mango Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-09", "description": "Tofu Tomato Beef is on the mark.  Beef was tender and dish was a perfect blend of flavors.  Pea shoots were scrumptious. Attentive consistent service.", "author": "Isabella L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-30", "description": "Yummmmm! I salivate just thinking about this place. What to eat?\n\nWonton NOODLE soup (not wonton)\nVeggie Potstickers\nChicken Chow Mein\nSweet & Sour Prawns\nChicken & veggie stir fry\n\nI LOVE the fresh veggies and shrimp in the wonton soup. The chow mein is flavorful and lacking the lbs of MSG and oil we commonly find in Chinese dishes. Veggie potstickers are scrumptious and a nice change from the traditional pork. This place has helped me re-find my love for Chinese food that was lost from too many trips to PF Chengs (yuck).\n\nGreat for takeout and a quick and easy meal. I always feel quite cozy in this restaurant.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-09", "description": "Other reviewers are interesting on the topic of \"pseudo/american\" chinese and what is and isn't chinese. I am chinese and don't feel that authentic chinese food has to be served by non english speaking chinese people or that it has to have sticky floors and be dirt cheap-that itself is stereotype. \n\nThis place provides  nice atmosphere, with a asian flair- I find it very comfortable. This place is however, in the marina- I would complain if they didn't have menus in english- and offer a brown rice option- good restauranteers should know their customer!!!  I am quite sure, unless its been sold, that the owners are chinese and a very nice couple/family if memory serves me correct- and their food is quite authentic. REAL authentic chinese food (from china) wouldn't even sell here....that's the truth of the matter.\n\nBut, the food here is authentic chinese- dishes my mother (or grandmother) cooked...with some variations of course...some of the dishes are americanized- but I've seen many more examples in places much worse. It has both here. \n\nDirt cheap chinese food (ie: low quality meat and ingredients), in low rent neighborhoods and wait staff that is paid under the table, and lack of sanitation standards (which is what CREATES dirt cheap prices....) is NOT what chinese has to be in my eyes. It can be fresh, well made food, served by people from the community they serve, in a nice atmosphere.", "author": "Melissa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-09", "description": "If you don't mind americanized Chinese food, which I personally happen to enjoy, then this is a decent place.  There was no line, the atmosphere was nice and the food wasn't too expensive (plus I had good company).\n\nI definitely recommend the Mongolian beef, but would not recommend the Kung Pao chicken (the Kung Pao chicken pieces were too finely diced in my opinion).  \n\nOverall, this is a nice place, and at least the one time I was here, did not have a line.", "author": "E-dough R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "Very good food. Great location. Friendly service. Highly recommended. Eggplant dish very good as well as the Black Bean Chicken.", "author": "Miguel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-26", "description": "Update:  The service was slow when the restaurant was NOT packed.  (Seemed inexcusable).  Minus 1 star from my last review.\n\nHighly recommend this place for their shellfish-free wonton soup.  Very clean and delicious.  Don't forget to grab a chocolate fortune cookie.  Yumm!  Very reasonable pricing with most entrees around $10.", "author": "Mandy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-04", "description": "3.5 stars.\n\nCareful, it will make you stinky...\n\nThey offer unique food. Try the Savory, Sweet, Stir Fried Beef (yes, that is what it is called) or the Sichuan Green Beans, though they are oily they taste good. I would say stay away from the Kung Pao Chicken. Half the plate is peanuts and it really lacks kick! (get it?)", "author": "Lee M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-27", "description": "This is a great, reasonably priced Chinese place. \n\nThe lettuce cups rock, the beef chow-fun is well, fun, the alcohol is well selected, and everything comes out very quickly.\n\n The only thing my girl and I wish was a bit better is the less than romantic ambiance. It's more of a family/good tastin' quick dinner out sort of joint. The staff is great, it's simply the space itself, not that easy to turn into a \"romantic\" place. But if you've been together for as long as we have, it's still a great spot to hit on any night of the week.\n\nThey do take-out too!", "author": "Kate P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-18", "description": "The food was decent with the right flavor and ingredients. They have a good selection of food so that's definitely a plus. I would describe it as Chineses-American food since it's not quite greasy/salty enough to classify as chinese but not as fattening to be called American. Wine list wasn't that great though. Well, unless you want to drink (which I did...a lot), then get their zinfandel bottle...not the chardonnay. \n\nThe decoration was nice, good lighting and chic. SUPER noisy. I think it's the small space and the type of environment. Not a place for heart-to-heart talk but good for a Friday night with a group of friends.\n\nMy biggest compliment is their service. Everyone was really friendly. The host was very accomodating and they're always making sure everything is good.", "author": "My V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-29", "description": "My god avoid this place completely.  we went here for dinner, looking to satisfy my craving for good chow mein.  I figured, hey, it's americanized, maybe they'll have, at the least, generic chow mein. \n\nIve never walked out of dinner so dissapointed.  I didnt even want to take any of the large portion of left overs home; it was that bad.\n\nI dont understand why people go here. $5 for tea? please, go to a chinese restaurant, and it's free, and way better (bottomless too)", "author": "Chieko H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-08", "description": "With supposedly healthy Asian offerings, I'm a skeptic. It's Chinese afterall! But I am a serious walnut prawn junkie and the mongolian beef is wonderful. Hard to share. I have to try the green beans next! \nIt's cramped but feels like a neghbourhood bistro, which is the big attraction for me. Specially on warm evenings when they roll back the windows. And the fortune cookies are always right on, which stands for something, right?", "author": "Killing Me Softly .."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-23", "description": "Horrible, awful I do not know how they are still in business. After telling my parents this place was lacking in flavor they insisted we go. I will never come back. I had the Chinese chicken salad and it was HORRIBLE!! NO flavor, blah, iceberg lettuce, no dressing, nothing was in it that was listed on the menu. Dad had the chicken and veg. Again flavorless and blah. For some reason they have fancy tea service. Why not focus more on the food and pass on the tea. I will never come back as this was the 2nd time I have been and both times the food is horrid.", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-27", "description": "Really bad food.  Sure the restaurant is pretty, staff is helpful and friendly.  However, I come to a restaurant to eat, and this place has bad food.\n\nThe garlic eggplant is mushy crap.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-25", "description": "My sister's favorite place for Chinese in the marina, so we end up there a lot. I have never had bad food here, but it's never spectacular, either. Very Americanized, and they charge for rice. Rice!!! Portions are smaller than one generally receives in a Chinese restaurant, but service is usually decent and quick, and the place is very clean and nicely decorated. If she didn't make me come here, I wouldn't choose this restaurant in a city known for incredible Asian cuisine.", "author": "Mindy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-22", "description": "Pros: \n*You can see the chef in the kitchen from the wait at the restroom, and he is Chinese.\n* Fresh ingrediants and good sized chunks of meat and veggies\n* GREAT won ton soup\n* Good Service\n\nCons:\n* FREEZING\n* Something PF Chang-ish about the food - must be because it's in the Marina\n* The steamed rice is strangely stuck all together, but is not sticky rice\n\nThink of this as a good place to get a good quality lunch if you're in the Marina, but not as an authentic Chinese spot.", "author": "Leslie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-21", "description": "Sure, this isn't CHINESE food. But its chinese food. You know what I'm saying? It's like a PF Changs, but its not so much. \n\nThere's really not much about this place I don't like. Honestly. I've tried the Chow Fun, the Lemongrass Chicken, the soups, the teas, the Potstickets, the Lettuce Wraps, and I'd give all of them 4 stars.\n\n4 stars it is...\n\n\"ai\"", "author": "Anand I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-15", "description": "My general rule is to not trust an ethnic restaurant without patrons of that same ethnicity.  Chinese food in Marina?  Nuff said.\n\nIt wasn't bad, but SF has way too many great Asian restaurants to go here.  I was with two Chinese friends...we just ate and left, not commenting on the food either way.", "author": "Sonic D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-29", "description": "Solid chinese food, solid service. This is pretty much everything you'd expect from a chinese restaurant in the Marina; slightly upscale, American-Chinese food, low lights and beautiful people, pretty loud. Hong Kong noodles are excellent, and wok-tossed prawns aren't so much wok-tossed as seriously f*cking fried, and they are great. \nIt's not exactly a relaxing place to eat--it's crowded and kind of rushed--but then nothing in the Marina is really relaxing.", "author": "Kathleen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-23", "description": "It's time for Dragon Well to change things up on their menu. There just isn't anything spectacular about this place to justify the price... Last nights meal consisted of pot stickers and lemongrass chicken; $20!\n\nNot worth it.", "author": "Yum N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-09", "description": "I hate to say it but I miss good 'ol Americanized chinese food. I love the authentic stuff but sometimes the American take on Chinese food deserves a special nod. Went here with a coworker expecting the worst but was pleasantly surprised at the generous portions and appetizing dish. I had the Mongolian beef and the beef was soft, the veggies were plentiful, and the sauce was actually pretty tasty. I thought the chocolate-flavored fortune cookie was kinda weird though. Service was good, too. My only gripe would be that they don't use enough MSG. Yeah that's right I love the stuff and I don't care what the haters say: MSG is da bomb. If you're not eating MSG you're missing out. Next time I'll ask them to sprinkle some of that mouth-watering goodness for that extra umami flavor.", "author": "Captain Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-27", "description": "Great, HEALTHY, pseudo-Chinese food that is very high quality...and every time I've gone there, I've never been disappointed by the food or the service.  I deducted one star since it can get really busy on the some evenings.\n\nAll the dishes I've tried (chicken and vegetable stir-fry, hot and sour soup, spring rolls, kung pao chicken, etc) and the other food that my friends have had haven't disappointed.  Highly recommended if you're in the area.", "author": "Venu B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-25", "description": "1/13/2008 Edit: Just got back from a terrible dinner here. Appetizer was good (chicken lettuce wraps) but both entrees were terrible. The Kung Pao Chicken had an odd taste and the Mongolian Beef was so oily it felt slippery in my mouth. Probably won't go back, especially after expressing disappointment to the server and having him chuckle and say \"yeah, sometimes it's greasy\".\n***\n\nFood is decent, decor is nice, staff is friendly, service is quick, prices are reasonable. I'm having trouble writing this review -- Dragon Well is so, well, non-descript. Nothing stands out, but nothing is bad. I shared the vegetarian salad and chicken chow mein with a friend. Both were good, but nothing I'll be craving in the future.  \n\nIf you're looking for a nice tasting, relatively cheap meal at a decent restaurant in the Marina, try Dragon Well. If you're looking for a fix to a Chinese food craving, I'd go elsewhere.", "author": "Beth M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-17", "description": "Good mongolian beef, bad prices for lunch special.  I would rather spend a couple dollars less, and they don't even bring you out a little cup of egg flower or hot and sour soup or anything.  I didn't even get a glass of tea.  The menu said it was $4 for a pot of tea, and then listed a bunch of fru-fru flavors.  Lame.  \n\nI know its The Marina AKA \"Little LA\" and they are trying to go upmarket or something, but I was a little put off by the whole thing.  Next time I will drive up to Polk and Broadway and have a more authentic Chinese lunch special at Tai Chi and pay half the price.  And get free tea and soup.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-18", "description": "Very enjoyable, affordable, casual Asian food. Great for sharing with the table. I ordered steamed butterfish that had a side of bok choy - it was very good. The table shared veg spring rolls and calamari - not an exciting order, but very good.\n\nThere was a good selection of vegetarian, seafood, poultry and meat options.\n\nMy one complaint was that it took 15-20 minutes after three of us ordered different pots of tea from their menu (a nice selection of teas, by the way), to receive the order. In fairness, the server did say there would be a bit of a delay due to a large table having used a great many pots and cups. That being said, the time it took for him to say that and having the tea brought to us was a bit excessive. Obviously not a big deal, but wanted to mention it.", "author": "Gary B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "I've had some great meals and some \"average\" meals at Dragon Well. Overall I'm giving it a good rating because of my last dining experience - let me discuss my rationale: \n\n1. Start off w/ one of their tasty appetizers. I'm a big fan of their pot stickers and won ton soup - the pot stickers are great to share w/ the table, and they offer plenty of stuffed pork for each person. \n\n2. Although slightly greasy (what chinese food isn't?) the chicken chow mein is always a tasty noodle dish. If I were you, i'd avoid the kung pao chicken. Given my love of spicy food, I've sampled this dish on many occasions; unfortunately, it just doesn't live up to my expectations. \n\n3. The Mongolian beef is usually a crowd favorite - however, I'd rather vouch for the savory, sweet, stir fried beef. It comes with a generous portion of broccoli and red peppers - you won't regret this one. \n\n4. If you're a fan of prawns, I recommend the wok-tossed prawns. They toss them in this sweet sauce that will definitely make your pallet say \"thank you sir may i have another!\"", "author": "Jonathan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-01", "description": "Cool location.  Cool place.  Mediocre food.\n\nThe food was extremely oily and it lacked flavor.  The eggplant was slimy.  The vegetables were soggy.  Thankfully they gave lots of rice otherwise I would have followed up with a second meal somewhere else.", "author": "David K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-02", "description": "We stumbled upon this place by accident, and it's our new favorite for Chinese food.\n\nThe ingredients are fresh, and they give you tons of really tasty food. Sometimes people give high ratings because the amount of food somehow mitigates poor quality - this is not that kind of place. The food is very high quality, and they certainly don't skimp on the meat or seafood. I was amazed at the amount and quality of the food for the price.\n\nThe spring rolls were great, the staff attentive, and the chocolate fortune cookies were a tasty surprise.\n\nThey serve loose leaf tea, which is much better quality than the usual restaurant tea. I guess they have to with a name like Dragon Well.", "author": "Alison K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-15", "description": "I'm always amazed at how fresh the broccoli is in the beef-broccoli dish.  The combo is excellently seasoned and with a side of rice and a chocolate or regular-flavored fortune cookie, Dragon Well is hard not to like.  \n\nThe ambience is also pretty decent.  I think this place has a great menu, is well run and clearly a reliable option.  Check it out.", "author": "John M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-13", "description": "I think this place is pretty good.  I've had better Chinese food, but it's overall pretty good.\nI recommend the pot stickers, some of the best I've had in a  while!\n\nOverall, this place is good, but if you want really good Chinese food I recommend this really good place called....what was its name...?  Oh yeah, CHINA TOWN!\nIt works for the Marina, but while you are thinking about this place consider Mamacitas, its just down the street.", "author": "Matt P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-28", "description": "OK. . .\nThis is getting out of control.  I am so hooked on their Mongolian Beef and Rice. . that I will actually get in my car, drive over to Chestnut St. and order this twice a week. . . and  to justify the gas and time, I try to hit a few other stores in the area i.e. Pottery Barn, Gap, Giggles. Books inc. . just to name a few. . \nThis place is very kid friendly and everything I have eyed coming out of the kitchen on the many eat -in times I have been here looks and smells delicious.\n\nnote to self:  order the chicken salad or spring rolls or something else. . .", "author": "Kea C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-10", "description": "I love Dragon Well. The food is delicious. The atmosphere is fantastic. They serve family style. I recommend this for everyone.", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-17", "description": "Love the place. The food is great and fresh and the staff is really friendly. Every time I go there I get the walnut prawns. Its delish. The prices are reasonables for the amount that they give you. Good for small groups and couples. The chocolate fortune cookies that they give at the end are really good. I like and I am going to go back there again.", "author": "Sheyla A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-24", "description": "Excellent food, great portion sizes- not too much food. Four of us shared an appetizer, got a couple sodas and had three entrees for about 50 bucks. We had pot stickers (some of the best I've had), walnut prawns that were awesome and had a light coating of sauce, kung pow chicken and chicken chow mein. We cleaned all of our plates. Don't forget the chocolate fortune cookies at the end! So good!", "author": "Jessie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-05", "description": "I really like coming here and have been doing so for many years. Always California-fresh, always clean, always yummy. I esp enjoy the wonton noodle soup - although I like the noodles they used to use better (this was years ago) - current ones are spaghetti-like. Lychee ice tea is very good. I love all the green veg stir-fry dishes and the eggplant stir-fry. This was the first place I tried garlic stir-fry pea shoots - I make this at home all the time now. My girls love the chicken chow-mein and chocolate fortune cookies. Hubby enjoys all their shrimp dishes. Friendly neighborhood Chinese. Wish I still lived in this neighborhood. :)", "author": "Nina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-19", "description": "Stronger contender for best wonton soup in the city. (I get the wonton noodle soup without the noodles b/c it has chicken, shrimp, spinach, which the regular wonton doesn't have.) Walnut prawns are awesome. Butterfish, moo shu pork, hong kong noodles, lettuce cups - all delicious. Great food, fresh ingredients, not drenched in grease.  Have never had anything here that I didn't like. Only downside is that they don't deliver, but the take-out is always piping hot and delicious.\n\nAs for all the people complaining about the prices, you get what you pay for. Chinese food made with crappy ingredients is cheaper. Duh. I'll happily pay an extra $10 to have a great meal and not spend the night curled around the toilet, begging for mercy.", "author": "Maggie Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-07", "description": "I went here the other day and sat in the restaurant, which was completely empty. I finally had to grab someone to order because they somehow overlooked me. When I placed my order, he said \"are you sure?\" and I said, \"well not anymore\" and he proceeded to tell me that the dish i was ordering was \"disgusting and terrible\" so i had to order something else. \n\nThe food was fine, but the service was absolutely terrible. I will not be going back here again.", "author": "Lady L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-30", "description": "Great place! My beef dish was awesome!", "author": "James P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-07", "description": "I happened in here with some friends last week after the place we wanted to go had too long a line.  I am sure glad we did, cause the food was great!  \n\nThe dumplings were extraordinarily good, and my kung pao chicken was delicious.  It is very Americanized, which suits me well.  I have bad reactions to MSG, and had no issues with this place, so I assume they do not use it.", "author": "John C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-01", "description": "Dragon Well is my go-to place for Chinese food.\n\nI call it Americanized Chinese food, and I trust this place and everything on the menu.  I'm no Chinese food aficionado - meaning if there is Mu Shu Pork on a menu, I have no clue what that is.  So I love that they list out all the ingredients in their dishes.  \n\nMy favorites:\nPork or Veggie Pot stickers\nHot & Sour Soup\nKung Pao Chicken\nMongolian Beef\nLemongrass Chicken\n(Can you tell I'm totally plain Jane American?!)\n\nLove to dine in here or pick up and enjoy at home.  Friendly staff up front, and don't miss the chocolate fortune cookies!", "author": "brittany z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "Editing this review 8 years later... post kids, with allergies, this place rocks.  They care.  Trust me.  My original review is below (pre-kids) and now that my needs have changed, I think the food here is great, they care about the ingredients, they are helpful and service oriented, and I wish I could still eat at this place regularly (because I've moved.)\n\nThe following is my old review....\n\n----\n\nThis is a good go-to place for last minute smaller groups.  The food isn't ridiculously overpriced and doesn't suck, and it is rarely SUPER crowded.  But beyond that, it doesn't have a ton to offer.  if you like the really \"bad for you\" stuff, they do a fantastic Walnut Prawns.  But if you are trying to get something healthy, even the stir fried vegetables seem a bit slimy to me.  Still, I like the ambiance, service, and reliability.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "this place is yummy and has a nice simple atmosphere.\ngreat place for our ten year old's birthday lunch with 6 friends.\nwhile we waited for food to be cooked we were able to get a birthday present at the apple store across the street and check out the ipod gear.\neasy walk from the exploratorium...", "author": "Jasper T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-14", "description": "My reviews are too long, and this place doesn't need one from me... so concise is the key.  The atmosphere is open and light, bright at the top of the room, but twice as tall as it is wide.  The staff was so confoundingly attractive it almost made it too difficult to ingest my fantastic lunch.  A bit inauthentic, while being some of the best thai lunch I have had in a while.  Screamed upscale a bit, but I think they suffer due to the neighbourhood.  Frankly... not one thing on our tab was over $10, we ate well, and enjoyed every second.  Cheers, and thanks.  This was not the succinct I was hoping for however.  I got to get into two word reviews.", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-28", "description": "I'm so glad that Dragon Well is in my neighborhood. Their food is excellent, and I love that I have can order brown rice, and they will also prepare their dishes with less oil upon request. Their wok-tossed prawns are simply amazing (savory, sweet, salty, tangy and a little spicy), as is their Mongolian beef, chicken lettuce cups and and Sichuan green beans. The restaurant is very clean, and the service has always been friendly.", "author": "kimberly h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-30", "description": "I go at least once a week for lunch, and they have the BEST vegetable pot stickers EVER! The food is great overall and the service is great and fast.", "author": "jolie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-05", "description": "My friends played a cruel April fools day joke on me...they told me my favorite healthy Chinese restaurant closed!!  It did not thank goodness. This service, food and prices at Dragonwell are always great and dependable.  It's a great local spot to eat out casually as well as gather with friends and family.  Big fan of Dragonwell!", "author": "Sue W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-02", "description": "A good dose of salt combined with an incessant need to come back again and again always greets me at dragon well. The Hot and Sour soup is enough to clear out the most temperamental of sinus' and the Mongolian beef is really the only entree I see on the menu. I can take or leave their kung pao chicken and their chicken chow mien minus the chicken is the best decision i've made all night- well its a close second to picking Dragon Well in the first place. I don't see any competition near in the neighborhood, or anywhere else in the city for the matter. No, I don't see any competition at  all, mostly because all I can think of is the salt, and the way it makes me beg for more.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-22", "description": "Definitely a fan. The pea shoots are a great starter as are most of the appetizers offered. The food is far less greasy than any other Chinese restaurant i have ever eaten at. The staff is really friendly and the service is always quick even though they are normally packed.", "author": "Mallory M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-18", "description": "I am sure I had written a review for this place. I accidently discovered this place walking by! This place is very small and charming. This was the best Chinese food I have ever had. I had the hot and sour soup! Beef Chow fun, Wok tos Prawns, Garlic eggplant and steamed rice. WOW evrything I tryed was perfect and extremely flavorful and they brought the food out very fast. The waitstaff was very friendly! If I lived in SF I would make this my regular to go spot.", "author": "Azizi A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-06", "description": "I love this place. Its only downfall is that it's on Chestnut, the Boulevard of Tools.  If I didn't have such a pathology surrounding calories, grease and obesity, I'd be here every week. I adore the beef w/ broccoli, chicken chow mein, lettuce cups, spring rolls....I could go on, though I won't.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-27", "description": "I always avoided this place because it's a cheesy name and its a semi fancy looking Chinese place in the Marina, but it's not bad.  I like the nice take out boxes...the little extra spent on the nicer box makes me think they spend a little extra buying fresher ingredients as well.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-27", "description": "I go to eat here often. I order the spicy green beans and lemon grass chicken. nice people work there!  The the best chinese place in the city!!", "author": "Lily S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-09", "description": "So it is Chinese food for white people.  Is that a bad thing?  Is that not allowed?   Are we required to only eat the most authentic of foods?\n\nWhen I was in Shanghai, some friends and I had a local graduate student and his girlfriend (Funny story that, he apparently was married but this was his girl on the side) show us around town.   We bought copy goods at the Xiangyang market.  Had some really good noodle soup for lunch.   The student proudly showed us Chairman Mao's statue (I bit my tongue) and shook his fist at Madame Chiang Kai-Shek's house (who died in SF, I didn't bring that up).   In the evening we crossed the river into Pudong, the part of the city that is straight out of Blade Runner.   We ended up trying to find a restaurant in a super-modern mall that looked like it had been constructed last week.   The name of the place we ate?  \"San Francisco\"    No shit.   My friends (from Italy and France) demanded it, and I humored them.   The food was mostly steak and italian, and the prices were well beyond the means of the average Shanghaiiese.   The decor was bits and pieces of SF landmarks, thrown together with no apparent rhyme or reason.   At the end of the meal, which was a bit bland, but ok, my guide asked what I thought.  Was it like San Francisco food?  \n\nIs it my place to tell him no?  Odds are neither he nor most of the other patrons of this restaurant will ever go to San Francisco.  Much like the patrons of Dragon Well will probably never go to China.  Each will be happy with their experiences going to these restaurants.  Who am I to begrudge that?", "author": "Beau G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-13", "description": "Fresh ingredients, not too greasy, definitely not authentic but tasty! It's a little expensive for Chinese food but you're in the Marina so - go figure! :D", "author": "Ali L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-28", "description": "Yawn. I was so bored with this place. I was bored with the food, the service, the ambiance. I'm bored writing this review. The only reason why I would ever come again is if I suddenly had cravings for minced chicken in lettuce cups. I love eating meat in cups of lettuce. It's just so silly!", "author": "Kristen D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-02", "description": "The Tossed Prawns left me severely dehydrated and wondering how many hours it was made before I had ordered it. I like Chinese food but this place is far from good. The food is so salty and way greasy, especially the Chow Mien. I understand that Chinese is definately not typically healthy, which is why I went to Dragon Well today but gross. Sweet and Sour soup, eww  I have a friend who swears by Dragon Well as his go to take out but I never want to eat it again, ugh...Try it for yourself", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-28", "description": "Its cute, popular, trendy, blobity blah blah blah, the quality of the food here is good, but its just not spectacular enough to justify a trip into the belly of the beast (Marina). The mongolian beef is just good, not great.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-22", "description": "I went in for a casual dinner. The space is small, but not tight. You know how some places have you bumping elbows with the next table. I really don't care for that much. It's like \"hello there, mind removing your elbow from my soup?\" So what I'm saying is this place is kind of like a Mini Cooper. Small on the outside, but roomy on the inside. The ambience was nice. Possibly a date spot, but I guess with the right date anywhere is. Nothing really stood out, but this joint definitely gets a passing score. So here's the basic review. Good food, check. Good service, check. Decent prices, check. I had fun, check. Bottomless fortune cookies, check. I'll be back...for the pork pot stickers.", "author": "Stafford J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-06", "description": "I eat here at least once a week. Pretty obsessed with the Lemongrass chicken. I mean really, why stray from such a good thing? I have heard that the stir fry chicken is pretty bland and I wasn't such a fan of the wonton soup, but otherwise, all in all a really yummy place, and nothing but great service!", "author": "Julie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-12", "description": "Delicious, not greasy and a good kick to the food. It was delicious I was surprised I even liked the tofu salad dish. I loved that the service was efficient and the place had a chill atmosphere. It is a bit loud but what do you expect in a good restaurant? Chou Fung was great too. Lauren, they got your brown rice! For the first time since I can remember I ate a fortune cookie.. chocolate! It was yummy. Ohh and it was all yummy the day later when I reheated it.", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-03", "description": "Let me preface this review by saying that I harbor no illusions about Dragon Well serving authentic Chinese food. I like Dragon Well for other reasons: quality ingredients (all white-meat chicken in their dishes) and healthy preparations (tons of vegetables and \"light oil\" on request), both of which fit the bill for mid-week take-out, especially after a trip to the gym. Their chicken won ton soup is also my go-to cold remedy. Minus one star for (shockingly) not serving brown rice.", "author": "Heather F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-26", "description": "I thought this place was OK. The menu is very small and so is the place. I did like the Mongolian Beef. I will go back and try it again, as I live close by.  Staff was friendly and service was pretty fast.", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-03", "description": "I don't like Chinese food but the food was good. It feels like clean oil.. Hate finding parking here.", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-28", "description": "Friendly, fast, and cheap.  We stopped in on a Tuesday at 7:00 and were able to get a table right away.  The waitress was very friendly.  We shared a pot of tea, a vegetarian salad, and a the hot and sour soup.  The food came out very quickly and the helpings were huge!  The food was great, not exactly traditional, but light and delicious.  Our bill was just over $20.  They brought us fortune cookies with our bill.  They had both normal and chocolate.  The waitress was happy to give us each one of both.  I wouldn't go out of my way to come here, but if I'm in the area and have a taste for Chinese, I would definitely stop back through.", "author": "Zoe H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-01-31", "description": "I'm somewhat bias in that my friend Jason is the cousin of the founder, Gary, but we had an awesome experience. Best contemporary Chinese in SF. It's extremely popular, so book in advance.", "author": "Bob G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "I am no expert on Chinese food, but I do know that compared to a lot of places, this spot is better than most. A lot of casual Chinese restaurants seem to over oil their dishes, ending up with greasy meat and soggy vegetables. The dishes at Dragon Well were sauced just right. We started with the pork pot stickers, so delicious. Seriously, the shell was crispy on the bottom, with a nice chew on top and the pork was yummy. We shared two entrees - Kung Pao Chicken and the Eggplant. The chicken was very good, although a little heavy on the peanuts. The Eggplant was fantastic in a spicy barbeque like sauce, cooked just soft enough, which tends to be tough for a lot of restaurants. The service was on point, gave us great recommendations, quick to take our order and quick to fill our drinks. Would go here again for a quick bite in the Marina.", "author": "Angela R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-29", "description": "Clean, fresh, US-style Chinese. Good prices. Great for a Marina lunch with the family.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-04", "description": "Had lunch here today...it wasn't bad, but a little starchy for my taste. My coworker ate the weird fruit out of my iced tea. I hope she doesn't die.", "author": "Scott W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-23", "description": "Decent chinese food in the marina.  Things usually taste pretty fresh, and the place is always packed, so they are doing something right.  Nothing to write home about, but relatively cheap prices make it a good impulse restaurant (if there isn't already a big line).", "author": "Robert R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-29", "description": "The food here isn't bad it just isn't that good. The hot and sour soup was initially served too cold, and was bland, and it has tomatoes in it which is a bit odd. The pot stickers were tasty, but $7 is a bit high and they come four in an order, I think every Chinese restaurant I have ever been to serves orders of six. The lettuce cups were probably the best dish we ordered. The service, like the food, was not bad nor remarkable. With all the wonderful Chinese restaurants in San Francisco, this place can be overlooked.", "author": "Jonathan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-21", "description": "What used to be one of our favorite Chinese restaurants is now our least favorite. IF I COULD GIVE ZERO STARS, I WOULD. And now, the review:\nWe discovered about a year or so ago that the dishes were beginning to just not be as flavorful and good as before and the restaurant was going downhill. Tonight we thought we'd give it another try. \nWe ordered two items: WonTon Noodle soup, to warm us up from the cold weather outside, and beef chow mein with extra bean sprouts. It was early (about 5:30pm) and a slow night as only about 5 tables had customers. We waited about 10-15 minutes. Waitress set  the small soup bowls on the table edge and put two dishes in front of us.  Finally, food is delivered by a different waitress......the chow mein with the extra bean sprouts - fine, BUT, we would of thought the soup would be served first, right? I mentioned this to the waitress and she says \"Oh, you don't want both items brought at the same time?\"I said well at every Chinese restaurant I've eaten at, the soup is usually served and eaten first\" - she said, oh, no problem, I'll take the chow mein back and we'll make you a new batch one later. I said well, okay maybe they can keep it warm sonewhere in the kitchen. The soup was appar;ently not made because \n15 - 20 more minutes go by - and no soup. (which at this point I am thinking they never made it for us in the first place) - and other's who arrive after us get served soup and food.  Finally, the little nice water lady comes and brings the soup. I did say to her in a comical way \"oh, I thought maybe they had to go to Hong Kong to make the soup\" - she said she was sorry it took so long, and I said to her \"well, it's not your fault,  it's okay\".  The soup wasn't put into the small bowls for us, and I thought that kind of unusual for an upscale restaurant. So we serve ourselves. In the middle of eating the soup (which by the way has way too many long noodles in it and not enough other ingredients) the original waitress brings another bowl of chow mein even though we still have of a big bowl of soup to finish - I look at the chowmein and can see it barely has any bean sprouts and I ask her if they put the extra bean sprouts in it....she says\n \"I DOUBT IT\" (weird remark) - I also mentioned that we had a way to go on our soup yet and we thought we would get the chow mein after we finished the soup so it wouldn't get cold before we got to it.. She says, oh, I can have them make another batch for you. I say \"no, just leave the chow mein here, bring me a bowl to cover it to keep it warm and questioned to her what's going on in the kitchen - no answer, no apology  and I am sure  she knew we were justifiably frustrated but she never apologized or acted embarrassed about the weird service we got. The chow mein, by the way, had about two slices of yellow onion in it, and 5 bean sprouts, 5 small pieces of green onion and the beef - and the noodles were very greasy and overloaded with oil.  We wanted to get out of there, and hell if I was going to leave a tip. We got the bill, and I did notice that we were not charged for the chow mein and I brought that to the waitresses attention because if it was an error, I wanted to be honest about it. She says \"oh, it's on the house\". We paid the bill and left thinking we would never go back again. That was it.  No tip was left, but I did leave the fortune from our fortune cookie which appropriately said: \"it would be wise if you make efforts to  broaden your horizon\" - I know this review is very long and probably boring, but I had to document our experience.  I plan on calling and speaking to the owner.\nIt's a shame to see such a decent restaurant have problems with help and perhaps the cooks, and the food served is just not up to par anymore. I wonder if perhaps they have changed owners.", "author": "Girly Foodie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-15", "description": "Years of taking the Dirty 30 bus down Stockton street has made be averse to eating any chinese food unless it comes from Dragon Well. Everything here tastes healthy and fresh and isn't laded in oil or mysterious fuchsia pink sauce. The steamed bass is incredible. I love kids and babies but I would recommend avoiding eating there early in the evening as it always seems to be filled with strollers.", "author": "Joslyn D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-22", "description": "A clean chinese restaurant that is less oily and more flavorful than what you find on Stockton St. \n\nExcellent menu items: pork postickers, curry noodles, walnut shrimp.\n\nThe best place for a quick meal on Chestnut St.\n\nPS- the fortune cookies are always stale. So control your expectations.", "author": "jason e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-26", "description": "This place can be hit or miss (espcially when you get take out during their busiest times) however when they make things correctly, their food is amazing. The Walnut prawns and Mongolian beef are my favorites. In addition, the meals are very reasonably priced. They also have great lunch specials, although you may have to keep some gum with you if you have to talk to customers or clients afterwards. The food can make your breath a little stinky.", "author": "John L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-10", "description": "Used to love this place, unfortunately this restaurant has gone downhill.  The food is very inconsistent.  soy sauce and red pepper sauce overpower every dish.", "author": "T G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-31", "description": "Chinese food that you don't have to say \"is that Chicken?!\"  Delicious, fresh, no gross parts, ..and they have chocolate chinese cookies.  This is one of my favorite Chinese/Asian food places in the city.", "author": "Dena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "This my favorite Chinese place. It is very clean, super great service, friendly and the food is awesome!  Oh and they have fountain diet coke!!!  Everything we have had has been really good, but I always get the wonton soup.  It's the best here!  We usually get the big bowl and split it.  My other favorite is the Mongolian beef. The place is super cute and relaxing. This is not your hole in the wall Chinese place, but still reasonably priced.", "author": "Leslie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-01", "description": "Dragon Well is a solid Chinese restaurant, while the front wait staff is all American - the back staff cooking your dinner is actually Chinese.  So, the food is decent, the prices are average - and the staff is pretty nice.  They get really busy, so I suggest a reservation on weekends and Friday nights.  They get lots of kids and parents around 6-7 PM, and the place has no noise dampening - so this is not a romantic, quiet conversation place.  But, their steamed fish is pretty tasty and the Won Ton soup is pretty yummy too.", "author": "Audra E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-22", "description": "Chinese restaurant meets Ikea.  Definitely a whitewashed menu, although I'm sure they'd rather characterize it as \"fusion.\"  Pretty good food though, with big portions and decent service.  Wine list is interesting...they've got more half bottles than full bottles, which I'd never seen before, so it's a good place for two people to get a quick bite and a glass of wine.  But I'd rather go to Eliza's.", "author": "Geoff K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-09", "description": "This is the best Chinese I've had in all of San Francisco!\n\nWok Tossed Prawns and Black Bean Chicken are my favorite.", "author": "Seth H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "There is a reason Dragon Wells number is in my phone. I primarily take out for sole reason of convenience, but I have dined in many of times and enjoyed this fine restaurant the same either way. When dining in I almost hope they are a 20-30 minute wait just so I can go next door to the Marina Lounge and have an ice cold beer and relax much the way you would if the restaurant had a bar area for their patrons, Marina Lounge provides this service. The Hostess will come get you at Marina Lounge when your table is ready which is awesome. Once your seated the food on the menu is all great, but I am very happy ordering the same amazing items every time, Wok Tossed Prawns, Chicken Chow Fun, Sweet Savory Beef,  a large order of steamed rice, and Tsingtaos all around to wash it down. Enjoy!", "author": "Michael G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-04", "description": "I use to be a fan of Dragonwell, particularly the wok-tossed prawns and the Hong Kong Style pan-fried noodles, a few years ago. I  was a regular, getting take out at least once a month. Recently, I've noticed a huge decline in the quality of their food- portion sizes are inconsistent and the food is costly for what you get. The menu is always the same and there are never any specials. There are plenty of good enough Chinese places throughout the City (Eliza's, Firecacker, R&G Lounge) to get your fix, so don't settle for plain, mediocre and expensive. And yes, the fortune cookies are indeed always stale.\n\n1/2007 UPDATE---\nI got the curry noodles, pea sprots and veggie pot stickers to go. The pea sprouts was a garlicky delight! The curry noodles wasn't bad and for a change the fortune cookies weren't stale. I upgraded this place to three stars.", "author": "Mama L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-29", "description": "I went to Dragon Well last night for the first time and it was pretty good. The food there felt healthy and not greasy which is always a plus when you're talking about Chinese food. We got the potstickers (2 thumbs up), dragon beef (pretty spicy and i ate a chili accidentially!) and the stir-fried chicken and vegetables (my favorite dish of the night!). It was a Wednesday and we had to wait about 20 mins to get seated. Once you walk in, the smell of the food gets you right away... I want to go again!", "author": "Julie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "One of the best tasting Chinese restaurants I have ever eaten in.  I hesitate to call it just a Chinese restaurant because everything on the menu tastes so fresh and unsaturated with oil.  Everything I have ever had here is great and the waitstaff is knowledgeable and friendly.  I highly recommend this place to anyone looking to grab a bite in the Marina.  It is hard to get a table on busy nights though, but luckily there is a bar next door that you can have a few drinks while you wait.", "author": "Eli Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-14", "description": "The food is really fresh and MSG free. Fresh seasonal vegetables make it a great place to eat. PLUS they have chocolate fortune cookies.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-10", "description": "I have never been disappointed with anything at this restaurant. My girlfriend and I stumbled in there the first time after getting off a long flight and in our half awake state we enjoyed every bite.  Since then we have taken family/friends and everyone enjoys it.    \n\nVery friendly staff and the food is some of the best Chinese in the city.  Very appropriately priced as well.", "author": "Robert D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-09", "description": "This is one of my very favorite restaurants in the Marina. The food is great! Prices are very reasonable. Very simple and not greasy Chinese food. I love the beef & broccoli & walnut prawns. The owner is so attentive and nice. The waiters are very attentive, though usually very busy. This is always my go-to dinner with the BF when we don't feel like cooking.", "author": "Daisy May J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-11", "description": "I use to get takeout here at least twice a week ... until I became immune to the MSG. Everytime we eat this food now I think it does a number on our stomachs ... it's gone downhill. But, I will say that the vegeterian salad is well worth your time, crispy tofu and a nice light lemony dressing. The walnut prawns are great too, but no one in the marina would be caught dead eatting them since they are drenched in mayo. And beware of the fortune cookies ... the chocolate ones are usually stale and the plain ones never get you anything worth repeating (in bed).", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-23", "description": "dragon well is always great, i do lunches and they never let you down.\ntoday me and my wife shared green beans(lunch course) lemon grass chicken( a la carte) and we had the pork filled pot stickers with a side of rice.\n. it was plenty, delicious and fast", "author": "Giu G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-10", "description": "it helps that i know someone that works here. i always seem to magically get an \"extra\" dish whenever i drop on in.\nanyway, yes, taken into consideration that this is healthy (healthier), americanized chinese food... i still think it's good. i have no qualms about this place and everything i've ever gotten has been really tasty. it's a little pricier than i'm used to, but the quality of meat and ingredients makes up for that. \nthe hong kong noodles are great, green beans are awesome, lemongrass chicken tasty, lettuce cups yummy, and fiery beef? dragonwell beef? whatever it is... spic-ay. \nservice is great... again helps that i know someone. \ni'd recommend this to people that are scared of hole in the wall divey chinese places.", "author": "Erin D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-03-25", "description": "The chocolate fortune cookies are a good idea but they are always stale.  I think Eliza's in Potrero Hill is better, and you don't have to put up with the Marina high-fivers.  But it is still good food and a nice dining room.  The walnut prawns are very good but my favorite is always the beef chow-fun.  There used to be a waiter here who was a much cuter version of James Van der Beek, but he may have moved on.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-12-13", "description": "Ehhh, I think the service made it ehhh.  We did more of an app sampler with spring rolls, potstickers and lettuce cups....and we ordered the hot and sour soup.  I guess from now on I will never assume that when ordering soup I should expect two bowls.  He came back  with one little bowl with one spoon.  He didn't get it when I asked for another spoon.  Maybe I needed to be more straightforward.  Besides the bowl of soup for 2, pretty good.  The lettuce cups were tasty, it would be nice though with more than 4 leafs of lettuce, last I checked iceberg is not a delicacy.", "author": "ERICA E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-22", "description": "I'm actually quite surprised with all the four and five star ratings.  The food here is decent, but nothing to rave about. It's your basic hole in the wall style food with the exception that it's in a contemporary atmosphere.   I've had WAY better chinese food.  I suppose it's popular because it caters to non-chinese with what they think chinese food and ambiance should be.  Save your time and money and get a to go order at your local hole in wall chinese restaurant.  Bust out with your fancy smanshy plates...pour onto plates...and wha la...", "author": "hello k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-01-05", "description": "Boring blah blah blah.  Yes...it's light and non-greasy, but it also lacks flavor and the restaurant has no character.  This place always seems like a good idea, and them I'm under whelmed.  I mean...it's not terrible, but I'd probably rather eat at home.", "author": "Meghan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-27", "description": "This is the place I go for Chinese Food in the city. I live in Cole Valley and have no qualms about driving and finding parking in the Marina if it means lunch or dinner at Dragon Well. The only thing I do not recommend is the lemongrass chicken. I've converted all my friends who swore by other places. Now they swear by Dragon Well. Plus the staff is very friendly.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-07", "description": "We're regulars at Dragon Well because it has pretty good Chinese food at reasonable prices. The staff is always nice and helpful, and the place is very family-friendly. The wonton noodle soup is always tasty (though they changed the noodles some time ago - I prefer the previous thicker noodles ...), as are the eggplant, green beans, chicken chow mein and crystal prawns. The only disappointing dish is the kung pao chicken - I stay away from that one now. We'll keep going!", "author": "Mina M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-05-13", "description": "The sour look on the hostess' face as she informed us of our 20 minute wait was almost bad enough to deter me from waiting. It only got worse as she told us a table was ready and then brushed us aside saying that it was a reserved table. From that point we waited another 20 minutes at which time she had the nerve to seat us at a corner table next to the kitchen. Well, nobody puts Baby in the corner! And our server, Keith, knew that. He turned our experience around and showed us why people keep going back to Dragon Well.", "author": "Aida M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-17", "description": "I like this place for its potsticker, lettuce cups, string beans and their chocolate fortune cookies. It is a great spot for casual or group dinner. Staff has always been friendly and service is fairly fast.", "author": "Jana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-28", "description": "8 years later my relationship with Dragon Well is going strong.  It's the best Chinese food in Marina/Pac Heights.  Get the Chicken Chow Mein and Walnut or Wok tossed Prawns.  Don't skip pot stickers", "author": "Kari P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-19", "description": "There is only one thing I order in Dragon Well and that is the Sichuan Green Bean dish, which is a large order that makes me go \"Money well spent, mmmm\". I then always rub my tummy and head over to buy a ginger cookie from the Marina Supermarket.", "author": "Base M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-03-31", "description": "Downhill alert...had a decent lunch at Dragon Well this week marred by pretty spotty service.  Our waiter just didn't have it together, forgetting to bring bowls for our split soup, our beverages, etc.  Food was good but pretty pricey for what we got.", "author": "phil h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-17", "description": "They have some AWESOME asian food for a place out in the Marina.  I mean its chestnut so you can assume most of the places here are going to be on the snooty end of things but the food stayed true to its origins.  then again i saw guys rolling up in Bentley's and what not.  NOT my kinda crowd but a friend wanted to eat in the area and that was that.  Very chic ambiance and good rice which is essential to every asian person!", "author": "Harry H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-25", "description": "Moderately good.  Just like 50 other restaurants in the City.  Nothing made me say \"wow\" but it was all more than edible.  Damning with faint praise, I guess.  Although, they did have the freshest, tastiest fortune cookies I have ever had.  It was a great stop for a pre-movie bite.  And I was there with my particular pescetarian friend.  He was more than happy. so that was good enough for me.  Actually, that's it.  The restaurant is \"good enough.\"", "author": "darla s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-21", "description": "Light tasty Chinese food.  I love their crispy tofu salad and pot stickers.  A perfect place to eat before catching a movie at the Presidio theatre just down the street.", "author": "shoba d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-13", "description": "I have no complaints, but the food wasn't particularly memorable, either.  My impression from multiple visits:  Clean, Courteous Service,  Healthy Food, Fresh ingredients. Oh and the food was rather inexpensive compared to other Marina locales. Yet, where is the wow factor?", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-29", "description": "More like 3.5 stars but bumped up for good service and great score from health dept. I don't eat Chinese food as frequently, but I used to do take out all the time from Feng Shui and then go to Dragon Well when I want something less oily. \n\nDragonwell Chinese food is more California Chinese than authentic. The prices are not cheap but the food is good. I try to go during less busy hours because I don't like to wait. I just had lunch there today (hadn't been there in over 6+ months) and we had the spring rolls ($5.50 - yummy veggie rolls but kinda oily), Wok Tossed Prawns($8.95, very good, only comes with steamed white rice no brown rice option), Hong Kong Crispy Noodles ($10.50 - good, I've had better but this does the trick for me), Lychee Tea ($2.50-  free refills on tea but not lychee, lychee flavor is most apparent at the beginning but disappears pretty quickly). I enjoyed my lunch and since we had the appetizer, my husband and I were unable to finish our Hong Kong noodles and took it home. Also, complementary fortune cookies are provided at the end, chocolate flavor available. Sometimes they are stale though, but not today.", "author": "Mellie D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-18", "description": "As several other Yelpers have pointed out, this is the type of Chinese restaurant that aspires for the P.F. Chang's crowd - those craving blandish Americanized food, tasteful decor, and above-average prices for less-than-stellar portions. On balance, not a bad place to go if you're in the mood, in the area, and trying to impress, but not a standard go-to spot in the least. I spent $10 on a lunch entree of steamed rice and 10 pieces of barely seasoned beef.", "author": "Cedrick A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-28", "description": "There's something missing from this place.  It's decent chinese food but there's no zip!  no zing!  no badda bing!  You get my drift.  The meat dishes tend to be meat only...no veggies mixed in.  The standard side dish is plain white rice.  I found myself bored with my entre after chewing for about 10 minutes.  The style was supposed to be ultramodern Chinese, but the decor just kind of felt stark and lifeless and the light colored walls combined with the black and white photos for some reason reminded me of being in a hospital.  My dish was decent but I probably won't go back again.", "author": "LaSha G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-31", "description": "My favorite stand-by Chinese... The wait is long during the weekend dinner rush, so I tend to opt for take-out, which is quick (the food holds up pretty good too).  Service is friendly and attentive--and you get a choice of vanilla or chocolate fortunes!  (I get both)  The lunch specials are awesome.  I wish they offered dessert, but Santa Barbara Ice Creamery is nearby.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-26", "description": "this is one of the few chinese restaurants where you actually feel healthy after you leave.\nthey only have white rice, which i dont' like - but other than that the place is fantastic\nthey also have chocolate fortune cookied, i usually eat about 5", "author": "Scott K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-21", "description": "With all of the fantastic asian cuisine in this city I see no reason to visitt this establishment.  With a limited menue you'd expect them to do their few dishes really well and they don't.  I've been here twice and both times felt the food was greasy, poorly seasoned, and didn't taste fresh.  Add in the unusually high prices for Chinese food (9+ for most dishes), only serving white rice, and making you pay for tea and I can not understand how Dragon Well stays in business, let alone why they are usuallybusy.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-28", "description": "I used to like this place when it first opened, but I think it's gone downhill over the years. It's ok if you're looking for something fast and different, but otherwise it's no longer that great. It's a faux Chinese/American/whatever cuisine, but if you're looking for authentic Chinese, this ain't it. For that you want to head over to Clement Street.", "author": "Gregg G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-04-07", "description": "I like the potstickers and hot and sour soup but in general I think the food selection is weak and  it's tooooooooo loud. The waitstaff is good.", "author": "Roxane S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-27", "description": "This is a good quality chinese restaurant, everything works, but nothing is exceptional.  Everyhting is fresh, and if there is a complaint- the interior is lacking something.", "author": "Max C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-08-20", "description": "If you are looking for non-authentic california-y chinese I would send you to P.F. Changs. . .  this place just doesn't cut it.  If you are looking for a great neighborhood chinese food place, you will be VERY dissapointed.  I see what they are trying to do by making everything healthy and light, but it doesn't quite work.  Wine that I had wasn't very good, which was not reflected in the price.  I gave it stars for the vegetable potstickers and the string beans.  Atmosphere was virtually non-exsistant.  The food wasn't awful by any means, I would eat there again if somebody else REALLY REALLY wanted to, but I don't think I will ever choose to eat there again on my own.", "author": "Jennie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-12", "description": "This is a good stand-by if you happen to be in the marina.  I like getting take out from this place and taking it to a friend's house.  Like most chinese food, it can get a little greasy at times.  I love the steamed fish (plain but healthy in a savory broth), the veggie potstickers and the chow mein, veggie style.  The eggplant dish is phenomenal...this gets 5 stars alone!", "author": "Tracy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-03", "description": "Great neighborhood Chinese restaurant without most of the greasy dishes:  good food w/fresh ingredients (won ton soup w/fresh spinach and mushrooms) and friendly service.  I do takout 90% of the time but i'm sure it's just as good if you're dining in.  The stir friend salmon, hong kong noodles, and curry me fun are also great menu items to try.", "author": "Simon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-21", "description": "My significant other and I went with my parents went to Dragon Well in the Marina last night for dinner. I had been there before and I was happy to have another great meal on this visit.The food was fantastic! If you try anything, try the Tea Smoked Duck appetizer!!! Great service too.", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-11", "description": "I'm chinese so i've eaten at a lot of chinese restaurants in my day and my opinion is that you can find better places for chinese that are way less expensive and just as good. But if you live in the marina area you probably don't know any better.", "author": "Jen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-03", "description": "For american-chinese cheap eats it's great. The honey-walnut prawns are like candy, you have to try them! Service was good, you're in, you eat, you're out. Basic modern decor, convenient if you are prepping for shopping or a night out in the Marina.", "author": "Mel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "A little pricey for lunch, but solid performances every time I eat here. Great salt and pepper calamari. And I had them make something up because I couldn't decide- garlic eggplant and mongolian beef - together at last. It was piquant with chili sauce I added for some zeal. I am a fan.", "author": "Sean Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-07", "description": "Second time I go there, and second time the food is not great. This is not a Chinese restaurant. It is a place serving some kind of pretending to be Chinese dishes, completely de-Orientalized.\n\nThe tastes are ok, but the place is one of the coldest I have ever been to in terms of atmosphere and it feels like a miserable cantine, and even some Mac Donalds places would feel more intimate.", "author": "Cedrick C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-23", "description": "I have lived in San Francisco for over ten years and I crave good Chinese food. Every few months I give in and order Dragon Well. Now I don't mind paying a decent amount for anything but the food is so bland.  I could only hope for half the flavor of PF Chang's which is a sad thing to hope for in a city where there should be fantastic Chinese cuisine.", "author": "J D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-20", "description": "I love Dragon Well and how it is such a nice cosy gem in the marina.  The food is excellent, service attentive, and prices reasonable.  It has been a little over 12 1/2 years since I last dined here and things have not changed.  Back then, I ordered pot stickers, steamed Hawaiian butter fish, and steamed rice; all excellent.  Fastforward to last night, I ordered pork pot stickers, egg rolls, and dragon beef.  The pot stickers are wonderful; crispy golden and not doughy with a perfect ground pork, cabbage, and ginger filling; I love the soy sauce that comes with it as it has more of a soy and wine taste with scallions.  The egg rolls are crispy and greasless with a medley of vegetables and silver noodles; perfect with the well balanced sweet and sour sauce or hot yet not too hot or overpowering mustard sauce.  The dragon beef is superb with julienned slices of beef, broccoli, five spice tofu, and green and red peppers in a spicy sauce; the chili peppers are As thin that you do eat them as they are Incorporated and don't make your mouth feel like a Hawaiian volcano.  Our waiter gave us both regular and chocolate fortune cookies; both fresh, the chocolate one having just the right amount of flavor and not too sweet.  Round it off with a Tiger Beer and you will not be disappointed.  So, for excellent Chinese cuisine at reasonable prices in a casual atmosphere, Dragon Well cannot be beat.  Keep up the good work guys.!", "author": "Brian S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-19", "description": "Great casual spot in the Marina for semi-healthy (i.e., not grease laden) tasty Chinese food.  Service is great, prices are moderate and the won ton soup is something to write home about.  Also really enjoyed the Hong Kong noodles.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-22", "description": "Do I sense some P. F. Chang envy?  Dragon Well is so similar, but a bit inferior.  Food needs to be served hot, people.  And no, I am not a suburbanite.", "author": "MScott S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-20", "description": "Yes the food is light and prepared in a clean kitchen (I looked), but there is something unsatisfying about this place. However, I by far prefer this over Eiza's or Eric's where all the dishes taste exactly the same. I would recommend it to people who don't really like Chinese food, and want risk free food off a menu devoid of many traditional Chinese food options.", "author": "vivien c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-03", "description": "The duck appetizer was very good, and the food is definitely quality,  but I'm not crazy about the selection. Also, the restaurant is very uncomfortable, loud, and crammed.", "author": "Cary Elizabeth L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-22", "description": "I have been back to Dragon Well a few times since I originally wrote the review below  and I'm still a fan!  They have brown rice now too.\n\n\nDragon Well is a great spot for a tasty low key meal and I will continue to go back. My favorites are the Mongolian beef and the green beans, but I wish they would add brown rice to their menu. The servings are large, reasonably priced, and great for sharing. Dragon Well works well for large parties and the service is prompt.", "author": "Katherine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-29", "description": "So being that I am always on chesnut, on the go, I'm always done for fast and really yummy food! Dragon well(if you ask my co-workers) is MY LIFE! I love the food so much....Like I can't even explain! From the delicious mongolian beef(which I always ask for extra spicy and they ALWAYS do it, THANKS :D ) to the tasty chicken chow mein...PURE BLISS! A MAJOR plus, they are always super fast to get me and out, with the best service on the street! Kudos for Dragon Well, you are my chinese food addiction!\n\nSide Note: I have also eaten their inside and it was equally enjoyable, always get this nice blonde who always keeps my diet coke full before I devor my mongolian beef hahaha!", "author": "Alex F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-13", "description": "Another search for food in an unfamiliar 'hood - another long drawn out discussion with the husband.  I mean really, Urbanspoon and Yelp only get us so far when we're under the gun (i.e. when we have our hungry, sleep-deprived kids in tow).  \nWe came across Dragon Well and I poked my head in.  It's kind of a long and narrow space, and I did notice that were other families with younger children, but I wasn't sure if we should drag our double stroller inside.  The hostess, who also turned out to be our server, was kind enough to offer to store it in the back and we were good to go.  \nPotstickers, chicken chow mein, black bean chicken, and Mongolian beef - all excellent!  I expected the the black bean chicken to be quite spicy, but it was mild compared to the Mongolian beef.  We even had enough left over to bring back to my parents at the hotel, and they loved it as well.  All in all, great place.", "author": "L T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "I love this place!  The food is great and not greasy like some Chinese food.  The prices are good for the portions.  Good to eat in or take out.", "author": "Anna O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-11-16", "description": "Everyone raved about this place so I was really excited to try it.  I ordered a lot of different things, and the only item that I was impressed with was the green bean dish.  And even then, Betelnut is far superior.  I will still try the walnut prawns based on their review, but I would go elsewhere if you are craving good chinese.", "author": "Liz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-15", "description": "Very decent Chinese food.  Tastes pretty much like the real thing (according to my b/f who is 1/2 Chinese) but not sure if it is MSG free??Their Vegetarian dumplings are delicious (you get 4-5 large dumplings).  Their hot & sour soup was a little too sour for my taste.  The Beef Chow Fun was really tasty and we got a ton of food even though it was take-out. They use very fresh ingredients.", "author": "Jaki B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-13", "description": "Tiny space. Really loud. But worth it. The ingredients are fresh. The food is delicious. We get the takeout most of the time, and I highly recommend this place. Some of the reviews here complain about the food not being \"authentically chinese\", but  I'm not sure if that's important, even it were true.  It still tastes good.", "author": "Patsy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-11", "description": "Great Chinese food.  Always healthy and fresh tasting.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-11", "description": "You San Franciscans are spoiled and picky.  I have been eating at the Dragon Well ever since I lived near there 10 years ago. I make a special trip whenever I go the city.  The food is fresh, delicious, and served with friendliness in an unassuming atmosphere.  Maybe to a local who eats out often and prefers the more authentic Chinese, it might not be ideal, but those who just want yummy while visiting the Marina, I highly recommend.", "author": "Rachael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-01", "description": "Good stuff.  Definitely would come back the Chestnut if i'm feeling the urge for some Chinese with friends.", "author": "Nagoo N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-16", "description": "Nice upgrade to the traditional Chinese hot spot. Good stuff.", "author": "JA R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-30", "description": "I enjoyed Dragon Well - Chinese food you'll find at most palces without the grease!  Order the walnut prawns - they're truly a treat! The kung pao chicken was good, but nothing too special.  The restaurant's simple decor reflects the mixed crowd, from families and friends, to couples, and wasn't crowded for a weeknight dinner.  But $4 for a luke-warm bottle of Tsing Tao beer? C'mon!", "author": "Scott G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-07", "description": "food is fine. decent even. Its not overly greasy or anything. What it is however, is expensive for run of the mill Chinese. Do you want to pay $8.50 for Chinese greens (i.e. spinach) sauteed with garlic or $10.00 for a small Mongolian Beef? If so, this place is for you....", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-07", "description": "food is yummy, staff is nice. cant really complain but its not a place i crave, more down for the take-out over eating out. \nwish they did delivery!", "author": "Britt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-02", "description": "not sure why i never went here until recently but it is REALLY good. much better than country sky.  like 10x better. the staff could not be nicer and i've never had to wait!", "author": "Ashley D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-11", "description": "I love this place, the food is inexpensive but well put together and of high quality.  The atmosphere is clean and peaceful. The staff is friendly and efficient. The jasmine tea is good, and the vegetarian sadad with crispy tofu is my favorite item on the menu.  The only thing that has ever bothered me is that it seems like no matter how far you sit from the door, you can still catch a cold. Doesn't matter, I will keep coming back any time I have a craving for salad or vegetarian potstickers. Enjoy, but bring a sweater!", "author": "Janet H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-22", "description": "Gave Dragon Well a second chance. Called in the order based on the menu on the Internet. Showed up, and yep,  they still charge 15% more than the prices on the internet when you show up at the store to pick up your food.\n\nThe hostess explained what I had heard half a year ago: They have updated their menu, except at the internet. I explained I thought I should pay the price on their internet site I ordered from and that it is wrong to advertise one price and charge another. \n\nBut no, that was not possible. Luckily the manager came by and overheard the conversation. She offered to take 25% off which was more than I asked for. I just wanted to pay the advertised price.", "author": "Peter J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-31", "description": "Great place. I am a huge fan of asian food, my wife... not so much. We can always agree on dragon well. The seafood dishes are excellent. We had a steamed butterfish which was out of this world. The veggie potstickers are little packets of delicious, they make my day better no matter what. Also I know it is usually an afterthought but the fortune cookies are also excellent.", "author": "Seth H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-17", "description": "If there was a choice for NO STAR, I would pick that.  Be prepared to go there with a full stomach and be starving by the time your food comes.  Food is tasteless, overpriced  and definitely NOT WORTH THE WAIT...waited an hour before my first entree came and spent my precious time there being bored out of my mind.  Thought it would be a good experience but turned out to be a complete disaster.  Never going to come back to this place ever again!!  Not recommended for anyone looking for a good place to dine.", "author": "Danny z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-19", "description": "I grew up in the San Gabriel Valley, the mecca for Chinese restaurants...but I must admit that for semi-fako Chinese cuisine, this is pretty good!  (Semi-fako because most of their staff isn't Asian and the menu is in English.)\nI've only eaten for lunch and mainly take-out, but it hits the spot when you don't want to brave a hole in the wall in Chinatown.  \nMy recommendations - hot and sour soup, lettuce cups, pot stickers, and chicken chow mein...all perfect for sharing.\nOverall, the food is decent but they get an extra star for cleanliness, which is lacking in many Chinese joints.\nThey lose one star for being overpriced, but hey, it's the Marina.  \n\nBy the way, I am Chinese, so I should know what I'm talking about here, right?!?", "author": "Jen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-19", "description": "Great California Chinese.  I'm a particular fan of the wok tossed prawns which are battered and fried and then sauteed in a sweet and sour sauce.", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-22", "description": "Outstanding!  I LOVE LOVE this place.  The atmosphere is great, simple and clean with beautiful photos of Chinese streets scenes on the walls.  The food is fresh and simple.  The sauteed pea sprouts with garlic and the fried squid are awesome.  Must order each time I go!  A reason to go to the Marina and wade your way through all those Marina chicks and dudes! And save room for the chocolate fortune cookies! Confucious says, \"Yo, check out Dragon Well!", "author": "Mia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-05", "description": "I love this place and have been a regular for about 5 years.\nThe wonton soup - big bowl - is the best I've ever had.\n1/2008 Aw - the quality has plummeted at Dragon Well.  I believe it is because the nice on site manager seems to be gone?", "author": "K O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-12", "description": "I agree with the slight blandness opinion from other reviews, but the food is still really enjoyable. What brings up the level is the freshness of the ingredients, it just seems healthier for you than more traditional chinese. Service and vibe are friendly and great.", "author": "Emmy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-13", "description": "I've enjoyed this lunch or dinner spot with previously good mongolian beef and attentive service.  That changed tonight with a wonderfully greasy mess of onions and beef.  When I mentioned to the waiter that it was too greasy for us to finish and we didn't want to take it home he laughed and agreed with a knowing response that it seemed normal.  Manager was nice and attentive.  May try again in a few months if starving myself on the grapefruit diet and need some grease to fill the void.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "The sweet and savory beef and the walnut prawns are the best!  And I almost never have to wait for a table here, which is priceless in the Marina.", "author": "Shondra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-04-30", "description": "A great \"Chinese\" restaurant with great ingredients, low fat, no MSG, etc, excellent service, prices moderate, especially for the quality of the food.  Try the the Won Ton or Hot & Sour soups!!!!", "author": "Carolyn M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-14", "description": "Update: The manager is concerned about my experience and invited me back to Dragon Well.  I have to decline, but am glad that he is concerned about his customers.  \n\nI used to love this place, but after my last visit, my opinion has drastically changed.  My bf and I ordered two dishes.  One dish was forgotten and when we asked the waitress about it, she was extremely rude and made up some excuse about the kitchen being busy.  Lets just say the place wasn't packed. \nAfter about 30 minutes we told her to forget the 2nd dish.  Meanwhile the 1st dish tasted horrible.  When we told her that, she was rude again.  When you ask for your check at this place they usually bring over a big thing of fortune cookies for you to pick out of.  Well, she brought them over, then pulled them away before we could pick out a cookie!  We'll never go back again.", "author": "Lenore B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-22", "description": "crap-a-doo\n\nif you live in the marina you will probably love this place, say no more.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-21", "description": "I find the food at Dragon Well to be delicious and flavorful.  The wok-tossed prawns are very good.", "author": "Roxanne M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-17", "description": "Dragon Well is a small, clean chinese restaurant.  Their menu is pretty basic but everything is very good.  Not super greasy like a lot of Chinese places and not overly expensive.", "author": "Kate K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-04-01", "description": "favorite chinese restaurants are like opinions: everyone's got one. while the decor feels like potterybarn does china, the food is anything but mass market. light in weight and full of flavor i can never pass on the walnut prawns or the duck with plum sauce. great teas, beers, and the only place i know with a big drum of chocolate fortune cookies in the corner. for my money, it's the best around - not to mention the only place worth braving the marina for.", "author": "Kristina P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-31", "description": "I feel like I can never trust the restaurants in the Marina because they can be so gimmicky and lame. In a moment of hunger and desperation, though, one can't be picky. We popped into Dragon Well after a long urban hike from Nob Hill to the Marina. We ordered chicken lettuce wraps and peking duck for starters - both were tasty. For the entree, I had the beef and tomato dish, which was surprisingly very delicious. It had a perfectly balanced sauce and tender pieces of beef. Nate C. ordered beef chow fun and they made the common mistake that most American Chinese restaurants do - soy sauce soy sauce soy sauce. I don't know why restaurants feel they can skimp out on making a good sauce and just drench the noodles in soy. Gross. Overall, while my dish was amazing, I'm not running to my friends telling them this is a must-try. If I find myself on Chestnut with hunger pains again, I would probably say \"Oh hey, there's this Chinese restaurant we could eat at.\"", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-10", "description": "Fun place to grab dinner; also good for take-out.  My favorite is the Hong Kong noodles - they give you a lot of fresh vegetables, beef, chicken, and shrimp.  I don't go here for authentic Chinese, I go here for clean healthy Chinese food.  Sometimes the noodles can be too salty, but it's the Marina -- go ahead and ask for low-sodium soy sauce.", "author": "Carole C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-14", "description": "Solid, semi-healthy Chinese Food.  Fresh ingredients, no MSG.  Good for take out.  I order the Kung Pao chicken with \"white-meat\" only.  It's a little bit extra but worth it.", "author": "Julie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-10", "description": "yes, it's chinese for non-chinese. yes, their menu doesn't have a number system. yes, it's in the marina. well, i still love their food and service. as a matter of fact, i haul my ass across town on a regular basis just to dine here. over the years, i also got to know the owner and some of the staff. they are genuinely friendly people. the food is fresh, healthy, flavorful and quite delectable. my personal favorites are hot & sour soup, pot stickers and dragon beef. listen, it may not be traditional chinese, but i'll take dragon well over any chinese in the city even if it means i have to drive 20-25 min from mission to marina. traffic be damned.", "author": "frisco j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-22", "description": "I love this place!  The Kung Pao chicken and varying beef dishes are never a miss . . . and I don't feel like I need to go to bed immediately after eating their Chinese food. They also have an incredibly high Dept. of Health rating - - which is huge for me.", "author": "Laura C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-05", "description": "For whatever reason we always seem to end up here between meal periods, between lunch and dinner, which means we tend to get the place to ourselves. Perhaps that's one of the reasons we love it so much - great food, great service, and never a crowd!", "author": "olivia h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-09", "description": "My absolute favorite chinese place in the Bay Area.  I regularly drive into the city for the food.  Pot stickers are fantastic and the wok tossed prawns cannot be beat.  I love their soy sauce, I want it bottled.  There are many meals that excel here, try some of the different meals vs staple items.  Cost is completely reasonable.  The food is very fresh and well prepared.  Sometimes the service can be a bit rough, but the owners are phenomenal people and it's a warm environment.", "author": "pak l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-20", "description": "Light, non-greasy Chinese food from a restaurant is an anomaly to most Chinese-Americans, and we usually dismiss these types of places as invariably having bad-tasting food, or food that's so far from authentic, it might as well not be Chinese food.  This place, however, seems to pull it off, at least for those of us willing to sometimes have a more Californian perspective on Chinese food.  The subtle flavor of the Chinese Chicken Salad (which is one of the few dishes that comes in a large portion) creeps up on you and gets better with every bite.  The hot and sour soup was absolutely perfect for those of us with a taste for lots of white pepper - we first thought there was a mistake and the chef had accidentally added too much (to our delight).  When we came back and tried it again, there was slightly less white pepper, but still enough to make us believe the first time was not a mistake.  Minced Chicken Lettuce Cups is another tasty favorite.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-15", "description": "my pervey old boss took me here and looked at my boobs the whole meal. marina women cackled in my ear with thier strollers and talking about playgroup. the waitress had more attitude than any drag queen i know. but the food was pretty slamming. i avoid the marina at almsot all costs but if i were forced there once again, i would eat here. clean, pretty space and good food.", "author": "kelly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-18", "description": "one star off for bad signage (even though i've been there a ton i always walk by it) and one star off for being in the marina.\n\nother than that, yum.  they're great at making dishes into vegetarian alternatives, i.e. kung pao tofu.  super tasty.  one negative is once our dog got into my boyfriend's chicken, which was spicy, and that led to a vomitocious puppy.  he's ok.\n\ngood fortune cookies, even when they're stale.", "author": "K H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-27", "description": "Their steamed hawaiian butterfish melts in your mouth! Cool decor, responsive service, and reasonable prices makes this place a winner!", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-13", "description": "Dragon Well has definitely gone downhill with time.  Not sure what it is but it has been bland the last couple of visits.  The only thing its worth going for anymore is the vegetarian pot stickers because I've never found those anywhere else.", "author": "B B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-22", "description": "Set in the bustling Marina scene on Chestnut, this place can get busy, so a reservation may be in order depending on when you go.  I had a date that was scheduled for here on a Thursday night, but I was coerced into drinking right after work with my boss and coworkers.  This put me 4 drinks in at the beginning of my date.  We arrived at Dragon Well and had a reservation, but didn't have to wait too long for our table.  It's been a while, but I think we ordered chow mein, kung pao chicken, and some sort of shrimp dish.  All of the dishes were very tasty.  I love Chinese food and this place is pretty darn good.  The Chinese food I usually get is from little ghetto Chinese places or those quick already made full of MSG places downtown, so it was nice to finally get restaurant style Chinese.  As the date went on I continued to drink some Pinot.  I don't know if it was because I was drunk or if it was because the food was good, but I'm going to say it was a combination of the both.  I look forward to being able to go again when I start the night off sober.  But this place is definitely worth a try!", "author": "Vanessa Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-20", "description": "i think this is chinese food for people who don't really like chinese food. or maybe chinese food for really white people who are scared of real chinese food? i can't decide. the only thing i thought wasn't half-bad was the hot and sour soup.", "author": "rachel p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-24", "description": "Four stars for the food and service. We had to wait a little longer for a table than we were originally quoted, so the hostess comp'd us an appetizer. In this city, its nice to see that some restaurants still care about the little things and put their egos aside. Food is delicious, consistent, and tastes more fresh and delicate than your traditional greasy spoon chinese food. Prices are reasonable as well, and the portions are generous. Best chinese food in the Marina by far.", "author": "Patrick G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-27", "description": "I have loved Dragon Well for years. Seriously I ate here once a week for a 2 month period. Maybe this is where I made a mistake as I know how good their food once was and now can see that it's just not there anymore. I ordered here 2x in the past 2 months getting food to go as I always have but it's really lost a bit of it's pizazz. The dishes were a bit bland, the veggies not as crisp, the sauce lacking something, not sure what. I wish they could get back to what they once were but in the meantime I'm going to have find a new favorite.", "author": "Cbr A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-06", "description": "I've sat down once and gotten food to go twice. Eating there is a bit loud but the service is really friendly and quick. Food to go always tastes a little funky so I wouldn't recommend it. Overall the food is okay. I wouldn't rant and rave about it. For a Chinese food place it is on the less salty side which is nice.", "author": "Mara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-22", "description": "I have always loved this place.  It is a staple in the neighborhood.  Their wonton soup is DEFINITELY worth ordering (even if you are not a soup person!).  Potstickers, Lettuce Cups with Chicken, Wok tossed prawns, and  Chicken with Vegetables are all fantastic.  It's light, healthy, reasonably priced, and had a really friendly staff.  They also have great iced tea.    Love it!", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-14", "description": "I dig this place. It's casual and mellow. The wait staff is always smiling. Most importantly, their hot & sour soup is grubbin' and their Mongolian beef is the best I've ever had.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-13", "description": "Better than betelnut...but not by much....too crowded and slightly overpriced for the food ... i'd much rather go somewhere with more authentic food for half the price...", "author": "Joy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-08", "description": "Great food, exceptional service, super fun. Loved my nights with my wife down there before we moved to Seattle. One of the few things I miss about San Fran! Although, time for a menu change guys!", "author": "Ads B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-07", "description": "Decent Americanized Chinese food with a healthy twist.  Great service.  Make reservations.", "author": "Jennifer A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-19", "description": "My favorite americanized chinese restaurant in the city!  I love everything on the menu, especially the wok tossed prawns and duck appetizer.   No dessert there though, which is a bummer.", "author": "LT B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-12", "description": "This place is a favorite for a quick, cheap eat if you are craving Wonton Soup. Their wonton noodle soup is full of veggies, chicken, shrimp and dumplings - and tastes delicious and fresh. Best part is that one order of $10 soup is plenty to fill up 2 people for dinner (and that includes a a hungry guy). It gets 3 stars because the other dishes can't compare to Jenny Lo's in Petaluma and Novato.", "author": "Katie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-20", "description": "i love this place.  it's all so delicious.  and they have chocolate fortune cookies!", "author": "jessie h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "Dragon Well is a surprisingly good Chinese restaurant. I mostly order their Kung Pao Chicken with XXXXXspice. Their beef chow fun, pot stickers, curry mi fun is also great. Staffs are decent. It can get pretty loud when big groups are there. One thing to note is that their white rice is a bit hard and I would recommend the managers/owners to start using white Jasmine rice from Thailand.", "author": "Chanli S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "Delicious Chinese in the neighborhood with friendly service and a pleasant, clean store.  And chocolate fortune cookies too!  thanks!", "author": "Peter W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-04", "description": "Very good food.  High quality ingredients.  Can order spiciness to your taste.  I usually use take out and have been satisfied.", "author": "Paul J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-14", "description": "Love this place!  Quick service dining in, or great take-out!  Hot and sour soup, wok tossed prawns and lemon grass chicken are some or our favorites here.  Also, very kid friendly (as I have happily learned while taking my little nieces out for dinner)!", "author": "Andi B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-22", "description": "I've been a few times and I'm not sure what type of food they are trying to be.  It's not good Chinese food if that's what they are trying.  The service was just fair and there isn't much ambiance.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-27", "description": "I love, love, LOVE this place! I am not normally someone who would choose Chinese food for dinner, but I must say that the butter fish and the kung pao chicken are to die for. The dishes come large enough to share a little with everyone in your party. We usually order the fish and chicken for two people and leave with leftovers.", "author": "A. J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-05", "description": "probably one of the worst places to get chinese. real chinese i mean. go here if you live in the marina and desperate for chinese. it's over priced and not really worth it being that it doesn't taste that great. there are a million better places in sf to go with better prices.", "author": "Miss O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-08", "description": "fantastic as always.  fresh, tasty, friendly staff, great service.", "author": "Mike O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-09", "description": "i'm giving 5 stars b/c they do what they do very well.\nit's not authentic from the mainland/taiwan chinese food, it's tailored for the american palate & they did it perfectly.\n-potstickers have tasty filling (not coming out of chinese sysco bucket) & dough is rolled out by old asian granny - gotta love that.\n- duck is boneless & the whole platter is set up for ease w/ perfectly cut duck slices & scallions& cilantro.\n-dragon beef is perfect balance of scallion & beef w/ tofu slices.\nand their newest - jook offering is really really yummy. no - no thousand yr old eggs in there, no you tiao (those long fried donuts to dip) just chicken & herbs.\n- this is not the place to go to for very LA (spicy)  sichaun cuisine, or anything w/ fish heads or bones. this is where you go for high quality chinese american comfort food - read: no neon red sweet& sour, and they have a BIG salad w/ mild asian flavors.-perfect after shopping on chesnut.\n-and the pea shoots are great too.\n- they charge those prices b/c i know they pay the workers a fair wage & cloth napkins, nice menus & porcelain soup spoons cost $.  (speaking of which - you could go to plastic on that last one i think).", "author": "Kim Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-13", "description": "favorite place to eat on sundays when i drank too much on saturday night! i order the pot stickers, hot and sour soup, chicken chow mien.  tastes great and easy to pick up. love it.", "author": "jen y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-04", "description": "so, i was a little upset when i ordered at 3:45 from the lunch menu and was charged dinner price at 4:15 when i picked up.  whatever, i heard the food was really good, so i'll suck up the 5 bucks.  so i sit down to my chicken stir-fry (pretty basic all around, right?) and i have to tell you - the sticky rice was the best part about the entire meal.  bland, overcooked - i literally ate three bites.  so i went back to the restaurant and spoke with the manager and she was super sweet and understanding and she comped my meal! (which was totally unexpected - i asked her to simply charge me the lunch price like it should have been in the first place.)  anyway, i wouldn't go back there personally because i thought the food sucked, but i've heard from  more than one source that they're really inconsistent and i have a couple of friends that LOVE their food, so i totally wouldn't discourage you from giving it a shot.", "author": "kaytee l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-03", "description": "This is one of my family's favorite restaurants, due to its very good value and delicious food.  It is not pretentious at all, but rather offers what it states, healthy chinese fare at reasonable prices. Although busy, you can usually get a table within a few minutes, or go earlier than average  (before 6:30) and likely you'll be seated right away.  The atmosphere and service are friendly and inviting without being stifling.  For its size, they maximize the space while minimizing the noise.  For starters, we love the veggie potstickers.  The hot-and-sour soup is full of fresh veggies and has a very nice harmony of flavors for your palate, and is big enough for 3-4 people.  The chicken in the chicken chow mein is the way you wish it to be, moist and tender  and plentiful.  Vegetarians will appreciate the offerings, including the Sichuan Green Beans,  braised in a spicy, ginger, garlic, brown bean and chili sauce, and the Garlic Eggplant, stir-fried in a sweet, brown bean, scallion and garlic sauce.  The prawns are fabulous, too.  Needless to say, they have a customer for life.", "author": "Derek R."}
