{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-09", "description": "The coconut  milk tea with some pineapple and lychee jelly in it was so slimy and satisfying, however the mango cream of other products containing it were bit too thick and heavy for my somehow pepper-proof but otherwise whiny&fragile stomach.", "author": "Lulu Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "Happened upon this little place during our walk from China town. Nice staff. Tasty drinks. Tried the taro boba with clear tapioca and paid another $0.50/$0.75 (can't remember which amount)\nfor a cute little reusable bottle. Will have to check out the location on Geary (closer to son's school) to get another drink and reusable bottle.", "author": "R L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "Got the coconut mango sago which apparently isn't on the menu anymore but when you order it they'll still make it for you. The drink was yummy. It had lychee, a mango mix, coconut milk, and sago. I wish they would have put more sago but i was still satisfied with the drink I got. \n\nI also opted for the cute little plastic bottle which was something new because they discontinued the glass bottles due to hazard issues from small children dropping and breaking the bottles.", "author": "Madelynn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "I came here for the first time after seeing the boba place next door was closed. I ordered the Winnie the Pooh drink and it was quite good. I liked that they had real mango pieces in it and after mixing the top (strawberry green tea) with the sweeter mango juice on the bottom, was delicious!", "author": "Helen z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-04", "description": "I'm not a typical complaining person. Here we go. A mosquito was floating. \n\nDID YOU GUYS CLEAN YOUR TEA POTS?\n\nMosquitoes drink my blood. Now I drink mosquito...", "author": "Annie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-11", "description": "E Tea was, well, not really tea. While this locations serves as a teahouse, serving tea and food, this review is solely on the drinks. Yes, the sizes are large, and what? You can't get a smaller size? Okay fine, so I'll have a little more tea than usual then. \n\nI really hope it was an off day when I got my thai tea because I should've just gotten a water cup instead. Right, my tea tasted extremely watered down. I was essentially drinking water with a tiny dab of tea. My friend seemed to fare much better with his drink though, now I wish I asked him what he had got.\n\nWell, at the very least, if I ever find myself here ago, I know not to get thai tea. I'm sure everything else is much better than what I got.", "author": "Derek T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "I like the flavors they have here, I got a mango green tea drinks because that's one of my favorite flavors and it was delicious. Their cow logo is so cute and they have tall skinny cups. You can also buy your drink in a plastic sealable reusable bottle. They used to have glass ones (which I was able to get before) but now it's plastic. I would definitely try their other flavors because there's so many to try! Also I don't get boba/pearls/tapioca balls so I don't have any judgments toward it.", "author": "Romyn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-06", "description": "Not bad but not impressive.\n\nI ordered the Sa Wa Di Ka (thai tea) drink and I like that it comes in a glass jar - similar to Plentea's glass jars.", "author": "Mabel Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-11", "description": "This special order, hot coffee Milk tea, is not on the menu. Our friend warned us e cafe is not as sweet as other boba place. So we both go with 50% sugar, which is good. However, as a milk tea, I was disappointed. I may not come back unless feel chilly again while waiting for Dragon Beaux....", "author": "Silvia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-11", "description": "Ehhh... I've had better boba. I ordered a strawberry green tea, but didn't taste the tea. It was more like water with strawberry syrup and boba. I probably won't be back but my philosphy is \"don't knock it till you try it!\".", "author": "Katie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "I was looking through my box of items from my San Fran and found a business card for this place and a bubble tea pic from my bestie and I. We did save the receipt although faded now but it does show that we ordered a mango bubble tea. Instead we had jellies instead of pearls. It was close to what we have here. It was really hot, therefore, I remember just needing something to chill from the coolness.", "author": "Shila B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "First time here. New to me teas. We came here with family that goes here a lot. We had the tea float with boba. I had never heard of boba before, little round black jelly balls. It was very good. Lots of choices.\n\nI liked it! Will have to try more.", "author": "Diane G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-02", "description": "Flavorwise this tea is pretty good and the boba is the perfect size and texture. The bobas are slightly smaller than the usual ones I've had but are very chewy and not gooey. However the menu marketed the drinks as Yakut based drinks but it tastes like regular yogurt syrup. It still tasted good but not what it advertised. Winnie the Pooh was a very cool drink with three different kinds of flavor within one drink and is very unique. I love the size of the cups because they fit in all cup holders even the especially small ones.", "author": "Ellen G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "E Tea.\nI spent forever believing this was a nerdy joke on E and Z isomers in organic chemistry...\nThen realized it's a pun on ET. /facepalm\n\nTL;DR - A millennial's i.e. my thought process: Ooo a new place with cute glass bottles! -Goes without finding out whether the tea is good- -And the tea turns out to be good- -And it all costs less than toast- Happiness.\n\nCynicisms aside, E Tea is among my more preferred tea shops in SF:\n- The tea quality is good\n- Their flavorings don't taste very artificial, and they have an option of real fruit as a topping (a healthy alternative to boba and it looks Instagram-worthy)\n- The menu also features a tasty array of favorites like sesame, almond, taro, matcha, mango sago, and a creama series\n- Friendly service and upbeat atmosphere\n- The area is small with one table near the counter, but they share a space with Super Pan and I think you can sit inside as well (plus Super Pan is super tasty)", "author": "Edna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-07", "description": "We came here after eating dinner at San Tungs with high hopes as it has high reviews on Yelp. Yet, another hype. Another disappointment. Even the ABG in our group shook her head to this boba joint. When an ABG says it's not good, you know it's not good. \n\nRegular Milk Tea with boba (number 1): Straight up tasted like chocolate milk tea. I can even taste the undiluted powder. \n\nDespite the cute jug cups you get to keep, I'd have to say this is an overall pass. Just drive an extra minute to Bubblecup.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "1. AC not that strong here\n2. The drinks come in glass bottles\n3. Tea is just decent not amazing\n4. The place is a quick grab and go\n5. Slightly pricey for the area\n6. I would come again when in the area", "author": "Bruce S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "The fat chick in me wishes this place was more accessible. \n\nThey have so many flavors to choose from and that fried chicken though... (need I say more?)\n\nSadly, I wouldn't have been able to handle a third lunch, so decided on the black sesame bubble tea. It was SO SO delicious, I should have ordered one to go. The little cow logo is just adorable!\n\nI can't wait to come back and try other flavors.", "author": "Shereen A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "They have lavender MT yay! So already they'll get stars just for it haha\n\nI think their lavender it is lavender tea and it can come with creama aka fresh milk and the drink was right around $5 - I don't remember too much about it because it was some time ago but I would say this satisfies a craving if you're in the area but there's nothing special about it. The lavender is more on the subtle side.\n\nWhat surprised me is the sizes - the plastic cups it comes in is 24oz but the glass bottles they offer are expensive but less oz, which means you pay more for less oz but you get to keep the bottle haha\n\n50/50 coming back - there's also an off smell because it's shared with the restaurant, I recommend just getting the drink to go versus dining in", "author": "Yeanne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "Disclaimer: totally biased by the cute cow glass bottle\n\nGreen Tea + mango was refreshing and just the pick me up I needed\n\nOverall Thoughts\n\nWell worth it if you are into collecting cute novelty trinkets while sipping on boba teas", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Awesome cool employees. Great tastes for great prices. Only boba location I come too in SF. Even if they're closed I still stay faithful and don't go anywhere else. E-Tea is the bomb diggity!!!", "author": "Jake T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-27", "description": "\"Always full of yummy smiles.\"\n\nWhat does that even mean? Are there \"yummy smiles\" in the drinks? Is the restaurant full of people who are smiling because the food is yummy? What even is a \"yummy smile\"? And also, what does E-Tea stand for? These are the important questions.\n\nUnfortunately, I have no answers. I attempted to find out what E-Tea stands for-- the girl at the register told me that it may be a play on the owner's name (Eddie) or it may be a reference to E.T. (the movie), but that this is also her own personal speculation.\n\nBut anyway... to what actually matters in this review:\nWhenever I go to a new boba/pmt place, I always try the standard milk tea. The jasmine green milk tea here was decent-- not the best I've ever had, but not terrible either. I thought this was just my perception, but then I saw that another Yelper had mentioned this as well-- I felt like the sugar used in the drink tasted a bit like a sugar substitute instead of real sugar. \n\nThe boba/pearls themselves were also decent. They were the right amount of chewiness, so no complaints here.\n\nThe Pooh Bear drink is adorable to look at-- before it's mixed, there's a layer of red on top of the layer of yellow, just like good ol' Pooh Bear. \n\nRandom: Some advice from my E-Tea drink cup: Enjoy Tea. Enjoy Life. Enjoy E-tea in your life.\n\ntl;dr: Not the best milk tea I've ever had, but certainly not the worst. I don't know that I'd go out of my way to come here, but if I'm ever in the area, I could see myself stopping by. (Although there is also a TeaOne literally three doors down...)", "author": "Lillian Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-08", "description": "Please put more than one employee on shift. Long line long wait. Don't come here.\n\nBetter options in the area.", "author": "Mario D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "They are super yummy and very helpful. I highly recommend. Great customer service\nI got the honeydew slush with boba.\nThey have strawberry exploding boba and regular boba.\n\nVery nice girls too.", "author": "Kayla C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-05", "description": "Ordered:\n- lavender milk tea 24 oz $4\n- earl grey black tea + milk $5.25\n- coconut taro sago 20oz $4.50\n- karaage fried chicken $7\n\nPros:\n- Cute design that looked very similar to BB Tea's cow design..\n- The presentation made the drinks look appealing \n\nCons:\n- Lavender Milk Tea tasted really bitter than what I'm used to. \n- Earl Grey Milk Tea had no taste of the earl grey.. instead it tasted like regular milk tea. I asked to add in milk but they just put a cream foam on top. \n- Coconut Taro Sago didn't really taste what it described... it just tastes like whipped cream with sago. \n- Karaage Fried Chicken were small chunks of chicken that was not worth the price. You can get the same amount of chicken for $4-5. It was pretty sweet too. Not really a salty treat with the milk tea. \n\nOverall, I was disappointed in this experience and should have went to Tea One - which is two stores away.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-17", "description": "I've only been here once but the encounter was so bizarre I'm not sure I want to go back. Here's a transcript of my exchange with the girl at the register:\n\nMe: Can I get the matcha with red beans and jelly.\nGirl: You want bottle or cup?\nMe: Why is the bottle more expensive than the cup even though it's 4 oz smaller?\nGirl: Because it's a bottle...?\nMe: Right. But the point is that the bottle is smaller.\nGirl: Yes.\nMe: ...\nGirl: ...?\nMe: Whatever. I'll just get the cup then.\nGirl: So you don't want the red beans and jelly?\nMe: What? Wait, does the cup not come with red beans and jelly?\nGirl: ...\nMe: Just get me a bottle.\n\nI'm still not sure exactly what's the difference between the bottle and the cup. The tea was alright though.", "author": "Carl W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "Incredibly disappointed with my visit here today. Since E Tea shares the same storefront as my local-favorite, Super Pan, I had high hopes for their teas. I ordered the house black tea with milk and no boba for a friend and the mango slushie for myself.\n\nAt $4.50 for a pretty large size, it was a ok deal, but we really just wanted a regular 12oz cup so at least give us an option to go small! Service was mediocre -- points off because we got the mango slush a full 10 mins after we got the milk tea. They also mistakenly added boba but I think we can all overlook that because boba tea is called boba tea for a reason. On top of that, the lid wasnt sealed very well, causing the drink to leak out. \n\nThe taste was not worth $4.50. The milk tea tasted watered down and the mango chunks they put into the slushie was very sour. Tastes like how I would imagine cold mango-flavored syrup withsmall pieces or unripe mango cubes. I would price that at most at $3.00 flat. Wasn't worth the trip, we both didn't finish the massive starbucks venti-size cups of goop. I won't be back.", "author": "Nat E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "I've been wanting to try E Tea, mostly because of the glass bottles. I always wondered what the E stands for and found out from one of the staff that the owner owns another place that starts with E so this place is called E Tea. Anyway, the tea is decent. I enjoyed the matcha with boba more, it was pretty good and creamy. The Jasmine milk tea with boba and grass jelly was okay, but it was a bit on the bitter side even with 100% sweetness. I'm not sure if they owned the Super Pan restaurant that's connected also?", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "We almost missed this little store as we walked on the opposite side of geary. Unlike the neighboring out of business teaone & infinitea its small, doesn't have this massive sign, and is obscured by trees.\nAnyway we found it, and while we were trying to pick from the large menu, we let a large group pass us in line, but they served really quickly and we ordered and received our drink in no time.\n\nWe ordered the mango sago with lychee jelly and honey boba. Upon receiving our drink we realized we should've asked to subtract the lychee, which came with the drink, toppings climbed up a little over half the cup.\nHowever the texture of the drink was good, it was around the consistency of a milk tea which i much prefer to a texture of a slush. The flavor wasn't bad either and it tasted pretty fresh. I don't know if i will come back but it certainly wasn't bad.\n\n[we did a boba run through the richmond on 7.7.18. here are the results and rankings for e tea]\n\nall the following categories (boba texture/freshness/flavor) are scored out of five and their position in to the seven total places we visited is listed also\nperson a 2/4/3/9 #5\nperson b 3/4/4/11 #3\nperson c 4/3/5/12 #2\nperson d 2/4/4/10 #6", "author": "Boba R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "The fruit teas are the bomb and combined with the rainbow jelly! I always pair their drinks with either chicken kaarage or takoyaki... ok last option would be Curry fish balls. The food are perfect to pair with milk tea/fruit teas. I guess it makes sense cos they're holding on and the boba place a door down is out of business!", "author": "Jaide F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-23", "description": "I mainly went here for the reusable glass cow bottle and finally made it down to this side of town. Easy to find and inside it was right in front of me and to the left was the Super Pan restaurant which looked pretty full to me at around 5:45pm. Brightly lit\nMenu board and a giant poster listing the menu in case the bright board hurts your eyes probably. LOL \n\nI like how they have printed out color menu that I can take away from both e tea and the super pan, so I can plan what to order next time. \n\nI was the only one there and decided to go with #6 $4.50, the Almond Queen which has Almond &Taro milk tea with taro chunks and pudding. They were pretty quick in making my drink under 5 minutes.  \n\nI was happy with the glass cow and drink where I can see the big white pudding that looks like tofu and tiny chunks of mashed up taro. I think there was more pudding than taro chunks. The presentation was pretty. I was holding the precious bottle like it was a treasure. I took my drink home. The only thing I didn't like was when the foam of drink settled in, I had a like inch of space on top. It wold have been nice if there was more drink on top.  The flavoring was very light.  Upon first sip it was sweet. After that it was okay and mellow drinking. \n\nI kind of would like to return to give the place another chance. I probably need to try something with stronger flavor with no boba balls, but not sure which one. Hmmm...if anyone has suggestions, send me a message! :-)", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "The boba pearls are excellent - maybe a tad mushy for others, but not a hard one in the bunch! I got the jasmine green milk tea with 25% sugar, and it wasn't sweet at all. It was pretty bitter, actually, in that tea bitter sort of way, and I didn't find it milky. Later on, I guess the sugar settled so it was more sweet and the weird thing is the cream coagulated and stuck together like foam. It was pretty weird.", "author": "Ke C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "My new go to because ShareTea now sucks. \n\nE Tea employees are nice, the drinks are good, and I like the glass jar. I like to bring it back and reuse.. sometimes I forget to bring it back but it's ok, I'm upcycling it at home with my own juices and smoothies. \nMy fave is the mango coconut drink here. I think it's the #12 or 13? Anyway, I like E Tea because they have crystal boba too!", "author": "Susy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-22", "description": "# 18 E Tea *Rod Boba SF Rating * 4/6 *Rod's Yelp Rating *2 stars \n\nGeary location in the \"Rich\" is not my favorite and a bit \"milky\" to my liking.  It falls at #18 in my rankings (of 30) below.\n\nRod M tours San Francisco in search of the BEST standard milk tea with boba. I have individual reviews for all the places listed below.  Check out my latest reviews for the most up to date list. \n\nI recently embarked on a completely pointless quest to rank most of the Milk Tea/Boba Places in the area.\n\nRules: I ordered a simple milk tea with Boba (regular sweetness, ice etc.)\n\nRanking explained:  #1 (listed at the top)  is my favorite/ #30  (listed at the bottom) is my least favorite. \n\nRod Boba SF Rating = (Taste of Milk Tea / Taste of Tapioca Balls) on a Scale of 1 to 10 (10/10) being the best score possible\n* Please note that I like my boba a little bit sweet. I don't like it too milky, too strong of a tea taste or too watery.  I prefer fresh tasting larger \"boba\".  Powdery drinks (those places that simply have a plastic carafe that they pour out of ) and boba that tastes \"old\" get docked on my rating scale. \n# 1 Itea *Rod Boba SF Rating * 9/9 *Rod's Yelp Rating *5 stars \n# 2 Puppy bobar *Rod Boba SF Rating * 8/8 *Rod's Yelp Rating *5 stars \n# 3 Asha Tea House *Rod Boba SF Rating * 7/9 *Rod's Yelp Rating *4 stars \n# 4 Caffee Central *Rod Boba SF Rating * 7/8 *Rod's Yelp Rating *4 stars \n# 5 Cool Tea  *Rod Boba SF Rating * 7/8 *Rod's Yelp Rating *4 stars \n# 6 The Boba Shop *Rod Boba SF Rating * 7/7 *Rod's Yelp Rating *4 stars \n# 7 Good Earth Café *Rod Boba SF Rating * 7/7 *Rod's Yelp Rating *4 stars \n# 8 Hanlin Tea *Rod Boba SF Rating * 6/7 *Rod's Yelp Rating *4 stars \n# 9 Keep it *Rod Boba SF Rating * 6/6 *Rod's Yelp Rating *4 stars \n# 10 Wonder Tea *Rod Boba SF Rating * 6/6 *Rod's Yelp Rating *4 stars \n# 11 Tpumps *Rod Boba SF Rating * 5/7 *Rod's Yelp Rating *4 stars \n# 12 The Ramen Bar *Rod Boba SF Rating * 6/5 *Rod's Yelp Rating *3 stars \n# 13 Sharetea *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 14 Tanca *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 15 Boba Guys *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 16 Steep (not Steap) *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 17 T&T Café *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 18 E Tea *Rod Boba SF Rating * 4/6 *Rod's Yelp Rating *2 stars \n# 19 Steap (not Steep) *Rod Boba SF Rating * 4/5 *Rod's Yelp Rating *2 stars \n# 20 Maggies Café *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 21 Sweet Heart Café *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 22 Honeycreme *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 23 Elixiria *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 24 Quickly *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 25 Plentea *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 26 Mi tea *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 27 Ten Ren Tea *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 28 Wonderful Foods/Dessert & Café *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 29 Out the Door *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 30 I Café *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars", "author": "Rod M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-20", "description": "I do not recommend this place. I am a milk tea/boba lover so I'm speaking from experience.\n\nI had high hopes for this place before I tried it, but it ended up to be a big disappointment. I was first drawn in by the cute logo and cups. The fact that it's also next to Tea One and inside of Superpan gives this place business. \n\nAnyways, on to the drinks and the food. For any drinks, you could either choose a 20oz bottle for $4.50 or a 24oz cup for $3.99. My boyfriend and I ordered a Matcha Milk Tea that comes with pudding and red bean and a Thai Tea that comes with boba and grass jelly, and we ordered the popcorn chicken. We were told that they ran out of boba and asked us to choose something else to substitute, but we were fine with that. \n\nOur popcorn chicken was served in a tiny brown to go box. The most ripped off thing about it is that they only filled the box to half way up with chicken. For a moment, I thought it was left over chicken from the previous order. It was $6.99 and the fact that they gave such a small portion..???? Not worth it. The popcorn chicken wasn't bad tho, it was edible. I'd rather go get my popcorn chicken craving satisfied at Quickly's. \n\nThe drinks were really watered down and had a funny taste. I don't even know how to describe the taste of their Thai Tea, but yuck! The matcha milk tea was decent, but I didn't taste the matcha. \n\nOverall, two stars for the cute cups and for the decent matcha milk tea. Not coming back here.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "I'll admit, i'm a sucker for a cute logo. The little cartoon cow totally got me in the door, BUT the drinks will keep me coming back! There's a couple boba spots right around this intersection including E Tea and i've tried all of them and what I love about E Tea was the fact that their 25% sweet actually means 25% sweet. I hate getting misled and getting a low sweetness for my milk tea and slurping up a straw full of sugar - no thanks. I got the jasmine milk tea here and the 25% sweetness was the perfect amount, allowing the tea flavor to really shine through and not be overpowered. \n\nAlso i dont know about you guys but i've got smaller than normal hands so the fact that these plastic cups are taller and skinnier is AMAZING. Also they can fit in literally any cupholder of a car so double win. \n\nThe boba texture is on point and comparable to boba guys - which if anyone knows me is high praise since i basically worship boba guys.\n\nReally small interior since they share a space with Superpan, but there are two tables dedicated solely to E Tea if you insist on sitting, but personally i love walking down geary with my boba and checking out all the spots around for my future food adventures. I will definitely be back!", "author": "Sam L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-21", "description": "Came here on a Tuesday for a late lunch at Super Pan and E-Tea is located inside the entrance of Super Pan before you reach the restaurant. \n\nI ordered an oolong milk tea with boba and what I received was an oolong tea creama with boba. It didn't look like milk tea to me: it had two layers, top layer was off-white and bottom layer was light brown, so I brought it to the attention of the waiter right away. He assured me that it is milk tea and that I just need to mix it. I gave him the benefit of the doubt and mixed it up, took a few sips- alas, it tasted just like tea creama.\n\nIf the drink had been good, I would've let it go and just drink it but the tea tasted weak, the sugar they used tasted close to substitute sugar, the boba was soft but not sweet. I asked the waiter to take it back because it is the wrong drink and he took it back and had the E-Tea staff make another one. \n\n...10 minutes... 15 minutes go by, I don't know if E-Tea received any phone orders or if others at the restaurant were ordering drinks as well but they didn't have any customers standing in front of the shop but yet they still haven't made my drink. I just asked the waiter to cancel it. \n\nVery iffy and unpleasant experience overall, don't think I will give this place another shot.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-09", "description": "One of the worst boba spots in SF :/ pretty disappointed we picked this amateur shop over the usual Share Tea next door. Don't get sucked in with the free upgrade promo with yelp check in. It's not worth it! The drinks are very powdery. You can taste it. We ordered the taro milk tea with boba and taro chunks and matcha milk tea. The flavor just wasn't there for both drinks. The boba balls were too soft and chewy. A few sips in and had to throw the rest away. \n\nThe default size is a glass milk jar with a plastic cup. The upgrade size is a gigantic cup like purple cow that won't fit in your car cup holder. The price is also a little heftier than most drinks in the city, probably to cover for the glass jars. Sorry ETea, hopefully this review can serve as a review for improvement. Good luck!", "author": "Amy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "The milk jugs are so cute!\n\nWhat we ordered:\n- Black seasame milk tea and it came with sesame ice cream\n- Passion Fruit green tea with tapioca\n- Mango green milk tea with mango bits, pineapple bits, and tapioca\n\nTheir green tea is pretty strong so I recommend ordering it a bit sweeter for anyone that has a sweet tooth. Their staff is super friendly and lets you know their recommendations too. Their jugs are the cutest and the lid is not flimsy compared to other tapioca places. \n\nVerdict: will come back! It's right inside Superpan.", "author": "Eva O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "Paying $1 more than other places is worth it for their crema tea.\n\nGot the oolong with crema and coffee jello delicious!\n\nIf it wasn't so expensive I would have gotten four of them!", "author": "Jack R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-21", "description": "The Richmond is now saturated with boba places everywhere and this is one of the newest spots in town. It's got some stiff competition since it's so close to sharetea and infinitea. I think this place does offer some unique options and is worth at least a try. \n\nCoconut mango sago: 2.5/5: a bit overly sweet it had good coconut and mango flavor but the litchi jelly made this drink overly sweet. I did like the touch of coconut it made this drink slightly better. But in all honesty, if I were to get mango sago is probably stick with creations or itea, they do it better. \n\nAlmond queen: 4/5: I tried this recently and I actually really like the combination of almond and taro together they come together really nicely in this drink. Although a bit sweet the flavor together was great. You could still taste almond and taro it wasn't as if one overpowered the other. Of the two drinks this one is the winner to me. \n\nIf I'm not in the mood for sharetea, I would definitely stop by this place again for the almond queen. Also price is a bit high but that's because they use glass bottles, not sure if you get a discount for bringing them back.\n\nTotal for 1: $5", "author": "Stella J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Very nice boba place! They serve boba in glass bottles which is refreshing and very cute (not to mention portable). It's slightly pricey, but they have a wide selection of drinks that are very good and worth it. It's a shame the store isn't bigger so more people can sit and hang out.", "author": "Christine K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "First time in my life that I've tossed a nearly full cup of boba. The hot matcha green tea with pudding and red bean was lukewarm, bland, no matcha flavor. The pudding and red bean was sickly sweet. I took two sips and was so disappointed that I threw away my entire drink. My friend ordered a hot jasmine milk tea with pearls. She said it was like drinking warm milk. No flavor, bland. After a few more sips it tasted like nothing more than warm water. \n\nExtremely disappointing.", "author": "Nina X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Got the lychee fruit green tea 75% sweet. If you get the plastic cup you get 10% off.\n\nThe tea was very flavorful and there was actual lychee bits that made it taste real. If you like the taste of real tea and not powder or syrup drinks come here !\n\nThough there isn't much room to sit, since it's connected to a restaurant. But good for a place to grab and go for boba.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "Went to superpan to eat with a girlfriend when we noticed that the restaurant has turned into a half restaurant half boba place ! Cool, now we can eat AND get boba at the same time. The guy working even told us that we can place an order from the boba counter and he'll bring over the drinks to our table at superpan once he's done! Neat. :)\n\nFirst of all, there was SOO many selections to choose from and they all looked and sounded so good!! I can barely choose! Finally, I opted for\nthe Chrysanthemum Honey Tea w/ aloe and berry. The friend ordered the Princess Rose Tea Creama w/ lychee. \n\nThe drinks came out in a TALL glass cup. Bigger than we thought! the Chrysanthemum Honey Tea was really refreshing and I loved the pairing of the red berries. I can also taste the tea flavor and the sweetness was perfect; not too little and def not too overbearing. My friends Princess Rose Tea was also really good too and refreshing to drink. Although she would prefer to have less creama cause her tea kinda turned into a milk tea after mixing the creama but it was still a great pair; just gotta let the barista know to add a little less next time! \n\nOverall, service wise was good! How often do you get your boba brought to you while you order food right next door! But since they're a restaurant/boba place now, people can either grab a boba drink and leave OR sit down to eat AND drink! ^__^ \n\nAnyhow, we were very pleased with our drinks. Our barista, Ben, was very accommodating and walked us through their selection of milk teas and fruit teas which led us to know what we want. Our drinks turned out better than expected. Def going to try the Almond Queen next !", "author": "Anissa D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-02", "description": "If I could leave zero stars I would. The staff was incredibly rude and this was also the biggest waste of money I've ever spent on boba. I never thought it was possible to have inedible boba, but the drink was so bad that I could not finish it and had to throw it away. I normally never leave bad reviews on yelp but this was an experience that I hope others are able to avoid by reading this review. Do not waste your time or money here.", "author": "Hikari N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-02", "description": "Terrible terrible customer service. Very extremely rude. Both of our teas tasted like water - literally tasted like nothing. When we went back to tell them they looked at us both like we were crazy. Finally they added an extra pump to the drinks and we left - didn't do anything and the drinks still tasted like water. We couldn't even finish our drinks and threw them away after a few minutes. Wast of time and money. Stay away from this place.", "author": "Adam R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "This place is cute! I was originally going to get Sharetea, but was drawn in by the cute cow logo everywhere, especially the glass bottle that you get to keep. They seem to advertise the 10 or 15 main drinks pretty heavily, although it does seem that you can customize with the type of tea and toppings if you so choose. I got the hokkaido with 50% sweetness, which turned out to be close to ideal (maybe a bit less sweet than 50% at other places). All of their drinks come with several types of jelly, which might be good if you like variety. The milk tea tasted a bit watery, but otherwise it was fine. \n\nA couple points of improvement could be that the straw was a bit short (only a bit longer than the bottle itself), and the drink could've been colder before being served, since there is no ice in the drink.", "author": "Tony D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "#5 Matcha w/Pudding and red bean. This is my favorite drink by far. I'm matcha everything these days. \nI just tried the same #5 in Chinatown E Tea yesterday and it's not the same. \nGeary's location is much better. \n\nI have bought this 5 times in the past few months. I have all the cute glass + plastic jars. I reuse them for other beverages and so cute with the little cow on the outside.", "author": "PreciousSwt P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "Went to E Tea for the first time today. My friend and I wanted to try a new  boba spot in the city. I ordered the Winnie the Pooh and my friend ordered the lavender milk tea. Both were pretty good. And they have cute milk bottles! We also got tried their garlic fried chicken wings and their garlic fries (I forgot to take a picture!) A little salty but they were both good. The staff was friendly and they were pretty quick. When you first go in, there's a counter where you can order drinks and food to go and they also have a dine in section where they serve different kinds of food as well. We will be back soon to try other things on the menu and possibly sit down and enjoy a meal. Also, parking on Geary sucks and spots are limited so you may have to park a couple blocks away.", "author": "Misty T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-18", "description": "The cashier was really nice & friendly, but the girl making the drinks was very rude. When she was done making the drinks, she would slam them on the counter. She's helped me before as a cashier & even then she was very rude & unprofessional. NO customer service skills at all.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Been here twice within a 14 hour time span. That is how good this place is. The bottle is honestly the reason why I wanted to check this place out. I expected a much smaller bottle for some reason however, I'm pretty damn glad that it wasn't. You might miss this place if you aren't looking hard enough. The upside is that Superpan is connected. So you could eat and have boba. Downside, if you come here just for boba. You will have to wait outside. the place by itself is very small. \n\nMoving on to the milk tea. The first time I went (last night) I expected this place to be bigger. I ordered the caramel milk slush with boba and pudding. I always try to order the same drink with pudding because I prefer pudding than boba. So anyways, I didnt get to drink the bottle for an hour. One big upside to a bottle is being able to refrigerate the milk tea easily. Once I opened it, gosh darn it was good. The caramel was a little too sweet but the boba and pudding were so soft (especially after refrigerating the slush). \n\nThis morning, I was craving boba as a pick me up. Sooo... boba it was. Honestly was the smartest choice I have ever made. It's so damn good. I got the ice cream milk tea with the hokkaido milk tea with coffe jelly, pudding, and boba! It's my all time favorite! Now I have two bottles to re use! Honestly, I much prefer this place out of all of the Richmond area. It's going to tough to beat.", "author": "Ann N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "Noticed today that there was a brand new boba place just a door down from Sharetea - bold move!\n\nE Tea shares a storefront with Super Pan, but we just wanted to try a drink so we stayed in the front. Wanted to be a little adventurous and decided to order the black sesame milk tea with boba. \n\nThe drink came in a cute glass bottle and was pretty good overall - the flavor was pretty much spot on, similar to a black sesame paste dessert. The boba was a bit too soft for my preference, but had the right sweetness. It'd be great if their straws were just a bit longer! It just barely pokes out of the bottle as is so the height is a tad awkward. \n\nPrices were comparable to other boba places, and I think competitive if you think specifically of the places that give you glass bottles (Plentea, Bottles Zup.)\n\nService was good - our cashier gave us the sample of popcorn chicken even though we hadn't asked for it (saw the grand opening promo signs but had just eaten), so that was a nice gesture. \n\nOverall, I'll probably stop by in the future to try out a few of their other drinks, or maybe eat in next time!", "author": "Delia Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "Do not come here on the weekend. The worker will messed up your order and they won't accept that is their fault. We ordered the mocha smoothie add crystal boba but they added some the poping boba to mine then they didn't make the new one for me they just open my drink and took some those out and give me back the rest of it in the new cup. I'm so disappoint. We won't be back again.", "author": "Siriwan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "The young girl at cashier wasn't friendly at all and the oolong milk tea have no tea taste and all I can taste is milk and cream, I saw they put a lot of half and half into the drink. I throw it away even the drink still have 75%. I can't finish it. I don't think I will come back anymore.", "author": "Man Ieng U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "I like this boba place! The drinks are creative and it's a nice addition that they come in a cute glass bottle you can take home (or get 10% off for getting the plastic cup). There's only a couple seats inside for E Tea (the other side is for the restaurant) so you'll probably have to take your drink to go. Service is super friendly and quick!\n\nI got the almond and taro milk tea with boba, pudding, and taro chunks ($4.50). It was super frothy and tasty. I thought the drink was a little too sweet so it would be nice to adjust the sweetness of that. The honey boba is chewy and a great texture!\n\nOverall I would definitely come back and can't wait to try their other interesting drinks especially the ones you can add ice cream to!", "author": "Linda X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-27", "description": "This place is so expensive. I cannot believed I paid almost 5 bucks for milk tea )': i asked if I could get a normal cup and not the bottle but the cashier told me it would be the same price. THE HECK. Welpppppp. \n\nI ordered the original milk tea just to compare to other places, and it was OKAY. Nothing too special. Whats worse is that they had no tables to sit and the cap of the bottle doesn't fit with the straw inside the bottle, so taking it to-go was oddly difficult )=\n\nUnless you're into collecting milk bottles for absolutely no reason, I don't recommend coming here.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-15", "description": "I don't understand why they have all these random flavors, but lack a simple taro smoothie! Very disappointing. There were two ladies working when I ordered a couple drinks, one of my orders was wrong and when I mentioned it the cashier she started yelling at the other lady making the drinks... I felt really bad for the other lady being scolded as I didn't mind at all about the mistake. Doesn't seem like a healthy working environment... you should respect all employees as they are working hard and people make mistakes. Left a bad impression with me and now I prefer to walk a few steps further to the other boba place.", "author": "Hoku L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "This place was really good!! The boba was super fresh and honestly some of the best I have had (besides boba guys). I got the guava green tea with boba and pineapple. So yummy. My friend got the mango slush which was also really great. I will definitely be coming back!", "author": "Sophia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "I got a Thai tea and asked for only boba but I found jelly in my drink. Also the boba tasted like medicine...", "author": "Cassandra C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-21", "description": "They have cute little jars with a cow on it!  I got the princess rose tea crema and my friend got the mango sago.  As for food we got the chicken karaage and bacon wrapped sausage. It was definitely good when we first got it, but after an hour it wasn't really edible anymore.  The layers the the crema were all weird, the mango sago was really thick, and the bacon wrapped sausage was really whatever to begin with.  But omg that chicken was good til the very end.  I'd come back for regular milk tea and that chicken karaage.  Also, if you're gonna get the bottle, try to not lose the cap!", "author": "Kim C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "Extremely disorganized in terms of service and making of drinks but staff were extremely friendly and my drink tasted good. My friend's not as much so don't order the jasmine milk tea cuz it definitely wasn't jasmine lol. \n\nI ordered the almond milk tea that has some taro in it and added boba instead of pudding. It was so good. \n\nAlso they had a special on the larger size so it's cheaper but hard to drink it all.", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "Randomly wandered by this place after dim sum and decided to give it a try. The prices include a glass bottle you get to keep. If you opt for the disposable plastic cup or bring your glass bottle back the next time, you'll get a 10% discount.\n\nOne thing I immediately noticed is that their tapioca pearls are perfectly cooked, unlike most other places that overlook them into gross squishy balls that dissolve instantly and have no chew to them.\n\nWe ordered a milk tea and a coffee tea - both were great, but a touch on the sweet side. I'd probably ask for half the sugar next time if they do that sort of thing.\n\nIf you're in the area, definitely check it out!", "author": "Wayne H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "Had a very awful experience with the lady working with the tea. She was rude from the minute I ordered. I waited over 15 minutes for my tea and when I asked if they possibly had forgotten it she said she called for it a long time ago and it was sitting behind the counter. She finished making three more teas before finally reaching down to hand it over to me. \n\nHavent seen someone so rude working in the food industry in a long time! Was very surprised. I live less than a block away and unfortunately never want to go back. Plenty of other tea places around", "author": "Claire S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Coconut taro sago and matcha red bean milk tea was SOOOOOOO GOOD. make sure it's less ice and sugar though :)", "author": "S L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "Pretty good; went based on a friend's recommendation! The tea was made pretty quickly too! In the span of two minutes after taking my order, they finished! You have to watch when they place the tea out though because they didn't call out when your order was ready. Otherwise, it's worth going to!! (The cow logo it so cute too!)", "author": "Izzy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "omg,I love their chocolate milk tea. It taste even better than Tpumps.I also recommend their honey lemon tea and mango sago. The mango sago has small piece of mango in it and it is made out of fresh mangoes.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-09", "description": "Cute reusable bottles... k, you got me through the door. I tried their caramel ice milk with boba and pudding and the boba was super disappointing. It clumped together when you tried to drink it through the straw, had no flavor and was a calorie waster for me so I tried to drink around it. The drink itself was really sweet so I'd recommend scaling it down to 75 or half sweetness. \n\nThe glass bottle was 20 oz at $4.50 but if you order in a plastic cup it's $4.10 after the a discount and you get more, 4 oz more. I'm a sucker for cute things so I got the cute reuasable bottle which I've been re-using all last week. Drinks here were ok, the place itself was pretty small but there's a restaurant connected to this place that has sizzling platters. I'd consider coming back here to go to that restaurant next door but nothing I would go out of my way for.", "author": "Lindsay C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-27", "description": "had the mango tea . plenty of mango dices but actually not my cup of tea. \n\nit taste okay my issue is that it does not contain enough tea for my taste. all I taste is sugar and mango like it is mango infused water.\n\nthe key to this is the balance of mango aroma and tea .\n\nMaybe it is just a personal preference.", "author": "Wai C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-07", "description": "Located in the same location as Super Pan which is literally right next door. E Tea has some variety but I wouldn't say it's a whole lot. They offer two sizes of 16oz(glass bottle) and the 24oz(plastic cup). The glass bottle idea is cute but honestly, all those bottles I'd collect from places like Plentea & Bottle Zup are all useless. I couldn't really decide if what to get so I asked the worker what she recommended which was mango sago. I took her advice and got that with the boba instead of lychee jelly. Business was slow when I got there with my friend so the drink was made very quick. The mango sago wasn't what I expected, it was okay honestly. The sago was still hard, semi raw. Their boba is good tho, not going to lie about that one. I agree with the other reviews that this place is okay, maybe below average for the drinks. You might be able to get something better at TeaOne next door.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-09", "description": "Haiku of the day - 9/9/2016:\nThe Mango Sago.\nFlavorful and delicious.\nCome on by and try.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "I was literally just here. And I had some of my drink and I knew I just had to review this place on Yelp. \n\nI was at Super Pan with some friends but we decided to get boba after eating. Not gonna lie, I was enticed by the cute bottle and their mascot is a cartoon cow. I'm a huge sucker for really cute branding. I can't say no to that.\n\nNow, this place is about an hour commute for me. I came here on a whim after dinner and was lured in by the bottle. Everything on their menu looked really good. It's well put together; clear pictures and descriptions of the drinks with an extremely organized layout. I wanted the Rose Tea Crema but I felt like it wasn't the right mood. I ended up getting the Fresh Taro King. \n\nRemember Sharetea? Taro fresh milk? That's what I thought this was. Turns out, the taro is blended into milk. It's smooth without being thick, but still creamy. It has a really nice texture (at least to me). It's not a slush but not milk tea or fresh milk. It's almost the consistency of a Yakult yogurt boba drink, which they also sell here. The boba is chewy and doesn't fall apart. It takes a while to chew but that's how boba is supposed to be! \n\nThis place is gold. I would easily make the commute out here just to get boba. Maybe I'll try the Rose Tea next time. Or anything else, honestly. \n\nAlso, there's a sticker on the tip jar and I really want a sticker. Do they plan on selling stickers? I would just buy a whole bunch, and come back for boba.", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "As we finished up at Super Pan, they kept E Tea open just a little longer, so we could order some drinks to go even though they were closing. We ordered the Fruit Tea (lychee with black tea) and Chrysanthemum with Aloe. We got them in glass jars for less than $5 each. It was really cute and even better tasting. It was the perfect amount of sweetness and I really enjoyed their bits of fruits. This is perfect to go with or without your meal at Super Pan!", "author": "Cindy Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "Decided to try this new spot because it seemed interesting. I got the milk tea (1) and my gf got the mango sago (13). We weren't impressed. My milk tea tastes a little bitter but other than that it was fine; nothing special. The mango sago tasted really artificial so if that fake mango candy taste is your thing then you'll like it. I liked that they had a lot of good choices for flavors. I will probably go back to try something else in the hopes that it redeems this weak ass milk tea.\nThe souvenir bottles were a cool idea but let's be honest, I'm never going to reuse it. Also, the cap kinda sucks cause it can spill really easily if you knock the bottle; I prefer the plastic seal that you throw a straw into tbh.", "author": "Dylan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-29", "description": "Friends wanted boba after dim sum so we walked down here with the mindset that we were going to Sharetea but we came here instead because it was new.\n\nBasically all drinks here are provided in a little glass bottle. We got the sesame ice cream milk tea, the description said boba was included but when we got our drink, it wasn't in there but the cashier was kind enough to add some to it. \n\nOverall, the drink was pretty good, it was almost milkshake like because they add black sesame ice cream to it. Price point, I would say its cheaper than most glass jar boba places in the bay area. \n\nWould come here again if I could opt for a cheaper option without the jar since I have one already and I don't want to hoard more.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-11", "description": "I just noticed this tea shop last week and was excited to try it out! Now that there are three tea shops within a 1 block radius, things are getting competitive!\nAll of the flavors and combos sounded really good! I also love their menu design! The prices were a bit higher than normal, but it does come in a nice glass bottle, which you get to keep!\n\nI ordered the Passion Fruit Black Tea with Crema and Boba. It was pretty delicious! It was a bit sweeter than I like but overall it was tasty and I'll probably be back!", "author": "Larissa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-21", "description": "This place was just okay.\n\nTheir drink options/toppings are offered in preset combinations. You can always ask to leave something out, but it kind of sucks you'll end up paying the same price if you only want the tea and no extra add-ons. I ordered the Oolong Crema, which comes with coffee jelly and boba in it. The coffee jelly sounded a little strange to me, but I figured I might as well try it since it was included in the cost. Mistake. It did not go well with the tea and I found myself trying to avoid it the entire time I was drinking it. The tea itself was good and the glass bottle is cute and comes with a lid.\n\nOverall, nothing particularly spectacular or offensive, but wouldn't go out of my way to try this place.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "I'm a sucker for boba shops with cute jars/bottles. When I saw that e tea had a glass bottle, I knew I had to come. I was a bit weary at first since it didn't have as many reviews as other nearby boba shops, but I'm so glad I swung by. I got the Mango Sago with boba and it was super delicious. It was almost on par with I-Tea's mango sago (just wish they had more mango chunks!). My boyfriend, who rarely likes my boba drinks, loved it! \n\nI would definitely come back if I'm in the area :)", "author": "Angela W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "Got the black milk tea with boba. A tad bit too sweet but the flavor was good. A lot of tea taste and the boba was perfect!\n\nAlso, kinda looks just like sharetea.... both the interior and the cups...", "author": "Janet K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "Highlights\n- It's in the same space as Super Pan and you can order their drinks if you dine in the restaurant. \n- A nice variety of drinks including various ice cream flavored drinks, espresso (they have a fancy looking machine), smoothies, Yakult flavored drinks, Crema, and an almond taro milk tea. I'm not a fan of taro, but they were willing to customize to exclude the taro for me. \n- Strawberry fruit green tea: bright red color tea like fruit punch topped with fresh strawberries. Tasted pretty good, not too sweet, and you can taste the tea flavor. I liked that you can choose from various teas. \n- They offer various flavors of puddings and toppings.  \n\nImprovements\n- I didn't see any option to customize sweetness or ice level. \n- No FiveStars frequent buyer system as of yet. \n- Milk tea with boba: tasted pretty standard, nothing special here. The boba texture was soft and chewy with honey flavor, pretty good. \n- No seating, just a little waiting area with a few chairs for the restaurant. \n\nTip\n- Metered street parking or neighborhood streets for free.", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "My sister and I were looking for dessert after hitting up Volcano Kitchen, and what better way to quench the fire in our mouths than milk tea? We literally stood in between Sharetea and this new place, vacillating between the two options before deciding to try something new. E-tea is located in the same building as Super Pan.\n\nRating Breakdown:\n\n1.5/2 Stars for Taste --\nWe ordered the taro drink and the coconut drink. The taro drink was pretty good, with thick chunks of real taro and chewy boba. The boba was clearly fresh, so good! The drink itself tasted like fake taro, but some people are into that. The coconut drink tasted like shampoo smells....but in a pleasant way? The milk drinks were blended with ice, but so smoothly that they were not quite the consistency of a slushy. Both drinks were a little too sweet and I didn't see any options to cut down on sugar.  \n\nIn essence, this place is good for those diabetes-inducing drinks. It was late so I didn't want to order anything with caffeine, but I would come back and try something sort of milk tea to better judge this place. \n\n0.5/1 Stars for Value --\nThe drinks start at around $4.50, which is steep in my opinion. However, after traipsing over to Sharetea, the prices are actually around the same, considering that Sharetea charges $.55 for each additional topping while E-Tea currently offers a free upgrade to Super size (32oz) and has two toppings built into each drink. I also saw tea-spressos for around $5.35, which seems utterly ridiculous. I guess the price of the glass bottle is built into the cost, but I don't need a glass bottle. If you get the free size upgrade, you don't get a nice glass bottle to keep.\n\n0.5/1 Stars for Customer Service --\nThe cashiers were super helpful and patient while my sister and I were deliberating over drinks. They answered our questions and gave suggestions. However, the drinks took a good 20 minutes to come out. We weren't in a hurry and didn't mind, but I can see how this could seriously irk people.\n\nBonus star because I might come back the next time I'm craving a taro slush. I would even want to try one of their tea drinks but only if that free size upgrade is still available.\n\nTL;DR: Pricier boba but comparable cost to Sharetea with the free upgrade and built-in toppings. On the sweeter side.", "author": "Abby W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "I bought the taro milk tea with boba. Absolutely delicious, and the size of the cup was very generous.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "The first time I came here, I got the mango sago with boba. This was when they didn't have the cup option, so I received their cute bottle which I still have! The mango sago was delicious - I would stay it's a tie between I-Tea's mango sago.\n\nThe second time, I got mango sago again but in their cup this time. The 24oz cup is more than I'm used to, but I managed to finish my drink besides some leftover mango chunks and boba! The shop next door charges as much as my mango sago and their oz is less. \n\nPlus, E Tea has a lot of drink options that already come with toppings at no extra cost. I am not sure if they charge for extra toppings - I saw a sheet on the counter with a variety of other toppings, but didn't catch a price. I feel like you get more for smaller price here than the one next door.\n\nI also like the variety of different drinks they have. My sis got the Winnie the Pooh one and she said it was really good. And the time we went, there was only one person making drinks (and maybe cooking food too??) for several other customers before us. So shout-out to her for not rushing our order and taking time to make our drinks.", "author": "Krystal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "Most everyone's reviews said they received complimentary popcorn chicken with 1 purchase of milk tea; I stepped in today, ordered a black sesame milk tea, but wasn't offered the said promo.  Aside from that, the cashier and employees were nice and informative of their menu.   Noticing the majority of the drinks included toppings, I inquired whether any toppings can be substituted.  \"Yes\", the cashier said.  Good to know in case you preferred your favorite topping instead of the already included one(s).  \n\nBoba: Black sesame milk tea.  It's definitely unique and tasty.  Like another reviewer commented, the drink tastes like a Chinese black sesame paste dessert.  The boba was good: soft & chewy, the way I like it.  Unlike other places that have squared-bottom bottles, the product comes in a glass bottle with a round bottom so it fits nicely in a cup holder.  One quibble is that 1/8\" of the straw peeks just over the lip of the bottle, making it a little challenging for drinkers to enjoy their beverage, unless one completely avoids the straw.  Other than that, I will make a return trip to try other flavors.  Hmm, I wonder if there's any discount for reusing the bottle?", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-17", "description": "This is a little boba bar that shares a business space with a Super Pan, a restaurant where you get a hot skillet and cook food on it. It's kind of awkwardly placed, as you have to walk through E Tea to get to Super Pan. This creates a huge crowd in the E Tea space, waiting for their boba and/or waiting to get seated at Super Pan. As for the drinks at E Tea, my oolong milk tea with lychee jelly was good, but watching them make it was kind of disgusting. They use a very thick cream that settles on the top of the boba cup, even after they shake it up before giving it to you. They made our orders wrong by reversing the add-ins, so they remade mine and my fiance left his as is. They only have 20 oz and 24 oz sizes, and their add-ins menu is only available at the register, as far as I could tell. They have most of their other menu items posted around. I would go back, but I would not order a milk tea, since the cream was pretty gross looking and tasted a bit too rich.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Etea is a small tea place located inside Superpan. I think they're fairly new since I don't recall a milk tea bar last time I came to super pan. I was pretty full from lunch so I just ordered the lemon water infusion and got a cute glass bottle with a cow :) These bottles remind me of the ones plentea use to give out. Be careful they're not meant for hot beverages! If you don't want the glass bottle you can just get a drink in a plastic cup for a few quarters cheaper.", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "If you want the souvenir bottle come here, it was OK. The drinks weren't special, I would rather go to teaway for more flavor. Their bottled drinks unfortunately do not have a straw insert so grab extra napkins because they will over spill it. \nI got the mango sago, which tasted artificial rather than fresh, but if you want dat true true mango just go to golden island on Noriega", "author": "Camille B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "E Tea balling as we speak! Brand new spot that opened inside the SuperPan restaurant. This seems to be a theme around here:\n\nChinese restaurant opens in The Richmond. Someone notices an extra 10 square feet in the corner. \"Let's turn it into a boba shop!!!\"\n\nAnd so it was.\n\nPretty good rose crema, I must say. Also, I got a few scant pieces of popcorn chicken on their grand opening. \n\nThis definitely seems like a step above your run-of-the-mill boba establishment. Too bad there's nowhere to sit. I'll be back regardless. Their selection looks pretty good.", "author": "Aren A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-23", "description": "i was in the area and decided to come here based on the reviews. unfortunately, my mother and i were very disappointed.\n\nwe both got the peach oolong milk tea with boba. the boba was alright but the tea was (not to sound harsh, but terrible). the tea and whatever they used as a creamer was completely separated and the milk tasted sour (and almost spoiled). the tea part was extremely watery as well.\n\ni work making milk tea and know that the creamer should NOT taste that sour. maybe we just got unlucky with our drinks and i'm sure the brewed teas/fruit teas would be fine, but i would strongly advise you not to get a fruit milk tea unless you want a separated, frothy and watery drink.", "author": "Mira D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "We were in the area for dim sum and randomly stumbled upon E Tea on their grand opening day a few weeks ago. They were offering free popcorn chicken with purchase of a drink at the time, and being a sucker for both new boba places and free food, I couldn't resist going in. The space is small though shared with another business to the left (I'm not familiar with the area so I didn't really pay attention).\n\nI got a roasted milk tea with boba and grass jelly (they were out of pudding), and was satisfied with the prominence of tea flavor. It was barely sweetened at 25% but that was fine with me. Good chew to the boba, though not overly so. Popcorn chicken was seasoned and crispy.\n\nI think it's a pretty solid boba drink shop, great if you're in the area and looking to quench your thirst and don't feel like going to the ShareTea one or two doors down. Prices are a tad more expensive but I think it's an up charge for the glass bottles you get to keep. They're cute but I'm not really sure what the average Joe is going to do with them. A return deposit would be nice for both the consumer and environment. I'll find a way to repurpose it...", "author": "Pauline D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-07", "description": "First time came here, the mango sago is really good... however, u better be careful when u order the drinks in bottle. Some sort of glasses was slough off from the bottle and dropped into my drink... which cut my tongue/_\\||", "author": "Ivan Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-16", "description": "Kinda awkward place being located inside the front area of an established restaurant. Menu is not that extensive but has the more common items one should expect from a bubble tea place. Ordered an oolong bubble tea and Taro coconut with Sago. The taro tasted a bit bland with the coconut flavor being mellow. I personally like strong taro and coconut flavors. The oolong was refreshing but again the flavor was on the mellow side.\n\nThe place is fairly new so for now it looks clean and service was adequate nothing exceptional. The prices are in line with other bubble tea places so it's not the cheapest nor the most expensive.\n\nFor more menu option I would go to the bubble tea place right next door! But if next door place has long lines or is closed then this place is not the worst place place to go for some simple bubble tea.", "author": "Blue G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Fun fact about me: I LOVE mangoes.  Not as much as a student I once knew who would eat a mango, skin and all, like and apple.  As I watched him biting the mango, I'm like \"Hey, don't you want to peel the skin off before eating that\"?  He continues to eat the mango with his eyes locked with mine as if I'm going to attack him for his mango.  \n\nThe Mango Sago is DELISH.  Often times, the toppings can be over cooked or under cooked but everything here was fresh.  From the sago to the mango to the lychee bits to the drink, it was a wonderful treat.  I saved half the bottle for the next day and it still tasted good.  This place will be my go-to for Mango Sago.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Haven't tried the food, but their roasted oolong with creama and boba is good. You can also get a discount on an upgrade for checking in (no review needed). Solid option! I'll try their snacks next time.\n\nWorth checking out if you're in the area.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-13", "description": "Cons:\n- Hokkaido milk tea doesn't have strong enough tea taste.\n- Chrysanthemum tea tastes like green tea\n- The plastic cup looks weird and elongated\n- Egg pudding is firm\n\nPros:\n- Great customer service\n- Boba is good", "author": "Karen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-08", "description": "This is by far one of the better boba places in the Bay Area. By no means I'm a boba connoisseur but my wife needs her boba fix at least twice a week so I can't help by try sometimes. I can honestly say I've tried just about every single boba spot in the Bay Area with exception of a few that's just obviously not worth trying. \n\nMy go-to drink here is the Mango Sago with boba. It's been the same every single time I've ordered it, which is HUGE for me. When I'm actually craving for something, I actually need it be just how I like it. They don't have all the fancy blenders or mixing techniques but my drink always comes out just right.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-15", "description": "The boba here is not very good. My cousins got the regular milk tea and the coffee milk tea ($4.50) but both were super watery and not tasty at all. At least it comes in a glass cup and so my cousin is going to keep it and use it as a vase. There are much better boba places in the city, including TeaOne (former Sharetea) next door.", "author": "Cicely T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-15", "description": "If you like super watered down milk tea, mushy boba and slow, unfriendly service, then you've found your place! Had 1 sip of my house milk tea and had to throw it out :/ Maybe their other drinks are better and maybe the staff was having an off day. Maybe.", "author": "Maria Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "I got the honey lemon tea from etea today and it was amazing!! The bobaristas were really helpful and friendly! two thumbs up! I will definitely be returning for more!", "author": "Jose R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-07", "description": "Terrible burnt tea taste, terrible service, we had a group of 4 and the person ordering rolled her eyes at us for not ordering any toppings", "author": "Sandra C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-09", "description": "How hard is it to make a drink? From time if order to I finally hold the drink at hand took about 10min and I was the only customer at the time. They need to train their employee better. Other than that place is awesome! Great flavor and great choices on tapioca drinks!", "author": "William C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "I enjoyed the iced house black milk tea, 50% sweet, with a light serving of lychee jelly. Strong tea flavor, and the slim plastic cup was oddly satisfying to drink out of! Haha much more convenient to carry around than the chubby cups.", "author": "Drea P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-17", "description": "I got the princess rose tea crema with lychee jelly. The drink was tasty and the gradient is so pretty to look at!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-23", "description": "Their service is very bad. I spilled a drink and they didn't make me a new one and wanted me to pay. After that I don't want your drink anymore with that service nice job. Yes, it was partly my fault I spilled it . But when she handed to me I looked back and grabbed it but there was a handle there and it knocked the drink out of my hand. There's something called customer service, learn what it is. It was over 5$ LOL. If this was tpumps they would have made me a new drink without charge. Oh I also heard there's mosquitoes in the drink lmao. Lesson learned never come here again unless you like bad service.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "We are obsessed with this place. This is now my go to boba shop even though I live in Walnut Creek. In fact I'm moving to SF just so I can live walking distance here.\n\nOrdered #3 and #7. Substitute #7 for grass jelly its life. If you are super healthy they have organic milk substitute for 5 cents.\n\nYou get to keep the glass trendy bottle!!! \n\nDear Biz owner,\nIf we purchase and keep 10 bottles to recycle back can we get a boba for free as a rewards card? I think you should do this. Save the planet and save my wallet.\n\nThanks,\nJoyful", "author": "Joy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "I fell in love with this place! The drinks were super! I am only visiting SF but I would move here for this place! The matcha milk tea was what I ordered and I loved it!!!!!! Come check this place out! It is a must try!", "author": "Andy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-21", "description": "Wow. Asian spiked hair guy is super unprofessional and has been bitching loudly at all the other workers due to the fact that he needed to clean this am bc someone left the shop unorganized. In addition, he's super passive aggressive to his other coworkers. Man, if you're unhappy about your job than leave, you don't need to be mean to your poor coworkers. I felt bad seeing the poor girl trying to hold back her tears. \n\n\nI don't care how good your stuff is, but your immature behavior should not be encouraged. If you've experienced having a bad boss before and hated poor treatment, then don't come here; if you do, you're just promoting a hostile work environment.", "author": "Mo W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-01", "description": "Nope. Nope. Nope. \nThis is remarkably bad boba. I got the Lavender flavor and it tasted like dirty water mixed with milk.", "author": "Sona A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "I had the number 15 (I think it's just fresh taro) with boba. Hands down the best taro milk tea I've had! Please come to Los Angeles, I heart you E Tea!", "author": "YJ H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-28", "description": "This place is a very interesting concept, and by \"interesting\" I mean weird. \n\nFirst of all, it shares a space with Super Pan, which is very smart. I don't think I've seen Super Pan packed so the use of the space on the right was a good move. It's the same owner and if you decide to dine at Super Pan, you can order a drink on the same bill (unlike Bottle Zup & Shabu House on Clement). This is the third boba spot in this area... Sharetea and InfiniTea share the same block. \n\nE Tea offers drinks in the bottle, just like Plentea and Bottles Zup. The only difference is that you do NOT get a discount for bringing it back. You simply get the bottle to keep... so if you're a huge fan of this place, you could rack up a good number of these bottles. The weird part is that if you opt out of the bottle, you get the typical plastic container cup. However, the size of this plastic cup is the size of Purple Kow's Super. Yet both drinks, regardless of size, are the same price. I'm pretty sure the bottle vs cup size has a noticeable difference in ounces. Drink prices range from $4.50 to $6.50 (Durian smoothie). \n\nThe customer service is very nice. They had misunderstood one of our drinks and gave us the mistake drink along with the correct drink. \n\nI got the earl grey fresh espresso... which is a tricky name as it does not contain coffee. It's different from other drinks and the creama ratio isn't perfected. It's good but the combination with Coffee Jelly and Boba don't particularly work. The boba is surprisingly good though, very soft and chewy. \n\nI think I'll come back and try one of their milk tea drinks. The creama drinks in the bigger cup probably threw off their ratio.", "author": "Jeannie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "I got the matcha milk tea and my husband got classic milk tea. The tea is good but I'm not such a big fan of the toppings in my matcha (red bean and pudding). I LOVE red bean usually. Love love love anything red bean and matcha so you can imagine how I'm a bit disappointed with it. I'll definitely come back and try some of their other toppings and drinks though. I think they are better than many of the nearby tea places. \n\nThey also use reusable glass containers with lids that suction well to the top. \n\nOverall, they are good and will probably be a local go-to for me but I will still try some of their other drinks before making a final conclusion.", "author": "Andy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-28", "description": "I read so many good reviews about this place and was excited to try it out with my girls, let me tell u this place just tastes like watered down sugar water. I got the dark roasted oolong sea crema and told the cashier only boba and she adds coffee jelly.... wth -_- anyways when I tried it, I hated it so much. Plus the workers looks like they hate their jobs. Hope they step up their boba game", "author": "Apple V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Wow! The Hokkaido Milk Tea is amazing! It tastes like a twist of caramel and coffee inside. It comes with boba, coffee jelly, and your choice of pudding. I chose almond pudding. \n\nMy boyfriend got the honey lemon tea with aloe vera, I almost drank all his because it was so refreshing. \n\nI recommend this place! Will be back.", "author": "Ritney N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Fantastic. Mostly because they have nice combinations, and they serve their teas practically without ice. \nPlus they serve all the teas in cute glass bottles. \nAnd they are nice people. \nI used to go all the time two doors down. \nNow E Tea is my favorite. \nRoe tea amazing. Coconut paradise excellent (go home and add a shot of rum for a total paradise)", "author": "Bruno S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "E Tea is located inside Super Pan.  I ordered Princess Rose Creama and it was the best creama I ever had :D The drink was very tasty. It does not come with ice. The lady was super nice when I asked for ice.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-25", "description": "Got classic milk tea. They gave me pearls instead of coconut jelly and it wasn't shaken enough. I was in a rush so it wasn't worth it to complain. You get what you pay for", "author": "Joy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Currently my fave boba spot. Nothing is better than that fresh taro. NOTHING. I do wish the glass bottles were bigger because I can chug this in like a minute.", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "The drink is refreshing. The Jasmine Green Tea is brew tea; not powder. Other drinks are good too!", "author": "Austin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "This boba place is in a small room that connects to the Super Pan restaurant. It's basically a mini bar that can only fit one person behind the counter. The price is about $1 more expensive than other boba places, but at least you get a glass bottle to take home. They only have plastic caps for it though.\n\nI ordered the #7 Fresh Taro King with fresh taro chunks and boba. It wasn't overly sweet and the taro bits made a great addition to the drink.", "author": "Vans C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-07", "description": "Terrible water taste tea. Terrible powder-like creama with no taste at all. Super bad service with beach face.", "author": "Rex L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "Friendly service, the guy helping me was very helpful, which is a stark contrast to the usual unhappy faces that utter no welcome to you as you order boba. \n\nChecked in for yelp for a larger cup, although semi wanted the smaller glass bottle, since its an adorable cow on the front. I do see how it might be a bit annoying to pay a higher amount for boba just for the glass bottle. \n\nOrdered the oolong with cream and coffee jelly. Would prefer not having coffee in a tea drink, tasted a bit odd. Also remember to shake the drink before putting in the straw so the cream and drink mix together, instead of desperately stirring with the straw to mix it. \n\nWould love to try the mango sago next.", "author": "Braden H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Good taro milk, great service but wish they had more seating or made a deal with the restaurant in the same space to use their seating during off-hours when the restaurant would have less business. The restaurant wanted everyone to buy an entree which is too much given that you often have bubble tea after a meal.", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "I ordered a rose tea with creme and litchi jelly and my bf tried their coconut mango sago with litchi jelly.  Mine was great and not too sweet but the mango was too sweet!  Maybe they squirted more syrup than they should have?  Anyway, we both enjoyed my rose tea and gave his tea to his son who loves things extra sweet.", "author": "A. C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-19", "description": "Honestly just stumbled upon this place and have never heard anything about it or read any reviews. I came in with a friend and we both ordered their \"Fresh Taro King\" which took some time to get both drinks out since they forgot to make the second one.  My drink did not \"wow\" me and I complained quite a bit that I didn't want to finish the drink.  I know that there was a problem because the other cup my friend had tasted better.  This inconsistency was off putting and made me wonder where the disconnect was.  Unfortunately we had already started driving away from the establishment before we had tried tasting it and when we tasted it, I almost had half a mind to turn around while crossing Lincoln Ave towards the Sunset District to complain or ask for another one.  I had ordered their 24oz cup and I probably drank 1/8 of it and wanted to throw it away. What a waste and disappointment.  Suffice to say, this was not a good first impression and I don't plan on going back here again.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "After going to TeaOne next door, which is disgusting by the way, we moved next door to see how ETea was in comparison. My boyfriend and I ordered a regular milk tea in the cow bottle and popcorn chicken. Since we came near closing time, they were nice enough to give us an extra milk tea because the restaurant was closing. Service was great and the popcorn chicken was delicious.", "author": "Terri H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "My husband and I came to nearby Japanese restaurant to celebrate Valentine's Day and our anniversary. after dinner, we wanted to get a boba drink. I yelped and found few spots, but decided to try E-tea instead. I am glad I did! Adrian , you are awesome !!! Thanks to your wonderful customer service! I ordered 4 drinks ( the blk sesame drink is too good to be true!!) and Adrian gave my husband a non sweet tea for free, too! \nThis will be the place I will come back and visit again when I come to SF. \nWhat a way to end my day. thank you Etea!", "author": "Lucia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-29", "description": "Was taking a walk to digest a little after a dinner nearby when I cam across this place. Decided to give it a try as I'm always in the search for tasty drinks and was hoping to create a new list to recommend to friends when they tell me they want a milk tea or boba drink. I ordered their taro drink \"fresh taro king\". I have had a lot of bad experiences with other location making this drink with just powder with the resulting drink tasking bland and with a powdery texture. The drink from this place, however, actually contain taro bits! The drink itself wasn't overly sweet and has plenty of the sweet taro aroma. All I can say is, I liked it. I wouldn't be going out of my way to get this (I just don't do that for any boba drink in general), but I will keep this place in mind the next time I'm in the area.", "author": "Alan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "After dinner I was craving some tea, we stumbled upon this place just by looking along the street. Despite having a shortage of tea I eventually ordered something I'd end up really liking. I ordered the almond queen. I got it in a glass bottle which is pretty cool. The drink tasted great and this may be one of my new favorite spots to get Boba", "author": "Rommel A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-07", "description": "Arguably the worst tasting milk tea I have ever had, along with terrible customer service. Not sure how this place has 4 star rating prior to us visiting.", "author": "Frank W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "I like how they have variety of milk tea and it's not too sweet! And they also have a choice of plastic bottle and glass one!", "author": "Toshio T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "I went to E Tea, about a week ago. My friend and I ordered our drinks and the wait for the tea was about 5-10 minutes. The tea itself was delicious, creamy, and sweet. The pricing is pretty normal for boba. The boba itself was decent, not exceptional or my favorite. The staff are extremely kind and friendly. Definitely not my favorite boba place in San Francisco, but in the top 3, no doubt. I would have rated E tea higher if it did not take so long to get our drinks, we were the only customers, at the location at the time.", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-24", "description": "I drink milk tea a lot and I've tried almost every boba place in the area. This is by far the worst milk tea I've had in my life! The milk tea tasted burnt and watered down...I had to throw it away and wasted $4.", "author": "Sylvia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-25", "description": "I had high expectations for this place but ended up being disappointed. I walked in and there was no line and the person ringing me up just looked at me and didn't greet me at all. But I was like whatever I'm just go ahead and gonna order my drinks. I ordered a house milk tea with boba and it had a strong bitter taste. I didn't taste anything sweet in it. The boba was okay though. I'll return if this place improves their drinks.", "author": "Cee H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-11", "description": "Got the Winnie the Pooh drink and its was okay.. interesting flavor combination. The boba was fine too.", "author": "Trisha L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-03", "description": "Their passion fruit tea is horrible. . . Taste like water, first time had a passion fruit tea that has no seeds in it, can't believe.", "author": "Catherine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Fast service and good price for San Francisco. I accidentally misordered and they were super kind to replace it for me with no cost. I loved the customer service displayed there. They also had some great flavors, and my coffee milk tea was excellent.", "author": "Kryzak K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "I came here after hearing that it was newly open right next to Sharetea and I have to say it is not bad. The drinks for the most part range from $4.50-$5.25 or so and right now they are doing a promotion which they give you free popcorn chicken with purchase. It is a very limited selection of drinks but you can choose between milk tea, green/black tea, and fruit teas. They give you a small bag of popcorn chicken and even though it wasn't freshly made and cold it was actually not bad. Hope that actually gets added on their menu because I didn't see it anywhere on there. The drink itself was not bad we had the Princess Rose Tea Crema and I liked its flavor and it comes in a glass bottle similar to Plentea! Only difference is it is a round bottle on the bottom so it fits into your cup holder.", "author": "Angela S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "They also recently converted half the restaurant to E Tea, which has freshly brewed, creative boba drinks. I say creative because they do more toppings than just boba. I asked the barista what was most popular (because they know what's best), and I ended up with the princess rose tea crema with lychee jelly, light sweet. It was nothing like I've tried before, sweet, light, and refreshing. Not to mention, it came in a glass bottle! It's a quality bottle too with a secure cap, and the design was printed onto the bottle, not placed on a sticker and then on the bottle, like I've seen at other places. I'll definitely be reusing the bottle on regular occasions. Sharetea better watch itself, they got good competition ;)", "author": "Alice H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-20", "description": "$4.50 for a house milk tea that tastes like water. No thanks. I'll go back to Sharetea next door.", "author": "Kurtis L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-01", "description": "I went into Super Pan and noticed that this store  was officially opened so I decided to give it a shot and got the Hokkaido milk tea with no topping. It wasn't sweet, taste super bland, lastly it taste like a regular cup of milk tea. Super disappointing!", "author": "Tina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "love the food and drinks here.  customer service is excellent.  i've been here twice now.  once last week and also today.\n\n1st visit, my lady and i had meals and drinks.\ngreat service here.  and food was very tasty.\ni liked their novel eating format with the piping hot cast iron pan.  we really enjoyed the experience.\n\n2nd visit, just took away two drinks.  but when i got home, i realized one drink was missing boba which i had ordered. so i called in and shared my predicament and they were very accommodating.  they resolved to make me a new drink which demonstrated great customer service and good faith.  i thanked them heartily.  the drinks were delicious: hokkaido, lychee smoothie, and mango sago.\n\ni enthusiastically recommend this place.  everyone is very nice and the products are excellent.\n\nthanks guys! b u", "author": "Brad U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-06", "description": "This is like Starbucks for tea!  If your a tea drink lover, you have to try this place!", "author": "Carol G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "Had to give it four stars. Dined in super pan had a peach black tea. Loved that it had real peaches in it. Great that you can dine in superman n have boba too a plus for me.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-25", "description": "I would rate them 1 star, but since they open recently I'll just give them an extra star so they can look better. Ordered a \"House Milk Tea,\"it came out nothing like a milktea. Super water down & taste like straight up tea. The boba was not chewy, probably because it have been sitting there ever since the morning and I came in at night. Next time go Sharetea instead, since it's just next door.", "author": "Irene D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "I was just in SF this weekend from LA and my brother goes here all the time so I finally had to stop by and give it a try! First of all, yay for the glass jars!! I love when people go the extra mile and add a little something that excites customers and brings them back! Aside from that, their drinks are amazing! We got the mango smoothie with boba, and the princess rose tea with lychee jelly. So delicious! If you're in the area and you can stop by, definitely do that! I don't know that you would find the flavors that they offer anywhere else! I will definitely be back!!", "author": "Sapna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "E Tea! Another tea boba shop! I believe San Francisco is inundated with boba shops, from Quickly, Infinitea, Sharetea, Boba Guys, BottleZup, PurpleCow, and what else... And now E Tea! \nThe menu is bright, colorful fruit decorations all \nover it.. So many choices, different from the other tea shops.. Hokkaido milk tea, Sa Wa Di Ka Thai iced tea, Princess Rose tea Creama with lychee jelly, all very interesting. Today I tried a Matcha milk tea with red beans, and add vanilla ice cream. Dessert in a bottle!! And did I mention the bottle has a cute cow logo on it?? \nThere is no charge for supersize it to 32 oz, the drink then comes in a plastic cup instead of the bottle with the cute cow logo. \nE Tea, my new to go to milk tea place...", "author": "lovetoeat a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-17", "description": "Milk black  tea comes with boba for 3.99 total. Sweetness and ice can be customized. Good size of milk tea and the container has a cute cow logo. Kitchen closed at 9pm. Restroom available. Combination of fast-casual restaurant and tea cafe. I'd go again.", "author": "South B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "One of my favorite boba places to go to. A bit on the expensive side, but that's because you pay for the glass jar. Free upgrade from jar to super size with a check-in on Facebook or Yelp. I've had the black sesame milk tea, chrysanthemum honey tea, fresh taro King and the roasted oolong creama. All were very good in different ways. The boba and toppings so far have been consistently good.", "author": "Josquin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-15", "description": "Good selection of fruit teas.  The glass container is a great keepsake.    The front staff is friendly and courteous.", "author": "Tap T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "super cute store! near a restaurant so if yall are hungry just hop over. get their MANGO SAGO SO DELICIOUS SO GOOD!!!", "author": "Ngan V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-01", "description": "This was my first time here and yes the customer service was great at first but now I take that back. I ordered a dark roasted oolong crema with no toppings and they made it with a lot of toppings. I think it may have been the Asian lady who came in to help half way when the guy was making my order. Instead of looking at what the order said and was special request was made, she just made it. I didn't realize it at the time. I'm disappointed in my experience. They get a 2 star because the milk tea was decent. I don't know about coming back. It is expensive and you are just pretty much paying for the glass.", "author": "Mirgan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-27", "description": "This is a great place to get drinks. Nice services. I will definitely come back. I referred a lot of friends to this place", "author": "Phung T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "Great, friendly service, especially from the cashier Sonia.  Have came here numerous times, and the drinks are delicious, especially the chrysanthemum tea, light and fresh tasting.  This place is highly recommended!!  Also, check out the restaurant Super Pan.  Really delicious and affordable.", "author": "Maria L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "I had the matcha milk tea with red beans and pudding. Tastes better than share tea and I love the bottle to take home! Highly recommend!", "author": "Carlos F."}
