{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "I've been wanting to try out this taco truck for a while now and finally had the chance. They only open on weekdays as of right now, but hopefully they will eventually do weekends! I got here on a Monday afternoon and there were a good amount of customers. I'm not sure how much the other menu items were but the tacos were $2.50 each! \n\nI ordered the Steak, Carnitas, Chicharron, Lengua, Cabeza and Al-Pastor tacos. The lady asked if I wanted everything on it and I said yes. I enjoyed all of them, but the Steak and Carnitas stood out to me. The Steak had great flavor and the Carnitas was nice and crispy. The pickled jalapeños also went really well with the tacos. There isn't much seating but they have one table that seats about 5-6 people. \n\nThe ladies working were really nice and they spoke good English. I will definitely come back to try their grilled chicken tacos.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "I can't believe it took me so long to realize that this random food truck parked near my house has great tacos! And they're super cheap.\n\nTHE WAIT: None on a Thursday around 12:30pm. They were busy but there was room for two of us at the communal table they have set up. \n\nTHE FOOD: \nThey do load up their tacos with salsa and the red one is pretty spicy. Next time I'll get it on the side, to have more control over the spice & flavor. \n\n* Carnitas taco - 4.5 stars\nThis meat had a nice crisp!\n\n* Al pastor taco - 3.5 stars\nThe red salsa was pretty spicy. The meat was cut into thick, small pieces - it could've use more char/crisp.\n\n* Lengua - 4 stars\nThis was full of good soft meat. The green salsa they put on top less flavorful.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "If El Gallo was in a more frequented location and was open later than 6pm + on the weekends, I can already see it's popularity skyrocket. It's a no frills taco truck that specializes in putting pork and beef on top of or within tortillas or any of its carb-cousins. \n\nGo for the tacos. At $2.50 a pop, they're actually GREAT bang for buck because of the amount of meat that's loaded on top. Between the al pastor (spicy pork) and asada (steak), I especially enjoyed the asada although I'd recommend both.\n\nThere's no condiments available outside the truck so when you order, be sure to specify that you want all the toppings as well as onions, cilantro, etc. \n\nMost people take orders to-go, but there's a small table with 5-6 chairs if you can't wait to devour your tacos. No issues with empty seats cause tacos are pretty quick to eat and it's not really a place to lounge and chill. \n\nThe ladies who work here are so friendly and nice! They also speak good English so language is not an issue.", "author": "Sally L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "$2.50 per taco.\n\nI don't know if you think that $2.50 per taco is cheap, but it is for me.\nwe are in San Francisco, not Mexico City or Guadalajara or .. San Luis Potosi. \ntacos here are not the best I've had in the city, but they're certainly some of the cheapest and it right in the middle of the Mission. \nit's a food truck where you don't see the cooking, and you will have to ask for the salsa because they don't put them out on display.\nbut even without salsa, they're delicious and satisfying already.\n\ntoday I ordered 6 tacos.\nCarne Asada / Grilled Steak (6/10)\nCarnitas / Crispy Shredded Pork (7/10)\nLengua / Beef Tongue (8.5/10)\nCabeza / Beef Head (8/10)\nChicharron / Pork Skin (9/10)\nAl Pastor / Spicy Marinated Pork (7/10)\n\nTotal Cost : $15.00\n\nmy tip: ask for \"Chile Toreados\" for your condiment (grilled charred Jalapeños)\nthey will bring up those tacos to another level.", "author": "Rudy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "Nestled several long blocks off of the 24th street Bart station you will find El Gallo Giro.\n\nI only had two tacos the carnitas tacos and al pastor and they were both delicious.\n\nTacos are $2.50 a pop .\n\nAsk for a lemon and they'll gladly provide you with a small wedge for extra flavor . \n\nBest tacos I've had so far in SF.\n\nThe world needs a San Francisco Taco ranking...so I'm here to provide my humble list/rankings. \n\nRanking explained:  #1 (listed at the top) is my favorite/ #?  (listed at the bottom) is my least favorite. \n\nWhen I look at reviews sometimes just want to know where to go or how a user compares one venue against another to see if we have similar tastes. If you're curious, I have rankings for Boba, Bakeries and Ramen , Chicken and Waffles as well (random right?)  Follow my profile to see my most recent reviews.  I hope I can be helpful since so many Yelpers have helped me discover new places.  \n\nRod's SF Taco Rankings:\n\n1 El Gallo Giro Taco truck\n2 Garajito\n3 Belmar La Gallinita Meat Market\n4 La Corneta\n5 Chisme\n6 El Norteno Taco Truck\n7 Taqueria Los Mayas \n8 Garaje\n9 Taqueria Vallarta\n10 Little Taqueria\n11 La Taqueria\n12 Taqueria Castillo\n13 El Farolito\n14 Pancho Villa Taqueria \n15 Taqueria el Buen Sabor\n16 Panuchos\n17 Taqueria Gudalajara\n18 La Palma Mexicatessen\n19 El Tonayense\n20 Tropisueno\n21 La Espiga de Oro\n22 Papito Hayes\n23 Tacos San Buena\n24 Los Compadres Taco Truck\n25 Cochinita Mayan Cuisine\n26 El Taco Loco\n27 Gordo Taqueria\n28 Nick's Crispy Tacos\n\nBelow is my top 10 for the Bay Area in case you were curious.\n1 El Gallo Giro Taco truck\n2 El Jaliciense\n3 Taqueria Sinaloa\n4 Garajito\n5 Belmar La Gallinita Meat Market\n6 Belly\n7 La Corneta\n8 Chisme\n9 El Norteno Taco Truck\n10 Taqueria Los Mayas", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Food - 5/5\nService - 5/5\n\nThree years and a ton of burrito spots later, this is still the best burrito in the Bay Area! They are the reason why I can never lose weight and my diet is always ruined lol. I don't know how many times I've been here but the quality has always remained unfaltering. I've never had a bad burrito here! Ya know, a burrito with meat only at the end, or rice all clumped in one section, etc. The burritos are mixed well so each bite has a little of everything. Not only is the quality of the food amazing, but the customer service as well. They're always smiling and genuinely happy. Anyway, I can only say so much, but you HAVE to try this place, you won't be disappointed. The only caveat is parking can be difficult, but it's well worth it! There's a table with a few chairs outside the truck where you can eat, or the park across the street. Al pastor super burrito with refried beans is da one!!!!", "author": "Cassie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "6 tacos for $14.50. \n\nI ordered tacos al pastor (favorite one, good flavor but no pineapple), beef tongue (very soft), and carnitas (wonderfully crispy and moist). He ordered two al pastor and one asada. They were surprisingly spicy! The tacos were bursting with meat and the lady in the truck was friendly. I'd come back!\n\nThey don't have prices listed. $2 Arizona teas.", "author": "Lily Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "Sometimes when I'm wandering around the Mission I see things that I've previously missed.\n\nLike this kicking good taco truck.\n\nI'm trying not to swear.\n\nSuper good tacos.\n\nBueno all the way!", "author": "Jack R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "If you know about mexican food, then you will know that this truck is making it right. If you don't know about mexican food, go here and learn what tacos are supposed to be like.\nMi gusta todos.\nMuchas gracias El Gallo Giro.", "author": "Dude Food G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Move over Taco Bell, there's a new jefe in town.\n\nGet the carnitas tacos and a Mexican coke. Heaven.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Crispy carnitas tacos was heaven in my mouth! I was so in love that I had to get a crispy carnitas quesadilla to go! All of their meats are very flavorful, the price is very reasonable, and the young lady who helped me out was super nice and sweet. This is definitely my go to taco place every time I'm in town!", "author": "Erin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Just moved to SF from San Diego and I was starting to think that I would never find proper Mexican food in SF. Good thing I found this truck because they serve legit tacos! Seriously just as good as I had when I was actually in Mexico. I was so impressed that I threw them a huge tip after basically inhaling all of my food.\n\nOrdered 1 pollo, 1 al pastor, 1 asada, and an orange soda; all bomb and it only cost me $11 total or something like that.", "author": "Ben K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "It was the most amazing tacos I've had in my life. Pure, down to earth food, from a street side truck joined to the local community. Nothing fancy. But still, every ingredient talking to each other to give you a wholesome experience.", "author": "Suket B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "this taco truck is the bomb! the tacos are better than la taqueria, and the seasoning is just right and one doesn't have to worry about the meat quality. Get the carne asada taco and be liberal on squeezing the lime juice which cuts through the grease on the taco.\n\n$2/taco - amazing value!!!\n\nalso the person working at the window, Stephanie, is super friendly and the sweetest person working at a food truck. She taught me some spanish phrases. \n\nCome here after 2pm to avoid the line. To get a good dose of this deliciousness, order 3 tacos for lunch!", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "My favorite Mexican place, 4 stars not 5 because they used to work on weekends, but not anymore!", "author": "Elena M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "This truck makes tasty tacos with a garnish of radishes and picked peppers. I got the carne asada and carnitas. Both were delicious!\n\nHappily, their hot sauce is spicy.  Tacos are made fresh, so there is a 5-10 minute wait. You can eat across the street where there is a nice park.", "author": "Sharon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Hands down, the best carnitas and lingua tacos in SF. I drive around the city all day for work and Wl Gallo Giro never disappoints. I had their shrimp cocktail last week...fantastic and refreshing. They do steady business but never seem to keep you waiting for your food for more than five minutes.", "author": "marjorie m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "For me, the carnitas have to be crispy. If this does not happen, I am left unsatisfied with a taco truck.\n\nGallo Giro has all of the elements of the taco right. Fat, Acid, Tortilla, Spice. Sort of like duh, but many places confuse this.\n\nReal tacos, for real Americans.", "author": "Auza A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Carnitas taco is the taco to get.  The pastor, asada, lingua, and cabrza are just ok. I would go back.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "This is my new favorite taco spot in SF and we have been searching the city for a few months.  Al pastor is great, crispy carnitas is amazing, really everything was very tasty, chicken and asada included.  Green sauce is great if u don't mind the extra kick.", "author": "Sergio M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Great Taco truck hidden on a side street in the mission area. Carna Asada burrito is defiantly yummy.", "author": "Moore H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "El Gallo Giro exemplifies the no-frills, down-to-earth concept of food trucks before Off the Grid gentrified it into over-priced fusiony weekly street food festivals for hipsters. \n\nMy only other taco truck experiences consist of one in Socal which had terrible health inspection ratings and staff that always seemed to be scowling at me; and another during senior week in college when there were hundreds of people trying to navigate the mass chaos of an ordering system without numbers or names. Sometimes you realize perks of being a grown-up in the real world, and you become less fond of undergrad days.\n\nYou can thus imagine my satisfaction with El Gallo Giro's delicious tacos served from a simple truck with fast and friendly service and prices at such a bargain that I forget I'm in SF. I got a taco plate with pollo, carne asada, and carnitas with everything. Toppings include cilantro, chopped onions, and spicy sauce with a garnish of pickled vegetables and a radish piece. It was a good balance of topping to filling to fresh soft tortilla (plus da veggies for bowel health and food porn). My favorite was the pollo: simple and perfect. The carne asada was good but I felt that it was not on part with the quality of the cuts at La Taqueria, and I found the carnitas quite dry and overcooked--not bad, but non-preferred for a pork belly addict like myself.\n\nI still can't believe that it's $2 per taco, with tax included. Mang..... $2 can't even get you a scoop of Humphry ice cream or a Dynamo donut. The epitome of SF problems, and SF solutions :D", "author": "Edna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "I ordered 6 Cabeza tacos and my wife had 4 of the Al Pastor tacos. These are the most filling 6 tacos Ive had in my life! The cabeza meat was very soft & tasty. The plate comes with radishes and jalapenos. I recommend eating the jalapeños with the cabeza tacos as the meat is not that spicy. The al pastor tacos had a nice spice to them, the radishes compliment that meat well. The tacos are filled to the edges with meat & toppings, but mostly ALL meat. Grab extra some napkins because things will spill out. An awesome bang for your buck taco truck. DEFINITELY recommended!", "author": "Sione M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "If you are looking for authentic tacos, this is the place for you! \nI've never had bad experiences here, service is always great. Wait time can be long if you come around lunch time, but the tacos are so good I never minded waiting. \nPersonal favorite is the spicy pork tacos with everything, squeeze some lime juice on it, hmmm, heaven!", "author": "Kin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "Great tacos and burritos. The crew is super friendly.", "author": "Elijah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-05", "description": "Good cuisine, stylish and cozy decoration, comfortable seats. Very nice to sit in the evening with friends.", "author": "Mya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "This review is only for the tacos: I am Mexican and grew up with taco stands from Mexico (plus I used to live in Los Angeles) so I have very high standards when it comes to authentic tacos. The carne asada tacos were excellent and definitely authentic, best I've had in san francisco thus far (and I have tried many of the over hyped spots).", "author": "Amanda A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "Good flavorful, authentic Mexican food. I had a torta al pastor, would recommend! Only downside is they close early, so plan for lunch or skip out of work early.  Really worth.", "author": "Karter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-30", "description": "Let's be honest. No matter how trendy the food truck scene is, you're still eating food from a make-shift kitchen on four wheels. Some trucks are decent, while others need to be hosed down by a hazmat team. On the rare occasion that you experience exceptional food from a truck, I dare say you must talk about it! \n\nFor $3.00 get your fill with the most tender, juicy, spicy asada taco your tastebuds could ever jump for joy for! That price includes the soda to wash it down. I mean exceptional!!! Finger liking wipe the plate with your fingers to get the juice kinda good!\n\nThere's one long table and a few chairs to sit and eat at. Or you could take it to the park across the way. Or walk and eat.  Whatever you want to do in any manner of way you like just grab one, or two, or three and enjoy.", "author": "Jaylena P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "I came here for the tacos initially and then kept coming back for the al pastor super burrito.\n\nThere are weeks I've come every other day just for the al pastor burritor...it's 2 blocks from my house and the flavor of the al pastor is just frikkin' phenemonal. This burrito is so good that I eat the left over remainders cold because I can't wait that long to bite into it again. At $7.50 per super burrito, I'm a happy gal.\n\nYes, it closes early at 6, but who cares. I get off work at 4 and always make it in time! Yippeee.\n\nBe warned though, their red salsa is ridiculously spicy. Go for the green.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Yay!  You made our day!  We came in from Sacramento for the day and so happy that we found you!  The best lunch in a long time!  We were going to go to Swan on Polk Street for lunch but we remembered about your food truck and so glad we did!", "author": "Y F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "So many amazing menu items I don't know where to start. Best carnitas burrito I've ever had anywhere on Earth. The crew are super friendly!", "author": "Lillian E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Best tacos in SF I've ever tasted!!! Definitely a go to spot. Will be back!\nThe lady there was so friendly and didn't mind even after we kept asking for extra limes and carrots! \nEl Gallo Giro is not stingy with the meat!!Juicy yes and full of flavor! Everything tasted very fresh! \nWe loved are tacos so much we had to take some too go!", "author": "Kimbre K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Super awesome. Very inexpensive,  high quality food,great service amazing tacos. Chicken tacos were amazing. Very simple concept, and right on the money. Simple and very tasty menu. I think this was the best tacos ever...", "author": "Leo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Their carne Asada is better than el faralito. The super burrito is about $8 but soooo worth it. So good. Always will go here if I'm in the mission & want some Mexican food. Cash only of course : )", "author": "La'Keisha J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Tacos, tacos, tacos. Pound for pound the best meal on the planet IMHO. Gallo Giro does it right. Tacos had lots of well seasoned meat (pastor y asada), salsa was perfect, lots of pickled jalapeños and carrots sprinkled on top. Good looking plate, right price, El Tonayense has a little competition...", "author": "Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "I started loving mexican food after visiting plices like El Galo Giro. I tried carnitas and it is such a tasty stuff!", "author": "Raven A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "Love coming here to enjoy the pollo, carnitas and carne asada tacos! I crave these tacos every time I'm in SF. A must go!", "author": "Brina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "Some of the BEST, BEST street tacos in San Francisco. They are usually there for lunch, I tried going afterwork and it was closed, they close by or before 6pm.", "author": "Dinora G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "You know about their tacos, so I'm here to rave about the burrito. The super burrito, to be exact. \n\nAll the meats I've tried have been delicious, but the burrito is an amazing vehicle to enjoy their slow cooked and marinaded meats. They layer on the melted cheese, and grill the tortilla just enough to make every bite perfect.\n\nThey people here are so nice, and it's across the street from a clean park that we go to eat at. Cash only, but worth a walk over if you're in the neighborhood.", "author": "Joey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-13", "description": "This is a perfect grab and go place, the tacos are pretty simple and decent but wasn't anything special in my opinion. Tacos are quite small but 4-5 is filling since they do give you a good portion of meat. I would try their burrito and order something if I pass by this truck again.", "author": "Luna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "Some of the best $2 tacos that you're going to get in the Mission. This place makes some hefty, loaded tacos with a nice garnish of picked peppers and radishes. I got the Carne Asada and the Carnitas. The Carne Asada was instant greatest taco hits material, and the Carnitas was no slouch either. \n\nTheir hot sauce brings the heat, so keep that in mind if you're a tender gringo. They make the tacos fresh so expect a 5-10 minute wait. Located just across the street from a nice park where you can eat your half dozen tacos and pass out from happiness.", "author": "Colin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "Read some reviews of what some people found to be the best tacos in the city. On one review this place was hands down the winner. So I decided to check them out one day while I was in the city.\n\nThe tacos here are the best I've ever had. They were so good in fact, I returned four more times duiring the week with various friends to have them check it out as well.\n\nNot only are the tacos delicious, service is always given with a smile. You would think that with tacos this good that there would be a mass of people lined up every time you go there, but there isn't. I usually arrive with just one person ahead of me in line. The customers here are steady, but I have never experienced a back up or long line.\n\nThe asada tacos are better than any person you've ever loved and the carnitas are better than any sex you've ever had. It's that good!\n\nThank goodness I'll be in the city tomorrow -- time for my El Gallo Giro fix.", "author": "Allyn E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Continues to be the best taco truck in San Francisco.", "author": "Jesse H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "**********REVIEW 300**********\n\nI attended an event at a art studio around the area and my stomach was empty! I was running on fumes and needed something to eat BADLY!\n\nI busted out my trusty Yelp app and found this food truck within walking distance from where I was. This truck was not one of those trendy food trucks, but more seasoned and established. I took a gander at the menu and went with a regular carne asada burrito. When I'm in doubt, I go for the carne asada. The service friendly and quick. Within a couple minutes, my order was ready.\n\nThe burrito was wrapped in foil and still maintained it's heat like it just came off the stove. In my brown bag where my burrito was served, chips and salsa was included in the bag. Oh yeah, and napkins too. The chips were nice and crunchy.  The burrito to me was not a regular burrito. It was more like a super burrito for a great price. It was about a foot long in length. The burrito was packed with a lot of tender and juicy carne asada, sour cream, refried beans, cheese, and seasoned rice. The salsa included in the bag paired wit the burrito very well. From the beginning and to the end of my meal, the carne asada never lacked at all.\n\nI'm glad I found this truck by accident. It saved me from chewing all my gum I had in my pocket!", "author": "Jay G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "I really love tacos.  Grew up in so cal (Riverside), and have also spent a bunch of time in LA, San Diego.  Very opinionated about tacos...  \n\nTo be honest, I haven't been blown away by any of the tacos I've had in San Francisco.  SF has the best burritos in the world, but the tacos just hadn't been living up to So Cal.  I've found most of them to be a bit on the bland side, kind of dry.    \n\nUntil.....\n\nThis place is so, so good.  Definitely lives up to any of the best taco trucks in so cal.  Super fairly priced (4 tacos + horchata was 10 bucks), wasn't a crazy line or anything.  There's a little table right outside. \n\nHere's the notes:\n\n- I got 4 tacos: asada, lengua, pastor, and carnitas; and horchata\n\n- They come with radishes, limes, and pickled jalapenos.  All of which I love.  I like to scoop the meat up with radishes at the end\n\n- Really meaty tacos.  They don't skimp on the meat.  Awesome.\n\n- Horchata was super good.  Not too cinnamony.  Perfect.  Can't imagine better.\n\n- Asada was incredibly good.  I've generally had a problem with asada being too dry, but this one was super tender, awesome.  Possibly the best asada taco I can remember having.\n\n- Pastor was incredibly good.  Definitely one of the best pastor tacos I've ever had.  Amazing.  Kind of spicy.  \n\n- Lengua also incredibly good.  I'm now realizing my review is getting kind of repetitive.  My biggest issue with some lengua is that it is a bit TOO sweet.  Not a problem here.  It was perfect and NOT too sweet, but it was still super tender like you want from lengua.  Really good.\n\n- Carnitas was the only taco that didn't quite live up for me :/  Carnitas is usually my favorite taco, but I would say it didn't actually match up to the other tacos for me.  While I like crunchy carnitas, I found this one to be a bit too hard to chew and perhaps slightly dry.  With that said, I think it might just been an off-day for the carnitas. I bet if I got it again it would be great.\n\nMy taco ranking was:\n1) Tied in first was the pastor and asada\n2) Lengua\n3) Carnitas\n\nAmazing!", "author": "Casey P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "I am not exaggerating. Probably the best tacos I've ever had. Carnitas is my favorite here. Super friendly staff.", "author": "Fiona D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "It was a frigid day and I found this truck on a corner in sf. In a few minutes the friendly ladies produced a huge burrito with crunchy carnitas (pork) it was very warm and filling. And only cost 7.75. In San Jose I get burritos 3/4 the size of this one. Everyone in the neighborhood was nice and friendly too. Perfect place to fuel up for your work day", "author": "Thien T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "After reading all these rave reviews on Yelp, I just HAD to find this taco truck! After weeks of checking the spot, I finally spotted my white whale. \n\nThese were seriously the best tacos, ever. A billion bonus points for being super cheap, too!", "author": "Chia-Fen Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Love the carne asada and salsa verde in particular here (and I've eaten a lot of carne asada across different restaurants in the mission over the past several years). The people who work here are amazingly kind, too.", "author": "Em S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-10", "description": "This is my favorite taco truck in SF right now. I always get carne asada tacos and the service is quick and they're super friendly. They even have tables outside if you want to enjoy your food there. Parking is a bit tough, but if you're just picking up to go, it's not too bad.\n\nAnytime I'm in the mission and craving tacos. I always come here. They're only open around lunch hours though I think.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "This is the only taco truck in the Mission that I've visited but Yelp did not do me wrong. These tacos are SO GOOD. The ingredients are really fresh and I felt good after eating here. I even saw another truck pull up and start unloading boxes of fresh produce into the taco truck. I seriously dream about these tacos.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "If you want the crispiest carnitas, juiciest carne asada or the most tender pollo asado tacos in the city, go here. Forget La Taqueria and any other establsishment created by out of touch writers and publications.", "author": "E E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "The al Pastor (my reason for going) and Carne and Pollo Asada did not disappoint, but I think I'll pass on the Chicharrones tacos next time around. \n\nI think I was expecting crunchy, and I don't know if it was because it sat in the car for the ride home or whether this is how they're supposed to be, but he mouthfeel and flavor stopped me at one bite - which is rare. My bad.", "author": "Karsten P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-18", "description": "These might be the best tacos I've had.  Meat was amazing.  I tired the chicken because it was mentioned in so many reviews.  Delicious, but not my favorite.  The carnitas was delectable.  Perfectly juicy and crispy and flavorful.  Pastor was also delicious.  Asada was the loser, but still delicious.  \n\nThis is an out of the way truck for me, but will be a destination in the future. I would like to try the green salsa next time because we only has the roja on what we ordered and it was so good we forgot to see if green even existed. \n\nTruck with one table and pick tables. Good location.  I'll be back.", "author": "Katharine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-10", "description": "One of the BEST $3 I've ever spent...PERIOD.\n\nWith the numerous Off the Grid events and with so many new food trucks coming into the scene, people often forget about the little lone taco trucks at some random San Francisco street corner. As many of us food truck chasers know, the food can be pricey and is not always what you expect it to be. On many occasions, I know I have been disappointed having wasting my money on tasteless mediocrity. Have no fear, El Gallo Giro Taco Truck will help bring you back, back to the times where you can fill your belly with quick, simple and delicious food with just several dollars in your wallet.\n\nEl Gallo Giro Taco Truck is located in an unassuming part of the Mission in front of a cute little playground. The menu is simple with Tacos ($1.50), Burritos ($5-$7.50), Tortas ($5) and Quesadillas ($6.75) with your choice of meat: Carne Asade (Steak), Al Pastor (Spicy Pork), Lengua (Beef Tongue), Pollo (Chicken), Cabeza (Beef Head) and Camarones (Shrimp).  http://www.yelp.com/biz_photos/ot7QliMsea1Bnu59Mb5zGA?select=R4CkUquJfRz-ZCNsQiegCw \n\nYesterday, 6.8.11, I needed to grab a quick dinner before heading over to the San Francisco Food Bank to volunteer and thought it would be a perfect time to try the highly rated El Gallo Giro Taco Truck. I ordered Two Lengua Tacos ($3 total) with the cheery and friendly cashier. Before even placing my change into my wallet, I was handed a plate of tacos emanating with vibrant colors saying, \"EAT ME NOW!\"\n\nLENGUA TACOS\nhttp://www.yelp.com/biz_photos/ot7QliMsea1Bnu59Mb5zGA?select=F52moaFyAV_VSmxLG_D3YQ\nThe double layers of corn tortillas were topped with a heaping portion of thick, succulent chunks of lengua and then sprinkled with onions, cilantro and then a spicy salsa rojo. Almost the whole circumference of the tortillas was covered with lengua perfectly braised to a soft, melt-in-your-mouth tenderness. It had a rich beefy flavor which was brightened with the fresh onions and cilantro. The salsa rojo added a spicy punch and tanginess. The tacos were super fresh, simple, and PACKED WITH FLAVOR! And for just $3, it definitely was a satisfying meal that didn't even scratch the bank.\n\nEl Gallo Giro is just TOO good to pass up or by. Seriously, for once the 5 Star reviews don't lie. EAT HERE NOW!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "Yum yum yum. I've recently become slightly taco obsessed and I'm on a mission to find some delicious vegetarian tacos. This place is amazing. $2 per taco, loaded with veggies and HOT sauce (if you don't like spicy, get it on the side). I live in LA so I don't get to come here often but when I'm in San Francisco you can be sure I'm driving to the Mission to find this truck. Top 3 spot.", "author": "Jacqueline L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "I've had possibly the best burrito I've ever had in my life here. The chicken was super moist and flavorful. The burrito had just the right amount of sour cream, cheese, and salsa. Even the rice wasn't dry like most places. I'm usually hesitant about taco trucks but I sure don't mind coming back here! This truck deserves to become a restaurant.", "author": "Allan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Phenomenal!! Found on yelp after searching for the top rated taco place within 6 blocks of my location. Truck looks unassuming but the food is the absolute best. Ordered 3 tacos: al pastor, crispy carnitas, and asada. Best $6 I've ever spent on tacos.", "author": "Manda A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "The food was delicious. Great pico de gallo. The owners/staff were very friendly. The portions were generous and the price was very reasonable!", "author": "Tina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "El Gallo Giro is a Mexican food truck that can always be found parked at the same spot -- the corner of 24th and Treat. They serve generous portions here for a great price. I absolutely love their carnitas. They're juicy, fried crisply, and full of delicious fatty flavor. Nothing beats a giant burrito and a bottle of chilled coke on a warm day. Usually the line isn't too bad. The food is served quite promptly. The only thing is that it can a bit difficult to find parking nearby.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "Move aside, El Farolito! El Gallo Giro taco truck is my new fave!\n\nWant the best carnitas taco ever? Yes you do. You'll find it here. This taco is simple but so delicious! Topped with diced onions, cilantro and some hot sauce along with sides of radishes, lime, pickled carrots and jalapeños. But what makes this taco the best is the carnitas which is fried to a crisp perfection. Drool. I had to order another one. It was that good. And cheap! $1.50 per taco!\n\nWoohoo! As good as it gets!", "author": "Andrea F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-23", "description": "Tacos on point. Fast and reasonable pricing . lots of meat and flavor and the taco sauce made fresh and tasty", "author": "Miamia1954 R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "The tacos here are the BEST! They are full of the meat of your choice and the service is always very friendly. I have been to other taco trucks and non of the other taco trucks compare to El Gallo Giro Taco Truck. They are simply THE BEST!", "author": "Just My Opinion R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Oh my am I ever so happy to have this truck a block away from my place. Hands down best veggie tacos and only $2. You get a heap of rice, beans, avocado, cilantro and lime with a spice. The ladies that work there are always smiling and friendly. My favorite place for a cheap lunch that is fresh, delicious and filling. My recommendation is to take the tacos to the park across the street!", "author": "Brittany A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Walked here from 24th st bart in the rain just because it was so well reviewed. I was thinking \"this darn place better be worth it...\"\n\nAfter my first bite, I forgot it was raining.\n\nSo. Freaking. Good. I got a burrito with al pastor and chicharon. Ughhh need more of that in my liiiifffffeee.\n\nMy friend got one taco, I can't remember the meat but it was different than the two I got, and her taco was awesome as hell too.\n\nSeems you can't go wrong! Try their hot sauces too - dayyymmmnnnn.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "Time + Effort = Yummy Tacos\n\nWorth the trip. Maybe I'm on a Mexican kick because California has great Mexican food but the tacos here deserve a prize. Skimp? What? No Not Gallo Giro! You'll wish they drove around SF like the ice cream man drives around suburban America. If you're up for eating outside with limited space or you're driving by and want to grab a delicious quick bite. The tacos here will make you smile and want to dance to a Mariachi Band. Yum!\n\nDate Rating: 3 (Depends how cool your date is)\nPick up Scale: N/A\n\nStrong Suggestion: Come hungry & try the lengua!", "author": "Megan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "The carnitas tacos here are, hands-down, the best tacos I have had outside of Mexico, and better than many of the tacos I've had in Mexico as well.  The carnitas are the perfect mix of crunchy and tender, the salsa, onions, and cilantro add pleasant heat and sharpness without overwhelming the meat.  I do wish there were more radish chunks and pickled jalapenos on the side, but if you begged for extras, they'd probably give them to you.\n\nOut of an obsession with variety, I also had a lengua taco, which was an excellent counterpoint-- a little leaner, a little chewier-- I couldn't actually say it's *better* than the carnitas taco, but it's nice to know that it's available to you if you want more tacos, but also variety.\n\nBring your out-of-town friends here.  It might convince them to move to California.", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-06", "description": "It was such a journey to get to this little truck... but the end result?  It was totally worth it.\n\nIt was a sunny but chilly Friday at my new job.  I haven't really met anyone since I started working here, and I'm technically still in training.  Great, another meal alone.....   Then, one of my coworkers popped his head in and asked if I wanted to join them for lunch.  Even though I had a ton of work to do, I decided, \"hey, why not?\"  Our group of about 5 people ended up turning into a group of about 12 or so, and knowing that it's lunch time in the FiDi, there's no way we would fit everyone.  One of the members in our group suggested we head over to the Mission for tacos.  Great!  I haven't had tacos in a while, so I was pretty ecstatic.. but would we make it back in time?  \n\nAnd my problems began....\n\nI forgot my Bart ticket back at the office, so while everyone was heading down to the station, I had to run to the machine to get myself a new ticket.  The machines I went to didn't accept credit cards.. who carries cash anymore?!  So I try to look for my debit card... again, it wasn't in my wallet because I had recently switched wallets.  I scramble to a different machine, BINGO!  They accept cards!!  So I bought my ticket and ran downstairs.. everyone was waiting for me... I'm sure everyone loves the new girl now!\n\nWe hopped on the Bart and journeyed to 24th and Mission.  I don't know how many blocks we walked, but it sure felt like an eternity... at times I wondered if we were even going the right way...  I was starving and worried that I wouldn't make it back in time too.  Finally, I saw the little sign that said \"El Gall Giro Taco Truck,\" yay!  But then I saw the sign, CASH ONLY!  FML!!!!!!!  Seriously, who carries cash!?  \n\nLuckily, one of my coworkers said she'd pay for me - I am forever thankful because I was starving and the tacos smelled DELICIOUS!  A lot of people got the burritos, but I've been craving tacos since I left San Diego, naturally I had to get a carnitas and carne asada taco.  WOAH!  There was such a huge burst of flavors, and the spices just married the whole dish together.  Make sure you get the green salsa too!  It will totally kick up your taste buds.  Amazing!! I loved the carnitas!  Next time, I will definitely have to try the burrito.  Best of all, they were super cheap too!  The tacos were only $1.50 each!\n\nThis is probably one of the best taco trucks I've tried.. hands down!", "author": "Cecilia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "I used yelp's recommendations- the al pastor was excellent. I thought my carnitas meat was a bit too crispy?  Everything was flavorful, a bit spicy, but I thought they were just amazing. For just 1.50 a taco, I will one day return to SF for these delicious tacos.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "Michelin starred chef of Aziza, Mourad Lahlou said the roast chicken taco was one of his favorite bites in SF.\n\nSo I tried 4 tacos from here: Lengua, Pollo, Carnitas, and Al Pastor.\n\nThe pollo definitely was interesting, with hints of clove in the seasoning, but the star was the al pastor. Really complex spicing. Lengua was an honorable mention as well.  Carnitas a tad dry.\n\nI'll be back for an al pastor burrito!", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-18", "description": "Woke up to a beautiful morning with the sun out accompanied by a warm breeze... a birdy chirping as my cat Lucifer tried to claw his little heart out through the window screen.\n\nI thought: what would go with this Norman Rockwell scene?...A hearty breakfast plate and a passion fruit agua from Gallo Giro enjoying the whole thing seated at the park across the street before heading off to work.", "author": "Darth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "Best tacos I've ever had. The only downside to going here is that now carnitas at other places will never be the same.\n\nAlso, why don't more places make their tacos spicy??", "author": "Grant M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "I don't know why I'm even writing this review because get the hell away from my taco truck! But here I am. I tried the al pastor and the carne asada tacos and hot damn they were delicious - especially the carne asada. Like seriously, wow, blown away and for $1.50 a taco!\n\nLet me put this into some context for you because everyone in California seems to be an expert on Mexican food. I consider Mexican food to be its own food group. You only have to follow me on Yelp or Foursquare to know that I eat Mexican like it's going out of style at least four times a week. Just this last Friday I had an al pastor burrito for breakfast, two tacos for lunch (carne asada and chorizo) and a carnitas plate for dinner with a bacon street taco. I don't mess around.\n\nSo those are my credentials. And yes, I have eaten at El Farolito and tried their carne asada. It was definitely good but El Gallo Giro just takes it to the next level.\n\nDELICIOUS!", "author": "Monika H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-19", "description": "Accessibility (Parking / Wait Time)\n\n1/1 Star: Parking is ok, if you can't find a spot you can just pull off to the side for a few minutes.  I've never been in a line longer than 3 people, and that's when I go with friends.\n_____\n\nService (Waiter / Cleanness / Ambiance)\n\n1/1 Star: It is a fast food truck, there are pigeons around, but it's really nice outside and it's right next to a park that's always full of small kids running around.  It's nice to eat and watch the kids jump and play while getting some fresh air. \n_____\n\nTaste (0=Not Edible / 1=Edible / 2=Good (average) / 3=Must Try!)\n\n3/3 Stars: This place is a MUST TRY! Their carnitas (fried pork) is AMAZING! When served in a taco it's crispy, juicy, and filled with flavor! This is my all time favorite place to get Mexican food in San Francisco.\n_____\n\n\nOverall Experience\n5/5 Stars \n\n_____\n\nPictures\nTacos: http://www.yelp.com/biz_photos/el-gallo-giro-taco-truck-san-francisco?select=x4suvZ1Nx9UpIVFZLmY8IQ#CNh1xRDV7NVXJqI7W3cy0Q\n\nBurrito: http://www.yelp.com/biz_photos/el-gallo-giro-taco-truck-san-francisco?select=x4suvZ1Nx9UpIVFZLmY8IQ#HB0n4-bva6Yn9FEnsVQEug\n\nSingle Table to eat there: http://www.yelp.com/biz_photos/el-gallo-giro-taco-truck-san-francisco?select=x4suvZ1Nx9UpIVFZLmY8IQ#oWaI5bs3-he3aZ6q5rji5w\n\n_____\n\nLast Words\nGet 3 to 4 tacos and you will be very happy!\nSuper bang for your buck! \nThis is really as good as it gets!", "author": "Elliott N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-16", "description": "Ah taco trucks! I love you!\n\nCheap prices and DELICIOUS tacos! The truck is kind of out of the way, but it's not too bad of a walk from Mission Street. You'll work up an appetite right? ;)\n\nTried the tacos here for the first time and I definitely loved it! I only got one taco: the lengua (beef tongue), but I'm coming back to try the 5 (or was it 6?) other kinds! Maybe a burrito too!\nThe lengua was really tender and just awesome! There is a plastic table set up with 4 chairs for customers, but I'm sure when it's busy, you won't be able to sit there. No worries, the truck is right next to a park! Chill with the kids, but don't be a creeper.", "author": "Kei H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-13", "description": "There were so many things that were spot on at the El Gallo Giro Taco Truck: the lady who took our order was very cheery; a bottle of hand sanitizer was thoughtfully placed by the truck; a fold-able table surrounded by four plastic chairs was set up in front of the truck; the prices were satisfactorily low; the menu offered plentiful meat options; our orders were ready before we had a chance to catch our breaths; and the truck was conveniently located outside of a playground where you could sit in the plentiful grass.\n\nSo you've probably guessed it.  My complaint was with the food itself.\n\nThe lengua meat in the tacos were disappointingly tough to chew.  I eagerly anticipated the melt-in-your-mouth lengua that I was accustomed to.  Alas, it could not be found in these tacos.\n\nThe salsa immersed amongst the ingredients was tasty, but did not provide the spicy kick necessary to transform the taco.\n\nThe tacos were smartly wrapped in double-layered tortillas, but the outside tortilla was not crispy.\n\nThe lengua burrito's meat suffered from the same lack of tenderness, but the overall burrito's portion size was filling.\n\nI will probably make my way to other taco trucks before reconsidering El Gallo Giro.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "OMG\n\nSo good!!! The truck was tucked in a small parking lot near a park. Only a couple blocks from the BART Station! We got the carnitas and the al pastor tacos. The carnitas had a wonderful crust on it and was full of flavor! So crispy and so porky and soooo delicious! The pastor was the bomb as well. The pork was perfectly spiced, dripping with hot spicy juices. Juicy meaty and excellent as well. Only 1.75!!!! Worth every single penny. So gooodd.\n\n5/5 gotta come back and try more meats.", "author": "Ernest C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "Best carnitas. Ever.\n\nI could eat here every day. Bought 4 tacos with a friend, and immediately walked right back to buy 3 more. It was that good, and very inexpensive. Had the carne asada and al pastor as well; everything is phenomenal. Hands down the best taco truck I've been to in SF, and really anywhere, perhaps excepting only close competition with Kogi.", "author": "Haley R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "The carnitas are perfect. Crispy, juicy, spiced just right. Fast service, six outdoor seats. Highly, highly recommended", "author": "Keith K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "Lived up to the hype! So so good -al pastor, carnita. Super bomb red and green salsa. We took our burritos to go to eat @ opera in the park and they were still delicious later. Next time gonna try the tacos.", "author": "Title S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "Bomb tacos and super burrito man, I'm from Sacramento and my home boy out here in Oakland introduced me to this taco truck. We came here one night drunk and Hella late too. Man the food was good better then some restaurants out here.  I'll be visiting this spot next time I'm in town for work. Is a must!", "author": "Saul A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "Tacos that come in forms of Chicken, Steak, Pork, Veggies, and Beans. All for just $1.50??!! \n\nNot only are the tacos cheap but the ingredients fresh. Fresh cilantro, onions, guacamole, and sauces make just one taco hit the spot. I usually order 3-4 tacos and that is great meal at only $4.50 - $6.00. \n\nI would definitely recommend this food truck to anyone looking for a refreshingly good and cheap meal.", "author": "Neil M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-12", "description": "Ask anybody I know, I'm a slow eater, slower than a snail slow. But I managed to scarf down 3 tacos in record time and still had room for more! These tacos were so freaking delicious. FOODGASM in my mouth!!!!!! Ended up with 2 al pastor and 1 pollo taco because they were out of shrimp for the day. The meats were perfectly flavored and went together so well with the tomatillo salsa, onions and cilantro. A little squeeze of lemon over the top of the taco before taking a bite really helps to bring out the flavors. \n     I wanted to eat the tacos on the spot but all the seats at the little table next to the truck were taken so I got the tacos to go. Bad idea, it was 5pm and it took over 30 mins to get home to Daly City But the tacos were still bomb. I was very surprised the tortillas held up really well and didn't fall apart from the sauce. Can't wait to go back again and eat the tacos fresh off the truck. Also at $1.50 a pop, one can afford to try each of the meats and not go broke! Maybe I'll be adventurous enough next time and try the lengua and cabeza .... maybe haha", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-04", "description": "Super great taco's rollin' around one of the best cities on Earth. What's not to love?\n\nNothing! \n\nGo out and grab some Gallo Giro next time you get a chance!", "author": "Maxwell R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-20", "description": "Almost 4 star ..We were visiting San Francisco and had passed this truck 2 times going back and forth between our rental and our car. I mentioned to my friend that we should just get dinner there as we were settling into our room. I pulled out the yelp app as a back up and the funny thing was that I bookmarked this exact taco truck prior to our trip and didn't even know it. We split the carne asada, beef tongue, and beef head tacos and they were all delicious! I'm giving the truck a three star only because my friend got food poisoning and attributes it to the tacos. I didn't get sick  even though we shared our order.", "author": "Ntxhais Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "This taco truck is a gem. The people are so nice, and their tacos will make you love them even more. \nThe pastor and the carnitas tacos are a must. They are quick, hot, and super inexpensive and there is a nice table set outside the truck (in the sun, if you're lucky.)", "author": "D Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-02", "description": "I have discovered the platonic ideal of carnitas tacos. \n\nOf course, being that these are the platonic idea of carnitas tacos, they cost $1.50, and come from a friendly little truck parked outside a playground in the Mission.\n\nTwo are a hearty snack, and they're served properly...double-stacked, warm, corn tortillas, soft but still sturdy, fresh onions and cilantro, salsa that's smoky and warm, but still with a decent amount of heat, and even some radish chunks and pickled vegetables on the side.\n\nBut of course, it's the meat that makes the taco, and this stuff is serious. There's plenty in your pile, and it's a delicious mix of  crispy browned bits and unctuous fatty bits. It's well-seasoned, and aggressively porky as well.\n\nI also tried the chicharrones, and the chicken tacos, both of which were tasty, but just not in the same league as the carnitas.\n\nI'll definitely be back. I'd like to pretend I'll try some of the other options, but really I'll probably just keep ordering the carnitas.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-14", "description": "It just does not get any better.  The beans are moist and flavorful. The rice is perfect. The salsa has the perfect bite.  Everything is fresh The prices are low. And when interacting with the family members who work in the truck, it sounds corny, but I feel like I'm coming face to face with authentic goodness.  My coworker also loves the Mexican coke in glass bottles.  \n\nGallo Giro has definitely outclassed El Tonayense.", "author": "Linda J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "Really good street style tacos for $1.50 each - The carnitas were my favorite with plenty of meat and just the right amount of spiciness.", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-06", "description": "Simply put: the best carnitas in The Mission. Also my personal favorite tacos and burritos (BOTH!!!!) in the whole world, but that is more subjective. The carnitas is simply fact.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-09", "description": "These were probably the -best- tacos I've had in the Mission so far...and i've been to at least 8 places, all with over 500 yelp reviews. El Gallo Giro Taco Truck is legit. The girl working there was super sweet and they serve up f'ing amazing tacos for only $1.50 each!!!! Why isn't there a line around the block??\n\nI live near to the truck so I just picked up my tacos and ate them at home. Seriously, after I polished off all three I had to stop myself from heading right back out the door for a second round. These tacos are killer. For real.\n\nCARNITAS!!!!!!!! The carnitas taco here was the BEST carnitas i've found in this city. Its so crispy and juicy and flavorful. The salsa, onions and cilantro was generously added and balanced well with the carnitas. Seriously, this taco is so good its almost unbelievable. I also tried the Al Pastor (it was good!) and the Lengua. Whoa, the lengua is very good. Try not to think about the nastiness....just enjoy the tender, fatty, flavorful chunks of meat.", "author": "T. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "I've been coming to this taco truck since I was in high school, and they are the BEST in San Francisco. A lot of the Mexican food in SF, especially the Mission, have become watered down 'gringo', hipster food. Not this place! The food is consistently delicious and the mother, daughter team working the grill are the sweetest people you'll meet. Come here for some great Mexican food!", "author": "Jonny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "The lunch trek from the BART wasn't bad with the street bustle and street murals.  As a non-native, I felt comfortable finding the truck despite what I heard about the Mission district.  Then again, there is something about a New England-ner desperately searching for authentic Mexican food. \n\nThe truck hosts Michoacán-style food, which UNESCO (United Nations Educational, Scientific and Cultural Organization) has named as traditional Mexican food.  I had the burrito, which was truly beyond what the mass food corporations deem appropriate as \"burritos\".  The pricing was incredible, the portions were grand, and the spiciness was authentically spicy.  Did I mention it also came with chips and homemade salsa?  \n\nThere was limited seating, but it's a nice spot to watch the customers ranging from blue collar workers to a teenager, in questionable attire, who whipped out wads of folded tens and twenties.  The service was homey and courteous; I really felt like I was part of the usual lunch crowd, even with a clunky black tourist camera.", "author": "Christia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-02", "description": "Wow, this place is awesome!!  I picked up my brother from the airport and the first place he wanted to stop at was El Gallo Giro.   We ordered the chicken soft taco and pulled pork soft taco - it took 7-10 minutes to get, but the taco was DELICIOUS.   We scarfed it down quickly standing next to the truck (although there is a small table there too).  There was so much tender meat, the sauce was great, and it was a steal.  There weren't all the bells and whistles like sour cream, pico de gallo, guacamole, etc. that you find at the chain or fast food places, but it was better without because you didn't need it.  Unfortunately they were out of the shrimp, which my brother says is the best, but I'll definitely be going back to try it.", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-10", "description": "Dear 23rd/Treat Taco Truck - I love you.  I love you like I love finding money in my pocket after doing the laundry.  Why, you ask?  Let me tell you:\n\n1. You are near my office.  I can't tell you how many times I have forgotten to bring in lunch and walk/bike over to you to avoid spending $10 on food somewhere else.\n\n2. You are fast.  I get hungry pretty quickly and I hate waiting too long for my food.  You never keep me waiting too long.\n\n3. You have veggie options - you know, for those days when I attempt to eat better.\n\n4.  The super nice family that runs you is always so nice!  I especially like that they don't mind when I come with taco orders for my entire office.  They are always friendly and have a smile for us.\n\n5.  The food is delicious!  Kinda spicy, like I like it, and full of flavorful MEAT.  The green salsa you serve on the side really kicks up that spice and makes me drink lots of water.\n\nI think that about sums it up.  I miss you on those days when you go somewhere else or you've closed up for the day.  But I always know where to find you and am so glad that you exist.\n\nLove, \nCarmel", "author": "Carmel U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-22", "description": "Pretty damn good. Best tacos i've tried in all San Fran. To be honest, they should cost more! \nCan't go wrong with this taco's truck!", "author": "Essio C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-03", "description": "Been coming here everyday after school. Great place to order some quick tacos, they have great burritos too! Did I forget to mention that its cheap? Fully recommend to anyone who wants a quick bite.", "author": "Michael V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "Best tacos in SF. Period. Maybe in the world. And $1.50 a taco - there's not a better deal in the city. \n\nMUST TRY - Carnitas: Mind-blowing crispy juicy pork with just the right balance of salsa, onions, and cilantro. They make the salsa themselves (special recipe) and it's really something special - spicy with just the right amount of heat. But the carnitas are simply magical. They also give some radish and pickled jalapenos (I usually enjoy them in my post-taco bliss).\n\nReally good - Al Pastor: Spicy small chunks of pork. Carnitas beats it out with the texture double whammy (crispy and juicy) but the al pastor is solid. More heat than carnitas and generous with the meat.\n\nNovelty pick - Lengua: I'll admit, I was pretty suspicious of eating beef tongue and expected something closer to liver in texture (the other weird organ meat) but it was surprisingly pleasant. Tasted pretty much like some other cut of beef (maybe because it's chopped in small portions). \n\nSkip - Carne Asada: I love this truck, but stick with the pork options (or lengua if you're adventurous). You can find better carne asada other places.\n\nThe horchata or the mango/pineapple juice is amazing.\n\nBe careful, once you have a carnitas taco here, you'll never want to eat one anywhere else (i'm looking at you, el tonayense).", "author": "dana n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-23", "description": "Lengua tacos here is the shitznats!!  I always grab a few when I am in the area.  Super nice lady working this truck but sometimes it send as if they close whenever they want in the early evening...as I came here a few times at 5:15ish and they were closed!!", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-25", "description": "Delicious.  Flavorful. Cheap.  \n\nThey give you ample amounts of meat in each taco so you feel full and satisfied with every bite!  And for only $1.50 a taco, such a good deal!!  When I went it was pouring rain, luckily there was no line. And, they prepared our 6 tacos in a pretty reasonable time.  I can't wait until I'm back in the area so I can get more tacos from them!", "author": "stephanie c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "Now we have eaten at many taco spots in SF, nothing compares to the tacos at El Gallo!  \nWhat we've tried \n1. Carnitas tacos- best ever! the carnitas are crunchy and meaty, topped with onions and cilantro and their house sauce. \n2. Chicken tacos- these are very good. I asked the nice owner lady to make the chicken toasty and crunchy like carnitas and she got what I wanted just right without frying it like carnitas! \n3. Shrimp taco- this is more like a mini plate of fajitas on a tortilla complete with rice! \n\nThe mother/ daughter team are great! They are super-friendly. \nHave you see the 100 health inspection score? that's the reason why we tried this place at first and the taste keeps us coming back!", "author": "Yva D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-21", "description": "Excellent food for the price if I wanted some mission burrito food that you can't get from a drop and stop place in the hood.\n\nThey have a good variety of Mexican food to pick from especially drinks and all the works for those who want some great stuff you can't get anywhere else.\n\nSpend! spend! spend! This truck is the place to be!!!!", "author": "Jacen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Just tried this for the first time last weekend. Great to see a truck live up to its reviews. It was high quality and very, very tasty. And I liked their truck set-up on a quiet corner with tables and chairs. Reminded me of Mexico street tacos. Can't wait to go again!", "author": "michael k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-30", "description": "Yummy!  How can you beat incredibly tasty tacos for $1.50?  You can't.  I sat down by the truck and enjoyed my food on a lovely day.  The only thing brighter than the sun that afternoon was the smile of the young lady who took my order.\nI wish I lived in SF just so I could make this my lunch spot of choice.  Oh, and for a chance to chat up that lovely señorita.", "author": "Francisco H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "Really great tacos, especially their carne asada tacos! My boyfriend got a burrito and he loved it as well. The chips aren't as great, but they're decent. Cusomer service is great and efficient.", "author": "Jacky H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "At $1.50, it's a steal for a 2-taco lunch.\n\nAl pastor is pretty spicy, but it's chopped up into too little pieces instead of being chunks. It's still pretty good, but I still prefer Vallarta. Lengua and carnitas are really good here and they don't skimp on the meat.\n\nBurrito's are pretty good, but they use yellow cheese, probably some Mexican tri-blend. It tastes kinda weird though, definitely not queso or anything.\n\nI tried a torta today and would not recommend it. I thought I was gonna get a torta sandwich, but instead I got everything stuffed inside a hot dog bun. While the filling was tasty, it was just weird having it in a hot dog bun.\n\nOverall, I'd say go her for cheap lengua and carnitas tacos. When you any other sort of tacos, go to Vallarta. If you want a torta, go to La Torta Gorda. If you want a burrito, I'm a Cancun fan.", "author": "Charles L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-26", "description": "Not bad, but not great.\n\nI got the carne asada and the carnitas. They definitely don't skimp on the meat. The carnitas was good but the carne asada was clearly low quality beef. It was both tendony and sinewy.\n\nI love the $1.50 price. But pay an extra quarter and go to Taqueria Vallarta, two blocks down the street. They've got the best tacos that I've tried in the city so far.", "author": "Nathan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-12", "description": "I had 4 tacos, and far and wide the carnitas was the best. It was really kind of special and if you go there I would just get that.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "The best part: Hand sanitizer at the window!  Also, friendly cashier.  A taco order comes with some tasty pickled jalepeno and carrots.  The carne tacos was decent, though I didn't like how finely the meat was chopped and it contained some fatty bits but that is pretty standard for cheap Mexican food.  At $1.50/taco I can't complain, though I'd probably choose to pay the extra 25 cents for a taco at Taqueria Vallarta.", "author": "Beatrice W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-12", "description": "Without a doubt one of the best in the city.\n\nAnytime you can get shrimp tacos from a tao truck and not be even a little worried you know you have found something special.\n\nChicken tacos rock.\n\nSteak tasty and never overcooked.\n\nYou can expect quality products and reasonable prices from these guys. They also have some sort of secret recipe for hot sauce that they use unless you ask for them not to. I say go for it all and leave happy.", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "Great local spot. Amazing $1.50 tacos with fresh ingredients. I am vegetarian and the veggie options are really good especially with their really fresh/soft avocados.", "author": "Harsh P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "For 1.50 these tacos are great...though maybe not the best. I had the carne asada which was well seasoned but sort of tough, not a lot of meat flavor came through. It was, however, served with an awesome pickled jalapeno...yum! The lady who served us was really nice and I appreciate the huge vat of hand sanitizer on the truck - essential for eating messy tacos on a street corner.", "author": "Clarice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-03", "description": "Somebody please call 9-1-1. I've visited them twice for the past two weekend and they are not there anymore. Please tell me their truck has not been stolen or hijacked. If anyone know where they went, please let me know.\n\nI've been to this taco truck three times. This is my favorite taco place to indulge and binge in the whole Bay Area (SF and East Bay). Everything is spot on from customer service to the quality and taste. I usually order one of each on their menu, except for the lengua which i need at least two. \n\nSerious though, if someone know their number or where they go, please let me know.", "author": "urasso u."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-23", "description": "Best Taco Truck in SF!\n\nThe price is right and the food even better. \n\nNot as conveniently located as other trucks but worth the detour and next to a really nice park.", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-29", "description": "I LOVE THE TACOS HERE!!! Granted they're just tacos, but compared to other places that charge you $2+, this place beats them in price and in flavor! Best thing about it? I live less than 2 blocks from here! I've only tried the tacos here so I'm not sure how their burritos and everything else fairs here. AL PASTOR is the best in my opinion here. Carnitas are pretty good too. The chicken is flavorful too. The only meat option I probably don't care too much about is the beef. Maybe it's cause the other meats are so flavorful so it makes the beef taste like meh. Service is good too, they're not rude or anything, always offering napkins and wrapping it in foil for you if you're taking it to go. The only gripe I have about this place is that they're not parked here on Sundays!!!!", "author": "Johnson S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-23", "description": "VERY VERY GOOD tacos. i recently came back fro mexico amd had the most amazing tacos these by far are a comparison.", "author": "Charlie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-09", "description": "Oh wow! I'm a country boy from good ole Alabama flying in with my best friend significant other. We had business in San Francisco and figured we would compare the mexicano fare to Alabama. I ordered the carne asada and it scrumptious. My friend got the steak taco and of course we had to share it! It was so so good! It kind of gave me a stomach ache if you know what I mean, but doesn't all Mexican fare? Yummy!", "author": "Johnson D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-26", "description": "This is going down as the best carnitas tacos I have EVER had.  I wish this truck would take a nice cross-country trip and park here in New York.  Freshly cooked upon each order... it's amazing the food that comes out of that truck.  It was definitely one of the food highlights during my trip in SF.", "author": "Jade L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "This is my favorite taco truck/Mexican food restaurant ever. I mean ever. My husband and I are crazy about this place. We've come twice and tried to come at least two other times, but they were closed. My husband loves the burritos, I love the tacos. I've tried the Al Pastor and the Chile Verde. Both are delicious! \n\nThe prices are incredibly cheap. The truck is a bit out there for most of our usual trips to the city, but we are perfectly happy to journey over there for our fix. \n\nI highly recommend El Gallo Giro. It's the best!", "author": "Tammy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "El Gallo Giro is as good as it gets. The Carnitas Are Unstoppable. This truck is my favorite taqueria in the Bay Area.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "going back to basics...mission taco truck lunch...harolds and kumar day...on treat near twenty-third...parque ninos unidos...small sidewalk seating taken...requiring a one-handed meal...a personal favorite...al pastor burrito cuestan $cinco y crystal geyser bottle por $un dolar...no beans requested in a regular norcal rice, beans and meat burrito...five minutes and calling...hefty brown bag lunch of chips, salsa and a foil log...being mission rebels and entering the parque with no ninos...breaking park's no adults without children rules...carefully unwrapping double foil wrapped steaming burrito...first bite and huge chunk of red juicy pork...quite delicious...seasoned rice also great...another bite full of juice flowing pork...that's bueno porking...chomp, chomp and chomp...finding more rice and less meat in the bottom half...bit of uneven distribution in construction...ask for less rice in next burrito adventure...quite filling for a $six even, brown bag lunch at the park...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-29", "description": "Their $1.50 tacos are a bargain, when the going rate for most taco trucks is $1.75. They do use the smaller tortillas (like they have in Mexico) but they still pile on the meat.  Carne Asada, Carnitas, Al Pastor are all very good.  A shout out for the Carnitas which have crispy bits! Parking can be tricky at times. Super friendly folks too!", "author": "Shane C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "Wow the tacos here are so good. Had lengua and al pastor. The flavors are to die for with just the right amount of spice. Make sure you ask for some radishes to cut some spice if you don't think you can handle it. And c'mon you can beat 1.50 per taco. The girl taking our order was super nice as well. Parking might be a little difficult but its definitely worth it.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-03", "description": "One day. Four taco trucks/stands. I don't know why. Maybe this fantastic city/neighborhood provide the opportunity to go to four different taco trucks/stands within a few blocks. Or maybe because I wanted an adventure. Wouldn't be the first time.\n\nThe plan:\n\nChicken taco at each location. See what customizing can be done. Sample a bit of each. Rank 'em. Save the rest and mix everything together for a massive burrito for dinner. Give away some as a replate. Post same yelp for all four to give context.\n\nThe verdict:\n\n1. Tonayense. Average cost at $1.75. Way above average flavor. Black beans were a huge bonus, loved the mild green sauce and oil was minimal. This was easily my favorite.\n\n2. Mexicali. Second cheapest at $1.50. Tasty. Bonus points for having a bell you ring to get their attention, as well as giving me the opportunity to use a little spanish from 8th grade/Taco Bell to ask for lechuga (lettuce). The friendly lady obliged. More good stuff with the guy who wanted to pay with an ATM card. Didn't work. The lady working and me chipped in to cover his taco. I hope that karma pays off.\n\n3. Gallo Giro. Incredibly cheap at $1.25. Bit on the spicy side. Oil content seemed standard. \n\n4. Cachanilla. Most expensive at $2.00. Tasty. Made in the same building but different prep area than Mexicali. I give them credit for being up front saying if I order at the window (Mexicali) it's $1.50, and inside it's $2.00. I paid an extra $0.50 just for the experience.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-10", "description": "What a treat. This place is some of the best Tacos I've had. I come from Houston where Tex-Mex is big, but this is just an absolute treat. I would recommend the carne asada. Some of the best I've ever had. I know that carne asada isn't the most adventurous choice, but BOY is it good! A+++", "author": "Travis E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "I was in the neighborhood and was really hungry after my Jujitsu training. The regular size burrito I ordered was really good. You get chips and salsa and on top of that, $1.50 tacos!!! I look forward to eating at this place after training every Tuesdays. I can already taste the smoky and mild salsa....mmmmm!!!", "author": "Q H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-20", "description": "haven't come by for a couple of months now since they weren't there the last time we went.  \n\nthought we'd lost you forever!  took a chance today and low and behold, you're back!  four tacos carnitas with everything, please!  soooo good!  see you again next week for the best tacos in the world!", "author": "Peter M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "Favorite tacos in the city... so far.  I don't have much to say about it except the tacos are really, really good, and it's never busy.", "author": "Benjamin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "Having blown my art senses at The Phantoms of Asia exhibition at the Museum of Asian art in lovely San Francisco I needed to get my taste-buds on board with something equally stimulating. A quick Yelp perusal hooked me up with El Gallo Giro taco truck which was the shining star of a number of reviews on this my most trusted of review sites. Of course it's deep in the heart of the Mission as so far every good restaurant and bar worth it's mettle has lain in wait for me to cross it's threshold; in this case, sidle up to it's window.\n\nWith ease and a 3 day unlimited transit pass I hopped 2 buses cross town and found myself a mere 3 block walk from where El Gallo Giro was supposed to be residing. Best I can get from google translate is The Roosters Turn. I refuses to translate the 3 words together, slang? Weird syntax? No matter, I approached the truck and checked out what they had on offer. The usual fare plus lengue which is becoming more and more usual. I ordered an Al Pastor and a carnitas; usually my two favourites. I unfortunately wasn't hungry enough to order three and it was after I ordered I noticed the beef head option. I have never seen beef head taco before. I'm not sure what part of the massive bovine head this meat would be but I guarantee it would be tender and delicious. Damn. Now I need to find somewhere that is doing these. Back on track... My food arrives as I am talking to a cool fellow from Nicaragua about food. His food specifically. A lot of plantain apparently.\n\nI eat the al pastor first. It is middle of the road. Not enough pineapple sweetness for me and a little too saucy - just like my ex. Heh heh heh, I kidd. It passes muster in that it was a buck fifty, it just wasn't as good as La Taqueria back home. Then the main event. The best carnitas ever. They nail the crunch to soft factor and the seasoning and fresh veg are top notch. The tacos also come with a generous portion of homemade pickled jalapeno and radish which is unique to me in regards to tacos but damn tasty. I finish up and say goodbye to my lunch mate; the SFMOMA has a Cindy Sherman exhibition going on and I must must must see it, as well as the massive collection of contemporary art that the museum has on display. Artgasm time? I think so.", "author": "Christopher N. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-04", "description": "The carnitas and al pastor were amazing! Very nice too. Can't wait to go back.", "author": "Monte M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-03", "description": "The tacos are so amazing.  The yelp reviews really speak for themselves - it is all true - great food, awesome prices and really nice staff.  Definitely worth multiple visits.  I am already planning my next one.", "author": "Richard H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "Amazing! For 1.50 they dish out a heaping pile of meat and toppings. Super fresh and tasty, I wish I could have 5 more sent to me now.", "author": "Ioanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "Oh man, ¡Qué sabroso!  ¡Tan delicioso!  Sure there are other great taco trucks around SF in general, and the Mission in particular, but the tacos I had at this one really are the best I've tasted in Northern California.  (Sorry Bay Area, I love you and all, but a decade in LA gave me some perspective.)  Carne asada and al pastor.  I like how it's tucked away a block off 24th so it feels like our little secret.  There was literally one person in line in front of me.  I could even get away with parking in not-exactly-a-parking-space for the five whole minutes it took to get my tacos without getting ticketed or towed or yelled at.  Try that on Valencia!  Muchas gracias to other yelpers for guiding me to this place.", "author": "Antone J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-30", "description": "The best taco truck ever.  Shrimp taco and al pastor taco are full of flavor and hot off the grill.  Carne asada torta are loaded with meat and avocado, comes with chips too!   Good quality meat and shrimp too.", "author": "Karen N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "this is the best place for tacos i have ever had in this area", "author": "Rob C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-10", "description": "After searching long and hard, I finally found a taco truck in San Fran that I can call home. Great flavor! Not overly greasy. Beats Tonayense hands down. Their meat actually tastes like the meat its supposed to be. Oh and of course, Humphry Slocombe is just a few blocks a way for a little something sweet afterwards too.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-10", "description": "Solid tacos, the Cabeza and Lengua are great.  Al pastor...not so much, but still better than most of 24th st.  Their salsa was nice also, it has a bit of spice to it.\nThat being said, there are a million people working here inside the truck.  I'm confused to what all they're doing in there...", "author": "Johan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-29", "description": "Super tasty tacos! EL Gallo Giro delivers every time. Highly recommend the pollo, carne asada and al pastor, and at a $1.50 each you really can't go wrong.", "author": "Zachary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-21", "description": "The best and cheapest taco truck in the Mission! Supernice folks run this joint - and yes, you get the yummiest pastor tacos for dirt cheap... Please, peoples, just throw your greasy little taco plates in the trash - not on the street! P.S. Check out the cute feral cats playing in the junkyard next door.", "author": "Kim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-14", "description": "Just a bit tastier than the competitors, 25 cents cheaper than the competitors, there's always tamarind Jaraitos in the cooler and a smile behind the counter and a place to sit. I'll take El Gallo over Tonayense any day.", "author": "Jake W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-08", "description": "Honestly, after reading a couple of the reviews that were left for this gem of a taco truck, I can't add anything else more, other than it is AMAZING. Point. Blank. Period.", "author": "Sally W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-01", "description": "Grizzle me this, grizzle me that. I think I have better quality meat with a lot less fat. No but seriously though the carne asada is real sinewy and grizzly. The cabeza was nothing but big chunks of soft jelloey fat, which I have never seen before in all my days of loving cabeza. The lengua was ok. The pollo was great and the al pastor was excellent. $1.50 for taco's is a great price and it reminds of the 90's prices for tacos. But I have definitely had better tacos. Still the best tacos and best price in San Francisco is Vallarta Taqueria on 24th st and Balmy.", "author": "Ethan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-17", "description": "Experience the top notch customer service.  Enjoy the lively patio. Eat there while you watch the children play, on jaunt off in style with a custom El Gallo Giro to go container.  \n\nYou too could surround yourself with flavor by ordering a Pastor taco (add some cheese for a fatter ass).  Only at the El Gallo Giro Taco truck can you be immersed in an experience so elegant so intimate and so indulgent you simply won't believe it is priced at the low cost of just 1.25.  So run, don't walk to 23rd and Treat, and go get you some.", "author": "gabriel a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-10", "description": "Good lengua...decent asada...ok pastor and suadero. Good size portions, I would recommend not ordering more than 2 or 3 tacos at a time or they get cold, and nobody likes cold tacos.", "author": "Penson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-18", "description": "This is my very favorite Taco Truck in the city. The tacos are soft, fresh and delicious and the spicy pork is divine and at $1.50 a pop great value. I have got 3 for $4 when I was running low on cash and asked them how many I could get fot $4 and they said 3 :-) This truck is off the beaten path and right by a playground so it's not particularly well known. This is not a Toyonase truck and IMHO is far superior. My only complaint about this truck is they take Sundays off which is almost always when i'm in the mood for a brunch taco. Oh well, any other day of the week they are usually their until 6ish, check them out they are delicious.", "author": "Karl L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-08", "description": "I enjoyed this place the owners are super friendly and one employee know what I like and I tell her \"Can my usual order\" which contains three steak tacos and can Coke and for amount of $5.50 not bad for someone on a budget.", "author": "Ackord R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-02", "description": "My god the yum!  Best al pastor tacos in the bay area, hands down.  Incredibly nice people.  Incredibly cheap prices, as befits a taco truck.  Basically, there's no reason on heaven or earth not to go there, and you're a fool if you miss it.", "author": "Paul G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-11", "description": "This truck is heaven!!! And they are SO sweet. There's a wonderful park right next door.", "author": "john v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-16", "description": "This is the taco truck of the Mission. My family and I come here quite often. They make very good al pastor. I usually order the burrito with combo al pasto and lengua. YUM!!", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-20", "description": "Fabulous tacos al pastor--just crusty enough.  The woman who runs the truck is the sweetest person imaginable--she sees me, just says, \"Tres?\"  I nod and by the time I get to the front of the line my tacos are ready.   By far and away the best service and best tacos I've found in any truck in SF", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-12", "description": "yummy is all i have to say. i'm carrying two tacos in my hand as i type. Can't wait to eat it.", "author": "Jasmine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-04", "description": "Favorite veggie burrito in the city.  I will edit this post when I get my electric scale back but the burritos feel to weigh at least 2 lbs. They use actual avocado instead of a b.s. guacamole like some places. And the lady who works here could light a wet match with her smile... so warm and friendly!", "author": "Dan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-04", "description": "Um...Yum.  I've had almost all their tacos and they are all very tasty.  Nice people too!", "author": "Brandon R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "The Gallo Truck is awesome.  The prices are good and the food is tasty.  The veggie options are reasonable and the server is a sweet lady. Thank you taco truck!", "author": "Bob J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-05", "description": "Holy shit I love this place. I always tip the woman working there big, cause when you make carnitas like that you deserve it. Never costs more than $5 to fill me up, no matter what you get (3 tacos, torta, or burrito). Chill out and watch the kids play.", "author": "Drew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "al pastor tacos with extra grilled onions.......crave away", "author": "Curt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-08", "description": "this place is the shizzle, this is now the best taco truck in the city , it did beat the one by best , 12 tacos not 6 next time", "author": "NAEL K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-26", "description": "My favorite taco truck within two blocks of my house. Great tacos, great tortas, excellent burritos.", "author": "Stephen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-31", "description": "This spot is really convenient. Tacos are good especially the carne asada.", "author": "Dr D J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-12", "description": "Best lengua torta in the city hands down. Plus it happens to be next to my house. They are always so friendly, they hook it up. The torta has a ton of flavor.", "author": "Christine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-21", "description": "Right around the corner from the toyanese truck (which is great), but cheaper and better!  $1.25 for a taco!   the same lovely woman has been running it for years - very homemade and fresh.  the tortas come on a long bun (kinda cuban style) and only $5 with all the trimmings.  the carnitas are a highlight.", "author": "Claire D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-07", "description": "I've tried the tacos within about a 3-4 block radius and this is easily my favorite.  In the mission, that means something.  The carnitas always have those great crispy fried bits, the lengua is always completely not scary, with a meaty texture and great flavor, and the salsa verde is always spicy and delicious.  Sadly, they are not open late.  Tacos are a buck fifty, with a double stacked tortilla and a good amount of everything- I usually turn mine into 2 little ones per.  Two makes a completely acceptable lunch.  Get a real sugar Coke for a total of $5, and I guarantee you happiness.", "author": "Jamie B."}
