{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "\"Oh no, not another burrito review from Matt G!\"\n\nDamn right, I love my burritos and nobody can take that away from me. Now give me a kiss!\n\nIn all seriousness, who would've thought you can get a solid silver bullet from the NoPa area? For $10.00, which is the average cost in the area, I get a grilled Carne Asada, fresh and sharp cheddar cheese, a perfect amount of guacamole, sour cream, salsa, beans and rice in a flour tortilla. The grilled steak had a nice crunch and bursting with smoky flavor. The taqueria also offer different kinds of tortillas. But I am cool with the standard white tortilla as the wrap. \n\nYou know I got to have a brew with my wrap. The taqueria also sell Sierra Nevada Pale Ale and a few draught brews for $4.50 a bottle. Now my meal is complete. \n\nThe salsa bar has various condiments including grilled onions and mushrooms. Those two are very popular and goes very quickly. \n\nThis is one of few along the Divisadero Street strip and NoPa area. But the food from this taqueria is really good. The cleanliness is a bit a work in progress. But I am all about a good burrito.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "It's a really nice place for eating your heart out. The service is nice and kind, portions are huge and the price is very reasonable.\n\nThey have a plethora of salsa options in the salsa bar which go well with the chips you get after you place your order. I ordered the chicken flautas (corn fried chicken rolls) which came with a side of rice, beans, gauc and sour cream. Everything was how you want your food to be when you're extremely hungry. I've tried their chicken enchiladas before and frankly, I liked that better than the flautas. \n\nThis place is open till late night and is definitely on my places to frequent!", "author": "Akshat G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "Awesome taco spot! It was our very last night in SF and we really want to end with a good food spot, especially the last taco spot we tried right before this place, was a huge disappointment. It was just about 10:30 pm at night, we walked out of our hotel with pajamas and we were determined get better tacos here. \n\nWhen we got here, it was already looking better because this is how a taco spot is supposed to look! We saw the garnish bar where you can grab your red sauce, green sauce, beets, limes, and etc. Yes!!! For the food, we ordered three tacos: lengua, al pastor, and carnitas. We also got a side of guacamole to go with it. All three tacos were really good! Lengua Taco had to be my favorite. Each bite was the perfect mouth-sized and the meat was so tender that it just melts in my mouth. Al Pastor was a close second, I probably would like more pineapple bites in mine. Carnitas was also tender and flavorful as well. \n\nWe were both so satisfied with the tacos and could leave SF with a happy stomach!", "author": "Cynthia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-20", "description": "For Mexican food in San Francisco, this place is very average for its price.\n\nI got the Grilled Vegetable bowl and Super-ed it to add ingredients like guac, rice, beans and sour cream. The ingredients overall seem a bit subpar. The beans are not fully cooked, the rice felt more grainy than usual and the guac was not as tasty. I felt the vegetables tended to dominate each bite a bit more than the other ingredients, which are supposed to have more flavor. There was also free chips and salsa. The salsas were fantastic but the chips were extremely hard and tough to eat.\n\nI would recommend coming here if you're in the area, but maybe go for one of the specialty plates or something.", "author": "Sampath D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "I got the super veggie burrito with no sour cream and it was pretty good but not spectacular. The place was crowded and tables weren't bussed right away but they did take care of it and I'd go there again when I'm in the neighborhood", "author": "John R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "This place is one of the first places that I pinpointed  as a must try on my new Togo list. It's located in a pretty active part of town with restaurants everywhere and bars every other where.\n\nThis place has a lot of variety and choices. Looking at the menu, I thought it best to get the \"super\" tacos. Being a taco aficionado (look at my history), I assumed 2 regular tacos wouldn't fill me up. I got the al pastor and the lengua (pleasant surprise, no upcharge). \n\nWhen they came out with my tacos, I was shocked. The super taco is called super taco for a reason. It's topped with all kinds of things with 2 corn tortilla (each) under all the toppings. It was delicious and super filling. The pastor and lengua were very well executed.\n\nThe staff is really nice and laid back. The place isn't big but it's average/on the larger sized for that area. \n\nDefinitely would recommend.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "Smackin!! Lots of foot traffic but service was still quick. Got the super burrito with carne asada - authentic AND tasty. Their salsa bar was pretty good too.\n\nThis spot is near Emporium SF which allows outside food. Grab their food and bring it with you to Emporium!\n\nSuggestion: For even better service, they can empty out the trash/food tray bins more frequently. All of them were stacked up noticeably high.", "author": "Bryan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "You know what?! This place isn't bad?! They have a big menu with lots of options to choose from, unlimited salsa bar, opened late night, AND they accept Visa & MasterCard. This is a huge plus!\n\nI personally like their food! It's a great alternative to El Faros. I ordered a steak & shrimp burrito which was delicious and had the right balance of ingredients and flavors. The shrimp was meaty and their carne asada was grilled just right. Their food isn't salty either, which is always a plus. It's a bit expensive for the food by maybe $2-$3 compared to other hole in the walls but because they take cards and opened late, it doesn't bother me. \n\nMe and my friends had an excellent time here and will definitely stop-in again.", "author": "Allister D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "Summary: Great service and large portions at a cheap price that will make your mouth water and stomach super happy!\n\nMy friends and I came here for the first time and ordered their nachos and wet burrito. That was our first mistake, ordering two dishes with two people because the plates came out to be huge! We ended up taking home the leftovers. We thought the carne asada was made just right so that is was still tender and juicy. The burrito was stuffed with lots of meat and had little beans and rice. The salsa, guacamole, and sour cream poured over the burrito were also paired really well. As for the nachos, it was also layered with delicious carne asada, beans, tomatoes, and guacamole.  \n\nAside from the dishes we ordered, we were also given chips on the side and there's a complimentary condiment station across from the cashier. The service was great. As first time comers, we didnt know whether if we should wait for the food at the cashier as it seemed like a fast food place, but the lady told us to sit down and later brought the food to us.", "author": "'Cindy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Might be a lil blasphemous but......  better than the Mission places (imo)......  EEK!!\n\nI've only had the quesadilla (many, many times).  Friends had the burritos & tacos...  They liked 'em.\n\nI get - Pollo asado, super quesadilla (Guac, salsa & sour cream on the side).  It's huge, meaty, cheesy, flavor packed and somehow the flour tortilla is still crispy.  They just don't make it like this in the Mission and it's on par price wise (~$10).  Plus free chips & Salsa bar.  Open til midnight & accepts cards.  Handful of TV's, watched World Cup prelims.          \n\nGood Lord.  Need a fix, STAT.\n\nSee pic (and that's only a half!!): https://www.yelp.com/biz_photos/el-rancho-grande-san-francisco?select=0baB5Nds30_OM52uvCD1fw&userid=WQ41N9RsEa8I1HVivYo3iQ", "author": "CatwomanRoar M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "Best tacos in the Divisadero corridor. Consistently delicious, great service, and super nice people behind the counter. Plus they take credit card!\n\nThere is a huge selection of specials and meats but carne asada is the way to go here. Love the variety of condiments in the salsa bar. Get a small cup of the pickled red onions and habanero if you want to take your taco game to the next level!", "author": "Joanna X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Love this place! Moved to SF about 4 weeks ago and have already been here 5 times. I've gotten the super quesadilla with pollo en salsa and a fish burrito. I preferred the quesadilla, but all the food I've had from here is delicious and it always comes out quickly. You always get a free basket of nachos, and there's a full free salsa bar that's great. Also, the service has always been very friendly and accommodating. The place itself is very clean and welcoming, with a very clean bathroom as well. I will definitely be back and I recommend this place to everyone!", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "One of the best pastor fries in the city! Guac and sour cream are the perfect top off to the plate! There was so much pastor, enough for each bite with the fries! They are very generous with their portions. Called ahead at 1am on a Saturday and it was a good idea. The place was packed. Every table filled and still a line almost out the door! That how you know ;)", "author": "Megan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "I love this spot! I live a few blocks away and always will head over here with friends or if I need a late night snack.  My go to is their cheese quesadillas, OMG so oily, cheesy and yummy.  It's the best cure to prevent a hangover the next morning.  I also loved their fish tacos.  They are pricey but very good quality and tasty.  One of my favorite parts about this local spot is that their salsa tastes great and is actually spicy.  I will keep coming back here for some good quality Mexican food.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "Very hearty and filling burrito for around $10, salsa bar is legit too! Open late is an extra +. There's only 1 cashier and a few cooks so things might take a little time but it's worth the wait", "author": "Shermond W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-18", "description": "Great Mexican food at fair prices. Friendly staff. Kind of a dive, but very chill. The menudo\nIs delicious.", "author": "Sergio H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "This place is so good for late night hunger pains! I went with a friend and we bumped into another friend of mine at 11PM!! It's down to the basics in terms of seating and such but no one comes here for the ambiance. \n\nWe met up and sat together for some chats and giggles. The tacos are so good I had to order more! It's good portioned, fresh, and packs a lot of flavor. But nothing was too overwhelming. It feels high class but at a really affordable price! That's the best combo I could ever ask for! \n\nMy friend's burrito is really long and fat and he finished it all...\n\nI think this place is so affordable, convenient and better than a lot of places I've had. I will definitely visit again soon.", "author": "Lana W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Let me be succinct: work till midnight, delicious tacos and you can't beat the price. What else do you need? Great job guys! Love you", "author": "Galina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Fast! Super good salsa bar and they offer a vegetarian version of a Cali burrito you just gotta know how to ask for it! Y'all are crazy for not giving this fine establishment 5 stars! Straight trippin dawgz!\n\nDo yourself a favor. Get the California burrito. You won't be mad.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "I live in the sunset district area and just so happens this burrito joint is the nearest to open at around 1am compare to Mission, so this place isn't bad at all, warm tortilla and the steaks with melted cheese and best of all.. free salsa bar!! habanero salsa is a plus for me!!!", "author": "Wallace W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-29", "description": "I've eaten here half a dozen times since I moved to the neighborhood. I always get the Burrito Mojado with Carnitas, because it's incredibly delicious. However, every time I eat here, I have GI issues. At first, I wrote it off as a coincidence, because I love the food. But I keep finding myself on the toilet after eating here. This last time was particularly bad, taking several days to recover. I'm bummed to have to give this place up, but it's just not worth it anymore.", "author": "Ben H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "First and foremost, if you attend USF - this is easily the best Mexican spot near school. I live in the Richmond and the Mexican options are abysmal. On campus, when you look up \"Mexican,\" all you'll get is Papalote (sauce good but food mediocre) or Chipotle.\n\nMy review only stands for the tacos and elote. The regular tacos are $2.95 which is pricer for my SJ ass, but better than SF's $3.50 standard. The elote hits the spot for $3. Open salsa bar, and free chips with purchase. Straightforward and I like that this isn't some bougie, gentrified BS. Put money towards POC-owned and local business, y'all.", "author": "Jacquelyn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Rancho is consistently delicious. I've eaten here dozens of times over the past few years. It's definitely one of the city's most underrated, under-appreciated taquerias. The ingredients are always fresh and flavorful. The staff is always friendly and accommodating. Plus it's one of the only affordable restaurants left on Divisadero.\n\nI assume that anyone who gives the place a bad review either has unrealistic expectations for cheap Mexican restaurants or orders online (pro tip: don't order burritos on the internet. There's a 90% chance you live within walking distance of a taqueria. A bumpy 30 minute ride in the back of a crusty delivery car will ruin just about any meal. So take advantage of the fact that you live here and go to restaurants in person!)", "author": "Austin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Best pastor outside of the mission, with really solid chipotle salsa that's actually spicy. Far to much of the chipotle in the world has no umph to it, but theirs really hits the spot. The portions are grande with a particularly chill price point, especially being the only legitimate taqueria around. Nopa has relatively few affordable options for a full meal without having to wash dishes to cover the bill. This nook is a lifesaver for those of us not making a tech wage.\n\nPro tip - elote (grilled & spiced corn) is super cheap, filling, and ridiculously yummy.\n\nFriendly staff, rarely a line. I'm a fan.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "So good. They hook it up here! Mushroom quesadillas have other veggies on them too and it's so cheesy and good. Free salsa bar with chips. I'm a native of south central Texas so I feel like I'm at home when I come here :) cheap, too! A single taco is a meal and it's like $5. Can't go wrong!", "author": "Shelby B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Good assortment of meats for Tacos including Buche and Lengua.  Salsa Bar is always a bonus ! The medium guacamole was pretty darn good for 2 people to split.", "author": "Moon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "This is my local spot. As divis gets fancier and fancier, it gets harder and harder to find a decent meal on the cheap. Is this place clean? Not particularly. Does it have good, spicy salsa? Absolutely. Is the Al Pastor good? It's the bomb. Personally, I think tacos are far superior to the burritos at this place, but to each their own.", "author": "Alison H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Loved this place. Chips not worth it, but the super quesadilla with carne asada was HUGE, and the best quesadilla I've ever had. Salsa bar also nice.", "author": "eliza c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Being a San Francisco native I have been fortunate enough to enjoy the plethora of taquerias in San Francisco throughout my life. As this city has inevitably changed over time, it is nice to have a great spot like El Rancho Grande that continues to serve its loyal customers with great meals. As much as I love their salsas and el pastor, I always come back to this institution on divisadero because of their genuine customer service!", "author": "Aristos K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-01", "description": "Came here after ordering on yelp and they didn't get our order. Alright, no big deal. After they said it was alright, they retook our order and we waited. 10 minutes later, they hadn't even started on it because they wanted to sort it out. Really? 10 more minutes later, my phone showed me the yelp confirmation and I showed it to them so they got started on it. Really? Even then, they were still working on the yelp glitch.\nTook our chimichangas elsewhere to eat because this place is just filthy and well, they were alright. Not great and nothing to tell you about. Everything is very low quality and old tasting. The salsa is bland. The chimichanga was soggy. I don't recommend eating here unless you're tight on cash I guess.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "My friend David took me here after playing tennis. I got the steak California burrito with french fries. It was very good. I like this spot more than say Papalote. It has real authentic Mexican food with an exciting menu.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-27", "description": "The food is fresh, flavorful and reasonably priced. Not amazing, but good and inexpensive. Their salsa bar has a good variety of fresh salsas, perfectly grilled peppers and crispy radishes. The music is tasteful, rural, and soulful. True country \"a la mexicana.\"\n\nOn the minus, Rancho Grande really needs fewer things on the wall and lighter, fresher paint. Soap dispenser is broken and open, bathroom needs a paint job and to be spic and span. The restaurant tables need to be wiped and floors mopped. The place lacks good fans/ventilation and open windows.\n\nIt has great potential. Service is good. Really just needs investment in:\n\n*Proper ventilation\n*Paint and hygiene \n*Aesthetics and decor \n\nSuggestion:\n\nMenu is a bit too much. Fewer dish options would allow for a nicer, cleaner looking menu. It would also lead to fresher food. \n\nTry it! Enjoy inexpensive comfort food and help this place invest in its growth.", "author": "Maria Del Carmen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-02", "description": "Great addition to the neighborhood food scene. Standard taqueria fare, well done, plus hearty Mexican soup. Service is a little gruff as others have noted, but part of the experience.", "author": "Clark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "This place is really solid. It's quickly rising in the ranks of my personal taqueria preferences. The food is fresh and tasty, it's open late, the menu is varied and vast! Even on a pretty restrictive diet I have many choices here. The people that work here are so nice as well. \n\nI asked the cashier what her favorite soup was and she said the chicken or the beef. I went with the chicken and was not disappointed. Clear flavorful broth, generous pieces of fall-off-the-bone tender chicken, and good fixings to go along with it. I will definitely order his again and would be happy to try the beef soup as well. \n\nMy roommates love the chicken Mexican salad and order it frequently. So glad I've started to frequent this spot. It's also much more affordable than the other casual dinner spots in the neighborhood.", "author": "Sam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Omg ! Burst of flavors in my mouth and boy they are not stingy with their taco fillings .. and the sauces like 7-9 of them , I have never seen so many of them and one better and unique than the other .\n\nI have had my share of Mexican food( including mission street and Michelin Star ) , but this one will be my fav from now on .\n\nAlso .. buh byes to TLC( the little chihuahua ) not paying $15 for a burrito !  All are welcome and they are open till 3:00 am .. I respect establishments that cater to late nighters and much late nighters ..", "author": "Feedback M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "I have noted El Rancho Grande for years as I picked up my little Star pizza. You know...in the back of your mind you say...I should try that place...but never get around to it.\n\nMy hesitation was probably the outside appearance. Sorta like that person that is not the most beautiful but has an amazing personality.\n\nDon't let the outside deter you. Don't let the crazy large diverse menu deter you...yeah I know a cheese steak at a tacqueria is pretty disparate.\n\nEl Rancho Grande serves awesome burritos and tacos. The tortilla is grilled just right. Their seasoned rice is great. Their Al Pastor is wonderful. Their Salsa is delish. Portions are crazy big.\n\nGreat free Salsa bar with all kinds of great sides: jalapenos, salsas, and marinated veggies.\n\nBurrito comes with chips ( chips are sorta meh)\n\nI definitely like this place and will come here often as the food is fantastic.\n\nHighly recommend\n\nThanks yelp!!!!", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-17", "description": "I get my steak fries from here and they are very delicious but the way they cut up there meat and vegetables are careless. While eating my fries there was like Chunks of like fat or bones in my plate and then I found a avocado pits in my played. They also had a piece of papers towel in my plate which was a little disturbing. However, the good was great and for the size and serving it is well worth it. Food was great, presentation was great. Take more time in serving the food.", "author": "Theresa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-02", "description": "I always get the salad because I love the dressing.  But for $13, I'm pretty tired of them forgetting ingredients or barely putting any of the ingredients that aren't lettuce.\n\nUpdate: another ingredient forgotten.  I just want to get what I paid for.  This has happened so many times, I'm not coming back.", "author": "Melissa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "Delicious burrito, delicious salsa bar, terrible margaritas. I'll return for the food for sure", "author": "Eric B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-02", "description": "Food was decent but service sucks. I ordered on yelp but they claim they never got my order so they charged me twice which I need to call about. \n\nAlso when you walk in they just stare at you, no greeting whatsoever. Then the girls continued to take my order with soooooo much attitude which I don't understand why.\n\nThey just threw my chips in the bottom of my Togo bag and no salsa", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-27", "description": "I got the tostada which I regret. Maybe the chics attitude when she ask are you ready?  or maybe i didnt speak spanish to her.  But i got the grosses looking tostada on earth. The meat was chewy like beef jerky plus it looked like slop. I dont recommend if your looking for good quality mexican food.", "author": "FoodieBy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-09", "description": "It sucks! Customer service is terrific, they're never open..the food is not tasty, the waitress are rude...i won't go back...don't recommend this place. I went to a Chinese plack back from it and it's much better, I'm not fan of chinese food, but when it comes to customer service...this place sucks", "author": "Maribel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "This place is BOMB!!!!! Not the fanciest and a lot of people are coming in and out but it doesn't matter bc the food is SOOOO GOOOD! Hands down BEST michelada! All of their items are amazing! I have been there drunk and sober and every time it's just AMAZING! Also nicest people even when they are busy, which is almost always!", "author": "Cecilia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Holy shit. Mission style burrito at its finest. Went with a large group of friends; all got burritos but different meats. \n\nAll of us were blown by the burritos. Salsa is great, maybe a bit not too fresh, but the amazingness of burritos compensated and got rave reviews. \n\nWill come back whenever in the area.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "This was the first restaurant I went to when I moved to San Francisco. Little did I know, it would be one of my FAVORITES. This is a very good place to get a SUPER BURRITO", "author": "Bennett K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "Fantastic California burrito. They fry the fries a little harder so they add a lot of texture. I really only get either the California or super burrito, and usually stick to carnitas.\n\nIf you really want to eat an extreme amount of food, the quesadilllas are good also.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "I'm embarrassed to admit I go here weekly. I'm a vegetarian and Rancho has some delicious options (albeit guilty-pleasure level!). Their super quesadillas with beans instead of meat is my favorite. \n\nService is always friendly and efficient. Food is consistently good. I'm grateful to have a down-to-earth and unpretentious restaurant in my neighborhood!", "author": "Virginia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "We've found a new neighborhood gem! \n\nKey points:\nFriendly staff\nTakes credit cards/debit\nSalsa bar\nFree (& fresh!) chips\nVariety on their menu (including fish tacos)\nBig portions \n\nI got a super taco because I wasn't hungry and found myself committed to a meal! I've never seen such a large taco. I had to eat it with a fork. It was piled high with carne Asada, guac, lettuce, pick de gallo, sour cream and cheese. So much cheese. All for $5 too. \n\nMy buddies seemed to enjoy their orders as well. One got a steak ranchero & the other a chicken burrito. I recommend for a fast tasty meal.", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "Pretty good mexican food, and open late!  Like, really late on weekends!  Great for getting late night munchies after the bars, and they have a huge variety of mexican food.  Everything from standard burritos and tacos to mexican soup and micheladas!  \n\nSolid late night spot with a wide variety of menu items.  Bonus points for being close to my house for easy late-night access", "author": "Keith C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-11", "description": "The chips, cold and stale .. flys all over the place inside .. very sparing on meat.. and it was bland Burritos..  \nservers were very nice and polite and the place was very busy ..which was a surprise .. \n\nMaybe they have other specials?", "author": "Ruth M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-09", "description": "I've been here many times and their burritos and quesadillas are pretty good.  Here's the problem - recently the place has started to smell bad.  You walk in and you are hit with this wet dog / rotting something smell and it's no bueno, makes me question every burrito I've ever had there.  I really hope they figure this out and clean it up.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Delicious divey Mexican joint! I've been here a couple of times and the staff has been incredibly friendly. My orders have been correct even with multiple modifications. Great burritos however I've only tried the carbs asada. Just moved to the area and this is going to be a late night favorite!", "author": "Karenna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-02", "description": "Finally a decent taco spot in SF!!! It is so hard to find good tacos here. People think they know good places and then I think they must not have ever had a decent taco and I cry a little bit inside.\n\nSomeone told me this place was great but I was so doubtful I almost left after standing in line for a minute. Glad I didn't. These are great!\n\nTotally normal, tasty, tacos! Theyre a little expensive compared to socal but at least they are good.\n\nLarge portions of meat, quality meat, quality other ingredients, a solid salsa bar, totally on point horchata, great service, bright, clean.\n\nFinally have a good taco place in SF!", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "This is my go-to spot for fairly priced, quality Mexican food on Divisadero. Some of my favorites are their Carne Asada tacos and Chili Relleno. They keep it real with prompt service, a great array of salsas, and a classic menu that never disappoints. Also open late, which is always a plus!", "author": "Shannon A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "This place brings me so much joy. Their burritos and quesadillas are incredible. Even their french fries are good. Highly recommend.", "author": "Ali A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-07", "description": "Although i love there tacos today's complaint is regarding customer service. I ordered a super taco chicken, no guac with black beans. I came home to a taco with guac, refried beans and no sour cream. I haven't had refried beans in years. My best friend ordered a shrimp quesadilla and the shrimp wasn't consistent throughout her meal. We are residents of this neighborhood and we should be serviced with better care. If the woman at the counter or chefs behind would have listened/read my request for food i am paying to enjoy, my meal would have been worth it if my order was taken properly.", "author": "King DJane M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-28", "description": "Came here after a late night out for some munchies. The burritos were pretty good and reasonably priced. Great hot sauces. \n\nBeware though - they only take cash! ATM on site", "author": "Max M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "One of the best taquerias in the city!! Real authentic Mexican food for a great price. Super friendly staff, the place is not intimidating at all. One of my favorite Taqueria's in the area because of its authenticity.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "I love my neighborhood Mexican spot!! Always yummy & filling! Do yourself a favor and treat yo self!!", "author": "Blair M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "They were open!\nWe were driving around San Francisco it's such a beautiful city but very limited on places to eat after midnight.\nWe stumbled upon this little place and lucky for us,\nservice was fantastic good crowd and as you can see by my photo the portions were great.\nTaste was authentic and the atmosphere just right if you're looking for a place in San Francisco to get your eat on after midnight this is a place for you, BAM!", "author": "Mike F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-03", "description": "Went there last night after laundry. Was pretty busy, and the cashier was really friendly. We were hoping to find that little hole in the wall place that has amazing food. This wasn't it. The horchata was good, honey bunny ate all of his super burrito (he said because all he had that day was a piece of cake). I got a wet burrito and an elote. I didn't know kernals could be that small on a cob. Flavor was pretty good, lips were burning for awhile after. The wet burrito was just off. Couldn't quite put my finger on it. It had sweet undertones. The pastor was bland, except for the char on it ( so burnt flavor). Not very cheesy, and like I said something tasted sweet. It was so off putting that I just couldn't eat it at all. Which when you pay $40 for 3 burritos was so disappointing. In a house of three, they got 3 thumbs down.", "author": "Monica F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-08", "description": "I really wanted to like this place off the stellar yelp reviews but I was a bit disappointed. I had the enchiladas and margarita. I think I just ordered wrong because the super chicken burrito was pretty good. It was freezing in the restaurant with about 8 tables for sitting.", "author": "Jessie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-03", "description": "Super yummy- got the carne Adams's burrito. Salsas were all fantastic tasting, and the area was super nice an presentable. They take care! The prices are INCREDIBLE- I paid like 13.45 for the reg burrito and a cheeze quesadilla, (which is ONE quesadilla, but described as two corn tortillas- may sound obvious now... but I ordered quick. TINY quesadilla lol.) Burrito was so big I saved the second half for another meal. Will eat here again.", "author": "Davey S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-18", "description": "Just utter crap food, paired with indifferent service. Do not get all sentimental when this place gets replaced by Gentrification Deli with $14 bagels, because El Rancho Crapo is the Sick Old Man of Divis. Seriously, I only ate there because of the average 4 star review on Yelp, but now will spend my next 5 years working on a time machine so I can go back and stop myself. \nDo. Not. Eat. At. This. Craphole.", "author": "sellMyFing n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Huge portions here. I usually order a chimichanga which comes with rice and beans on the side. I always have more than half of it as left overs. Try the barbecue chicken, its sweet and a nice change to the traditional Mexican meats. Each meal comes with free chips and access to their amazing salsa bar. They have at least 12 salsa options. \nI usually take it to go since I live near by but the inside is simple and has TV's to watch sports.", "author": "Katelyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "The best damn burrito in SF, hands down. As a Mexican person from San Diego who's eaten her way through every acclaimed burrito in the mission, I have much to compare this place to. It's truly a gem. Every time I eat this burrito I'm shocked at how perfect it is. Amazing carnitas, great rice and beans, no drippiness. El Rancho has a cult following in NOPA and at the risk of increasing popularity to the detriment of wait times, get the super burrito, ask them to grill the outside, and top it with the hot salsa.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "I'm in town for the weekend and thought I'd check in with Yelp for some inside tips on food. This place had some good reviews.\nThere were 5 of us and each of us order something different. A California Burrito that I had a bite of was excellent. The carne wasn't super tender (or at least the bite I had) but the taste was fantastic.\nThe Milanese plate was quite good. The meat wasn't the same as I or my mom used to make but I can't ask for that. The rice and beans with a corn tortilla was sheer comfort food and took me back to childhood. \nMy daughter had the fried fish tacos and although i didn't try it she said they were very good. My step daughter had the Super Burrito and I didn't get a chance to try it because it was devoured quite quickly.\nI had the Milanesa torta without the sour cream. And that was truly amazing. I wanted another one. The flavors blended quite well and the bread was very fresh.\nI would definitely go back on my next trip.", "author": "Eric P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Best Horchata and churros ever.  The sweetness and grittiness of the drink are perfect! and the churros have a filling in them that just oozes out when you bite into it.\n\nI really liked all the food I've gotten from this place.  The super burrito and the breakfast burritos are delicious :) The cashier is also super nice.  You get to choose what type of tortilla you want too (spinach, regular, tomato, etc).\n\nOpen late (3 am) on weekends so perfect for late night food.", "author": "Lydia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-13", "description": "Rancho Grande is one of my go to Mexican spots in SF, and a great place when you are in a hurry.  Located a few blocks from Fell and Divisadero, street parking is usually easy to find.\n\nThe tacos are good, the carne asada is moist and the lettuce is cold and crisp. I like the salads also, the caesar salad has lots of meat.  The salsa bar is one of the best in SF.  Spicy salsa, good habanero salsa as well as salsa verde.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-19", "description": "Hell no!! Never coming back to this place!! The fish fried tacos are too expensive and are terrible", "author": "Heydy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Food was great! Agua fresca was so delicious! Had nachos to share with my table, had vegetarian tacos, were so big had a hard time eating them all (in a good way!)", "author": "Meg M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "Great mexican joint that's priced right for the value. \n\nHuevos con Jamon breakfast burrito is my favorite item on the menu. Quick service, tasty, and filling. Exactly what I want out of a burrito/mexican spot.", "author": "Nick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "No nonsense fajitas make this place a win. Go in, order the shrimp version, and enjoy each bite with the guac that comes with.\n\nSo my fiance and I went to grab a bite Saturday afternoon. It was an odd hour, so the restaurant was nearly empty and there was no one in front of us. We took a while to decide but finally ordered a shrimp plate without the cheese, beans, rice or tortilla....\n\nand it STILL turned out  delicious. Why did we take out so many ingredients? We're not on a low carb diet, we're on a whole30 cleanse. So no dairy, legumes, grains, or vegetable oils. Potato is okay, but they only had fries.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Came for just a good ole casual dinner with some friends. Menu is too huge for me to make a review on the whole picture, but I liked what I got and want some more!\n\nIn honor of seeing Deadpool recently, I grabbed myself a chimichanga with pastor. That baby was just packed with meat. With rice beans and veggies on the plate you'll have a very large meal for a single digit price.\n\nOther items I got were a strawberry agua fresca that was very sweet and refreshing and some corn. Classic seasonings you'd expect - the lime, the spice, the cheese. It's a little slippery and lightly seasoned compared to other takes, but it was still very good and worth 3 bucks. \n\nIt's a solid Mexican joint with great prices and a lot of options. Eat up, bub.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "I tried the Milanesa and it was bomb. I just moved up to SF and I already found a place where the food reminds me of home and my moms cooking.", "author": "Karina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Came here based on the reviews and was not disappointed...food was prepared quickly and the portions are quite large.  The food is very tasty.  My wife had the burrito, perfect combination of rice and meat and cheese.  Tons of flavor!  I ordered the fish taco which was also really well done.  We could have just both split the burrito as it was pretty big!  They have an assortment of salsas which were also very good too!  Definitely coming back!", "author": "Mike R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-15", "description": "Solid tacos but not the best I've ever had. Slightly dry chicken and pork. Would recommend the quesadilla and carne asada taco", "author": "Dylan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "Solid Mexican joint. I recommend the shrimp and steak burrito or the camarones a la diabla.", "author": "Keith B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-17", "description": "The food at this taco shop is offensively bad... They don't even warm the corn tortillas for their tacos so you end up with a brittle, cold, stale tortilla that falls apart the moment you try to pick it up. Also super overpriced. Absolute worst taco shop in a city already filled with bad taco shops... Someone please go to San Diego and learn how to cook real Mexican food and bring it back up to the Bay Area.. I BEG YOU!!!", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "My boyfriend and I love Mexican food, and since I moved to the area, are shocked to say that this might be the best Mexican we've ever had.\n\nHave gotten the burritos (8.5/10), the tacos (10/10) and the quesadillas (10/10), along with the churros (10/10) and the horchata (10/10). The fact that this place is also open late makes it such a star. I've come here more times than I'd like to admit for dinner or lunch, and have nothing but amazing things to say. Quesadillas have for some reason always been what I gravitate towards, and theirs are huge, soo good!\n\nGreat prices, fast service, incredibly great food. Only love for El Rancho Grande! Grateful to have it as my local go-to.", "author": "Abby H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "Tacos tacos tacos and quesadillas! They have very friendly service, I recommend trying the ensaladas if you've never had them, but if you want to stick to the classics try the tacos or quesadilla. I recently tried the tostada it was overwhelming to have so much beans/and guacamole on a little shell, so I wouldn't try that again. Pastor tacos, has a spice kick to them, but they're sooo gooooood(:", "author": "Camille B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-30", "description": "By far my favorite Mexican restaurant in the city. The price for the food is reasonable in accordance to the portion they give you. \n\nYou cannot go wrong with carne asana and al pastor! I absolutely love this place and recommend it to everyone. (:", "author": "Breanna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-11", "description": "I happen to end up here a lot after a night of clubbing. They're open late, have good prices, and give big portions. I always get the super burrito and it's super :). No complaints from me food wise. However, it can get kind of messy and dirty since lots of people late at night don't clean up after themselves at the tables.", "author": "Olivia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "The California burrito here is amazing!!!! So are the flautas. The enchiladas though were very bland in a weird tomato sauce.. quick service and great authentic Mexican food (for SF!)", "author": "Jessica V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-01", "description": "Cheap abundant low quality food - we went based on 4 star rating on yelp but we realized that the ravings were due to pricing rather than taste. The place is a dive. We had the chilaquiles and the burrito mojado- guacamole was old, salsa fresca was not fresh and the cilantro was barely there... huge quantities of oil, sour cream and greasy rice and beans - not what we had been hoping for at all... our bad we should have read the reviews before we chose the place rather than just looking at the rating", "author": "Marci V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Food is okay, but what can I say? Sometimes you just love a great local spot with decent prices. Also, thank you for being the only place open late at night on Divisadero!", "author": "Russell W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "They got some of the best burritos in town! Salsa on point too. Especially the verde and chipotle.", "author": "Chandra N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Omg omg omg the best steak burrito ever great service as well and the sell tall cans and have ice cold beer mugs if u want Mexican come here this place was amazing", "author": "Anna T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-20", "description": "I was excited to see they had carne asada fries on their menu which is a true rarity in the bay area but the fries were lackluster. Fries were soggy, could barely taste the marinade in the carne asada, and overall not of good quality. Their carne asada tacos were bland too.", "author": "Briget P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "It's not the best Mexican food in the city, but it's pretty damn good. Everyone who works there is very sweet. Carne Asada burrito is one of the best. Beat Mexican place in the area and open late.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "I live right around the corner from this place and I have been going here for the last year. For a go-to late night spot, you can't really beat it. It's not going to be the best cuisine you get in the city, but get their super burrito with Al Pastor and pack up a couple of fresh salsa's and have a good time.", "author": "Tate B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "I had the chicken chimichanga burrito.  Perfectly deep fried, chicken was moist and delicious, comes with beans and rice and chips!  Such a good deal for under $10!!!!\n\nBye Little Chihuahua, nice knowing you.  I'll stick with The Big Ranch from now on.", "author": "Tom N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "I eat at El Rancho Grande more than I care to admit and it's always a combination of remorse and pleasure. I've never been here before midnight, so that should tell you a little bit about the type of taqueria it is. They say they are open till 3 AM on weekends, but most of the time they close around 2 AM, which has often caused a lot of drunken strife. The food is pretty average, oily but delicious when you have the drunchies. Their nachos are very satisfying. The portions are huge and their super veggie burrito, my most ordered item, is pretty standard quality. I wouldn't put it on par with  Taqueria Cancun or El Farolito, but It's more than passable and gets the late night cravings taken care of.", "author": "Shruti S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "Food (4/5) - shrimp quesadilla is sooooo good. Normally I dislike tortillas, but the tortilla here was perfect. It actually reminded me of the roti/chapati you can get from Costco. Crisp on the outside but chewy on the inside, and a flavor that actually complements the filling instead of distracting from it. The shrimp were cooked perfectly! I feel like so many restaurants overcook shrimp but not here. \n\nThe nachos here aren't great, though - the ratio of refried beans to everything else is pretty high, so after a while you're pretty much just eating chips and beans haha. Stick to the quesadillas and burritos!!\n\nService (n/a) - You just order at the register and they bring it to you, so not really much to say here, but everyone who works there is friendly!\n\nValue (5/5) - My bf and I can split an entree for less than $10 and walk out stuffed, especially since most entrees come with free chips and salsa! Portions are seriously huge here.", "author": "Abby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Great customer service, Thanks Lilian!!! It's so nice to be greeted with a smile and spoken to with a now not-so-common manner. I'll be back, definitely!", "author": "Maya J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "I dont usually do reviews but the chimichangas here was too awesome it deserves a few words. Everything was just right for a fair 10$. You even get free chips with an absurd amount of guacamole at the side. The only problem was the humongous portion which I barely finished. But then again I'm just an Asian with humble appetite. Please beware fellow Asians, this thing could easily feed a family of four back in my home country.", "author": "Minh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "Highly recommend !!! Love the nice Latina cashier at night ! Hi mama!! anywho place is definitely not one to sleep on definitely needs to be partnered with eat24 has many options to choose from especially when it comes to tortilla shells! Garlic is my fave by far. Many condiments and the area usually stays clean. Good for a late night grab as well. Food is usually made pretty fast and has always hit the spot for me. Don't sleep on this place !!!!", "author": "Coco L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-24", "description": "Came here for a bite before a show at The Independent. I got a basic vegetable burrito because A) they're inexpensive and B) I like to get a taste for the rice and beans of a Mexican joint I haven't been to yet...'cause if you fuck up a basic burrito, I'm not gonna trust your meat.\n\nBf had a super steak quesadilla...'cause homeboy likes to be all in.\n\nHalf an hour goes by and I start feeling queasy at the show but manage to stick it out until the encore set. Not without tons of acid reflux and nausea.\n\nBae agrees his quesadilla also made him feel not-so-hot. I'd come back here for a taco or two but probably not a burrito again.", "author": "Megan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-03", "description": "Best alternative after little chihuahua when closed. \n\nHad shrimp quesadilla and it was pretty good. Flavorful and they didn't lack on the shrimp portions\n\nI also liked their different tortilla options that you choose from -- spinach, original, wheat and etc\n\nUnlimited salsa bar is always a good thing\n\nThey also serve burgers and etc and from what I remember their fries were really good! Crunchy and not too salty\n\nI want more fries!", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "El Rancho tacos are the best. Lots of meat choices and chips and salsa are free! Staff is super friendly and there is pretty bomb Mexican food. My to go place for tacos in the area", "author": "Doreen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-15", "description": "This is one authentic Mexican spot. You rise at the counter and hey bring it to your table. They have a salsa bar that is as fresh as it gets regarding flavors. The super tacos are huge! I got a chorizo regular taco and carne Assad streak super taco, which was plenty. My husband and I shared a side of small rice and beans which wasn't needed because of how generous the tacos are. They also give you complimentary chips. The sangria was okay; not super strong, but a large pour. Defiantly a hole in the wall where all of the locals go. Would def go back on our next trip to SF", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Everything is perfect and I would change nothing.\n\nOh, except maybe putting the Giants on when they're in season.   But that's it.\n\nKeep it up!", "author": "Noah D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-29", "description": "Was it amazing? No was it good? Yes moist chicken but I think they put too much likes in the salsa, at least I'm hoping because it was sour.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Lately I've been wandering around without checking yelp first so that I don't miss out on hidden gems.  We were walking down Divesadero and I wanted a burrito so we ended up in El Rancho Grande.  The carnitas burrito was GREAT!  There's a very extensive menu that I wouldn't hesitate to come back to try out.", "author": "Lyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "holy moly! this is a small local spot, away from the tourist throngs. definitely passed the parking lot test, as it was pretty busy on a weekday afternoon. had probably the BEST quesadilla ever. \n\nthe food is amazing, the staff is friendly... go here!", "author": "Gennady K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "My fiancé and I stopped by before a show at the Independent. We shared a steak plate and some chips/guacamole.\n\nSO FREAKIN' GOOD. We were both so full because it was plenty of food and the marinated meat was yummy for an inexpensive dinner in a rush..\n\nSmall whole in the wall joints like this are one reason why I could not live anywhere else besides CA! Teehee", "author": "Jennifer S. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-22", "description": "The flautas are on POINT!!! They're a little small but they make up for it in taste and CRUNCH!!!", "author": "Alex C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-16", "description": "These are the blandest piece of shit, disguised as food nachos ice ever tasted in my Native San Francisco (GO GIANTS!) life. El Patetico should be the name of this \"taqueria\". Jokes!", "author": "Crystal N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-07", "description": "Came here for an early dinner! Typically my neighborhood go to is el burrito express, but honestly this place takes the cake! Authentic food and a menu filled with variety! The first time I came I got a steak burrito, not my favorite...however this time I decided to have the crispy taco combination plate! The plate was so delicious! Rice and beans super flavorful and tacos were crispy and chicken inside was tastey! I also love the fact that they have many alcoholic beverage options! I ordered the sangria and it was a great accompaniment to my meal! Will be back!", "author": "Christiana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-10", "description": "It's not the best taqueria in the city (see Taqueria Vallarta on 24th), but a place in this area that's decently priced and stays open until 3am? Win. This place gets packed around midnight because of all of the people in the area looking for nourishment after imbibing, but they churn out food really quickly, and for those of you who go after tacos when you're befuddled from good drinks, there's an extensive salsa bar. As for me, the El Rancho nachos will do just fine. For less than $10, you get a large stack of fries, cheese, guac, pico, and a meat of your choice. Chorizo is always a solid pick, but their carnitas aren't bad either. The meat is soft and ladled onto your food in large portions. Beer, al pastor, guac, what more can you ask for? You now have a legitimate late-night taqueria on Divis, San Francisco. Well played.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "Great late night food spot after bar hopping or catching a show!\n\nStaff - accommodating but not friendly.\n\nDecor - dirty, but art on the wall is interesting. Drunk people kept knocking it down so if something looks crooked please fix it.\n\nFood - bomb.com! We had the prawn burrito, fish tacos, and carne asada quesadilla!\n\nPrice - fair", "author": "James T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-09", "description": "Something happen to this place. The last visit, one burrito had no beans while the other no rice. One had a large chunk of beef with grizzle attached. Both burritos had a large amount of sharp cheese. When you bring back the old cook, let me know.", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "With so many taquerias in SF, sometimes I wonder why I bother reviewing them. But I loved this place!\n\nFish tacos - the fish is seasoned with what tastes like smoked paprika and grilled.  It's just the right amount of spicy and delicious. \n\nVeggie taco - loaded with lots of good stuff, not lacking in filling like a lot of veggie tacos. A nice layer of cheese between the two corn tortillas.", "author": "Sona P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-06", "description": "I wouldn't eat here ever again. I was expecting a good late night snack, but the food lacked taste and was disappointing. How do you mess up chips and salsa?? The chips were gross and oily. The enchilada platter made me sad.", "author": "Eliana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Great California Burrito (I've had it with Carne Asada and Al Pastor, both are amazing).  The salsa bar is filled with some good, addictive salsas.  They also have good options for vegetarians/pescatarians/health-conscious customers.", "author": "Kasey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "I love El Rancho's food, I love the people, I love the football and/or soap operas and I love the price. \n\nI'm a huge fan of both the Californian burrito and the super tacos, but I really haven't regretted ordering anything off the menu.\n\nIt's the best Mexican in the area!", "author": "Jamie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "1. Get the super quesadilla with steak. \n2. Slather it with salsa verde and habanero. \n3. Grab a friend to share because the portions are pretty huge. \n4. Eat. \n5. Be happy and satisfied.\n\nWhen El Faralito is too far, this place is a good substitute for your burrito/quesadilla/taco cravings.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Your authentic SF taqueria! I always get a super veggie burrito and it always tastes amazing! Cheap, yummy food - there's always a line, so it's a pretty popular spot on divis", "author": "Andreea C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-11", "description": "I ordered food and hour before I came by accident and called and asked them to make a new one she said OK I got to the restaurant and she tried to give me that our old nachos and try to make me pay for it again when I wanted to replace it ...then they made a new one for me free but the chicken is burnt and no beans even though I got super nacho and this is just not okay. Burnt chicken for 10$", "author": "Jasmine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "This place is close to where I was doing some work. Read all the positive reviews online and was a minute away. I arrived to what could seem to many as a shady area. However, the moment you step in, you see the cleanliness of the restaurant, and the scents of fresh tortillas and roasted everything takes over! The food is so yummy. Truly authentic and fresh. They take pride in what they are doing. This place has seating inside, but also great for quick take away. It's super casual. Will go back very soon.", "author": "charlotte c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "They're food is amazing! I find it really hard to locate taquerias that serve genuine and good food here in SF. But, El Rancho Grande beats all the places I have been too and it's fairly priced.", "author": "Ev R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-11", "description": "Came here lastnight and was really happy to see that they had different tortilla options that you can choose from! \n\nI had a chiipotle pawn and steak burrito and had to split it with my BF. It was HUGE! But everything was good.\n\nThe only reason why it lost one star from me is because I felt that I could have more Pawns in my burrito I only had 4 &&the burrito was huge! Mote pawns next time please! ;)\n\nBut the service here is fast and great! Ill deff come back!", "author": "Porsche C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "Oh, El Grouchy Rando. My secret crutch. I keep telling myself I need to stop loading up on chips and tortillas and cheese and rice and beans and chorizo, and yet, somehow, I keep finding myself back here, doing that same thing. It's all I could do to stop drinking the horchatas every day. The food is always decent, occasionally I get lucky and it's great, but it's never, ever bad. They make quesadilla suizas the good way... stuffed full. All the meats are decent enough. The service is pretty quick most of the time, even when it's busy. And it's open when I'm hungry, which is unusual. Not the sort of joint you'd ever think to rave about, I wouldn't call myself a \"fan\", and yet, I just keep coming back, frequently. There are not many things in this world I can't find anything bad to say about, but El Randy Groucho is one of them, so I guess that makes it pretty good. I like it. I'm glad it's here. El Raunchy Grando, don't ever change.", "author": "David K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-20", "description": "This isn't a chic Mexican restaurant that serves organic blue-corn quesadillas or grass-fed beef tacos with non-GMO sour cream. It's a local taqueria targeted for a very specific crowd. It's nice to witness a taste of Mexico without all the hipster culture typically surrounding Mexican food. And in that regard, El Rancho Grande is one the best I've seen. But nothing is all good, and in this case it was the overpriced food, stale chips, and bland salsas that really brought down the experience. The fish tacos were great, but seemed like a rip-off to me. The mushroom quesadilla was also pretty good, but pretty greasy with partly-melted cheese in some places (that one really bothered me). All in all, not bad, but not an amazing experience for the money.", "author": "Anonymous R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "Satisfactorily tasty and reasonably priced. If you're on a budget and hungry it's good. The super burritos are good too", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "Moved to the area recently from the Mission and spent my first few months longing for a Mission-style burrito. What am I saying?! That Mission-style's long-gone, replaced by couture shops and sterilized, sex-with-a-condom type burritos (hello Little Chihuahua); there is no more funk to the Mission. \n\nBut my brokenhearted, nostalgic mind digress's. This place is the real deal. Hella TV's blaring Spanish language sports. Beaming fluorescent lights beaming down on the floors still smelling of Pine-Sol. Salsa bar WITH radishes. Most importantly, you can get an excellent burrito for less than $10. Home sweet home.\n\nMy only note of skepticism is they have an EXTENSIVE menu for a taqueria sporting caesar salads, philly cheese steaks and hamburgers. Dubious but when it comes to the taqueria-fare, they'll keep it real. \n\nI've had nachos, burritos and tacos with al pastor, carne asada, cabeza and carnitas and all of them have been good--EXCEPT for the carnitas. I've had three different things with carnitas and they were all disappointing. Most places don't do carnitas well but theirs is particularly dry and bland. Avoid it but enjoy everything else.\n\nGive'em your business and tip them well!", "author": "Mario T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-07", "description": "We came to El Rancho Grande on the 4th of July post Fireworks.  There wasn't much else open, but it filled the void in my stomach.\n\nI got an al pastor taco, and it was fine.  For the portion and ingredients, I feel like you can find other better and cheaper places during the day.  Nothing special but also nothing wrong with it.  The salsa bar was pretty awesome, though.\n\nI wouldn't come back here, though, after seeing my friend's meals.  Two different people ordered queso dip, and it was actually a melted slice of cheese.  It was really odd.  The burritos were giant, but after tasting one, I wouldn't stray out of SoMa to come back for one either.\n\nThe bathrooms were fairly clean at least!\n\nJust A-OK.", "author": "Amanda J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "Came here during lunch hour which means it was pretty busy. They have a great system where they take the orders really fast and also make the food fast . I love all of the condiments they have from different type of sauces to caramelized onions and fried jalapeños. I got the mushroom quesadilla and loved it !!", "author": "Karen G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "I am really tempted to give this little place 5 stars, but it's fast food, so I can't. \nThe first thing you notice when you approach the order counter is one of the most beautiful menu boards I've ever seen, and a Mexican Restaurant like this was my first job and the beginning of 25 years in Food and beverage. \nThe second thing you notice is the smiling happy friendly young lady behind the counter, that although she's very busy, manages to accomplish her job perfectly, all the while seeming to really love her job. \nI had the prawns burrito, a personal favorite, with no salsa and easy on the rice. It was prepared perfectly and sublimely delicious. The prawns were so large it would be impossible to consume a whole one in one bite. It wasn't until I was packing up the other half of my burrito that I realized how exceptional my experience had been. \nSo I said thank you to the nice still smiling young lady that was single handedly managing the front of the house, and she almost laughed when I told how much I enjoyed the food. I wonder if she hears that a lot, probably does. \nThis is not my usual haunt but I will be going out of my way to come here a lot.", "author": "Monte H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "Legendary chimichangas! My girlfriend and I have come here twice in the last week. They also have great salsa and fresh lines out for your convenience. This is a great place for getting fresh Mexican food, I certainly would recommend it to anyone.", "author": "Mac J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "We really enjoyed the super burrito and the taco, both with al pastor. Would definitely go back!", "author": "Mackenzie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "Was literally the best California burrito I have ever had, and I'm from LA. Very authentic, many items here to choose from, and great side condiments at the salsa bar. Also any place that gives u a side of chips with your order for free is winning in my book. Would come back here no questions asked.", "author": "Ryan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "Hands down, my favorite Mexican spot in the city.\n\nGotta love the salsa bar with the spicy carrots and pickled jalapeño. Bomb.com para siempre! \n\nI always get the super quesadilla with chicken... its huge and definitely hits the spot.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-03", "description": "There is not a decent burrito joint west of this place. If you are down at the beach, this is how far you will need to go to get the real deal.\n\nThe salsa bar is excellent.\n\nFree chips.\n\nThe Al Pastor has a real barbecue flavor.\n\nGood prices.\n\nFriendly staff.\n\nOpen late.", "author": "Andy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-24", "description": "Not the best Mexican food. Ordered a tostada and it came w steak, I tried to take it back bc I didn't want meat. The menu states \"meat of any choice\" looks like they decided for me. Besides the crummy service, I wouldn't come back bc it wasn't the best tasting food for Mexican", "author": "Celeste V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "Had a killer delish chimichanga here last night. Fair prices, tasty food, clean restaurant. Would definitely come back.", "author": "Luke G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-03", "description": "This place used to be my late-night grub spot since it is only four blocks away, but its food quality can be anywhere from awesome, and apparently, all the way down to \"WTF is this sh*t?!\"  \n\nI always grab carne asada super burritos and they're usually good.  The salsa bar is great since they've expanded it.  \n\nI recently got a shrimp super burrito and the shrimp was disgusting!  It was hard and smelled horrible. \n\nServe f*cking fresh food all the time you *ssholes!\n\nThanks for the years of decent food, but your quality is all over the place and I don't have time to gamble on your choice to serve crap sometimes.", "author": "John M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-05", "description": "Posted hours until 3AM , but turned away at 2:30AM. Can't comment on the food since I never got to actually have anything ...", "author": "Alexander R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "Overall, this is a high-quality tacqueria, and I might even say it's the one of the best Mexican food.  Everything that I have had here is better than average, and all the fixings are fresh and delicious.  and in my opinion, their huevos rancheros and their ranchero salsa is the best that I've had in SF.\n\nI live nearby, so I eat there dozens of times a year.  I've tried their super burritos, tacos, super nachos, flautas, tamales, chile rellenos, quesadillas, california burritos, wet burritos, and huevos rancheros.  I would love to explore more of the menu, but my cravings for the above-mentioned food items keep me from doing so.\n\nAs I mentioned, their salsa ranchera at the salsa bar is amazing, and their free chips are usually pretty good, but sometimes stale.\n\nI hesitate to give it 5 stars only because the dining in area is not great.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "As soon as I walked in I was greeted immediately. The menu is super easy to read with a MILLION choices. I decided on the super burrito. 9$ - a little aggressive for a burrito, but the meal was done and under 4 minutes!!!! The fastest food I have ever received. Although the burrito was average size( not like Chipotles, much smaller) but the whole experience was awesome. Complete salsa bar and was given free chips.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "Best burrito spot in SF. The wet burrito with BBQ chicken is my favorite. They have a huge salsa bar with lots of different salsa there is bound to be one you will love.", "author": "Brennan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "Just moved to Alamo Square, and was stoked to see a $ burrito joint pretty much at my doorstep.\n\nReasons this burrito was basically the best burrito I've had in SF:\n\n-Even distribution of all ingredients\n-Tasty carne asada\n-Grilled the burrito, which as a result, the cheese was melted and the tortilla was slightly crispy\n-Salsa bar: 4 types. High quality salsa verde, which is lovely.\n\nBRAVO EL RANCHO GRANDE! BRAVO!", "author": "Joe H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-16", "description": "Not even close.  I ordered the cabeza and lengua tacos.  They were tasteless and poorly prepared.  The meat was left in large chunks that were dry and had no flavor.  I also ordered the menudo.  I made better menudo when I was 12.  This too was watery, tasteless and was mostly pig foot.  The tripe that there was in the serving, was so large I had to cut it in five pieces before I could eat it.  Not even close to authentic or worthy to be called Mexican Food.", "author": "Jose R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-22", "description": "This place has the DANKEST re fried beans. I'm not sure how they do it, but this place has the best beans I've ever had. I always get the super nachos and the portion size is crazy. You get SO MUCH FOOD. Only downside to this place is that there is no soda machine and after they redid their sign diet coke went from $1 a can to $1.45 a can -___-....", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "I am giving this place five stars because of its excellent service!!\n\nI am a Spanish teacher in a middle school near by. My students were learning how to order food from a restaurant and after practicing their new vocabulary the students suggested to come here and order some food in Spanish to try their new skills. I thought that was a great idea, so I called the taqueria explaining that I wanted to bring a class of 25 students to order some food in Spanish, the lady that picked up the phone was really nice and was on board with our idea. \n\nA week later, we came to the restaurant and the cashier and the waiter were super nice and helpful with my students. They only spoke Spanish to the students, forcing the students to practice their Spanish vocabulary. All the kids enjoyed their delicious food; you could see them all happily eating their giant nachos, burritos and/or churros.\nMy students were so happy and excited to be there! \n\nI am so grateful to the employees of this restaurant for hosting us and for being so helpful in our activity! This is one experience that my students will never forget.\n\n¡Gracias El Rancho Grande Taqueria!", "author": "Luna A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-01", "description": "What are these reviewers smoking? This place is an insult to taquerias. \n\nI've lived across the street from this place for three years and it just continually gets worse. Low grade ingredients and cooks who clearly could not give any care to the quality they produce. The front cashiers are always nice, so for that they get the one star.\n\nIt's a typical place for drunken yahoos (myself included in that from time to time) to get a late night bite to eat. This has to be their main clientele and why they really could care less about the quality as any one sober enough wouldn't feed their burritos to a pet.\n\nI boycotted the lace a year ago when they burnt my burrito, but last night, after the festivities of halloween I found myself a bit desperate and gave them another chance... to my amazement they actually burnt that burrito too.\n\nNo more. This neighborhood deserves a better, affordable Taqueria, this place needs to go. Look at what Street Taco on Haight is doing for the same prices and it will boggle your mind at how Rancho Grande can keep up their business with this tripe.\n\nAlso, lately, which is maybe not really up to the restaurant, but sewage has been leaking out onto the sidewalk from the door next door(but where they have their garbage bins, not sure if it's related, either way, makes the whole thing even more disgusting.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "OK, I admit. I am a bit biased in my reviews because I ONLY go to places that are AMAZING. So, simply put. THIS PLACE IS AMAZING. It's so flavorful. Take it from me, a burrito-holic. I've looked all thought-out of CA to discover the best burrito. This ranks top 5.\n\n1. You can tell a good mexican spot by the beans, no good beans no good.\n2. Variety\n3. The meat options - seafood is always a plus\n4. Deal-breaker, chips and salsa\n5. Hot salsa\n6. The beer\n\n:D\n\nHappy tummy.", "author": "Shante E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "This is a FANTASTIC taqueria. Lots of great vegetarian options and the most delicious nachos you have ever experienced. To top it off, it's also open till 3 am! Perfect for the drunchies. Go here ASAP", "author": "Amaresh S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "This brand new taqueria opened up in the Western Addition with very little hoopla about two weeks ago.  I'd been working on a volunteer project in that area recently and passed by on several occasions.  On Saturday afternoon on my way to the volunteer site I decided to hit up on nearby Green Chile Kitchen, but the place was packed and there was a line of people at the door.  That's when I remembered about the new place which is less than three blocks away.\n\nEl Rancho Grande was fairly empty at the time.  Two parties were eating inside and another three customers were waiting for takeout orders.  This restaurant has a huge menu that is mounted on a wall behind the order counter.  I had to study it for a bit before I got in line to place my order.\n\nI decided to go with an enchilada plate with carnitas.  Rice, beans, lettuce, guacamole and pico de gallo are included on the plate.  There were no choice in beans which was a slight disappointment because as many of you know I only eat whole black beans.  I ordered a fish taco also and a bottle of Jarritos even though the agua frescas looked very good.  The friendly lady behind the counter asked if I wanted chips (http://www.yelp.com/biz_photos/VKPA24jl5g19ESyA9tN8Vw?select=-FA-_2AKcGXCjQi-EMtVjg) and I accepted.  There is a complimentary salsa bar with containers of pico de gallo, a tomatillo salsa, a red salsa and whole pickled peppers on ice.  Once I paid my check the lady asked me to take a seat and said she would bring me my order.\n\nThat she did beginning with the big Enchiladas Plate (http://www.yelp.com/biz_photos/VKPA24jl5g19ESyA9tN8Vw?select=qNKMVxkPe_WxiN5mJscsnA).  Everything on the plate was nice and fresh and the enchiladas had quite a bit of carnitas inside including some fairly large pieces (http://www.yelp.com/biz_photos/VKPA24jl5g19ESyA9tN8Vw?select=Yg3PAheoQ2Z9G04ntjA3PA).  The carnitas were very good.  The pork was very lean, moist and tender and the edges were nice and crispy like many of us enjoy in fried pork.  Don't ask me how the refried beans were because I didn't eat them, but I did eat everything else on the plate.\n\nThe Fish Taco (http://www.yelp.com/biz_photos/VKPA24jl5g19ESyA9tN8Vw?select=-v1qpO_oKE6pGzx-TGde-A) was unlike any fish taco I've had before.  On two mini soft corn tortillas were several big pieces of grilled white fish (possibly tilapia), some chopped white onions, a mound of cilantro and a somewhat spicy brown sauce that had tomatillos in it.  The fish itself was excellent, and I loved all of the fresh cilantro and the sauce, but as good as it was I think I still prefer Baja style fish tacos.\n\nAnother reviewer had posted a nice shot of the wall menu in the photos section, but I decided to add images of the scanned take-out menu anyway since the restaurant doesn't have a website yet.  For Soups, Salads, Tortas, Tacos, Burritos and Quesadillas (http://www.yelp.com/biz_photos/VKPA24jl5g19ESyA9tN8Vw?select=A-ugSGp99hwDc-rer25FpA), for Types of Meats, Nachos, Breakfast Plates, Special Plates, Sandwiches and Burgers (http://www.yelp.com/biz_photos/VKPA24jl5g19ESyA9tN8Vw?select=vkGK-QVB6D4PrKibNxcbSQ), and finally for Side Orders, Extras, Agua Frescas, Juices and Beverages (http://www.yelp.com/biz_photos/VKPA24jl5g19ESyA9tN8Vw?select=Cj14DkQOkN_hDqGuxZsvZw).\n\nI wish them well, and I'm certain I'll be back when I'm in the area again.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-16", "description": "Got the mushroom quesadilla, quite good. My friends enjoyed their tacos. The overall environment of the place was that of a great neighborhood place, and I love that it's open a little late for the occasional late night meal. Will be back!", "author": "Vishnu R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-16", "description": "I am not sure how to go about writing this review. It was late, I was hungry driving down Divisadero St. I saw this place and I pulled over to do a little research on yelp. \"Three and half stars how bad can this place be\" I asked myself plus it was late, I was there and I had to get going.\n\nI ordered a California burrito since it's a rare item I've seen on a Nor Cal Mexican food shop's menu. I had thoughts of my glory days of eating California burrito in San Diego which made me all giddy. \n\n\"Could this be the one item that yelp reviewers missed?\" \"have I stumble a upon a burrito secret?\". Wrong!    \n\nSomething was wrong from the beginning as I looked on how they were preparing the asada meat for the California burrito. I couldn't help notice the color and texture of the meat. It was different from any other times I've eaten at a Mexican food restaurants. (And yes I am a Burrito Snob, I have Burrito credentials lol) the meat looked odd and mushy. \n\nI asked cashier if I could have some salsa to go she point toward the cold counter covered with thick plastic grey covers. I asked the cashier if I could have a spoon she said to use the little plastic cups as a spoon. Huh? okay.(Moot point)\n\nWith the first bite I knew something with different with the burrito and it was the Meat! My burrito palate and nose was not liking it. However the hot sauce I was digging (one Star) and gave me a hint of maybe were the owners style of cooking is from. The salsa is very Yucatan.\n\nAfter awhile I started to feel nauseous and it was the meat that did it. \n\nI don't blame restaurant for my experience however I blame myself for coming here by trusting a few Yelps who probably don't know what good Cali-Mex food is. \n\nI have to remember in SF there is a huge job hiring in the tech industry which is creating a population boom in SF. Most of these people who are coming in from all corners of the US probably haven't been exposed to good authentic Mexican food and then yelp about their SF experience.\n\nNext time I'll be little more cautions where I go or ask a local and cross reference with yelp.", "author": "Abel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "This place is THE BEST taqueria in SF and hardly anyone knows it!! My husband and I drive all the way over from Nob Hill when we're jonesin for nachos, burritos, you name it! Their veggie nachos and grilled veggie burritos are so flavorful. My husband is obsessed with their steak nachos. I've tried several items and have never been disappointed.\n\nTheir salsa bar is worth mentioning. 5 or so different salsas, jalapenos, onions...all the fixings you could ever want from a salsa bar. I wish the salsa to-go cups were bigger, but people would probably take five times the salsa so I get it.\n\nDon't be put off by Rancho's outward appearance, THE FOOD IS TO DIE FOR. The staff is friendly enough and this is legit taqueria food. Oh my gosh I have to go there NOW.", "author": "Kaylie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "This place is AWESOME. My favorite burrito place in the city. I probably go there at least once every couple of weeks. I'm sure part of that has to do with it's convenience to my location, but the the burritos themselves are exceptional by any standards. They're massive too, and cheap, so if you're jonesing for a full stomach and a full wallet, you should check it out. They also have killer quesadillas and pretty bomb enchiladas. They aren't skimpy with their guac, either. The super burritos and super quesadillas have piles of that delicious miracle-sauce inside of them. \n\nThey have all of the meat choices you'd expect as well; carne asada, al pastor, carnitas, lengua, cabeza, as well as insanely delicious breakfast options like chorizo and egg. Chips come free with everything!\n\nTheir beverage selection is great too, with all sorts of flavors of Jarritos sodas, Mexican colas, and beers like Modelo. \n\nBreak that hunger without breaking the bank and check this place out. You'll be a regular after the first visit.", "author": "Addison S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "We love their burritos- it's always packed so I'm guessing their food is fresh because of all the turnover. The horchata is also surprisingly delicious and is so sweet that it lasts us for days", "author": "Ron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "They have the best carne asada in San Francisco. \nThis place is netter than any other mission burrito spot.", "author": "Blake G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Oh man this is by far better than any \"farolito\" really good burritos, they have variety. The salsa bar is spot on.", "author": "Mario R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-12", "description": "Too many other Mexicali type places in the hood to recommend choosing this place over the 2 others nearby. Good for late night snacks.", "author": "Raylan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "I don't know what you're expecting, but if it's quick, delicious, cheap Mexican food, this is your spot. \n\nFOOD:\n\nIt's about as high quality $ Mexican food as you're going to get. It comes out super quick, the prices are right, and I've never had a bad meal there. Their carnitas is super good, and if you're willing to wait (or call it in ahead), get the Pozole, It's some of the best I've had. Two complaints: their chips are a little stale, and it would be nice if they had a little bit bigger selection in their salsa bar\n\nSERVICE:\n\nFine, the ladies working the register are super nice, and the food comes out fast.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-01", "description": "This place is the **ex-girlfriend of Mexican food establishments. You know you want no part of it, but occasionally you find yourself inebriated and needing a quick fix, so you lower your standards and pop in for an ill-advised visit. Then, upon masticating, you quickly realize how big of a mistake it was to swim in those waters again, and vow never to return ever, ever again.\n\n**Of course, this is completely theoretical.", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "I love their chorizo and it's delicious in tacos. Great flour tortillas for burritos and a great selection of flour tortilla alternatives. \n\nRecently on the fence about their Carne Asada.\n\nCalifornia Burittos are bomb.\n\nRolled flautas are amazing and you get a great amount. \n\nMy man enjoys the vegetarian tacos and vegetarian burritos with roasted veggies. \n\nI only wish they would make Agua de  Jamaica.", "author": "Isidro M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-24", "description": "Poor customer service in the evening ! I've been a loyal customer since they opened now the new cooks are getting the orders wrong all the time and the young lady at the counter has a nasty attitude .  I'm much happier eating at burrito express down at Bush and Divisadero", "author": "Ronald S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "Holy bananas - I had an al pastor super burrito without rice here this weekend and it blew my mind. Not sure if they put some sort of special sauce, but the inside looked kind of creamy (?) and tasted super rich. I was very happy for all the moments I ate this/did not have a heart attack. :P Looking forward to trying other/different meats here!", "author": "Shendi X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "The super tacos are probably one of those underrated menu items, or I guess I just love guacamole. I like this taqueria a lot, is reliable and the price is very fair.", "author": "Plinio C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Delicious. My favorites are the enchiladas with chicken in salsa, milanese, or really anything. The burritos are delicious. Salsa is spicy as it should be. Best horchata around. Open late...What more could you ask for?", "author": "Anne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Solid quick Mexican place.  The food is decent in quality and the location is prime.  Not the best Mexican you've ever had but for the price it doesn't disappoint.  The staff is always friendly and it never takes too long to get your food.  This is not a destination spot but if you're in the area and have a craving for some Mexican then give this place a try!", "author": "Jamie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "When i first got here i thought the place was a bit pricey for a kind of hole in the wall taqueria, but then i realized it's because their portions are MASSIVE. I tried the super veggie taco, it was pretty good. Some friends split the nachos, which I don't know how a single person could eat - it was a ton of food. Excited to come back here and try more of their selection. I just have to make sure I'm super hungry!", "author": "Amaresh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-13", "description": "Quick and inexpensive Mexican food. If your looking for a super burrito for 8 bucks in Nopa then this is the place.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "Amazing carnitas burrito:) I inhaled it!!! It is one of the best Mexican eateries in sf. I'll be back to try something different. It's also nice because it closes late and a great place for a quick bite to eat.", "author": "V M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "I live right up the road.  I have to say when they first opened I was skeptical, but they have proved me wrong time and time again.  First, I want to tell y'all about the special \"mojado\" option..aka wet burrito. The chille verde, amazing, is perfect when eaten in mojado style, perfectly tender pork, best chille verde I've had in a while.  So on to the burrito I had tonight, steak and shrimp, simple, but executed so well.  Thank you, el Rancho Grande, y'all are a Fantastic addition to the hood.  \n\nSee y'all soon", "author": "Patrick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-26", "description": "Late night spot to stroll over to after leaving The Independent. \n\nFor us in the IE it is just normal ol' \"Albertos\" food. They took a credit card and was open; at the time that was all that mattered.", "author": "Rebekah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-11", "description": "Wow Mexican food!! The food was great that you didn't expect even though the few table they have. This place was really busy because it was really close to bus stop and people stop by and buy. One thing they need to improve the buzzer who needs to clean all the time because we are customer not clean your table. I hope you alert your surroundings and we don't want disappointed. I'll come back and grab to go when I visit again SF.", "author": "Sharmaine Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Simply an amazing taqueria. The service is fast and friendly and the food is consistently delicious. The chicken Mexican salad is always made fresh and with high-quality ingredients. It's also pretty large so it's a great value. Super burrito is also must try.", "author": "Austin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-01", "description": "I was only in the market for a burrito at El Rancho Grande because the nearby Candybar had a 1.5 hour wait and I needed a late night meal while I waited.  The carnitas super burrito satisfied my ability to fill myself and the place didn't have a wait at all, but for many reasons, I wouldn't choose to come here under normal circumstances for an actual lunch or dinner with other people. \n\nWhy?\n\n- The guacamole tasted like that fake pre-packaged guac you buy at Safeway but tasted even more watered down; I wouldn't know it was guac unless I read that in the super burrito description\n- The carnitas tasted like bland shredded pork, it's not at all what you envision that carnitas is actually supposed to taste like \n\nThose two reasons alone make it that you should find another taqueria or burrito joint if you have the time and flexibility to get there.", "author": "Albie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "If you drive by in a hurry, you'll miss it. Had the luck to dine here for a late dinner the other night, and the burrito was so good I wished I had the foresight to wear sweats. It's that damned good.\n\nIf you want a take-out meal, they're good for it. If you dine in, enjoy. I had the carne asada burrito and it felt like the best mouth sex.", "author": "Aida N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-10", "description": "Pretty standard cheap mexican joint that is down the street from me. Burritos and tacos are on par with similar style joints around town. Been coming here more often because I think their nachos are better than those of Little Chihuahua's. The staff here is super nice and always throw in an extra bag of chips, even if you just order a drink. Salsa bar is pretty tasty, but I wish they had more pickled veggies.\n\nIf you want mexican but don't want to deal with the crowd at LC - I recommend you come here. I'm always in and out within 10 minutes of ordering (to go).", "author": "John N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "Hands down best carnitas burrito I have experienced in SF, maybe anywhere.  From the perfectly golden crusted tortilla to the perfect ratio of beans:rice:meat:cheese, to the flavor and texture of the meat, I give it a motha f&%$in 10!", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-22", "description": "go to late night spot in the neighborhood. I wouldn't recommend eating dinner or lunch there but post bars who doesn't want a california burrito?\n\nif such a person exists i don't want to meet them.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "I love the tacos here one of my favorites spots to go there I always get the carnitas ! I recommen this place", "author": "Remysbarbie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-01", "description": "While the tacos here are not as cheap as those in LA, they are filled with meat! I had the carnitas and the carne asada regular tacos. They were delish! It was tender, moist, and flavorful. Nom nom nom.", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "El Rancho Grande is very good Mexican food. It doesn't re-invent the wheel, but it's always enjoyable. Papalote is similarly good (and arguably better), but there are some areas where El Rancho is superior: they're quicker and they have better hours, to name a few.", "author": "Erik B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "I usually go to Little Chihuahua but for a super burrito the total usually comes to $11. I wanted to check out this place because it had good reviews and is cheaper. I was a bit skeptical because I read it was low food quality, but after eating it I give it a thumbs up. \n\nThe only drawback is that it's definitely greasier than most other burrito places I've been to in the city. They have the standard salsas (pico, green, red) plus they have lime wedges which is a plus. The total comes to $8.30 for a super burrito.", "author": "Ted B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-29", "description": "$3.75 for Fried fish tacos that are fan-fricking-tastic and great super burritos too!\n\nI recommend the al pastor for pork-eaters.  It's really, really good.\n\nPretty fast service and clean.  I've eaten there 2 times in the last 24 hours.", "author": "Lucas W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-03", "description": "I like El Rancho Grande, because it's close (to me at least!), quick, open late, and they pile on the meat. Skimpy tacos don't happen here. Also, the salsa bar is muy yum. \n\nEl Rancho Grande isn't my favorite favorite #1 taqueria, but, it definitely has a place in my heart.", "author": "Paige C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-29", "description": "They boil the steak/beef for their super burrito. It's nothing more super than a regular burrito(size). 1 star for staying open late, we came from a 15 mile hike and burnt out. Anything sounded good or should of been good, today being memorial weekend on a Sunday night we settled for this hole because of our drive straight to Yosemite after. The food was bland, boiled, and the restaurant as a whole looks unsanitary. There was a dude that was taking a piss outside of the front door next to a bum sitting outside when we were leaving. The female behind the register was rude and impatient even though my buddies and I were the only one in line. Please stay away, I'm only praying the food was bad and not going to affect us the morning after. I don't know if I came on a shitty night or this is how it is  on the daily but I recommend everyone to stay away. The salsa bar was a disaster, I was hoping yelp would of hooked me up but this place is a fail.", "author": "rome r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "This is by far the best Mexican restaurant in a 5 mile radius. The quality keeps improving and the staff is always smiling and friendly. I always get the Milanesa plate, Caldo de Pollo and Pollo Asado Burrito, satisfaction guaranteed! Also, even though the only open at 10am, their Huevos Rancheros is incredibly delicious and great bfast pick.", "author": "Andre F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "when i lived in the area, this used to be my go-to taqueria. yes, that other uber-popular place down the street gets all the attention, and they do have good, but that's extreme white people Mexican food. this place, on the other hand, aims a little bit closer to what you might get in the Mission. delicious, filling, and inexpensive.", "author": "Ronny K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "Good, Cheap, Convenient and the salsa bar is a plus!\nI would recommend the grilled veggie burrito and the tacos\nThe burger is also surprisingly good for being from a Mexican restaurant!\nPass on the nachos- they get soggy really quickly\nThis is more of a grab and go place in my opinion but they do have beer and tv if you want to eat there\nThe service is always fast and friendly and they are open late.", "author": "Deja B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-15", "description": "Chips were cold. I had a veggie burrito and it wasn't really different... The tomato sauce was there for hours and looked old. I really enjoyed the fried onions though.. Orchata tasted great! And also enjoyed the soccer game on their TV", "author": "Enrique R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "Carne Asada Quesadilla is really good and HUGE, you can definitely split it! The staff is super friendly. I've been going here since I moved in the Neighborhood (one year) and it's very consistent. \nMinus 1 star because I don't like the chips they use for nachos or as a side with salsa.", "author": "Mak T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-21", "description": "Hey dude.\n\nFavorite childhood ranch: http://www.youtube.com/watch?v=qApK1ifOW7I\n\nFavorite adult ranch: Here thanks to the grand size and taste of the tortas and burritos.\n\nBurrito overflowed with grilled chicken and black beans barely contained in a wheat tortilla.\n\nTorta overflowed with BBQ chicken (perfect hint of the sauce), black beans and lettuce. Enough to so it became two meals.\n\nCondiment bar includes free grilled onions. Yes please.\n\nSaddle up (or Muni up) and come on by.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-02", "description": "Worst Mexican food ever.  They should be embarrassed to put the word taqueria on their sign.", "author": "C L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-23", "description": "Just opened a few days ago.  I was little surprised to see it opening with Papalote, Green Chile, Nopalito, and Little Chihuahua all within 5 blocks, but really, a no-frills Taqueria is exactly what this stretch needs, and looks like these guys are going to deliver.\n\nI stopped in at 3 today and they were still busy from late lunchers like myself.  Thinking the burritos would be disappointing compared to Little Chihuahua, I instead went with a super steak quesadilla.  While it did have a non standard presentation, it was absolutely delicious and filling for $8 even after tax.  Well worth the short wait.  \n\nLooking forward to coming back and trying more of their menu, which is much more extensive than one would assume.", "author": "John H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-16", "description": "Hoping for a quick way to get some great nacho's I decided to hit up the new burrito joint down the street.\n\nThe quality of their food is way below anything I would expect for $8 nachos. They didn't put ANY cheese on my nachos. Used sloppy refried beans - didn't bother to ask if I wanted black beans. Then the kicker was I had to spit out 4 chunks of gritty-fatty al pastor that was inedible.\n\nI also had to remind the girl to give me my bottle of coke when she handed me my food. Even after she looked directly at the receipt while calling out my order.\n\nNot going back - Little Chihuahua, Papalote and GCK are only another 2-3 blocks away.", "author": "Ross H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-19", "description": "Maybe it's because I live around the corner and I'm a regular that they always take care of me.... but this place has never dissapointed me!\n\nIs it the best 'taco shop' i've ever been to? I think not, that being said it's reliable cheesy greasy mexican that you're looking for on those recovery days! \n\nThe carnitas super burrito is my weapon of choice! I have never gotten sick and never been served cold food... and I eat here ALL THE TIME! Get in there and try it out for yourself", "author": "Kevin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "This is the best burrito spot that I've tried in nopa. I can't resist their California burrito. And their salasa and chili's are a hell of a lot better the little Chihuahua.", "author": "Beni R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Great place, good cheap food and a friendly staff. Quesadillas are a must and burritos are huge!", "author": "Miguel O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "Best Tex-Mex place on Dvisadero (within walking distance of Haight).  I order burritos here at least once a week and have started to explore the rest of their menu. I think there are a few places closer to me (Little Chihuahua) but find the food at El Rancho to be a better price to taste ratio.", "author": "Kevin Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-27", "description": "Stopped in here for a very quick bite before a tat session and got the single steak taco. It wasn't too bad - 2 corn tortillas, heaped with steak and topped with hot sauce and cilantro. Slightly on the salty side but overall it was good and came with free chips!\n\nI'd say this is a really good place to stop at if you're in a hurry and just want to grab something small and fast.  I didn't have to wait long for the taco and probably could have ordered 2!  They have a pretty big menu so next time I'm in the area I may try something different.", "author": "Mercy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-07", "description": "Although I'm not much of a carnivore, every now and then I feel a certain craving for the noblest cut of the cow--the tongue. Back when I was in Japan I found out that the most delicious and the only way to cook this oft-overlooked part of the cow is to peel off the thick hide from the tongue thus revealing the soft juicy meat under it, perhaps season it with a little salt and then grill the gorgeous thin cuts of meat over a charcoal fire. I was very disappointed to find that the tongue never made it as a staple cut in the American beef diet, but my disappointment was set aback when I found out that the pan-Americans and the magical restaurants that have so become ubiquitous to American cities known as \"Taquerias\" usually carry my preferred cut of beef as part of their delicious burrito menu. This all changed tonight when I visited El Rancho Grande.\n\nFueled partially by an initiative to explore my immediate surroundings a little thoroughly and partially by a drunken escapade, I decided to try out the taqueria that's exactly two and a half blocks away from where I live. My first impressions of the establishment was no different from any other Taquerias I've visited all around California; little cashier's booth under neath a giant menu conveniently located aside the actual \"cooking area\", seats lined up across the wall with a TV playing Mexican soaps/futbol on telemundo. So assuring myself that this experience would not be any different from my usual frequentings, I decided to order my favorite cut of beef wrapped around a tortilla stuffed with rice, beans, sour cream, diced tomatoes and onion and guacamole. How can you possibly mess this up, right?\n\nWell that's where I was wrong. I'm not a burrito scientist, but the first sign of a poorly made burrito can be observed through the color of the tortilla; the tortilla was toasted/browned--to date I've never had a single positive experience with burritos when the tortilla was (nearly) burnt to a crisp. My next grievance with ERG's burrito is that the queso they used overpowered almost every flavor the burrito had to offer--if I wanted a cheesy filling Mexican dish wrapped in a tortilla I would have ordered a quesadilla. \n\nMy last and final grievance with RG's lengua burrito is that it managed to capture every reason why white people don't usually eat this cut of meat; they somehow managed to overboil the lengua and thus leaving it devoid of any sort of flavor/texture whatsoever. Now I'm very passionate about my beef tongue so perhaps it's not in anyone's best interest to take what I say about this burrito au pied de la lettre, but this burrito managed to betray every expectation about the noblest cut of the beef: whereas I expected a succulent, juicy, flavorful sensation with each bite, all I got was a mushy, watery concoction that was overpowered by the overly generous flavor of cheese.\n\nBesides from the disappointing lengua burrito, the chips they gave me were the super greasy home-fried kind, which I imagine might be a plus for some and a huge gaping minus for others including myself, and their pathetic excuse for a salsa bar only had four choices: salsa verde, not-so-spicy red salsa, pico de gallo and another thing that I cannot remember at this point.\n\nDespite all their shortcomings, their food is surprisingly affordable (6.95 for a super burrito) which, in my opinion, is the only thing preventing me from giving this place a one star review. Since I was a little intoxicated when I tried this place and out of the virtue that this place is only 2.5 blocks away from where I live, I'll give this place another try on my next drunken escapade, but I know when I've been thoroughly disappointed and betrayed and this experience came mighty close to it.", "author": "Scott S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-30", "description": "Steak and prawn burrito for 7 or 8 bucks before 2 am always sounds good after the bars until Sunday morning rolls around. Good place though. Cheaper than papalote. Try putting papalote salsa on their burritos.", "author": "Marty J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-31", "description": "The food here is amazing. Strawberry agua fresca is to die for! Classic Mexican food.", "author": "Jenna K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-16", "description": "Came here after the candy bar, since a few of my friends were hungry.\n\nWe all shared nachos and some of us ordered the carne asada tacos for $2.55.  The meat didn't taste fresh, but what stood out was the self serve salsa bar.  \n\nI did cringe when one of the staff dropped a plate and it broke/shattered next to me. OUCH,. i guess no apologies?    \n\nThis place is best for take out and more for drunken night munchies.  If I had more to drink, I would have probably rated this 3 stars.  \n\nWill not be back!", "author": "Chanel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-14", "description": "One of the best mexican food in this area. When I get off work i like to stop by and order a burrito once in a while since its on my way home. It always taste the same and thats good for me I don't like an odd burrito like othere places on this street. I come here with no hesitation.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "Carne Asada California Burrito is amazing.\nYa, french fries, carne, cheese and guacamole is pretty damn good.\n\nNice salsa bar as well", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-12", "description": "I love this place! I grew up on Tex-Mex and lived in LA for 7 years, and every time I come here I'm transported back to my roots. Hits home in the best way, especially with the taco de lengua and the super well-priced burrito. As a chips and salsa connoisseur, the salsas and options are all excellent, including salsa ranchera muy picante! Plus, Judy always has a wonderfully friendly smile on her face. Been here many times and will be back again!", "author": "Jared S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "I love this restaurant!  The best burrito I've ever eaten in SF.  Staff is very friendly and always welcome customers. And Yes!  Free chips and Salsa Bar. Very nice!", "author": "Parinamana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "Had the best chicken Burrito ever! Everything in the burrito tasted great. Their Guacamole is amazing too. Tried so many Mexican places in SF but this one is the best.", "author": "Arta S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-04", "description": "I loved the chicken BBQ super taco. Was really delicious. Almost prompted a friend to move here from NY. Was pretty darn impressed by the tastiness.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-26", "description": "Came in last night, Sunday November 25th, 2012 - and ordered the Grilled Vegetables Burrito for $6.45 along with a can of coke and was offered free chips for the salsa bar.\n\nThe burrito was filled with grilled vegetables - but fell apart due to the weight which is one of my biggest complaints with a burrito as I prefer to hold it rather than eat it with a fork and knife.\n\nI would try it again if in the area - however, I wouldn't make a special trip for it.", "author": "Brian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "This place is fast, delicious and cheap. These are three qualities I look for in a Mexican place. I don't know what they do to their burritos, but they come out great. They give a generous portion on the chips, and have a good selection at the salsa bar. All around, a great quick place to grab a very satisfying burrito.", "author": "Steve A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-03", "description": "The quality of meat served here is the WORST I have ever seen at a Taqueria, and for some reason I have been stupid enough to try them all. \n\nCarne Asada - dog food\nPollo Asada - 0% white meat.  Nasty cartilage and bone pieces everywhere.\nCarnitas - fatty, greasy, with big chunks of rubbery pork skin. \nAl Pastor - gritty with shocking amounts of orange grease\n\nThat being said, my wife always gets a bean and cheese burrito here and is pleased - and the salsa bar is pretty solid.  So if you must come here to fulfill a burrito craving, stick with a vegetarian burrito - TRUST ME.", "author": "Dan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "Went on the first day El Rancho opened and I was pleasantly surprised. Prices are standard and food quality was high - I ordered an al pastor taco and it was delicious. Quantity was great, also. The space is clean and nicely renovated. Definitely an improvement on the previous establishment!", "author": "Nikolas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-13", "description": "Burritos are HUGE!  Not even close to being my fav place at ALL, but the only reason I'm giving it 3 instead of 4 is because there is a wide selection of tortillas you can choose from.  I don't know if the taste makes THAT much of a difference, but I think it's cool...", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-10", "description": "The food isn't amazing, but it get's the job done when you need that Mexican fix at 12am midnight- burritos are big, filling and will knock you out.  I'm not a regular, but have been here a couple times and have no complaints.  Yes, it isn't a Papalote, but then again why would anyone expect it to be?\n\nThe ladies who work the counter are always nice and pleasant.", "author": "Clarissa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "I believe every restaurant has a niche dish that you keep coming back to.  Sometimes you have to discover it by customizing, sometimes you discover it by accident.  This place is your typical taco shop, being mexican i can't order anything straight from their menu and be happy with the obscene amounts of cheese, sour cream and \"pico de gallo\" in their burritos.  So, here's what you need to order, any of the burritos but ask for refried beans and guacamole only, no cheese, no sour cream, and no rice.  Think about it, growing up poor we didn't have money for cheese or sour cream, and rice was often reserved for special occasions.  In other words, if you'd like to eat what the common folk in Mexico eat, which is effing delicious stick to the fewest ingredients possible, you can thank me later.", "author": "Roberto Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "humongous sized burrito with juicy chicken.\n\nnice folks and super fast as I paid at the cashier, glanced at the lunatic yelling outside the 24 stop, poured a cup of water, gal behind counter asked if i'd like chips...i said si' por favor\n\ngrabbed some pico at the salsa bar, sat down, tuned out the obnoxious car salesman wearing a crown on telemundo, opened up sf weekly and went straight to naughty section then felt someone hover over me handing me the foiled burrito in a red basket all in a matter of 5 minutes\n\nwalked out of there stuffed! not bad for a $6.80 regular burrito this side of market", "author": "Clark G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "This is a great neighborhood taqueria: cheap, tasty, convenient, and not pretentious! On a recent trip, I had the fried fish taco, carnitas taco, and al pastor taco. The fish taco was yummy and had a bunch of salsas/toppings (though the fish piece could have been a little bigger). The al pastor was incredible - probably the best I've had. The carnitas was great as well. The meat was all well-seasoned.", "author": "J L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Super Pollo burrito was great.   Big size,  they grilled the tortilla,  salsa was spicy.   Place is clean and the price was less than $8, where a lot of other places are $10+.  I'll be back.", "author": "Barry Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-09", "description": "After a few unpleasant altercations with a burrito at this particular taqueria I decided to steer clear. Like any other unsatisfying relationship you try and make it work cuz it's convenient. Hours (only 2am last call on Divis), location (close), price (cheap) make it too easy fall back on. But I took a stand and said no more. \n\nUntil last night. I heard she'd changed. Apparently the tacos were really good. Maybe I'd misjudged. Not given it time. So I decided I couldn't ignore her anymore. But goddamn it I'm gonna take it slow. I got a carnitas taco ($2.79). Simple. I was surprised at how much I enjoyed it. Now I'm hopeful. I may be ready for the super taco ($4) sooner than I think.", "author": "Quentin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-30", "description": "Wandering through NoPa and wondering where you can get food that isn't $20 for a \"small plate meant for sharing\"? I'm talking real food, the kind will actually fill you up.\n\nTimes are rough in this neighborhood for the pragmatic, with the continuing closure of affordable dining options in the area and the \"remodeling\" of others (resulting in swank atmosphere, handcrafted drinks and a sudden doubling of prices on the menu items). Thank goodness for El Rancho Grande, one of the few remaining places keeping it authentic, affordable, and real in our neighborhood.\n\nThey have a huge menu, and their fish tacos are the best I've had without the need to be deep fried or drenched in cheese/sour cream for flavor. (Of course, there are plenty of items on the menu that are more unhealthy if you're so inclined). They aren't the best Mexican place in SF by any means, but they are friendly, the menu items extensive and delicious, open late, family-owned/run and....a much needed part of the NoPa neighborhood.", "author": "Jeffrey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "I go here after work at least once a week I love their shrimp and carne asada burrito its meat is so savory and always tastes great.", "author": "Javier G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-20", "description": "A staple since it's so near my place. I come here when I'm too lazy to walk over to Little Chihuahua. The flavors lack that certain kick, but they do offer lengua and cabeza as meat options. Also, the chimichanga is a steal for the amount of food you get.\n\nFavorites: Chimichanga; lengua, cabeza, and chorizo meat options, chile verde sala", "author": "Kai C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-21", "description": "Cheap, fast, and easy.  Never had a problem here and come pretty regularly.  It's not the best mexican place in the world but serves up a serviceable meal at a very reasonable price given the NOPA location.  \n\nAlso, they have a whole wheat tortilla's and a solid variety of non-meat options which is always nice.", "author": "Max C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "One of my favorite Taquerias in the city. Good flavorful food, great salsa bar, and open late. What more can you want?\n\nAlso, as a San Diegan, I appreciate that they do the California Burrito right: lots of fries, lots of guacamole, and tasty carne. Oh plus they make the tortillas fresh so they're always warm and wonderful.\n\nRecommend: California Burrito or Tacos.", "author": "Tis T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Best burrito in SF. Try the super burrito with chicken on a tomato tortilla. Or the California burrito with chicken on garlic tortilla.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-03", "description": "I've been here a handful of times. I've never had anything that makes me want to go back. I still don't know why I do. It's great for those \"Damn, I'm craving some shitty Mexican food right now!\" kinda days.\n\nThis is a less than stellar taco/burrito shop. I had to call in sick on Monday cause of the food I ate Sunday night. Carnitas quesadilla. -4\n\nIt's one of the few places to eat that's open late on Divis. +1", "author": "Harold C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "This little place is great!! Had a friend visiting from out of town and after walking around the city we were looking for food! Happened across this place and so glad we did. It is cheap good Mexican food!! Delicious wet burritos and amazing quesadillas for my friend!! This place has a great location, very clean, and the staff was friendly and prompt. Would definitely recommend to others! Yummm!!! :)", "author": "K W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-19", "description": "Well 1st off all the restaurant itself is literally right behind a bus stop. My 1st and last time coming here. They have no space. A tv in the corner with an ATM in in the one room. I ordered the wet burrito.   Which is a burrito. With sauce on top(it was okay) thankfully it wasn't soggy:) the guacamole wasn't good. Lengua (tongue ) however was good. While I was eating there a pidgin flew it. I found it gross. And extremely unsanitary. If your starving and on the run. Run away from here. I'm sure a burger or taco truck would be quicker n faster. Food is okay. Ambiance not so much. Hope this helps:)", "author": "Martin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "two years later after the food poisoning incident i decided to give el rancho another chance. i had the free lunch offer from the go pago app, so this time i ordered the cheesesteak lunch combo with fries and soda.  no mexican food. it was dericious.  they hired new staff.", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "My first favorite burrito outside of the mission. Grilled vegetables and tasty rice and beans for about $6. Free chips and tasty salsa to boot!\n\nI highly recommend this place.", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "Suuuuper legit. Best burritos in the neighborhood. Really friendly staff. FAST service, order a burrito and it's ready before you've even loaded up your salsa cups!", "author": "Carolyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-04", "description": "Solid neighborhood taqueria. If it were somewhere else besides SF, I might give it 4 stars. I particularly liked the choice of tortillas and the fresh salsa bar with the most delicious grilled jalapenos I've ever tasted. I wasn't so crazy about the sandy shrimp in my burrito. I'd definitely go back here and try something else.", "author": "Brett W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-18", "description": "Good quality food at a great price. Friendly Mexican atmosphere!", "author": "Julian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "HUGE burrito for around $7-8. I got the carnitas super burrito & it was so good. The carnitas was cooked perfectly - probably the best shredded pork I've had. They weren't stingy with the meat or anything else. I really loved everything about this place. They also have a nice little salsa bar. The red salsa is the best!", "author": "Junel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-11", "description": "This place is a little pricey but it's like 200 ft from my house and it tastes good. That's the reason I go. Also the people are friendly and there's hardly ever a crowd there. \n\nThe green salsa is SABROSO! One of these days I might try their American faire which includes a cheesesteak which I'm not so sure about but maybe if I was already drunk it might work. \n\nI like this place.", "author": "Alex O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-30", "description": "Finally, a decent (and decently priced) taqueria within easy walking distance of my flat.  \n\nNo, we don't need another \"Mexican-inspired\" or a-lot-of-people-are-drinking-cheap-beer-there-so-its-food-must-be-good or new-take-on-comfort-food or Flexican or any other ridiculous excuse to overcharge people for small food portions in this neighborhood.  After seven years of living here, I now realize that San Francisco gentrification comes in many forms, and one of its most insidious is the restaurant that spends (and charges) a lot of money in order to mask its pretentiousness.\n\nEl Rancho Grande is not pretentious.  It doesn't pretend or strive (or cleverly negate the claim) to be anything that it's not.  It doesn't consider itself revolutionary, evolutionary, devolutionary, or any other pomo \"ary.\"  It's a Mission taqueria located right here in the Western Addition.\n\nIs it amazing?  Not by a long shot, but being able to avoid riding the 22 just to eat a decent burrito is worth a taste-and-quality tradeoff.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "I live in the neighborhood and this is my go to take out spot. My favorite are the lengua super burritos. They have delicious agua fresca. The food is fresh and is made quickly. Their super tacos are huge and are plenty of food for a full meal.", "author": "M L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-09", "description": "Veggie nachos!! Nom nom nom! Just remember to ask for black beans, otherwise you get re-fried... unknown whether or not their re-fried are veggie friendly. \nDecent prices. Fast, friendly enough service. The place is clean and spacious. Free convenient and cold water at the counter. \nI have only been twice so far, will have to write more when after going back a few times.", "author": "joanna r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "Open really late, which is awesome since most places in the area are not. They are really fast and have an extensive menu, the burritos are huge!", "author": "Kelso H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-14", "description": "Alright...\n\nDON'T GO HERE MY WALLET GOT STOLEN IN UNDER 20 MINUTES BY THE CASHIER.\n\nSo I went there yesterday afternoon and ordered the mushroom and cheese quesadilla. It was good, I was a bit high and walked away from the restaurant without my wallet, I freaked out and my friend and I turned around and went back. The table had been cleared off...and my wallet was gone. Now there was NO ONE in the resturant, except me and my two friends and an old couple came in while we were there.\n\nI went back and left them with my number, decided to call today to see if someone had turned in my wallet. A women answered (the same women who had taken my order and CLEARED THE TABLE) and when I told them I was calling about my missing wallet she immediately started mumbling and acting nervous. I asked to speak to a manager, to which I was told \"there wasn't one\". I asked her again, because come on...theres no manager? Really. \n\nThe women became completely unhelpful and I doubt she gave my information to a manager. I will be calling them back later but BE WARNED!", "author": "Bea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-18", "description": "Took me a week to come here after it opened because it looked so generic & unappealing, even though it's less than 1 block from my apartment.\n\nBut once I realized this place has really good carnitas, chips, and salsa, I came back 3 times within 24 hours. \n\nChips are delicious restaurant-style. The salsa bar has 3 salsas. I never go for pico de gallo, but the verde and red smooth salsas are excellent. I prefer El Rancho's more classic Tex-Mex garlicky tomato salsa to Papalote's orange stuff, but I could see how you'd go the other way. Sometimes they have roasted jalapenos which are delish. Never tried the pickled mix. \n\n(And to finish off the comparison of all chips & salsa in Nopa, Green Chile's red salsa sucks as do their out-of-a-bag blue chips. Little Chihuahua has decent chips that I think are good-quality-bagged and a nice selection in their salsa bar, 2-3 of which are very good, but not as addictive as El Rancho's. I'm not sure how you even get a bowl of salsa at Nopalito, but they have a weird yet awesome baked salsa & chips app. Papalote's salsa is excellent with its own cult following, and it's chips are sometimes decent restaurant-style and sometimes bagged-gross.)\n\nI had a carne asada taco once. Decent,  but Papalote's carne asada is better.\n\nStar lost for: slow service, chile relleno that was too drowned in cheese & sauce, inferior carne asade to the neighborhood fav, no bean selection beyond refried pinto (or at least I wasn't offered any).\n\nBut the carnitas, chips, and salsa still make it 4 stars. And it's open until midnight weeknights, 2am weekends!", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-01", "description": "SUPER good. I ordered the special mojado with carnitas. It was HUGE and delicious. I ate here at about 3:30pm and the burrito was so big that I didn't even need dinner that night! Often times at Mexican restaurants I don't care too much for the chips they give you but at this place they were verrrrrry good with the perfect amount of saltiness. I also got one of the glass bottle coke which are always the best. I dealt with 2 of the workers and both of them were really friendly. \n\nCan't go wrong with this place. Very clean and a nice atmosphere as well. If I were in the area I definitely wouldn't hesitate on going back. \n\n\nMy absolute ONLY complaint is that I got a few pieces of tough meat. That's bound to happen though.", "author": "Randy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-13", "description": "Good veggie burrito, damn good avo/salsa mix, great service and fairly inexpensive\n\nAlso perfect chips, atta babe", "author": "Dylan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-01", "description": "Man this place is tasty.  I can only imagine how long it'll take me to get on a first-name-basis with the staff.  The place is great for the 'hood, we've been lacking a solid taqueria.  Don't get me wrong, Green Chile rocks my world, but that's going for a unique theme with the whole New Mexico thing.  Papalote is good, followed up by the Little Chihuahua, but they're trying to do that whole gourmet/expensive/white-people thing.  El Rancho Grande is a classic taqueria that's not trying to be anything more than that.\n\nThe food is excellent, super fresh and well-priced.  The salsa bar is minimal, but crucial.  They have all the standards and on one of the two times I've been there they had grilled jalapenos... nice!  They have a super tasty jabanero salsa but you have to ask for it due to it spoiling while it sits out because no one eats it.  It just makes me so sad to see good hot sauce go to waste like that.  DON'T BE AFRAID OF THE HEAT PEOPLE!!!\n\nSo if you live in the 'hood, or your going to a show or getting some drinks or something and you're looking for something good, affordable and quick, do yourself a favor and stop by El Rancho Grande.  You won't regret it.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-19", "description": "Just opened my burrito and was reaching for a chip when a fat ass roach crawled out of it.... really guys I don't want my money back,  but people don't go there it can't be good for your health.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "Cheap, huge portions, super friendly.\nClean salsa bar. \nWould give 'em 5 but the place is not quite to the level of papalote or 25th + mission taqueira.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-22", "description": "Steak and Prawn Burrito! Get after it!\n\nThis place is straight up Taqueria. Great to-go place.\n\nYou know how sometimes you don't want to hear some experimental indie rock? You just want straight to the face, don't bore us, get to the chorus? This is like that. But a Taqueria.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-14", "description": "Avoid at all costs...unless you feel like spending the entire next day on the toilet.\n\nThis temptress tastes great on the way down, especially after a show at the Indy, but beware - the following 24 hours will be filled with frequent trips to the bathroom.  And this is not just from personal experience, but friends have been having the same issues", "author": "JJ O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-03", "description": "No, it's not the very best as Mission-style joints go, but it is in our 'hood, finally and a welcome addition after the chi-chi, overpriced Papalote and Green Chile Kitchen.  I mean, c'mon! pushing 10 bucks for a goddamn burrito is just rotten. \nAnyway, the food here is just fine, the staff are real nice and you can even get desayuno anytime. 5 stars just for doing the right thing.", "author": "Phillip M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "I love this place !! I try to come here 2/3 times a week because its that good !!! I love that the salsa bar has an amazing Habanero Salsa , but not only that it  also has an amazing Guac salsa as well , and you only know if you are from the southwest that this is an awesome standard !!!! Try the quesadillas because they are Awesome !!! and you have from like 4 different tortilla types to choose from !! Spinach, Wheat, Garlic and  Flour !!! :) Thanks El Rancho !!! I know your locals love you and I do too even though I live at Park Merced !!! :)", "author": "Javier G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "This place must be somehow affiliated with a favorite of mine, El Castillito on Church.  The salsa verde, tortilla prep and rice seasoning are all the exact same.  \n\nThis place is cheap and goodies, but the service is way too slow to be a viable grab and git option.  You expect super slow service at Chihuahua, Green Chile and Papalote, but this place should be differentiating itself with speed and value.  It's close.  They should definitely remove the burgers from the menu - it sends the wrong message and i'm sure no one orders them anyway.  \n\nSolid effort that should hopefully speed up over time.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-02", "description": "This place opened super close to my old house (I moved last month) and it was a revelation in a way. I was just glad to get a pretty darn good Mex food place wo having to walk to the Haight or (obviously) the Mission. \n\nWHAT I ALWAYS GET: The GRILLED VEGGIE BURRITO. Yum Yum Yum. Cheap ($5) and feels health(ish)", "author": "Perry S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-10", "description": "For a local Taqueria this place is worthy of 3-star. It's really just A-OK, as Yelp puts it.\n\nIt's food is more safe then truly flavorful, and their portions are big rather then tasty. Then again this is the only taco place located on Divis in that area, so it's kind of got the area to itself. \n\nIMHO there are many really good taqueria places around town, including taco trucks, that put this place to shame. Then again if it's 2am and you're wondering out of Minibar next door, I can certainly see the appeal.\n\nOverall, if you need your burrito fix and you're on foot, this place will do in a pinch. If you're craving the ultimate mexican taco truck like experience, go elsewhere.", "author": "Erik B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-26", "description": "I begrudgingly love El Rancho Grande.  While Little Chiuaua gets most of the attention in our hood, I am always drawn to El Rancho, and order there more often than not.  It's simply a good mexican food at a reasonable price.", "author": "Nick M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-17", "description": "Horrible food. Just finished ordering some nachos.. Everything tastes like it comes from a can, the beans,  the tomatoes in the salsa.. Low grade Mexican food. Couldn't even finish eating our plate.. And cashier wasn't friendly at all, she was texting the whole time we were ordering.", "author": "Brenda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-16", "description": "I live literally three blocks away from this place and I keep going back. Their super burrito is totally on par with most of the Mexican places in SF. I alternate between their vegetarian and chicken. The guacamole, as usual, makes the burrito great.\n\nOverall, they do a really good job mixing the ingredients to the right proportions. The rice is never over/undercooked, the beans are always flavored well, and the tortilla never over toasted.\n\nI like to stay with the burrito. I've also had the mushroom quesadilla, which was jammed packed with cheese and mushrooms, though I have to say it was a little too overwhelming for my taste buds and perhaps digestives system.\n\nPlus, like all great Mexican joints, there's always FUTBOL playing in the background.", "author": "Terry H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "I'm very happy to have a good burrito place right in the hood.  This is not the \"best\" burrito in the city but I have not one bad experience so not sure where all of the bad reviews are coming from.\n\nThere are lots of authentic options and fresh juices too. The grilled chicken is very good and the home made salsa's are excellent as well.  Very nice people.  \n\nThey do not have a bean and cheese burrito on the menu, which is what I get for my kids. They are always happy to make it but never sure what to charge.", "author": "don M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-24", "description": "I stepped out of Mini Bar a few doors down and noticed that the new burrito shop had finally opened.  Thrilled, I stepped in and ordered two chili verde tacos, which were spectacular.  The salsa bar is stocked with very fresh tasting salsas, and the chips are great.  \n\nThe next night I went for a burrito and again had chiliverde as it was so great the night before.  My new favorite burrito, in a city with so much competition for that title.  \n\nI was going to start a fast today, but I'm going to have to work through the menu here for a few days first........", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-31", "description": "Surprised to read reviews about how bad the place was (bones in burritos, bad quality meats, etc.).  Luckily, I hadn't read any of these when I stopped by to fix my carnitas burrito fix.\n\nIMO, standard fare, quick turnaround, friendly service, reasonable prices.  There are some great burrito places nearby so hopefully they can work out the kinks but my experience here was pleasant.", "author": "F. P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-26", "description": "I had a carnitas burrito mojado and it was probably the worst burrito I've had in San Francisco.  I'm glad to have a taqueria down the block, and I'll give it another try sometime when I don't want to walk more than a block for a burrito.  Every other burrito place in the neighborhood (Green Chile, Papalote, Little Chihuahua) is worth the walk.\n\nExtra star for the salsa bar, a nice touch.", "author": "Kat W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-14", "description": "It's no SoCal mexican food, but the portions where big and there is finally a decent mexican food place that is near my house. Overall, San Francisco has not impressed my palate in regards to mexican food, but stick with mission if you want something closer to the real deal. \n\nThis is more for a quick grab when you're craving it.", "author": "Riley B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-22", "description": "Seriously, if anyone out there is willing (even in a drunk stupor) to accept this as a viable Mexican Taqueria, they need to move back to what ever shit hole town they came from.\n\nLow quality ingredients, flavorless food, down-right disgusting salsa bar (think Pace Picante) and you've earned yourself a permanent boycott in my book. I've been here over a dozen times, and it's progressively gotten worse and worse. There burritos are like a big, luke warm wrap of sawdust drenched in spoiled beef grease. While I've never gotten full-blown food poisoning, me as well as many other locals have gotten queezy after ingesting their gruel.\n\nI HOPE the owner reads this and takes heed. Sure, drunken Marina adventure seekers (\"Divisadero is so edgy\") may gobble down your slop after the bars close, but I would think you'd care about the quality of the food attached to your name!\n\nDo yourself a favor and go to Pancho Villa, El Toro, Cancun, etc, etc, etc...See what others are doing RIGHT that you are CLEARLY not. Maybe court the one of the aforementioned establishment's daughter's and probe her for recipes and secrets. I don't know what else to say, other than I prefer corner store burrito's to yours.\n\nIt's only a matter of time until an actual REAL Taqueria catches wind of he potential business and opens along Divisadero. At that point your business will be heading for the big Rancho Grande in the sky.", "author": "Honest T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-12", "description": "We came here craving some burritos, and left having eaten some \"super sized\" burritos that filled our tummies. Despite having a full stomach upon our leave, though, we felt the place overall was only okay.\n\nWe ordered two super burritos, one with BBQ chicken and the other carne asada. Neither was particularly great, the carne asada in particular was a little disappointing, but both were okay. Because we decided to eat there, we also got complimentary chips. The chips, while not super fresh, were decent. They also had a well stalked salsa bar, although the freshly chopped salsa was way too watery.\n\nAll in all, we were satisfied, but some of the problems were a little too glaring for the overall experience and because of that it's doubtful we will be back.", "author": "Sami R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-22", "description": "Came in here the other day for lunch.  They have a decent salsa bar with 4 types of salsa, verde being the best. Added points for having grilled jalapenos, grilled onions, regular jalapenos and limes. Chips a little lacking but not horrendous as I dont think they were fresh.\n\nPretty expansive menu w/ full plates, tacos, tortas, etc. They serve beer but apparently not by itself. Pretty large TV in the corner that should usually have on some type of soccer.\n\nI ordered the regular pollo asado burrito, good size, good taste. Meat was done quite well, not too much rice. Definitely better than Gordos or Pancho's on Geary.\n\nRegular burrito was decent price at 6.80 including tax. Tacos are not super cheap at $2.50 ea especially since I usually get $1.50 tacos down the Peninsula by my work but still a good deal. A plus is that they are open until 2 on Fri and Sat and 12 every other night.\n\nAll in all I would eat here again tomorrow.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-18", "description": "This place is great.  I go here on Thursday nights periodically with a group of 10 to 12 friends.  The service is splendid, fast, and they never make mistakes.  We all get our food very quickly and there is plenty of room for us to sit together.  The prices are good and you get very large portions.  They give us free chips and salsa, so we are never tired of waiting for our meal to come.", "author": "Carlos P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "I really like this place. More authentic than Chihuahua, yet not quite the same salsa selection. They used to have roasted whole peppers at the salsa bar which is always good. Good specials and a great location for a taqueria.", "author": "Paul Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-22", "description": "A go-to for NOPA residents. I had an al pastor burrito that wasn't too impressive, but their California burrito is pretty solid (for NorCal). Tacos are enormous; too much for the two tortillas they give you. Ask for a third.", "author": "Travis S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "My staple place as of late.  Good prices, good but not great quality, good quantity, and lots of great salsa from the salsa bar.  Nothing overly special but in my opinion better than Papalote. ~$7 for a burrito.", "author": "Evan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-26", "description": "This place used to be awesome. I'm not sure what happened though because recently it sucks. Maybe they hired new people and didn't train them properly. The tables are always filthy and sticky now. The fat girl at the register has a bad attitude and messed up my wife's order then gave her a hard time about it. The California burrito I had today was the worst one I've ever had. The tortilla was burned and stale. The meat was full of gristle and I had to spit out chunks of meat I couldn't chew constantly. Seems like this is a trend for restaurants on Divisadero St, they get super popular because of all the damn hipsters and then they start to suck till they go outa business.", "author": "Morgan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-23", "description": "5 stars for awesome food for the price, nice people working there, open late,and  awesome location. One of my favorite hole in the wall places.", "author": "Paige G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-21", "description": "Everything in my burrito was cold. They didn't even bother to put warm beans in it. Most disappointing burrito I've ever ordered. Good thing this area has so many other options!", "author": "Katie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-25", "description": "My impression is that I'm not overwhelmed or underwhelmed.  The food was better than 'meh, but pretty much 'meh.\n\nAfter weeks of waiting the place opened and so we had to give it a try.  Wanting to try a lot of different things my husband and I ordered this stuff to go:\n\nSuper Carna Asada Taco\nChicken Tostada\nFish Taco\nChicken Flautes\nSuper Steak Quesadilla\n\nThe steak taco was a sloppy mess in a box.  I had to eat 2/3 of it in order to pick up the corn tortillas and bite into it.  The flavor was delicious.  I'm thinking steak burrito would be much better.\n\nThe tostada was again, a sloppy mess to the point I had no idea what it was.  And the shell was not crispy, and had  probably never actually been fried..seemed like a corn tortilla just layed down and layered with slop...tasty slop.  I did have one of those unfortunate bites of chicken that seemed to be bone, grizzle, muscle, or something tough.  I poked around for about four bites then straight up gave up.  I won't recommend any of it.\n\nThe fish taco was not bad, but after two bites I found myself wondering if my dog might like a taste of the fish.  Not a good sign.  \n\nMy husband thought the flautas were excellent.  My only warning is that they are smothered.  So if you get them to go, either plan to eat them quickly or ask for the guacamole, pico, and sour cream to be on the side.\n\nHis review of the super steak quesadilla is \"It was pretty good.\"  \n\nThe flavor is there.  I think, because everything seemed so sloppy, this place will be best for burritos and hopefully enchiladas.  (fingers crossed)", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-26", "description": "Wow! Just went to this place because it next-door to another stop I had to make.  I got a super chicken burrito and was very tasty.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-15", "description": "I ate a damn good burrito tonight from here. It was PACKED with chicken, beans, cheese, lettuce, guac, sour cream, etc. But literally packed in a way that it was almost hard to eat. It was almost so hard to eat that it kept falling apart and was super messy. By the time I got the last 5th section it fell apart completely and I couldn't put it back together. That part ended up in the trash. Maybe a fork would be wise next time! It was super good though, and huge...if I was given more foil it could've been used as a second meal. Everything else about this joint was fine, except for the fact that the television was blasting. I couldn't even hear my own self think over the volume. But that's not a legitimate complaint, because like I said the food made up for it.", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-01", "description": "OMG this place is so good, after the first time I went there I called 12 people to tell them I had found the best food for under $10 in San Francisco. You should also know that not only am I SUPER picky and I always want some sort of substitution, my daughter is even worse than me. They place is also very clean and the people are really nice!!!!!!!!!!", "author": "Shannon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-31", "description": "This place was nearly empty when I walked in tonight.  You know what that means?  It means you can get in here before it comes the next big thing.  I ordered a carnitas burrito mojado here this evening, and I've got to say, having eaten in taquerias all over California and Texas, the carnitas are among some of the best I've ever had.  Sure this neighborhood already has green chile and little chihuahua, but up until this point we've not had a proper traditional taqueria.    Reminds me quite a bit of El Castillo.  Good horchata too!  All I can say is after tonight I'll be a regular and you'd be a damned fool if you aren't as well.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "I have only ordered the prawn burrito here but every time it's a tasty prawn party in my mouth. I love how they butterfly the prawns so they are super succulent and it seems like you are getting more prawns in every bite! Also, I really like the number of prawns they give u-- usually places will skimp out and hardly give u any.  You get a bite o' prawn in almost every burrito bite here. I also like how they put a little cheese and sour cream but they usually don't overdo it. El Rancho Grande is hands down the best place to get a prawn burrito in SF.", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-18", "description": "Best horchata I have ever had.  Tostada salad scarfed it down. Tortilla crispy and golden brown. Salsa Verde rules.", "author": "Bill T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-05", "description": "Unspectacular, BUT definitely solid. The menu is huge, & the portions are ridiculous. This is arguably the most cost-effective meal in the 'hood these days. One super chicken taco at $3.50 is about as big as a super chicken burrito at $7 at most other places. Again, the food is not going to blow your mind, but it's definitely better than passable. So what, it's not gourmet. Nopalito is a few blocks away. Take a walk or put a little hot sauce on it & deal.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-19", "description": "This might be the worst Mexican place I've ever been to in San Francisco. Aside from the carnitas being highly over-seasoned, fatty and lukewarm, my first bite was complimented by a giant bone shard. The rice was drier than a (or rather, the) bone, the salsa tasted old and sickly sweet (why!?),  and the guacamole was worse than that Guacamole Dip you buy at the store that's really just green sour cream. To top the whole thing off, the tortilla had so much shortening in it, I could see straight through it. Really, I could have used it as plastic wrap. What a miserable experience. I'd rather eat a bum's discarded Taco Bell remnants. If you care about your happiness in any way, shape or form, do not eat here.", "author": "Andy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-09", "description": "This one time, I was NOT sober and I REALLY needed a 'rrito. That's pretty much where the story ends. Thanks guys... and cashier chick with great nails.", "author": "Kiki C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-12", "description": "Not bad.  Pretty good flavors.  The chicken taco has a nice freshness to it with onions, cilantro and tomatoes.  The fish taco is good.  Again very flavorful.", "author": "Frank M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "This place is fast, good, and cheap.  Love it.  The chips are amazing, and I love the green salsa.", "author": "Liz A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-05", "description": "The Ranchie Grande deserves Zero stars.  I'm an SF local --favorite Mexican food El Farilito, Cancun, Tommy's Mexican, and Underdog's Taco Shop, Burrito Express.  I love Mexican food.  Usually, I'll even be happy with bad Mexican food, but this is the most sick demented plot devised by mankind.   Someone put a what looks like a Mexican taqueria right across the street from my apartment in a neighborhood void of late night mexican food.  Inside you will even find chips and salsa that aren't too bad, but the meat (I've tried steak, chicken, and Carnitas) and beans are disgusting. I gave this place three tries hoping that I was being over judgmental or that I got a bad batch, but each time I stopped myself halfway through and had to throw it out.", "author": "mick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "For all you San Diego kids now living in the city, this place has a very acceptable California burrito. No joke. After many let downs trying \"California burritos\" at other taco shops, I am so happy I found this place! I haven't tried anything else on the menu, but I'm sure it's all good. If you haven't tried a California burrito, do yourself a favor and get one. This is the closest thing to the REAL thing I have been able to find!", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-06", "description": "So I signed up to Yelp JUST to respond to a few of these reviews.\n\nI live down the street and go here twice a week. Not because it is the BEST Mexican food ever but because it is close and authentic. A few people refer to Little Chihuahua and Green Chile Kitchen as better. Sorry - those are not even in the same category. This is a TAQUERIA - NOT a schmancy SF gourmet mex knock off. Don't get me wrong, I like both of those places but they are NOT the same thing. This place has good, fairly priced, authentic taqueria food. As someone who was born and raised in the Bay Area I have been going to all sorts of Mexican food forever and this place is good enough for the location.\n\nBottom line - if you are thinking of driving across SF to come here you are better served going to Pancho Villa or somewhere else in the Mission. HOWEVER - if you are leaving the Independent or romping around Divisadero it is the best/most authentic around and is open SUPER late-night(dude even passed me some tacos out the back door one night when they were closed). \n\nI tend to get the Al Pastor taco/burritto. See you later tonight Rancho Grande!!!", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-04", "description": "This place is a dunk munchie sufferer's dream.  Their burritos are insanely satisfying.  You will most likely come back for more after trying it once.  Its hard to find a place like this on divis among the sea of bars and other drinking wholes.", "author": "Andrew Christian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "This is great local taqueria. I've been a regular since they opened. The staff is super friendly, the service is quick, and the salsa bar is always stocked.  Extra chips would nice!", "author": "Martin V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-29", "description": "FINALLY my gentrified, boring ass neighborhood gets some good cheap eats. By San Francisco standards, this is decent Mexican cheap comida. Open late, good fare and good people. That's what it's all about.  Now If I can talk them into serving Birria, I will be really doing cartwheels.....", "author": "Tim E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-20", "description": "I think the food here has improved since I wrote my last review. The burritos are decent, and the service continues to be friendly.", "author": "Leslie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-11", "description": "So this place is AWESOME for what it is... I always get the carnitas super burrito and it's only $7, feeds both my boyfriend and I!  Open super late, and always quick! Friendly cashier who gave us a sample of horchata! We love this little place! Great food and affordable price. \n\nIf you ask for extra chips they will gladly give you more than one bag!", "author": "Talli L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-20", "description": "Pretty darn good.  Food portions are huge, staff is friendly,  and prices are definitely reasonable.  I have been here on three occassions and each is a success.  They offer a very consistent meal with large portions.  The super burritos are huge, not dry and delicious.  The Wet burrito was also a huge portion that probably could feed a family of six from Bangladesh and they would still have left overs for the next day. In addition my co-worker got the fish tacos and she said they were also delicious and cheesy!  The friendly lady that took my order also said that they make their own chips and salsa!  You could definitely taste the difference from other taquerias.  Hasta la vista baby, until we meet again.", "author": "Hanna A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-18", "description": "Solid post-drinking snack spot. Cheap, efficient, and always crowded and open late for all of us with drunk munchies.", "author": "Lina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-16", "description": "Great neighborhood spot and delicious Mexican food. super nice staff, reasonable prices, and vegetarian beans.", "author": "Beth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-06", "description": "Some of the best damn tacos in town. I was pleasantly surprised when I walked in when this place first opened. The staff is friendly and the food came out fast. Try the quesadilla suiza. It's huge and very satisfying.", "author": "AJ R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-11", "description": "Haven't been here at length, but it was friendly, bright, and clean when I dropped by at 11PM on Sunday after a show. I got a chorizo super burrito to go and didn't regret it at all. Cheesy and flavorful, a sizeable meal at a very reasonable price.", "author": "Kelly J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-18", "description": "I don't know if it's because I was slightly inebriated or not, but my super burrito was amazing. I also got horchata and I wish it had more cinnamon. It was also small for the price. This place was open pretty late and is perfect after a night of dancing at the Independent down the street.", "author": "k h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-04", "description": "I love all of the new places opening in this neighborhood and was excited to see another mexican option.\n\nMy criteria for a good taqueria are the variety and the originality of the salsa bar, the quality of the meat and the tortilla chips.  I did really like the chips - a little different than the super light one you find most often.  They were small, crispy and salty - really enjoyed them.  The salsa bar was a bit of a disappointment.  Only two options and a pico de gallo.  Neither was especially unique or flavorful and no spicy option.  I also happened to arrive at a time of day where I was scraping the bottom of the salsa dishes while one of the staffers carefully restocked the ketchup packages. (Yes, they serve cheeseburgers and some other non-mexican dishes - I believe in doing one thing and doing it well, but just my opinion.)  The meat quality was average at best - got a couple bad cuts of chicken I had to spit out.  If I go back, I'll definitely go veggie.\n\nIn all, it was good.  If Little Chihuahua weren't just a few blocks away, El Rancho Grande would easily satisfy my mexican craving.  But Little Chihuahua has an amazing salsa bar, the highest quality meats I've found in SF (steak - phenomenal!) and yummy chips they always serve warm.  \n\nThat said, it was a good burrito and I recommend giving it a try and forming your own opinion on the place.", "author": "gretchen d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-12", "description": "al pastor tacos and carne asada tortas are my go to menu items here...the tortas are good cant be healthy for you and are a mess but i cant stop ordering them.", "author": "E.W. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-08", "description": "Not as good as the best spots in the Mission but it's open late and even when I'm sober I know I am going to get a lot of food (their quesadillas are HUMONGOUS) and  it's good...for San Francisco.", "author": "Mike T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "Strawberry agua fresco was amazing and fish tacos were absolutely delicious and loaded with fresh fish!!!", "author": "L B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-04", "description": "I had to try it since there was a parking spot right in front of the taqueria and I was driving down the street. It happened to be my lucky day because I was hungry and I was hungry for a pretty tasty taco, which I did order. My brother had the wet burrito wihch looked amaZing and tasted better than it looked. My tacos were very much worth the 2.25 and loved the salsa bar selection offered. They seemed pretty happy to serve me which made my dinner very enjoyable. The place was very clean and organized with many diferent things to try on the menu. I will be a regular there and I would definatly recommend this place. Everything deserves a chance, you gotta try it atleast once!", "author": "shadi a."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-26", "description": "This place gets all its points for BEING OPEN LATE! I live near by so my roommates and I just have our cab driver drop us off here instead of at home at the end of a night. I'm pretty sure the food really isn't that good, but when your'e drunk and with friends at 2:00AM on a Fri/Sat, does it matter what the burrito and nachos actually taste like? Great late-night stop when you get those drunk munchies!", "author": "Janie Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-12", "description": "Gross Gross Gross.  This place is owned by Arabs.  Meat is rotten tasting, very old and they use it until it sells.  Oil used for cooking is rancid---you can taste in the chips.  I had to throw my burrito away--beware, this place will make you sick.", "author": "John G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-10", "description": "I do NOT recommend this place.  My burrito (super veggie), to go was cold and lifeless. Do yourself a favor and walk a few more blocks to either Green Chili Kitchen or Little Chihuahua or Popalote. All three are miles better than this place.", "author": "JJ S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-10", "description": "Very tasty and inexpensive food, nice staff, open late. Standard taqueria fare plus the best Mexican soup I've ever had. Their caldo de cameron is chock-full of veggies and shrimp, and the seasoned clear broth is just flavorful and hot enough to kick a head cold to the curb.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-16", "description": "\"Where's the beef?\" Loved that it was near my house....They gave good carne asada and toppings ratio in the burrito when they first opened...I went back and I barely had carne asada...I thought it was just a one time mistake...went just recently again and still no beef :-\\ I was a regular and hopefully they change their burrito ratio...so I can come back....this place would have gotten 4 stars :-P Go to OCEAN TAQUERIA down the street...wayyy better.", "author": "J.B. E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-04", "description": "This is a great place to get a massive burrito for under $8 (w/ meat) or $7 (veg).  Up there in taste with Papalote and cheaper, way better than Green Chile (rip off).  Really good - try it out.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-05", "description": "It is hard looking at a sign that says \"hot mexican food\" while you are eating an ice cold burrito.  I was excited to have a more traditional low-key taqueria in the hood for those times when I just want some quick good mexican food.   I ordered the vegetarian burrito (I'm a meat-eater, but wasn't in the mood) and sat down to wait.  Within a minute, the waitress hands me a burrito.  I was wondering how they could have made it so fast given the 2 people ahead of me, but soon realized that it must have been pre-made.  When I bit into it, it was completely cold in the middle.  My guess is that they had refrigerated the burrito and heated it up once I ordered it.  The burrito was little more than a tortilla stuffed with cold mush and some half-frozen vegetables.  My standards for taquerias aren't too high, but it takes some nerve to charge around $7 for a cold, pre-made burrito in San Francisco.  Definitely the worst I've had in my 8+ years in SF.", "author": "Tim S."}
