{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-15", "description": "Love ordering through DoorDash or postmates for delivery. Pretty fast and decent food. The sesame chicken, string beans, and Mongolian beef are the best. Don't order the Chinese chicken salad (wasn't bad but I've had it so much better at other restaurants that it was disappointing. Really lemony and drenched in dressing). Also the walnut shrimp is good but when you order to go they put sauce on the side and honestly don't put enough. \n\nOverall good food and they give lots of it! Meals for days or good for sharing!", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "I'm a flight attendant and I was staying on a layover in a nearby hotel. I ordered delivery because I was dead-tired and also a little lazy. \n\nThe food was delicious, I ordered enough for five people because I wanted to taste everything! My favorite was General Tso's Chicken. It's similar to orange chicken, but less tangy and more savory. I also purchased the crab puffs, spring rolls, and pot stickers. The only item I could have done without were the pot stickers, but everything else was great.\n\nThe food was delivered way faster than initially estimated and everything was correct. I would definitely go there again.", "author": "Yaima M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "Ordered delivery (via Postmates) for the first time last night.  The food was ready fast which is a plus as I waited until I got home for dinner before ordering (usually order dinner on my way home so it's ready when I get there). \n\nOrdered the following:\n\nCrab puffs - my roommate loved them!\nEgg flower soup - eh.  It was a little bland for me, I added salt and soy sauce to bring a little more flavor to it.\nSweet & sour chicken - this was tasty!\nChicken & green beans - I liked that the green beans weren't soggy but also not too crisp and raw, cooked well.\n\nOverall I would order from them again but maybe try a different soup.", "author": "Anita T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Amazing that somewhere could produce such freshness and quality when there meals were ordered takeaway . \nThe dumplings were fantastic and the lemon chicken among the best we have ever had.", "author": "Matt S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "Quick spot for easy lunch, parking on the street, I ordered #21 Salt & Pepper deep fried fish fillet - topped with dried chili, served with white rice.  You will get a small bowl of sweet & sour soup and a crab cheese puff before your main dish is served.  The dish I got was very tasty which fulfilled my lunch craves nicely.", "author": "Nat T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "If you are looking for delicious Chinese, stop looking and place your order.\n\nThis is actually the second time I've ordered from them in as many weeks.  I ordered through Yelp Delivery both times.  Both times my order arrived on time, piping hot (almost burned my tongue!), and correct.  What more could you ask for?!\n\nThe sweet and sour chicken was delicious, full of tender good quality chicken.  The cream cheese wontons are great too!\n\nThe only slight bummer is that they forgot a soy sauce packet the first time, but considering I got one the first time, I'm guessing it was a fluke.\n\nThe delivery driver driver came directly to my door and was very polite both times.\n\nFree delivery and and a low minimum.  Just overall a perfect find.", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-06", "description": "I got food poisoning after eating here last night.\n\nI ordered the sesame chicken and soup dumplings. They both tasted good at the time, but nothing -nothing - is worth how I felt 6 hours later.\n\nBe careful eating here.", "author": "Andrea D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "I've ordered here about 10 times for delivery and overall have had a great experience with them. Delivery is around 45 minutes and quality is consistent. They cut holes in the packaging to ensure texture of food stays crispy through the steam. Mongolian beef& general tsos chicken  & sesame chicken are great for takeout nights.", "author": "Mimi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "I have to say I really enjoyed my take-out from Elaine's Kitchen. I got sesame chicken and it was pretty great. It was crunchy on the outside and yummy on the inside. I am excited for my next order.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-02", "description": "Omg!! First off, I have to laugh at these people who uploaded a photo saying they got a broken container! You know they do that on purposes so your food won't get soggy from the moisture? Lol!! Wouldn't you notice by seeing all these other people uploading the same container? Anyway, enough sticking up for this crappy place.\n\nI already knew I was going to rate his place a one star when I took a bite out of my potsticker and oil shot at the back of my throat. That was my first bite too! The chowmein had to flavor. It was bland and I felt like I was wasting my calories. The fried rice wasn't good either. Bland as well. It's so bad that my dog sniffed our Chinese food and didn't even want a taste.\n\nThe string beans we ordered sat in our fridge for 2 weeks until we decided to clean our refrigerator and ended up throwing it away. \n\nWe should of listened the Yelp reviews before we wasted $50.", "author": "Darlene M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Very impressed, had lunch here today with a group of 9, staff were very accommodating. Everyone loved the food so much that we went back for dinner with a group of 17 with kids of all ages. Once again, very accommodating.  The food was delicious. Difficult to pick favorites, we ordered many different things everyone was happy.  Staff was even willing to go off menu for a picky eater. \nFried foods like sesame or orange chicken were crispy with a thin coat of batter and all white meat. Curry chicken and chow meins each had loads of flavor.  Cream cheese crab puffs were more interesting than most. Loved the salt and pepper fish.\nThis place is highly recommended,  you should go there now.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-28", "description": "This is probably hands down THE worst Chinese food I have ever had. We looked at the reviews and decided to go for it, since people love the food here. Boy were my husband and I sadly mistaken. I have never seen more grease on food in my life, I think the oil was rancid or something. The beef lo mein, I cannot even describe the taste. I'm gagging now just remembering it. Steer clear and go somewhere else! This will not satisfying any type of Chinese food cravings and you will be upset at wasted money and an upset stomach.", "author": "Kiera L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "I ordered on my mobile. The food was great. It came much faster than I expected!!! I ordered the orange chicken, broccoli beef and the crab cheese puffs. All were delicious and fresh. The delivery person was polite and friendly. The serving size was very generous as well.", "author": "Olive R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "I bought a Kung Pao Chicken Lunch special meal & it was super delicious with the right kind of spices & lot of chicken cubes thrown in. Took me a while to eat all of it but one of the best Chinese joints in SF Downtown.", "author": "Abhishek S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-17", "description": "Insanely fast delivery, and the sesame chicken is SO CRISPY and DELICIOUS! This is my new favorite Chinese restaurant in the city.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "I've lived near Chinatown for nearly 7 years. I am usually skeptical about the cleanliness and authenticity when it comes to eating chinese food especially near chinatown(s). I order food here about 2x a month. I'd recommend broccoli beef, Mongolian beef, orange chicken, sweet and sour chicken for entree choices. Personally my favorite meal on the menu is the lemon  chicken with a side of white rice. The staff is very friendly and the kitchen appears to be sanitary and clean :) \nI love eating here , I've never been dissatisfied nor have they ever messed up my order.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "I don't know how but I have never had a bad place to eat from Yelp. Elaine's Kitchen was no exception. I had a shrimp and walnut dish that was very delicious and out of the ordinary taste wise. Also the crab wantons were very good. Lastly I feel the price was a good value for this city.", "author": "Wlliam C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Maybe my new Chinese to go place! Sesame chicken was cooked perfectly and not smothered in sauce. Also fast deliver despite what yelp said on the estimated time. They came in half the time and food was still hot! \n\nFor the reviews about the \"broken\" containers, this is intentional so your food doesn't get soggy! It lets the steam out. \n\nMy chicken and honey walnut shrimp came crunchy and crispy due to this. (sauce also came in a separate container which also helped! \n\nSo good!", "author": "Anna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "I ordered late night take-out and was not disappointed! I got the pork pot stickers and the sesame chicken. Both were very good and fresh. The food arrived about an hour after ordering and was a little like warm, so minus one star on that. Otherwise, very good and I will definitely order from them again.\n\nNote: the delivery guys will call/text and ask you to come down to their car to retrieve your order,  so keep your phone handy!", "author": "Cassie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "**MealPal Review** \n\nElaine's was very filling and tasty. I got mapo tofu with rice and I was stuffed by the end (which can be an issue with MealPal meals). A container stuffed with white rice and tofu. While it was very good, I wish there had been some kind of vegetable to make the meal less heavy. Excited to go back for MealPal as well as just going back to try different options on their menu.", "author": "Bito M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Great service\nBig portions\nLow prices\nDelicious food \nAnd especially love the General Tso's Chicken", "author": "Chantelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Such good food! Came for the lunch special and ordered lemon chicken with fried rice. Chicken was crunchy with right amount of sauce and rice was well prepared.", "author": "S C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "I love this place! They give you more than enough food, it's all exactly the americanized Chinese food you were looking for! Also their breaded chickens (sesame, orange, general tzo, etc) kinda tastes like funnel cake. 0.o I'm not complaining though. Delicious!", "author": "Grayson K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Haven't ordered for delivery in a while been trying to be a penny hoarder. Anyways decided to order Chinese food. Been wanting and craving for some. Saw that I had a few extra change left after paying SF rent....and oh man this was good. The delivery guy was cool as well. Will be ordering more in the future once staying home and watching tv starts paying more $$", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-08", "description": "Honestly I don't know why it has so many good reviews.\nI came here to grab lunch and ordered the wonton soup, it was not good at all. :/\nI had some spring rools too and they were oily and tasted weird.\nService was not good either.\n\nSorrym but I'm not coming back.", "author": "Brigitte S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-23", "description": "Not a fan. The Honey Walnut prawns were mixed with a buttery sauce and the white rice was over cooked.\n\nThe war wonton soup was good though. They had plenty of meats", "author": "Eric T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "Went here because of the solid Yelp reviews.  Got beef with mixed vegetables, chicken with string beans, rice and one tea for 30 bucks.  Not a bargain bite place but still reasonable for SF.  Food was good white boy Chinese. Both my friend and I thought it was delicious .  I'll probably be back again - just wish it was a tad bit cheaper. Staff was friendly and nice! So points for service.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Amazing food! Bang for buck. They give big portions for a super low price. The food is well made and I highly recommend the mapo tofu (if you like soft tofu) because the sauce, when mixed in with white rice, is perfect!\n\nI will definitely be returning and telling friends about this place!", "author": "Eric P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "This such a great place, I loved the decoration,the art on the walls, are all very fascinating. Our waiter was so nice even when we spilt water she cleaned it up, moved us to a different table, and made sure we satisfied with our seating. She also had great advise on what to order. The food had perfect portions and was extremely delicious and most places that serve orange chicken make it too sweet or unusually bright orange but this place actually put a orange flavor in it, that made it so great. I think this is the best Chinese food I have ever had and I wish it was in the town I live in so I could have it all the time. But when I come back to San Francisco I will come here. I highly recommend this place to any Chinese food lovers.", "author": "Theo _."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "So good!! I ordered takeout and the estimated delivery time was 60 minutes. They ended up getting here in 20 minutes which is extremely impressive! The delivery fellow was extremely nice as well. \n\nNow for the food - I ordered wonton soup, General Tso's Chicken, and steamed rice. The wonton soup was very good. Not the type of wonton soup I'm used to but still very delicious. The General Tso's chicken was AMAZING. It was so perfectly crispy. \n\nQuick delivery, great food, good price. Highly recommend!", "author": "Mallory S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Solid Chinese delivery place! Ordered from GrubHub, food came hot and fresh and on time. \n\nCrab Rangoon and Egg rolls were crispy and good. We got the crab Rangoon for free for spending over $35 I believe.\n\nSesame chicken was yummy, although could've used a little more sauce.\n\nHoney walnut shrimp tasted different, it had a very overpoweringly lemony flavor and batter was a little doughy.\n\nGreen beans were alright, not memorable.\n\nWould pass on the cumin beef, too many onions and peppers. \n\nIs it the best Chinese delivery? Definitely not, but so happy to find a place that'll deliver to the food desert that is Mission Bay. Also, no GI distress afterwards :)", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "Excellent sesame chicken. If the box they arrive in is broken in the corner, it's intentional so it can vent. \n\nGeneral Tsao's chicken might sound similar, but it's too soggy and more batter than meat. Skip that and get the sesame chicken instead.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "Food is great, and the location is wonderful! I have been eaten here of a entire year! The outfit is marvelous!", "author": "Sam L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-01", "description": "Wasn't great, price was high. They did deliver to my\nHotel room though and got there fast!", "author": "Maci B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "Everything I ordered tasted a day old, seriously worst Chinese food I've ever had. There was a hair fried into a chicken wing. The Mongolian beef was mushy. $50 on delivery and we couldn't eat it. This is the first review I have ever done, it was that bad.", "author": "Jamie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-03", "description": "The chicken chow main was like all noodles and little vegetables or chicken.  Like a brick of noodles.   I was disappointed I hope they improve the recipe.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "Food is delicious. Please note, if your lid had a hole in it that's to let the steam out so it doesn't make certain foods lose their crisp like fried chicken or shrimp, etc.", "author": "Raquel T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-16", "description": "Took longer than promised, had tipped 20% online before hand, didn't bring it up to my hotel room, because they couldn't find parking and didn't leave utinsils to eat with, when I finally found a fork, found that the fried rice I ordered with no onions had onions. Horrible experience.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-01", "description": "Did not like this place. I got the sesame chicken, and it was not good. I won't be coming back.", "author": "Kim H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-09", "description": "Sometimes you hear so much about a place that you finally give in and be like \"What the heck, time to give this place a shot!\" So you go out your way even going to \"The City\" early to partake in what seems..(according to reviews) really good \"Chinese Food\" in North Beach. Was the result a great experience at the end of the day? Could I have gone elsewhere and had \"Chinese Food\"? Well let me yelp about it for a minute. Here is my review of Elaine's Chinese Cuisine.\n\n6/21/16\nI was feeling pretty good this day. It was sunny out and sporting my \"SI Yankees\" jersey not only in celebration of the MiLB victory but, MLB \"NY Yankees\" victory. Like as usual, I was hungry. And everyone knowing me..\"I love Chinese Food\" So with that being on my mind and Elaine's being in my site, I was ready to eat and see what the fuss was about..plus I need food on my stomach if I'm having a few drinks.\n\nService 3/5\nCleanliness 3/5\nFood 3/5\n\nFood/Service:\nSo I enter the restaurant and some of the staff are watching TV instead of maybe..cleaning tables, tending to hungry customers (me). It took a few minutes (Really) for a worker to see me from the kitchen and then came to take my order. So on this visit I decided to scan the menu. I of course was a bit late for lunch time so I had to order a la carte. After deciding on what I wanted, I ordered. Sesame Chicken ($7.95) and Shrimp Chow Main ($6.95). After about fifteen minuets, my to go order was placed and I took my food with me to eat at my favorite bar.\n\nSesame Chicken - It was the better of the two selected dishes. It was crispy, had a nice almost citrusy sauce. It was mild, and had a nice little ginger note to it that rounded off the chicken well. This is something I would order again. One of the better Sesame Chicken dishes I've had in a while. I would give this 5 stars alone really.\n\nShrimp Chow Main - This was a huge let down. The whole togo container had 5 shrimp in it. And the shrimp was the only really flavorful component in this dish. The noodles had zero flavor, the veggies had no flavor nor that nice snap that veggies seem to still have in good chinese food side dishes. This was very disappointing and will \"Not\" be ordered again by me.\n\nWill I go back?\n\nSure, I like to give \"Chinese Food\" places another chance. Considering it's my \"Favorite\" food. And this place is in my favorite area of SF.\n\nIn Conclusion, I may not have had the best total first impression, but 1 out of 2 isn't to bad of odds to count this place out. It sits on Broadway in a heavily trafficked area where they are bound to have consistant business. As always if you visit, \"Yelp\" your own experience!", "author": "Tre S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "I usually go for City Chopsticks when I get Chinese take-out, but I find their food to be pretty bland so I gave Elaine's Kitchen a try. I ordered: spring rolls, chicken fried rice, and Mongolian beef. \n\nThe chicken fried rice was overall awful and I wouldn't get it again. It looked like just white rice with some soy sauce and chicken added to it. I can't even confidently say it was fried. It was also exclusively chicken and rice. Usually when I order at other places I expect there to also be eggs, peas and carrots, but no luck with that here. \n\nI asked for sweet and sour sauce to go with my spring rolls (one order has four!) and was given one tiny tiny container of sauce. It was enough for one spring roll, which was both annoying and disappointing. Gotta have sweet and sour sauce with your rolls. \n\nThe saving grace of the review is their Mongolian beef. It's some of the best I've had so far in the city. They add in bell pepper and onion, and it was just the right amount of spicy with thinly sliced grilled beef. \n\nI'd be happy to order from them again to give it another chance, but stick with the meat options. It's fast, cheap, and normal huge portions of carry out Chinese food. They were also super nice, and I didn't get sick which is really all you can hope for when trying a new takeout place.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "We found this restaurant while walking around Chinatown. It's a few blocks away from the center of Chinatown, but easy/quick to walk to. The inside was clean and the staff (including Elaine herself!) were super friendly. We ordered orange chicken, shrimp chow mein, and kung pao chicken. They serve large portions and we ended up taking leftovers home. Everything was very well done and exceeded my expectations. I would definitely come back here again even if it's a little off the Chinatown grid.", "author": "Melissa A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-11", "description": "The food is shockingly bland. Shrimp chow mein, fried rice, and general tso chicken were all very disappointing\n\nWe didn't even finish our order - which is really unheard of when it comes to Chinese food for me.", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Great food (some of the best General Tao/Gao chicken in the city) friendly delivery person (our address is hard to find and they were a real trooper about it!)", "author": "Jeff D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Hands down the best Chinese food I've ever had. We visited San Francisco for a few days and dropped by here for lunch- The portions were ginormous so we dug in right away, the food was delicious, the egg fried rice was perfectly done, and the chicken chow mein hit the spot (they do not skimp on chicken!). Loved it and highly recommend anyone in the area to drop by. Very nice people too.", "author": "Karina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Where do I begin? Their food is so delicious. They don't overload their sauces with corn starch or wrap their sesame chicken in layers of dough like other Chinese restaurants, and the meat is always juicy and fresh. The portions are satisfying. Delivery is always swift and careful. And yes, they cut out the corners of takeout boxes so the food doesn't get soggy! When was the last time you received this kind of service on a $10 takeout? I can't say enough good things about them and I recommend Elaine's to absolutely everyone.", "author": "Carl W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-02", "description": "Had the veggie potstickers, veggie fried rice and crab Rangoon/puffs and everything was tasty. The veggie fried rice has plenty of broccoli and some cabbage. I'm use to peas and carrots in fried rice but their exclusion did not diminish the taste. The veggie potstickers are moist and delicious. The crab puffs were kind of chewy but not greasy.\n\nI ordered this meal from Yelp and had it delivered. It came right on time. They also included various soy and chili sauces. Definitely give them a try.", "author": "CJ C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "Solid restaurant. We enjoyed everything we got. One order each of orange chicken, general tso and crab puffs. All great items. We'd definitely go back. Very kind and efficient staff; food came out very quickly. Tasted fresh.", "author": "Erin J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-13", "description": "This review is for delivery. It took over an hour to get food delivered less than 2 miles away on a Thursday night. The chicken wings were crispy on the outside but literally flavorless. It was like eating crispy cardboard. In my order I asked for orange chicken extra spicy, and what I got was very very sweet mediocre orange chicken. Zero spice. Talking Panda Express quality. I also asked for it to be delivered to a hotel, I didn't think I needed to explicitly asked for utensils and napkins but apparently I did.", "author": "Jay E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Had the dumplings and orange chicken and was just blown away!  Super tasty and the price is fair!  Also, the staff is very friendly.  I'll definitely be coming back regularly for some late night grub!!!", "author": "Mason W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "We walked a few blocks to get here but it was worth it. Authentic food, NO MSG, and great service. Stop in when you want a great meal.", "author": "Kristina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "The food and service here is excellent. Before ordering delivery I had a few questions to ask so I called in and the lady who answered was super friendly and happy to answer all my questions before I placed the order. I ordered the garlic eggplant, veggie fried rice and vegetable rolls all so delicious and hot when it all arrived! Highly recommended!", "author": "Rita A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "I secretly love this place. I dont really like Chinese food, but because of Elaine's I sometimes crave it...love the crab cream cheese puffs.\nDon't expect michelin star food, it is what it is, a cheap and cheerful chinese place for a quick but decent meal.", "author": "E B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "Not bad but nothing to write home about either. I had the sesame chicken and General Tso chicken - both were somewhat bland. I ordered delivery and it took over an hour but I was staying at a hotel and they were good at communicating that they had arrived. $33 for the two dishes and rice.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-18", "description": "Ordered delivery from Elaine's and won't do it again:\n\nHot n sour soup - totally bland compared to other hot n sour soups I have had from other restaurants\nMongolian beef - sweet, bland and greasy\nMixed vegetables - mostly onion, bland, over cooked \nFried rice - ok but have had way better", "author": "Ian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Mongolian beef is bomb! Orange chicken is delicious and a total step up from typical orange chicken (has candied orange pieces of some sort, sooo good). Lunch specials will deliver with sweet and sour soup and fried crab puffs! Fried rice is a great staple too.", "author": "Kari M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Great place if you're in the mood for Chinese food; service was fast and food was delicious ! This was the perfect way to end our trip in the bay", "author": "Diana A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "The Mongolian beef tasted very good.  Just like the one that I ate in China.  The crab cheese puff is a new taste to me， but still very good！", "author": "Jingwen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "I just move to the North Beach and have tried several Chinese restaurants. Among them, Elaine's Kitchen is my favorite. Three times in a roll , I ordered take-outs from here: \n\nWhat I usually ordered:\n\nGeneral 's Chicken (white meat in good quality and crispy!)\n\nMongolian Beef( a little bit like grilled , sooo yummy!)\n\nEgg Fried Rice ( huge portion and delicious!)\n\nAll in all, they have the very decent dishes and reasonable prices! Highly recommended!", "author": "Suman L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Stopped here because the 4star rating and we weren't disappointed. We tried 3 dishes and shared between 2 people and it was more than enough. We only ordered that much to sample several things. The service was great and very fast. I'd recommend to anyone wanting great affordable Chinese food.", "author": "Tony W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "SOO Delicious! I ordered delivery to my house as a first time customer here. I was a little nervous trying something new because I'm kind of picky about my food-- especially Chinese food! This place was so good on every level. 1) delivery did not take too long 2) the food was freshly made (orange chicken was still hot and crispy, same with the walnut shrimp and spring roles) 3) the way everything tasted was very delicious and you can tell they don't reuse the same oil over and over again which causes a gross overly-used-oil taste to the food. Definitely reordering from here!\n\nWhat I ordered:\nOrange chicken- 5star\nWalnut shrimp- 4 star\nSpring roles- 5star\nWhite rice- 5 star (wasn't dry)\nMiso soup- 5 star", "author": "Tina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Pretty decent for take-out. Easy location, decent prices, decent portions. I'd order take-out from them again!", "author": "Marie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "I'm a food lover and Chinese food is one of my favorites, what's too appealing and important to me is the cleanses of the restaurant, I been to too many Chinese restaurants in different cities, some of them have great food but the clearness is not all there. This place is very clean, has great food and the prices are reasonable. I'm impressed.", "author": "Z H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "I always come here whenever i'm in town. Elaine's has a comfortable environment to enjoy a meal, responsive staff, the food is great, with big portions. I like the sesame chicken the best and the crab cheese as well. Highly recommended!", "author": "Kim F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "We were visiting in the marina, needed some dinner and found Elain's kitchen had great ratings. They were right !\n\nNot only was the food excellent, but the service was outstanding !  We made a little mistake on our order online and marked it as pick up instead of delivery. They called when we had come by to pick it up and delivered it graciously !\n\nThere are many places with great food. However, when they have great food, great service, and a great attitude, those are the ones we like to frequent. Thank you Elaine's kitchen for taking great care of us !", "author": "Ga K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Got a lunch special with garlic eggplant and added small soup for a $1 extra. Not too bad. Plus they give you a pretty good sized portion.", "author": "Jes Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-02", "description": "I ordered two dishes for delivery; sweet and sour chicken, orange chicken. Both of these tasted very good, especially the orange chicken. The portions are respectable too.\n\nThe pictures were misleading though. The orange chicken is shown with a side of white rice. But the actual order did not come with it which was disappointing.", "author": "Sai Teja L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "We ordered delivery while in sfo from out of town. It is some of the best Chinese food we've ever had. Ingredients were fresh and everything was cooked perfectly. Delivery was SUPER FAST- way quicker than what yelp said and the delivery guy was very friendly and appreciative. Highly recommend Elaine's.", "author": "Peter B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "Remember when Dustin Hoffman runs to the church at the end of \"The Graduate\", bangs on the window and yells, \"ELAINE!... ELAINE!\"? Well, that scene has nothing to do with this small, sparse Chinese place on Broadway amid the strip clubs and the drunken patrons. Unless you are drunk and in desperate need of Chinese food to satisfy your alcohol-derived munchies. Then, yes, you would be banging on Elaine's window to open up and give you something to devour. Jamie W. and I, however, were completely sober when we walked over here after a weekend up in Mendocino. I can't say the same about the loudish party across the room whose indecisiveness had Elaine in a bit of a tizzy. We were admiring her pluck.\n\nEven though we had In-n-Out in Santa Rosa on the way back home, we still ordered a lot of food. We started with the $4.95 Spring Rolls which we always forget are not the freshly wrapped ones but the deep-fried ones with the requisite cherry sauce (photo: http://bit.ly/1KSS8Yl). Pure Panda Express level here, but Elaine compensated by giving us a $4.95 bowl of Hot & Sour Soup free of charge (photo: http://bit.ly/1RnSLLz). This was pretty good, not quite Henry's Hunan level but it did hit the spot to counteract the grease of the rolls. Since we are planning a trip to Shanghai later this year, I had us try their $6.95 Shanghai Pork Steamed Dumplings since it seemed like a good deal given you get ten in a bamboo steamer (photo: http://bit.ly/1GqknJH). They were pretty darn tasty.\n\nThey had the squish factor down, something Jamie and I will try to replicate at our planned dumpling making lesson in Shanghai. Jamie ordered his favorite, the $7.95 General Tso's Chicken, which were prepared with chicken tenders deep-fried in a garlic sauce. The steamed broccoli florets were wholly unnecessary (photo: http://bit.ly/1FPa5Yw). I felt we needed at least one vegetable dish, but I failed and went for the $7.95 House Special Eggplant, which had plenty of sauteed eggplant but also chicken, beef pork and shrimp (photo: http://bit.ly/1QRnrnR). So frankly there wasn't anything veggie about it. Maybe I should have eaten the broccoli florets. Anyway, Elaine's was way better than our expectations given the shady location, so maybe drunken window banging is in our future.\n\nFOOD - 4 stars...bargain Chinese pretty good if you avoid the spring rolls, try the dumplings\nAMBIANCE - 3 stars...not much to it except that it's clean\nSERVICE - 3.5 stars...Elaine gets a lot of exercise coming in and out of that kitchen\nTOTAL - 4 stars...\"ELAINE!... ELAINE!\" (bang-bang-bang)", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "Pretty solid chinese food. Tasted better quality than your average takeout. I got the sesame chicken, which I was very happy with. My friend got the general tso's chicken. The chicken was good, but the broccoli was a little too salty. We also got the potstickers, which themselves were good but the sauce that came with it was unimpressive. It was sort of a sour type sauce. Hard to describe, but not what I was expecting. I ended up dipping mine in soy sauce. Also, the portions are really big (like most chinese food places). I would suggest sharing with a group or just going for lunch (they looked like they had great lunch specials/deals).", "author": "Hannah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Oh my God this place is incredible General Tso's chicken could save a life and end a war", "author": "Jerrin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "I love Elaine's! I typically order a basil fried rice, with extra basil and extra spicy. Comes out delicious every time. I wish they offered more \"healthy\" but delicious sounding options, so for now Elaine's is my go to cheat meal :)", "author": "Martha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "Ordered General Tso's chicken and it was yummy! Ordered it to-go and it was ready in 15 minutes, they cut holes in the lid to keep the meat crispy. The only reason I didn't give a 5 Star review is because I wanted medium heat (just shy of spicy) and it didn't taste like there was any heat at all. This didn't take away from the overall experience, because the sauce was flavorful. The broccoli was perfectly cooked too.", "author": "Gabby R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "Given how often I eat here, this review is severely overdue (but better late than never, right??)! Elaine's is simply the best comfort Chinese food in town, which is saying a lot since it is next door to Chinatown which presents a lot of stiff competition at dirt cheap prices. \n\nWhat sets Elaine apart from its Chinatown counterparts is the quality of the ingredients and preparation which is evident when you first sink your teeth into the food. I have never had a bad meal here and everyone I have brought here (either locally or from out of town) can attest that it is amongst the best Chinese food places they have ever had! The Crispy Sesame Chicken, General Tso's Chicken, Eggplant Special (with the various meats) and fried rice (pork is my favorite although just the plain egg fried rice is fine) are all to die for and I would eat them everyday if I could. The chow mein is also very good.\n\nThe prices are super reasonable, too, especially if you eat in the restaurant (Eat24 prices are slightly higher) and can make it for weekday lunch since they have an awesome lunch deal Monday through Friday - something to the tune of an entree, rice, hot and sour soup and a cream cheese wonton all for $6-8 depending on the entree with an option to add $1-2 to substitute white rice for fried rice or chow mein. I always leave waddling out of here or taking a small box to go for a little afternoon snack. Even if you don't make it for the lunch special, the regular portions are HUGE and you will definitely have leftovers if you order more than one item. \n\nWhat also sets Elaine's apart are the service and cleanliness of the restaurant which unfortunately leaves a lot to be desired at most Chinatown restaurants I've been to (I live in Chinatown and have made my way around the block). The staff who work here are very nice and the service is on point (your water cup will never be empty). Although I do get delivery 95% of the time, I enjoy eating at the restaurant every once in awhile to enjoy the food while it is piping hot. It's great when delivered but just a notch more delicious when it comes straight from the kitchen.\n\nTrust me when I say you will be hooked instantly after trying this place! I know I am and will be coming here for all my Chinese comfort food needs for the foreseeable future.", "author": "Jonah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "Love Elaine's kitchen both for a sit-down restaurant and delivery! The restaurant environment is family friendly and the staff is attentive and welcoming. I personally come here for the Mongolian beef because I have not found one that tastes as good as the one at Elaine's. I also love coming here for lunch because the price is so cheap and the portions are huge (it's good enough for me to save some for dinner). \n\nAs for delivery, their service is quick and the food comes in still hot and delicious. This is definitely one of my favorite spots in the city!", "author": "Therese G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-06", "description": "Delivery ONLY. Delivery was a whole hour later than indicated; total wait time was 2 hours + 15 mins. We live 0.5 miles away. SO the wait time for delivery is unreal. If they fixed this, I would order delivery more often. Also, food is 6/10 but could use some spices.", "author": "Chelsea G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-21", "description": "We ordered delivery on a Sunday night and were told it would be 30-45 mins, however, it actually took about 80 mins which was a bummer. The food itself was average for take out Chinese. We ordered beef and broccoli, lemon chicken, chicken fried rice, and chicken lo mein. The lo mein was pretty weak on flavor, and I wish the fried rice has some peas and carrots in it (just rice, chicken, egg), but for the portion size and price it sufficed. We'll order again because it's convenient, and when you have the hankering for take out Chinese it will do the job, but I wouldn't seek it out.", "author": "Kim A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-24", "description": "Clean restaurant. Good hot and sour soup. Good crab rangoons - hot and fresh. Portions were big and lunch special was cheap. \n\nUnfortunately the general Tso's chicken was really skimpy on the meat. It was kinda dry, thin, and over-fried. I would rather eat at Panda Express. The fried rice was flavorless, dry, and completely forgettable. \n\nProbably won't come back here again with all the other options around.", "author": "Catherine L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-05", "description": "i would order from elsewhere.  i certainly won't repeat.  fried rice has no seasoning; sesame chicken is sweet, no spice and has an anise aftertaste that seems weird compared to any other sesame chicken i've had.  they forgot my crab puffs so that's annoying.", "author": "Emily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "Its hard to find good Chinese delivery, but Elaine's has been out to-go for quite some time. It's not greasy or overfilling. \n\nHaving said that, I do have to say that they have strong and weak dishes. Their chow mein needs some work- no taste, just oily. Don't order this. Fried rice is great, but you need to order it with some kind of meat to give it a better taste. \n\nMy faves at this place are General Tso's and the Kong Pao chicken. Anything with broccoli is also . The dumplings are also pretty amazing (I don't get them often enough).", "author": "Clarissa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-29", "description": "Any of the breaded chicken dishes (orange, general tso's, sesame) are insanely good.  There is actually chicken, it's not 75% breading.  And the breading is so crispy and good.  Maybe one of the best general tso's I've had.  I've also had their chow mein w/ shrimp - and while it tasted very good, minus one star there b/c there were literally 4 shrimp in the entire order (all placed on top, so it looked like you were going to get a lot of shrimp throughout the dish).  Went here for lunch - stopped in and placed a take out order and it was ready super fast.  Would def come back!", "author": "Allie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-02", "description": "Shrimp fried rice has a couple of shrimp in it. But the rice was absolutely blend and tasteless. Sesame chicken doesn't come with rice. Big portion but it was very burnt. Tasted like a rusty skillet. Not ordering from them again.", "author": "Maya K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "The food tastes fresh and delivered in about 20 minutes!!  This will definitely be a new go to for a quick and tasty bite.  Portions are great... we had leftovers for lunch the next day!", "author": "Makina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "Just ordered delivery. Stuck to basics. Hot and Sour Soup. Very good. Combo Fried Rice delicious. Crab Puffs very good. All ingredients were fresh. Very pleased. Food arrived hot and well ahead of schedule. Condiments and utensils provided. Will definitely order from Elaine s again.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "This place is pretty good.  I appreciate the low order minimum for free delivery.  It took about an hour to arrive all the way in Potrero Hill which was exactly the estimate so I was happy.  I got the Hunan Beef which I thought was a little mushy but it wasn't bad at all.  I'd probably order something else next time, maybe the Sesame Chicken since so many reviewers recommend that.  The hot and sour soup was solid and the delivery guy was friendly.", "author": "george c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-31", "description": "Try this place for the first time after seeing the reviews here. I must say this place is perfect. Customer service is great and they were on top of things. Also this place is clean compared to other Chinese restaurants. We tried a few items on the menu and was delicious, specially the Waton soup.", "author": "Mr.Food E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Stopped here when looking for a Chinese restaurant, and it didn't let us down as other Chinese food around Chinatown. \n\nWe ordered Crab Cheese Puffs for starter , Mongolian Beef and Shrimp with Mixed Vegetables for entrees. \n\nThe food was decent and the price reasonable! Will be back again!", "author": "Zexian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "Good food and much more than I expected at a great price. Gave me a feel for the shops from back when I spent time in China. Would definitely recommend.", "author": "Marshall J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "We ordered delivery through yelp, and we really enjoyed our food. Most of the main dishes are between $8 and $13 and the portions are sizable. We ordered without rice and steamed some of our own at home, but I found that the rice was overkill in terms of total amount of food. \n\nThe man who delivered our food was prompt and friendly, greeting me with a big smile.\n\nOur only complaint was that we chose the \"spicy\" option (on a no-spice to extra-spicy scale) for Mongolian Beef, and it wasn't spicy at all. I'm not sure whether this was a mistake in the order or whether the dish is just generally less spicy than other dishes ordered at that level. My General Tso's Chicken was great at the spicy level, although I may step it up to extra spicy next time we order from here!", "author": "Olivia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-05", "description": "Just ordered Eat24 delivery from them for a work lunch. Prompt delivery (they were early) but they did forgot one of my items. They said they would come back with the missing item and they did...and gave me some cash back for the trouble. \n\nGreat customer service on the restaurant's part and the food was tasty too. Lunch portion was generous - leaving enough for a second meal.\n\nWould order from again.", "author": "Carolyn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "This place was great! Went for lunch last week and the food was so fresh and hot! Orange chicken and sesame chicken was delicious! The lunch portions are HUGE and I felt like it was such a good deal for 7$! Also the cream cheese wontons we got as our appetizer were delicious!!!", "author": "Katie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-26", "description": "We picked it for delivery based on its high rating and although it was standard, it wasn't great. \nThe pot stickers were good, as were the spring rolls. The pot stickers would have benefited from a specific pot sticker sauce, rather than normal soy sauce. \nThe green beans were very spicy although I asked for mild. \nThe walnut prawns were the most disappointing. Very obviously fried and the sauce was greasy. \nDelivery was fast and good.", "author": "Monika R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "Food and wise this is a 4 star place, the food is delicious that I always finish everything I order and I mean clean the plate! Reason I don't give it 5 is that just like any other restaurants there where a few not so good dishes..and it can be a little bit on the greasy side, but that's what makes it great too!\n\nThis isn't your fine dinning so don't expect that, but expect quality taste! I been going here at least once a week since I started working in SF!", "author": "Alan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "Woah woah woah woah. Woah. San Fran has flame Chinese food? Indeed, this is the case. Elaine's Kitchen is some of the best Ive had. Even better than home.\n\nI ordered delivery through yelp to the marriott. Yelp ordering rocks. It arrived in less time than it was anticipated. It arrived fresh and hot. \n\nThe hot and sour soup was good. Just enough spice. \n\nThe spring rolls were crispy and the dipping sauce was yummy.\n\nThe shrimp fried rice. Wow. This was my favorite by far. HUGE shrimp, just enough soy sauce as to not completely destroy the rice. No grease mess at the bottom of the container. \n\nDelicious, fresh Chinese in San Fran. Quick delivery.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-02", "description": "I ordered 3 lunch dishes and they were all excellent. Large portions for the price. Sesame chicken was perfect - good quality meat and still crispy even though it took over an hour to arrive (because I ordered at noon). However two of the three plastic clamshell boxes they came in cracked and sauce leaked everywhere, so can't give it the 5 stars the food deserved.", "author": "Niki P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Hands down favorite Chinese in the city. If it's a busy night might take a little bit, but worth the wait! I know Chinese can sometimes be a little sketchy and you want to make sure you're getting clean meat and I would definitely recommend Elaine's! :)", "author": "Manda P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Ordered house fried rice, mongolian beef, sesame chicken, and hot/sour soup.  All the dishes tasted good.  They were able to deliver to our hotel room within 30 min and didn't charge for delivery.  The lady on the phone was very nice as was the delivery person.  Very satisfied with our experience and would definitely order again.\n\nedit:  for the mentally challenged, they cut open the sides of the delivery container to let the steam out- not because of broken containers...", "author": "JP C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-31", "description": "I first ordered from here about 3 months ago and the food was great. Sesame chicken was tasty and flavorful, sweet and sour chicken had a great sauce and I was extremely happy to have found my new Chinese food place. The quality has gone down steadily since then and the same meals I ordered the first time are now almost inedible. Last nights offerings were plain awful, the chicken was hard, heavily coated in flour and covered with thick, gluey, flavorless sauce. A shame, and the last time I waste my hard earned cash on them. My search continues for a CONSISTENTLY good Chinese restaurant.", "author": "terence r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "Elaine's really hits the spot.  Yummy (greasy), yummy, greasy, yummy, fried, Chinese food.  Their General Tso's and Sesame Chicken is fantastic and the egg fried rice goes well with.  Just space these out a couple months so it doesn't kill you.  They also have a delicious eggplant that includes shrimp and a whole bunch of meats all in one.  (mmmm)\n\nReally good service and polite delivery folks too.  This is for when I need a little comfort.", "author": "Praneeth W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-09", "description": "Coming from Jackson and going up Broadway, be aware that this is uphill. It was so much easier going back down with food in your hand ready to eat. Thank goodness this restaurant accepts credit cards because most Asian restaurants don't.\n\nAnyway, I ordered the lemon chicken lunch special here with fried rice and soup. This place was not heated, by the way. The door was open and it was January. Very chilly inside. The wait was ridiculously long as well. I waited about 15 minutes for my order.\n\nBack to the food, the lemon chicken was amazing! It wasn't undercooked and it wasn't too crunchy. It was perfect cooking. The fried rice was flavorful as well. Just sprinkle some soy sauce over it tasted great. The soup, however, was all right. I didn't expect much but it was decent.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-14", "description": "Ordered delivery and would say this is subpar Chinese unfortunately. Order the Chicken Chowmein, hot and sour soup and General Tso's Chicken...ended up throwing most of it away because it just tasted re-heated.", "author": "Brett W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-28", "description": "Don't order from here. A 10% tip was added to my order without my consent. Wouldn't have been that big a deal if the food itself wasn't awful.\n\nOily food with low quality meat and dry mealy breading on fried items. By far the worst delivery experience I've had in SF.", "author": "Loren A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Great Chinese food! Delivery was earlier than expected! The Crab Cheese puff was the best I've ever had, the Sesame Chicken was so delicious, the Mongolian beef was perfect. I highly recommend this place!", "author": "Xiujin Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "We order delivery from here a fair amount. General tso's, beef and broccoli, wor wonton soup and house special eggplant are reoccurring. Tasty, reasonable, good as leftovers.", "author": "Evan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Nice little spot. Very casual, cozy and welcoming. The food here is super tasty. Ever since I moved to the area, this is my go-to when I'm craving Chinese food which is at least once a week. I usually go in but have gotten delivery a few times as well. Either way, the service is great. The shrimp chow mein is so yummy. The shrimp are always cooked perfectly. I also can't stop by without getting an order of the Shanghai pork steamed dumplings along with the spring rolls. I highly recommend this place. Go in and try something. You'll like it!", "author": "Anais B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "I travelled from New York and I really want to try some traditional Chinese Food here. I ordered some food and picked up there. It's fast and clean enough. \nThe food:\nkung pao chicken dinner combo (comes with egg roll) - it was delicious\negg drop soup - also delicious\nshrimp lo mein - lo mein was good, shrimp was so-so\npork fried rice - delicious\nszechuan spicy wontons - not good, they were sweet and not so spicy\ntriple crown (tender white meat chicken, beef & jumbo shrimps blended with seasonal chinese vegetables. it is given personality by a brown sauce for epicures only) - not to shabby, but not as delicious as expected\n\nI would totally order from them again. Great portions at great prices too.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-22", "description": "Ordered from here for about three years because delivery was fast, food is mediocre. Watch out for dumplings.\nTonight driver sat outside my doorman, high rise building for 15 minutes before he realized he should approach the guy doorman and ask to come up. Food was ice cold and order was wrong. Husband called and woman answering the phone not interested in \"our problem\"   \nLast time here.", "author": "Mary O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-26", "description": "Ok my husband ordered tonight and we have never ordered from here before.\nUnfortunately, all the food was substandard. Specifically the wonton soup was watery and lacked flavor with mystery meat inside. My garlic broccoli had no garlic and the other 2 dishes were greasy with no flavor, a gungpow chicken and something with chicken and eggplant? It was $65 dollars worth of food and no fortune cookies or rice included. Save your money or just order from somewhere else. Sorry but one star for arriving on time.", "author": "Tara L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-11", "description": "The food arrived hot but was the worst Chinese food I have ever had.  Ordered through eat24, rice, sesame chicken and vegetable delight.\n\nDelivery arrived on time and driver was friendly.\n\nThe sesame chicken came with all white meat but over half of the \"chicken\" was just large fried pieces of batter in a sauce that was sickeningly sweet sauce with no flavor besides sugar.\n\nThe vegetables were actually perfectly cooked but the sauce, again, extremely sweet!  The vegetables were cooked in what tasted like thinned out oyster sauce with sugar added. \n\nFood was so gross that I actually ended up tossing it after combing through the batter for the slivers of meat that I ate along with the white rice (rice was fine).\n\nThe Yelp rating fooled me on this place, 4 out of 5?  No way unless I caught them on a really off night or people that eat here like really sugary Chinese food (and this is sugary by Americanized Chinese food standards, Panda Express has three Michelin stars compared to this place!).", "author": "Mailah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "Just ordered via Yelp/Eat24 and immediately after I ordered, I got a call from Elaine's asking me if I meant to order rice, as the entrees don't come with it. I didn't want to add on rice but I greatly appreciated the call and service! \n\nFood came quickly and was still nice and warm. And delicious, and spicy just like I wanted. Lots of flavor and didn't taste greasy or oily at all!", "author": "Sam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Elaine's is my favorite local Chinese take out restaurant to date! It also helps that they deliver so so quickly once you place the order--I've never waited more than 20 minutes once I call. We typically order every other weekend and definitely have our favorite entrees. The sesame chicken and broccoli with beef are probably the best meat entrees. However their chow Leon and rice options are great as well. I love that you can get shrimp, pork and chicken in the fried rice at no extra charge! Note that when you order a meat entree it does not come with a side of rice so you do have to order that separately. If you're looking for some appetizers to share I recommend the crab cream cheese puffs or the pork dumplings which we tend to alternate depending on the mood we're in. Bottom line you cannot go wrong here, check them out next time you're in the North Beach area!", "author": "Elise M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-07", "description": "We ordered takeout from Elaine's a few nights ago. The food was decent- the portion size was great, and I'm pretty sure they don't use MSG. The only thing is that we ordered it to be spicy, but we found that the food was not super flavorful, and it lacked salt. Kind of a bummer that we had to re-season the food once we got home with it, but overall pretty good. I might try another place next time for Chinese food because of that.", "author": "Priya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "Great little Chinese joint. Nice lunch special. Quick friendly service. Definitely recommended.", "author": "Chris N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "I frequent this spot every know and then for lunch when I'm in the area. The staff is always polite and helpful. The food is always good and quick.  Overall, the food is solid and I would definitely return.", "author": "Dee S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-17", "description": "Dont get me wrong, the food was hot and delicious. It was sooooo loaded with MSG. Not a good idea to eat here if you have a sensitive tummy.", "author": "Sean H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "My favorite Chinese restaurant in SF. I love the spicy basil chicken here so much and the price is really cheap. By the way，I love the free soup （I don't know the name）and dumplings as well.", "author": "Siqi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "Love their lunch meal. Would recommend them. Good amount of portion of food. Love their soup and wonton. I was quickly sat down and served right away. The food came out within 5-7 mins.", "author": "Tuong Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-19", "description": "Misled by rating and reviews.  Inedible. Maybe not super greasy is about all u can say.  Horrible flavor.  Chow mein old rubbery noodles with a few slices of onion tossed in when they warmed it up for my meal. Super bummed.", "author": "Angie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "Ordered some late night Chinese delivery from here and it was delicious. I got the vegetarian chow mein, mo pao tofu, and mixed vegetable dishes with white rice. The food was delivered in a timely manner, it was still hot, and it really hit the spot. Definitely will do this again.\n\nI also randomly got 2 lemons that looked like they were picked from someone's backyard put into my delivery bag. Not sure where those came from and why...", "author": "Lindsay L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-17", "description": "Ordered delivery. Quoted 45-60 min. Took 1.5 hours after we followed up multiple times. Ordered dumplings (arrived very cold) and chicken cashew (arrived without rice). Decent flavor but horrible delivery service.", "author": "Morgan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-02", "description": "Did a home delivery. Food was ok. I have eaten better Chinese food. Good value for money though. They sent free soup with my order. If I could I would have given half a star more for it.", "author": "Vidya K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Elaine's Kitchen is delicious. I started coming here through meal pal and ever since I always choose them whenever they have vegetarian options. They give good portion sizes. The food is always great. It is a nice cozy restaurant. I highly recommend it!", "author": "Gabriel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "Dang this place has some awesome Chinese food! It's a small place tucked between other business a block from naked lunch. I came here with a friend for a late dinner and we really enjoyed our experience. I have never received so much food for so little money. Everything was super tasty!", "author": "Greg B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-10", "description": "Ordered delivery which arrived early -- great! -- but lukewarm with some pieces being cold -- not so great :(\n\nEntrees do not come with rice and you are not prompted to add it when you order. That's a showstopper for me. I've ordered plenty of Chinese food and never not had rice accompany my meal or at least been asked if I wanted to include it. But beyond all this the food itself was average. I'm perplexed at the 4-star rating; I've honestly had better at Pei Wei(PF Chang).", "author": "Destiny B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-05", "description": "Free Delivery via EAT24, minimum $15. F*ck yeah I'm ordering my lunch here. There are days when you forgot to bring lunch bc you're just so busy and hardly noticing the sun outside. You just want to eat at your desk and keep plowing til your brain says \"2 + 5 = 8\" but MS excel says \"No, dumba$$!\" You wanna play hard but want to save that shat for Friday night. So, you live like the cheapskate mole you are and order at Elaine's bc the money you'll save to nourish yourself today will be allotted to Advil and Pedialyte expenditures come Saturday morning.", "author": "Sheila C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "I really like this place. We always order for delivery and they are really nice while taking the order. They also deliver in a reasonable time. This is now our go-to for Chinese delivery.", "author": "Flor C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-09", "description": "Had to attend a business meeting across the street, saw this place was open & got excited as I've been craving Chinese for awhile. We got the house chow mein, egg rolls, & sesame chicken. Everything was tasteful. The service was friendly, also fast. Needed to write a review to share how amazing the sesame chicken taste! Every bite had a perfect crunch to it, the sauce is indescribable. Must try.\n\n\nTLDR; everything was good, the sesame chicken was outstanding!", "author": "Harvest H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-13", "description": "Both Broccoli Beef and Fried rice had old taste.  The meat used in the fried rice had a horrible taste.   Pushed it away.", "author": "Rosa Olivia R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-11", "description": "Please instruct your cooks the difference between cumin seed and caraway seed when making Cumin Beef. Pork fried rice is good though.", "author": "Louise J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Best takeaway Chinese I've had! It only took them 35 minutes and they were calling me from the hotel lobby. We had sesame chicken and rice, spring rolls and crab app! All great!", "author": "Pamela M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "I love this restaurant. My friends invited me to the restaurant yesterday. It is soooooo good. I tried the Mongolian beef and Mapo tofu both of them are very delicious.", "author": "Ellen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "One of my coworkers recommended Elaine's Kitchen several times, I finally decided to give it a try. I came here yesterday,  I ordered one String Bean Chicken and one steamed white rice. It took me only $11.40. The food was awesome , the waitress was friendly and attractive. The ambience was nice! A bit of American Style,  anyway I love it!", "author": "Kelsy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-11", "description": "Absolutely the worst ever Chinese delivery food. Arrived cold with 2 moldy oranges included. Food tasted rancid and slimy. I feel ill ! We threw the food away after a couple bites. $40 down the drain literally.\n\nNow I get 2 calls from the restaurant within an hour of receiving the food and writing this review,  offering me a free dinner ....are you kidding me ? Then another call offering to give me my money back if I delete my review. \nDisgusting food and shocked Yelpers give it 4 stars....but after reading more reviews I see I am not alone. Others were equally disappointed and sickened. A", "author": "Mickey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "This place is solid, especially for delivery.  The reason why the plastic tops are cut out is because they don't want the steam to soften whatever is fried inside.\n\nEverything is pretty decent, and they deliver at a late-ish hour.", "author": "Isa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-23", "description": "Small and clean Chinese food joint not quite in the heart of Chinatown but fairly close. I love Chinese food in the sense that I basically love general tso's chicken, orange chicken, and/or sweet and sour chicken. I found this general tso's chicken to be delicious - just the right amount of sauce and crunch. Rice is extra but they give you healthy portions - overall 2 entrees, rice, and a drink 30 bucks with tip.", "author": "Julia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "This is the smallest Chinese restaurant I have ever been in and the best. The food was great and service was just as good and friendly. We'll be back soon.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "Ordered takeout from Elaine's Kitchen tonight and I gotta say I was pretty happy with the results. I wanted something quick, walking distance from my office on Montgomery, and not crazy-expensive. As Elaine's seemed to meet all my basic requirements I pulled up their menu on Grubhub and gave them a shot.\n\nClearly, this place's bread & butter is takeout / delivery. When I rolled in I was amazed to see absolutely no one in the restaurant - literally, not a soul - yet no less than a half dozen orders waiting to be picked up or else set out for delivery. Fascinating.\n\nAnd I must say, they do what they do and they do it pretty well. Getting the General Tso's was definitely a good move. As I'm the farthest thing of being a hard core fan of Asian Cuisine, I usually go with the General because you can always count on it being relatively filling and not overly complicated - at least when compared to other Chinese dishes. The pork fried rice I had was a little dry - but still generally to my liking - so I can't complain. \n\nAll in all a very positive and seamless experience. Will definitely be adding these guys to the list of places I have on speed-dial for late nights during the week.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-15", "description": "Ordered delivery here. It was promised between 45-60 minutes but came after 90 minutes and was cold. Despite being cold, the general tso's chicken was decent. The dumplings and chow mein however were very bland. Would not order from here again.", "author": "Dave R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "I have ordered here before and was satisfied with everything....However, this last time I ordered for delivery, I ordered and paid for it online, waited in the lobby of my building for the food so I wouldn't miss them and while sitting there received an email saying that my food had been delivered. I notified Yelp, they contacted the restaurant on my behalf and the delivery driver apparently was now heading home.  Long story short the delivery driver either said \"fuck it\" or you tried to rip me off. Either way, I won't be ordering from here ever again.", "author": "Kody H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "The food here is delicious! I was in town about a week ago visiting friends, happened to come across this place and am so glad I did. I initially came in for a quick bite but ended up ordering a bunch of stuff including the lemon chicken, pot stickers, hot and sour soup and the broccoli beef. The food is super affordable so why not, right? Anyway, everything was great, but the lemon chicken as well as the beef were my favorites. I even ended up getting food delivered two days later. Fast delivery btw. I'll be back.", "author": "Tatiana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Ordered from Seamless on a night when R was working late and I was desperate for Chinese fast food. Elaine's Kitchen! Calling out to me by name!\n\nAfter a quick scan of reviews and pictures, I ordered the shrimp with vegetables and stir-fried green beans with onions. The delivery came sooner than expected, and the food was pretty decent for Chinese takeout. Shrimp tasted fresh, were large, and not too salty. Vegetables in the shrimp dish were not overcooked, and reasonably seasoned. The green beans were a little overcooked, but there was a good quantity of it. Overall, pretty good for a night in of takeout and TV.", "author": "Elaine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "I love this place! I have only tried the delivery and they are really fast (within 45 minutes). \n\nI love the honey walnut chicken and the shrimp! \n\nThe chow mein and the fried rice is always great. \n\nAlso tried the crab and cheese wontons - yum!!!", "author": "Brittany G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Pretty decent place for vegetarian chinese delivery.\nOrdered the egg rolls, ma po tofu, and fried rice. Portion sizes were fairly large. It was a bit greasy but pretty delicious. Will order again!", "author": "Aditya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Went to San Francisco to help my son move into the Tower 737.  We were so hungry after the move we ordered in from Elaine's Kitchen.  The delivery person was fast and polite.  The food OMG, the food was delicious!\nThe Broccoli Beef was the best I've ever had.  The beef was fresh and had a hint of BBQ.  The Orange Chicken was not soggy at all!  It was just the right crispiness and the orange sauce was delicious.   The rest of the meal was fried rice and chow-mien which was fantastic.   \nIf you ever get a chance to get to Elaine's Kitchen in San Francisco you will not regret it!  Happy eating to you!", "author": "Kristy W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-17", "description": "HOLY !@#$% \n\nNever been more let down by yelpers on a recommendation.\n\nThis place seems to be remodeled or new owner not sure, but use to be called Green Garden which didn't have a 4 star overall rating.\n\nThis might be the most disgusting 'chinese food' I've had in the city.\n\nOrdered a chicken dish and beef chow mein.\n\nThe chicken upon first bite, that immediate taste of low quality or rotten chicken has entered your body.\n\nI was starving so I tried eating a few more bites but then I decided it just wasn't worth the food poisoning.\n\nThe beef chowmein? ahhhhhhhhhhhhhh\n\nI dont even order chowmein anymore, but I was feeling nostalgic.\n\nIt was literally spaghetti noodles, with no sort of seasoning or anything, topped with \"beef\" that looked like the rubber food restaurants leave out for demonstration. It literally had gray spots and a glossy rubber texture. That I could not even have a bite of.\n\nMy cat, who is always hungry and tries to sneak a bite of my food did not flinch.\n\nFor the first time after many many orders I tried getting my money back from EAT24, but their customer service kept breaking up. I gave up, but my friend, if you are about to order from 'Elaines' for the first time, at least I would feel better if I saved someone else from this poor excuse for \"food\". I have no idea how this place has a 4 overall star rating, they say the first 15 or so reviews of a business are 5 star automatically cuz of family. \n\nElaine must have a huge family!", "author": "Belito L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "Came into this restaurant was an unexpected discovery.\nIt's clean and tidy, not as the usual Chinese restaurant.\nAlso the food is tasty, though it's the American flavor, but really worth to try!", "author": "Jason Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "I order from here frequently and it is consistently excellent. Favorites are house special eggplant, general tso's chicken and dried tofu with beef. Don't think I could survive in SF without Elaine's! \n\nUsually order two dishes w 2 orders of rice (for 2) and devour it w half an order of rice leftover. They usually throw in two oranges for dessert- the perfect meal!", "author": "Lynne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-28", "description": "-standard chinese restaurant\n-nothing will blow you away, but will satisfy you\n-quick delivery", "author": "Derrick W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-06", "description": "Fried rice was not what we expected.  Seemed like steamed rice with peas and eggs. The house eggplant was flavorful. The orange chicken was decent but seemed like it was sitting for a while. It was a late night order.", "author": "Sheilina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Amazing food. There must be two different cooks at this place because the last time I ordered it was just ok, I didn't plan to re-order.  But this time it was freaking AMAZING.  Best Fried Rice I've ever had, super crisp and fresh chicken and the Walnut Shrimp....I ordered on a whim wishing it didn't have walnuts, but I couldn't have been more wrong, such a perfect combo.\n\nBest Chinese I've ever had with second cook, just middle of the rode with the first one", "author": "Brian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-26", "description": "I made the mistake of ordering from here again despite my last review. I didn't realized until it arrived that it was the same place I just was ordering blindly ... completely my fault. The food arrived, much better than the last time to be honest. Though despite my forgetfulness of my cash tip, which I am able to add after the fact via eat24.com the delivery driver added it HIMSELF WITHOUT MY PERMISSION. Are you freaking kidding me? What a joke and embarrassment to this completely unprofessional disgusting excuse for a restaurant. It was only a 2$ tip, which I'm more than happy to provide ... AT MY DISCRETION. My fault for giving this place a second chance.", "author": "J A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-24", "description": "BE CAREFUL WHEN ORDERING DELIVERY, DRIVER IS A BOLD FACE LIAR \nI Placed a delivery order\nI provided instructions to call when downstairs BC MY DOOR BUZZER IS BROKEN\nan hour passes and my food isn't here yet\nI called and asked for eta, they said he was there but no one answered the door so he left. After asking to call when arrived and him not doing so, I told them I didn't want the food anymore, but they kept saying, \"oh he'll come back,\" but I said no I don't want the food anymore. the chicken is more than likely cold and unsafe to eat. I Ordered new food from a Resturant close by. I got a call saying \"I'm here with your food\" I respond \" are you with THAI CHI or ELAINE'S KITCHEN? \" the guy said \"YES THAI CHI\" \nAS IT TURNS OUT HE WAS IN FACT THE DRIVERER FROM ELAINES AND HE GAVE ME THE COLDEST FOOD I HAVE EVER HAD. \nI CALLED BACK INSTANTLY TELLING THEM WHAT HAD JUST HAPPENED. WHATS FUNNY IS THEY KEPT SAYING SORRY SO SORRY MISUNDERSTANDING YEAH RIGHT! I spoke to the driver on the phone at the Resturant he quoted me that he would be back in my area in 15 min \nI set a timer for 15 min wait 30 still no show of the driver \nAbout an hour later (30 mins before they close) I called back to tell them that they close  in 30 min and if the driver is on his way \nThe driver called me and told me he has lots of orders and 15 min is hard to do\nI responded saying \"15 min is the time frame you gave me so expected my money then, when can I expect my money?\" He said \"20 min \" Finally he decides to show up \nTHANKS ELAINES FOR RUINING MY NIGHT I SPENT MORE THAN 3 hours FUSTRATED AND UPSET AND BY THE TIME THE STUPID DRIVER SHOWED UP WITH NY MONEY EVERY RESTURANT WAS CLOSED", "author": "yoo s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "I almost never write a review, but I was just so pleasantly surprised at what a good experience we had with Elaine's kitchen. My SO and I just spent the entire day moving to SF and finally finished trekking back and forth from the east bay exhausted and hungry. I ordered from the bridge anticipating an hour wait but they were so fast they almost beat us. The food was delicious and there was more than enough for us both with one entree and chow mein. Definitely has become our go to Chinese food for the rest of our time here", "author": "Krystal Lauren S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-07", "description": "Wanted something Asian so I went to a nearby Chinese restaurant in Broadway. I was with 4 friends, we ordered many dishes. Here's my rank:\n\n1. Salmon Fried Rice : definitely recommended!!!! Super good fried rice, and had many salmon chunks with it. Comes with a large portion\n2. Kung Pao Chicken: chicken was well cooked, seasoned well, although I kinda wished for more chicken chunks, there were so many cucumber :p\n3. Mongolian Beef: super recommended!!! Tasted perfect and tender and it smelled sooooo good\n4. Spring Rolls: standard appetizers, tasted good though although it was too oily for me. The best part was they were served hot, fresh out of the frying pan I guess\n\nOverall the service was good and fast, food was OK. Definitely will come back for the Salmon Fried Rice!!", "author": "Annisa J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-30", "description": "So the girlfriend and I were feeling lazy so we didn't go out for dinner and instead decided to order in for dinner. \n\n We both are fans of Chinese food and after seeing the positive reviews on here we ordered two standard dishes. Orange chicken and General's chicken. Both are similar dishes and probably only differ with the sauce.  With that said it was all breading and what little chicken there was was super dry. Neither one of us finished half of our order. \n\nVery disappointed", "author": "Richard P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-22", "description": "Go to randy ho. Not worth the time to write a review. Delivery cold and slow. Food orders messed up. What else do you need to know?!", "author": "Tom O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "Great Chinese street food.\nBig portions.\nDelivery was fast and efficient. Food was hot and fresh.\nIt's a go.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "Equivalent to Tai Chi or Country Sky if you've lived in other nearby neighborhoods.  Nice consistent food.  Chow mein tends to be a little bland (like they boiled everything with the noodles.)  \n\nSesame chicken is as good as Yan's.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "We ordered this food to be delivered to our hotel.  The food was yummy. They packed extra plates, utensils & napkins--super kind!!\n\nThey made a special soft tofu & broccoli dish for us--the kids loved every bite!", "author": "Miss L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-30", "description": "@Geoff G. - this one is written just for you!\n\nMeant to try this place for quite a while, small family run Chinese restaurant on Broadway strip...the menu was quite interesting from potstickers to double cheeseburgers!  Maybe that's why we never tried...  Fast forward, ownership & name changed - pics of food look decent, short walk from home & we were hungry made it the perfect choice.  \n\nStill settling in w/ artwork to be hung.  Interior looks new - flooring to paint...clean but sparse.  Waitress friendly with favorite words \"you bet!\" to most requests: do you have chopsticks?  May I have a glass if water...\n\nOne laminated double sided menu - half of one page is lunch specials.  \n\nWe had:\nSteamed Shanghai dumplings - $6.95 - you get 10 in a bamboo basket.  Ok but pretty sure it's the frozen ones from 'Ga Ga' you can find in Asian markets as I used to make them for my dad\n\nWor wonton - $6.95 - this is combo wonton - napa cabbage, beef, chicken, shrimp, BBQ pork, carrot.  Fail - tasteless.  \n\nHouse special chow mein - $6.95 - I had my heart set on noodles...shortly after we placed the order, waitress came back to say \"we are out if noodles!  How about fried rice?\"  \"umm, no.  What do you mean you are out if noodles?!?  Do you have fun 'fat rice noodle' or rice noodle 'thin ones'.\"  \"No, we are busy w/ a lot of take out orders!\"  Just when my blood is boiling, she returned to say \"the chef will be able to take care of you\".  That he did - noodle was great, best dish & one we will likely order for delivery.\n\n20% off during Grand Opening so great deal! \n\nSaraicha is the only hot sauce.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-13", "description": "I would give 3.5 if they offered that. I'm going to list why because I'm hungry:\n\n1. Walnut shrimp had too much sugar but if I could tell under the sweetness it was good shrimp.\n2. Noodles were soft as heck \n3. Too much cabbage in the chow mein\n4. Fast delivery, they were 30m earlier than the estimate", "author": "Chessie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "Pretty good. The General Tso's Chicken was very tasty. Didn't really care for the beef and broccoli, but that's just my taste. There wasn't anything wrong with it. The crab puffs (rangoons) were amazing. My least favorite part was that I waited an hour and a half to even get my food. You guys are walking distance from here! C'mon!", "author": "Cassandra C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-09", "description": "The Wor Wonton soup was fantastic, and I loved that I got a free orange with my delivery.\n\nThe House Special Eggplant and Spicy Fried Rice were incredibly disappointing though. I ordered both \"very spicy,\" and I wouldn't even consider either to be mild spicy. I don't even think there were any hot spices at all. The rice was also almost burnt.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "This place has the best Chinese food I have had in a while. I ordered delivery. I ordered potstickers, steamed rice, kung pao chicken, and hot and sour soup. The food was at my door in less then an hour. Everything was so good!!! Perfectly spicy, and perfectly flavored. The Hot and Sour was some of the best I have ever had. I loved the broth, and I really liked that they left out the black mushrooms. Normally I have to eat around them, as I don't like them, but that is just my personal opinion. I will be ordering again this week most definitely!", "author": "Kelli N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Had the Mongolian Lunch special. The beef was good quality and it was prepared well. This is a solid choice for reliable Chinese American fare.", "author": "F K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-30", "description": "Oh Yelp, how often you disappoint. \n\nTons of shrimp in the shrimp w/ mixed vegetables dish. Too bad they were unappetizingly mushy and gooey. Hot and sour soup was more sour than I've ever had. And that's my go-to app... Ate two bites not wanting to waste a large order, but finally threw it out. \n\nWanted to like this place because it's a block from my office but pass.", "author": "Alyssa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "I ordered this place hungover after an eventful New Years Eve. I got the sesame chicken, spicy fried rice and spring rolls. When it arrived it was all very hot, but I found the chicken with holes in the lid and the sauce on the side. So I was a bit annoyed I had to do it myself, but I'm assuming the purpose was to keep the chicken crispy which is fine. \n\nThe food quality was pretty good. Not greasy at all which is what I read was an issue. The only issue I have is it was delivery and the guy made me come all the way down to the street in the cold to pick up my order after I tipped 30%. Other than that, it was a good choice.", "author": "D O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-30", "description": "Stopped in for lunch to go after the lines at nearby food trucks were too long. Worried, because the place was nearly empty, but I will definitely be back!\n\nFresh, not greasy, Chinese food - super cheap ($6 for lunch) & served fast & hot. Very impressed.", "author": "K S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "A great find! Stumbled upon this spot thanks to yelp. Food was delicious and fast and service was friendly. Prices are very reasonable-especially for the city!", "author": "Whitney S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-08", "description": "I ordered the chicken wings and fried fish and it's beyond greasy. The only thing I taste is grease. You can tell the grease they used hasn't been changed for awhile. I tried this place because of the reviews. I'm assuming Maybe the other dishes are better. I didn't enjoy my food", "author": "Crystal M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "Excellent Chinese food at a good price. I've only done take-out, and it's always on time for pick up.  Each dish is $8-10 and, although I've only tried the veggie dishes (and everything has been great), my meat-eating friends say that it's \"delicious.\"  General Tso's chicken gets a solid high five every time they go, and I really like their garlic broccoli.  The food isn't overly seasoned or oily.  \n\nThe place is always empty so I'm guessing that delivery is the bulk of their business.", "author": "Naomi P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "This is an Authentic Chinese food restaurant with very limited wait time. Two thumbs up for an awesome delivery experience! From sitting down to get our first dish is within 5-10 mins. We went there around 5:30 to avoid the line.\n\nSeating is relatively spacious, everyone is very happy in the restaurant. This place is fabulous. The environment is cozy and comfortable. The staff are very friendly and helpful. I visited here last Saturday along with my wife and two of my friends. We ordered the Crispy Sesame Chicken with house fried rice on the side and the dry sautéed string beans. The flavour, presentation and texture was all 10/10. If you want to try some tasty Chinese dishes, this is a great place to hit.\nMesmerized by the taste my wife wanted to try some more and so we ordered spicy basil chicken and dried tofu chicken. Spice was right on the medium spice order of spicy basil chicken and the dried tofu chicken was perfectly savoury. \nThe food was served hot and perfect. The staffs were really honest, admirable and professional. LET ME TELL YOU: my wife forgot her wallet under the table (it had slipped out of her purse). 2 hours after leaving the restaurant, she noticed it was gone and remembered the last place she had it. We called them, they said they had it - and they did. NOTHING was missing from it: she had plenty of cash & cards inside that could've been taken with no accountability. But no, they had it waiting for her.\nDefinitely loved the way they are and so, I thought of ordering them for home delivery. This was the first time that I've ever eaten Chinese take-out. Yes you read that correctly...I've had my fair share of Chinese food in my day (both good and bad) but, my family never gets it as take-out. So I was a little skeptical about how well Chinese food tastes when its been delivered.\n\nWe ordered a variety of items (they have literally like a hundred menu items to choose from) and the portion sizes were pretty big. I would highly recommend ordering the Shanghai Pork Steamed Dumplings, mongolian beef, and potstickers.\n\nI'd definitely order take-out from them again, and I would recommend it as long as you are careful about what you order! Check out the lunch specials for a great deal!\n\nOverall, I loved this placed on all my encounters with them. Definitely a place to visit again and again.", "author": "Matin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "Very quick delivery, kind service, and delicious food! Visiting from NC and choose this restaurant for Chinese.", "author": "Lila C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-25", "description": "This place recently opened within the past few months, and I think they have room for improvement, but the food and service are decent. I ordered mapo tofu ($6.95) and steamed white rice ($1.50). The mapo tofu has lots of diced garlic chunks, carrots, and peas... not my favorite combination of ingredients in mapo tofu, but I liked its level of spiciness.\n\nThey also had a special where you can get a free order of hot and sour soup or crab cheese puffs, so I got the hot and sour soup. It was good! Overall the Chinese food here is not outstanding, but if I am conveniently nearby, I would order from Elaine's Kitchen again.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "Increasing my rating to four stars. We have now ordered several times from Elaine's kitchen and the food has been consistently good. It's our go-to Chinese delivery place from now on.", "author": "EG P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "The store service also is pretty good, health is also very clean, environment is very comfortable, it is a good site for.Go here at least a couple of times a month for dinner.  $6.50 for awesome mongolian beef and white rice with complimentary soup and egg roll.  quick serivce,very much food and good price.  also have tried the orange chicken/generals chicken type dish which was good.", "author": "Kitty L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-23", "description": "I bring such disappointing news for Elaine's Kitchen. I ordered again since the food wasn't bad the last time I ordered in February. Plus they changed their delivery system, thinking maybe, now they are using Eat24 delivery maybe they'll be on time. Yes, delivery was faster than the last time but the food has gone down hill. Our egg fried rice was burnt. I mean who burns fried rice?!?!  The General Taos Chicken was such a sad affair. It was hard and doughy chewy. Deep *sigh* I guess, I must look somewhere else to order Chinese food and rely on Yelp! Hopefully, in the future, I'll be able to find good Chinese food that deliveries within an hour.", "author": "Kathy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-22", "description": "Ordered from eat24.com, and it arrived within 30-45 minutes, which wasn't horrible. My boyfriend ordered orange chicken which was decent, and I ordered hot and sour soup. It was awful! It was luke warm, way too sour, and smelled rancid. I usually love hot and sour soup, so I figured it would be a safe choice. Not worth the money.", "author": "Megan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "Hmm...not bad! Just ate here today for a birthday lunch for a coworker, who had wanted Chinese food. We sometimes order lunches from here for our company so we decided to try out this place. The restaurant is located on Broadway past all the clubs and can be a little hard to spot, especially with the construction that is currently taking place right on top of the restaurant. The inside is pretty small but looks nice and modern! There were a lot of items on the lunch menu, which I really appreciate because I feel like lunch menus these days have such limited choices. I decided to go with the salt and pepper fish fillet. \n\nBefore our entrees arrived, everyone got hot and sour soup and a fried cream cheese wonton as well, which are included with our lunch specials. Nice! The hot and sour soup was tasty and not too spicy as some can be. The cream cheese wonton had a good crispiness to it and the filling inside was pretty good. When all of our entrees came, they all looked like they gave a good decent amount of food. I was relieved to see that my fish fillet wasn't just all batter. The fish tasted fresh and was good with the peppers that it came with. My entree also came with white rice. So for the price, quality of the food, and good service, I think this is a great little gem to try!", "author": "Mary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "It's such a great place to have a quick dinner with friends or family , even multiple times a week. They offer quick and reliable delivery service too. Glad to have them around !", "author": "Shirley G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "Worst Chinese delivery food I ever had!! Almost threw everything I ordered!! Waste of money", "author": "Manuel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Elaine's is awesome. I know this sounds crazy, but even with Chinatown like next door to North Beach it's really hard to find good Chinese food that isn't too greasy. But my boyfriend and I have gone back to Elaine's again and again because it's consistently delicious. Our staple items are the cashew chicken, spring rolls, wonton soup, and chicken fried rice. But we've tried a lot of others and love everything we branch out to.", "author": "Kathleen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-11", "description": "We opted to Elaine's as a last resort when the average wait time at every restaurant around our hotel was at least 90 minutes. Don't really know much about dining culture in SF area, but we thought the delivery time of 1 hour was a bit excessive at almost 9pm, but it was our only option with kids already knocked out in the room.\n\nThe lady that was taking the order was patient and courteous. She helped me get the order in. When I realized it was almost $55 (for 2 of us, but we don't blame them, we ordered like 5 things), I tried to cancel 1 of the items, but the lady told me she already processed the card.... bullshit, she couldn't possibly have charged the card within 10 seconds of telling me the total. It was really whatevers at that point and I didn't really want to fight it as we were starved. \n\nThe delivery guy showed up after promised 1 hour. \n\nFried rice was decent, but kind of had that Viet seasoning taste, not straight Chinese. It was good enough. Chowmein was super blend and just tasted like oil and cabbage. Other chicken/beef items were not great but not bad either... pretty standard greasy Chinese takeout. We were so hungry and just ate up our food without complaining, but honestly I felt like panda express had better quality food. I would've had probably given them 2 stars for food alone, but 3 for convenience factor in the busy Union Square area.", "author": "David L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-29", "description": "I ordered the sesame chicken (delivery). It tasted fine, but there was too much breading and often just crispy bits with no chicken. Very sweet. My stomach did not thank me afterwards.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-03", "description": "My first time here! Got the \nMongolian Beef\nWOR Wanton Soup\nTastes amazing! \nGreat flaver!\nQuality meats!\nThe best thing about this place is the price !$$$\nI'm very picky about my Chinese food because its my favorite food. \nDefinitely coming back", "author": "Roman J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-27", "description": "Delivery - 20 min late (80min total). Small portion entree (lemon chicken) that was soggy, sickeningly sweet but not flavorful and served over lettuce (which just makes things taste weird IMO). Crab Rangoon/cheese puffs were decent but not special, and I received pretty average store-bought sweet & sour sauce (as requested) for them. Steamed rice was fine.\n\nDefinitely would not order again... For $20 (twice the price of most my meals), I received like 40% less food than other places AND it didn't taste very good/was low quality AND it was late (don't tell customers 60min if you need 80!).\n\nVery disappointed considering this is a 4-star restaurant. Did I just get super unlucky or do they have fake reviews ...?", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "Delicious, quick delivery, and my girlfriend craves the shrimp fried rice.", "author": "Robert A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "This is my one of favorite restaurants. The last time i ordered food at last mins (close at 10:00 and i ordered at 9:50) and Elaine (the owner) still let me order the food and not hurried me (good customer service). I ordered Mongolian beef and general tao's chicken and they were just fresh and hot.  The chicken was so crispy and the sauce was just right for chicken. I also ordered Mongolian beef for my roommate. My roommate said about tender beef and hot sauce. He really likes the combination of onion, beef, and hot sauce of Mongolian beef from the restaurant. Every time he asked me if i go to Elaine's kitchen, i must bring it for him. I highly recommend the restaurant to everyone.", "author": "Peter S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "Finally found my go-to Chinese food delivery place. Elaine's is delicious and our food has always been delivered in under an hour, which is a feat for SF food delivery. We have ordered delivery from here 3 different times now and not only is it quick, it arrives hot and without anything dishes being incorrect or missing which is another feat for delivery around here. The General Tso's chicken is extra delicious if you order it spicy, and the crab cream cheese wontons are SO yummy. I'm also a fan of the fried rice. I know fried rice is a basic dish, but Elaine's gets it right. I also really value the coupons that Elaine's has on Eat24 and Grubhub. The only criticism I have is that the ma po tofu was not a traditional recipe at all and it was actually pretty unappetizing (there was like... clumps of congealed sauce). Everything else we have tried has been good though!", "author": "Anna J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "Food was delicious, delivery was free with reasonable minimum order ($15). Would definitely order again!", "author": "Michelle A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Ordered delivery for a night in at the hotel. Food came when expected and was fresh, hot, and delicious!", "author": "Travis D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "I wish I could give 3.5 stars but I think this place is closer to 4.  Elaine's is my go to Chinese delivery place.  The food is good quality and definitely the best option I have tried in my neighborhood.  The Crab cheese puffs are a little different with a more substantial wonton and more seasoning than a typical restaurant.  The sesame chicken is my favorite but all the entrees we have ordered are good.  You do have to order rice separately and delivery can take more than an hour if they are busy.", "author": "Harry C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-20", "description": "Seafood chow mien stirred with extra soy sauce.\nBeef chow mien stirred with extra soy sauce.\nHot&sour soup bowls are my usuals :-)\n\nThere food is actually pretty damn delicious but a little bit pricy then lately I noticed that the food portion itself is a lot so price itself is fair.  \nI tried the Mongolian beef at many other restaurants and never liked it but the one that  Green Gardens make was really good I mean its not the authentic Mongolian beef that we make it back home but I liked it so far. Plus its a Family  business and they are really friendly too.", "author": "Namuna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "We are visiting from out of town and didn't feel like going out after a long eventful day. We decided to order Chinese food. Free delivery, yummy appetizers, and the chicken dishes we had were also delicious. The only downside we had was that they didn't give us any rice. We are used to getting white rice when you order an entree. Other than that it was great. I would order again and just request rice next time.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "Elaine's Kitchen is amazing!!!! I have never been so impressed and pleasantly surprised by a meal. I implore you to experience this gastronomic revelation. \n\nHave you ever eaten Chinese food that left you feeling lethargic and full of self-loathing? General Tso's chicken that looks more like a MSG jello than actual food? General Tso's chicken that you can't figure out what part of the chicken you're eating?\n\nElaine's is the antithesis of the aforementioned questions. The General Tso's was lightly breaded, white meat chicken in a lite, flavorful ginger sauce. The potstickers were gracefully crafted with fresh ingredients.", "author": "Roland C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "The delivery sometimes takes a while, but the drivers are normally very nice/polite and the food tastes great! I would suggest their sesame chicken. Also, for some reason they almost always give an orange, which I have no complaints about ;)", "author": "Richard L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "We had our meal delivered, it arrived fast and hot. Everything we ordered was delicious-Orange chicken, chow neon, dumplings. Highly recommend", "author": "E W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-20", "description": "I ordered three dishes with appetizer and soup for a delivery to my hotel.  It arrived in 50mins, which was very late for a restaurant less than a mile away.  Also, when I took it up to the room, I realized there was no rice.  When I called the restaurant they said I had to order the rice separately. They just said sorry.  Unheard of! I didn't want to order the rice and wait another 50 mins so we are without the rice.  \n\nHowever the food was a different story. Some of the dishes were very bland, others way too salty. The quality of the food was horrible. I would not go there again.  Beware!", "author": "Brian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "soo yummy! ordered for delivery and it got here in 30 minutes on a friday night. everything was perfect and flavorful. none of the crispy fried items were soggy i feel like thats a problem with a lot of deliveries but this place killed it. will definitely be back.", "author": "Nicolette T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "Take out here was fabulous. We had the fried rice and basil chicken, there was so much flavor and freshness. Reasonably priced and quick delivery. We will definitely order again.", "author": "Andy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-12", "description": "Located on Broadway Street, it's located near work so this is a new lunch spot for me! My co-worker has been here before, so of course if someone wants to go back, you know it's good.\n\nIt's a cute little restaurant, there's about 7-8 tables and we got greeted/seated right away. They pretty much have a standard Chinese food menu so if you've had Chinese food before it's easy to decide. Go for their lunch specials! \n\nHere are the things that will make me come back:\n\n1) Sweet & Sour Soup - brought out right away & it's yummy!\n2) Free Crab Cheese Puffs - the best things in life are FREE!\n3) Tea - just something about their tea, oh, & they are generous with refills!\n4) House Special Eggplant - perfect \"hot\" factor and tasty\n5) Fried Rice - de-freakin'-licious!\n\nAlso, between the two of us, the bill was around $16 bucks for an in-restaurant meal. Yeah! What is that normally? 1 fancy salad?!?  Haha. Can't beat that.", "author": "Sammie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "Good delivery , liked the orange chicken, had candied orange slivers on it. The fried rice had shrimp in it which wasn't my bag. They gave us free hot sour soup, and threw in three free oranges. I will order here again.", "author": "Meghan O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-23", "description": "Delicious Chinese food for a quick service restaurant. You know you're getting something cheap, quick, and greasy, but you pay for what you get.", "author": "Alexandra B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-24", "description": "I tried General Tso's Chicken and Cheese Crab Rangoons. \n\nFood was Americanized in the stereotypical cheap bland manner, like a more expensive version of Panda Express. I've had amazing artistically Americanized Chinese food and this is not one of them. \n\nIt would be a good choice if the food were dirt cheap, but it actually costs as much as many great-tasting alternatives in San Francisco.", "author": "Max L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-22", "description": "Tried it out on week 2 - probably a mistake on my part.  BUT...\n\nService was friendly and earnest, yet fraught with errors. Literally had 4 incorrect plates show up - for a party of two. Lots of apologies, but also resulted in a very long lunch, exactly the opposite of why we tried it out!\n\nGeneral tso chicken was a big disappointment- and I consider it a staple/easy dish. Just didn't have any spice or tanginess to offset the sweet.  Huge bummer.\n\nSoup dumplings were a disaster. Must avoid.\n\nWill try again in a few months - maybe...", "author": "Jeremy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-13", "description": "- very bland won ton soup\n- walnut prawns had no sauce\n- chow mein was average\n\nnot coming here again.", "author": "Boris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "Great service, decent chinese food. Very tasty crispy honey walnut prawn", "author": "Carlos V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "Just had dinner here tonight and decided it was something to write home about (literally)! I don't write reviews often, but made an exception for Green Garden (now called Elaine's Cafe?), as the owners of this restaurant are really sweet and genuinely care about making their food and dining experience great--plus the food is SOLID! \n\nI came here with some friends who have been frequenting this place since they were high schoolers back in 2004, and they said the food has stayed consistently delicious. They were definitely right!\n\nWe shared the:\n- Mongolian beef: As the others say, you must get this!!! With a savory, slightly sweet sauce and tender beef, this dish hits the spot\n- Spicy cod filets: Awesomeee, and probably my fave. Fish was lightly fried and tossed in a delicious tangy sauce, but was not too sweet\n- Pork potstickers: Huge potstickers with a lot of meat, and lightly fried but not greasy\n- Kung pao chicken: This was okay; not bad, but not great either\n- Shrimp chao mein: Large succulent shrimp, sauteed with thick, soft noodles and some veggies! Solid, but also what you would expect \n- Hot & sour soup, and crab cream cheese puffs: These came free with our meal and were yummy!\n\nUnlike many other Chinese places, they do NOT use a ton of oil in their cooking, and the restaurant is SUPER clean and orderly (say what!!!). Also, I appreciate that the vegetables in their dishes taste fresh and crisp, and the owners always bring out the food with humble smiles. Service is great, and prices are really reasonable! Dinner entrees average $8-9 for chicken/beef, and $10-11 for seafood, and portions are not stingy. \n\nOverall, if you want to support a good local business and also satisfy your hankering for Chinese food (without walking away with a stomach ache or empty wallet), come here!!", "author": "Celia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "Ordered delivery for dinner from here recently and it was pretty good! Nice and spicy with good flavors. The general tso's and eggplant/garlic dish were my favorites. I wish they had more noodles other than just boring chow mein, but other than that this spot is solid. Definitely greasy though, tummies be warned!", "author": "Natasha F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "I had a craving for dumplings and being temporarily housebound, couldn't get out to one of my favorite restaurants.  I looked up some on Delivery.com and came up with Elaine's.\nI ordered two different dumplings and won ton soup.  All three dishes were amazing.  Some of the best chinese food I've ever had.  The dumplings were light and flavorful.  The wonton soup had a clean tasting broth chocked full of fresh fish and meats.  I can't wait to go there and try some other dishes.  Judging from the reviews, it seems they do some things better than others.\nI was going to order the chicken salad but decided against it when they gave a choice of western salad dressings.  Not sure what that's about but will ask when I go.", "author": "Jane G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-19", "description": "Ordered through Eat24 with expected delivery time of 30-45 minutes.  After an hour and a half I called.  The woman who answered was friendly enough and said she'd call the driver.  10 minutes later he arrives yelling at me that he couldn't find the place (even though he had my number),  shoves the bag in my hand and storms off.\nFine at least we got our bland food.  The veggie chow mein had zero flavor.  The sesame chicken was so heavily deep fried you could barely taste the chicken.", "author": "Alex D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "Very fast delivery. Good came in half the time estimated. \nFree orange!\nI purchased the fried tofu and chicken stir fry. Didn't come with rice. Delivery guy was very nice.", "author": "Mimi W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-06", "description": "Not sure about the food, but their delivery driver almost crashed into my girlfriend's car at a stop light.", "author": "Aaron R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-15", "description": "I honestly can't believe there are good reviews for this food.  We ordered delivery from here, and trust me that it wasn't that fact that the food was not good.  Nothing had any flavor at all - from the soups (egg flower, wonton, and hot & sour) to the main dishes (string bean chicken and the broccoli beef).  The broccoli beef is marked as spicy on the menu, but it was nothing close to even being mild (even though I indicated spicy on the order from the dropdown box).  The only flavor was extremely bland sauce and a tiny hint of garlic.  Also, they didn't include any rice, and it wasn't obvious on the menu that it would need to be ordered as an extra.  The only thing this place did ok with was the crab cheese poofs, but even that was just average.  How about if they skip putting random oranges in the delivery bag and just focus on making the food better.", "author": "Dave B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "Best delivery Chinese food for the price in the neighborhood! Big fan of the sesame chicken, and it's only 9.95", "author": "Nazir K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "In comparison to what I've tried so far for Chinese take-away, I was pretty darned happy with this place. The prices are very reasonable because apparently just north of Broadway is expensive, just south of Broadway is expensive, but Broadway isn't? Sure.\n\nMore importantly, these folks do actually understand the meaning of gluten-free -- as in, they actually wok'ed me up some orange chicken without the breading, and it made me very happy. The veggies were fresh enough (not frozen or canned so it would seem), and I didn't wake up feeling like I had just eaten a chunk of the Great Wall the next day.\n\nService was quick and friendly, although being take-away, I didn't get the full experience. Most importantly, I really do love Cantonese-American food, and since so many places either can't translate \"gluten\" or just don't know what it means, this is probably my go-to place until something better comes along.\n\nExtra points (but not stars) are earned for being a family business -- perhaps not unique to Chinatown -- but a dwindling percentage of the overall West Bay food scene.", "author": "Amy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "My go-to takeout place! I ordered shrimp fried rice & the house special eggplant with chicken twice and both times it was consistently delicious.  Obviously not any gourmet Chinese takeout here but I really liked the quality of ingredients (huge pieces of shrimps) and flavors. Not to mention, their delivery and service is great. 1st delivery came right within 40 mins. 2nd time I ordered it, the rainy weather factored into the delay but when I called in for the status, the woman who answered called the driver to give me an accurate eta which rarely happens with delivery!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "Love this place. It is consistently solid, quick delivery- chicken wings are the best around! I love the chow mein- and the garlic broccoli is to die for. Delivery is always quick (like 45 mins), and it's SO CHeAP!!! Love love love!!!", "author": "J W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "I am a Chinese who have spent 20 years growing up in China and am a regular consumer of Chinese food. They have good Chinese food and the taste is really. The house fried rice is made with various meat and vegetables and tastes real good (and they are doing it the old way because among the three I had one of them is saltier than the others). Their Chow Mein is very good too, the slightly over-oily noodles reminds me exactly what I used to have back in China. I highly recommend the tofu chicken, general tso's chicken and broccoli beef, which I had for three different meals. These dishes have a very good taste and texture and have a special aroma that is generally lacking in some other Chinese restaurants. The food looks also healthier as they are less starchy and you can easily tell that the vegetables they use are very fresh.\nHighly recommended. And they give some oranges if you order for delivery!", "author": "Shuang L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-21", "description": "Legit Chinese takeout. \n\nThe honey walnut prawns had huge prawns in them. I loved that it was not drowned in a mayo dressing. The chicken wings were crispy and perfectly seasoned. \n\nDelivery took about an hour but I think most places take about the same time. Will definitely order from here again.", "author": "Maida C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-08", "description": "This place is a small hole in the wall full of tasty quick Chinese dishes. I had the General Tsao's Chicken, Mongolian Beef, and Hot and Sour Soup. All ordered at Medium spice. But to my taste buds medium seemed mild. \nThe Generals Chicken was perfectly crispy, and when you bite into a sweet tangy chunk you see beautiful white meat chicken staring back at you.\nThe Mongolian Beef was savory and covered in onions both white and green. Sadly the dish lacked those crunchy little rice noodles but otherwise the balance is good enough to dive into.\nThe Hot and Sour Soup had a slightly beefy taste and is perfectly thick and tart.\nI ordered for pick up and Elaine herself called 10 minutes early to let me know delishiousness was ready.", "author": "Sean C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-10", "description": "Food was above average, not too corn-starchy, meat was high quality, not overcooked. Portions are not huge, but they are still enough for two people at least.\n\nDelivery was quick, will definitely order again.", "author": "dutchy s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-17", "description": "Bro, I'm not sure we are eating at the same place lol. Well, if we are avoid the chicken chow mein, \"spicy\" and dry General tso, and the dumplings. I'm sad I got hyped about this food which took an hour forty-five to get to me. And no chop sticks or sweet and spice sauce... Too sad", "author": "Ari M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "Seriously delicious General Tso's chicken, Lemongrass chicken and crab cheese puffs. This is coming from someone who is not a big fan of chinese food. \n~ Quality food that you can taste is made with care. \n~ The employees are so sweet. \n~ Cute, clean & humble little place with a nice atmosphere. \nTo everyone at Elaine's, great job & thanks for a great experience!", "author": "Suki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Elaine's have really good set of food! Their orange chicken is a must-taste! Plus, Elaine (the owner of this resto) is really nice, even if it will close in 5 minutes, they still will deliver for you!", "author": "Bernadeth Regine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "We were a group of 6 adults and 5 kids which two of them were toddlers and the service was amazing. The owners were very attentive and they don't have high chairs but we made it work. We were a very loud group and I was amazed on how nice they were. \n\nAlso the food was amazing!!! We got the walnut shrimp, orange chicken, chicken noodles, mango-lain beef, fried rice with shrimp and fried rice with chicken... Yummy! So fresh and amazing. I'm glad we came here.", "author": "Jacqueline O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "Best chinese food in san francisco (Indians will love the taste) - Ask for extra spicy in all the dishes you order *_*", "author": "Aboli G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "Delicious food, super-fast delivery. Sesame chicken, vegetable delight, sautéed string beans, shrimp with cashew and celery - all amazingly tasty, in good quantity, delivered hot.", "author": "Steven A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-04", "description": "a. Eat24iInterface was a real stinker. Support was worthless;\nb. Food took _forever_ to get here -- over an hour even though they are only about 7 blocks away;\nc. Got our order wrong, exchanging the Mongolian Beef for an unwanted, small hot and sour soup;\nd. Food was only so-so. \ne. Why did the old Tai Chi on Polk have to change ownership?", "author": "Tony W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "really, really great. i mean, really fresh, delicately spiced, hot, FAST and just amazingly, surprisingly delicious. I expect a lot from delivery services and from restaurants and Elaine's didn't disappoint. Will definitely be ordering again!", "author": "Katya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Love it! Every time I come to SF I must stop by here! Sesame chicken is my dish of choice.", "author": "Edward L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "I love this place, took us living in North beach/Chinatown 5 years to find a great Chinese restaurant and turned out it's only a few blocks away from us!! I think they are small family owned and I have actually gotten deliveries from young girls(their kids, I assume while the parents waited in the car..) The food always came fast and super fresh! Speaking of fresh, I read a review from someone complaining about \"broken\" packaging, ummmm those are NOT broken, they have open holes on top of the plastic lid to keep the fried dishes from getting soft! Only down side, they do not offer pork dishes...;(", "author": "Ladywolf M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "3 nights in a row since I first discovered this place.  My old take-out favorite should be worried...\n\nI love the eggplant house special and ma po tofu.  The chicken with string beans-not so much.  \n\nThey definitely use baking soda to tenderize their meat.  However, I am willing to overlook that given the sauce and flavoring are spot on.", "author": "Joyce P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Elaine, all I can say is thank you. I've never gotten the pleasure of meeting this incredibly talented woman, but her kitchen is close to my heart. My woman and I placed an Elaine's order for delivery and our expectations were fully exceeded. Every item ordered took us straight to FLAVORTOWN! Finding this place has been both a blessing and a curse (only for my waistline).", "author": "Lindsey H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-25", "description": "Review of delivery from Green Garden Restaurant.\n\nEasy to order via http://eat24hours.com/\n\nDelivery - The order was placed at 1:40 PM.  The order was delivered at 2:29 OM.  Delivery time of 49 minutes.  It was within the estimated 45 to 60 minutes.  However, there are places with quicker delivery.  Delivery is free.\n\nMinimum Order - Delivery minimum is relatively high ($20).\n\nMongolian Beef - The vegetables were over cooked.  The meat was tender and had nice flavor but did needed more zip.  They did not include the side of hot sauce I requested.  The portions were relatively large.\n\nhttp://tinyurl.com/6aln55r\n\nhttp://tinyurl.com/6h2td9l\n\nGeneral's Chicken - It had no crunch.  The chicken was tender.  This dish was extremely bland.  The broccoli was extremely overcooked.  Luckily, I do not really eat cooked broccoli.\n\nhttp://tinyurl.com/6bd3mnj\n\nRice - The rice was well-cooked.\n\nPacking - The food was neatly packed into easy to reseal plastic containers.  There was some very minor leakage.\n\nPricing - Their prices are a bit on the high side.  They do have lunch specials but these are only available on weekdays.\n\nSoft Drink 3 \n$1.50 \nSteamed Rice 2 \n$1.50\nMongolian Beef 1 \n$8.95 How Spicy?: Hot\nInstructions: Side of hot sauce please\nGeneral Tsao Chicken 1 \n$9.95 How Spicy?: Hot\n\nSubtotal: $26.40 Discount\nTax: $2.51 Delivery Charge: Free !\nTotal:   $28.91 \n\nFortune Cookie - They did not include fortune cookies.  Chinese food without fortune cookies is like Christmas without Santa Claus.\n\nOverall - The food was very average.  The prices are slightly high.  Delivery was a little on the long side.  No fortune cookies.  No hot sauce.  There are many better all around options for Chinese food delivery.  But, in a pinch, it will do.  There are certainly options that are not as good.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "Ordered takeout and it was very solid.  General Tso chicken, bbq pork chow mein and crab puffs.  Everything was great, reasonably priced and fast delivery.  Very worthy of 4 stars.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "I was not sure what expect when I walked in and no one was inside, usually a bad sign. But I had faith and took something to go, probably like most people do and found the food was really good! So I'm giving 5 stars to balance out all those one star people who probably need to chill out and realize the world doesn't revolve around them.", "author": "Larisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "Yummy dried fried string beans and crispy walnut prawns! delivery was quick, and the serving sizes are great for the price.", "author": "Color C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-26", "description": "Was looking for a new Chinese delivery place and this was pretty good! Took about 40 minutes from the time I ordered on Yelp till it got to us in Soma. It's not authentic Chinese food, but it hits the spot. The general tso's chicken was still crispy by the time it got to us. The eggplant and tofu had a little too much oil, but it tasted really good.  The pot stickers are cooked right! Many places deep fry them but they actually pan fried them, yay! The sauce is just the pre-packaged stuff, so it would have been better if there was some homemade dumpling sauce. This will be my future go to delivery for Americanized Chinese food!", "author": "Kimberly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "Tried Elaine's on a whim today through eat24, it was surprisingly good! I recommend it, food tasted clean of msg. Yay!", "author": "michelle z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "I really like Elaine's. The food is good, very reasonably priced and the staff is very friendly. One of my favorite lunch spots.", "author": "Russ M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "super nice service and the food is fast and tasty with big quantity! highly recommend it!", "author": "Xi C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-14", "description": "Everything sounded great from the beginning... Great price, delivery, only 7 minutes away. We placed an order over the phone and they told us it would be 30-45 minutes. It was 2 hours! Not exaggerating... Literally. Two hours. Go somewhere else!", "author": "Riley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "One of my favorites for Eat24 delivery. They're always prompt and the food is consistently good. Without fail, we order the General Tso's and Broccoli Beef - both excellent over rice. I have picked up in restaurant as well and it looked like a nice spot, but the place was empty save for a number of delivery orders waiting to go out. It seems like they're focused heavily on delivery at this point, and for that I highly recommend.", "author": "Taylor B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-25", "description": "I ordered the orange chicken. Best I've had in a long time. Always love the small touch of frying grated orange peel with the chicken. Companion 1 ordered Hunan chicken spicy. Companion 2 ordered Hunan mild. Definite difference. Both appreciated the effort. Companion 3 ordered sweet n sour chicken, also enjoyed it.\n\nNormal order of egg rolls comes with 3 but waitress was nice and brought us 4 (number in our party).\n\nGreat little Chinatown spot. Will definitely be back.", "author": "Curtis K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-03", "description": "I owe it to you Yelpers to be honest about this place regardless of the fact  there is a Chinese family simultaneously living inside the restaurant watching Little Mermaid on the TV atop an ice cream refrigerator. Mom in the back screaming for an entire 43 minutes STRAIGHT! I shit you not. Her stamina to be able to continue that long is simply amazing. \n\nSo I ordered and was told to come back in 20 minutes. I came back to p/u and walked up the where I thought I would be able to pay and the man(Father) said it would be just a couple more minutes. So I sat down at a table not occupied by one of the kids. 2 more minutes actually ended up being 23 more minutes in what felt like the middle of this families living room as I was the only customer there. There was a young Chinese boy fiddling with his cell phone, a 3-4 year old watching TV, a teen girl on her laptop. All this on the tables for customers. And of course the screaming Mother in the back in Chinese...no subtitles.\n\nThe environment was not at all welcoming as I felt like I was intruding on a family in there home. This is the WORST atmosphere I have ever encountered. \n\nOK it's not all bad though. The food was really tasty. I got the scallops with chicken fried rice. Now about the scallops, yeah I know what they are supposed to look like and these scallops where sliced into thirds and then covered up into balls which were then fried. I was not too happy to see the cheapness of the family on the scallops. \n\nBottom line: The food gets 4 stars. The atmosphere gets 0. Averaged out to 2 stars. \nTo eat here the smart way my advice would be to CALL AHEAD for take-out only and pick up after doubling what they say pick up time is.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-05", "description": "The food tastes good. However, I ordered for delivery and when my food was already half an hour late I called the restaurant. They didn't care at all, and only told me that the delivery driver had left 20-30 minutes prior (so, basically when I was already supposed to have it by). The food was all cold when I got it and the packaging on my chicken dish was broken. This restaurant is getting two stars because the food is really good, otherwise it would get zero stars for the service.", "author": "Ally K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "I tried Elaine's tonight for the first time...quite pleased! Everything was delicious! Delivery was fast and the food was hot. I'll be back!", "author": "Kim M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-22", "description": "Pretty awful honestly... The lemon chicken and general Tso's chicken both were heavily deep fried with almost no chicken at all (there were legitimately pieces of just fried batter with nothing in them...). The Kung pao chicken had about 4 small pieces of chicken and that was it... The dumplings were a bit suspect in flavor... The gyoza was about the only decent thing we received. Probably won't ever order from here again...", "author": "Frank P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-05", "description": "I had walnut shrimp. It was delicious!  My two other guests enjoyed their meal equally. Great job!!", "author": "Deron J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "This place is amazing ! Elaine is very nice and was very kind even though they were very very very busy. nice place, good food, lucky i live so close to it !", "author": "Scrapp H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "Amazing walnut prawns, garlic eggplant, and pineapple chicken. Ate in with friends once and these dishes were great, ordered delivery another time and they were timely and the food was hot and delicious. Especially enjoyed the walnut prawns, super unhealthy but they were the perfect mix of sweet, salty, crunchy and sauce.", "author": "Daryl L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "Prompt delivery - from order to doorstep was about 45 minutes. I ordered the fried chicken wings, pork shu mai, and egg fried rice. Chicken wings were super crispy sprinkled with salt and pepper - I didn't even use the dipping sauce because they were good all on their own. Pork shu mai were larger than I expected, the meat was very flavorful. Egg fried rice had just the right amount of soy and egg. I think they threw in a egg drop sour soup and 2 oranges for free, which was very thoughtful :). I am not a fan of the sour soups, but definitely appreciate the gesture!", "author": "Anna D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-30", "description": "My go-to Chinese joint in the neighborhood for takeout. The food is great and really satisfies that Chinese food craving. I would never sit down for a meal here, however. There is no ambience, the TV playing Chinese movies seems more for the staff than the customers, and in this family-owned establishment, the children play and do their homework. Not the setting for an enjoyable meal. \n\nTL;DR get takeout, don't sit down.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "In this service people feel warm! I have eaten in many places Chinese food! But here the food is not only delicious! Hungry, that they will think of here! Great", "author": "Jacob Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-08", "description": "We went to Sam Woo's first due to the hour (10:15pm). Screw Sam Woo's, it wasn't late enough to ignore the horrid service (fine after a drunken club night).\n\nSo we went to this place. YEAH! They let us dine-in even though we arrive 10 minutes before closing (VERY COOL!). We received PHENOMENAL SERVICE from the second we opened the door. HOT Jasmine Tea was delicious.\n\nHe wanted to modify an entree... NO PROBLEMO ;)\nTriple Delicetession - 4 meats no veg ($11.99)\n\nI asked for an entree that wasn't on the menu... NO Problemo ;)\nSalt & Pepper Chicken with tons of chiles (used green jalapenos) - $6.99\n\nCombination House Fried Rice (large portion with whole shrimp) - $6.95\nAppetizer for Two (4 items each) - 7.99\n  -Spring Roll (lumpia style - very fresh)\n  -Crab Rangoon WonTon (holy smokes, YUM!)\n  -Potsticker (meaty and fresh)\n  -Tempura Shrimp (large shrimp nice light batter)\n\nPros: \nOutstanding Service\nGood Food\nGood Sized Portions (important)\nSpecial Requests are no problem\nFresh Ingredients\nWe had leftovers :)\n\nCons: \nI could see how parking might be an issue (daytime)\n\nWe have named GREEN GARDEN as our new late night dinner choice ;) \nPS Sam Woo's.... ONLY if it's the ONLY place open.", "author": "Madison M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "I'll keep this simple: considering price, quality, proportions, and service, this is the best value I've had at any restaurant anywhere. If I lived in San Fran, I'd eat here constantly. Just go.", "author": "Drew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "Elaine's was great. We ordered delivery using Yelp's service (Eat24, I think) and it arrived very quickly. The General Tso's and Sesame Chicken that we got were moist and flavorful and it was nice that the restaurant vented the containers so that the chicken didn't get soggy. My General Tso's chicken was especially good -- I ordered it medium and it had a small but pleasant kick to it. I'd definitely order from Elaine's again!", "author": "Harry S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-28", "description": "Awful service. Ordered delivery and it took 1 hr 45 min. Meal was fine, not much chicken in my pineapple chix. Fried rice is good.", "author": "Erin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "Very friendly, genuine people running this place. Food was at a reasonable price as well.", "author": "Amin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "I'm home sick today.  I ordered cashew chicken, mapo tofu, wonton soup and dumplings to get me through the weekend.  It came out to about $40. and was delivered in about 30 minutes.  AND...they gave me 3 oranges!  That was so nice and I need them to fight my cold!", "author": "S. Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "The owner is super sweet and the chef made pretty good food. Super cheap as it is still new.", "author": "Joyce L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "Good food, great service and great delivery service as well. Quality of taste is great compared to many other Chinese places in the district!", "author": "Namira B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "Amazing service, a family owned restaurant and you can tell they put their love into each bite! Food is amazing.", "author": "Dana N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "Got delivery, and the service was on time.  Good was good, packed well and looks like it will be good for leftovers :)", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-10", "description": "LOVE the chicken fried rice, won ton soup, hot and sour soup, and EVERYTHING. The best in THE CITY and fab service.", "author": "Cherlyn M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-21", "description": "My parents decided to order from Green Garden one night for 8 people (two families) because they found the menu hanging on their door... They ordered so much food and a lot of it was really yummy! I particularly liked the hot and sour soup (always my fave!) and the vegetables deluxe. However, some of the food was a bit too greasy for my tastes especially the noodles and some of the chicken. We also got fortune cookies this time from Green Garden... \n\nSo, when my friends wanted chinese food take-out for dinner, I ordered from Green Garden. I would have liked to order brown rice with my food but they only have white and fried rice. I again loved the hot and sour soup and the girls loved the Mongolian beef (I'm not much of a beef eater). For three of us and way more than enough food the bill was about $36 including tipping the delivery guy. The delivery was fast too! Where were our fortune cookies though?! Did they run out? Who serves Chinese food without fortune cookies?!", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "This is one of my favorite places to eat in SF. I love their crab cheese puffs, egg flower soup, shrimp fried rice. For $15 you can have full lunch or dinner.", "author": "Fred S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "This review is for the customer service I received from Julie. How awesome and amazing. Thank you.", "author": "Jarrod R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "Good food . Food is great. Fast food. My favorite dishes is Mongolian beef. They delivery very fast!!", "author": "Angel Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-19", "description": "I tried the delivery. They were an hour late. The food was almost cold. It was also not very good. Definitely would not recommend. There are just too many great places in this city for that to be acceptable unfortunately. Something seriously has to be off about the really good yelp reviews. It's that ridiculous.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "I got delivery from Elaine's kitchen. Got Kung Pao Chicken and Shanghai Dumplings. Not only did the order reach in 30 mins but both dishes tasted great and came in big portions. The prices were reasonable too. I am definitely ordering from here again.", "author": "Shay P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "Excellent spot for a great workday lunch!  Lunch plates for $6.50! Woot!  How can you beat that!  Get the salt and pepper fish over rice!  Hella good yo!  Portions are huge.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-03", "description": "Ordered sesame chicken. Ok. Tasted  cheap. Fried rice was flavorless. maybe I'll try something different next time.", "author": "John D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "this is a really good restaurant that opens in the last few months . Food here is delicious, and the service is decent as well. My favorite dish is mogolian beef,which is better than the same dish in all restaurants in sf. Environment is good and deliver is fast as well. highly recommended.", "author": "Nikki C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-26", "description": "The Green Garden Restaurant is the epitome of the type of restaurant I would be proud to be a regular at. You won't get style points for this place. It's a humble, small, mom and pop establishment that's been around for a while amidst some of the more active \"nightlife\" in the City. (Enough said that the restaurant is located on Broadway, SF's popular hangout for strip clubs and nightclubs - hey, whatever you're into, more power to you. I can't judge, I let the 'playa' play) But let's not confuse form over function. What you'll get is great people serving great food. I was part of a construction project across the street from this restaurant and came here often with the crew. That was 4 years ago and to this day, the owners still remember me and welcomed me with fried rice. How's that for customer service? The owners are here 7 days a week, unlike the other businesses in the Fi-Di where they're only open Monday-Friday. The husband owner rides his bike around town to deliver orders. It humbles me every time I see that. The food is also impeccable. I wish I took photos of all the dinners I had here in the past; no worries, time to start now. I remember always 'feening' for Mongolian Beef at this place and that's what I ordered. It was as good as I remembered. Much more authentic than other restaurants around. So, before you drop it like it's hot or make it rain, get filled up here first before you start chatting up the ladies - both the dance floor and dance pole varieties. =)", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "I hit on Elaine's buy accident.  I was working near by and stopped in for lunch.  What a pleasant surprise.  Excellent service but more importantly the food is delicious!  I unfortunately do not work or live near by but I make it a point to visit Elaine's at least once a month for my fix.  The best fried rice I have ever had.  Everything I have tried has been exceptional.  No this is not my family business. :)", "author": "Mary Ann G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "I work in the area and come here for lunch occasionally. The food is tasty and the portions are hearty. I don't know how to say this in English but the food has the taste of being cooked in high heat, which caramelizes the surface ever so slightly, a signature of classic Asian stir fry. Which is great. Their location is slightly outside of Chinatown which means that they probably have to work harder instead of rely on random tourists to walk in. To sum it all up, I feel this is a fairly solid place for typical style Chinese food.", "author": "Winston W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "Perfect place for quick and delicious Chinese food with good ingredients. Stopped by for vegetable dumplings and chicken wings. The wings were good, but the dumplings were really impressive. Flavorful, steamy veggies wrapped and lightly fried. What stood out were the peas (among other veggies) which were soft and sweet. The portions were big, and price very reasonable.\n\nIt's family run and the kids are there, watching TV or helping with the food. The father himself bikes around to do deliveries. \nThe interior is nothing to write home about. Clean and simple decor.\nAll in all great Chinese food for a small family establishment.", "author": "Arthur X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-19", "description": "This is my go to place for a quick lunch. Super fast and food is always good. I've eaten hear about 15 times and have never had a bad lunch. All the food has a lot of flavor. The staff is always friendly and nice. Service is quick and price is cheap. 5 star decor ? No, but I come hear for consistent Chinese food. Not for the decor", "author": "James T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "Quality food and great taste at an affordable price. The portions are huge and the food is delicious. Decor and service are so so, but that's just not what most Asian restaurants focus on. I will definitely go back.", "author": "Ana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-15", "description": "a friend recommended this place for lunch take out.\n\nthe server was nice and helpful.\nI order salt & pepper pork with fried rice lunch combo.\nI ended up getting the pork with steam rice.  ugh!\npork was definitely too salty for my liking.\n\nthe place was small but clean.\n\nstreet parking in broadway so it can be tough.\n\noverall, I was a bit disappointed with the food but I'd give them another chance.", "author": "Learnee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-09", "description": "Located by the edge of broadway. Dropped by on a whim thanks to yelp :) Hands down one of the best places I've been to for hot & sour soup not watered down like some places and a bit of kick.. Also had the Mongolian beef that was pretty good. Give it a shot if ya ever around the area.", "author": "Wayne T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-12", "description": "I had the sesame chicken lunch special.  It came with an egg roll (surprisingly good), tea which was an extra fee (okay), and fried rice.  The chicken was a little too oily and tart, but edible.  \n\nThe kitchen looked really dirty.  In fact, the whole place seemed unclean.", "author": "Niniane W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "I eat here all the time for lunch time when I am working on Broadway, let me just say fast service and free delivery. The food is always good, never ordered anything I did not like. Fried chicken wings and Mongolian Beef are to die for... literally!", "author": "Renee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-16", "description": "I go here for lunch at least once a week. This place has one of the best Mongolian Beef Rice dish. All lunch comes with a small bowl of soup (Hot&Sour) and Veg. Egg Rolls. The Hot&Sour soup here is usually very good.  Better than the ones in Chinatown. Also, the Eggplant dish with Chicken&Shrimp is also excellent . The waiter/waitress and owner are very friendly too.", "author": "Wain C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-18", "description": "I come here two or three times a month at lunch time. The food is hot and fresh and the service is great. Besides, it's just a few blocks from my home. It's all good!", "author": "Paula H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-04", "description": "Thought I would try out this place... it was open late and within walking distance of work.. so I picked up some food for me and my boyfriend to go...\n\nThe service there was really good and the food came out fresh and hot.... but when got home I took a closer look at my noodle dish.. I noticed that the used the wrong noodles... but since I was home might as well right... yeah that was a bad mistake.. my stomach was hurting the next day.. I called up my boyfriend and he had the sam problem with his too..", "author": "Lena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "Great service. The american waiter even know how to speak Cantonese! He should have set the table with chop sticks though. The food and that's the main reason why I came was excellent. Vegetables have a bite (string beans with chicken and veggie chow mein). Best are the walnut prawns!  ( they were just a littlebit too soft) oh I got a free soup and cheese dumplin. Best price quality chinese ever!", "author": "Belgian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-27", "description": "The food at Green Garden was very delightful!  The food was so fresh, and the service was prompt and very helpful!  Look forward to going back on our next visit for sure!!", "author": "Donna C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "It's great to get a healthy Chinese place that takes good care of it's customers! Great place for food deliveries!", "author": "James T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-01", "description": "Attentive service, personal staff, clean, modern decor, delicious food: wonton soup, house special eggplant, salt & pepper fried fish fillet. We will come back.", "author": "Giang N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-05", "description": "Think the sesame chicken looks good? Do not be deceived! I got the sesame chicken lunch meal with rice and it tasted pretty good. A couple hours later, I was on the toilet throwing up for hours. This place definitely gave me food poisoning...so while it may be cheap and taste good, I will not, under any circumstances, be back. \n\nJust a warning.", "author": "Hannah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-19", "description": "Excellent lunch, chicken was fresh and moist. Fried rice was some of the best I have had.", "author": "Roddy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "Very good food, great prices and nice, clean space. We were worried as the place was empty upon arrival but the food did not disappoint. Especially liked the complementary hot and sour soup and delicious crab cheese puffs, as well as the veggie potstickers and Kung Pao tofu. Would definitely return.", "author": "Geoffrey U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-09", "description": "Gave it another chance. This place is actually really good. You wouldn't be able to tell walking by. But I have eaten here a number of times and enjoyed it every time.\n\nPot stickers and sesame chicken is what I get. Mmmmmm....", "author": "Mike A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-04", "description": "Cheese crab puffs are delicious! I'd give them 5 stars just for that. However, was very disappointed with the walnut prawns/shrimp. Batter is way too thick and the sauce is not creamy like most places. Very clean restaurant and friendly staff though.", "author": "Autumn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "I ordered food for delivery via GrubHut. It came quickly, and a bonus is the fried stuff was vented so it didn't come soggy. In my online order instructions I asked for less salt, less oil and no MSG. I believe they did all that. On top of it all, it's not bad Chinese food. There aren't many decent Chinese delivery places in SF, I think this is one that I will try again.", "author": "Lesty L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-24", "description": "Having read good reviews of this place on other websites, I was keen to try it out myself. I was quite surprised to be the only guest when I entered the restaurant on a sunday night at 7.30pm. Restaurant might also be an inappropriate description of the place, which resembled a mixture of a fast food place (interior and decoration) and the family's living room at the same time. I personally don't mind that, but be prepared to have the kids around doing their homework, browsing music videos on youtube, or just talking in Chinese with their parents. \nThe food was served within minutes of my order. My tastebuds said the food wasn't special in any regard, I'd rather say it was average americanized Chinese cuisine. A remark on the side: I ain't sure if it's usual that rice has to be ordered as a side dish, but it's an extra 1.50$ for a small bowl. After all, I enjoyed my dinner there, even though it was somewhat special.", "author": "i486"}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-04", "description": "I like Green Garden for many reasons:\n\n1.) They have crab cream cheese Rangoons... my favorite. \n2.) The Orange and Lemon Chicken are very good and prepared totally differently from one another. Lemon chicken is a big piece of meat, while orange chicken is the small fried pieces. Now you can alternate and it seems like two totally different meals.\n3.) The rice is nice and sticky.\n4.) The delivery man rides up on a bike with an orange crate attached to the back. Rain or shine he shows up with hot food. Now that's commitment! How can you not like that?", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-14", "description": "Born and raised in San Francisco this is some of the best sweet and sour chicken I've ever eaten. Tonight's batch was a bit greasy which is why they lost a star. The people are friendly the food is fast cheap and good. Fed myself and my fiance for 11.50", "author": "Kami M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-10", "description": "Cute Chinese restaurant and good service. \n\nThey use nice dishes instead of the normal cheap Asian ones, but it doesn't make the food taste better. We had hot and sour soup, fried rice and green beans with chicken. I also like the beef with peppers and black bean sauce. \n\nThe portions are generous, but I was disappointed with how there were hardly any chicken the green beans/chicken dish. I think it's because we were there late. \n\nThe couple that works here are very friendly and nice. They recognize us and always looks happy to see us.", "author": "Gladys C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-01", "description": "Yes, there are better Chinese places out there in the city, but when your only other option for Chinese food lunches within walking distance of the office is Levi's Plaza's overpriced, oversauced and overall subpar Yan Can Cook Kung Pao lunch special, you'd be likened to agree with me. \n\nEvery time I come here, I am greeted with a smile, a cup of water, and an eggroll. When I walk back to my office to eat at my desk (how's that for efficiency!?) I am always so excited to open up my takeout container of delicious food. On some days it's the asparagus beef, other days, it's the won ton soup, but there are numerous lunch specials to satiate my hunger, all conveniently priced from $5.95-6.95. I can always guarantee that the food is hot, fresh, and most importantly, fantastic. \n\nComing here almost makes me forget that I'm but a wee cog in the big wheel of corporate America. \n\nAlmost...\n\n\nEDIT- Wait, not really.", "author": "Clarissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-03", "description": "I'm giving Green Garden 5 stars not only because their mushu pork is the best I've ever had, but it's really the fact they remember me and even call me the mushu pork lady. They make me feel welcome and appreciated and my belly is appreciative when it's full of their food.", "author": "Nikki A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-29", "description": "I come to this place to eat with my boyfriend alot, because its always quiet and never crowded. The family is always super sweet and friendly. We usually spend around $20 for the both of us, which is awesome! And normally get a plate of fried rice and a plate of chicken, and always have a good amount of leftovers. The food comes out super quick and is delicious. I love looking at all the different teapots in the case. Very good restaurant and totally worth the money!", "author": "Ally A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-02", "description": "5 STARS BABY! \nGreen Garden rules, hands down!\nLunch Menu totally rocks with down-to-earth prices and good porportions.\n\nSoup and Wonton in-your-face the moment you sit down just to get you warmed up. \n\nAdequate service is like cherry on the top.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-26", "description": "A mere 4 blocks away unknowing tourists line up for sickly sweet slop at House of Nanking.  What for?\n\nGreen Garden is on the opposite end of the spectrum. It is basic, simple, unpretentious.\n\nOh, and very, very cheap. Really cheap. And fast.  Like Wonderdog fast.\n\nPortions are very large, though to be fair they tend to be heavy on veggies and light on meat. I dont view this as a negative, but just know what you should expect.\n\nAs is usual for chinese dives they have a rice-plate based lunch menu. Everythign I've had is good, espcially the Royal Pork (simple slices of roast pork with perfectly stirfried greens) and the Spicy Eggplant (not oily as at most places.)  A bowl of soup, an entre with rice, a small salad, a wedge of orange, tea and a cookie cost around $5.  Try doing that at home.\n\nThe dinner menu has the same items, and again they are well, if simply executed.  Try the stir fried green beens if you want a veggie option. Crispy, kissed with garlic but not overpowering, and a nice sesame oil sheen.\n\nEveryone needs to have a place like the Green Garden in their hood (alas I don't, though Brandy Ho is openeing a branch 100 feet from my house in the Castro, so I'll live.)\n\nFor what it is, this place delivers.  Give it a shot.", "author": "hOWARD y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-04", "description": "I work about 5 blocks from this restaurant and must say it's the best Chinese food around. \nThe only catch is that if you're allergic to MSG (even mildly) you may want to stay away. Or as others have said here, be willing to leave with that good old MSG buzz.", "author": "Vivi F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "I was very surprised that this Chinese restaurant actually served one of the best hamburger and fries I have ever eaten in this neighborhood along Broadway! The Double Cheeseburger with Mushrooms along with fries was excellent. The sesame seed bun was perfectly toasted, the beef patties were juicy, the mushrooms were properly sauteed, and I think, so were the pickles. The Fries were excellent and crispy and unsalted--good, because I sprinkled my own amount of salt to my own taste. This is a great place for a good burger at a good price along this side of Broadway.", "author": "Robert T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-25", "description": "This is probably more of a 2.5 stars - meaning, if they didn't deliver, I would not go out of my way to eat here.  Their delivery was quick (about 35 min.) but I also live pretty close to the restaurant.  I ordered the Hong Kong Pan Fried Noodles with Seafood, green onion pancakes, and hot and sour soup.  The noodles seemed to be a little light on the toppings (seafood, veggies, and sauce), but was okay.  I don't suggest the green onion pancakes - they were crispy on the edges but soggy in the middle.  The hot and sour soup was solid - not the best, but not bad either.  So, if you're hungry, this place delivers hot, adequate Chinese food.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-12", "description": "I was back from the gym early so decided to order from Green Garden for dinner. 35 min. after placing my order arrived, my food was f*ing hot and spicy, just the way I like it! IF YOU WANT TO KNOW WHY I'M GIVING THIS PLACE 2 STARS, JUST READ THE LAST PARAGRAPH!\n\nI ordered the pork potstickers, the chicken salad, and General Tsao's chicken (out of respect for General Tsao, although I'm not sure who he is, I am capitalizing his name and title). The pork potstickers were absolutely delicious, with the right amount of crispiness on the outer edges and perfectly cooked pork on the inside. I couldn't put them down and when I was done, I hated myself for eating them in such a hurry instead of savoring each and every bite. Next time, I'll be sure to place two orders of the potstickers for sure!\n\nThe chicken salad was decent. There's tons of raw onion in the salad (and not red onions, that usually make  salads oh so delicious) but the white kind, that just tastes way too oniony and blehhhh overall. After trying to pick out all the onion bits and pieces for about 15 min., I just gave up on the salad. I guess it's partly my fault for expecting a quality salad from a Chinese restaurant. \n\nWhat people say about huge portions is definitely true. My General Tsao's chicken was huge! And it lasted me for three whole days (which is good in this economy). The dish was warm when it arrived, and the chicken was fried to perfection! This is something that I would definitely order from Green Garden again! Although I'm interested in trying other dishes in the future as well. \n\nThe reason I'm giving this place two stars is because of the extremely creepy, creepy, creepy CREEEEEEEPPPPPPPY middle-aged delivery guy with a creepy creepy CREEEEEEPY smile. When I answered the door, I promptly gave him the money that I owed him (along with a generous tip) and expected him to hand me the food and leave. After all, it should have been a simple and quick transaction (kind of like those drug deals that happen on Law & Order series). But instead he forced the door open, started commenting on how nice my apartment was and proceeded to take a step or two inside, looking all up and down my apartment, as if I was having a full blown open-house and he was Donald Trump. Finally I got so annoyed that I had to say, \"Excuse me, what the hell do you think you are doing?\" at which point, he realized how inappropriate his actions were and stepped out again. Seriously, it was as if he was trying to make up his mind whether to rob my place or let me live another day. I quickly proceeded to shut the door firmly on his CREEEEPPPPY face and use all the locks on my door + move all my furniture to the door so it would not budge. Considering the decent food and hefty portions, I would like to order from this place again, but ONLY if they get a new delivery guy that's not so rude/ CREEEEEEPY.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-02", "description": "It used to be a very busy place .. some 5 yrs back. what happened? Still cheap and ok food. if they do some menu chgs and improve taste a little, this can be busy again.", "author": "yelper l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-10", "description": "This is one of the better quality, lesser-known Chinese restaurants in SF.  The location up on the hill by the lounges and strip clubs on Broadway St. isn't really ideal for most people who are in a rush during lunch.  That's unfortunate too, b/c they use really fresh ingredients, give very generous portions, and all for a really cheap price. too.  If you're able to make the trek up to Broadway St, you should definitely stop by this restaurant and give it a try.", "author": "Minh V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-27", "description": "I only order one item at this place, really, but I've tried the other stuff and liked it. They usually charge a delivery fee if your order is under $20 during lunch, but the people at my work always order from this place so they pretty much let us slide. The delivery guy is a really nice guy, and I hope to one day eat in there again now that I hope to run into Natalie G. there... just kidding. But really, I would like to actually eat at the restaurant then to be stuck in the office during lunch.", "author": "Rommel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-26", "description": "after the 'remodel' at green garden i've been there about five times in two weeks.  i generally stick to 'garden' variety Chinese when i'm at a Chinese place serving the proverbial 5 dollar lunch plate.\nTHAT being said, the Sesame Chicken is incredible.  Reminiscent of General Chicken but a touch sweeter and not spicy.  \nThe won tons and sweet and sour soup add a nice touch to the bargain.\nOh, did i mention that i everytime i leave this place i feel high?  I know a good MSG buzz when i get one and GG is currently my hook up for the good stuff.  As Dennis once said, MSG = Make Shit Good.\nPure genius.", "author": "Karl H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-29", "description": "So I tried ordering from Green Garden twice. It seems to have fairly decent reviews here so I wanted to give them a try...here's what happenned.\n\nThe first time I ordered delivery online from eat24hours.com. 20 minutes later I received a call explaining that there were no drivers tonight, and they were very sorry...um, ok...weird, but no huge deal. I was kind of annoyed but figured it was a freak accident.\n\nA week later, I felt like Chinese again, so I figured...let's give Green Garden a 2nd chance. So I placed an order online again, this time for lunch time. I was starving and really couldn't wait to eat and I was feeling fairly excited about the decision to get delivery.... Ok, so 20 minutes go by again and I receive a call from a woman saying they cannot find my address on the map??? Ok, so I explain to them the cross streets (which were in my order) and then gave her explicit directions with landmarks. The woman asks if I can pick it up...I tell her that I cannot right now, so she says she will try again to find it. Sooo 15 minutes go by...and I get another call. Guess what, she STILL can't find it on her map. I ask if they have a computer...they dont? Not sure how they can receive their online orders without one, but OK...I am kind of annoyed now and ready to review your establishment on YELP!!! \n\nOk now I feel better!", "author": "Scott V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-10", "description": "I am a fan of the wonton noodle soup, but I really only go here for lunch if the weather is bad.  Don't be suprised if they ask you to move tables to accomodate larger parties.  It happens all the time.  Sometimes it's awkward.", "author": "T-Bone L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-28", "description": "Went here for some lunch action and they have a complete lunch deal for a reasonable price.  A good menu selection of choices. So for about 7 dollars you get sweet & sour soup, hot crunchy potsticker and a good filling main dish. But only 3 stars, not superb chinese food, but definitely not putting the chinese cooking to shame.", "author": "MJ T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-22", "description": "Really good Chinese food. Cheap lunches. Good quality meat and sauces. And of course awesome techno at noon and you get a free chicken wing if you avoid the lunch rush. How could you go wrong?", "author": "Andy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-31", "description": "Update! The Wok Shop Cafe definitely has better goons. Sweet, delicious and plentiful!", "author": "Shawn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-24", "description": "Go here at least a couple of times a month for lunch.  $6.50 for awesome mongolian beef and white rice with complimentary soup and egg roll.  quick serivce, HUGE portions and good price.  also have tried the orange chicken/generals chicken type dish which was good.  mongolian beef is by far the best though.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-08", "description": "Ah a quick and easy favorite. I eat here when I don't feel like spending $10 on a salad. Food is pretty tasty, and at lunch, you get hot & sour soup and egg roll included with your main course. Order off the special lunch menu, all this tastiness can be yours for, max, $8. I particularly enjoy the basil tofu.", "author": "Madhavi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-28", "description": "Best Chinese delivery I could find after three years living in SOMA.", "author": "Zak J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-07", "description": "not really a place that i go for authentic chinese food. but definitely a place for an excellent lunch bargain! most of the rice plates i've had have been really tasty and the portions pretty huge. the most recent dish that i really enjoyed there was the eggplant with shrimp and chicken. plus they give you a bowl of soup and an eggroll, all for around 6-7 bucks. not too shabby i must say! now i just gotta find a way to stay awake for the rest of the afternoon...", "author": "Steven L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-30", "description": "A disappointment.  We ordered for the first time and had it delivered.  The food was far below average and we expected more.  There was \"mystery meat\" in the Hong Kong noodles, the orange chicken was not as good as we are used to and we didn't know they wouldn't include white rice so we had to make some.  The vegetable egg rolls turned out to be the best item we ordered but they gave us hardly any sauce for the egg rolls.  It seemed like they cut costs everywhere they could. We'll try something different next time.", "author": "Joy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-16", "description": "good food but don't get food to go here. they put it in the now banned Styrofoam containers which melt into your hot food. everyone should let them know this illegal in san francisco and could cause you cancer.", "author": "angela p."}
