{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Pleaaseeee open more than just wed-Fri 11 am to 2 pm. One of the best sashimi bowls I've ever had for one of the best prices I've ever paid. The people complaining about the price compared to other sashimi bowl places need to learn the difference between a poke bowl that needs a ton or sauce and toppings to cover up mediocre quality fish(that they end up charging the same for) and elephant sushi golden gate.\n\nTheir fish is so fresh, last time I went I saw them butchering a humongous bluefin tuna to portion out and turn into sashimi!! The rice is perfectly seasoned and warm, when you take a bite of everything alltogether it just warms your stomach and soul. \n\nMy gotos are the number 1 and number 4.#1 if I'm on a budget and #4 if I feel like ballin on a budget! For number 4 I'm used to paying 10 dollars each for the same amount of uni or monkfish liver but here you get a complete meal for the same price!\n\nDon't miss the dollop of wasabi they put in the bowl if you take it togo. You don't want to not use it at all(it's the good stuff not the green food coloring horseradish stuff) but you also don't want to take a bite and not notice you just ate a teaspoon of wasabi!", "author": "Conway W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "One of the best poke bowls I've had in the city. The quality of the fish is so tasteful and fresh. The price is decent/average but the quality goes well beyond it. Very delicious and would come back for more. \n\nCons: very limited hours-- they only open on certain days at a particular time.", "author": "Cecile .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "This is a tiny spot on the outskirts of the Tenderloin. Luckily, I was able to get a seat around 12:30pm. The place filled up completely awhile later. I already had this restaurant bookmarked before finding out it participates in Skymiles but never got around to eating here because of the extremely limited open hours and the location (which ended up not being a problem). \n\nEven though there is a Yelp checkin offer for a free miso soup, it seemed like it was complimentary for everyone. You can help yourself to cucumber spa water, and they serve a cup of tea with your meal. The service was very friendly and accommodating. The chefs were quite jovial singing along to the pop songs while preparing the food.     \n\nNUMBER FOUR SASHIMI BOWL (Ankimo, Uni, Masago, Cucumber)\nThe presentation was beautiful. Uni is definitely an acquired taste that I haven't exactly acquired yet. With an interesting combination of bitter tones and soft and slippery textures, it had a decadent flavor and was not too salty. The rice steamed with kelp was delicious, deep with flavor but not too overpowering with salt or sugar. The glowing orange roe was salty (which I heard is a sign of quality). It had a strong hint of orange zest. Everything was just so tasty. Even the tomato slices were deliciously tart and fresh. The Ankimo pâté was so delicate yet so rich in complex flavor. It was fatty, savory, and bitter adorned by a bright and spicy sauce. The tuna had a beautiful color and fine texture and flavor. Getting this sashimi bowl was definitely worthwhile.   \n\nHAMACHI NIGIRI\nThe nigiri was a bit disappointing after having the bowl. I felt the fish didn't taste as fresh and was rather bland in flavor. Then again, I probably shouldn't have waited to eat this at the end.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Pro tip: If you're serving jury duty at 400 McAllister, make your life better with a sashimi bowl at Elephant Sushi! It's only open during lunch hours.\n\nThe sashimi bowls here are seriously amazing. They used to let you build your own, but they've since removed that option.\n\nI got #1 because salmon and butterfish are my favorite items, and it was excellent, although I think I'll try to sub out the spicy scallops for something else next time. The only critique is that they overloaded the bowl with shredded cucumber, but the fish fresh and the price is very fair (~ $12) for what you get. \n\nIt's a smaller portion than a conventional chirashi bowl, but I found it filling enough.", "author": "Valerie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-24", "description": "The food was average and it wasn't as good as before. I was very disappointed with the services recently. The front desk receptionist/cashier was rude and pretty mean. I wouldn't go again and I don't recommend bringing any friend there.", "author": "James L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "The sashimi bowl from Elephant Sushi is the stuff dreams are made of. One of my colleagues picked up about a dozen sashimi bowls last week for the office, and now, I want to eat there every day. If you love sushi like me, the bowls can be a bit small, but I think it's a good value for what you get: super fresh cuts of fish and delectable rice. There's something they put in the rice that tastes like yuzu and shiso and sesame oil or some combination of that is super delicious and addictive.\n\nIt was so good that I went to the Elephant Sushi down the street from my yesterday and asked them to make an omakase version of their sashimi bowl for dinner.\n\nThis review is for the food only. I have not been to the actual restaurant, so can't comment on the ambience or service.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-19", "description": "Finally had a chance to try Elephant sushi on Golden Gate. It's the third elephant sushi in the city but is only open for lunch three days a week. I tried the number one (salmon, scallop, butterfish) sashimi bowl and the beastie boys (Uni, ankimo) and both were delicious. Portions are on the small side though.  Recommended for anyone looking for good fish near the SF Civic Center.  I wish they were open more often.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Honestly, at first glance this place may look a bit shady. I was thinking how can they survived if they are only open for lunch 3 or 4 days out of the week?!!\nThen we had their sashimi bowls and just nod our head silently. Good stuff, good stuff.\n\nThe things about sashimi bowl is not only about the precious cuts of fishes and bountiful offerings on top, It's also the sushi rice! Elephant sushi does very well on their sushi rice. The portion, the consistency, the sweetness and the acidity! I've tried the spicy trio and the number three (seared butterfish and albacore). \nThe wasabi vinaigrette they use on the number three goes amazingly with the caper and albacore. But the spicy trio takes the crown for us! \n(Maybe because we love spicy food, but the spicy mayo(?) sauce they use harmonize the fishes and scallop instead of overpowering them). \nThe sashimi bowls we ordered comes up to $14 including tax, each.\n\nThis place is a hidden gem on tenderloin area. :)", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-04", "description": "The place is quite small with a few seats. You would need to order at the counter first. The spicy trio was quite good but the portion was small. Service was very good.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Definitely the go to place to have a true experience of San Francisco. The smell of piss and human fecal matter while digesting raw fish with a side of wasabi IS a must do experience. Not to mention listening to homeless people fighting over nonsense.", "author": "Gina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-09", "description": "I tried out Elephant Sushi at Golden Gate Ave & Larkin, SF for lunch Wed 11/9/16.  Got there around 11:30am and sat down, but you just order at the counter and you can eat there or take-out.\n\nIt's a small place only about 16 seats total.  I was lucky and there was a two-top so I sat there, otherwise there was a small communal table that seats 6.  A few 4-tops too.\n\nNo more FREE Yelp Check-In miso soup, bummer.  I think miso soup was $5, I didn't get it.\n\nFREE water w/ cucumber - help yourself.  Hot tea was FREE and brought to me in a cup.\n\nI got a the Spicy Trio bowl $12.87 - It wasn't a huge bowl, enough for a worker bee in the area.  3 small amounts of fish, lots of rice, some cucumbers, 2 slices of tomato.  I added tons of the ginger to make it better.  Comes w/ a side of wasabi I only used a tiny bit.\n\nYummy bites was sweet tofu wrapped w/ rice and some scallops on top.  I liked it $6 for 2 pcs.\n\nMy total was $20.52 before tip.  Charged it.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "I had the spicy trio sushi\nbowl.  It was amazing!  Their hours are limited but the quality is unquestionable.", "author": "J B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Sashimi bowls are amazing, but we almost didn't get it cause they told us when we first placed our order that the delivery hasn't arrived today. Luckily in five minutes or so the truck appeared outside so we got what we wanted in the first place.\nEnvironment is less than ideal, the entry smells of urine and flies were flying around outside. No wonder I never noticed the place after walking by so many times.", "author": "Ying W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "Solid choice for poke in the Civic Center area (and don't forget to check in on Yelp for a free miso!). Limited seating, so go for a slightly early (11:30) or late lunch to snag a spot. Good value in terms of quantity and quality of fish for the price.", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "4.5 STARS \n\nUber driver: \"Where to?\"\nMe: \"Elephant Sushi on Golden Gate, please.\"\n\nUber driver: \"Sushi - on a rainy day?\"\nMe: \"Yes, I have raw cravings...\"\n\nUber driver: (o_O)\nMe: \"Get your mind out of the gutter, I'm talking about sashimi.\"\n\nUber driver: \"It's cold, isn't pho more appropriate?\"\nMe: \"Unless you're paying and I ain't cheap, I'm going to Elephant Sushi.\" (I was being sarcastic.)\n\nUber driver: \"Are you asking me out on a date?\"\nMe: (o_O)\n\nA-W-K-W-A-R-D uber ride aside, Elephant Sushi Golden Gate was worth trekking to the TL for during lunch. It's small with a handful of tables so it's more of a to-go place. There's also two tables outdoors so you can bring your furbaby. \n\nTHE thing to get is their BYO Sashimi Bowls: 4 items ($14), 5 items ($16), or 6 items ($18). It may seem a little pricey for lunch but it's so worth it because you get three slices of fish/seafood/avocado for every item. I received 18 slices for my 6-item Sashimi Bowl ($18): http://bit.ly/1SVV782. I choose sake sashimi (2x), hamachi, ankimo, uni, and avocado. You also get to add complimentary toppings like garlic chips, jalapeno, cucumber, etc. All the fish were incredibly fresh and silky smooth. To get more bang for your buck, I would opt out of the avocado and choose another sashimi item instead. The garlic chips are hummus chips from the Hummus Guy at the Farmer's Market (http://bit.ly/1KnNDYT). Their like crack chips and an interesting topping to add for a sashimi bowl. My only gripe was the sushi rice was too citrusy, like it was accidentally doused with lime. \n\nDon't forget to enjoy Elephant Sushi's housemade ginger in the little mason jars which is super spicy and packs a good punch. Free miso soup if you check into yelp (I didn't check in until after I left).\n\nIt's rainy again today and those raw cravings are starting to hit. Hmmm, uber time?", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "I'm obsessed with Elephant Sushi's veggie bowl. I've been having it three times a week for lunch ever since I've discovered it.\n\nStaff is very friendly too. They always greet me with a smile and with warm courtesy. \n\nI've recently brought a friend to this place, and she's now a big fan as well. Unlike me, she's tried many different dishes on the menu, and she raves about every single one of them.", "author": "Jezebel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "I honestly understand the hype with this place. Their fish is nice and fresh and portions are pretty big! After one roll I'm usually very full! This is a great place to bring company and share a few rolls. I'm not sure if it's only this location that serves their sashimi bowl but it's ADDICTIVE!! I got the number 1 which consists of salmon, spicy scallops, and escolar. I would DEFINITELY come back again and recommend this spot.", "author": "Jessie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-18", "description": "It's nice to see that Elephant Sushi at Golden Gate has existed longer than its predecessors.  It's in a little crevice in the Tenderloin, so it's easy to pass by.  But you'd be missing out on some seriously fresh fish.\n\nI ordered a build-your-own sashimi bowl with salmon, tempura shrimp, tofu inari, and seaweed salad.  It was $14, and it increases if you want to add more toppings.  I also opted for the free garlic soy sauce.\n\nI enjoyed my bowl and it was really filling.  The rice was cooked and seasoned well, and the salmon was fresh.  The tofu inari was just the skin, and the seaweed salad added a textural balance.  The tempura shrimp is smaller than what you get at other places, but it was fine for me.\n\nI ordered it to go, but if you eat inside, be prepared to be in tight quarters.  It's very small with one large table and a few smaller tables.  There is outside seating, but the smell of the Tenderloin won't do you any good.\n\nIf you really want to stretch your dollar with the sashimi bowls, order it with all fish.  I had about 4 pieces of salmon in mine.", "author": "Vira P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "Good. Simple sushi place in an unlikely location. Reasonably priced.  Check the hours/days before u go. They close often and if not enough traffic too.  \nthe sashimi bowls are very good and hardy portions.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "Had a treat by catching elephant sushi TL aka Golden Gate at the right time after voting early at city hall this weekend but apparently this was too early for them to have the seared ahi ready. The ponzu sauce still made everything right again. I had to substitute the not-ready seared ahi with snow crab meat which in comparison to their other fish options is quite lack luster. \n\nNote to self: next time get a trio of seared butterfish with ponzu sauce and that's all your mouth really need from here.", "author": "Taffany H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-14", "description": "I came at this location at 1:38 p.m. \nThe have a sign they are working from 11a.m - 2 p.m but when I came they said sorry we are close. \nI don't understand why they close earlier . Horrible service!", "author": "Tati T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "A great addition to the neighborhood. The lunch options are limited within the 2 block radius of the courthouse. The price is average for lunch, expect to spend at least $9-$14 per person, but then again it's sushi bowls, of high calibre, so what do you expect.\n\nI was honestly really surprised. I wasn't expecting anything great. I ordered one of the set sushi bowl, I think it had yellow tail, tuna and avocado. It was delicious. I was shocked at how fresh the fish was, and it didn't taste cheap at all. The sashimi was nicely seasoned, rice was cooked perfect, the right amount of sesame oil and seasoning. I did wish that the bowl was a tad bit bigger. I think next time I'll do the build my own.\n\nOn top of my bowl I ordered miso soup, which had huge pieces of shitake mushrooms, and it was perfect for a cold day in SF. I also had the real crab CA roll. Delicious as well.\n\nIt's sad that it's only open during lunch hours. It's so rare for me to be in SF for work let alone in that vicinity. I definitely hope it's here to stay!", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Fresh fish. Nothing else sounds greater. This location of Elephant Sushi is only open for lunch on the weekdays but not every day so make sure to check the hours before coming. The sashimi bowls are awesome- they start around $12 and you can get a variety of different fish in each bowl, along with rice and vegetables. I had the Number One bowl since Salmon is my favorite fish and it was delicious- salmon, spicy scallop, avocado, and butter fish. Noms. Will definitely be back.", "author": "Grace L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-24", "description": "Good sushi but overpriced for the sashimi bowls--Ive had chirashi bowls at other sushi restaurants which include more fish and more variety in the fish included, for less.", "author": "Lissette C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "The most PERFECT sashimi bowls ever.\nThe bowls start at around $12 and can go up to $20, depending on what type of fish you select.\nI opted for the salmon, spicy scallops, and truffle oil butterfish in mine - and it was delicious! The fish was super fresh and the ratio of fish: rice: truffle oil: all of the other deliciousness in the bowl was juuussstt right.\n\nCan't wait to try other sashimi bowls!!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "Man oh man this hole in the wall spot is serious! I really didn't expect much coming here. My buddy who lived in the city kept raving about this place. So we decided to go with him and behold....this magic bowl of sashimi. He ordered the Number 3 Sashimi bowl. \n\nNumber three sashimi bowl consists of seared butter fish, cubed albacore, truffle oil, capers, and fresh wasabi vinergarette. This odd combination of flavors just went perfect together. I've never seen this before and truly fell in love. I will visit this place again when I go back up to SF.\n\nRecommendation: Number Three Sashimi bowl", "author": "Andy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "4.5/5- Rounding up for great prices and the service.\nThis place is an absolutely gem and I would eat here everyday if only they were open. I've been trying to come here during their open hours and today was finally the day! The location itself is fairly small. It has 2-3 small tables inside, one large bench like table for 6+ people, and a table or two outside. This would definitely be a nice spot for a lunch by yourself on a workday or for a takeout meal. I can't say the fish quality is perfect but its decent enough for a MYO place and I love the flavors they use. The service is also really nice. I stopped by on a Thursday for around 11:30 and there were already a couple people ahead of me in line and by 12 a decently large group of people were lining up. \n\nI ordered 2 bowls and I'm glad I did because the portions are on the smaller side. If you are really hungry I'd suggest two bowls. If you are looking for a light lunch, one bowl is fine. I did one MYO 6 item sashimi bowl ($16) and a Number 3 ($12).\n\nFor my sashimi bowl I got uni, seared walu, salmon, ankimo, albacore, and hamachi. You get between 1-3 slices of each. They didn't do as much with additional flavors in the bowl since you choose your own flavors but I wanted to try the basic fish. The quality of the fish itself is decent for a MYO place. The salmon, albacore, and hamachi were average. They were all on the soft side and didn't have the crisp clean flavor of fresh fish but they were fine. The walu was a bit better though still not very flavorful. The ankimo wasn't very creamy but still retained some of its distinct flavor. The uni was the surprise. I've had a LOT of uni but something about today's uni was very different. It didn't have the typical sweet, slightly buttery taste, with the slightest bit of ocean. It was almost just buttery all the way through with the slightest bit of the uni aftertaste. I really enjoyed it and it was a sizable piece. Overall I'm being nitpicky, but in reality it's a solid bowl of food for only $18. On top of that the rice is wonderful. It was flavored very well and had the best texture. It also tasted like they used just the slightest bit of some form of citrus oil. Whatever it was, it was great. (4/5)\n\nMy second bowl was the number three which had seared walu w/ fried garlic pieces plus albacore cubes with fresh wasabi vinaigrette, truffle oil, and capers. This was an absolutely delicious combination of flavors. The fish quality was also average but the additional flavors more than make up for it. The fresh wasabi vinaigrette had such a nice bright flavor and it made the rice and fish incredible. I've had pickled wasabi before and this is like a toned down version of it. It also went really well with the truffle oil which can be metallic-y tasting but with the vinaigrette it tasted pretty nice. (4.5/5)\n\nOverall, I am extremely happy with my meal and I can't wait to come back. And as happy as I am with the fish I think I may love the rice even more, which may be a first.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "This place has the weirdest hours. It's basically open for lunch 3 days a week. I have thought for years that this place must be a front for something. But the food was so good, I can't imagine someone putting so much effort into their front when much less would suffice. \n\nAnyways, my friend and I split the chip appetizer (spicy tuna mash) and the inari stuffed with scallops. Both were excellent, though probably not super necessary since the portion in the bowls is pretty big. My bowl itself was super tasty with great tasting salmon, butterfish, and scallops. My only complaint was the avocado in the bowl was not even close to ripe.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "It's hard to picture yourself in the Ginza when you're in the middle of the Tenderloin, but somehow this closet of an operation transports me to the motherland even if only for a few moments. I've noticed this spot when I walk over to Philz or go to one of the pho shops in Little Saigon, but the foreboding metal gate was always closed. However, during the holidays, the warden let us out of our work cubicles early, so I decided to seize the day and come here. I was right. It is tiny in here with no counter and about a half dozen tables of varying sizes. Only two were occupied, so I sidled into the two-fer table next to the front entrance. I didn't know I was supposed to order at the counter, so I got up to scrutinize their menu of temptations (photo: http://bit.ly/1B9ha00).\n\nNo surprises. Lots of rolls and nigiri. Sashimi naked or in bowls. A few specials. I figured it would be a while for a return visit since they're open four hours a day during lunch and only Wednesday, Thursday and Friday. Gee, with a full staff (I counted at least six employees in there), how do they afford to make a net profit margin? Let me see those books. Anyhow, I ordered a $12 Sashimi Bowl, Number Two with ahi tuna, hamaichi and avocado (photo: http://bit.ly/15rbIdU). Really fresh tasting and they do publicize that most of their fish is wild or sustainably farmed which I guess means it didn't come from a Foster Farms for Fish bait-and-kill operation. The bowl came festooned with tomato slices and scallions with a plentiful mound of rice underneath. Before I even gorged on that, I received a cup of their Miso Soup which came in a literal coffee cup.\n\nIt was quite a standout with seaweed, green onion and shiitake mushrooms (photo: http://bit.ly/1J08Cwe). What an unusually hearty broth to get for free. You would think that would be enough to eat, but no, I also ordered the $9 Spicy Hamaichi Roll because one can never have enough yellowtail in one's life. Gee, I just realized how dirty the word 'yellowtail' sounded in that context. The roll was quite robust with avocado, jalapeno, lime, cucumber, scallion, masago (capelin roe) and toasted shimichi pepper aioli (chili sauce mayo) (photo: http://bit.ly/1yF1F0C). Oh wow, that was delicious, too, and I just noticed the house made ginger enticing me in a glass jar with tongs at the ready (photo: http://bit.ly/1yAZHg0). Hmmm, I may need to schedule a lunchtime \"medical appointment\" sometime soon.\n\nFOOD - 5 stars...ain't it a bitch that one of the best sushi places in town is only open when I'm at work? Good, fresh fish served here\nAMBIANCE - 4 stars...it's the Ginza, right?...yo, someone tell me how to get to Sibuya\nSERVICE - 4 stars...very nice and polite...this is the Tenderloin?\nTOTAL - 5 stars...a hidden closet sushi spot in the 'Loin serves fresh fish, artful rolls & homemade ginger...word", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "The serving time is very fast. The portion is just right, not too big or small. The rice is lightly seasoned, which add more flavor to the dish. The sweet vegetables balanced out the spicyness of the sashimi. Tried the free yelp check in miso soup, it's okay, but it smells a bit weird, almost like medicine. Maybe from the mushroom. Overall, it's a great place to have lunch", "author": "Elitè T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "Very, very pleasant surprise.\n\nThis was a last-minute \"Our final destination in SF is in one part of the City, and I don't really want to deal with driving to our previously discussed restaurant and dealing with parking and/or traffic so let's find something closer or more on the way to where we are going later\"... anyway.\n\nThe Sashimi bowls here are very delicious... the fish tasted quite fresh... and I kind of dug the decor.\n\nUnfortunately, they are not located in the most ideal of neighborhoods in SF, so I don't think I will end up being a regular at this place. But... if I am looking for a solid lunch spot and this is somewhere within striking distance with either my planned route or my original/final destination, I would TOTALLY come back.\n\nIf you are in the area, I would definitely give it a shot.", "author": "Victor C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "This is my favorite sushi restaurant in San Francisco! I love how you can make your own sashimi bowls and pick your toppings. The fish is really fresh and if you check in on Yelp, you get a free miso soup!\n\nI do prefer the Geary Street location over Golden Gate. The Golden Gate location is a bit hard to get to because it is right in the Tenderloin. Often, I see homeless people coming to the patio area and eating people's left overs before the servers clean those tables. Another reason I gave it 4 stars is because of their hours of operations. They are only open Weds-Fri 11-2pm. I guess that's not a big issue because I still come here really often!! \n\nHigh recommend Elephant Sushi!", "author": "Natalie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-25", "description": "The food was good - I would suggest coming here if you're already in the neighborhood -  and could have been a little cheaper. \n\nThe water has cucumbers in it - wish there was a non cucumber one. The place had nice sitting area - small and a little dark. You have to order at the counter and pick your own table. It wasn't crowded when I came for lunch.", "author": "Ron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "Second location of Elephant Sushi! I have not tried the food at the first location, however it has been one of my yelp bookmarks. Definitely excited to try Elephant Sushi regardless of the location!\n\nNewly opened for four months. Small establishment. Looks a bit obscure from outside, but inside it is modernized, chic and clean. Inside seating fits about 5-6 small tables and 2 tables outside. \n\nHas 4 different kinds of sashimi bowls. All priced at $12. You are able to customize your own sashimi bowl as well. There is a different price for your own bowl. The current 2 most popular sashimi bowls are number 1 (salmon, snow crab, avocado, \"walu butter fish\") and the spicy trio (spicy tuna, spicy scallop, spicy salmon & avocado). \n\nI order the number 1 sashimi bowl to-go and checked in on yelp to get my free miso soup! The wait time for my order was 10 minutes during lunch hour rush. Pretty reasonable time especially for this area when all the city workers swarm out for lunch. The lady who was ringing up my order was friendly, conversational and provided great customer service. She offered me a seat while I waited for my order. \n\nThe sashimi bowl was beautifully put together and fresh seafood. No imitation whatsoever. For the portion size, it is decently priced for the fresh fish.The free miso soup for checking which normally costs $3 was not from a box, but actually cooked. There were huge slices of soft mushrooms and the broth was not salty.\n\nQuick service, great customer service and an awesome new addition to this neighborhood. I'll be back to try the other sashimi bowls as well the other items the restaurant serves. This is my new lunch spot!", "author": "Kathleen U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "4.5 Stars \n\nPrice point is spot on especially for the quality of the fish and the portion that is served \n\nSpicy Trio Bowl and the Number 3 Bowl are both delicious and well worth getting. I found the balance in the #3 to work quite well. The truffle oil didn't overpower the dish as I would have thought and liked the tart pop from the capers. \n\nTuna Nachos (believe that's the name) was surprisingly hefty and can be a meal in itself. Liked the balance of textures and the subtle heat notes in the tuna \n\nThe fish have a great meaty texture and refreshing light and flavorful. Seating is extremely limited so I suggest order to go if you cant land a spot. \n\nMiso soup - the touch of mushrooms was quite pleasing however the broth was far too salty for my liking \n\nOverall Thoughts\n\nDefinitely a great spot for lunch and has intrigued me to want to try their main location to see what else they have to offer", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "To-go orders are fast and ready to go usually in just ten minutes for those who work nearby like me. It's a nice, intimate and quiet spot to sit down with one or two friends/coworkers too.\n\nThe sushi bowl selection is my favorite!! The portion seems to have shrunk a little (not necessarily a bad thing) as well as the freshness (just today), but the service and taste are almost always on point. The rice is perfect. Honestly they'd have to do quite a bit to lose my patronage... the #2 sashimi bowl absolutely hits the spot! \n\nI'm glad to have them so close to Civic Center - one visit is just not enough!! My coworkers agree that this spot is a staple and NOT TO BE MISSED.", "author": "Liz K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "Amazing, fresh, healthy, affordable & quick service, what else can you ask for?\n\nWe had the Sashimi bowl you can customize with 4 items, for only 14 dollars.\nFor me, it was: salmon, spicy scallop (not too spicy, just like I like it), seaweed salad and pickled carrots.\nFor hubby: Salmon, spicy salmon. tuna and spicy tuna.\n\nAll of that is served with delicious steamed white rice, that just got made, and more seaweed.\n\nEven the pickled ginger is homemade.\n\nStaff was friendly. \n\nOnly open 3 days a week at lunch and the place is small. So if you wanna eat there like we did (on the patio!), get there around 12!", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "I'd been meaning to visit ever since a friend of mine mentioned it to me. So on a Friday when I really needed a lunch break, I walked down Larkin to pay Elephant Sushi a visit. On the way, I passed Mr. Holmes, the Chairman, and Soul Groove. But I held out and didn't stop until I arrived at my intended destination.\n\nHaving done my research, I knew I was supposed to stride confidently up to the counter and place my order before seating myself. The spicy trio sashimi bowl sounded delicious, so that's what I went with. Bonus: free barley tea for all customers, and if you check in on the Yelp mobile app, you can get a free coffee cup of delicious miso soup, complete with fresh shiitake mushroom slices.\n\nI sat at one of the outdoor tables with my order number and quickly received my tea, soup, and wasabi, as well as the condiment tray of soy sauce and homemade pickled ginger. Ahh, that soup was simple yet well executed. I'd come back just for the soup. And the tea was comforting and familiar.\n\nThe spicy trio ($12: $4 for each of salmon, scallops, and tuna) surpassed my expectations on freshness and taste. It also came with a couple of slices of avocado and taro chips (way better than the ones at Freshroll). Some rice was hidden under the pile of fish, accented with sesame seeds, seaweed, and a light ponzu sauce. I usually eat on the fast side, but I consciously wanted to savor every bite and took my time. The waitstaff who took my order stopped by and asked how everything was. I expressed my satisfaction and asked for a refill on the tea, which she happily poured after a few moments' wait.\n\nThe verdict: I'm gonna need to come by again. #Treatyoself and take a real lunch break here. I think I'll try the poke ($14) next time.", "author": "Tiff T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "Super good. I stopped by on a lunch break maybe 40 minutes before closing time and they were out of a lot of items, but the lady at the cashier helpfully pointed out what was available on the menu and one of the sushi chefs offered to make a sashimi bowl for me on spinach since they were out of rice. \n\nI opted for the sashimi salad I believe is what it was called (it was right under the poke on the menu), and it did not disappoint. Beautiful presentation, fresh fish, and a solid portion. The orange slices added a great touch of juicy sweetness here and there. Plenty of nice big chunks of ahi tuna and salmon, I couldn't finish it all in one sitting. As I was eating one of the waiters also stopped by with a plate of two pieces of fish, I don't recall seeing it as included in my meal and I think maybe they felt bad for being out of a lot of things (I had expressed my desire for something with rice since I was so hungry) and wanted to make it up to me. Either way, it was delicious, some time of fully cooked fish that was very tasty. I appreciated it. You also get free tea with your meal!\n\nIt's a great little sushi restaurant with a good ambience for a nice lunch break or catching up with friends. I'll be back.", "author": "Rachel W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "One of the best sushi lunch I've had in San Francisco in a long time! \nSmall cute little place with friendly Japanese staff \nMy lunch came out fast and was delicious\nI ordered a triple spicy sashimi bowl yummy \nI look forward to going back to elephant sushi soon!", "author": "Victor R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Had the most amazing Sashimi bowl ever! It was their spicy trio bowl and hands down was the best I've ever had. All fresh and great quality ingredients, their homemade ginger is a must try on the table.\n\nBest time to go is right at 11 to ensure a seat, other than that you might have to wait a bit but everyone is really good about enjoying their meal and taking the right amount of time so others can share the joy of sitting down and enjoying this amazing meal. Be back soon!", "author": "Jeremiah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "The sushi bowl is soooo fresh and delicious. Even the rice at the bottom tastes fishy.", "author": "Ester W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "Ate here today for lunch at about 11:20 am on a Friday and we were only ones there for awhile, which was great.  They were making to go orders, tho, so our food took a little while to come to our table, not a long wait at all.\n\nI ordered the number three sashimi bowl, which consists of seared butter fish, cubed albacore, truffle oil, capers, and fresh wasabi vinergarette.  It sounds odd and I was so worried I ordered incorrectly, but my first bite, and I was all \"I want to marry this dish\". Loved it!!!\n\nMy son ordered the number two bowl, which was tuna and the most pricey and he liked it a lot but felt it wasn't anything special.", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "This is where I get my weekly treat of yummy sushi bowls. Quick and tasty food,  nice and friendly people. Keep up the good work, guys .", "author": "Sunny H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-21", "description": "I'm just extremely annoyed at how unprofessional these people are. \n\nI've been here two times. The first time I came here, I walked in about 10:20 and they said they weren't open yet. They said that they open at 10:30, even though it says they open at 10am on the yelp page. Even so, I waited until they opened. I got a customized sashimi bowl which was decent.\n\nI came back yesterday hoping to get take out to bring to work as my lunch. I came here 10:15am and AGAIN, they said they were gonna open \"soon\" at 10:30am. Again, I waited in my car and I came back in at 10:30am. When I walked in, the workers started kind of giggling and semi-laughing that I came back right at 10:30. The waitress said they were gonna open in a \"few minutes\"... which she quoted 10-15 minutes (which is not a few minutes) because \"there was something wrong with the thing.\" There was nothing wrong with anything. They probably couldn't wake up early enough to come to work and prepare everything on time for opening. Completely unprofessional.\n\nI hate posting bad reviews, especially for this reason. But I'm mainly mad because I could've gone to a different restaurant to get lunch instead of wasting my time waiting when she first said that they open at 10:30am. I had work at 11am, and I couldn't wait another 15 minutes or even go to a different place to get lunch.\n\nPlease change the opening time to 11am since your workers can never be prepared enough to open at 10, yet alone 10:30am. And so people don't waste their time coming to your open yet unopened restaurant.", "author": "Derek T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-21", "description": "Decor: 3/5\n-tiny dining area, seats 14 inside and 6 outside\n\nService: 2/5\n-i asked if there were any cooked rolls and was told that everything was raw fish. Well that was a lie as they have shrimp tempura. \n-I understand this place is busy, the food (4 rolls) took over 40 minutes to get the first roll and over 50 mins to get the last\n-they ran out of sushi rice and ended up refunding us in cash\n\nFood: 3.5/5\n-Darn, they rang out of miso soup today and sushi rice (on a Thursday)\n-decent menu selection however nothing stood out to me as unique\n-I ordered the Red Dragon and Alaskan Roll. Both had generous portions of protein though the ratings had my expectations high and both rolls did not reach those expectations of 'wow this is great sushi'", "author": "P H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "Have been here many times. The sashimi bowl is unbelievable! Best in the city. Spicy Trio is what I always go for.", "author": "Yibang C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "Damn, really good. I usually go for the 3 or 4 item and get Uni, Ahi Tuna, Spicy Tuna, and Ankimo. Sometimes they don't have Ankimo or Uni, but its all good as I'll just double up on the spicy tuna (yes it's that good). \n\nToo bad it's only open like 9 hours a week. I haven't been to their main location, but am grateful for them having this convenient location open 3 days a week near Hastings. \n\nTo sum, great place for a treatyoself sushi weekday lunch. Not much like this in the TL which mainly consists of Sandwich shops, Mexican, Vietnamese, and Thai Food.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-11", "description": "It was stormaggedon today so there was no line at Elephant Sushi!! :D \n\nI checked in for the miso soup and warmed up with a hot cup of tea. The double albacore roll hit the spot and was the perfect balance to the hot soup and tea. \n\nEverything about Elephant Sushi on Golden Gate is lovely from the ambiance to the food to the service. The only improvement I can see is with the rice. Sometimes I get a pebbly bite. \n\nThank you, Elephant Sushi, for making our neighborhood so cool with fun, tasty options.", "author": "Jacquee P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "Oh good lawdy SOMEBODY up there has heard my prayers! decent sushi in the 'loin, F I N A L L Y ! I don't have to eat shitty Sushi Hana or overpriced disgusting 2g for lunch anymore. \n\nKathleen U. put Elephant Sushi on my radar. Some days I just want sushi rice and sashimi, seriously. \nThis spot is tiny, so I would recommend dining solo or with one friend.. maybe just do takeout. \n\nI had a sashimi bowl to go. I can't recall the number it was on the menu (they only have 3) but I had the one with salmon, snow crab, and walu. TASTY!!! and not to mention fresh. Loved the avocado, green onion and fried onion bits they include in there. Who would've thunk to put that fried onion stuff in sashimi bowls!? Yum. \n\nNeed to come back for more.. I wish they weren't closed on Tuesdays because the last time I had a craving on a Tuesday, I was let down.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-17", "description": "This was great! Had been meaning to try it for a while and finally caught them during their open hours. Called ahead and picked it up 10 minutes later. Salmon bowl no.1 was excellent and the butter fish was a spectacular surprise! Preferred it over the Spicy Trio bowl. Tad expensive for the rice to fish ratio, but would come back and recommend. Great Japanese option for the area.\n\n\nEdited: updated menu photos attached! Still delicious!", "author": "Diana W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "it is the best Japanese restaurant i have ever had.  They only open for dinner and few nights a week.  They don't take phone reservation.   first come first serve.  we arrived 6:30pm and waited for a table for 45mins.  people came after us had to wait 2 hours.\nNo takeout allowed", "author": "Alice L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-27", "description": "My only 2 issues were that the portions were a little low for the price and the area it was in. I know there is hard to find real estate around SF, but it was pretty tight with less than 15 people seating inside.\n\nOverall, sushi is pretty good, but the need to expand the menu a bit to make the price worth it.", "author": "Ian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "Hi Chef Tamar, can you open up a place closer to FiDi/Soma please? lol\n\nI have been waiting to try this place ever since it opened but due to it being open only like 3 days of the week and out of those 3 days for only like 4 hours, it makes it rather difficult for a girl working all the way in SOMA. Today however I had a doctor's appointment in the area and it make a point to stop in. This essence of this place is like what you would expect. Its small but yet has a hip and modern touch to it. Simple but elegant. I thought the tables with the ginger and soy sauce bottles were a really nice touch but maybe its the mason jars that called out to my southern roots. \n\nRegardless, the food was the bomb.com. If you check in on yelp, you get a free miso soup so of course I got a miso soup. I have much appreciation for miso soup that isn't stuffed iwth tofu. This one was unique in that there were plenty of seaweed AND mushrooms. That's right shitake mushrooms people. Usually you get like what 5 pieces of the smallest bits of tofu possible and then like 4 pieces of seaweed? This soup was packed with taste and mushrooms and seaweed. I believe regular price is like $3? but it was well worth it. \n\nFor the main dish, i got the sashimi bowl but pick your own 4 items. I got the salmon, uni, butter fish, and hamachi and subbed out rice for salad. For $14, this was a seal. You get like 4 or 5 pieces of each item and they were not these small little cuts either, they were of good size and well worth that $14. Best chirashi ever if you ask me. Very fresh as well. \n\nFinally they make their own ginger which was needless to say very fresh and delicious. I will be coming back hopefully sometime soon or hitting up the restaurant in Russian Hill.", "author": "Tao Tao W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "Amazing lunch!! Spicy Trio sashimi bowl was soo good - spicy tuna, spicy scallop, spicy salmon, and avocado. Generous portion.\n\nSpicy Hamachi roll - love all the fixins in this one (like the avocado, jalapeno, lime, toasted shichimi pepper aioli).\n\nTheir Uni is always good. So glad this location is just as good as Hyde St! New lunch spot!\n\nAmbiance: fun, casual, great vibe from the staff! Much love.", "author": "Anh D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-23", "description": "My meal of more traditional sushi and sashimi was excellent. I'm a guy who doesn't stray too far from standard sushi first, because it's easier to judge against other standard sushi offerings and second, because, in my opinion, it tastes better.\n\nSuch was the case this night at Elephant Sushi. Once we got past a group of entitled hipsters who attempted to push their way in front of us as the restaurant opened, the experience was quite pleasant.\n\nI had the Sea Trout and Hamachi Sashimi, along with a Tuna Roll. My dining companions ventured into the fancy speciality rolls with fruit, etc. and were disappointed. When I tried one of their pieces, I was too.\n\nI'll be back, but I encourage everyone to enjoy expertly prepared, extremely fresh traditional sushi at Elephant Sushi. Leave the fancy Rocket Dragon Hot Wheel Grateful Dead rolls to those without sophisticated palettes.", "author": "Scott P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "Didn't go into work, so I wanted to try a place I haven't been to before and not likely come to on a work day.\n\nWanted to try Elephant Sushi for a while, however their Hyde location doesn't open for lunch, this one does - ONLY WED, THUR, and FRI from 10am-2pm.\n\nWalk up to the tiny counter to order before sitting.  I had the spicy trio bowl and spicy hamachi roll...all very fresh and delicious; their portions were substantial too.\n\nCan't wait to return...", "author": "Leland H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-19", "description": "Not a real sushi restaurant!  They basically take leftover sashimi (or just lower grade sashimi) and throw it on top of some other stuff to make a bowl of crap.  Don't bother eating here - walk to a real sushi place and you'll be happier for it.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "3.5 stars on the food.. extra 1/2 star because this place stands out in a sea of \"MEH\" in the Tenderloin/Civic Center area.\n\nHad the Triple Spicy Bowl and I'm a major fan.  $12 is somewhat cheap now when comparing to other nearby places for decent food outside of the usual ethnic eats around this general area during work.  My friend also ordered their version of 'chips and dip' which consists of fried wontons walloped which decent sized scoops of spicy tuna.  LOVE.\n\nIt was even more entertaining when I saw the sushi chef behind the bar take out a super large full-size tuna from a travel container and start prepping it.  \n\nPrices are reasonable, adequate seating if you swing by early enough before 12 noon, and the staff are really accomodating and nice.  \n\nI'm definitely swinging by here again for lunch!  I want to try more items from their menu!", "author": "Nancy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "Kinda sketch locay, but trusted the reviews and glad I did.\n\nWasn't very impressed with the front of the house as the ladies were a little snarky and off-putting. However, the kitchen was great and the fish was fresh. I am not usually a fan of rice bowls but I loved it and will be back.  \n\nNigiri is sliced generously, btw.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "Really enjoyed lunch today! Had way too much... The yummy pockets were a perfect flavor combo as was the pesto salmon nigiri. We also had the ya man roll which I loved but my bf found it too garlicky for his taste and we had the double albacore roll. We tried one of the sashimi bowls which as others have mentioned is a generous portion. The walu butterfish was the best in ours.\n\nThe hours are still quite strange...only W-F 10am-2pm but they seem to be doing well!", "author": "Becca W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-12", "description": "On a mission to try new places instead of continuously returning to the old, safe, and  conveniently close ones, I decided to walk the extra ten minutes to Elephant Sushi last week for lunch. So glad I did!\n\nYou walk in and order at the register - time saver, great for the lunch hour. The place is itty bitty - a few tables for two inside, one communal table with 6 seats, and a couple tables on the sidewalk.\n\nThe bowls seem to be really popular, but I ordered roles (see pics). They were perfect! Fresh, great seaweed (which makes or breaks it for me), and they didn't skimp at ALL on the fish and inundate me with rice - they're very generous. They make the soy sauce in house, and it's low sodium. I usually skip soy sauce, but this was so good that I couldn't resist.\n\nIt was a TAD more expensive than some places, but not bad. For three roles and a seaweed salad, I paid $25. And a free cup of green tea!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-01", "description": "The Chirashi bowl was ok. A little bit expensive (as almost anything in San Francisco). I was a little bit bothered by the music that was louder than I think it should be for lunch time.\n\nOther than that, \"OK\" is the best description. Not the worse, not the best.", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "The sushi bowls are delicious.  The rice is perfect, the accompaniments are thoughtful and a notch above ordinary (e.g. house pickled ginger), the miso soup and green tea are similarly top notch, and the fish I had (ahi) was perfect. I wish the Golden Gate branch stayed open until 2:30.", "author": "Laurel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-31", "description": "Cute little neighbor sushi joint. Definitely opt for the make your own sashimi bowl option -- it's super worth it! I get the 6 items for $18 and line it all up with a variety of raw fish. Hits the spot!", "author": "Ellen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "Best sushi I had in SF so far. The quality will be worth the slightly more expensive price. I always get the \"Make your own bowl\" with 6 items. Less than $20, and a large quantity!", "author": "Do P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "Oh man, we yelped sushi and this was the closest place to us. Looked through pics and yep it was amazing! We had the red dragon roll, white dragon roll and a cali roll. My fav was the white dragon roll, oh my I wish I can go back today LOL Try this place out, they have amazing food, tea and great customer service!", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "The freshest fish with huge portions. I especially love the sashimi bowls with salmon and uni. The chefs are so friendly as well!", "author": "Nicola L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "Absolutely fantastic! Highly recommend going here! Very fair price for the amount of food you get with the sashimi bowl and it's delicious.", "author": "Heather B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "This place was fantastic and a lovely surprise. My bowl (#1) was amaaaaazing and the fish was so fresh and of the most amazing quality", "author": "Mia F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "Great place for lunch while on jury duty. IF you can get a seat. Fairly tiny place but there were only a few people in line so I decided to try my luck. Compared to the 1-2 HOUR wait I've endured at Elephant Sushi on Hyde, this was definitely worth it. Delicious sashimi bowls with yummy sushi rice (not many places have a butterfish option!). Convenient to the courthouse and Hastings.", "author": "N G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "We had a large party AND was in a rush. We all tend to take too long so we ordered a few deluxe platters of nigiri and rolls for the table.\n\nPerhaps it was the communal nature of so many platters of fresh sushi at the table but  we devoured round one. When the waiter asked if we wanted to order something different we could not imagine anything being better so we just repeated the order. I don't know the exact names of what we ordered but we left it up to the chef. Good choice and I highly recommend that option.\n\nService excellent and low key. Planning another lunch for our group there soon!", "author": "Dani K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "They've only been open for 2 days, but it's clear they know what they're doing. Great service, thoughtful decor, and most importantly, the food is delicious. Plus, my sashimi bowl was expertly packed for takeout (no spillage of the miso soup even though I had multiple blocks to walk).  Speaking of the miso soup, it's delicious and freshmade each morning. If you like umami flavors and shitake mushrooms, the soup will knock your socks off!\n\nOnly open 10-2 for the lunch crowd (hopefully they'll stay open later at some point down the road but I love that they're focusing on getting lunch right first). Also, for now, they are BOYB!", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-16", "description": "I've submitted my previous review as a one star because I've been to this place a few times and it was always closed, even though the opening hours indicated it was open.\n\nNow, I've managed to try it during an open time and I loved everything about it. So, changing 1 star to 5 stars! Nice place!!! SoMa meets Tokyo! Love it!", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "Great sushi and I love their sushi bowls. It is located  in the Tenderloin and near all the government agencies. I find this place to be a great place for lunch. Their hours of operation are not that great though. Definitely come and check this place out if if you are in the area", "author": "Foodie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "So wonderful place. Unbelievers food, so tasty!  Thx for them from the Russian customers", "author": "Sergei S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "This is a secret, keep it to yourself.  This is a great place for lunch.  What more can one ask for, fresh sashimi, very healthy, real seaweed, and comes in a bowl.  The inside atmosphere does not reflect the outside environment.  Had the spicy bowl that was not spicy at all.  Loved the scallops and the tuna.  Any time I get fresh ripe avocado, I'm in heaven.  Simplicity, uncomplicated, and very fancy napkin, with cucumber water!  How Zen!", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Absolutely incredible value for lunch. Blown away by the freshness and quality of the food. Tiny place, only open odd lunch hours, but totally worth the trip to check out. My favorite sushi place in San Francisco without spending an arm and a leg. Will be back (soon)!", "author": "Ian S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-31", "description": "The food was just ok. The menu is very small and limited. The sushi rolls are pretty small and the rice was hard and didn't taste fresh at all. I'm pretty sure they didn't even have California roll on the menu....The sashimi bowls are good, but if you don't eat raw fish do not come here because other than miso soup, everything else is served raw.", "author": "Jannet H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "I tried number 4. It is pretty good. The uni is very fresh. Will try sushi next time.", "author": "Levin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-11", "description": "4 stars for taste, 3 stars for price. finally made it here (this place is open at very few hours). got the spicy trio bowl - taste was good, but pretty small portion for $14. they gave me literally, at best, one tablespoon of the spicy tuna in my bowl. wtf. i could get a huge poke bowl (double the portion) for the same price and quality at the poke bar inside the market on market and 10th.", "author": "Ai N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "4 stars for food. Pretty good- I had A 3 spicy sashimi bowl of some type. Not hunks of fish. but chopped up in a spicy dressing on bed of rice- tasty nonetheless. I thought It was  small portion for a lunchtime $14. Also, disappointed i couldn't use my free miso soup coupon. They didn't have any! It was just after 12 so I'm not sure of the reason, They weren't particularly friendly or informative.", "author": "Frank S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-19", "description": "I love this place. Walkable from the office. Super fresh fish, ingredients. And oh the RICE. You really get it when they say sushi is all about the rice.", "author": "Tian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "This is my go-to sushi place near work. I go at least every other week. I'm waiting for them to open up a location near my house. Nuff said.", "author": "Linda Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Sashimi bowls at a good price. They are delicious. Only bad part about this restaurant is that it has ridiculous hours.", "author": "Silver T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Wow great lunch! Got the sushi bowl and it was full of deliciousness. The miso soup was stuffed with mushrooms.  Great lunch spot!", "author": "Yana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "After having dinner at there location on Hyde street I had to write them a great yelp review because not only was the food outstanding but the service was great as well! I jump on yelp and what do i find, they have a second location open for lunch which is less then 5 minutes away from my office...... SCORE!!!!!!! Have been to the lunch location on several occasions and it has not disappointed one bit. The fish is as fresh as you can possibly imagine. For a sushi lover I can not think of a better that I have EVER had fish that was as fresh as it is at either of these two locations. HIGHLY HIGHLY recommend either of there locations for anyone who loves sashimi or raw fish.", "author": "Dmitriy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "My favorite lunch spot in Civic Center! I always get their Spicy Trio sashimi bowl ($12) and add some of their homemade ginger. What a treat! Be prepared to wait or take your food to go, as the place is tiny and fills up quickly around 12pm.", "author": "Molly P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "Best sashimi bowl I've ever had. Spicy trio is my favorite", "author": "Regina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "Some of my favorite sushi in SF hands down. So FRESH and so delicious. It's a tiny little spot with communal tables and benches inside and a clean bathroom. There's some outside seating as well. I've tried a variety of their roles here and the only one that I really enjoy is their salmon one (I forget the name but it's pretty popular and there is a picture of it on their wall). Highly recommend that. Their miso soup is also good (even though it's pretty hard to mess that up!). I'll be back here for the salmon for sure and I do recommend it as a lunch stop.", "author": "Isabel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-02", "description": "Hidden gem in the Tenderloin! I ordered the sashimi trio bowl and it was so fresh ! I work down the street so I definitely plan on returning.", "author": "Susana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "Holy mother of Buddah! San Francisco's best kept secret. This place is tiny and seating is very limited - standing is very limited too!  If you can make up your mind quickly, that will help you when you get up to the counter. The sashimi bowls are so fresh and assembled to perfection. The staff are quite pleasant and very helpful if you have questions. They have some crazy hours but seriously, do not miss this little spot when you are in SF!", "author": "L S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "Elephant sushi is literally the best. It's not crowded with fried vegetables or any other shenanigans. I got a sashimi bowl with tuna, salmon, albacore and yellowtail. The fish was so fresh and perfectly sized. All the bowls come on a bed of rice with cucumbers sesame seeds, and tomato.", "author": "Kate D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "Great, hidden sushi spot that's only opened Wed- Friday for lunch! I was fortunate enough to try this place. The only thing you really need to get is the TRUFFLE WHITE FISH.", "author": "Joyce M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "Wow! I did not know of Elephant Sushi from their other location. Wonderful that they opened in the Tenderloin. They are not associated with the restaurant formerly there, which was affected by a fire next door. (That place was not bad, but it wasn't at this level.)\n\nFresh fish, generous portions, nice decor, friendly staff. This is not a \"good for this neighborhood\" review. It's good. Period. Even in an upscale area, this would be competitive -- better than most.\n\nI had the bowl with four items. Avocado, uni, ankimo, and hamachi. Just great.\n\nThey pickle their own ginger and make their own shoyu (soy sauce).\n\nDefinitely a great new spot I will be patronizing.\n\nAn update. I have been back numerous times. This place is unbelievably good. It's so good, I don't know how they make money. The quality and the quantity is so much.\n\nPS But be warned. This is not a criticism of Elephant Sushi. It's more a public service announcement. Butterfish aka walu aka escolar aka super white tuna is a dangerous fish. Not just raw, but more generally. You can look it up. The little bit they give you as a starter is fine. It tastes fantastic and it likely won't cause problems. And this isn't specific to this restaurant. I'm just letting you know from the most unpleasant personal experience that butterfish should be avoided in quantities of more than six ounces. (I'd stay away from more than two pieces of sashimi or nigiri.)", "author": "Frank W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "Don't even know where to start... this place was on my list for a very long time... finally made it!  And it was TOTALLY worth the wait.  As other suggested... we arrived at 5:30 on a Friday with no reservation. Were the 2nd couple through the door and seated immediately.  One of the BEST meals in SF - regardless of cuisine.  My top spot right now!", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "My default place for getting sushi takeout. The venue is small so sitting in is not pleasant. Sashimi bowl #1-4 are the best for lunch.", "author": "Jamie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "Nice small sushi store, opens only during lunch MON-FRI. The staff are polite. I got the sashimi bowl with 6 choices. The sashimi pieces for the sashimi bowl were a bit thin but considering the price it's not too bad. Comes with seaweed, small blob of sushi rice. The ginger slices were nice, not overly sour. You also get free MISO soup with Yelp check-in!", "author": "Lianne M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "I ordered the Spicy Trio Sashimi Bowl: spicy tuna, spicy scallop, spicy salmon, and avocado.  I added on Butterfish and it was delicious! Very large portions and reasonable pricing.  The complimentary butterfish sample, and the miso soup were also excellent (definitely NOT from a box).  I like this location just as much as the original on Hyde.  And the manager is a doll, love her hat!", "author": "Hannah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "I had the lunch sashimi bowl with four items. The tuna, salmon, and butterfish were very tender and fresh. It was truly delicious and the staff was very friendly. \n\nThe pricing was quite reasonable for sushi in the city.\n\nThis place is a true gem in a somewhat questionable neighborhood, but it was worth the walk through the 'Loin -- I will definitely go back.", "author": "William D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "Yum! Fresh and clean tasting. I'm so tired of mediocre sushi and this place has renewed my love for Japanese food. I loved sashimi bowl #1.", "author": "Marcia O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "LOVE LOVE LOVE this place!!!!!! The sashimi bowl ROCKS!!!! They have 3 set sashimi bowls but also let the customers customize their own favorite items at $14 for 4items sashimi bowl($16 for 5 & $18 for 6). The sashimi is fresh and decent and the variety is unbelievable! They even have uni and ankimo those expensive items on the list! OMG, I better keep this secret gem be hidden so it won't be packed pretty soon......", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "One of my favorite sushi places in the city and a great date spot. Get a reservation and don't bring a group, but once you're in the staff in great and the fish is very fresh and delicious.\nYou won't be disappointed with the sashimi and the rolls are creative without being covered in mayo or unagi sauce (not that I don't have a craving now an then for junk sushi).\nGreat area to take a walk around after dinner and grab some soft serve nearby.", "author": "George P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-11", "description": "Food was great and fresh.  Got the chips and dip which i highly recommend!  It was amazing!! Loved the spicy tuna with the chips.  I also had the white dragon roll which I loved.  When you check in you get a free miso soup.  I tried some of my friends white out rolls which was also awesome.  Everything was so filling. They thought my other friend accidentally ordered shrimp tempura, which she hadn't since she's allergic, but they ended up making a roll out of it and giving it to us for free.  This isn't in the greatest part of town.  It smells like urine outside and then happen to look out as someone was urinating on the street to add to the stench.  All the signs on their doors, website, and yelp say they open at 10am.  We got there right at 10am to beat any rush and get a table so it wasn't busy but they told us it doesn't open till 10:30am!!  Was annoyed at this and asked them to change their signs and website but said they wouldn't.  Not great professionalism to me.  Beware, you may have to wait in the dirty TL till they open or walk around the lovely neighborhood :\\", "author": "Emily F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "The mornings with their their fresh miso soups are truly mornings, and mornings are great since a few days back.\nA new joint eh? why not try it out? \nand now I am hooked and blame these guys  :)\nthough I have not tried out anything else but thins weekend that will change.\nsee you guys there..", "author": "Caroline G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "The sushi bowls are a cool concept.  Not cheap, but definitely a great place for the area.  Weird hours though.", "author": "Max P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "Amazing!!! I have had the Spicy Trio sashimi bowl twice... Great service and amazing sushi.", "author": "Heather E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "Walked in and was immediately given the menu rundown, including most popular and recommended choices. Was also greeted with a free sample of some delicious white fish as we were ordering. House made ginger and house made low sodium soy sauce at the table. Got the sashimi bowl with hamachi. Highly recommend it. Eat here if you want sushi!!!!!!!!!!", "author": "Bryan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-05", "description": "Good, non-traditional sushi. Innovative flavor combos that mostly work.", "author": "Jeremy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-23", "description": "This place is a hidden gem! Great, friendly service. Their sashimi bowls are amazing. They come with a sizable portion of rice, fresh tomatoes and a lot of seaweed. Surprisingly very filling. Fresh, quality sushi and their house made ginger is delicious. A great place for lunch.", "author": "Jessica D."}
