{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "Sandwiches are good and decent. They have cute names, good taste, great size. Been coming here multiple times. Sometimes my boyfriend and I split one sandwich if we're trying to penny pinch and not be gut bombing. \n\nWhy 4 out of 5? Their service sometimes takes like years for a sandwich to get made (like over 30 minutes) when there is not a huge line. But does this keep me from coming back? No. :)", "author": "Josie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-12", "description": "Eleven O One. Oh, that's the address. I get it. I've actually been here before when I bought one of their rotisserie chickens whole during my more gluttonous days (photo: http://bit.ly/2JCTUoU). I still like rotisserie chicken, but I don't devour whole ones anymore. I came back here as I was strolling on Polk in the evening and noticed they still have the chicken. It looked like they expanded their sandwich and salad menu considerably since my last visit (photo: http://bit.ly/2t4QgsY). Otherwise it was still the same dark corner spot it was before with the tables crowded together and the occasional vagrant or persistent clubbers sauntering in to use the facilities.\n\nI was seriously going to order the $9.49 Kale Salad, but I looked up and saw the $11.99 Half Chicken & Half Salad featured. Ah, my memory of the rotisserie chicken must have kicked in because that's what I ordered. It was a hefty serving of food as the relatively decent house salad came on its own plate with mixed greens, tomato slices, red onion buried by a load of croutons with a balsamic dressing on the side (photo: http://bit.ly/2JDW9Is). On the other plate laid the half rotisserie chicken which definitely looked good (photo: http://bit.ly/2HLlKK1). Too bad the breast meat was a bit dried out, but the leg and especially the thigh maintained their juiciness. Gluttony kept in check.\n\nFOOD - 3 stars...middling as rotisserie chickens go if Costco has the gold standard\nAMBIANCE - 2.5 stars...feels more like a tavern than a cafe\nSERVICE - 3.5 stars...manager was very friendly\nTOTAL - 3 stars...I can still satisfy that rotisserie hankering", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "I used to be a fan of Eleven O One. To be honest, I stopped eating here months ago after I saw the person prepping food stuff a large piece of chicken into his mouth. It was not a tiny piece either. It was enough to get chicken on his beard, which I saw as I approached the counter to order. I was so disgusted by this that I changed my mind about ordering and never came back. \n\nI used to work in the food industry, so I've been food safety certified. I also used to prep meals in large industrial kitchens for donations, so I have plenty of food experience. It's okay to taste food, but you can't eat a healthy serving from the same counter you're prepping the food. That is just disgusting! If you really want a taste, you put it on a plate and eat it somewhere else. Otherwise, you can contaminate the other ingredients if food or saliva falls out of your mouth while eating. How many of us have spilled food? It's very easy to do. \n\nI've also seen non-service animals enter the restaurant and seen the food prep people pet the animals and just place gloves over their hands without washing them. Again, food safety violation!\n\nThis makes me sad because I was a big fan of the steak salad. Oh well, I'd rather avoid an eatery if it also means avoiding potential illness.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Delicious chicken Teriyaki sandwich! It was fresh, hot and tasty! I'll be back for sure! Sandwiches are priced moderately for San Francisco at $10 each.", "author": "Lisa F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "How the cops haven't swarmed this joint and arrested this owner yet is beyond me. It's so obvious that there's a vibrant narcotics operation being run out of this storefront. How do I know? Because dat chicken is CRACK! Anyone selling chicken this addictive must be running afoul of the law, right? \n\nThe menu in this joint is broad, and seems focused mostly on sandwiches and wraps. That's cool. Never tried 'em. I came for the small corner of the menu focused on moist, herb-laden rotisserie chicken, and it did not disappoint. One bit. The half-chicken and caesar salad combo is pretty much perfect for my keto diet. And it satisfies even a big dude like myself. \n\nIf you're a fan of the rotisserie chicken like me, Eleven O One should be on your short list.", "author": "Don B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-01", "description": "I really like the food here. Always fresh and yummy. \n\nBUT..... Recently I was looking to order online through a delivery app and noticed all the food here was marked up by 3-5$ on every item. I mean the salad was 14$ on this delivery site, and when you go inside the restaurant it is 9-10$ for that same salad. That's not good business. It kinds of turns me away when I see a business do that. Consistency is very important to me. Especially when I am spending my money here for lunch every day. When I asked an employee about the price difference, he told me it was so the delivery driver can make extra money. Here I am, being taken for a fool over an over priced salad. \n\nMy lesson here is, while the food is good you are going to love it. Don't order online. You are going to be punished by having to pay extra for your food. Do your research before just ordering, you may very well be disappointed.", "author": "Kat D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "If you want a made-well sandwich where they care if it's fresh food and tastes great - this is your place. The sweet potato fries rocked and the unholy matrimony was mouth watering.", "author": "Blake J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-31", "description": "How to have fun while under 21 in 2013:\n1. Decide to meet friend here for dinner before a show at The Fillmore\n2. Eye size of the sandwiches and hastily discuss splitting a sandwich\n3. Force friend to order: \"Hey, um, could we get a Love Affair?\"\n4. Mercilessly tease friend by quoting her in a Facebook check-in, because people actually checked into places in 2013\n5. Adamantly refuse to pay adult fare on MUNI for a three-minute-long ride on the 38\n6. Walk a mile to The Fillmore while toting large sandwich\n7. Shamelessly eat incredibly messy sandwich while sitting on the ground in line, ignoring looks of other concertgoers\n\nAh, the wonders of youth. I have mixed feelings about investing so much time and energy into scoring a front row spot at a concert these days, but the Love Affair is still as good as it was before. Chicken, Havarti cheese, honey mustard, BBQ sauce, and honey -- what a sinful match made in heaven. Get this if the Ménage à Trois is your go-to at Ike's because it's just as messily delicious. (And who doesn't love a sandwich with an awkwardly sexual name?)", "author": "Amy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-18", "description": "Eaten here serval times, but the services has taken a dive. Last two orders were wrong, and on the last one the guy Jason was admit that I had never ordered the combo with a kale salad: I've done it 5 times and been up charged a dollar each time, what is fine. But don't argue with me saying I have never done that and served me this and refuse to take it back or correct the situation. I don't mind people getting the order wrong mistakes happen. But being rude and not fixing the service is lame. Booo", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "My husband got the \"Cowboy Melt\" -- again. \n\nMy son got the \"Cowboy Melt.\" As a 16-year-old, he rarely comments on food, not even home-cooked meals, much less a store-bought sandwich. After we returned home, just before bed, he said, \"I was born to eat that sandwich.\" That's quite a testimonial.\n\nI got the \"Blue Plate\" -- again. A-Mazing!", "author": "Susan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Just dropped by after seeing this place on the corner. Staff was extremely nice and helpful, refreshing to have attentive service even at a counter service restaurant:l. Soothing chicken wrap is great with some spice from the jalapeños, and onion rings are crispy and delicious!", "author": "Wyatt K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-03", "description": "Got here at 145. They close at 2. They were out of bread and started kicking people out.\n\nWaiter named Benjamin started putting up chairs while people were still eating.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-28", "description": "Why be open if you can't take orders. Happens all the time. Officially done. Just like bite. It's really not that good.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Had a Greek salad and carrot cake both were the bomb  staff is friendly! Definitely recommend stoping by for a bite", "author": "Zenzi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "I came here with a friend for a quick bite to eat before a show at the Regency Ballroom. We both ordered the Love Affair sandwich on Dutch Crunch with everything, and it was bomb. BBQ sauce was sweet without being overpowering, though I wish the bread were toasted. The cashier was very friendly and offered us tap water along with the drinks we ordered.\n\nNote that the bathroom is behind the counter, and it's much cleaner than other restaurants, even higher-end ones. Highly recommend coming here to eat before heading to the Regency for concerts--it's close enough to be a quick walk away, but far enough away that you aren't dealing with everyone else who's eating pre-show.", "author": "Gabrielle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Our first time trying this place and it was amazing! The sandwiches were to die for. Such a low key spot but definitely a gem. Staff was super friendly. Will be coming back!", "author": "Brenda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "I love this place.\n\nIn my world, wraps conquer everything. \n\nThe menu is full of unique ways of eating ingredients.\n\nThe Blue Plate is on the top of my favorites board.", "author": "Tammy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-10", "description": "I just called to order takeout as Yelp says that they are open until 12am, but the man who answered the phone said they are actually closed. He didn't apologize or anything! Rude! Update your hours then!", "author": "Tonya Bush K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-03", "description": "Payed $11 for a basic looking sandwich. For $10 you get a nice full of meat sandwich anywhere in SF. I will not be returning. I asked them if it was enough to share with a friend the employee said definitely. When I received it was not enough to share. So I went across the street to Green valley market that made me a bigger sandwich for half the price $6.50.", "author": "Princess Jasmine J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-14", "description": "I try my best not to write mediocre reviews on places I frequently visit, but today at Eleven O One was ridiculous. While I was waiting in line the lady next to me who had already ordered was asked twice by the cashier what she was waiting for within 2 minutes which should have been the signal for me to go somewhere else. Fast forward 20 minutes to the people who ordered after me getting their food first followed by the dreaded question, \"what are you waiting for?\" Moral of the story is that if you create your own sandwich they'll prioritize the \"easy\" orders and struggle because when I got back to the pad it was missing 2 items! Normally a solid spot which freshly roasted roti chicken on soft dutch crunch with solid ingredients, so let's just call it an off day I guess. Nevertheless if I walk in and see the same crew working again, I'll dip out to somewhere else.", "author": "Mitchell M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "AMAZING SANDWICH!!\n\nSo. Much. Sandwich.\n\nSo. Much. Tasty.\n\nSometimes I feel a little guilty when I find an amazing sandwich because it raises the bar for all other sandwiches.\n\nWhen the right person is there (sometimes they have someone new and the sandwiches aren't as good), but when the right person is there - THANK YOU FOR YOUR TALENT AND ART. There is just the perfect combination of everything - the meat, the cheese, the tastiness, even how evenly everything is arranged so you get the same perfect mouthful with every bite! How delightful.\n\nYou can't go wrong with the sandwiches here! Just make sure your car is in a safe place as the surrounding area can be a bit gritty.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "One time I was hungry and went to get a sandwich, we got other stuff too...it was delectable. On the service side they kept it real as a mofo. I find there space warm and inviting. They have a lovely selection of beverages. Make sure to score a chocolate chip cookie, because you're going to want it later.", "author": "Mon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "This place has really good sandwiches (quality) and appetizers.  Plus they are open late.  A solid inexpensive place to get munchies satisfied.", "author": "Piyush P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "Warning:. This restaurant could poison you if you have food allergies.\n\nI asked the server to put nuts on the side for our salad so I could share it with others and they could enjoy the nuts without them aggravating my food allergies.  I noticed after starting to eat a salad here my tongue swelling -- the server left a lot of nuts in the food.  Very dissatisfied and dangerous.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-02", "description": "Usually love the wraps here but unfortunately I cannot recommend coming here, especially during busy hours. I ordered on yelp (eat24) and drove over to pick up my order, cashier said it would be out in a minute. I patiently waited for 30 full minutes until I asked the chef who said it would take another 50 minutes because my order was 7th in line.. so I asked for a cancellation and left, unfortunately I likely won't be getting any refund since I have to go through eat24 etc. Anyways, if this was the case I should have been told immediately that my wrap would take over an hour to be ready and saved 30 minutes that I have already waited.", "author": "Barry H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-12", "description": "This one star is for the rude service I received last night.\n\nI can here at the insistence of my coworkers across the street at the bar. We were hanging out to put the rough week behind us and they noticed I was particularly low energy and suggested I come here to get some food. They know how happy good food makes me (awww, they're the best!!)\n\nI was about to order when I noticed another guest there was taking photos of his newly acquired 420-friendly goods. This made me laugh (something I haven't done all week due to the recent election results) and the girl about to take my order snaps at me with \"That's my boyfriend!\" I'm confused and apologize and then ask her if I did something to offend her. She gestures to the other guest and back to me and says she doesn't like what I'm doing. I apologize again (because this is what you do when someone tells you have upset them regardless of the reason and whether or not you agree). At this point, I'm not even sure if I should continue ordering and I've lost even more of my appetite. I order anyway, feeling more and more awful about the situation. Waiting for my food felt like forever. In the end, I only took 2 bites of my food before just giving it away because I couldn't stomach the situation.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "Eleven Oooooh One is one of my favorite places near work. I am a fan of the quality of the food and the fact that you can get something so fresh so fast. \n\nYou can order online, over the phone or just walk in. No matter which way I do it - I always order the same thing, the Soothing Chicken Wrap. It's a very large burrito sized chicken wrap with jalapenos. It's fantastic and the chicken is very moist and flavorful.\n\nI've seen some of the other items on the menu, mostly ordered by coworkers will to try something new, but I just cant do it. I know what I like and love this spicy wrap.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "This is my favorite place for a take out meal in SF. Assumed I had already written them a review but guess not!\n\nI order the same weirdo thing every time I come here - chicken caesar wrap, no chicken, extra croutons, spinach wrap. It is a bountiful wrap of lightly dressed salad, parmesan cheese and yummy crunchy croutons. Sometimes if I'm extra hungry I'll get the decadent blue cheese tots, which you need to be in the mood for.. they are potent and yummy. Onion rings are good too, fries aren't as crispy as I like 'em but I'll get if in the mood. But my overall favorite part about this place is their consistency with fresh and delicious ingredients and friendly service.\n\nCouldn't recommend more, my favorite wrap in the city! And everyone I've brought here feels similarly about whatever they get :)", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "Decent wrap and a good selection of wraps, salads etc. The serving was very generous, by European standards anyway! \nMy wrap was tasty enough and fairly cheap, under 10 usd.", "author": "Elli H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "This is a great place for average priced sandwiches, appetizers, and late night bites.  They are fast, and the staff are friendly. \n\nMy personal favorite: the Napa (cracked pepper turkey, Brie, chipotle sauce) \n\nFor vegetarians: the tree sitter is my roommates fave.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "I am an easy person and don't ask much!\n\nYou put any edible items (sweet and/or savory) in a flour tortilla, I will definitely eat it. \"So go ahead think of something to put in a flour tortilla to feed Joe Cool!\"\n\nIt is not necessary. Because these cool cats at this corner deli/restaurant on Polk Street expose their creativity and know very well what to put in a tortilla. \n\nI dined here three times within a 2-week span for lunch. My first visit, I had the Pulled Pork Wrap. All the signature wraps are $8.00 and that wrap had slow-cooked shredded pulled pork, romaine lettuce, croutons and a special sauce wrapped in a flour tortilla. Nobody that I know of has invented this unique wrap. The pulled pork has some flavor and mixed well with the other fillings.  There are no combo meals here and every item is sold separately. Therefore I also ordered a basket of onion rings for $3.50 and pint of PBR.  The basket of large onion rings was piping hot and can easily fit anybody's ankle. My first visit: http://www.yelp.com/biz_photos/eleven-o-one-san-francisco#62dgA7W-xpWwNT3F2_iy0A\n\nMy second visit, I ordered the Texas wrap with another order of onion rings and a can San Pellegrino carbonated juice. The Texas wrap has slices of Black Forest ham, lettuce, tomato and that same special sauce. If you like ham, this is definitely your wrap to order. My second visit: http://www.yelp.com/biz_photos/eleven-o-one-san-francisco#Ym4bUrqPK4G41d2YsBRzvA\n\nMy third visit, I had the pulled pork wrap again with an order of fries. That side of fries was a hefty serving. You can tell this is my favorite wrap from here. My third visit: http://www.yelp.com/biz_photos/eleven-o-one-san-francisco#-w1vk3oDh4hcDHeV8dOt3g\n\nIf dining in-house, you will be listening to classic hip-hop jams and watch current event programming while eating your meal. \n\nThe deli also cooked rotisserie chicken.  I might try that on my next visit.\n\nCredit cards are accepted here. \n\nYou will definitely like this corner place for unique eats.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Best wraps in town! I am so grateful to live down the block from this place. They are delicious, and are versatile & i cant get enough of them. Every time im hungry, i can eat their food . 3 times a week. Things I'd recommend: fried calamari, mozzarella sticks, and each one of their wraps (my favorite is the vegetarian one) .", "author": "Shira T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "A-Mazing. Best sandwiches ever, plus more. Eat at this place! I got the Cowboy Melt on Dutch crunch bread. Made fresh, delicious and HUGE portions...I had to get a to-go box. And all for $10! Unheard of in San Fran. Super service by the two very nice owners, too. Really, this was 5 star taste for a one star price. I will be back, probably for one of the whole rotisserie chickens cooking (only $13) taking it home for dinner with the family. Look for the review on the chicken soon!", "author": "Mike T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-25", "description": "Four words:  Blue Cheese Tater Tots.\n\nTen more words:  if you love yourself, you should order and devour it.", "author": "Chloe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "While working at a nearby location, I had several opportunities to have lunch here. They are quite busy, and if you are on a short schedule it is best to order your food ahead and pick it up 20 minutes later. My favorite wrap was the Blue Plate,and the tuna sandwich was very tasty. The sweet potato fries with the spicy dipping sauce were a great addition to any sandwich selection", "author": "Raquelle Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-02", "description": "Ok WTF! I just ordered a chili dog and low and behold they add relish to the dog,not cheese but friggin relish on a chili dog?!?! Are you kidding me and 9 dollars on top of it! Well off to get pizza because well relish on my $9 hotdog", "author": "Zaalen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-21", "description": "I know I went on a bad day. It was mid-80's in San Francisco and this place was suffering from a lack of ventilation/circulation. It was hot. I was sweating profusely and more embarrassingly had invited my boss to meet me there for a meeting, not knowing I would be stepping into a literal oven. I know that heat is not a common problem in San Francisco, and I hate being the one to complain about it, but there is nothing more thrilling than stepping into a business with air conditioning on a hot day. It really makes a huge difference in customer experience. \n\nI had the tree sitter sandwich and a kombucha. I did not like the sandwich. It was very eggy and drenched in sauce. I've also had better Dutch crunch bread so I'm guessing they do not source it locally. I will definitely be back to try some more sandwiches and try to have a better experience so I am not ruling this place out at all. \n\nOne of my complaints is that there really didn't seem to be enough vegetarian options. I don't recall any vegan options at all. There is definitely a need for an updated menu by cutting the less popular items, slimming down the menu, introducing some more specials, and definitely more veggie options.", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "Good place to eat if you're in the neighborhood.\n\nI had the firecracker which was tasty, but the bread wasn't very fresh (and stale Dutch crunch isn't amazing).\n\nPrices reasonable (~$9) but not the best quality price/ratio.\n\n+Tasty food\n+Fast service\n+Decent prices\n\n-Nothing special", "author": "Sep N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "This is the greatest sandwich spot ever!\nTheir combinations and ingredients are absolutely on your point! There have been dozens of times plus Ive stopped by this unique spot, and I have been disappointed only one time. It was due to an ingredient that was used just didn't taste right. But all in all everything I've tried here rocks my sox!", "author": "Moon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "This place hits the spot. Huge variety of sandwiches, dogs, wraps and even rotisserie chicken. My first stop lead me to the Cubano which was full of flavor and enormous! The sandwich was $10, but honestly half will do you in. They don't hold back on the portion size so the value is 100℅ there. It's also a cool little spot to chill with a few outdoor seats.", "author": "Tim H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "I don't know how I haven't written a review about this place yet. I've been coming here for many years, and it has never let me down. The service is friendly enough, and the wait time is very reasonable. The food is fantastic!\n\nI definitely recommend the buffalo chicken salad and the hillbilly wrap. They are both fantastic!\n\nAlso, they serve beer and wine, so you can have a drink while you wait! :)", "author": "Sami B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-23", "description": "While in the middle of our St. Patty's day pub crawl, we needed some drunchies so we stopped by to grab some snacks.  We ordered the popcorn chicken, mozzarella sticks, and the garlic fries.  The food took a bit to come out even though we were one of a few patrons there (or maybe we were just impatient and drunk) but it was pretty standard.  The garlic fries weren't that garlicky but still okay.  The mozzarella sticks were pretty average as well.  What was the most delicious was the popcorn chicken and that mysterious mayo/sriracha-looking sauce that came with it.  They gave a pretty good portion of the chicken which I was happy with.  Definitely came here out of convenience.   Everything came out hot though!", "author": "Cynthia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-15", "description": "Loud world music rasta . Tea brisk but bring your own stevia. ATM right inside the door.\nVery comfy seating.\nPulled Pork sandwhich should list cheese so can be ordered without it.", "author": "D J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-09", "description": "3.5 stars! Swung by here for a bite to get ready for drinking.\n\nQuickly checked on yelp for highlights, and decided on:\nUnholy Matrimony - Chicken, Jalapeno poppers, Pepperhouse sauce & Ranch - $9 - This sandwich was pretty good. Better than what i expected, but wasn't amazing. The bread was surprisingly good, and the fillings were somewhat substantial. Flavourwise it was missing a wow factor.\n\nSweet Potato Fries - $5 - These sweet potato fries were pretty decent. The price tag is a bit steep, but you do get a good amount of fries. The dipping sauce for this is a bit tangy and has a slight kick. I loved it. These fries were crispy and fairly thin.\n\nOnion Rings - $4 - I think these are a better deal than the sweet potato fries. The ranch sauce is a little different than ranch. However, I much prefered the sweet potato fries sauce so I ended up dipping the onion rings over there. These were crispy and you get a good amount. Good onion rings. \n\nThey have condiments in the middle on a little island table. It has napkins, and siracha too!\n\nWasn't the best sandwich I've ever eaten, but it wasn't bad. I am sucker for Gouda, and totally didn't see that on the menu the first time. I may go back to try that, if I do, I wouldn't mind trying some of the other starters. The starters are at reasonable prices.\n\nRecommended and I might be back.", "author": "Kaje Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-08", "description": "For a place that was dead with no customers and 3 employees it took too long to make a Caesar salad. Seriously there's nothing to it. Also, overpriced for what I got, $12 for a chicken Caesar Salad that wasn't even that good is ridiculous. Maybe their sandwiches are better.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-10", "description": "Sandwich spot on Polk. Wraps, salads, sandwiches of all shapes and sizes. Limited seating and a lot of hot air. I foresee this being an excellent night cap to a night out on Polk. I wouldn't make it a destination for a fine sandwich after a long day, but it is certainly a solid option.", "author": "Nick K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-31", "description": "Stumbled in at 1:53am last night dressed as R2D2. Immediately noticed the killer wrap/sandwich list and the crown jewel: mozzarella sticks! The mozzarella sticks came out hot and fresh and we devoured every piece of them! For the entree I got the \"Hillbilly Wrap\" (pulled pork, caesar dressing, avocado, croutons). This tasted like a unique, creative take on a sandwich (loved that there was a spinach tortilla option) and was a perfect choice for anyone who strays away from gluten. To add, I'm sure my friends and I were so annoying but the employees were very nice and friendly! Definitely want to come back here during normal hours to try some more wraps :)", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-06", "description": "I'll start with the good.  \n\nThe food (sandwiches, specifically) is decent.  But there are clearly better options in the neighborhood (Bite). \n\nThe reason they get a 1 star is because of deceitful pricing and poor service. \n\nThe prices when you order pick up online are hyper inflated.  To the tune of $12 online vs. $9 in store for the New York sandwich, for example.  \n\nThere's no indication of this being the case when you order and the wait staff are unapologetic for the difference when you go to pick up your food.  \n\nI can understand surcharges for delivery, and I can MAYBE understand a small fee for 'convenience' online, but $3.00 on top of a $9.00 order is absurd.\n\nOh yeah, to add insult to injury, they add a $0.25 bag fee automatically.  I don't need a bag for one damn sandwich and now I have change jingling in my pocket because that brought the order up to $13.05. \n\nBlah.  Just a poor experience overall.  Do yourself a favor and walk over to Bite.  It's close by and both food and service are better.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-10", "description": "Super relaxed atmosphere and tasty sandwiches.\n\nI came with some friends for a quick bite before an event. The atmosphere is very chill, perhaps up to the point where even the service gets too comfortable and slow. \nI got the 'Love Affair' breaded chicken sandwich and it was pretty satisfying, but it just took a while...\n\nThey have a cute upstairs seating area with some couchees, but unfortunately it was kind of hot and stuffy. \n\nGood for a quick bite.", "author": "Augusto T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-05", "description": "Came Sunday afternoon. Decent tasting, filling, but a little overpriced sandwiches. Seriously slow service. I ordered with no-one else in the restaurant and it took 20 minutes to get the sandwich.  The tables and seats were all dirty. Probably best to order for pickup (which might be what they were making instead of my sandwich).", "author": "Philip F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-27", "description": "Close the door! They keep the door open when it's cold outside. Cold salad and cold inside not inviting place...", "author": "Mandingo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "Good food and reasonable prices. I am a fan of the La Provencal salad, as well as their rotisserie chicken.", "author": "Amy R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-15", "description": "Although it may look like a bar from the outside, it's really a lunch/dinner place. With an extensive sandwich menu which seems very promising, the actual food we ordered was a big disappointment. \n\nThe sandwich I ordered came with many additional ingredients that weren't listed on the menu description and it wasn't very fresh tasting. My eating companions also were not so satisfied with their sandwiches either. They were just a little bland. \n\nHowever, the portion sizes were good and it was the middle of lunch. I think traditional bar food and fried food would probably be quite good here. \n\nA positive is the nice service and staff, and clean restrooms. \n\nI will give them another go for the benefit of the doubt!", "author": "Alexandra B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "After traveling from Sacramento, my boyfriend and I had just gotten into our hotel room at the Hotel Carlton when we realized that we hadn't eaten all day. We quickly explored the area, and we came across Eleven O One. \nWe walked in, and although the building was a little hot inside, we ordered and sat on the second story. \nI ordered the Moshe Moshe on Dutch crunch bread. \nAMAZING! It was the best sandwich I've ever had in my life! \nDefinitely coming back next time I visit my home city again!", "author": "Erin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "This is my go to sandwich spot. The wraps here will definitely hit any sort of appetite and they are HUGE (share with a friend). \nThe chicken is rotisserie and delicious. \nThey have beer on tap and 2$ PBR.\nIs a quick stop so not a place for a date or anything fancy, but thats fine by me .", "author": "Timothy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-02", "description": "DISCLAIMER: This review is based on how unbelievably rude the staff is.\n\nAs a fan of Bite on Sutter (they have a very similar menu so they are obviously related), I've recently given this place a second chance, even though how I was spoken to the first time was unacceptable. Should have never have gone back.\n\nI went in on a Sunday night to get a sandwich with my boyfriend. The jarring reggae rock music was so loud, my boyfriend had to ask the girl at the register literally 6 times to repeat herself. I'm sorry, but if you're going to ask \"Wouldchulikeiceinyourcuphowmuch\" with a nasty look on your face while playing the music THAT loud, don't get all pissed off when people can't hear you and politely ask you to repeat yourself. My order experience wasn't much better.\n\nWhen we nicely tried to clean up after ourselves and brought the baskets up to the register to ask where we could put them, she made a face at us, scoffed, and said \"Take those back to your table to be bussed.\" Why does the staff even bother working in a restaurant if they are so obviously disgusted to work there and interact with other humans!?\n\nFOOD: Decent. But not nearly good enough to go back based on the terrible experience. They need to talk to the incredibly nice staff at Bite on how to treat customers.", "author": "Haley J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "This has been a go-to spot since I started working nearby over a year ago. I appreciate their promptness and great customer service, they're always in a good mood when I'm there.\n\nEleven O One offer an array of sandwiches, salads, and wraps, as well as rotisserie chicken, tots, fries, etc.You can make any of their sandwiches into wraps, and their rotisserie chicken hits the spot! They also have a few craft beers on tap for cheap! My favorite sandwiches/wraps are:  Cowboy Melt, Gouda-Good, and the New York. Sometimes I opt for a half rotisserie chicken with some fresh mozzarella when I'm feeling something on the lighter side. \n\nAnyways, great spot to grab a quick, delicious bite to eat or even to enjoy a cold beer on a hot day.  Check it out for yourself.", "author": "Yiorgo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Amazing food love the sandwiches, they are MASSIVE you could probably share a sandwich if you wanted to..they are so good that you want the whole thing for yourself. I usually get the ces la vi which has everything but the kitchen sink as one would say.. The guys there say its the sandwich that drunk people get but I get it even at 11 am it's soo good! Try it", "author": "Grecia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "The sandwiches were amazing -- I tried both vegatarian ones and my bf tried a chicken sandwich and a meat-lovers type. Note that we went there twice in our short weekend stay in San Fran! The food is almost too much though, so I'd suggest splitting it if you have somewhere else to go or be right after stopping in!", "author": "Jacklyn S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-05", "description": "I would give half a star if I could. Ordered from grubhub and the wings were tiny (proof http://imgur.com/Wdvm2ME). the jalapeno poppers were burnt. They forgot my wrap. For the $50 I paid, I really got $15 of food.  Would not recommend and really would expect my money back which I didn't get.", "author": "Sig L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-09", "description": "Came in the other night. \n\n1. Prices were higher than what others pictured a couple months back. \n2. Good atmosphere considering what's outside around the area. \n3. Sandwiches were alright considering how pricey. Honestly would of been happier going to togos. Paid almost $50 for two of the premier sandwiches & two beers. \n4. Wish the sandwiches were more specific rather than just whatever w/the standard shredded lettuce&tomatoes.\n5. Garlic fries literally just had garlic lol. No parsley or cheese just threw some garlic on em. Pretty weak. \n\nProbably won't be back, I've had better sandwiches for a waaaaaaaay better price down at the liquor stores in Daly City.", "author": "J D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "We can here on Memorial Day for a quick lunch. The sandwiches are excellent. There are a lot on their menu from which to choose, but the Cowboy Melt caught my eye so that's what I got.  What a yummy sandwich!  The hot chili sauce appears to be house-made - I could not stop putting it on my sandwich!\n\nService was also great and fast.  The decor and atmosphere is better than your typical sandwich joint. Definitely recommend and will return for more!", "author": "William L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-11", "description": "This restaurant is the worst! I came here on a late night, when nothing else was open; I ordered a vegetarian sandwich  and I must say that it was by far among the most disappointing meal that I've ever experienced. Poor quality ingredients, like McDonald's level and the taste was awful.", "author": "Maya B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "Great place for a quick bite. Love the nemo salad! Lots of seating and great service.", "author": "Claire B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-07", "description": "This place perplexes me.  I'm still not really sure what to think.\n\nThe service was abysmal.  The lady behind the counter could not have been more clear that she did not want my business, but then I'd already committed and set my sights on that \"Soothing Chicken\" wrap.  I ordered it to eat there, and sat down.  The waitress/server/?? brought it over a few minutes later, just wrapped in sandwich paper & handed it to me, no utensils, no napkins, nada.  I look over, and sure enough there are baskets like the type for sandwiches sitting on the counter above the kitchen, it's not like they didn't have the capacity to serve something reasonable.\n\nSo I open up my wrap, and it's easily 60% lettuce.  Like we all know lettuce is filler, but holy shit did they fill.  A nice note, the menu proclaims \"All wraps come with lettuce.\"  You weren't kidding!  So here I am, thinking sometimes you gamble and you lose, I very feasibly just could have chosen a shitty spot, but I may as well eat my lettuce and roll with the punches.  But then it happened.  I got to the chicken.  Holy sweet baby Jesus it was some of the best chicken I've ever had served at a restaurant.  Granted, there wasn't much of it, as it was out-shined by the colossal servings of lettuce, but every sweet morsel of chicken that I had tasted like sweet sweet redemption.\n\nSo my quandary. I don't know what to think of this place.  I genuinely don't understand why a business would put so much effort into creating such sublime chicken only to have it tarnished by horrid service and near on abusive portioning tactics.  Maybe management is trying to save a few dollars?  Maybe they don't know how shitty that server is?  But that chicken.  I think I might go back and see what happens if I try to order a wrap sans lettuce.", "author": "Josh T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "The design is too dark, but the services and food are amazing. Super friendly stuff that made us feel welcomed. Garlic fries is a must try, huge salad portions. Great place to have a quick lunch.", "author": "Vad R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-15", "description": "Gouda Good. Gouda Good. Gouda Good. \n\nTry saying that 5x as fast as you can. That's my favorite sandwich at this spot and at Bite (sister restaurant). Every time I try and sway from the Gouda Good and try something else, I immediately regret my decision. \n\nAn additional plus--they have jalapeno poppers. :D \n\nI love this place for a quick bite to eat!", "author": "Tina J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-16", "description": "Best sandwich spot ever! The number 13 will give you a \"Foodgasm\"! I moved here 5 months ago and now I'm sure this is my favorite spot. The workers are all super friendly and accommodating. There is seating upstairs that is very relaxing. The music variety is awesome too, one day it's 90's or the next latin(bachata). Great chill place to grab a bite to eat. I think the only upgrade here could possibly be to get free wifi which they may have. \n\nI highly recommend this joint :)", "author": "Reasonably H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-24", "description": "My boyfriend and I went there for dinner before a show at the Regency Ballroom. \n\nGreat atmosphere, clean, great beer selection and really affordable prices.\n\nThe food was pretty good and had a lot of options. Not the HEALTHIEST place to go, but you can definitely alter the menu to fit your dietary needs. We had a Great Wall Wrap and a Salmon Salad (order the dressing on the side..it was drenched.)\n\nLastly, they have downstairs and intimate upstairs seating and we were able to sit right away in the front window around dinner time on Thursday night so it wasn't a wait or anything. Something to keep in mind.\n\nI would definitely recommend this spot.", "author": "Jennifer S. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "This place is solid for a quick sandwich or wrap. Big portions, plenty of variety, and fast. Very similar to the sandwich shop Bite that's a few streets away (and also fantastic; I think it's run by the same people). I will be coming back to try the salads.", "author": "Nick D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-28", "description": "So my first time there i tried the chicken ceasar salad and the chilli and it was good. the next time i got the garlic fries and chicken tenders. The garlic fries are skinny and doesnt have that garlic taste just chunks of garlic. the tenders was good and  i love the spot its a lil hole in th ewall but its good food for the amount of money you want to spend.", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Right on Polk street and open late so great for drunchies, usually not crowded, huge menu, delicious ingredients, nice staff, great bang for your buck. The C'est la Vie is my favorite sandwich in the city, pretty much everything you could possibly put on a sandwich, and for $15 it's basically two meals.", "author": "Nick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "I had an awesome sandwich, it was like a thanksgiving sandwich with cranberry mayo. Amazing!", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-07", "description": "Went in with higher expectations as I'm still looking for a high quality (5 star) sandwich in the neighborhood.\n\nWas somewhat let down. The sandwich I got was good, but not great, or an all star.\n\nMe and my girlfriend split the Love Affair and Gobbler sandwiches. The issue was the flavors were inconsistent. One bite was full of honey, the next full of mustard. Also the pickles predominated the flavor a good amount.\n\nThe staff was very friendly, and they were quick at making our food.\n\nThe venue is a bit of a cramped feeling.\n\nAgain, I did enjoy the sandwiches, just wasn't a 4 or 5.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "Great sandwich place! \nOrdered the \"All American\" supper tasty! Got full with a half a sandwich! \nThe man that rang us up was supper nice and helpful as well! (:", "author": "Linda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "Great sandwiches and wraps. Local feel and trendy decor. \n\nCan beat the favors and fresh taste of the rotisserie chicken. Great quality taste and flavors. There is something for everyone.\n\nDon't forget to check out their local brews, they have the watermelon beer served across town at 21st amendment.\n\nOnly negative is that lunch hour gets really busy and can take 20 minutes to get your sandwich. \n\nNo other negatives, just great tasting food in an up and coming neighborhood.", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "Awesome sandwich and great service! Cheap PBR is always a good thing. My only gripe is right now there's an annoying girl talking loudly on her phone right now.  I guess she works here but I just want to drink my beer and eat my food in peace. I don't care about her thoughts on Sharknado and her \"struggles.\"  She needs some manners and needs to shove a sock in it....but that chicken tho =legit!", "author": "Katie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "This is my go-to place when I want a great sandwich and a glass of wine.  The staff is super efficient,  and the sandwiches are consistently great.  Pretty much any sandwich you can imagine is on the menu (plus some you've never imagined!), and they're very open to making anything you want.  \nI love sitting upstairs and watching the crazy street life of Polk.  \nThis place reminds me of an edgy coffee shop in Amsterdam.  And that's a very good thing.", "author": "Robert K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-17", "description": "The food was good. I enjoy their sandwiches a lot. They're a little pricey, by my standards, but pretty good. I had their pastrami sandwich and my girlfriend had their chicken wings and they were both fresh and were well made.\n\nThe reason I'm not giving these guys a higher rating is due to: A. their staff isn't very friendly. I'm always very polite with all customer service people, so I don't know why I was treated like that. I don't know, maybe I don't have a likable face? \n\nB. It's been three times now that I order something, and they come to me AFTER I've made my order and tell me that they ran out of whatever I ordered. The first time it happened the dude was pretty cool about it and offered to swap my order for something comparable and even threw in a freebie. No Big deal. The last time it happened, another dude was very apathetic about the whole thing and seemed bothered when I wanted my refund. No good.\n\nC. The place kind of needs a good cleaning. Seems pretty basic. If you're gonna have couches instead of chairs, make sure you clean them well. Those things are dirt magnets. Especially when they're being used everyday by a whole bunch of different people. There's dirt in places that are easy to clean. The tables are STICKY!\n\nEdit:\nHad a very bad experience with the staff recently. Clearly, the owners of this restaurant don't care about their customers. Too bad.", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-29", "description": "Whom ever answers the phone on 7/29 at around 9:10PM should be removed bad attitude and no desire to come in to eat or order out", "author": "Gilbert A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-14", "description": "would i come back sure why not. Cheap food for dinner or lunch if you don't feel like preparing or cooking anything. Their blue cheese chicken wrap is 4 star good for the price.", "author": "Miguel Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-06", "description": "The employees are the worst. They should understand that the later night  crowd is what is supporting their main business and not treat everyone like they are a drunken idiot. Great sandwiches,terrible service.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "Ok, I think this is my favorite restaurant in the city.\n\nLove it! Love to people watch and see the crazy ass crackheads on polk and post.\n\nDaniel is also awesome.  \n\nBeen coming here quite often, never had a bad sandwich, I'm on a mission to try them all...\n\nDutch Crunch!", "author": "Tu T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-28", "description": "Just so we're clear, I want to tell everyone that I live in this neighborhood and have been coming here and to the owner's original place, Bite http://www.yelp.com/biz/bite-san-francisco, for years. These are good, solid sandwich shops -- each has their own personality but basically, you're getting a big sandwich, some salads (less inspiring), and some sides. \nOver the past 4 years I've seen the sandwiches go from SANDWICHES to sadwiches (yes, sadwiches) -- less meat, more shredded lettuce, less love all around. \nI've also constantly seen \"Help Wanted\" posters in both places for about the past year. I can only imagine that SF's new-found wealth, and lack of affordable living, has created a dearth of food service workers willing to work for minimum wage -- even if SF's minimum is more, it's still not enough to live here.\nSo, what are we left with? We have restos that have less-than-ideally trained employees, we have overpriced sandos with less meat in them than a year ago, we have customers irritated that they have to wait longer for more expensive food. This is what happens when your city lacks a middle and lower-middle class. \nI hope you can afford to eat at Michelin-starred restaurants -- you know they're making money.", "author": "Yasi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Their sandwiches and wraps are amazing! My favorite wraps are soothing chicken and great wall. Hard to go wrong with the sandwiches! I recommend anything with chicken here", "author": "vishal k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-28", "description": "Not a good option for Vegetarians. They have just one Greek Salad which was awful!", "author": "Rocking V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "Sips N Sews in right around the corner. Great wraps! Amazing chicken.. Always perfect for the on the go sewist.", "author": "Press S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "Great menu. Quality ingredients. Will definitely be coming back. YUM!", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "One of the best sandwich/wrap shops we ever ate at. I ordered a bratwurst dog with the chili on top (this is not a menu item), the chili was fresh, nothing like those can tasting crap you find in some hot dog stands, the order comes with french fries. My girlfriend ordered the bbq chicken sandwich...lets just say we both devoured our food. We also got an order of the sweet potato fries...we are defenatly coming back for more. \n\nFRESH GREAT TASTING FOOD.", "author": "SamiRoxi S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-11", "description": "This place is great for sandwiches if you're all about getting value and more wrap or sandwich than you can eat for $8-$10.  The portion sizes here are enormous and half of a sandwich or wrap is the size of a fist here.  Our hero was comped an \"Unholy Trinity\" sandwich here by the server as his fries were incredibly late due to a backlog of orders at the frier.  They apparently only have one frier here and it takes a long time for them to process orders for anything fried.\n\nOverall, the service can be a bit slow, but they're pretty friendly and know where their shortcoming lie.  It's definitely worth trying for a sandwich, but definitely order the right thing here (either a sandwich or a wrap if you're really hungry).\n\nPROS:\n- Their sandwiches and wraps can feed two if you order a side too.\n- The Unholy Trinity is a pretty decent sandwich and worth trying out.\n- They have some \"hidden\" seating on the second floor as well to get away from the hustle and bustle of Polk street.\n\nCONS:\n- The fries really suck.  They give you a lot, but they're sort of soggy and not crispy at all.\n- Limited drink selection.  Only about 6 or 7 beers on tap and nothing spectacular.\n- Service can be slow depending on what you order.", "author": "Albert W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "I would give it a 7/5 if it was an option. This place was amazing. all sandwiches were HUGE- and delicious, and very reasonably priced. Stuffed with tons of meat, fresh veggies, and the expensive blue cheese.HANKS BLUE BITES, were also OUt of this world, with blue cheese and truffle oil. OMG, orgasmic meal, i couldnt even eat all of it. The salads were fresh and the garlic fries were also Very good, not too greasy, just right.... AMAZING!!!!!", "author": "David C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-16", "description": "Bite has gone stylish. Eleven O One looks like a coffeehouse with art on the walls and contemporary furniture (I felt the urge to bring my laptop) but it's a sandwich shop. The menu has expanded from sandwiches, hot dogs and rotisserie chicken to include wraps, salads, pasta and appetizers. Sandwiches can include pulled pork, rotisserie chicken, and jalapeno poppers.\n\n* Le Barbes ($8): Merguez, salsa and spicy red pepper sauce. The lamb sausage links were extremely dry. The sandwich also had sautéed onions, peppers, tomatoes and a spicy harissa red sauce that had a nice level of heat. I didn't like the hard white roll. The sandwich was average in size.\n\nI've been to their other location (Bite) and I think this location is probably a four star place but I ordered the wrong sandwich.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "Yummy!!! This place is like a little sandwich pub. Their sandwiches are super tasty. I had the gobbler sandwich with a glass of Chardonnay. I like the dark cozy atmosphere and seating.", "author": "Colin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-16", "description": "Eleven o one is one of those places that are very hit and miss. I live a few blocks away and have taken food to go, eaten there and even ordered ahead. Depending on who's working and the time of day/day of the week, your experience may vary. The sandwiches are always delicious and I'm always left full. The service at times can leave a lot to be desired. The red headed gentleman who's name I can't recall is incredibly nice and always a pleasure to see when I come in. Some of the other employees...not so kind. If you're not happy with the service, I suggest taking it to go. Especially on a weekend when there's a half a dozen drunk people there and it's close to closing.", "author": "Sydney P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-26", "description": "Had a weird experience here. I walked in at 6:30 pm on Thursday looking to buy half a roasted chicken. The woman working there told me they were out of chicken even though there were at least 10 spinning in the rotisserie behind her. She explained those were for sandwiches and other items on the menu. Mind you the place was empty. I'm not sure if this was horrible customer service or just the strangest? There was literally no one else in the place and I'm not even sure they would have gone through all of them in the next 3 hours.", "author": "Spencer V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "I've only tried the Caesar wrap so far but I keep coming back for it. Fast service and very friendly staff", "author": "Curtis V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-23", "description": "The sweet potato fries are delicious, served with a spicy mayo sauce. \nI had a sandwich on wheat roll with avocado, sprouts, tomato, egg, red onion and honey mustard dressing. I can't remember the name. The honey mustard is really sweet. I would order it with a different dressing next time. Other sandwiches on the menu listed onions, this sandwich did not, but included them anyways. The sandwich was large and tasty for the most part. I didn't care for the wheat roll, it was too hard. \nThis restaurant  carries several varieties of beer, good juice and soft drink options.\nThere is a decent amount of seating, although the benches should have been made a little wider.\nThe prices are reasonable. I wavered between 3-4 stars. The value raised their rating.\nI received good service, both friendly and expedient.", "author": "Rayleen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-20", "description": "Open tab, half rotisserie chicken, two wraps, sriracha sauce, beer, and a cool feeling. Worth it.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-26", "description": "one of the first places i tried in san fran.\nand i have been back many times after.\nwas really good service and the food was delicious.\nand they are open really late .", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "Was craving a dutch crunch sandwich so made a short trek out from my office to Eleven O One. Extensive menu. Had the Gobbler. Very good sandwich. More meat would have been nice, but it was still sufficient for a quick lunch.", "author": "Stephen Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-01", "description": "Came in for some late grub around like 10. I got the cowboy my boy got a turkey club wrap.\nMy sandwich was super dry and the bread was too damn hard. Overall ehh.", "author": "Ekemini D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-09", "description": "This is a sandwiches and other casual food place where you can Grab-n-Go in between your bar hopping on the Polk Street party corridor on a weekend night. There is a seating area on the street level, in case you want to Stay-n-Sit to eat your food. Then there are 3 tables upstairs in case you want to Hide-n-Seek from your drunk friends stumbling down Polk Street.  \n\nThey are pretty fast and efficient here, and everything is decent given the type of place it is. Why don't you Stop-n-Try?", "author": "Wanugee N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-14", "description": "I'll admit that this review is biased because you can't control your clientele and the tranny hooker who followed me in, wearing a mini-dress with track marks on her (his?) arms, carrying on about getting a minimum wage job offer when his regular hourly rate is $150 (I highly doubt this) really ruined my appetite.\n\nNevertheless I was excited to try this place, having walked by it previously and seeing the 4-star reviews on Yelp.  The menu was extensive, which I usually hate (for the love of g-d, pick the five things you do best and feature them), so I asked the cashier what he recommended - anything with chicken.  I got the cowboy melt with dutch crunch bread and a side of chili.  It was certainly crunchy, but probably because it was left out for a few weeks.  The chili tasted like ketchup with beans.\n\nAs far as the ambiance goes -- well, everything was dirty.  There was an unidentified stain on the bench cushion right next to me, which made me gag once I visualized the tranny hooker eating meals here.\n\nGiven that I will always associate this place with tranny hookers, bad food and unidentified stains, suffice it to say I will not be returning.", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-18", "description": "Solid sandwich joint perfect for a late night bite.  My favorite is the New York Sandwich: Pastrami Bacon and Swiss with the fixins.  The Hanks blue bites are also delicious: Tater tots with melted blue cheese.  They also have been on tap #AnchorSteam", "author": "Jonathan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "It is places like this that make me proud to live in San Francisco!!! Not only is grass roots next door, but this restaurant has some of the best Dutch Crunch bread and sandwiches in the entire USA. I don't normally praise food this much, so when you order a gobbler or porker's revenge on Dutch Crunch bread, you will see what I am talking about. 10/10 food and amazing atmosphere. I would eat here daily if didn't live over a mile away!", "author": "Rob G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-30", "description": "This place used to be an awesome chill place to eat, tonight @ 11pm, no food and one fryer! Workers doesn't seem to care about the situation either! Felt like it was our fault for ordering food, I'm sorry that doing your job is such an inconvenience.", "author": "Topher H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-08", "description": "I stumbled upon this place with some of my friends on New Years Eve and was pleasantly surprised.  The interior is really cool -- great use of color, art painted on walls, and the loft seating is awesome. The food was well priced, especially for SF, and the food was good. My only complaint is that it took a little too long for the food to arrive. There only seemed to be two people working there at the time -- one person who took the orders and served the food, and the other who was making it. Despite that, I would definitely go back again and recommend it to anyone who is looking for a fun, casual place to eat in SF.", "author": "Abena O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-11", "description": "I've been wanting to try this place for a few months now, and I finally got to...3 days before my boyfriend moved out of the area. Huge regret! The food here is AMAZING. \n\nI had the Soothing Chicken wrap and my boyfriend got the All American wrap. We shared an order of Hank's Blue Bites. The wraps were delicious. The chicken was juicy; there was a perfect amount of kick thanks to the jalapenos; all the ingredients complemented each other. And it was the size of a super burrito; I couldn't finish it.\nThe blue bites were great at the start, but after a little while, they started getting a bit strong for my liking. All the blue cheese was pretty overwhelming at the end. \n\nThe setting is very cozy. It's a small restaurant, so there's not very much seating. There's a loft upstairs with some seating that overlooks the rest of the restaurant. It was a great escape from all the loud bars in the area.\n\nI'll definitely be going out of my way to come back and try some of their sandwiches.", "author": "Florence S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-30", "description": "I live in this neighborhood, I eat ( ate) here periodically, and I have never had a problem. I placed an order today that usually takes around 10 minutes. Today it took about a minute. I simply questioned why that was so quick (when I usually have to wait a bit for a pippin' hot order) and the staff's reaction to my question was so terribly defensive. To the point that I became offended...just for asking a question. \nTheir response was weird, unnecessary, and not at all appropriate. What's happening to my neighborhood? Maybe I'll just stick to BITE!", "author": "F. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-22", "description": "Sangria!  Yum!\n\nI love this place!!  Tiny little restaurant with great sandwiches and the best Sangria in town!!\n\nThe fact that it is a block from home doesn't hurt either!!", "author": "Antoine V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-26", "description": "FOOD: \n1.) Turkey cranberry sammich - yum pretty good and comforting lotta turkey Mm tryptophan \n2.) Popcorn chicken - damn hella good\n\n\nSERVICE:\nOrder at counter\n\n\nATMOSPHERE:\nSmall cafe feel, eclectic, cozy", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "What a cute place!!\n\nAtmosphere: Suuuuuuuuper chill. There's plenty of seating with throw pillows. Music creates a warm ambiance but still allows for conversation. Lighting is mellow. \n\nStaff: Fun! It was kind of like chatting up some new friends at a party. Friends who had already loosened up with a beer.\n\nFood: Also fun! This place has comfort food and carnival food at dirt-cheap prices. This is the perfect venue for a late-night gathering with friends.\n\nBeer: So much on tap. Very cheap. I can't wait to go back.", "author": "Vanessa C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-10", "description": "I was pleasantly surprised to find this place so close to work, so I looked up on Yelp if had a good star rating and sure enough an even 4 star.\n\nI looked at the menu on the wall and was looking for a basic dutch crunch, turkey sandwhich. I got one and the total was 9 plus tax. damn near 10 bucks.\n\nI went to Safeway and ordered the same basic turkey aka the Gobbler and paid 6.75 tax included.\n\nI will give the place a 2nd chance soon and order 2 hand-dipped battered corndogs for 6 and update my review.", "author": "Andrew Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-03", "description": "The rotisserie chicken might be good here but you can't tell for all the gloppy aoli all over everything. Save yourself (and your wrap) and get it in the side!!", "author": "Katrina N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "We almost didn't go in because the place was empty...am I missing something? My sandwich was cooked quickly and exceeded my expectations! Great prices, awesome chill atmosphere. I will definitely be back here...hope to see it much busier when I return!", "author": "Englands E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "One of the best sandwiches I've ever had. I ordered the Gouda Good and was pleasantly surprised. Best customer service too.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-11", "description": "How does Subway survive when there is a cool place like this down the street.  The sandwiches and atmosphere are amazing.  Cool employees, cool music playing and great comfort food.  Btw, this is more than just a sandwich place.  They have popcorn chicken, hot dogs, fries etc.  Don't let me forget to mention they serve beer and wine too.  \n\nEntertainment you ask?  Yeah they have it.  I was rocking out to Bones Thugs and Harmony tonight as I chowed down.  Then I got to watch some crazy and fun tranny going off to her friend.  I love shit like this.  Rest assured I will be back!  :)", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-29", "description": "My new favorite lunch spot.  I love the dark wood interior as well as the loft space, it makes it feel super friendly and cozy.  All the servings are HUGE, and run between $8-11 per dish, give or take.  I have had wraps, sandwhiches and salads there and have yet to be disappointed.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "It was my first time going and it was a great experience. Atmosphere was nice enough. Open late. Nice variety of food. I got the Gouda Good chicken sandwich with onion rings, and a beer. The sandwich was amazing! The onion rings on the other hand tasted really oily but the onion itself tasted fresh. Luckily me and my gf were able to split it. No way I can eat all that oil alone. I would recommend a different side, but overall loved the place. Definitely want make this a semi-regular spot.", "author": "Sako K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-02", "description": "I got the tree sitter sandwich because it was one of their veg options, and it just wasn't a great combination of flavors: mozzarella, honey mustard, hard boiled eggs? The ingredients did taste fresh though (except maybe the Dutch crunch bread), and the sandwich was well constructed (structurally speaking). \n\nMore disappointing were the garlic fries I ordered. The fries by themselves would've been good, but when I ordered garlic fries I expected some garlic seasoning or maybe roasted garlic. Instead, there were spoonfuls of the pre-minced garlic you get in jars thrown on the fries, which didn't stick to them at all and caused them to become soggy and wet.\n\nOh well. I bet this place is better for carnivores. Still not a bad place, just not great.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "This place almost deserves 5 stars, but since its a little pricey I have to give it 4. The Gouda Good is definitely my favorite and I believe their most popular. The Porkys Revenge is tasty as well, but I was a bit weirded out that their pulled pork sandwich did not have any barbecue sauce on it? Maybe it's just me but a pulled pork sandwich should have bbq sauce! The flavor is still great. My sister absolutely loves the Cowboy Melt. We also get the sweet potato fries and add garlic-yum!  Onion rings are delicious as well. Literally can't complain about anything here except the price. 18$ for a sandwich + fries and a drink is just a little steep!", "author": "Courtney Anne N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-02", "description": "Pretty bad experience all around. Took forever to get my food. The guy at the register wasn't all that friendly. My wrap was way too saucey and totally fell apart when I picked it up. Only to find out that there was hardly any chicken in it. Weak.", "author": "J P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "Loved this sandwich place! A lot for your money, they hook it up with their toppings and most were under $10... Kinda hard to find 'round here nowadays! Staff was super nice too! I'll def be back!", "author": "Stella H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "Walking around past midnight after an evening of drinking, there's not much around the area that's open to eat. Thank goodness for eleven o one.\n\nTheir late night hours provide a haven for drunk people who are in desperate need of food. I opted for one of their wraps & I'm so glad I did. The wraps are huge and so filling. Yet it's not like eating a burrito where you'll regret it in the morning. The wraps are tasty, healthy-ish, and filling.\n\nThey also have an upstairs where you can sit which is kind of cool. I would definitely pay another visit to this spot because their wraps are bombtastic.", "author": "Junel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Good food, cheap prices, try the unholy matrimony!", "author": "Justin I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-27", "description": "Great place for a late night snack!  We hopped in on a Saturday at around 2am and were comforted by the calm setting of this place.  The street outside was a nightmare and we weren't excited about the idea of waiting in line for pizza out on the street with the drunkards.\n\nWhat they offer: salads, wraps, sandwiches, dogs\n\nWhat we got: buffalo chicken salad wrap, chili cheese dog and fries\n\nAll were delicious, great place to hide out while you wait for the drunkards to head home.", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "The cowboy melt and the Moshe Moshe are probably the best sandwiches you will ever have in your life!", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-21", "description": "I got a chicken wrap of some sort and could not even finish it. The chicken didn't taste right and I began to gag halfway through. The jalepeños and sauce were fine but I couldn't get past the chicken. My boyfriend made the same comment about the chicken in his salad; won't be back.", "author": "Jillian F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-29", "description": "Nothing special about this sandwich place at all. They took forever and for what? Everything was bland. No seasoning, no sauce, no flavor, just mayo. I even had jalapeno poppers in mine and they were tiny, soggy and I couldn't even taste them. Just a disappointment all around. Even though its such a big sandwich with a bunch of ingredients, it tastes like nothing. It feels like such a waste.", "author": "Dexter H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-23", "description": "This place was \"meh\" on so many levels. I guess the ambiance was cool, but the food leaves much more to be desired. I think I ordered the standard \"California-inspired\" wrap with avocados in it expecting it to taste fresh and uplifting. The result was a super-bland, moderately sized burrito that was mediocre at best. For the price I paid, I expected quite a bit more flavor.\n\nI suppose it was nice that they asked what kind of tortilla I wanted and gave me three options. Sadly, all the options taste the same and are just there for aesthetic purposes. What is the point?\n\nDon't think I'd ever go back. Might as well walk to Subway.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "I am not typically one of these complicated or adventurous sandwich types.  But as we sat at the bar last night the call went out for us to make a food run and I wound up coming back with the mountain of a sandwich known as the \"c'est la vie.\"  In case you are too lazy to look it up it is piled with  with chicken, roast beef, corned beef, turkey, salami, mozzarella sticks, jalapeno poppers, calamari, avocado, lettuce, onion, tomato, pickle & house sauce.    Yeah, it has moz sticks and poppers in the sandwich.  It was so heavy that I could have knocked out a would be assailant if I had swung the bag at him. \n\nBack at the bar the sandwich immediately achieved celebrity status.   No fewer than ten people had their pictures taken with their mouths agape next to my mountain of meat. By the end of the night the sandwich had an agent, a stylist, a personal photographer and a security staff of two.   I couldn't have been more popular if I had been running around with Kim Kardashian's head on a stick.", "author": "Dru P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-29", "description": "I really liked the decor of this place. The menu is written on a big blackboard that takes up an entire wall. All the food sounded awesome, problem is I don't eat meat so that cut down my choices by a lot. I ended up getting the calamari which was really not very good at all. Not sure what it was, but did not taste like seafood. The food my friends got looked a lot better though, so maybe I just ordered one of the un-appetizing items on the menu. Also, it was really freakin hot in there. I usually run cold blooded but by the end I was down to a tanktop and still sweating. Invest in some air conditioning and I would definitely give it another try.", "author": "Christine E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-02", "description": "My friends and I came across this restaurant for dinner on New Years Eve! The portions are large, and the food is good. They have plenty of sandwiches, wraps, and other foods to choose from. :) \n\nWhat I really loved about this place was the down to earth ambiance (with a cozy loft area), the large painted wall, and the 80's music! \n\nHopefully I'll eat here again soon! :D", "author": "Ani R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "Always a good sammich here. With a courteous staff, creative sandwiches, and fast service, this is one of my go to quick bite places in the area.", "author": "Jannea T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "This my go-to place for a sandwich. Kitchen sink will EFF you up, that sammy is huge.\n\nIngredients are fresh, service is good, prices are worth it.\n\nThey also take card! one of the few places on Polk that do", "author": "Steven C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-20", "description": "Just goes to show how gullible hipsters are.  This place changed nothing but the decor.  The foul excuse for a food establishment that was here before (Hank's) made me so sick the 3 times I ate there that I finally figured out it was the food (READ: stomach-churning blue cheese tater tots that I had previously been so excited over) and never ate there again.  \n\nSo how pleasantly surprised I was to see that the place had changed over.  Then I went in and realized that the menu was almost EXACTLY the same as Hank's and that they had changed nothing but the look of the place.  Same sketchy service, same disgusting, overpriced, stomach ache-inducing, meat-heavy food.\n\nThe one saving grace is that they can't really screw up beer that comes out of a bottle.  Otherwise, EATERS BEWARE!!", "author": "Jon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-17", "description": "Only thing you need to know: this is THE best sandwich spot... Ever. Try the Unholy matrimony... Delicious beyond words. Staff very friendly & attentive. MUST try.", "author": "Maria A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "This place is dope..right away we get greeted by the friendly staff ..it took me a minute to make up my mind cause everything sounded good and i was a little drunk..but i went with the unholy matrimony which was recommended by the chick working the register and of course a fat tire and my girl went with the turkey club , mozzarella sticks and blue moon ..not only did we get our food super fast but it actually tasted great not to mention the old school hip hop music thats on while you're eating ..this is totally the place to eat good , chill, and be around awesome vibes ...this is our new place to munch after hours", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-28", "description": "Back from AMC\nBooze and sandwiches fuck yes! \nDrunk food for the gods", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-19", "description": "No doubt that the scenery has a nice semi-trendy vibe but I am shocked that this got a 4 out of 5 star rating. \n\nI ordered the Cannibus moment dog which includes 2 dogs in a bun, fries and chili. My friend ordered the jalapeño poppers. The food seemed to take about 15 minutes to make, which is not bad wait. To our disgust, the jalapeño poppers were still FROZEN and the cannibus moment dog: fries were still FROZEN, the dogs were totally dried out/overcooked and the chili was bland bland bland. I suppose they call it a \"Cannibus Moment\" because you have to be high in order to eat any of the food that was served to us.\n\nI have not tried their sandwiches (apparently that's what they are known for according to yelp reviewers) but I will not be going back any time soon.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-27", "description": "Wow, this place has improved massively since it was Hank's Eats. A word of advice: order anything. Get any item from that menu and it will be hearty, delicious, and more than filling. The New Yorker guy that works there is hilarious and fun to talk to. Their jalapeño poppers will blow your mind. They have a good beer selection and nice bench seating with lots of pillows. \n\nMan, even though it's such a small space, I can't really say enough good things about it. Props to whoever turned this place around!", "author": "Eliot R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-05", "description": "Zomg. I came here with a friend and split the new York and the unholy matrimony. Both were freaking amazing. The jalapeño poppers in a sandwich is a stroke of brilliance. My tummy is very Very happy.\n\nMy only reason for 4 stars?  As I went to the bathroom (you have to walk through the kitchen to get to it), they were defrosting chicken on the counter.  ON THE COUNTER.  It should be in the FRIDGE, fer chrissakes!  *eew*\n\n(I'd still go back though - it was delish)", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-14", "description": "Such an upgrade on the place that was here before, and a VERY welcome addition to the hood. Stopped in on a Sunday night for a quick bite and to catch the end of the NBA Finals.\n\nThe layout is a bit confusing, but basically you look at the huge menu on the wall, order at the counter, then go sit down. Silverware and condiments are \"serve yourself\" in the middle of the room. When looking for seating, don't miss the cozy tables up in the loft!\n\nI had the Provencal Salad - thin roast beef, spring mix, blue cheese... Yum. So good, and perfectly dressed with a nice balsamic (not too much, not too little).\n\nI also had the onion rings because another table got theirs while I was deciding. I'm embarrassed to admit that I ate the entire appetizer serving by myself, but they were really good. (NOT skinny)\n\nMy total was $13. Totally a steal. Can't wait to come back and try some of the sandwiches and other appetizers... and let's be honest, I'll probably be back for drunk food.\n\nThey've got a good selection of beer and wine, and the service was incredibly friendly.\n\nFood: 5 stars\nValue: 5 stars\nService: 5 stars\nAmbiance: 4.5 stars \n\n(The art is a little weird, but it seems like maybe it's a local artist and maybe they'll be rotating?)", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "I ordered the New York Sandwich which has pastrami, bacon, swiss, and garlic aioli. It was really yummy and the flavors were great together. $9.\n\nIt's a nice splurge sandwich. :)", "author": "Jean T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-17", "description": "Damn this place rocks!  \n\nI've been a couple times.  My new favorite is this all veggie sandwich on dutch crust bread with an added chicken breast.  My mouth is watering just thinking of it!\n\nSuper friendly staff too.  I love that Eric!", "author": "Robert M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "What in the heeyy!! No ingredient skimping over here; this place makes absurdly large sammiches that no one has any hopes of fitting into their mouths. We employed a variety of methods, including the compression technique, the open-faced solution, the careful-biting treatment, but many of us were forced to resign to the chopped sandwich salad fork and knife option. Regardless of ingestion method though, the food here is deeelicious! Yes, we did in fact brave the legendary C'est La Vie sandwich (mozz sticks, onion rings, AND calamari? not to mention every single type of animal product ever invented). It measured no less than 8 inches in height and measured no less than 9000 on the scale of holy foodgasmic. The Firecracker sandwich with spicy turkey was also a winner. Even the \"healthier\" veggie options are monstrous and keep you full for days. There's probably a tree-worth of avocados (they grow on trees right) in there. And as mentioned by others, Dutch crunch is the way to go.\n\nOther items of note: the sweet potato fries come with this sauce that is just sheer foodcrack. Smother it on everything. Drink it like heaven's mana. Garlic fries also mega winner. Also popcorn chicken. Also everything else that is fried and holy in this world.\n\nSmall cozy place to chill, cute seating, free wi-fi, moderate booze selection, no coffee. Service can be a little slow but that's 'cause they're preparing everything fresh-to-order, injecting it with tons of love, and probably sprinkling addictive drugs and hallucinatory substances into the mix, but hey, I'm not complainin' .", "author": "Carol C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-06", "description": "This gem is amazing!!! Not only do they have numerous beers to choose from, a little upstairs area to enjoy your food. But the sandwiches are absolutely mouth wateringly excellent. I've done the fire cracked and the unholy matrimony. Both of which I'd highly recommend. Both times I've been there it seemed mellow and quick, very convenient and one of the best spots to eat quick on Polk. Plus I saw that they are open late on weekends now, 2 am.", "author": "Zino M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-29", "description": "A great new spot on Polk and Post, yet another little piece in the ongoing \"Polk Gulch\" gentrification. There are many in this town who bemoan this type of change but I say \"bring it on!\".\n\nEleven O One features a wide variety of tasty sandwiches (and other things) to choose from, this time I opted for one of their specialties which features turkey, bacon, avocado and bleu cheese crumbles, excellent!\n\nThe real surprise was the french fries my girlfriend and I shared, very unique and delicious and came with an awesome tangy dipping sauce. Very friendly service as well, may have been the owner himself.\n\nSome may find the sandwiches a tad bit pricey but it's hard to knock 'em too much for that, it's gotta be tough to make it ANYWHERE with a new restaurant and particularly in San Francisco where the Powers that Be often seem intent on driving away businesses more than anything else.\n\nI understand they are open quite late which should make the Polk Street bar-hopping crowd very happy!", "author": "Mike J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-02", "description": "I find more and more cool spots in my hood!\nThis place is awesome.\nThey serve food until 2 am! And good food too!\nWe had 2 salads and some mozarella sticks... all the ingredients were very fresh. I was surprised at the food quality for such a little corner joint.\n\nThey also have a very decent beer selection, although they can't sell alcohol past midnight.\nThe decor was nice and we got to sit on the mezzanine which was pretty cool. I also really liked the latin/club music they were playing; not usually my style but I thought it fit the place.\nThe blonde girl at the counter was also very nice and friendly.\n\nWill definitely go back and this one gets a top spot in my Eating Late in SF list!", "author": "Vithiet L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "OMG YUM! Great atmosphere,  everything so good. The Hanks Blue Bites delish. Gouda Good, Corn Dog, fries, chicken wings....it's all amazing.", "author": "Rebecca K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Perfect for a late night bite, especially if you're bar hopping on Polk street.  I love the popcorn chicken, the fries and Sleeper or New York sandwich.  Don't forget to grab a cold Lagunitas too!", "author": "Bud L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "Great sandwiches and generous portions. Large menu if wraps, sandwiches and more. Try the Gobble! Nice nook of a place and great for people watching in the Loin, or relaxing or catching up with a friend. Friendly service and the cashier was nice enough to run after me when I accidentally left my folder of papers behind. Thanks again and I'll be back to try some other great eats from your menu.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "This place has become my go-to spot for good sandwiches and rotisserie chicken.  The place is clean, the staff are nice and you can always count on good grub.\n\nFood to check out:\nGulch Sandwich\nChicken", "author": "Mike B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-23", "description": "This place is great!!!\n\nThey have a wide variety of Salads and Sandwiches, and I think they have a couple full dishes like whole chicken and stuff.\n\nThe sandwiches are FANTASTIC. I've had them both drunk and sober and I stand by my opinion haha.\n\nThere was this one sandwich, it had freaking mozzarella sticks in it... Pure genius....\n\nThe ingredients are fresh, the service is good, and despite the location not being the best, it has a good space.\n\nI would strongly recommend this place for a good sandwich/salad.", "author": "Gerardo C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-10", "description": "Grabbed a Sandwich here the other day and I would say I was quite impressed. I had the Unholy Matrimony which was recommend by one of the friendly employees that took my order. This is a new restaurant located in the area of the Polk Gulch. Parking was a cinch but watch what street you park your car because this neighborhood can be a little sketchy. \nThe food was good and plan on going back as they are open till 2:00am 7 days a week! That's perfect for those night owls out there or people who work late.\nThe price is a little more than Subway but you can tell by the quality of the ingredients and taste. I can compare them to Ikes as they are equally great.\n\n4 Stars for now as this was my first and not the last.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "I love this place. My husband and I come in all the time. I get the day after thanksgiving and he gets the fire cracker. They are both amazing. The Dutch crunch bread is great.", "author": "Katelin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "I happened to stumble upon this place and decided to go in for lunch. I ordered the New York sandwich. It was really good and a lot of food. Although a little pricey I will definitely be going back!", "author": "Stephen -."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-08", "description": "The kitchen is clean. The dining area is clean. The food is tasty and affordable. What more could you ask for from a sandwich place?", "author": "Sean M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-09", "description": "I was really surprised by how nice the inside of Eleven O One looked, it had warm-red painted walls covered by paintings and art work. Comfy cushioned-seats along bright windows facing Polk St. There is an upstairs loft for a quieter atmosphere. This place advertises as late-night bar/lounge, but I imagine this would be a perfect artsy cafe! \n\nCame here for their decently priced lunches: sandwiches, wraps and salad. I got the Nicoise Salad: greens, tuna (the canned kind not the fancy seared Ahi kind), hard broiled egg, green beans and spears of perfectly cooked asparagus. It was drenched in olive oil and balsamic vinegar but by the end of the meal I realized I should've asked for it on the side- WAY too oily and soaked into the greens. \n\nStill a very delicious salad and very nice service- the guy taught me how to say Nicoise properly!", "author": "Eva H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "Great sandwich spot, open as late or later than Polk St. bars most nights!", "author": "Patrick P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "Great sandwiches, comfortable place to hang out with a LCD TV and good music. Open til midnight on weekdays and 2AM on weekends.\n\nI recommend the C'est La Vie sandwich it's huge! Easy for two people to split and fill up on.", "author": "Weston S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-08", "description": "I haven't tried the sandwiches, but the wraps aren't bad.  \n\nI would recommend that Eleven O One provides some sort of side with their sandwiches/wraps.  For the price that you charge, you should take a look at what your competitors are doing.  \n\nMillers, for instance, provides a potato or macaroni salad (along with a dill pickle) with their sandwiches - they're only a few blocks up the street and their food is amazing: http://www.yelp.com/biz/millers-east-coast-deli-san-francisco\n\nLa Boulange offers a side salad or fries (or combo both) with their DELICIOUS club: http://www.yelp.com/biz/la-boulange-san-francisco-6\n\nEleven O One - get with the program and offer a bit more than what you're offering.  Even my wrap was very skimpy on the meat and was mainly stuffed with lettuce (both times that I ordered and both were different wraps!)\n\nOne other thing... if you're going to offer soup, try switching it up from the Chicken Noodle that you seem to only offer. THANKS!", "author": "Noneya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-05", "description": "Much better than the joint it replaced. Select menu with healthy fare food (salads, wraps, soups etc) and sizable portions for a good price. Cucumber infuses ice water which I have to say is a great twist and great classic music playing non stop. Highly recommend if you're into small eats and finger food.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-02", "description": "Big sandwiches!! I'm talking Huge. And probably the best in the neighborhood for sandwiches. \n\nThey also have a few good veggie options, which is often hard to find at most sandwich shops. I'm a fan of the tree sitter which is full of veggies and fresh mozzarella and hard boiled eggs.  The service is always great here - they seem really proud of their food and their sandwiches. \n\nAlso, they usually have the game on during the weekend, so it's a good place to grab a beer and a sandwich while catching the game.", "author": "Smartwater o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "So good!  \nIMO there is a dearth of good sandwich shops in san franciso, which shouldn't be the case in this city.  But Eleven O One is definitely one of the bright spots.  My sandwich, the Day after Thanksgiving (you can guess why), was delicious and filling.  I'll definitely be back to try a different of their ~20 sandwich varieties.\nHighly recommend.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "This was good. Undecided whether really good. Will need to give it another try. Oh noes, poor us. ;)", "author": "Heather R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-05", "description": "Great sandwiches and great service. A more trendy version of Bite, a staple in the Nob Hill/Tenderloin sandwich world. Highly recommended!", "author": "Andrey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-07", "description": "Crazy good stuff here, way too many options/opt outs. Just so goooood.", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-11", "description": "Given my previous review and experience here, I never thought I'd come back to this place. Eventually, I had to after a friend wasn't satisfied with the other food options within walking distance, and I figured \"everyone deserves a second chance.\" I'm glad I gave them that chance because now I'm addicted. I'm embarrassed by the amount of times I've been back there, but I just can't help myself. They're sandwiches are so good and there are so many great ones to choose from. Right now, my favorite is the Unholy Matrimony (pulled chicken, mayo, peppercorn ranch sauce, lettuce, and jalepaneo popper).", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-16", "description": "I tried the wraps and they were good but I also ordered the home made fries and they were really bad. My order was a pick-up order and the service was really fast I'll give you that.", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-02", "description": "Things that stuck out to me (positively): their dutch crunch bread, cucumber water, interesting selection of libations, and seating.\n\nUnfortunately, the sandwiches are pretty plain.  Still, it's a nice addition to my mental list of places to eat that are open late.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-18", "description": "I'm usually there during lunch, which is great!  But the night staff is awful. Very dismissive. A little rude. I get you want to go home but that shouldn't show. The girl was very dismissive and the guy barely showed interest. I will go to Sliders next time.", "author": "Abram C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-30", "description": "I like how this place is open till 2am (even though I visited at 11pm). The soup was a bit salty, yet tasty. They have a nice variety for late night eats, and a cool upstairs seating area.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "I love the sandwiches from there, they are big and good, the only problem is that they dont have soft drinks or juices, only beer", "author": "Jose I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-23", "description": "Dude...seriously I've lived in the TL for a year now and I love little Saigon but sometimes a girl just wants a beer, sausage, and some good tunes! Super cute and hilarious service. I came here and two different friends joined me which gave me a chance to sample multiple menu items. The dogs are off the hook, the sammies are crazy real and huge like mom made, and how can I forget their beers! 23 bottles and 3-5 taps and all $3-7 wow...super cool little hang out. Overall great food, beer, atmosphere, and service. I will be here often!!!", "author": "Kayleen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-01", "description": "C'est la Vie has everything in it.  All I need is half and I share this bad boy.  Nice spot to drop by for an above average sandwich and some cheap draft options.  Bread and ingredients are on the fresher side, but the only drawback is that the prices are close to being not worth it... unless you share.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-27", "description": "Had the finding nemo salad which was OK, nothing special at all. The salmon tasted like salmon you would get out of a package from Safeway or something, very little fixings. I also had the Nicoise salad and that was good, I liked the tuna in it and it had great asparagus and a really good dressing. However, the 4 star review comes from the Firecracker sandwich. WOW, one of the best sandwiches I have ever had in my life. Salsalito turkey breast, hot sauce, mayo and pepper jack cheese--If you like hot sauce and spice, THIS is the sandwich for you! I got it on wheat bread and I enjoyed every minute of it! YUM, I dream of this sandwich!!!", "author": "Jennifer J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-17", "description": "The place is okay, maybe because I only got a salad. The portions are huge though, so there's that. Updated review to come once I eat something fried...", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "Love me some rotisserie chicken and late nite food options. Affordable prices, friendly service and relaxed atmosphere, especially compared to the shady Polk St action outside. Gouda Good is a solid choice when sober, and the Kitchen Sink rocks after many drinks.\n\nSuggested improvements:\n- fresher bread (wheat roll tends to by very dry)\n- more specialized beer & wine options (lots of standard stuff available)\n- bigger/more TVs if they want people to hang out a while, watch sports, and have more drinks\n\nI'll be back often.", "author": "Jon V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-23", "description": "This is a neat little spot on Polk with generally decent prices.  Most of their sandwich and wrap combinations seem quite inventive, but I'd say the result is more flash in the pan than flash on the tongue.  The fact that one third of my wrap was simply wrap was a problem.  The glorious combination of pulled pork and caesar salad components didn't blend beyond bland.  I also acquired some onion rings, which looked better than they tasted mostly because the breading shattered upon impact.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "Down the street from my apartment. Anytime I want a sandwich, I go here. It's not cheap but it's definitely worth the price. Draft beer is around $2-3...always good to have a beer with the sandwich. This place is also open late! They have a nice sitting area upstairs. To sum it up, Eleven O One is a good place to have food, drinks, and chill with your friends.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-29", "description": "This spot is great! Never disappointed. I order the smooth chicken wrap and it is delicious every time. The chicken is so moist and flavorful. The veggies are always fresh. It definitely a good price for the money you spend and service is always great.", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "1101 is a Great place to grab a healthy bite When In the loin. Their rotisserie chicken in particular is amazing and servings are generous.", "author": "Maggie V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-18", "description": "Frankly it was shocking to get cold food and half cooked still in frozen state dishes, not at all expected from 4 star rated place.", "author": "Sudip R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "I don't understand how it isn't packed all of the time. This is one my favorite places to go in the city for a great sandwich. The employees are consistently friendly and helpful and always make me feel welcome. The seating is nice, clean, and modern with cute loft, although the seating is too small for my legs so I have to squirm around in my seat. This place is a total gem. It's so worth the 8 or 9 dollars for the quality.. and they have a few beers on tap :)", "author": "Jamie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-04", "description": "I really like this place. The popcorn chicken, and upstairs seating arrangement is a nice change from some of the late night food spots in the area. They serve beer all the way up till bar time and the place is always clean. The staff was super attentive and nice. They even had aloe water in the fridge which I thought was awesome!", "author": "Kate D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "gobbler gobbler gobbler.\n\noh yeah and the sangria! great spot on polk, great staff and great sangria ; )", "author": "Jenny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-16", "description": "This was an ideal find late on a Saturday night when all the bars in the neighborhood seemed overcrowded, and I just wanted a comfy place to sit and sip on a beer and have a snack to match. I love their sandwich menu...the bread is just the right texture and ingredients are fresh with tangy sauces and delicious flavor combos. Their bleu cheese potato bites appetizer also really hit the spot. There are plenty of pillow-backed booths, and the staff is very friendly. Will definitely be back!", "author": "Kelly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "Great little cafe in the TL. Seems very new. Super nice staff. Sandwiches are a little pricey, but has a good gourmet kick to it. Cool music playing. Seems like a great hangout spot. I'm digging the upstairs loft.", "author": "Zach L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-06", "description": "Because of this place and Bite all sandwiches to me are very small! I tried to eat a sandwich for lunch resently at a different place I was like what? this is small! Love this place and its Tenders! and nothing is better then a Gooda Good with a Sangria!", "author": "Kev R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-25", "description": "Several friends that live in the neighborhood, as well as patrons/bartenders from the Lush Lounge (all on Polk Street) have told me repeatedly that I needed to go to this place as they raved about the food and prices. A buddy and I went earlier this week and had the Tri Tip sandwich and split an order of fries, and the sandwich was moist, tender and succulent and the bread was incredible. The garlic aioli really made the sandwich even better. The only problem with this place is that their chalk board menu offers so many mouth watering tempting sandwiches, it's next to impossible to decide what to pick, as they all are amazingly creative and sound delicious. I'll definitely be back as will my buddy.", "author": "Timothy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-09", "description": "I'm in love with Hanks blue bites and the \"Gobbler\" sandwich. It's no ordinary turkey sandwich packed with bacon and blue cheese.\n\nI used to come here when it was \"Hanks\", but despite the name change, the menu still includes all my favorites!", "author": "Lindsay G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-24", "description": "Lots of food for the money. Sandwich was ok and fries were plentiful and adequate quality. Service was friendly but seemed like it took an awful long time to get food for an otherwise empty restaurant. Music a bit too loud as it made it impossible to hold a conversation. I'll try someplace different next time.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-15", "description": "I live close by so I come here all the time. Delicious vittles, nice staff, decent beer selection, and comfortable atmosphere. I'm very happy these guys moved in. Shit I think I want a sammich right now.", "author": "Wayne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-04", "description": "I love this place. I would say this is the best salad I have ever eaten! The greens are wonderful and dressing is perfect. \n\nMy boyfriend and I have been here about 5 times and I have always gotten the salad - never let down. My boyfriend has gotten something different every time - always gotta be something meaty for him - and always good. \n\nThe atmosphere is great in there too. I really hope this place doesn't go away because it's so small and not in a great location. \n\nGO HERE!", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-02", "description": "Grab yourself \"The Kitchen Sink\" sandwich with some sweet potato tots and wash it down with a Chimay blue.  You'll feel the euphoria wash over you.  Excellent sandwich, excellent service, excellent tots and a great selection of beers.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-16", "description": "sweet potato fries with the cayenne mayo sauce...woo hoo...enough said.", "author": "Phil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-26", "description": "Went back a couple days ago. The food was over cooked and lacked flavor. Still a good concept.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-03", "description": "This place is clean, classy and their food is AMAZING. We tried the Cannibus Moment Dog (great!) the Carribean (too salty) and the Love Affair (mmm!). They also serve Framboise- an amazing raspberry lambic beer. The atmosphere is very nice and our waiter was super friendly.", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-02", "description": "Great sangria. The food was just ok. We got hot dogs, but they were kind of hard to eat. The bleu cheese tator tots were good, but a little too much. Want to come back to try the sandwiches though", "author": "Olivia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-06", "description": "this place has some decent chicken sandwich and salads. The service is great and the prices are reasonable. I eat here at least 3 times a week, and always had a decent meal.", "author": "Bob b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-05", "description": "My friend and I got these delicious sammies the other day. The sandwiches themselves were great, nice thick bread and creative sauces/ingredients. The fries were like two stars though, i hate it when fries aren't soft. I like a place that serves sandwiches AND beer, so I was stoked with my Stella and gouda chicken sandwich. Tip: split! The sandwiches are massive.", "author": "Cat M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-11", "description": "Great food - especially the tater tots and onion rings - anything fried, really. Good service and cheap beer!", "author": "Machinations F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-15", "description": "I came in and left wondering why this place is under the sports bar category when there's nothing bar like about this place, other then the fact that they serve beer and wine, which we all know, does not a bar make. Elven O One isn't a bar but a place to sit down and enjoy some good eats. My friend and I were in the neighborhood to check out some places to celebrate my upcoming birthday. Both of us were hungry so I suggested we stop in. I ordered Hank's Blue Cheese Bites (tater tots drenched in blue cheese goodness) for my friend and I (even though I ended up eating most of them, I feel no shame), a Texas wrap that was oozing barbeque sauce and each jalapeño was more spicy than the first, and a Bitter American all for $17. My friend originally ordered a California Hillbilly wrap but after being informed they were out of pork decided to get a Texan wrap as well. One wrap could easily feed two people but we were both hungry and left our plates practically empty. The guys working behind the counter were friendly and gave good service. The décor was nice but the couches and throw pillows had some wear and tear. Next time I'm bar hopping in the neighborhood and in need of pre drink or after drink(s) food I'll spend my money here rather than sliders and I'll drag whomever I'm out with, with me.", "author": "Angee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-25", "description": "ABSOLUTELY AMAZING!!!  All of there food is great, very friendly staff, chill music, very fun atmosphere, the list goes on... My twin brother and I go there often, always leaving happy! Go there you'll love it!", "author": "Kyle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-11", "description": "Delicious sandwiches. Gonna have to try them all now.  Also, cheap beer around the clock.  $3 for a Sierra Nevada?  Yes please.", "author": "Bradley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-18", "description": "This place is pretty cute for the polk area. I'll probably be back to try the sandwiches.", "author": "pizzazz g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-23", "description": "Love Affair and Watermelon Beer. Great Lunch place with an extensive sandwich/wrap menu and open til the wee hours. My new go-to in The Loin.", "author": "Brianna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-05", "description": "Um...you had me at hello?  I could order their entire menu in one drunken stupor, die trying to consume it all, and be fully at peace with my final moments here on earth.  I really hope this place doesn't ever leave: If heaven is a fry basket, then Eleven O One is the conduit to eternal life.  Thank you, and Amen.", "author": "Katrina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-22", "description": "What more can you say? Tasty food, huge portions, reasonable prices for San Francisco, and friendly service.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "Great customer service! I live in the neighborhood and it's hard to find a place like this where everyone always seems like they're genuinely in a good mood every time I come in. The atmosphere is great, there's always tunes playing and everything is clean and aesthetically pleasing. There's a little balcony area to sit in, which is cool--kind of like a VIP lounge. The menu is KILLER. So many good eats-- the sweet potato  fries and spicy dip that comes with 'em, the chicken caesar wrap with tons of awesome meat in it, and my favorite has to be the Day After Thanksgiving sandwich (it is really hard to find a good cran-turkey sandwich in this town)! And my favorite thing about Eleven O One is that they're open LATE! Please go eat/drink/hang here!", "author": "Amoeba D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-30", "description": "It's so great that this place is open late, perfect for grabbing a bite on the way home from a bar.  The sweet potato fries are my favorite, although every sandwich I've tried so far has also been delicious.  The servers are very friendly and the food comes out quickly.", "author": "Joni G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-13", "description": "Ordered over fifty dollars of food - waited two hours - not even the courtesy of a call from the restaurant.  texted grub hub who called back and said that the restaurant contracts with a delivery service that had not picked up my order.  Cancelled and asked that the charge be removed form my credit card.", "author": "James B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-04", "description": "i just moved into the neighborhood and discovered this great sandwich spot.  on the pro-side, it's a block from my apt!  yay.  on neg-side, they only have 2 veggie sandwich options.  the one i got, tho, was super-yummy and the guy working there was really nice and friendly -- that goes a long way in my book!  i'll def be back.  and apparently they have wifi -- a nice spot for lunch and for me to do a little work while kicking back watching the lively streets in good ol' polk gulch.", "author": "Diane D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-04", "description": "love the corndogs.  i'm not a big fan of shredded lettuce on sandwiches though.  always nice when i call in orders for pick up too.", "author": "Shannon C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-22", "description": "Thought this would be good- the sandwich sounded good - unfortunately I'm covered in hives, and my throat is on fire now, after specifically requesting sauces to not be included, and them adding something else to the sandwich. When a customer requests absolutely no sauce to be on the sandwich- you should listen to the customer- there is probably a good reason, and I asked them if there was more than the sauce listed on the menu, and told him I have food allergies, and the server informed me that there was not - so I assumed I would get a condiment free sandwich. Nope, it was slathered in that sauce, and mustard (which was not listed as one of the items they would put on it)- and after a few bites I noticed their error, and now I am sick. \n I had the sandwich togo, and got out much too late from work to go get this replaced - I'm really pissed off, because I spent over $13 on food that made me miserable after eating only a few bites. I work in a restaurant too, and if I were to make a mistake like this, I would be fired. Will NOT be returning.", "author": "Alexis S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "my new late night munchie spot, open til 2 am some nights.  food was hot and tasty, fresh cut fries.  the only complaint i could have, would be no salt on the fries.  but i ordered at 130 am, and was met with good customer service when i arrived.", "author": "mike f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-20", "description": "Nicoise salad is awesome, and the wraps are dope. They now have the Gobler and Chicken Gouda sandwiches from the sandwich shop up on Sutter \"Byte\". Both amazing sandwiches They take pickup orders too, nice people.", "author": "edgar s."}
