{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "I came on a weekday about 6pm.  There are BIG tables there where it seems families and large groups come together for events like birthday parties, events, etc.  A fourth of their menu is even devoted to serving groups of people.  I was only 1 person and there weren't any 1-person tables, only 4-person or more tables, so you should definitely BOOKMARK Empero for LARGE groups like Family/Relatives if you want a bargain in SF for large groups!!  However, they also have lunch specials for individuals.\n\nI only ordered the French pork spare ribs($10.98)[reviewers Jason C on December 20, 2017 and Cathy W on April 7, 2012 have good pics of French pork spareribs]  with white rice(after seeing the great reviews on this entrée, I was eager to taste it!).  !  After reading the reviews about how much food they gave, I also didn't want to order too much that I couldn't eat.  Not everything's on the menu like iced water, drinks & desserts, so you should ask them if you want those items.  They also have a $10 minimum for using your CC.\n\nAt the start, they also gave me a pot of green tea and a small cup of soup which tasted very nourishing with small scraps of potatoes, carrots, and meat which reminded me of my mom's soups which wasn't just hot water with a few tossed scraps tossed in like most Asian restaurants.  Instead, it tasted like it had been cooked slowly for a long time and the small bits of vegetables & meat were so tender, truly a real nourishing tasty broth-like soup.  I usually hate soups since they're just hot water that fill me up too much before the entrees, but this was one \"soup\" I finished with relish!  This reminds me of what the classic Chinese restaurants were about, not just what was on the menu but a whole dining experience which may have included a pot of tea, mini appetizers, mini soups, mini salads, etc. before your actual entrée dishes came.\n\nLet me get on my rickety soapbox about fried rice in most Asian restaurant menus.  I am ASTOUNDED by seeing $8 to over $10 for fried rice in most Asian restaurants.  Fried rice originally as all Asians know is supposed to be about saving last night's leftover rice for the purpose of eating it the next day. Asians are frugal with food and don't believe in just throwing away food.   Well, to \"revive\" or make leftover cold hard rice more appetizing to eat, Asians had to reheat it in the frypan (usually a high walled wok pan to keep the rice from spilling out) with cheap or free ingredients added from yesterday's leftover chicken, meat, etc along with any chopped veggies you saw in your refridge .  If there were no leftovers, you added spam or scrambled eggs, bacon, etc.  And you added butter, msg, salt & pepper and whatever spice you wanted for seasonings.  All of this was made at home for the price of basically NEAR $0 since the WHOLE PURPOSE was to NOT THROW AWAY LEFTOVERS.\n\nBut now at Asian restaurants, you're paying $10 or more for fried rice??!!  OK, I get that they use a lot of animal protein and their rice is fresh steamed (not leftovers), but they should divide the fried rice into 2 groups with one being LIGHT SIDE DISH fried rice which should be just mainly cheap vegetables & seasoning & tiny amounts of meat or just eggs(maybe call it house fried rice) and so the cost should be $5 or lower!!  The other group of fried rice should be ENTRÉE fried rice for people who want all that animal protein & premium ingredients and want it more as a MAIN MEAL, rather than as a side(even though there's already lots of meat in the entrée dishes) and THAT'S what should cost over $10!!  To me, it just doesn't make sense paying over $5 for a side that's supposed to be a leftover!!  To me, it's like eating something you could make cheaply & easily at home especially when you have leftover rice in abundance!! :)-  It's like people have lost the desire to cook simple foods and have surrendered their cents & senses(yes, pun) to restaurants & corporations.  I LAUGH and WALK ON BY the supermarket's PF CHANG'S frozen fried rice for near $10!!  LOL  Yeah, like I'm willing to hand over real money just to get FROZEN fried rice with a SMALL SMATTERING of chicken or shrimp!!  \n\n............Back to our regular scheduled program............\n\nThe servers were nice and prompt.  Their French pork spare ribs is very different from the usual Chinese ribs.  The French pork spare ribs has more meat than bone, but the meat is sliced thin to easily eat & cook tender, although you have to make sure to not swallow the small bone part.  .  The texture is slightly crunchy on the outside and tender on the inside, sweet but with tangy spices along with the sweetness. And they give you A LOT!!  This was served on a bed of lettuce, a couple of sliced tomatoes & cucumbers.  Even if you only had a light lunch, 1 entrée will be more than enough for 1 person!!  There's lots of street parking.", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-24", "description": "My family and I made reservation for 16 for my moms birthday at 7pm. This means two tables. When we make reservation, we expect the two tables to be ready at 7 when we come. But it was not. We prolly didn't get seated at the tables until 7:30!\n\nAside from the disorganization, the food was pretty decent. My family and I order a lot of stuff separately.  The lobster noodle was the best in my opinion! I also love the sizzling rice soup! I recommend ordering the food separately and not the family plan set meal! We got a lot of stuff and it turned out to be less than the family meal.", "author": "Shw L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "Family ordered a la carte and found everything to be pretty good - not too salty and quantity plentiful.\n\nWe started off our meal with some house soup which was good for warming up our tummies on a windy SF night. Next came the garlic pea sprouts and some stir fried bean sprouts with beef cubes. The pea sprouts were a little older (tougher) but still had a nice crispness to them. As for the stir fry, the bean sprouts were crunchy and the beef was tender - I'd recommend this dish.\n\nFollowing this came our dishes of three mushrooms and tofu and dried bean curd with rock cod filets. Both were good in my opinion, but definitely way too much gravy for both. Following this came our order of mushu chicken. The wrappers were absolutely abysmal in my opinion - stuck together and oversteamed/dry. But where the wraps failed, the stir fried filling was done nicely. This dish was also very hefty for just 6 wrappers. We didn't hesitate to take home the leftovers and simply combined it with noodles for a \"new\" dish.\n\nFor rice, we had dried scallop and egg white fried rice. I found it too true to the name, it only had dried scallops and egg white. Typically, it would also include scallions and the ends of gai lan, which adds a nice fragrance and crunch to the dish. Oh well.\n\nDessert was complementary and it was taro dessert with clear tapioca. YUM. One of my favorites!", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-18", "description": "This was my first real experience with Cantonese food, and it was a good one. If you're used to \"American\" Chinese food, do not expect a meal at all similar to that. My group came in for lunch and we were seated immediately. Our table ordered family style and the locals with us chose all the dishes. It all tasted very fresh and well seasoned. I think our spread could have used a little (lot) more seafood after noticing all that they serve while checking on here, but I suppose not everyone loves seafood as much as me. My table consisted of people literally from all over the world/country and everyone loved it. All is served on a rotating platform on the table, so make sure your friend across the table is done getting the food on their plate before you start spinning it! Or this could be a very useful tactic in keeping as much of the Cantonese goodness for yourself. Whoever can spin the spinner fastest wins, and everyone else leaves hungry. Muahaha!", "author": "Dakota C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "My family (plus some extended fam and friends) was doing a dinner on a random Wednesday and picked Empero Taste. Everyone was already here when I arrived on May 16th around 6:30pm. Not sure if we had a reservation, but we were a party of 12 people.\n\n$238 for 10:\n*Fish Maw & Seafood Soup\n*Prawns & Chicken with Green\n*Abalone with Green\n*Clams in Black Bean Sauce\n*Spicy Salted Prawns with Shell\n*Lobster E-Fu Noodle\n*Steamed Queen Empress Chicken\n*Salt & Pepper Spareribs\n*Steamed Live Black Bass\n*Yan Chow Fried Rice\n\nWe got the menu above, but I think we got the French Style Pork Spareribs instead of the salt & pepper and a Whole Fried Fish instead of the steamed one. I actually didn't care for our replacements as I found the french spareribs too sweet. I adore the steamed prep of fish, so I was bummed we didn't get it. It's actually one of my favorite dishes. Out of the rest of the dishes, my favs were the chicken, abalone, and rice. The chicken was moist and silky. The abalone had a nice chew. I also enjoyed the broccoli that came with it. I'm normally not a big rice person, but the yang chow chao fan was fried nicely and had a good amount of shrimp, pork, etc. The salt and pepper prawns were also fried nicely with good savory spicy notes. The lobster was good, but the yi mein was way too soggy. Very mushy. The soup and shrimp/chicken dish were average. The soup could have used some more seasoning.\n\n*Chicken Soup with Cordyceps Flower\n*Ginger and Green Onion Crab\n*Salt and Pepper Fried Crab\n*Chinese Bacon and Preserved Green\n\nSince I come from a family of gluttons, we also added the items above. Both crabs were a good size. I'm a fan of the ginger scallion prep, so I enjoyed that one more. The salt & pepper one was pretty good too. Came with a good amount of fried bits of meat and peppers. I'm not big on the soup or the pork dishes above, so I found both to be okay. The soup was a bit too sweet for me. I'm not into stewed meats, so I found the bacon mushy. To finish our meal, we also got a green bean dessert. Standard for all chinese dinners.\n\nWe bought a bottle of wine to accompany dinner (I believe for $12) and a few bowls of rice, so overall, I think our bill totaled $349.22. Not bad for all the dishes we ordered. Great place for good quality cheap eats.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "Hidden gem of outer richmond.\n\nThis place is not a fancy Chinese restaurant, heck it's far from it but it does standard Cantonese fare well and at times with a twist.\n\nThe highlight was the seafood crispy chow mein.  The ingredients are not of the best quality, but the skill and attention to detail shines through. For example the oil used to fry the noodles made the noodles itself very tasty. The noodles are also spread out onto the plate with the meat and veggies in the middle. Instead of a regular dish, it's served in a large plate so the gravy drains towards the middle. What ends up happening is that you get crispy noodles through out the meal as the gravy stays in the middle keeping the noodles crispy. Just this simple technique and plate made this chow mein more enjoyable than places cost 2 to 3 more!\n\nAnother standout was the French style spare ribs. It was a cross between your typical sweet and sour spare ribs and the salt and pepper spare ribs. It's sweet savory and deeply garlicky. \n\nWe also got the clay pot tofu seafood and pork belly with preserve veggies. Both were also prepared well. The fresh lettuce gave the pork belly a contrasting crunch. \n\nIt's awesome to find an excellent inexpensive Chinese place done well. Chef's ability trump all. Skill hands can turn boring to awesome!", "author": "Jason C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "My go to restaurant for Cantonese style Chinese food. Consistently good, quick service. I order food to go a lot, especially coming back from vacation. Nothing beats home style Chinese food!", "author": "Regina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "Came here for basic family dinner the other night. Was able to score parking too! It's difficult some times to find parking because of the residential neighborhood. Can we talk about the Engrish of the name though...\"empero\" clearly someone forgot a \"r\" at the end \n\nThe food here is good, and it it a hit or miss depending on what you order. Can't vouch for the entire menu, but will say what we did order: \n\nFried flounder: great! Lightly battered and not oily. Some other establishments you can tell the oil is not fresh due to the color on the item. Here, was not a problem. \n\nGiant clams with noodles: love this dish! It's about $10+ for each giant clam and it's split in half. My mom can make this at home too, but access to the giant clam is not a guarantee. Love that the cellophane noodles soak up all the sauce. \n\nFrench styles pork chops: AMAZING! I definitely recommend this, particularly since I haven't seen it at any other menus. The fragrant taste is attributable to the fried basil. This is better than any \"Peking\" style ribs. \n\nChinese broccoli with squid: a good veggie dish with a good amount of everything. \n\nThe restaurant overall is a good value. Don't expect great service.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "I come here on occasion and the food here is always phenomenal. It's always hot and fresh as well as quick. The portion size are great and we always order family style. Everything I've had on the menu from deep fried to boiled and fresh are always scrumptious. \n\nFavorites are the oyster and black bean clams. Their salt and pepper pork ribs and pawns are also really good. I think my favorite will be the fried green beans with fish. They deep fry the fish and green beans then they do a stir fry all together. it's great with rice and I love it for leftovers. \n\nOther things they do well are their Singapore noodles and beef chow fun. I really enjoy coming here and they are so friendly. I look forward to visiting when I can.", "author": "Leme K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-17", "description": "First, this is a no frills Chinese restaurant in the Richmond District, and probably the only one that have a decent size dining area for special days like Mother's Day. On special days and the day prior this place gets busy. So busy they service decreases dramatically. We had a party of 30 (three tables), one table never received water like throughout the whole dinner. The only table did not get one of the orders (choy). We ordered three of everything for each table. Of the 7 items we ordered for the three tables, most did not come out the same time so we ended up sharing plates across the able rather than have one table wait for their order. Some took 20 minutes longer than others. Basically, coming here when it's busy mean lot more patience is required. The food is good. The hot plate plate beef, ribs and catfish were the best. The stuffed chicken with sticky rice is very filling and one order could've feed all three tables. Everything here is old and parking is horrible but it is a great place to enjoy family dinners.", "author": "Gerald H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-12", "description": "The food and services are not prefect. But hard to beat the price. I and my family come every weekend for dinner. We like their seafood especially the lobster. Most of their dishes are decent.", "author": "Keung M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "My favorite dish is French style pork chop which has the most unique taste of basil & tender pork chop.  If you prefer salted fish, don't miss their salted fish chicken fried rice. BTW, very generous portion for lunch dish.", "author": "Wendy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "Came here looking for some good Chinese and this turned out to be pretty decent spot.  First off the restaurant was nice, clean, and similar to many other Chinese spots I've been too.  Staff was super quick and courteous.   \n\nWe ordered fried rice, garlic bok Choi, sizzling Mongolian beef, mapo tofu, and vegetarian combination.  The sizzling Mongolian beef was by far my favorite but everything was very well cooked and seasoned.  The dinner meals all came with a pork based soup which was okay.  The portions were huge and the food was tasty.  At the end they brought out a dessert item, wasn't sure what it was, and it had an interesting taste but we ate it anyway.  \n\nIs definitely come back here since the food was good, plentiful, and the price was right.", "author": "Dan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "This restaurant is hands down on of the best for the value. The food is consistently good over the years. I have been coming here for many years and take out quite a bit. I have never had a bad dish either take out or dine in. Good food and reasonably priced! Love it here.", "author": "Sam H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "This is a favorite place of my mother's for take out. I find their food inconsistent. \n\nThe shrimp fried rice is good. Beef chow fun is hit or miss and needs hot pepper oil to make it edible. The chicken won ton soup was in the salty side.", "author": "michelle l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "My mother likes this place, the food is pretty good and the price is reasonable. I highly recommend the dinner packages they offer. The lobster noodles and Peking duck was delicious.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-14", "description": "OMG !!!\nWhere is the chicken?!!!\nAll flour and no chicken!!!\n\nCalled to complain...she said no more chicken and refused to give us a refund....finally she said ok....\n\nSee pics..", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "Recommended by some Asian friends--I'm glad I listed to them! Great value--large portions, fresh ingredients, good seasoning--we'll be back! \n\nIt's a popular place so be prepared to wait a little.", "author": "Mj S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Not sure how I missed posting a review for this place but here it goes.  This is where one of my favorite Chinese joints used to be...Best Panda.  \n\nWe tried the following a couple of weeks ago.  \n\nFood = great. Some items are slightly more greasy than others. \n\nPork stickers = good flavors and not greasy. $6.98\n\nSpicy salted wings = good. $8.98 \n\nChicken wonton soup = Good, and one order is plenty for two (or maybe three.) $8.98.\n\nBBQ Pork fried rice = good, not greasy and not overly salted. $8.98.\n\nMixed vegetables = Not just broccoli (which I love but I know it's cheap) and not full of zucchini (which I dislike but will consume). Dried beancurd Chinese greens, shiitake, beansprouts, broccoli, carrots, napa cabbage and bean thread. One of the better vegetable combinations that I've had. $8.98.\n\nScrambled eggs with shrimp over steamed rice =  awesome. Simple scrambled eggs with shrimp and scallions (not greasy) over steamed rice.  (I've made return trips for this dish, because it's a comfort meal for me, and the closest to shrimp with (white) lobster sauce that I'll ever get.) $8.98.\n\nService = friendly.  We've only had take-out here but they are quite friendly and polite. \n\nPrices = moderate but the portions are quite hearty. Dinner for two came out to $56.29 with leftovers for two more meals!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "One of my top 3 cantonese restaurants in sf! The food is delicious and the service is fast. The workers are super nice and the prices here are right! I love this place!", "author": "Ruhjeenuh Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "The food is decent and the portions are huge, great value for your money. Avoid the weekends if possible...otherwise, service is horrible!!", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Great place to bring your family, \nlarge portions at reasonable prices. Service is great, unless the restaurant is fully booked. Order the prix fixe family menu, to get the most bang for your $$$.", "author": "Roland F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "I liked the Rock Cod w/ soft Tofu and the Salty shrimp.  Good portions.  \n\nService is quick.  The local, elderly Chinese from Richmond district eat here.\n\nClose to Lands End and Legion of Honor, in case you are a tourist.", "author": "Xs X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "I like this place. They serve delicious Chinese food for decent prices. We have been both for lunch and dinner. Service is good and fast. For dinner and lunch, They give you free house soup which is always a nice on a cold day.  I can't complain about anything at all - this is now my go to Chinese place.\n\nDishes I recommend :\n\nHoney pepper beef strips \nBlack bean clams\nGarlic pea sprouts (seasonal)", "author": "Jannie Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "Well priced, here our family dinner place like their crab meat soup, spicy fish, and fujian rice.", "author": "Qing L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-23", "description": "This is a great little neighborhood Chinese Restaurant with a great selection, fresh ingredients and served hot delish at the right price.  I should give it a five but I've only been once and only had three dishes off of the three plate lunch special.  But can ya believe that the menu has 236 different items!!  I didn't go over the entire menu in detail but just under pork, they have 17 ways you can get it.  It's a fun place and for us, the service was quick and efficient.  Mind you that we went right when it opened on a weekday so maybe that's why it was so quick.  I can imagine that with a packed house and that many different items, some coming out of the tank, it might take a while.  Just cleaning and scaling the live fish would kick it out to 20 mins.  Haha.  My stuff came straight from the refer, to the wok and then to the table.  This is definitely a place to go multiple times to get negotiate a bit thru the menu.  At least they worry more about the food than getting the name right unless they just ran out of space for the R.", "author": "Wayne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "The food was absolutely wonderful, from preparation to presentation, very pleasing. We especially enjoyed the lobster is really fresh, all the food there have a good portion and fair price. I'm highly recommend this place if you want or dinner.", "author": "T I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "Okay food. Mom likes coming here. They used to have pretty good specials for 4 or 6 family style dinners. Now the family style set dinners are catered for larger groups. The food is okay. Abit too much sodium and oily.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "This is a bit of a go to place for my family and quick lunch because it's in my neighborhood and has great value.  The place can be considered Chinese-y as the food is Cantonese and they have varietal \"Live Seafood\" with aquariums.  That is important when I'm looking for a family meal.  \n\nI frequent the place often but it may not be a place I drive long distance for.   The food is descent but it can be too starchy occasionally depending on the item or even the days you go (I think head chef is off Mon/Tue as revealed by the server upon my inquiry).\n\nMy typical order can be anything from:\n\nSteamed fish   (Live cod or similar)  2-way or 3-way available\nCrab   (Scallion/Ginger, Salty egg yolk)\nGarlic Seasonal Veggies  (Peasprout, Yam leaf, Chinese Watercress...)\nSalt / Pepper Spareribs\nScallion Chicken 1/2 to whole\nSteamed Oyster or Surf Clam Vermicelli\nPan-fried noodles\nHoney-walnut prawn (a bit small in comparison to other dishes)\n\nMost of the dishes are adequately made and on par for my consideration but not outstanding comparing to some of the high-end places I've been.  However, the values here are great and the portions are pretty big, so I'm not going to complaint.  I've had other dishes too and they seem to be about the same...  a bit unrefined as well.  They are typically semi-busy because of their value and neighborhood status.  I also want to mention they have family meals which is great for medium to large groups (they have lots of big tables).  The service is OK, they can get overwhelmed when busy...  they try, it's casual, not those expectation of fine dinning.  By the way, parking can be a hassle and limited.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-30", "description": "It's a bargain for unsanitary Chinese food. I have heard of poor reviews about how unclean they are. Thought I would give them a chance. For sure, they disappointed on my to-go order...\n\n At first, I found  a piece of long hair in my fried rice, meaning no one was wearing hair restraint while preparing the food. \n\nSecond, I scooped out a big piece of plastic....\n\nEwww.....my appetite and money were gone!\n\nIt's up to you if you want to give them a chance. Thought I would share with you what I found...", "author": "Elm E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-21", "description": "Emperor Taste, you used to be so much better. I don't know if you've changed chefs or are just catering more to white people, but everything is so damn salty. Portions have gotten smaller, and dishes come out in the wrong order. Two fish dishes came out, and the clam-with-oyster-sauce--in-lettuce-wrap appetizer came out at the end. I like how they've changed up the wok-fried crab into a more deep-fried one with calamari, but that's about the only thing that worked in this meal. Even though everything was overly salty, the classic steamed fish was raw at first, and they forgot the soy sauce. Even the e-mein in the lobster was seasoned. Why? There was also this super funky rice dish with the sweet and sour sauce from kung pao pork and egg broth from the soup, all combined onto a plate of fried rice. Really not sure what's going on here.\n\nThey also upped their prices. $10 credit card minimum, but that's not really an issue. Who gets under $10 of food at a Chinese restaurant? Empero Taste, you are no longer a good spot to go for dinner.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "I own the motorcycle shop across the street.  And I am so lucky to have a fantastic restaurant on the same block as me. \n\nThere are a few restaurants near us but this one does it best.   Prices are fair and food is delicious.   The ladies are also very sweet and courteous. \n\nDid I mention how lucky we are to be neighbors with this awesome Chinese restaurant?", "author": "Miguel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-06", "description": "Good food, easy sunday parking, huge portions and good service. \n\nSkin on the lamb was too much for me but that's on my end, no fault for the restaurant.", "author": "Asa R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-04", "description": "Came here tonight for my grandfathers 90th birthday! Had a little family reunion going on even though we live within 10 minutes of each other, its rare the family is together all at once with our busy lives. \n\nSpotted my cousin crossing the street as I was looking for parking and she pointed at one right outside the restaurant. Score! Everyone else had also found very near by street parking so you won't have to worry about that. \n\nOrdered a variety of dishes but I don't eat meat so my options were limited. I had two bowls of the egg white and shrimp soup. Kind of bland without the white pepper. I also had about 20 of the black bean oysters and a couple of fried shrimps. \n\nService was whatever. Better than your usual rude Chinese waitresses I suppose. Had to ask them to change our plates halfway through the meal. I saw them prepare about 7 massive bags of take out so I think this place is popular for that. \n\nThe dessert at the end was the best part especially because no one had bought cake. WTF a birthday with no cake? Apparently it was at the request of my grandfather to not get a cake though. Good thing the yummy red bean soup made up for it!", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-07", "description": "Food is pretty good and the portions are big.  The restaurant gets quite  busy so go early or make reservations.  We had crab with ginger and scallions, salted fish and chicken fried rice, stirred fried green beans with pork, and lamb and tofu clay pot.  All were very good with the exception of the lamb clay pot.  Would definitely go again!", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-19", "description": "Come here for my parents' church annual luncheon. Did like family style 10 course meal. We had spareribs, fried rice, soup, crab and lobsters, abalone and bok choy, fish, honey walnut shrimp, clams, and seafood plate. although their food are good and had a lot of flavor but i felt they put a lot of msg on their food. You can get your money worth since you can get a lot on one dish and their price is very reasonable. If you eat too much, you can always go to the beach for a while since the beach is a few blocks away from this restaurant. \nWhenever i do come here, the staffs are always friendly and the service is not bad. The food do come out at a fair time.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "This is my families go to Chinese restaurant in the Richmond District. We know the wait staff and are regulars. Service is what you would expect of a Chinese Restaurant and they definitely are consistent. Their massive menu will always have us trying something different and yet we still love their Staples. If you have a party of 5 or more then make reservations. They packed incredibly quick. Their banquet menus have plenty of food to feed even the most hungry of people. Love love love this place and would always come back", "author": "Brian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-24", "description": "We came here for dinner and the food was average. The seating is a bit cramped and hard to get in and out to the restroom. The garlic black bean clams were very good. Service is slow: no one ever checks on you after the food arrives. Our empty teapot never got refilled with hot water. The chow fun noodles are very greasy and the crispy honey shrimp was over battered. Not bad for the price but nothing special.", "author": "Wanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "This is my go to Chinese food spot. Been coming here since they were Panda country. Good food, friendly staff. Food comes out quick. Their chili condiment is very unique, haven't seen it anywhere else.", "author": "A B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "Relaxing environment, quick serve time and decent portions sizes will have us coming back. Flavors were on par and the entire meal was inexpensive considering we had a 2.5lb crab on the table.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-17", "description": "Ordered what I thought was a vegetarian dish: MaPo Tofu. Got it to go otherwise I would have sent it back. It came with a huge mound of white rice, a decent amount of tofu on top of a bed of pork! I was horrified when I found that!  Not sure if it was how I ordered or what next time I will definitely specify I meat!", "author": "Gee W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-01", "description": "Parking in this 'hood?\nTough.\n\nLunar New Year's Eve Dinner?\n630.\n\nDivey digs?\nYup.\n\nPleasant company?\nNaturally.\n\nPlay pass the baby?\nGimme.\n\nSeafood soup?\nOK.\n\nMy opinion of the fried pork?\nSalty.\n\nKid's opinion of the fried pork?\n\"Scrumptious\"\n\nFried chicken dish?\nDry.\n\nPeking duck skin?\nGreasy.\n\nPrawn and Walnuts dish?\nDelish!\n\nOther dishes?\nForgettable.\n\nRed bean soupy dessert?\nIck.\n\nWish I was at Kirin instead?\nhttp://goo.gl/rl2P3K", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "My boyfriend and I's go to spot when we're craving Chinese food. It's literally across the street from our apartment. Food comes out fast. My boyfriend's go to was the salt and pepper pork chops and mine was the salt and pepper squid (calamari). They were both fried, salty and mixed with tons of pepper and garlic. Always super tasty. Their wonton soup was really yummy as well! We typically got food to go since it's so close to our apartment, but the times we were there the staff was friendly and quick. Looks like a great place for families to have dinner. There was always a ton of people each night eating at the restaurant. There's nothing extremely special about this restaurant, ie. there's no dry fried chicken wings like shanghai house, but its a great alternative if you're not looking to wait in line forever.", "author": "Rochelle I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "I just had them cater a school lunch for me.  The food was excellent and there was plenty of it too.  It also came hot, not lukewarm.  It literally came down to about $6 per person for a buffet.  Where can you get that?\n\nWhat we had:\n\nVeggie Chow Mein (ok.  A bit on the wet side especially if you were unfortunate enough to get a scoop from the bottom)\nShrimp Fried Rice (good)\nEgg roll (they put vermicelli noodles in it!)\nPotsticker (I think these were frozen but still good)\nbroccoli beef (a fan favorite.  We ran out)\nOrange chicken (ditto)\nBraised tofu and mushrooms (we got a lot of this left.  Still good but I think there were a lot left cuz some of the kids didn't want it)\nSweet and sour pork - I'm eh on this only because it was a soggy goopy mess.\n\nOverall it was the best bang for our buck.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "Good food.\nGood service.\nLarge portions.\n Nuff said.", "author": "Nuno M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "Delish n good portions. Try the fried calamari!  Good selection for family dinners too.  Staff friendly", "author": "Alberta C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "Went to this Chinese restaurant at last\nminute. Was very busy but was seated right away at 6:00 pm.\nWestlake soup: *****\nHakka stuffed tofu: *****\nsalt and pepper pork: *****\nPork belly and preserved vegi: *****\nBeef and string beans: ****\n\nExcellent Restaurant \nIn the Richmond District", "author": "B O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-15", "description": "Price (Value): 4 stars\nFood (Taste): 5 stars\nService: 4.5 stars\nAtmosphere: 4 stars\n\nA great value restaurant in the Sunset if you're willing to travel a bit off the well established roads in the district. Situated on Balboa in a non-descript corner is what is the \"NEW\" Empero Taste. The original establishment was mediocre or below-average, but under new management for the past year and more, Empero is quickly re-establishing itself as much more service friendly, great-tasting and authentic Chinese cuisine experience.\n\nThe prices are great when compared to other Chinese restaurants in the region and the taste is superb, and I eat a lot of Chinese food.\n\nService has dramatically improved (one of the main reasons why I stopped visiting this place a couple years back) and the atmosphere has grown much more lively with regulars coming back fairly often.\n\nDefinitely a place I would re-visit in the future! 5 stars.", "author": "D K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-01", "description": "I really really want this place to do well..\nI know there are too many random Chinese restaurants, but I REALLY like this spot:\n\n- Service is always super friendly! \n- Reasonable prices for lunch or dinner\n- Enough variety for the newbie as well as those looking for more authentic flavours\n- Some of their special dishes require 48-hr notice, keep that in mind\n- They actually grocery shop regularly and only buy good quality ingredients of the week\n\nOk, so maybe I particularly like them because we're fellow canto-speakers,\nbut I genuinely like these guys, and the owner always stops by to see how \nthings are going. He's old, squinty, and way casual but takes pride in his food!\nTheir seafood is really fresh and my grandma loves it, which is a plus.\n\nFamily lunches always start with a soup/broth and finish with sweet red-bean dessert.\nOne mein, two meats, two veggies, one claypot, and steam rice all around.\nWeekend evenings get insanely busy, so make a reservation if you're determined,\notherwise the wait can be pretty long (as it's normally large groups).\n\nLooking forward to coming back.. next time I'm trying their porridge,\nas winter is coming and that's always porridge season!", "author": "Jade T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-16", "description": "They specialize in large groups and don't seem to be able to scale back portions for individuals.  This is awesome because it means you're going to have food to take home even if you eat a lot.\n\nOh, and it's cheep.\n\nIt might have felt a little strange to be the only non-Asian person in the place, but dang the food was good and could feed an army.", "author": "Jay F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "They came back from the depths of disappearance. They're back with a vengence. The food, the service, the prices all great. Came back to check this place out again and its living up to the new hipe. Had a group of 10, each ordered a dish, full size, plenty of food, walked out less than 10.00 per person. Family style, sharing .... good deals. They have banquet style menu, wah choy - daily specials. I RECOMMEND this place.", "author": "Dabin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "We found this place after a long drive and both of us were very hungry. I plan on returning again and again! The food is good,  hot, and plentiful. Oh, and did I mention the prices are cheap ? (Not LA cheap, but SF cheap.) The only thing I would do next time is bring more people--the portions are HUGE! I always need a to-go box.\n\nEmpero Taste is located in the Outer Richmond, so parking is not impossible. The restaurant itself is spacious and looks clean. The clientele is by and large Chinese (a good indicator of decent food,  I think.)\n\nI love the simplicity of the food.  I always order the fried rice because it's light and fluffy without all that heavy sauce. Everything I've tried is delicious.", "author": "JV K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-20", "description": "I've come here just a handful of times even though I frequent the area often. The food is actually pretty good, though nothing that holds my attention. It's exactly what I look for in Chinese food without the heavy greasy lingering feeling afterwards. \n\nI've ordered the Ying Yang fried rice (must try if you'you've never had it). It's a plain egg rice fried topped with two kinds of sauces : tomato red sauce with onions and chicken & and a white sauce with egg white base, peas and shrimp. Mix the two together or eat each sauce separately, but either way, you won't be sorry! Also ordered garlic eggplant and Mongolian beef (nice medium spice level). My total was $29 for the 3 entrees. \n\nParking is relatively easy with lots of residential space.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-16", "description": "I used to dine here a lot. When this place was called Best Panda. The food was okay. Your typical Chinese food just like all Chinese restaurants.  Then towards The end if Best Panda, The food wasn't as good. And customers started to dwindle.  Then they closed down.\n\nMonths later, there was a grand opening. And the place was now called Emperor Taste.  Thinking that it was a grand opening new restaurant I decided to go in and give it a try. We went during lunch time, and we ordered three dishes for $19.99.  The quality is the same, nothing to write home about. Just like all the other Chinese restaurants. I'm not sure if they were serving dim sum. We only got the menu for the dishes.\n\nHowever, I do notice that this restaurant is run by the same people. The owner who used to run Best Panda was also working there.  He was managing their workers and taking care of the money. \n\nSo this is not a different restaurant. They only change their name from Best Panda, to Imperial tastes. If you been to best panda in the past and remember the quality of food, it is exactly the same now for him. Case.", "author": "Jack L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "My family literally eats here all the time. The food is consistently delicious and quick. Service is very good, especially for a Chinese restaurant. Prices are very reasonable, especially for the portions that they give you. Excellent for a casual night in, a banquet style meal, or a lunch special!", "author": "Jennifer Hom C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-05", "description": "If you're looking for a cheap, delicious and affordable dinner -- this is the place to be!\n\nBEST shrimp & walnuts ever! And I thought this before I saw the price at the end (I come with my family, so I don't usually order). It was so gooooood! I was shocked, because this is me and my brother's favorite dish which we order all the time, but they made it especially YUMMY here.\n\nI also liked the Yan Yang Fried rice dish, which was sweet & sour pork on one side and egg-like sauce on top of fried rice. It was so good! Try it out if you're goin' for something new.\n\nAs default, we always order the fried fish, which is always good. And as for the vegetable dish, the sauteed pea shoots are the best way to go :) (saucy .................yuuum).\n\nWhen I saw the price at the end for like 5-6 dishes, I was shocked! This is the true definition of one $ on yelp. I was pleased. And we always go for dinner, so I'm not sure about lunch or breakfast, but they give a red bean dessert at the end, which is okay...but it's free ~", "author": "Mel T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-13", "description": "When I moved into the neighborhood, I thought this would be a convenient place to grab dinner on weeknights.  So at the beginning I would order food to-go. The food is ok. Nothing spectacular. But one time, I ordered clams and I ate clams... and SAND! But soon I noticed their bad practices. \n\nDuring the day on a weekday (so less foot traffic), I saw one of the workers out on the street cracking what looked like shells in the gutter. I mean, IN THE STREET. It's almost like they forgot that there was a kitchen where you could do that. So it makes me wonder what other shady stuff they've done with the food. \n\nI know I can choose whether I eat here or not. But there has been several instances when the restaurant decided the best time to run a loud generator is at 1 AM on a weeknight which without saying, is just rude. And tossing oil in the street? Been there, done that. Without a doubt, this place is cheap for large portions as other reviewers have said but that's because they cut corners and take this neighborhood for granted.", "author": "Claire H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-09", "description": "I dont normally hate on local restaurant near my hood but damm does it really take 20 minutes for salt and pepper spareribs over rice for lunch? Seriously people who walked in 10 minutes after me, got their food before me? I don't wanna sound ungrateful but the food service score of 74% also doesn't help your reputation as a outer Richmond Chinese restaurant.", "author": "Harry T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-26", "description": "New spot my family choose for my grandma's birthday.  Although the window sign said they have a health rating of 77 the interior dining area looked clean.  Who knows what the kitchen looks like...\n\nThe staff was super friendly, the food came out relatively quick and most of the dishes had decent sized portions.  Some looked a little skimpy, like the honey walnuts prawns.  The salt and pepper pork chops pieces had too much fat on them.  Their (over)use of msg will probably prevent me from coming back again unless the family decides to come back as a whole.", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-09", "description": "When this place was called Best Panda, we came here about 15 years ago when Kams was shut down for vacation.  I remembered that the place was empty and my youngest daughter and I went there.  However, the staff just ignored us and we finally walked out.  Now that it is called Empero Taste, we thought it might be different.\n\nAn associate raved about this place and provided her favorites.  We arrived on a Tuesday evening (5 PM) when there were only one set of customers.  The restaurant is clean and well lit.  We tried to order chow fun, but the waitress said they were sold out.  How can you sell out of chow fun this early in the evening ?  It is like being out of rice and chow fun is a staple.\n\nFinally we ordered some comparison foods -  sizzling rice soup ($6.99), mongolian beef ($7,95), house special chow mein ($6.99), honey sesame chicken ($7.50).  Before we had an opportunity to have much soup, the staff brought out all the dishes.  It seems like they should have waited, but they just dumped it on the table.\n\nThe soup had a nice flavor, but really was devoid of anything that would resemble a quality sizzling rice soup, though it did have lots of green onions.  At first they brought the soup, but forgot the rice.  They then brought out 4 squares of deep fried rice and place it into the soup to make it sizzle.  As the waiter ladled the soup, he didn't bother to take the soup spoons out of the bowl.\n\nThe mongolian beef lack any sort of \"hotness\" that you would expect from a dish like this.  Maybe it was made too much for \"western taste buds\".  It did have nice chunks of yellow and green onions.\n\nThe honey chicken consisted of bits of deep fried chicken heavily battered and covered with honey and sesame.  It reminded me of those chicken poppers at fast food restaurants.  As I said, it was mostly batter with only small pieces of chicken.\n\nThe house special chow mein was nothing special.  It consisted of mainly noodles with a sprinkling of calamari, red and green onions, chicken and ham pieces and \"one\" shrimp.\n\nThe service is only so-so and they never came back to ask about the food.  Again, this is a series of inadequate Cantonese places that we have tried, regardless of the good intentions of associate recommendations.  Would we come here again?  Probably not, as their are plenty of middling and inadequate Chinese restaurants to chose from.", "author": "Robert J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-28", "description": "* Food:\no Presentation: Ok. (3/5)\no Temperature: Always hot. (5/5)\no Quality: Great! (4/5)\no Dishes ordered: Egg yolk crab, fried salt & pepper shrimp, diced french style beef, and garlic snow leaf.\no Tastiest dish: Love their egg yolk crab, fried salt & pepper shrimp, diced french style beef, and garlic snow leaf! (5/5)\n\n* Service:\no Attentive: Yes. (5/5)\no Knowledgeable: Ok. (3/5)\no Friendliness: Yes! (5/5)\n\n* Restaurant:\no Atmosphere: This place is almost always packed. Tons of people come here for dinner or big parties for birthday events. (5/5)\no Cleanliness: I'm not sure how clean the kitchen is but the front seems clean. When I walk past their kitchen, it's a bit questionable. (4/5)\no Cost vs. value: Depending on how big your crab is, nothing beats $20 for a 2.5 pound crab. Great price! (5/5)\n\n* Will I revisit restaurant? Yes! It's one of my go-to places for egg yolk crab. :)", "author": "Mindy - Oishii Moments S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "Dare I say it. Yep. This has got to be the best Chinese restaurant I've been to in a very long time. I was here for a family gathering, and for the first time in years, I ate. For the past few years, whenever we went out, I never ate the food, I sat and picked at the food, but never ate until I was full. My brother and I would come home and eat again after a gathering. This time, I actually ate my share. The food is good, service is... well, you know. \n\nMy only complaint is that the bathroom is disgusting. If you can hold it, do it.", "author": "Stacy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "From the persective of a vegetarian. Got the mixed veggie stir fried rice noodle. Super tasty, and guaranteed will not die from malnutrition -- unlike other chinese seafood restaurants that attempt making something vegetarian for u (they simply take out the meats and ur left with just noodles, sauce, and onions if ur lucky). My rice noodles had lots of huge chunks of an assortment of 10 types of veggies!", "author": "Crystal R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-08", "description": "Very average-tasting food, and the most diluted tea I've ever had at a Chinese restaurant.\n\nAt least the food came out quickly, and the clams tasted fresh. The place itself feels very modern with a traditional touch, and is also very spacious for groups of at most 10 people. The waiters were also responsive to their customers.", "author": "Addy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-24", "description": "This spot is the go to spot with my family whenever I visit San Francisco. We've been loyal customers here since I was young and have watched this restaurant change owners and it's name. The food is decent and the prices are affordable. This place is comparable to any other Chinese restaurant in the Sunset or Richmond District. They have a lunch special where you can choose three entrees for under $20 (comes with soup of the day and unlimited white rice). My family and I always come here because it's close by to our home and the service isn't too shabby. They sure do know how to do business though because most of their dishes are topped with loads and loads of onions and their seafood noodle dishes are almost all noodles. Nonetheless, it's been a family tradition to come here for all our family gatherings or for holidays and we are not one to break tradition. So this place can count on our business for years to come!", "author": "Amy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "Love the economy dinner! \n\nEverything you would expect from a Chinese place. \n\nRestrooms could be a bit cleaner, but no complaints .", "author": "One L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "Probably one of my fave go to spots with my fam! \n\nThe service could be a tad better...and the place itself could be a little cleaner, but damnit my fam keeps coming back!\n\nWe always get the French style spareribs, flounder, steamed sea bass(only if you can pick the fish--it's super fresh), walnut prawns, popcorn chicken, crispy chicken, clams in black bean sauce and the lobster with the noodles!! Hellla good. \n\nI think they put msg in their food which I realize now that may be the reason why we keep coming back. Oh well, try it and see for yourself!", "author": "Clarissa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "Always great food. \nCome here at least two-three times a year for family 'functions' \nQuick service, friendly staff. \nGREAT food!!\nIf I lived closer I would be here a lot more.", "author": "Ryan J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-10", "description": "My family comes here once in a while when we get tired of the same Chinese restaurants in Sunset.  Typical Chinese restaurant with greasy food and  Chinese workers who don't understand you when speaking in English.  \n\nLast week, we had reservations for twelve people and they sat us at a table that sits eight comfortably.  Can you imagine twelve people using chopsticks and poking each other in the eyes?!  To top it off, we ordered the banquet meal and the table didn't come with a lazy Susan.  Are you kidding me?  MOST STRESSFUL DINNER IN MY LIFE!!  Every 30 seconds, \"Hey Cheryl, can you pass me the crab in front of you?\"  or me asking someone else to pass me something.  Or.... having such a small table and having to find room to put the new plates of food without spilling it on your lap.  We asked for a different table, but it was full house so we asked for a Lazy Susan but the waitress said they had ran out.....\n\nAlthough parking is rough and the experience can be questionable, the food here is OK and prices are very reasonable.  3 stars for food, 2 stars for service.", "author": "Cheryl Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-22", "description": "More like three and a half. Good food, attentive service. Still exploring menu, but everyone seems to get the sizzling beef plate. The giant clam with vermicelli/bean thread is killer.", "author": "E. W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-25", "description": "Make a reservation if you don't want to wait.  This restaurant is located in the middle of a neighborhood so don't be surprised if you're driving past rows of houses.  They recently remodeled, and their prices went up (ie: we usually come in a big family group, and the meal package for 8 people went up $10 from about $69 to $79), which is still an amazing deal!  We also noticed that some of their portions got smaller (especially the Honey Walnut Prawns, which was still delicious, but definitely more skimpy). Sad face.\n\nIf you're coming in a big group, I think it's more economical to order from the meal packages in the back of the menu, and add dishes that you want that are not included in the package. ie: We ordered Honey Walnut Prawns and Calamari separately.  \n\nMust haves:\nFried Sand-Dab (you can eat most of the bones!) - THIS IS GOOD!\nCalamari\nHoney Walnut Prawns\n\nFYI: Rice is not included, and must be ordered separately.\n\nTo free up some stomach space after your meal, take a stroll over to Purple Kow (a straight and short walk from Empero), and then proceed fill up that stomach space with some delicious Boba (Roasted Oolong 80% or 100% sweet is good).", "author": "Melody H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-27", "description": "Best Chinese food you can get for the price.\n\nAlso is the best salt pepper squid I've ever had. I think they list it as \"Fried Squid\" on the menu, but you should reconfirm just in case.", "author": "Louis W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-04", "description": "This place has some really nice fried flounder (according to my grandparents). I couldn't have any because I'm in the middle of my volleyball season. The thing I did enjoy was the giant clam with vermicelli. That was the highlight of the meal. The crab soup is nice and rich compared to other restaurants and is great to lead off the meal. Other than that, all the other dishes are good, but not great. I will certainly come back at some point to have some fried flounder after my season is finished.", "author": "Ian W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-28", "description": "Upon coming back to San Francisco, one of the things that I was looking forward to most was some great dim sum.  When an old high school friend invited me to lunch at one of her favorites, how could I refuse?  We were looking for Best Panda, but what we got was worst tasting Empero.  Upon walking up, I noticed something peculiar about the sign.  First of all, it seemed to be missing an 'R' to spell \"Emperor\", but second, the \"M\" in the sign was mounted backwards!  This was just a prelude to the dumpy dumplings we were about to sit down to.\n\nEmpero Taste was having a grand opening special where each of the small, medium, and large plates cost only $1.80, so we decided to order a variety of things to taste.  The problem was that all of my old favorites weren't included in the promotion and cost full price, which was pretty expensive for dim sum.  One of my favorite dishes is the rice crepes with fresh shrimp, which we ordered at full price.  After the first bite into the shrimp, I noticed something fishy, literally.  These were definitely not fresh shrimp and tasted of it.  All of the other dishes, including the chicken feet, spare ribs in black bean sauce, xiaolongbao, har gow, and siu mai were all a bit dry and none of the dishes seemed very fresh or well seasoned.\n\nAll in all, I was extremely unimpressed by the food and service of this restaurant.  Even the baiting by the $1.80 promotion is not enough to bring me back.  When I go to dim sum, I like to gorge myself with all of the great dim sum flavors and great selection, but sadly, neither of those could be found and enjoyed at Empero Taste.  If you're in town looking for a great deal, I highly suggest going somewhere else.  Sometimes sacrificing quality for cost can net you some good deals, but you won't find the benefit for the cost here.\n\nFood: 5/10\n\nService: 5/10\n\nPrice: $$\n\nAtmosphere: 5/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "You want good and cheap dim sum?  Come here!  \n\nI have never been here nor was I ever planning on coming to this part of SF only because I stick to Union Square, Nob Hill, Chinatown, Japantown, Mission District, and North Beach whenever I'm up there but a spontaneous adventure w/ my friend led us to this little gem.  My friend has been here before and he decided to drive an hour just for lunch because this place offers decent and quick service, good food, generous portions, and it's so damn cheap!  \n\nI am not eating meat today per the Lunar calendar so I ordered: plain soy sauce chow mein ($4.95), an order of the stuffed mushrooms, an order of deep fried tofu w/ jalapenos, and Chinese donuts rice roll.. and a Diet Coke, of course.  My friend ordered: salted fish fried rice, half a steamed chicken, xiu mai, har gow, and pork buns.. a regular Coke.\n\n11 items total including the drinks came to just $42.  \n\nHow freaking awesome was that?", "author": "Tram N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "We were in San Fran for vacation and we literally followed our noses to this restaurant.  We had the spicy salted chicken wings, sizzling rice & seafood soup and pork belly with greens and the French basil pork chops.  (I don't see the pork belly or the pork chops on the menu online at menupages.com but that's what we had.)  Everything was outstanding.  Seriously, the best Chinese food I've ever had.  This is significant because I'm normally sort of take it or leave it with Chinese food.  If I lived here we would go regularly.  All of it was delicious but my favorite was the pork chops.", "author": "Angell V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "$4.99 lunch, heaping portions and free house soup (a delicious broth, usually with carrots and pork bones--SO DELICIOUS). I go for lunch with my gramps pretty regularly, and he loves the beef brisket with won ton soup. There are tons of variations of won ton soup, chock full of goodies. Also lots of good rice plates to choose from.\n\nCame for dinner here once and got the $78 meal (6 people). I love when I get the chance to order this \"meal\" because you get a bit of everything. Off the top of my head, it comes with house soup (seafood and tofu), black bean clams, fried chicken with shrimp chips, peking spareribs, salt & pepper prawns, Chinese bacon and cabbage, mustard greens, fried flounder and ginger-green onion crab. It was so tasty, the crab was sweet and tender. They gave tons of clams and the clams were very meaty. They were also nice about substitutions; we traded some of the deep fried dishes out. Plus they changed our plates out twice (because it was banquet, plus tons of shells from the crab).\n\nI should mention that for being a Chinese seafood hole-in-the-wall type restaurant, the ambiance is rather clean (kinda cold, if you get cold easily bring a jacket) and the service is pretty good. I would absolutely take guests here for a cheap, authentic Chinese meal.", "author": "Kris Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-22", "description": "This year, Chinese New Year (CNY) and Valentine's Day all landed on the same day, a Sunday. One thing was for sure, most restaurants were going to be full. \n\nFor this reason, our extended families decided to hold their CNY dinners weeks after the actual CNY date. However, we still brought the kids to see their grandparents the day before CNY. We were pretty full from eating dim sum earlier in the day, and my in-laws were also full from having a buffet for lunch.  We weren't thinking of having dinner.\n\nThe kids, however, were hungry. We thought most places would be full that evening, but my mother in law called this place (http://www.yelp.com/biz_photos/ufEYEDMaaoiFAxw81IlBAw?select=7MZ2pC86Vv0INIm5aEr5rw). Lo and behold, they said a table would be freeing up in 10 minutes, and to get our butts over there to claim it. \n\nAfter scoring a good parking spot, we entered the restaurant, which was packed. One of the servers showed to a small round table that was perfect for the six of us. \n\nThe adults weren't really hungry, so we didn't order anything special or fancy for the kids. (The lobster noodles the other tables ordered, however, looked very good!) \n\nOur order: \n-Braised beef tendon with turnips in a clay pot (http://www.yelp.com/biz_photos/ufEYEDMaaoiFAxw81IlBAw?select=VxW1I-yXONml627FMDsxLg): arrived at the table bubbling. Nice sauce that was perfect with rice. There was more definitely more tendon than meat, but was OK.\n\n-Steamed Chinese Broccoli with braised chicken (http://www.yelp.com/biz_photos/ufEYEDMaaoiFAxw81IlBAw?select=Yh82bmcddnoa-PrjIgYaiA):  The broccoli was good, with no bitter taste.\n\n-Soft tofu stir-fried with beef and snap peas:  This was ordered at the request of my youngest.  A generously sized dish, lots of cubed tofu, and more importantly for my daughter, very saucy to eat with rice.\n\n-Sweet and Sour Spareribs (http://www.yelp.com/biz_photos/ufEYEDMaaoiFAxw81IlBAw?select=L92NZHSqXGs-ilaQSwdZeA):  Stir-fried with pineapple and onions.  OK\n\n-Dry Fried Beef Chow Fun (http://www.yelp.com/biz_photos/ufEYEDMaaoiFAxw81IlBAw?select=9QxRKxZ5LkqRWWwxHQ-WTg):  this was ordered at the request of my oldest daughter.  Not bad, not too greasy.  Pretty generous with the beef.\n\nVery generous portions for each of the dishes.  We had so much we had a lot of leftovers to take back.\n\nMy father-in-law was quite pleased:  only $40 with tip.  Overall, not bad, considering we were able to get table on this busy night.  Great prices.  Will I come back?  Maybe.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "Although Chinese restaurants are a dime a dozen in the Richmond, it's hard to find a place that I like and that hasn't been hyped through the roof.  Empero Taste is one of these places.  Not to mention it has an incredibly affordable menu!\n\nWhat I would order here:\nWalnut Shrimp\nSalt and Pepper Pork\n\nLunch specials are $4.50, comes with soup, and are not limited to the weekdays.  Serving size is relatively generous as well.  Lunch for 7 came out to be $7 per person including tax and tip.\n\nIf the rumors about this place closing are true, I will be sorely disappointed.", "author": "Fei L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-09", "description": "Empero Taste's kingdom-sized portions catapult it to the forefront of options when dining on the cheap.\n\nThe Salt and Pepper Spareribs are evenly battered and appropriately cooked, lending a desirable crisp to each bite of the still-juicy meat.  The seasoning is just salty enough to cause immediate anticipation for the next bite, but not overly rich to perpetuate an endless search for water refills.  The mountain of white rice is more than proportional to the heaping pile of meat.\n\nEven the complementary soup, which is often an obvious leftover dump at the typical Chinese restaurant, is flavorful and contains identifiable ingredients.\n\nThe service is fine, and the bill under $10.  Will consider again to satisfy greasy, Chinese rice plate cravings!", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-28", "description": "Visited Empero Taste on Friday night, March 20, 2015 with mom just to give them another try as another excuse hoping they were good again as I hope they were after my first experience on December 15, 2014 which was a friday night which I'll start with first. Order Dried Beef Chow Fun, they said probably hor fun all sold out and went to kitchen and came back a minute later and it wasn't and did the Mandarin/Peking Spare Ribs. Both were good, Empero Taste calls the Spare Ribs actually baked. Lots of meat, and the pork chops were meaty. the house soup came in two large containers. Ordered another Mandarin/Peking Spare Ribs as takeout for the Toastmasters club party the next night. One thing strange with their Peking Spare Ribs is that at the restaurant, it's fall off the bone but the leftovers at home does not taste as good as the other leftovers. Even the one at the party wasn't as good as the restaurant. Two waitresses even pack the leftovers for us and bagged it with the takeout order, unseen at any chinese restaurant. We had to wait for a table as it was very busy.\n\nFebruary 21, 2015 which was basically the 3rd day of Chinese New Year. It was busy with lots of take outs, had to wait for table. When we finally got the table, no one cleaned the table even after 20 minutes. So the customer in the next table who knew them helped clean and setup the table and brought us menus. Cannot even find someone to take the order after 20 minutes so basically write the numbers of the items wanted and handed it to the front desk. House soup which was hair sized seaweed, dried oysters, water chestnuts came in another 15 minutes. Then came the House Jeen Mein, the gravy was watery so all the eating plates were flooded so basically the jeen mean became a chow mein again with all that water making the noodles soggy. The fookin fried rice was okay but not much flavor. The Mandarin/Spare Ribs was basically meat with lots of bone and did not taste anything like the one from December 14, 2014. and finally the honey walnut prawns were okay. We took the rice home but they only gave us the box without the free bag. \n\nSo on the Friday night of March 20, 2015, decided to give them another chance thinking it must be them being too busy Chinese new year. Arrived at 7:00PM and the restaurant was all empty except for small tables were full. They told us to sit anywhere and gave us the 10 person table and the other ones were still empty. Same waitress as the first time. Ordered Beef Hor Chow Fun but they said hor fun all sold out, so either take chow mein or jeen mein. I said chow mein and they asked thin or thick noodles, I said thin and asked them for the price as there is no beef chow mein on the menu and they said same price as beef hor chow fun. and then ordered Salt & Pepper Pork Chops instead just to try it. Chow mein came, it did not have much meat and lacks flavor. Then came the Salt & Pepper Pork Chops, there was only the Jalapeno peppers sliced but you cannot find any red pepper flakes or salt crystals. The pork chops had no flavor at all, not spicy nor even a hint of salt. and just like the February event, the meat is full of bones, unlike the December event. So something tells me that either they changed the chef's or they changed both the chef's and the owner. I was checking yelp earlier today but the reviews are still good, probably because the people ordered stuff like shrimp sauce and pork belly, I don't know how anyone can mess that up Oh, I forgot to mention the house soup came in a big bowl, it was water cress except the water cress was rough as other than the leaves, it was stiff and you can't even eat it. We took the pork chops hope and they only provided a box without a bag and said they would bring the dessert sweet soup. The soup never came even after 30 minutes so we just left and no employee was even in the dining room(s). The restaurant was pretty empty on this friday night and they had less people working than in December 2014.  Seems like Yan Yan Seafood Restaurant is better if you exclude the December 2014 visit as that one was more good and bigger than Yan Yan's.", "author": "Vincent P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "Those of you who live in the Richmond might remember the fanfare that accompanied the opening of the Best Panda  restaurant on Balboa and the long waiting lines. The restaurant deserved the attention as it served high quality, tasty Cantonese cuisine in a pretty quiet residential setting next to the ocean as the beautiful sea breeze and fog rolled in. The chilly nights were magical as you stepped out after eating a killer meal, full, satisfied and happy. Well the original spirit of Best Panda lives and continues on intact in Empero Taste, which is basically the remodeled, updated, Best Panda, with a new name reflecting the passing of ownership from father to son in the same family. (So I was told by one of the wait staff. ) The food is just as good, cooked as well, and with many of Beat Panda's signature cooking styles and best dishes. In fact, some of the dishes are arguably even better than they ever were. I'm also happy to report that Empero Taste also maintains the reasonable price structure that always existed, including the lunch specials. Killer food, great taste. Good prices. What more could you ask for? If you come for dinner, try the three specials plus soup and rice for $20 and make sure that one of your choices is the \"Fried half chicken\". It's wicked delicious and after you eat it, you'll say to yourself, \"dang that dude on yelp really knows how to eat. \" (and if you don't say that, then YOU don't know how to eat! Hahaha jk jk don't get pissed. I know, to each his own....,but seriously, I think you'll like it. ;-)", "author": "George F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-18", "description": "When you come here, you will eat like an empero...whatever that may be.\n\nGood food, attentive service, fit our dinner party of 30+ with ease. Everything was pretty solid. The pork chops were nice and salty, just the way I like 'em!\n\nMy tummy gives Empero Taste...4 Stars!", "author": "Allan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-28", "description": "A nice chinese restaurant to bring people. I think this is one of the cleaner chinese restaurants that I have been to. The service is quick. However, I did not like that this chinese restaurant does not have dim sum. I will probably come back with my family for dinner. I normally always get one of the family deals. I think the price is good for the food.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-07", "description": "Went here after the Ski and Snowboard festival.\n\nAfter a long day, we were hungry. Friend took us here and although there was not much around the area, this place was PACKED.\n\nWe waited about 30 minutes for a table for 4.\n\nThat was the only long time we had to wait, because after that service was FAST. I have to commend the staff, especially at a Chinese place, because from what I've experienced Chinese places have rude service. Everyone here was nice.\n\nWe ordered the meal for 4, which started at $38, but changes depending on changes that you may do.\n\nWe had Beef Tofu Soup, Walnut Shrimp, House Special Fried Rice, Seafood Crispy Noodles, Clams, and Spareribs. Some sweat Mung Beat dessert was included.\n\nEverything was tasted good. Greasy of course, but that is all part of Chinese food. HAH! Probably had a bunch of MSG, but the numerous free Monster drinks from the Ski and Snowboard festival offset that.\n\nIf your in the area, looking for some Chinese food, check them out. \n\nOh, why only 4 stars? Because it taste just like the many other Chinese restaurants I've tasted, there has to be one that WOWs me for the full rack of stars.", "author": "Eugene N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-26", "description": "Food is what you would expect. Consistent chinese food. I reccomend the the yin yang fried. The best of two worlds in one reasonable priced dish service was nice but our rice came last after our entrees and we had to ask for it a couple time. Overall not bad, not great.", "author": "victor l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-31", "description": "Come here about once a month with my co-workers.  Staff are always very friendly.  Food is inexpensive. Their salt & pepper calamari and salt & pepper ribs are really good.  In addition, this is what we usually order and all are very good: pea sprouts with garlic, deep fried flounder, beef chow fun, shrimp with walnuts, lobster low mein, fukien fried rice.  They can accommodate large parties cuz they have those round tables for 10 people.  Easy to get a table during lunch.  Dinner is a bit more crowded.", "author": "VC D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-06", "description": "Been here to eat off and on since it switched over from Best Panda.  The lighting and interior is much improved.  No more sticky floors and grimy walls.\n\nAs stated by other yelpers, portions are very generous and food comes hot.  Order wo choy or a la carte.  Because it is a Chinese restaurant, the entrees all come at once.  They must have several huge woks in the kitchen.  No fine dining experience here.\n\nYes, it's true.  Sometimes they run out of chairs, especially if large parties are there to celebrate special occasions.\n\nBeware - the HVAC is set very cold.  You must wear warm clothing or risk freezing.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "I'd walk the length of Geary to eat here...wait, they're on Balboa, and I only walked from Arguello and Geary, but that definitely worked up an appetite.\n\nService was friendly. I ordered in a mix of Cantonese and English and they not only got the order right, I received a Cantonese-ordering bonus of the house soup (a generous serving) and tong sui dessert soup.  The house soup and tong sui were pretty standard, neither bad nor exciting. 3 stars each. Well, 3.5 for the tong sui.\n\nThe egg surface frog was wonderful in it's lightly fried saltiness. I am not a big fan of salted food but this was the bomb. 5 stars\n\nThey were accommodating enough to prepare a half-order of gailan (Chinese broccoli) in garlic sauce. It was perfectly al dente and just the slightest bit bitter, as is normal for gailan. Not only that, they charged me half of the full price for the half order - most places would tack on a dollar. 4 stars for the gailan itself\n\nRice was moist, but not too moist.\n\nPortion sizes good. Clean rest room.\n\nWould return if I was west of Arguello.\n\nDefinitely good for groups, with quite a few big round tables and set dinners on the menu.", "author": "Charles B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "3.5 ! Not bad. Came here with bf's family to celebrate his bday dinner. It's not bad. Generous portions. Service was fast. Food was decent. Would come back - had a ton of left overs. really liked the honey beef cubes :)", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-17", "description": "I've been here plenty of times, dining in and ordering out. Their crispy fried chicken is my favorite dish.  Others rave about there sea snails in black ban sauce.  However I'm not a sea snail slurping type of guy.  Anyways, I'm not sure why I haven't given it a review in the past..maybe because  I gotten stomach aches after eating here in the and really tried to avoid this place. However, others that dined with me felt fine afterwards.  Maybe it was just me.  The last time  it turned out quite well.  I didn't have a stomach ache and was able to accommodate 3 tables on a very busy night.  (after the Blue Grass festival in GG Park)", "author": "S F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-10", "description": "Empero Taste has re-opened for business under new management and new staff. We had lunch there today--3 courses of your choice from a select menu plus soup and rice for 19.99.  We opted for quail (6 halves), mixed vegetables, Mandarin ribs.\nFood was delicious; servings were ample.  Our doggy bag is tonight's dinner.\n\nService was prompt and courteous.  They do not serve dim sum.\n\nRice plates start at $5.50 with some at $6.50.  We plan to try these the next time we go.", "author": "el h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Friends recommended Empero Taste as it was one of their favorite restaurants to eat in and take out.  We went with their recommendations.  This restaurant makes the best sizzling rice seafood soup. The sizzling rice texture was puffed perfectly and the soup was so flavorful.  The steam egg with clam, sweet and sour chicken, calamari, and vegetables were all so delicious.  All dishes were flavorful and edible, not full of onions as many restaurants tend to do. The service was excellent.  The teapot was always full and dishes came out quickly.  Prices were all very reasonable for the portions they serve.  Will definitely be returning to eat in or ordering to go soon.", "author": "Joanne L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-25", "description": "chinese food isn't the healthiest... but it shouldn't be super greasy either! i have such a huge issue with greasy food! other than the grease, the food was decent.\n\ncame here for dinner to celebrate a friend's birthday this past weekend.. five minutes after our order was placed, the dishes came flying out so quickly, there was no more room on our table for the other dishes that hadn't come out yet! \n\npricing pretty much compares to all the other chinese restaurants around. one thing i must say... parking is sucky.", "author": "Ann T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "Large portions. Above-average taste. Good prices. Above-average service, especially from Jenny who I think is the manager? This place (and the cooking) is quite similar to Bay Fung Tong which closed down some years back from it's Balboa st location (but still has a restaurant in Oakland uptown)....so the emphasis is on seafood!\n\nThis family-style restaurant is wonderful for their 3 dishes for $19.99 deal (including soup and unlimited rice!). Favorites are the Hakka style tofu (deep fried soft tofu with a meat stuffing in an amazing sauce), black pepper chicken, sweet/sour rock cod fillet, salt/pepper spareribs or squid, eggplant with fish cake, and their fried flounder in soy sauce. They pour your tea and occasionally even give freebies like cream cheese wontons. And, they'll give you a hot dessert at the end of the meal (with things like white fungus...better than it sounds!, red bean soup, etc). \n\nTheir panfried noodle dishes are \"eh\"....the family style dishes are where it's at.", "author": "Charlie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-10", "description": "Decent, affordable Chinese food. \n\nMy family of 14 used to eat dinner here a lot. They have pretty decent \"banquet-style\" Chinese food and a lot of pre-fixe meals to choose from. Some memorable dishes are their salt and pepper calamari and the long neck clam in a shell. They have affordable $4.95 rice plates and $4.95 entrees. We also usually get complimentary dessert soups after dinner. \n\nTables are very close together so the restaurant can get cramped when it's packed. Service is traditional, Asian-style-straight-to-the-point. Bathrooms aren't the cleanest but do-able. I see a lot of people do take-out and with the restaurant usually almost at full-capacity, I'd recommend it for Chinese food.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-21", "description": "Me: \"I would like shrimp with black bean sauce\"\nWaitress: \"No, only clam black bean sauce\"\nMe: \"Well, you have shrimp with lobster sauce\"\nWaitress: \"No, only clam black bean sauce\"\nMe: \"Okay, you have clam with black bean sauce and you have Shrimp with Lobster Sauce, I would like Shrimp with Black Bean Sauce\"\nWaitress: \"Extra\" \nMe: \"Okay\"\n\nYou are paying for the table cloth, my not very good \"Shrimp with Black Bean Sauce\" was fair, too much starch.  $13 dinner, just the one entre and a glass of water.\n\nhttp://www.youtube.com/watch?v=6wtfNE4z6a8\n\nBlues Brothers:\nMrs. Murphy: May I help you boys? \nElwood: You got any white bread? \nMrs. Murphy: Yes. \nElwood: I'll have some toasted white bread please. \nMrs. Murphy: You want butter or jam on that toast, honey? \nElwood: No ma'am, dry. \n[Mrs. Murphy gives him a look, then turns to Jake] \nJake: Got any fried chicken? \nMrs. Murphy: Best damn chicken in the state. \nJake: Bring me four fried chickens and a Coke. \nMrs. Murphy: You want chicken wings or chicken legs? \nJake: Four fried chickens and a Coke. \nElwood: And some dry white toast please. \nMrs. Murphy: Y'all want anything to drink with that? \nElwood: No ma'am. \nJake: A Coke. \nMrs. Murphy: Be up in a minute", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-05", "description": "We came here today for dinner because we got invited over to this restaurant.  It is located in the Richmond neighborhood of San Francisco, and you can see the Pacific Ocean from the front of the street.  However, the weather was chilly even on this July evening.  The neighborhood location is nice but parking is limited to street parking.\n\nThe restaurant looks clean and recently remodeled.  Service was great and efficient.  Food tasted very good - it is authentic Cantonese.  The fried squid was good but a little greasy.  Portions are generous - great for leftovers.  Prices were very reasonable.   \n\nThey were advertising dim sum for $1.80 a dish; therefore, I might want to try it the next time I am in the city.\n\nA great neighborhood restaurant with a lot of locals folks dining.", "author": "Bill F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "pretty good. \n\nwe missed the dim sum lunch. so we ordered regular items.\n\nlosbter lo mein was HUGE! \ncorn soup was yummy\nhad some sweet and sour spare ribs? i dont know what they are called in english but it was pretty good too.", "author": "Erica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-21", "description": "One of the volunteer gardening groups that I'm active with has this obsession with Best Panda.  I've always tagged along for the company, but I hated Best Panda because it was always cheap food that tasted cheap inside a dirty restaurant.\n\nAfter spending a Saturday morning cutting down ivy and blackberry vines from the big trees around North Lake one of our team leaders suggested that we return to that spot on 42nd Avenue and Balboa Street for lunch.  We were all quite surprised that the space is now Empero Taste.  One of the guys peered into the window; the restaurant was pretty busy at the time.  We decided to go in and give it a try.\n\nOur group of 15 broke apart to take two separate round tables as half of our group wanted to dine family style while the other half wanted to just order individual plates.  The big dining room is partitioned into two parts and we had a room all to ourselves.  I sat down with the group ordering individually mostly because I was one of the last people in, and I didn't know what was going on.\n\nThe service started out pretty bad.  We had two big tables and the waiter left us with only one regular menu and one dim sum menu for each table.  It took the waiter over fifteen minutes after we were seated before he brought us three more menus.  A waitress showed up to take our orders a short time later.  The thick large format menu is about six pages big.  The dim sum menu is very extensive too printed on a one-sided sheet of paper.  You simply check off the quantities of your selections and submit the sheet of paper to the waitstaff.  I wanted chow fun, but the waitress said they were already out of fun.  It was only 1:30 PM, and out of fun already?!  I selected the Seafood Pan Fried Noodles instead.\n\nThe service began to pick up also.  While we waited for our food the waiters and waitresses kept our tea pots full and refilled our glasses of ice water quickly.  The foods came out of the kitchen at a hurried pace starting first with the dim sum orders, then the rice plates and finally the chow mein orders.  With the exception of the dim sum every selection was large portioned.  I knew our group worked up an appetite because everyone dug into their food.  My selection was one of the last plates out of the kitchen and it was very good.\n\nThe Seafood Pan Fried Noodles had firm medium-sized shrimps, tender calamari and huge scallops along with a bit of carrot, a few straw mushrooms and some very tender stalks of bok choy in a light gravy served over a huge bed of thin crispy fried noodles that surprisingly had very little oily residue.\n\nI'd like to return next time and sample some of their dim sum along with a few other items.  Until then I think they achieve a solid 3.5 stars.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "My \"go to\" Chinese take out restaurant.  Reasonable prices, tasty food, good service, never had an order screwed up.  Have eaten there as well and would recommend.  If your family eats dinner early enough, you can do their 3 items for under $22 up until 5pm I think and they throw in a box of rice too.  Great deal for a family of 5 with 3 young children like mine!", "author": "Dominic L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "Three dishes for 19.99 + house soup, rice, and tea.  What more do I have to say?  \nOur usual three dishses: Eggplant with shreded pork, salt and pepper chicken wings and salt pepper ribs.  Add on a beef chow fun or a house chow mein and you are good to go to feed 6-7 people for under $40.00.\nWe came upon this place a few months back and we have been regulars ever since.  Portions are a good size, the service is good, and the food taste pretty good.  \nParking is average - street parking; Wait time at lunch - within 5 minutes\nCooking time - extremely fast! A great place for lunch and dinner!!", "author": "Nathan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-10", "description": "This is a review for their take out ONLY.  The bathrooms are yech.. so I will do a dining experience review later.  Also fyi: there was a change of management during the year...\n\nOK - At this place, for take out, you get more than enough. They have a $5 list and my favorite is diced chicken with tofu over rice.  $5.  For that price, it is definitely worth it.  Also the speed they can have it at the counter is remarkable.  I called and said I was in a hurry and had a movie to catch allll the way down to Van Ness.  Think the Beach and traveling to AMC 1000. I just got off the sand with Charlie (best Yorkie around) and the restaurant was maybe 3 minutes away.  By the time I got sand out of Charlie and drove to the restaurant (6 minutes MAX) , it was ready!!!  oh yea, did a cursory view of the parking situation... didn't look good so glad I didn't eat in (just double parked and ran in - the street was not busy which is great being on Balboa versus Irving or Taraval or those crazy traffic'd streets.)", "author": "Andrea K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-18", "description": "I wanted some yum chaa with my old high school friend and I was recommended to come to this place. \n\nWe got there at like 12:45ish almost 1. And I guess you can't get dim sum plates around that time which SUCKS cause I was craving HAA GAO and HAA CHERNG (the shrimp dumpling and shrimp thick noodle thing) so we got won ton soup, potstickers, eggrolls, and some other stuff. But everything was really greasy and nasty tasting. \n\nNot coming back.", "author": "Sophia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-02", "description": "Holy crap us this place busy or what! This is one of my parents' go to place since we live a block away. I've never really had a bad experience here even when it was under a different name. Great staff with typical Chinese restaurant mannerisms (rushed but polite). You know it's good when Asian families are lining out the door for some delicious, delicious gddhkkbbddmm. Sorry, I can't finish the review, it's considered rude to be on your phone at the dinner table.", "author": "Tiffaney L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-10", "description": "went here on Mother's Day for take out order a lot of food and its going to be a lot left over food is so good they hook you up with a lot of food you should try this place out  It better for you to make reservation at this place gets really packed. 10 stars to them again!!", "author": "D D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-15", "description": "I've been here maybe 4x since it's opened and was not impressed any of those times.\n\nThe first time was during opening week and they seemed to not have anything.  Why bother to open if you the kitchen is not fully stocked?!\n\nThe second time was a month after opening.  Although we were able to order off the full menu, their food was not that great.  A lot of their dishes were really greasy.\n\nI went there with my coworkers for dim sum yesterday and again was not impressed.  The food is by no means bad but with all the yummy and cheap dim sum places in the city, Empero Taste does not hold up much of a competition.  I'd much rather walk two more blocks down to KL for some much yummier dim sum.\n\nSorry to say, but I probably won't be coming back again unless someone in our group insists on going there =/", "author": "Katelynn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-06", "description": "A quickie review: \n\nDinner here is slightly above mediocre...the price isn't bad but I don't think I would go out of my way to eat here unless I was craving for the ginger and green onion lobster over noodles, which I think are good....not AMAZING though. Service is sub-par but you can't expect too much service from any Chinese restaurant. If you go, definitely try the lobster with noodles...it's available in a few different sauces. I've only had it with the ginger and green onion...that would be the only reason why I would drive out of my way there.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-21", "description": "Ok maybe Dim Sum is good and cheap but you get what you pay for.  This is my exp at dinner this past Sat night.  This place has pretty decent food.  Not bad but not great either. \n\nMy family wanted to take my uncles/aunts with our respective families to have dinner for Chinese new years.  We called in to get 2 big tables to fit everyone so they know we would be eating a lot.  We got our tables but we were short 5 chairs.  Uhhh how are we going to eat?  Servers told us to wait and stand because they didn't have enough chairs.  How can you not have enough chairs?!?!?!  Ok that started off not being a good exp but hey they were a bit busy so I can let that one slide.  \n\nThroughout dinner service, they never once check on us to get us more tea.  When you pound down greasy food, you need tea to wash it down.  We had 10 at each of the 2 tables so those little tea pots aren't going to be enough tea for everyone. \n\nGrr so now end of dinner comes and they said sorry no desert.  WHAT?!?!? ok so maybe no red bean soup at the end .. how about some oranges?  None.  Ok well how about some fortune cookies? NONE!!! omfg and then they add insult by slapping an auto gratuity?!?!?!? Yeah at that point I was pretty pissed.  My dad was just going to pay it but I walked up and had a talk with them.  They decided to let US decide on the tip.  My dad ended up tipping them anyways but honestly I felt they deserved nothing for a tip.  I get that Chinese restaurants usually have bad service but this was unbelievable.  \n\nNeedless to say, I'll never be back here.  Tell everyone and their mothers that this place has extremely crappy service.  If i could give negative stars, this would be the place.", "author": "Allan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-23", "description": "Dinner Review only:\n\nMy family and I (4 ppl) came here on a chilly Sat. night for dinner at 7:30pm. This place was packed inside like sardines and even families waiting outside! People were just hovering over tables, salivating while waiting for their own table! \n\nWe ordered, I had a sip of tea and the food was out, wow, that was QUICK service! \nSo what did $38 prefix get us?\nWestlake Beef Tofu Soup- it was ok, kind of bland, definitely not loaded with MSG.\nPeking Spareribs- yum, my favorite of all the dishes, some good quality meat, not the typical red/orange flavored sauce covered in fat ribs!\nGarlic Steamed Surf Clams x4- overcooked! \nDeep Fried Quailsx4- not marinated long enough or seasoned as well.\nSeafood w/mustard green- typical cantonese dish, pretty good!\nDessert: red bed tapioca tong sui, tasty! \n\nOk, why the 4 stars?! My MOM approved it, she loved it, couldn't stop smiling! This is what she would say: Pang, lang, jang place!! (cheap, quality, awesome food!) \n\n\nCheck this out, there was a table of 5 behind us and they ordered the $128 prefix for 10ppl. The meal came with an appetizer platter (jellyfish, cha siu, etc.),shrimps, soup, sandab, pork spareribs, mushrooms over green, a HUGE whole crispy chicken, a MOUNTAIN of ginger and green onion lobster and crab, something else and fried rice! The plates just kept coming and the folks kept eating! haha.. It was pretty funny to watch! \n\nMost Cantonese Chinese restaurants are known for BIG plates of food but man, this place takes it to a whole new level, it's GINORMOUS!! \n\nTip: \n*Go in large groups 6+ppl so you can experience the bazillion course meals, however we did get a table pretty fast since there was ONLY 2 4-5ppl TABLE! \n*Don't expect to come to this place treated like a queen! \n*If you don't know what to order from the menu just do the prefix, it's worth it! $25 for 3ppl to $388 for 10ppl\n\nCan't wait to try it with again with my friends!! =)", "author": "Leeseuh K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-20", "description": "Good Chinese food for good prices (especially the huge lunch specials for $5 each). Nothing special, though.", "author": "Trisha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "Weeknight dinner was recommended and invited by my brother & sister-in-law. I've been here before awhile back, Best Panda I think. Located way out near 42nd ave. be advised that  parking is a challenge! Dinner before 6 pm is always a good time, as getting a large table is easy and no waiting for a group of 7.\n\nThe specials were 3 items for about $20, a good value and a very large menu to chose from. However, they charge steam rice as per person, now that's crazy! Maybe to off set the cost of the special?? Anyway, you can always skip the steam rice and order fried rice instead (they got you either way). \n\nAs always, we tend to go with a good variety of entrees. We order:\n-complimentary house soup which consisted of pork broth & morsels of meat, bitter melon & peanuts, a must if your Chinese!! \n-salt & pepper fried pork chops, always a favorite, nicely fried and satisfying\n-fish with corn sauce, batter fried fish nuggets infused with a light corn sauce\n-whole flounder, yes, again fried in a light batter, very delicate, just watch the fine bones and don't choke on it....\n-hainan style poach chicken, very moisted and silken like texture, my favorite dish! nice ginger & garlic condiment, mixed in in with your rice...yummm\n-eggplant and onions chow to tenderness over tofu cubes, a good way to get you veggies n' calcium for the day\n-mixed veggies with chinese vermicelli, bok choy, straw mushrooms, celery, broccoli, yes, more veggies!\n-tomato & beef chow-mein, OK, sure...not authentically chinese, but hey, it was my nieces birthday!! (symbolic of long life and traditional)\nOverall a very good dinner, as we were there for 2 hours and there was still more people flowing in, a good sign that its a good dining spot if you can find parking!", "author": "Wolfy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "So I have since been back to Empero a few times for dim sum. Everything is still good. I'm bumping them up a star since I've gotten takeout for dinner. \n\nWhat a bargain for dinner too! I guess it must have been the peak of crab season when I stopped by about 3 weeks ago, because the crab was sooo cheap! $10 for a crab cooked with ginger and green onion. Simple way of preparing it, but delicious and the crab was HUGE. The bf and I got a $10 crab and a $6 fried rice to share for dinner. Dinner for 2 including a whole crab for under $20?!? And there was enough food for leftovers too! It's hard to top such a good value. And yes, the crab was good.  I think the price has gone up to $13 for a crab now. Uh, yeah that's still cheap. I'll be back.", "author": "Jessie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-11", "description": "So disappointed.  First Bay Fung Tong closed and sent everyone here, then they changed owners and the menu.  Very sneaky, very sad demise of delicious food. Folks keep coming to town asking to be taken back - never more!", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-14", "description": "So, this is the place to dine because they are reasonable and the food is decent.\n\nMy family and I were here a few weeks ago for dinner and it was a VERY cold winter night.  We sat near the door, which sucked because it was pretty packed that night.  There were about 2 tables open, but of course they were near the door of the restaurant.  So, every time someone came through those doors, a big gush of wind would go right through those doors.  We couldn't stand the cold so we didn't bother to eat there because for some reason the owner didn't bother to turn on their heat that night. So, we decided to go to another restaurant to patrionize them because Empero taste didn't have eat.  Everyone dining in that restaurant looked like they were eskimos cause it was freezing and they had layers of clothes on!\n\nWe were hear once again for dim sum today.  It was a bit on the cold side, but not as cold as it was a few weeks ago for dinner.  Once again they didn't turn on the heat.  My bf and I looked at the ceiling to check out the central heating and guess what?!?!?  They sealed it off with some sort of plastic....looks like they refuse to turn on their heat for their customers.  And yes, people still had some layers of clothing on, but not as much as that night.\n\nFood in general was still darn good.  I'll definetely will be back to support you Empero taste, but not during the winter season!!!", "author": "Shana W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-28", "description": "Street parking only, corner of 42nd and Balboa. Two dining areas (large flat screen in one of them), pretty good service, okay tasting food. Went here for a large banquet of 40 people. We had salt & pepper crab (overcooked), steamed chicken, steamed rock cod, honey walnut prawns, etc.   Food was mediocre and the portions decent, but there was nothing setting this place apart from other Chinese restaurants. \n\nAs another Yelper has mentioned, the whole restaurant was cold with no heat. They had plastic panels and cellophane on top of their emergency exit doors (which were chained and slide bar locked, against the fire code?) where a glass pane window should have been. It was a really poor make-shift job of trying to block the outside air from coming in, so the cold wind was blowing in all night.   Not a comfortable way to eat, eating in 45 degree temperature with your jacket on. No matter how good the food is, they need to correct that issue soon. \n\nThere were no dishes that I remember as being outstanding and above average.  I would go here again if I was in the area, but it's not a place where we would say \"we have to go again\" and go out-of-our-way to eat there.  Just remember to bring a warm coat if it's foggy and cold out.", "author": "Larry G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-09", "description": "Don't be fooled by the name of the restaurant. The food quality was very basic when my family and friend went for dinner. \n\nWe ordered a good number of dishes only to find out half of them were out of ingredients that were needed to complete those dishes. The employees are not very attentive to the customers but rather the large flat panel that is playing Cantonese dramas and/or the news in Cantonese. I watched as another large table had to literally wave their hands as if seeking a helicopter for survival to get someone's attention at the counter. I can hardly remember what we ate but I do remember one dish which was the BBQ pork pan-fried noodle. It was alright but the meat was not the best and the sauce was a bit lacking. The Westlake soup had absolutely no flavor! I had to resort to adding tablespoons of pepper in every bowl I drank to finish the big bowl. I know, very bad for health, but isn't all Chinese food bad for the respiratory system?\n\nI do want to give this place another chance because the potential for it is there but just that one night was very unlucky for me and my family.", "author": "Dominic T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "Dinner for 7 including 9 course banquet plus fresh prawns and 2 Yang Chow fried rice, 8 beers, 2 sodas, $154 and I left a $40 tip.  This place is so authentic I am surprised they take CC.  Lo Fan guests didn't like the shrimp heads, but everything else was Good to Go!  Waitresses are nice and pleasant.  The Chef is very flexible and will put anything on the menu over rice or noodle of your choice.  Dessert was an interesting sweet soup with white fungus and mango and egg.  Tired of tourist food?  Tired of Tourists. Checkit out.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-20", "description": "I would give this place ZERO stars!\n\nIf you make a reservation, you would think the tables you reserved for would be ready +/- 15 minutes...  This place had the tables ready...but you'll have to STAND to eat...b/c they don't have enough chairs for the restaurant!!  We were missing 7 chairs -- so we had to wait for other diners to leave before we get seated...\n\nI was so tempted to drive home and bring my own chairs!  -- it would've been a lot quicker....\n\nThen..they run out of dessert and fruits?  Not even one orange?  c'mon... Not even fortune cookies???  :P\n\n....so dumb...", "author": "Lise T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-11", "description": "I finally came to Empero for dinner and I must say I think it's a pretty good place with tons of food.  I was quite empressed.  We ordered the dinner for 8 for $108 and had more than enough leftovers.  We had seafood soup, clams, crab, quail, chicken, walnut prawns, steak cubes, and a whole bunch of other stuff I can't even remember.  All I know is that the plates just kept coming out and we could hardly finish a dish.  \n\nThe staff is just typical but I thought the food portions were so generous and quite tasty.  I've been to a few other places in the RIchmond and they were just too dirty for me to ever go back to.  I guess since it's still fairly new, it's a little bit \"safer\" for now.", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-07", "description": "Food is very good...but the service this last Sunday was the worst I ever experienced. The guy had an attitude like placing an order was an imposition to him. But the food was very fresh tasting and maybe well try to go back on a weekday night...", "author": "Diana D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-30", "description": "was there tonight tring to take avantage of their recent promo of get 3 dishes, rice & soup for $19.95, well as it turns out if you don't know how it works,  only offered till 5 pm, did that help me? No, it didn't, so beware that if you think u can take advantage, think again, what a ploy to get you in there. Foood isn't that great, beef was tough as jerky, soup was cold & came out during my meal. one last thing, walked out smelling  like you cook for them, bad ventilation, they have no range hoods in their kitchen running. WILL NOT RETURN.", "author": "david c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-08", "description": "Pretty solid food!  I think the waitstaff is also pretty nice, so overall I always enjoy my family dinners here.  \n\nBut maybe my palette is tainted by too much American food these days that I can't tell what constitutes as good Chinese food.  My parents said that the food we had recently was not fresh and that the white chicken wasn't yellow enough... but instead a darker slightly purple color.  Wtf does it mean when chicken is dark?  \n\nEither way, those table dinners are really worth it!  I also saw tons of dishes that were less than $6, so it seems like a cheap place to get take out to eat for days.  \n\nAlso, it's a lot cleaner than back when it was Best Panda, so upgrade!", "author": "Anna T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-23", "description": "Horrible services!!!! We had 5 people(3 adults and 2 kids)  1st waitress tried to sit us by the door... On a windy and raining night... I told her no can we be seated away from the door since it was cold... Okay hold on... 2nd waitress tried sitting us at the same table... No that table is too close to the door... Okay hold on..... 3 waitress look at us for bout 5 mins .... They finally sat us down... Sit down we look through the menu... Cheap great lets eat... We flag down a waitress... We are ready to order ... Waitress tells us... She cant take our order because its not her section.... Okay fine... We tried to flag down OUR SECTION waitress.... IGNORED!!! Really... Okay got up and left.... HORRIBLE SERVICE!!!!!!", "author": "jeannette L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-20", "description": "Blah came back a few months later, the food felt rushed even though it wasn't busy at the time. the dishes that were supposed to be crispy fried kinda came out a little soggy. \n\nSo on a stormy Saturday afternoon I came to pay homage to a awesome man my dad. We came here for a solemn meal to a quiet place to chow down some seafood. This place was formerly Best Panda, which the dad sold it to the son. The food was above par . I had ordered the $128 set meal which had 9 courses. First off was a cold platter with jellyfish ham bacon (chines style) , soup, a few seafood dishes. The one that missed kinda bad was salt and peppered skrimp, it seemed not to be  fried crispy enough and not a lot of taste. The rest turned out great , portions are nice sized. Its hard to find a deal like this in Chinatown and parking is way easier out by the beach. If you need to do a banquet for any occasion this would be it.", "author": "Jorm K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "Fresh, tasty seafood.  And cheap too!\n\nA bit greasy, but that's kind of normal for most Chinese restaurants.\n\nI keep coming here for their fresh steamed seafood.  Their family set menus are a great deal and your tummy will be filled with happiness when you're done.", "author": "Winnie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-30", "description": "When this restaurant first opened, my family and I went there about once every 2 months.  I also took some friends there and they were impressed with the service and the quality of the foods.  \n\n I have not been there for about a year and has recently went back again with my family for a Chinese New Year celebration dinner.  The service and quality of foods have certainly deteriorated.  \n\nThey take reservation, but do not honor it.  We made reservation for 7:30 pm and our party arrived at 7:20 pm, but were not seated until 8:30 pm.  During the time when we were waiting, the host was chatting with his friends while tables were left uncleaned.  We were constantly being told \"soon\" every time we checked with him on how long it would take before we can be seated.      \n\nAfter we finally sat down, they gave us a tea pot, but forgot the cups and menus.  \nAfter our order was finally placed, they brought out the soup and bowls for the soup, but forgot the spoons.  We had to remind them twice to give us spoons while the soup was getting cold. \nWe ordered a set meal and one of the dish is onion with lobster.  They totally forgot about this dish until we reminded them; then, they brought out a dish of crab saute with onion.  When we reminded the waiter that our order comes with lobster and not crab.  He told us that they ran out of lobster.  So they just replaced our lobster with crab without bothering to tell us and charged us the same price.  There were so few pieces of crab on the plate that I was not even sure whether we were given the whole crab.", "author": "Rocky B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-09", "description": "I wish i never went there. i got harsh food poisoning. Wish I kept the receipt as my attorney said I can sue them for all my medical phone bill. Also heard that this place is a money laundering scheme for drug business. God I hope they didnt mix the food with drugs by mistake or something.", "author": "P N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-01", "description": "empero has a weekday special for dim sum whereby all smalls, mediums, and large are priced at 1.80\n\ndim sum review only:\n-bbq bun(s):nice fluffy bun with well prepared bbq paste-marvelous!\n-har gow(3/med):made with shrimp pieces , forgettable\n-meat balls)3/s) - tender, ok \n-chicken claws(4/s): tender but otherwise unnoteworthy\n-spareribs(s):bony and chewy meat. so-so juicy\n-sweet rice in lotus leaf(L): mushrooms, meat, and dried shrimps?  . order this and take it home. suitable for dinner or breakfast\n-shrimp in roll rice (K-3.50) shrimp seem dried out. not tasty, rice roll gummy, not perfect.\n-gratis soup, pretty tasty, unusual for dim sum house.\n\nleftovers\n-order by checklist, dim sum will come out slowly\n-overall, most dim sum items were poor, but a few stellar items stood out.\n-free street parking a block away.\n-don't expect much service unless you ask and ask.\n-bathroom (men's) doorknob is dysfunctional.\n-chow fun (4.50?) seems reasonable but didn't try.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-07", "description": "Brought my family from NY here and everyone loved this place!  Dinner was $140 for all 13 of this!!!! And we lift with ALOT of left overs.  Don't know how they do it.  \n***Then we went back for Dim Sum the next day which was $1.50 a plate! And it's not that dim sum that you get from tiny togo places.  The food quality is just as good as any of those more expensive places over on Geary and Clemente.", "author": "Sylvia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-11", "description": "Budget dim sum, ftw!  $1.80 dim sum, M-F from opening to 3pm is made to order here.  Sorry folks, no carts, but at least food comes out fresh and hot.  The dim sum is not too bad considering the price.  They also have a selection of more expensive dishes that are delicious too.  I love the free soup they give.  It's very light and is a great opening for all the grease that's bound to come when the dim starts arriving.  The tea is free there too.  I only wish that they had a larger selection of deep fried dim sum dishes.  But this place deserves credit for better than average dim sum at great prices.\n\nBe careful to watch for the street cleaning signs as my friend got a ticket for not checking.  And, yes, I wouldn't recommend going around the restaurant to check on the kitchen as it will turn you off, LOL.\n\nMy Dim Sum Rating System:\nEgg-rolls=4\nPan-fried turnip cake w/ XO sauce=5\nRice noodle roll w/ fried bread stick=4\nShanghai dumplings=3\nShrimp dumpling=4\nSpicy salted tofu=5", "author": "B F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-23", "description": "I lived right across the street from this place for a year and this place is great. I am a believer that the best ethnic food places are generally frequented by those who traditionally eat the food, and at Empero Taste this rings true. Parking during dinner on any day is impossible because of the Chinese families packing the restaurant, but it is right on the Balbo bus line. Hardly any of the waiters speak English, but communicating your order is no problem. \n\nAfter hours it gets more interesting. Several times the noise from this place woke me up from a dead sleep. The people who work there seem to love to party and dance after work....", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-03", "description": "Really bad service. \n\nFood is alright. Got a bunch of the typical dimsum items plus a few extra main dishes. \n\nThe salted spicy squid was really good, but also really greasy. The pork sparerib was average. Nothing really stood out about this place to me.", "author": "Mike I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-04", "description": "My gal is a homie, so we were served fast and attentively even though the place was completely packed with a line out the door. We had the dinner for 3 for $28 (even though there were just the two of us) and the food was very good and an excellent deal. It was more like dinner for 4! The sizzling rice soup had shrimp and scallop, and the vegetables in it were fresh, and the soup wasn't too salty, a fine starter. Then there was braised beef with picked vegetables, a cold platter that we enjoyed a lot. The three main dishes came rapid fire. The chicken with black bean sauce was flavorful and not overly oily, but the chicken was low quality with chicken bone bits in it.  The stuffed eggplant with garlic was excellent. 2 very large eggplants stuffed with fish cake, and whole garlic cloves. A unique dish. Then tofu with chili and pork, a classic dish done fine. All the dishes were very large with no holding back on ingredients. Dessert was included, which was a simple red bean soup. \n\nThis place was the previous Best Panda which I wasn't so crazy about, but apparently this is the same owner, and the place was remodeled inside to now be very nice. I was amazed driving down Geary how so many restaurants on a sunday night at 7pm had barely any people and when we came up upon this restaurant out in the boonies of Balboa and it was so incredibly packed...something must be right about it.\n\nParking is a bitch, but I'd gladly come back.", "author": "Henry Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-04", "description": "This is the second time we've been to this restaurant and the food is really good it's inexpensive and the food It's really tasty.  We love their chow fun n jook not to mention their very generous portions.  So if you have a hankering for really good simple Chinese food this is the place to go.", "author": "Jeni F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-22", "description": "The people who have given this a bad rating well lets just say I feel they are a little picky! COME ON!!! Seriously pull the stick outta your butt!\n\nas far as Chinese food goes this place is very good the French style beef is fantastic and the pineapple and prawn fried rice goes great with it we get it every time we go, I have been to this place about 10 times with a group of 2 - 6 and the service is always great & and food always is consistent.\n\nYou might ask why I give this 5 stars I base all my reviews on the area they are in I feel this place falls into a cheaper end Chinese restaurant BUT it feels more mid end one, the prices are great and the portions are large. \n\nLast time I went with my fiancée and her mother who are Chinese we had 6 dishes and 3 of them were seafood one being lobster! the bill come to $60 HOW CAN YOU GO WRONG????\n\nit is a clean place and you can always get a seat never waited more than 5 mins and you can talk it is not too noisy. \n\nGive it a try it is great food!", "author": "Mark H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-26", "description": "Let me just by saying DO NOT GO HERE. This place is questionable for multiple reasons.\n The staff is your typical kind of staff that you find at most Chinese restaurants in the area. Nothing special. Just kind of take you order and walk off and not really check back if you need anything. You'll also probably have to ask a few times if you need something. It seems they have selective hearing.\n\nThey also dump all their garbage and leftover food outside onto the sidewalk. The sidewalk seems to be permanently stained and reeks of rotten fish and other undistinguishable odors.\n\nFor a while they also had the letter m backwards on their sign...Do they know how to spell.....? It has since been changed after being that way for over a year. (Look at the picture! Hopefully they don't change it lol)\n\nBasically do not go here. It's not worth the stomach ache you'll get later from the food.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-05", "description": "This review was base on the lunch items and not the dinner.  This can easily be a 5 star restaurant if you ordered the right things. It's a new dim sum restaurant that just opened up. Heard from Jennifer H that this place was cheap and good. Since I work close by, I decided to come here today with a few of my workers. Brought 5 big guys so that we can sample everything.  There were plenty of seats available and there was plenty of parking spaces outside.  I guess because it is a weekday.\n\nSalt and pepper calamari.........probably one of the best in the city \nXO chow fun............couldn't Taste the XO but the dish was great \nsticky rice in lotus leaf was good \nchicken feet was not good \nhar gow was not good \nbeef roll the noodle was too thick \nshrimp roll the noodle was too thick \npan fried taro was good \nfried taro with xo sauce was good.........had better\nfried tofu was good \nXLB was ok \n2 vegetable dishes \nblack bean sauce spare ribs ok \n\nSo the overall experience was a three star. Adding one star because of the price. You can add another star if you didn't order the har gow, the beef roll, chicken feet. \n\nThe place is very clean because it just opened up.  \n\n1.80 for s m l plates on weekdays only.  Well worth it.\n\ntotal for 5 guys was 50 dollars", "author": "jason g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-25", "description": "My mom likes this restaurant a lot. We live clear across town, and she is willing to drive MILES and waste a lot of gas to eat here. We've eaten here a couple of times (for dinner) and it's been great. They were accommodating -- when we came here the first time with no reservations, they gave us a table anyway. A huge plus in my book. \n\nFood: The steak cube dish IS AMAZING. I'm addicted to it. They don't have anything like that at 8 Immortals.  The clay pot dishes are super good too, and pack a lot of flavor. I usually have to restrain myself from eating a lot here or I'll gain weight. Fast. \n\nService: Fast. The dishes came out like this: boom. bang. shawahhh. oohh! You get the picture. \n\nThe only gripe I have is the seating...it's a little cramped. It gets super uncomfortable when the place is packed, and that's usually around dinner time.", "author": "Betty T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-05", "description": "what we ordered...peking spareribs, steamed live whole fish, spicy salted spare ribs, black bean sauce clams, yang chow fried rice, wonton soup.\n\nCHEAP AND LOT'S OF TASTY FOOD....what else do you want?\n\na place like this not many want's to say good stuffs about or even say something cause they want it to be a secret,..... greedy ass bastards.\n\n...though the restaurant is a typical chinese joint. not  a neat place but tolerable and service?... you're definitely in mainland china.", "author": "Gors P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-20", "description": "I loved this place before it became Empero Taste when it was called Best Panda. According to my Asian friends the real name used to be \"good soup\" or some derivation of that and the truth was it was good soup, very good soup. This is a no frills kind of restaurant, or was, it's a bit \"nicer\" now as they painted it, removed the scent of raw ingredients that wafted freely out of the kitchen, and looks like they bought some new plates and what not. Happily the menu remains mostly the same:\n\nDong Po Pork - otherwise known as pork and preserved mustard greens - AKA Chinese Bacon! I ordered this once and the waiter looked at me side long and said \"very fat\" thanks, I know I'm a little chunky, I thought to myself, and then paused to appreciate this guy's concern for my arterial flow. Yeah I know its fatty and I want it, and I'll eat it all right here right now! The pork is out of this world, and its very fatty and the preserved mustard greens on which the swine rests is out of this world.\n\nThe surf clam is a madman, ginger, scallion, little corn starch sauce, garly and slipper bits of clam that are served on an abalone shell.\n\nAll the vegetables on the menu are always well done but especially wonderful are the \"su-choy\" and \"an-choy\" and naturally the pea sprouts which are always bloody pricey but more than flavorful. \n\nThe deep fried sand dab with soy sauce is great. It's a whole plate o' fishy fried goodness that comes straight out of the frier. Very tasty and fun for the kiddies to pick apart.\n\nSalt & Pepper shrimp/spare ribs - oh yeah oh yeah oh yeah... \n\nAll parties are in agreement that the Mu-Shu Pork is orgasmic. It's so good you don't need the plum sauce or the wrappers. I love to eat it just as it comes, by the bloody table spoon full. I'm glad the chop sticks are there to limit the gluttony, it slows me down just enough to keep from choking and allows me to breathe.\n\nIts probably a good thing that I don't live 1 block away from this place as I'd have surely wound up on a gurney or had a stroke from the salt, but this is by far my favorite place for a well cooked Chinese meal that is ridiculously cheap, generous in terms of portions has a mostly friendly staff that understands just barely enough English so that you only have to repeat yourself twice.", "author": "Len S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "Great place for the set menu dinners for large parties. The portions are very generous and the prices reasonable. Lots of Asian families come in and the place can get full especially during the weekends. Service is what I'd expect, it's okay.", "author": "K. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-23", "description": "- Beef chow fun, dry style\n- Shanghai steamed dumplings\n- Black bean chicken feet\n- Stir-fired string beans\n- Salt and pepper chicken wings\n\nTotal = $17.03 \n\nFor 2 people this was a huge amount of food. Overall everything was tasty and good. \n\nIt was about 1:30, so service wasn't too bad. Not the most attentive but they did clear away empty plates fairly regularly. \n\nThey did run out of the complimentary house soup which they serve at lunch and they ran out of the Chinese broccoli. Not  a big deal as the string beans were so good!\n\nClean, modern looking and cheap. That puts them above a lot of other restaurants.", "author": "cyndi L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-23", "description": "This place is right by my house, so my family and I would always come here for dim sum or for dinner at night. It's regularly price and tastes decent/good. I really have nothing to rave about, nor anything to complain about. Everything is pretty oily, but that just comes with all Chinese food when you eat out.", "author": "Diana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-28", "description": "Empero Taste \n\nThe Bottom Line: New Chinese joint offers decent food at decent prices. Things were slightly above average for your typical Chinese Restaurant. Its an okay place to go, but not something to RAVE about. Also they have room for plenty of people. Oh lastly, watch the MSG, there's a decent amount of it.\n\nBeing that I don't eat seafood, I can't comment on a lot of dishes that were served. However, they look delicious and the rest of my family seemed to enjoy them so I'll just assume they were good. The dishes I had were good had like an egg drop/tofu/ shrimp soup which was nothing to rave about but again a good solid dish. Salt and Pepper spare ribs aka MSG spare ribs were about the same as anywhere else. \n\nNot much to say about the service, typical of a Chinese restaurant.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-10", "description": "Not bad place to eat if you are not sensitive to the MSG levels (extreme thirst and major migraine) they put in their foods like the deep fried calamari. Service is attentive and fast as is the food service in this busy place...they definitely want you in and out like it was a panda express. \n\nif you want a more chill experience, i would seek another recommendation. if you are on the run, then check this place out if you are not MSG-sensitive...", "author": "Jessie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "Close to home and good food for a good price.  Its worth it to order take out and save trouble of making dinner if your not in the mood...  Dinner is served in 15 mins  :)", "author": "Lai L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-26", "description": "We ate here twice this week - dinner mid week and dim sum on the weekend.  The food was delicious, service good, prices cheap on both visits.  Some highlights:\n\nDinner: Really happy with the quality, especially given the size & price.\n - chicken claypot with vermicelli was fantastic.\nDim Sum: Good mix of standard and unusual items.  Dishes are made to order.\n - salty spicy tofu was perfectly crispy and the lightest ever\n - lettuce with bean sauce was a surprise (the good kind!)\n - fresh wrappers for Shanghai steamed dumplings and pot stickers\n - beef cubes with french sauce!\n\nNitpicking - the lighting at dinner was too bright, and how hard is it to serve the Shanghai dumplings with a spoon?  \n\nI'll be totally happy to go there again.", "author": "Stefan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-10", "description": "Came here for lunch today with bf and his parents. His parents always dim sum here so they suggested us coming here since his mom had the day off. \n\nI think they remodeled this place. It looked really bright when we first walked in. We got seated pretty quickly and the food came fast too. We ordered chicken feet, some egg yolk bun, fook kin fried rice, shrimp in flat rice noodles, tripe, and sweet tofu. \n\nThe chicken feet and fook kin fried rice was sooooo goood! But oh man.....WARNING: DO NOT ORDER THE SWEET TOFU! When I put that spoonful of sweet tofu in my mouth I was about to throw it back up. It's not even tofu! It tasted like instant powder sh*t added with milk or something. Totally not worth the $1.80 =T Other than that the other food was great, cheap prices, and clean environment.", "author": "Tracy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-26", "description": "Great food and great prices!! They got quite an interesting selection of food on their menu. From clay pots, to hot pots, to dinner entrees, to lunch specials.  They give lots of quantity of the food (more for your bucks) \n\nFast customer service, food is served fast, and utensils are clean. Prices of the quality of the food is hard to beat. If there only is more parking around the neighborhood, I would go there more often. =)", "author": "Lelan Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-05", "description": "This is one of my favorite chinese restaurants in the city. I may be biased because its so close to my house.. or because they are so cheap. \n\nThe food is consistantly delicious, and they give you A LOT for the price. \nThe honey walnut prawns are AMAZING here. They are not too creamy or sweet like most places... \nThe orange chicken is my favorite, its nice and crispy with delicious flavor. \n\nYou could easily eat for cheap. Go with a bunch of friends and share dishes at their big round tables.  You could easily order 2 dishes/person and get out for less that $20/each. \n\nMy husband and I like to order take out because we always have leftovers..  I just wish they delivered.", "author": "Mary Eleanor C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-29", "description": "Looks like I have to knock down the ratings for this place.  My last visit here was for dinner and everything we had lacked taste.  The only thing that was really good was the fish soup.  But other than that, the rest of the food was bland and even the lobster noodle was very small.  Definitely a lot less noodles given than most places I've had this dish.  \n\nSurprisingly, it was very crowded on a late Sunday night.  Since it was this crowded, I was expecting a great meal but it definitely underperformed compared to my last visit here.", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-14", "description": "i ate here yesterday. oh man the name is awesome. I thought hte 'r' had fallen off, but then I looked to the right and it said 'Empero' on a printed sign as well. i had to get to the bottom of it. was it a spelling error? Was it slang to take off the last r in emperor?\n\nThanks to wikitionary, i now know its a spanish adverb meaning \"nevertheless\". Duh, Of course it means Nevertheless taste... Stupids.\n\nAlright despite the bad spelling error of a name, i actually thought this place was legit. My pops and I talked to the owner for a bit. He remolded the place (used to be Panda Express or something like that (not the chain)). But it's nice looking, clean, but the old construction workers still eat here for lunch. That's how yah know it's still cheap and good. We got the standard dishes, some type of chow fun and salted pork chop over rice.\n\nGood stuff. I think its one of the better asian restaurants. For the price, it owns 8 immortals and D&A.", "author": "Garrett W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-19", "description": "Food is ok. Parking is hard. Two stars because we ordered a steamed live fish and the freaking owner gave us a Dead one. We can tell from the way the meat tastes, besides my dad is a chef. Never to go back again.", "author": "uncle m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-18", "description": "I took my Pops here for Daddy's Day. Dad is hard to please - when I take him out he often growls \"I could make this ten times better!\" -  but even he was impressed by the dishes. We had the deep fried sanddab (a little dry for my taste), sauteed green beans (getting better) and black pepper steak cubes with scallops (truly magnificent - oh so tender!). \n\nThe restaurant has a clean look and its decor uses expensive materials. There are acres of space here, plus many banquet tables. One con is the service. I found a curly hair in my rice bowl, and asked the waitress to bring me another bowl. Seconds later, my Dad found a hair in his rice! He threw a fit. The waitress rushed over and swiped the hair. She placed it in the palm of the manager, who happened to be walking by. Mr. Manager shrugged and walked away. Yes, this is that kind of restaurant -- if you're not in a group of 8 or you're not a pushy Occidental you'll have to resign yourself to picking hair out of your food.\n\nFinally, the prices are a tad steep. Empero Taste must be passing on the cost of adding the missing \"r's\".", "author": "William L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-27", "description": "This place used to be a dirty and mediocre establishment for Chinese food. It was so bad that my brother found what looks like a \"booger\" in his vegetables. After that, we never came back.\n\nNow, it's different. Way different! The restaurant is cleaner and brighter! There's a more friendlier waiting staff and the food is good for another visit! Point to note: it might feel a little tight in some parts of the restaurant.\n\nIf you know what to order for Chinese food, good for you! I'm just going to point out the dishes that are worth mentioning and skip the rest, which aren't bad at all.\n\nThe dish to get is the Bay Fung Tong crab. The crab is chopped up into pieces, coated with a seasoned batter and fried till there's a lovely light crunch! There are bits of minced beef topped over it, but the crab is a winner. There's plenty of crab meat in each piece and the shell is cracked enough to seal the flavor and yet easy to take apart. The batter gives an extra flavor that isn't overpowering to the crab. I don't know if that is their specialty, but it sure is worth talking about! \n\nI mentioned this earlier regarding another Chinese restaurant and it's best to mention it again. I feel like every Chinese restaurant degrades as head chefs move on with their lives, so don't expect my ratings to stay consistent for a long time! Check the date of this review before you consider taking my current opinion of this restaurant as part of your decision to dine here. I've seen plenty of Chinese restaurant fall in quality, so try this while the food is good and the restaurant is clean and vermin-free!!", "author": "Jeremy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-31", "description": "No more dim sum. :( They still have clams in black bean sauce, green beans are aways good, shrimp and walnuts, and noodle dishes. Stuffed mushrooms are stuffed with fish paste, not shrimp. No more hot chicken feet, only cold chicken feet. So sad.", "author": "Mary H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-17", "description": "Food is typical Chinese, cheap and pretty good, but the worst thing about having a table in front is that if it is packed and crowded as it was on the night that we were there, is that people if they are waiting, they come into the restaurant and wait standing on your table pretty much.  How would you like to eat with people standing with their front leaning and touching the back of your chair.  Pretty much their chin is right above your head! \n\nCreepy.  \n\nI like my space and this place doesn't give me that. So that kinda negates the goodness of the good especially in a city where there are tons of good cheap Chinese places.  \n\nSorry Empero Taste I really want to make you one of my \"go to\" places for Chinese but not under such conditions.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-30", "description": "Personally I say that there are 2 factors in determining how \"good\" a restaurant is, the service and obviously the food itself.  Empero Taste has definitely satisfied these 2 factors for me.\n\nThe service was wonderful!  Everyone was welcoming and they made sure that you were enjoying your dining experience there.  I've heard that the restaurant is under new management so maybe that has something to do with it.  Not entirely sure on this.  \n\nThe food was excellent too!  I had the French style steak cubes and lobster with noodles and both were really good.  Pretty tender and juicy overall, and best of all the dishes didn't really feel too fattening.  I think they use a smaller amount of oil for their dishes.  \n\nDefinitely give this restaurant a try if you are in the area!", "author": "Kelvin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-01", "description": "Horrible service. Food sucks. The young girl with glasses has a attitude problem and forgot some of out orders!!", "author": "Richie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-17", "description": "I used to come here with my family a lot back when it was called \"something...Panda\", my grandparents were huge fans. I never could wrap my head around why it was their favorite or why they felt it was so much better than any restaurant on clement, i figure it was because of the close proximity from the house to the restaurant. I just went to the new \"panda\" which is called Empero Taste, not bad...about the same as I remember just much cleaner. \n\nTips and Pointers:\n-Try the salt and peppered pork chop, best thing they have here...truth\n-Much cleaner than before, as well as better furnished\n-Looks a lot newer than the old restuarant\n-Prices are cheap\n-Food is great quality, service is fast, prices are good. 'Nuff said.\n\n[APPROVED]", "author": "Eric T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-29", "description": "went to this place after we went bike riding in golden gate park, everyone was crazy hungry so we ordered one of the specials, it was the $108 special or whatever.  I ordered the kung pao tofu and some fried spring rolls, the kung pao tofu was extremely bland even though i told them to make it spicy, the fried spring rolls were great.  i saw all the other dishes that came out and my friends all enjoyed the walnut prawns, and the crab, other than that they said that the rest of the food was kinda bland, we were supposed to get a desert with out special but the waiter came by and told us that they didn't have it.  the service in there is pretty bad.  i wouldn't go back again.", "author": "Maninderpal M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-01", "description": "This place is alright, there are some stellar dishes, but for the most part the dishes are all average quality and taste. The XO stir fry noodles with beef stew was amazing and the beef shank cubes were tasty. I wouldn't recommend the dim sum here, it's pricey and doesn't taste that great.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-12", "description": "I think someone forgot the \"R\" at the end of Empero b/c it means \"nevertheless\" in Spanish. \n\nI believe the owners are still the same from the previous Best Panda establishment. Out of convenience, we had our Mother's Day dim sum there. Sure the place is clean due to the renovation and new chairs but the food was so salty I had to keep my tea cup close.\n\nDon't expect much service either b/c I asked for vinegar with the potstickers and it took me asking 4x before it was brought. \n\nIf you are going to charge higher than average prices, please at least make good food and not the \"Nevertheless Taste\".", "author": "Katie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-17", "description": "Great chowmein, but super oily food and must have tons of msg as I've passed out cold twice after eating here! Customers are regulars who line up outside the door in the pouring rain to wait so I guess they love it..", "author": "DeAnne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-02", "description": "The Artist Formerly Known as Best Panda is by far the best tasting traditional Chinese place in the Richmond. Here's what the girlfriend and I ALWAYS order (and are constantly food coma satisfied): curry chicken, shrimp fried rice, and the sauteed green beans. Nothing like good ol' chinese comfort food to make everything alright!\n\nThe remodel did WONDERS. Now it's both great tasting AND clean. Double whammy.", "author": "Wally N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-18", "description": "So the son left and sold the place but it seems the food tasted the same.  The menu have  been shorten which is an improvement because it was a little too lengthy like reading a book.  The price have increased like everything in this city.  The staff is new and not very experience but they are kind and have good manners.  Not very organized in delivering service, on the slow side then again the wait was worth it because everything is delicious.  I never have a problem with upset stomach or tummy ache the way I have with other establishment when I suspect cleanliness problems or greasiness. Thumbs up for E.T.  I see other customers ordering seafood and vegi for dinner.  Their seafood is very reasonably priced;I like their shrimps and fried fish.  Their rice plate is cheap ($5.50) but you get what you pay for simple big plate of rice with a little meat in there.  Still filling and delicious on a budget.  The only downside that they have is the acoustic once again I mentioned before this place is noisy even when its not full.  I wish I live closer to ET because I am living way across town.  Even if you don't order their $19 for 3 items dinner, I picked 3 items(free dessert) and under $19 not include tips or tax , walking out full belly so  This is one of my fave chinese place!", "author": "Mar H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-16", "description": "My dad is the dim sum chef here, so I'm biased =). The food is very much home-style cooking - literally they are what we eat at home, minus the serving spoons on each dish because we like to use chopsticks to directly attack the food! Everything is cheap and delicious, and the desserts (mango pudding, red bean 'soup', tortoise jelly) are amazing, which is pretty rare because most cheap Chinese restaurants are quite weak when it comes to the dessert menu, if they have any.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-30", "description": "It's been over 3 years, so my wife wanted to try it again.  It's near our house, so we ordered to go food on the way home.  We were told that it would be ready in 15 minutes.  My wife gets talking to one of her friends, so we show up 30 minutes later.  Food wasn't ready yet.\n\nIf you think it is going to be 30 minutes, just tell us that it will be 30 minutes.  Luckily, this time we didn't have to wait as long.", "author": "Anthony T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-30", "description": "I love this restaurant. Is it the best Chinese food in the world? No, it is not. But it's WELL above average in quality and cheaper than it has any right to be. A whole list of big $5 entrees? Three entrees for $20? Feeding a group of ten people for $70 at a nice sit down restaurant with ambiance, decent (but not great) service, good food, and leftovers? That's a revelation.", "author": "chris c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-02", "description": "So had a large party taking up 2 round banquet tables, was a little tight but we like it cozy.  My Aunt and Uncle were feeling extra lavish and doubled ordered for both tables ahead of time, basically 4 group orders, we love food.  AND THIS IS WHAT HAPPENED NEXT:  all 10 courses came out within the first 15 minutes!!!!   \n\n     Let's break this down, 40 plates came out before even one plate of food was finished!  Not a joke.  I had then sat in my seat no more than 10 minutes from entering the restaurant and our lazy susan was full, no time to chat or visit with fellow guests.  For those of you who don't know how large a lazy susan is, 20 plates will not fit, I'd say maximum 8 medium size plates.  Yes we double ordered, so adjust, give us a slower plate progression, pretty simple idea.  Don't punish us.  So our waiters stacked our dishes as best they could and what did they do with the rest of the backed up food, they let them sit on an adjacent empty table until there was room.  Who likes cold food?  Not for me.  Not for anyone.  Besides, usually plates come out every 3-5 minutes, everyone ooo's and aahhh's at it, add's a little comment like \"Oh that's my favorite.\"  Nope.  Not this time.  So we munched and munched trying to clear dishes as fast as we could so that those poor lonely dishes on the side table could eventually join the party and hopefully keep a flash of warmth.  They brought out large fish and duck dishes (usually the high points of a banquet meal), saw they could not fit on the susan, and chopped up good looking food and dumped it  on smaller plates to make due.   Spent most of the night quickly chewing our food while playing the most complicated game of Chinese Banquet Lazy Susan Plate Management (not sold in stores) i have ever played.\n\n     Still venting here.  So imagine this scene: we sit, a frenzy of waiters march out an entire ready made feast before we could swallow a single bite, my elder asian relatives attempt to convey their fears and shock, then poof; the servers disappear.  Well easy night for the waiters huh, got that party taken care of, now on to other more important customers with fatter wallets.  \n\n     About the food.  Better than average Chinese food I eat when we go out banquet style.  Walnut shrimp and deep fried pork dishes best, duck little too fatty, fish and veggie dishes bit overcooked, still overall good food.  Main concerns: more salt than I'm used to and later dishes cold for the above mentioned reasons.\n\n     Paranoid, dangerous, politically incorrect thought following:  we have a happa family, most of the White side showed up first.  Could they have noticed this and assumed they could pull this blatantly bad service on us and White people couldn't read the situation?  Boy were they in for an earful when the rest of the Asians showed up.  My family has been dining out banquet style since the Ming Dynasty, never been treated like this.  \n\n     Closing thought: this place could have served the best food ever but if you have the feeling that you are not wanted and are a burden and nuisance to the establishment, you are not going to have a good time.  And yes I created a Yelp account just to express this displeasure.   Goodnight.", "author": "Julian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-20", "description": "Still a great place to go.  I've been going here since it was Best Panda and the food and service are still great!  The food can sometimes be a bit greasy, but at least you know that they're not cheap and sacrificing taste to save money.  Their lunch menu is the bomb!", "author": "Joseph C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-12", "description": "My family and I frequent this restaurant. The food is good and the portions are large. The 3 entrees for 19.99 is a good buy. Service is above average. I really like their dim sum menu but has been discontinued but will come back for lunch or dinner.", "author": "Steven J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-15", "description": "Great Chinese!  I've gone quite a few times with family and they always seems to deliver.  This is actually one of my favorite places.  5 stars based on food; of course service in a Chinese Restaurant is always lacking but if you're assertive they will get what you need.\n\nTheir chinese style calamari is excellent and the portions are huge compared to price.  I'm talking about a massive pile of deep fried goodness with delectable bits of garlic, salt, and peppers... mmmm....  none of this small ring bullshit, they slice the squid into flat pieces which IMHO is superior to all other methods.\n\nThey brought out a Sweet Garlic Chicken Wing dish that was very good.  This is a dish we would typically bypass but I'm glad it was on the menu.  Now one of my top favorites at this restaurant.  \n\nEverything else is good to very good including pea sprouts that aren't too oily and tasty stews.  \n\nBottom line is if you are in the mood for some solid chinese, none of this fried rice, chow mein, sweet and sour chicken bullshit but real Bay Area chinese, definitely head out to Empero Taste!", "author": "Micah W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-03", "description": "I live right down the street so it is very convenient and the food is good.  BUT, I now see that they have turtles on their menu and I find this to be disturbing.  I will not support any restaurant that has turtles on the menu!!!", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-07", "description": "Empero Taste=nom nom nom for a late Chinese/Lunar New Year.  We were all so excited to come together as a family.  We were cracking jokes, talking loud, laughing at one of the male relatives that went into the women's bathroom (and didn't care).  When the food came out though, you could hear a pin drop for at least 20 minutes b/c we were stuffing the food down our faces.  We ordered a 6 person dinner and added a few dishes for the eight of us.  Dishes included some of my all time Chinese favs: black bean clams, lobster, salt and pepper fried porkchops, dried beef chow fun, etc.  The only thing left was of course, the veggies lol.  We love this place so much that we will return for the pooled birthday celebrations soon!  On a positive note, this place is fairly clean for being really affordable/cheap Chinese food.  Don't let the price fool you, the taste is not compromised.  I can't wait to tear it up next visit!!", "author": "Steph W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-20", "description": "this the place if you want to get some bomb ass dim sum for the price, forget about koi palace which is over rated to start with... we spend about $60 for 5 people and we was full when we left, there was so many food for just $1.80 a plate... doesn't matter if its small, medium, or large... still $1.80, you can't go wrong... place doesn't even look run down either, beautiful and modern :)", "author": "JessePanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-29", "description": "Empero haiku:\nhaiku is the plural of...haiku\n\nEmpero I eat\nFor dinner with my fam'ly\nI am very stuffed\n\nI had a wo choi\nA lot of food came to me\nWe paid thirty eight\n\nThe waitstaff too nice\nThey seem to know what I need\nSuper quick service\n\nWhat is an Emp'ro\nMaybe one day I'll find out\nFor now mystery", "author": "tammy m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-06", "description": "Great food for a great price!  It can be a little cold in there, so bring a jacket.  You can get more variety if there's 4+ people so you can share the different dishes.  Great for typical big \"10 people per table\" family dinners.  I've never tried the dim sum - only dinner...", "author": "Jennie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-08", "description": "My family used to come here often when it was Best Panda.  We even came here a few times after it was changed to Empero Taste.  My dad l likes this place out of nostalgia (the owners are the same).  \n\nOne gripe, which is the main reason for the 1 star rating, is the service.  There's a lot of staff but they seem to do much of nothing.  The food took forever.  I mean, I go to a restaurant to eat.  Not to sit there twirling my thumbs downing cups of tea for lack of any food to eat. \n\nThey sat us down immediately, but it took them 10 minutes to come take our order.  We had to wave the waiter down to do that.    After our order was taken we were ignored pretty much for the entire time.   35 minutes later and still nothing on the table.  Ridiculous.  No explanation.  I almost thought they forgot about us.  They were busy, but I'm not going to make excuses for other people's incompetencies.\n\nI liked this place.  I really did.  I don't know what the hell happened.  Left a bitter sweet taste in my mouth b/c I enjoyed the food, but the slow paced service is enough to make me never want to return.  Ever.", "author": "Jeanne L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-26", "description": "I come here about once a month since it's so close to my grandparents' house.  They love bringing in their own fresh fish & seafood and the restaurant cooks it for us for a very small or no fee depending on what it is.  The food is alright except sometimes i feel like they deep fry stuff randomly regardless of the description given.  We normally get these large white clams that are two half shells (or one clam) for $2.50 and it's cooked with glass noodles & garlic. delicious! However, once in a while, they end up deep frying those too.", "author": "Grace H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-29", "description": "Not sure why this place only has three stars, because it's definitely one of the best Chinese restaurants I've ever eaten at, and I've been to a lot. If you know what/how to order, you can have a great meal here at a VERY reasonable price. The salt and pepper chicken wings and salt and pepper squid are standouts, but pretty much everything on the menu is good. The flavor is good, the portions are generous, and the prices are low...what more could you ask for?\n\nParking can be kind of a pain (it's San Francisco...go figure), but it's definitely worth the hassle. Don't let these bad user reviews fool you -- this is one of the best Chinese restaurants in San Francisco. People complaining about service can stick to P.F. Chang's -- I'll eat the real Chinese food.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-18", "description": "its some good ole cheap and good dim sum. for lunch time.. you just pick the items that you want. its very traditional dim sum. the prices are cheap. s are a 1.80. m are 2.20. although i think the portions are a bit small. i think the chicken feet only came with three feet last time. boo..i really like the Egg Yolk custard bun. thats really good.. not too many dim sum places have it. \n\nfor dinner... they cook really well. its descent. i think we got the spare ribs and some other dishes... i'd come back again for dim sum and for dinner. although sometimes the wait really sucks...", "author": "Darren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-12", "description": "I totally think this Dim Sum place is underrated on Yelp.\n\nMy friends and I went to Empero last Saturday for Dim Sum.  For less than $24 we ordered 6 dim sum dishes and a plate of the House Special Chow Fun (wide flat noodles).  It was super yummy and we had leftovers.  The BBQ steamed buns are the best I ever had.", "author": "Iheartcamels Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-15", "description": "I went there for tea and dinner before. I would definitely say No! to this place. Especially if there's a ugly , mad young dude there behind the cashier. I have no idea what he's doing there, he did nothing but yelling at other waiters. I am like, shut up, why dont you just do ur thing! Arent u working here?  So annoying. \n\nThe food are very salty! No a healthy sauce. Unless u fullfill ur salt quota for the whole week.\n\nI had the black bean clam, it's like a soup! Way to many sauce and taste bad! \n\nand we have some other fry course as well, and looks like they havent changed their oil for decades! \n\nThe last we had it's the fry rice! Nth special but just whole bunch for garage fry with rice.\n\nThere is nth good at all! People dun go!", "author": "Phoebe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-22", "description": "I just went back today, this time with my co workers and They loved it. We ordered a bunch of dishes and some dim sum and the bill was 40 dollars. What else can u ask for wen u have awesome tasty food for such a good price. Very good portions and no msg. tat freaken rocks.", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-15", "description": "The beef tendon is addictive.  It's just yummy.  It makes me salivate.  Give it a try -- it's in the clay pot section.", "author": "JC R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-28", "description": "Waahhhh, no more Best Panda.Best Panda was my standby for cheap good eats. It's been replaced by a prettier and cleaner place. But the food does not have the same oomph as their predecessor.  Sometimes change isn't good", "author": "Sophia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "Heard that empero taste cud have been that cheap dim sum I used to go on balboa/6th ave. The venue was nice and clean and the service staff were prompt and friendly. I appreciated their big bowl of warm soup upon getting seated! Their dim sum deals are pretty good with some dishes priced at $1.80. Loved the shrimp rice rolls...shrimp was succulent and fresh , har gow was good too with thin translucent skin. Enjoyed the crispy beancurd skin roll w black bean sauce and it must be good when a usually finicky 2 yr old loves it! The spicy fried squid was so tasty too! Was a tad dissapointed in the  ee Fu noodles though... Didn't seem like it was braised long enough to soak in all the yummy marinade. But this place is definitely worth a visit if u are coming to balboa.", "author": "Topazskye L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-24", "description": "What happened to this place. It was decent as of a month ago, but last weekend was just terrible. The only reason why this place gets two stars is b/c the service was better than expected. \n\nBack to the food. I ordered salt/pepper pork chop, hot and sour soup, and live fish. Hot and sour soup had some nasty fatty globs of pork in it. The pork chop was mostly fat. The live fish was over-cooked with very little sauce.\n\nI ended up just paying the bill and leaving without eating more than a few bites of each item. Ended up going to Yu-zen next door for dinner instead. What a dissapointment. I should have gone to Yu-zen to begin with, rather than paying for two dinners.\n\nI hope Empero improves the quality of food...", "author": "Roger R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-21", "description": "Empero Taste has fresh, tasty, and cheap Chinese food. The more \"authentic\" the dish, often the better it is here. The pea shoots are yummy, the surf clam is really better than most seafood I've had even at pricey restaurants, and the tofu dishes are excellently saucy. At these prices, you obviously are not going to get the best cuts of meat (and besides, most Chinese homecooking prizes chewy tendons), but the food is fresh and well-seasoned. \n\nService is fast. When Danny is in the house, it's friendly and efficient. When he's not around, it's every person for themselves. We sometimes leave if the place is crowded and he's not there.\n\nI've been to a lot of cheap Chinese places in San Francisco, and this is the best I've found outside of Stockton Street.", "author": "Jo Ellen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-04", "description": "Food is great!   We usually order the Honey Walnut Prawns, and Empero Chicken (half).  I've only eaten in once and the staff seemed attentive; great speedy service too.  We usually take out though but the food is priced reasonably and they have it ready for you in 10 minutes.  I'll no doubt keep coming back.^^", "author": "Yoko N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-26", "description": "Went there this past Tuesday for dinner. We ordered the $88 set price menu. The best part of the meal was the Beef cubes/Scallop dish and the Mixed meat clay pot. Service was effiecient. Price was fair. Place was clean...I would have given this place a 4 star, but I saw something that I'll keep to myself. 3 1/2 stars overall.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "I JUST came back from this place, and oh my ghawd was I satisfied. First off, bf and I ordered WAAAAAY too much. Thank god they ran out of the green beans or else we'd have another to-go box stashed away in our fridge. \nAnyways, the service was very friendly. Even though we ordered a lot they still joked with us (and not stared disgustingly like I half expected, although I'm sure they're gonna gossip now that we're not there LOL!). It wasn't very awkward, and I have a feeling that if we didn't order so much the service would have been just as good. \nThe food was really good, the one thing I didn't notice in their food was the all too common overpowering taste of salt. Unfortunately the majority of the 'good' dim sum places in San Francisco are pressured into adding salt to their dishes because the 'American' pallet doesn't like anything without salt in it, but OH GOD if you put MSG in it. [Mini rant over] We ordered chinese broccoli (which was steamed to perfection), sue mai (haven't tried it yet, but bf said he didn't like it...), chicken feet (delishiiooouuus!), beef in rice noodle (alright), mushu pork (first time ever having it, I really liked the veggies), turn up cakes (haven't tried it yet), fried pot stickers (alright), shrimp dumplings (didn't try it yet), fried beef spare ribs (hecka gooood, but salty), and custard balls (which we haven't tried yet either, LOL). For all that we paid just under $40, and we left a $6 tip. I liked it :3", "author": "Allie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-30", "description": "just went there today and was surprised to see the place wasn't jumping as it normally would at lunch time on a Sunday.  found out they no longer serve diem sum and from what i gathered the owners sold out...too bad.", "author": "Rose R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-16", "description": "Gee some people are rude with their reviews.  Let's be fair.  We eat at Empero Taste approximately 3 times a week for the following reasons:\n\n1.  The prices are hard to beat.  \n2.  The food has consistent quality.\n3.  The service is also consistent.\n\nWe have probably tried over 20 dishes on this restaurant's menu, including the Egg and Shrimp Omelet, Honey Walnut Prawns, Mongolian Beef, Chicken with Vegetables, Beef with Green Beans, Kung Pao Chicken, Sesame Fried Chicken, Shredded Pork with Bean Sprouts, Mango Pudding, Coconut Pudding.  I love the Honey Walnut Prawns and Mongolian Beef.  \n\nThe daily dinner specials are $4.95 and include rice. The dining area is spacious and clean and service is always fine.  Really, how do you beat this?  We also love Mayflower and other upscale Chinese but for value, this place is hard to beat.  The only thing we weren't so fond of was the fried chicken, which was a little sweet for our taste.", "author": "M R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-15", "description": "I have been to this location several times through the constant ownership changes.  The restaurant was remodeled again which is a great change because the floors used to be very slippery.  The food was good and tasted consistent for Cantonese cuisine.  My family ordered the set meal with ten courses.  The whole fried Chicken was very tasty and this is a strong indication of a good cook.  The food was not overly salty and did not have a strong MSG taste.", "author": "Ginny M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-26", "description": "I can here for dim sum and it was okay. The prices for the weekday were inexpensive so I had to try it. The food was not as tasty as I like it. A little bland. The interior however is very clean and nicely kept. I recommend a try.", "author": "Leon C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-18", "description": "I was not satisfied. Maybe I just got done eating a good Japanese meal, so going to Chinese food which I'm not a fan of anyway.. was a bigger disappointment than usual. But anyway, the shrimp was not fresh in the soup. The clams were supposedly fresh, but I felt that they were small in size. The rest of the dishes I tried weren't amusing at all. The only things that were good to me were the walnut prawns (do-a-ble) and the quails (which were good). I'll round it up at the 2 stars for it's simple, but bright decor (not bad for a Chinese restaurant) and the really nice busboy.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-22", "description": "Okay, maybe I went on a good day, or they realized their prices were ridiculous. I don't have such a major grudge against them anymore.", "author": "Alex Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-21", "description": "My first visit was earlier today. I cannot complain about the price. It's reasonable and the food taste is well just many Chinese restaurant. My biggest pet peeve was the dishes was brought to us at approx 7 minutes interval on average. I had to wait about 10 minutes on one dish we ordered. By the time the wait was over, the food, that was brought out earlier, has turned cold. Basically, I was eating cold diner.", "author": "T H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-05", "description": "We went for lunch today.  It was really cheap and I was surprised.  The dim sum was pretty good and the interior of this place was much much better than outside.\nFood was NOT oily and four women spend only $4 each (including tax/ tip)!! Amazing and we felt that we found a good cheap eat.", "author": "Miinno N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-16", "description": "this place is the best food is good price is right wtf u do u want?", "author": "Riz Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-13", "description": "Good Chinese food. This place is always crowded. Most of the time they have really good service. A great place to bring family and friends.", "author": "lilpandagirl P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-08", "description": "cheap food for the price.\n \n$5 rice plates!! that is the best. if you speak to them in chinese, they will usually give you more food.", "author": "Nathaniel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-11", "description": "um....my family loves it!!! always go there because it is cheap and big portion. everytime my family go will order one fish that make 2 dishes and 1 soup. very good deal. be4 this place was so dirty. now is getting better. i am not a big fan of it, but i am ok with it. good for family.", "author": "B B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-31", "description": "I had dinner tonight and was pleasantly surprised at the quality of the food. The restaurant was packed and the food on the other tables looked fresh and delicious. We opted for the set dinner for 3 people and added on the ying yang fried rice. It was all very good and very reasonable. The total bill came around $40. The interior is much cleaner and brighter than the old Best Panda restaurant and they even have a waiting area now. i was also impressed that they had some nice highchairs for kids, not typical of the usual Chinese restaurants that I've been to. We will definitely be returning again!", "author": "Keromi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "I've been here several times recently for dim sum and it's quite good.  Much better deal than some of the other options in the Richmond.  Fried rice or chow fun noodles for $4.95; decent shanghai dumplings, etc.  Worth a visit, and no lines on weekends.", "author": "John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-17", "description": "Slightly different owner than Best Panda.  It's the former owners son, Danny.  They are trying to make it better. And, Danny said he is going to lower the prices.  Some of the same cooks/staff are on board, but some left due to the shutdown to make changes in the decor, etc.  As for the food, yes, the clams w/bb was a little salty, but the flavor was there and so were the clams.  The sand dabs could have been better.  Lots of bok choy, not too much \"dabs\".  But the oyster claypot was a hit.  Give them a little time and I think they might come around.", "author": "AJ L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-13", "description": "Tonight I went back to Empero Taste to give them another chance.  I have been there for lunch a few times and for dinner once, when it was first open.  Last few times, I was disappointed but felt that they have some potential (at least the place was very clean).  Tonight I was finally happy.  The place is still nothing fancy but if you are looking for an authentic Cantonese seafood restaurant for family style eating, this is not a bad place.  The food is tasty and the price is very reasonable.  Most customers are Chinese and many of the special items on the menu are printed in Chinese only.  But the waiting staff and the captain speak English and they seem eager to provide good service.  They have the usual American-Chinese items but if you are adventurous, you can try their goose intestines and sea cucumbers, etc.  In the back of the menu, they also have the prix fix dinner for three, four, six and eight people.  I had their dinner for four tonight which comes with soup, sweet and sour pork, steamed razor clams, seafood stir fry and deep fried squab plus dessert (for $38 !!!).  Since we don't eat beef, we ask them to change their beef egg flower soup to sizzling rice soup with shrimp, and there was no problem.  This is not a place for everyone.  But if you are looking for good food, good value, authentic experience, lots of parking, and a place inside Outer Richmond, then look no further.  At least try it while it is still clean.", "author": "Denny K M."}
