{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "You should grab a cup of coffee and sit in front of the cafe, looking the world goes by. It's amazing.", "author": "Dang Lam N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-27", "description": "Someone got me two pastries as a gift. The puff pastry one was pretty good but the nut cake topped with raspberry was disappointing. The color of the cake reminded me of mold or vomit. I never met a cake I couldn't love until this one. I'm not sure what they are called, but am uploading pictures to help you identify them.", "author": "Julia C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-25", "description": "Corporate feels employees are replace-able, so naturally, no one gives a hoot. And they shouldn't. Work your ass off only to get laid off the second sales dip.\n\nEmployees must sacrifice their 10 min break if they need to use the bathroom. Is it hot out? Corporate will tell you to drink water to keep you safe--- but you aren't able to pee. It's hell.  Bladder infections anyone?\n\nYah you wonder why staff sucks? LMAO. No one can afford to live in SF on that pay. Poverty creators!", "author": "Aune M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-20", "description": "Visiting again the staff is very rude , coffe was cold, almond brioche shitty just like their attitude", "author": "Kevin N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-06", "description": "Tried to sell me an old croissant. Happily exchanged it for a fresh one when I asked.  I'm often taken for a tourist due to accent. They can't know that I know that Rulli should stand for quality not tourist trap. They train a new summer crew - that's fine but quality has to be right. Team lead may be British (\"take away\" - instead of \"take out\") so he should know quality.", "author": "Flo B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-13", "description": "Got a coffee and breakfast here while I was waiting for my place to be seen in the Apple Store across the road. \nThe plus of this spot is it's got great terrace seating overlooking union square. Great sunshine on a good day as it's south facing. \n\nNice to sit outside and they also serve beers and wine so it's even good in the evening. \n\nThe downside is the service is very poor. Found the staff to be rude when ordering, with no please or thank you's. \nIt's also a very touristy spot so the food quality is poor and it's over priced. Also no easy access to restrooms. \nIf they cleaned up these pitfalls this could be a really popular spot.", "author": "Derek M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-06", "description": "Im going to start by saying the latte I had here was the best I've had! Foam was super dense and coffee flavor was just perfect! Absolutely delicious, pastries are scrumptious, the only thing I would change to make this a 5 start (in my humble opinion) would be to work on the customer service or lack of, walked i. With not a person (customer) in sight, 4 to 5 employees behind the counter, I said hello and didn't get a response....waited and not one employee acknowledged me and my mum even though they looked at me straight in the eye, finally a gurl took our order (without greeting or remotely showing any emotion or desire to fake smile) asked a few questions and was given shirt answers...not happy with customer service at all! Coming from an extensive customer service background I would have loved to have been \"wanted \" in their establishment . Still coffee was Delicious. Note to owner and management work on your employees customer service.", "author": "Tulio T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-02", "description": "I used to love this place!  Tasty cappuccino on a nice day.  Their restaurant on Chestnut was beautiful with great food.  I'm here Union Square today and a different story. Maybe new owners?  There are notices of hiring and such.  I walk in and the overhead menu is gone and I ask and woman says we are out and I said but it was posted. She was short with me.  I ordered small cappuccino and a small pellegrino.  (Mid size bottle really) but not much and $9.10. Wow. They repeated cost and smiled when I asked why so much.  Prices should be posted. And the cappuccino is not very good", "author": "Linda M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-25", "description": "Location is great for people watching. That's about all that's positive here. The coffee was meh, and I wouldn't dream of touching the food.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-13", "description": "Very rude coffee maker/server (guy). We know that everywhere is understaffed but there's no reason to ruin someone's day with an attitude!", "author": "Fadwa A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-20", "description": "Awful service.   No straws for drinks, no half and half and this is a coffee joint and they're passing these cups to guest for water.   Whack whack whack!!   Owner should shut this place down and let someone come in that knows how to handle business.", "author": "Rhobin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "Great food; pastries, sandwiches, salads, juices, gelato and people watching!  The crazy homeless are a nuisance and either grab your food or hassle you for money, but I think they have a private security guy that chases them out depending on how they are acting.  I had a great cheese ravioli with tomato sauce and fresh basil.  A glass of Chianti, and then I followed it up with a lovely cappuccino.  Some old guy confined to a rolling wheel chair kept going by playing latin music, so it was a fun sunny day at the square.  Oops, I forgot to mention the brownie, and from what I understand, everything is made fresh daily in Marin and delivered.  Very Cool.  I saw some negative reviews, but my experiences have always been very good.  I do wish they could speed up the line when it is busy, my opinion.   Off to buy some shoes.", "author": "Francesca S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-31", "description": "My friend just got the spring caprese salad with bean salad. She said it had very little dressing on it, or flavor, and that it needs salt. \n\nShe went in to ask for salt and they told her they had no salt available in the cafe at all! No salt shakers, no salt packets, not even a container of salt behind the counter. \n\nBe aware, the salad is bland and no salt is available.", "author": "katie s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-18", "description": "I'm about to say something that's not very nice.\nBut I have to be honest.\nEvery time I come here, I really, really miss the old chestnut street location.  (It's now Ristobar)\n\nThis place would be 10 times better if it weren't for...\n\n1: the tourists\n2: the staff\n\nThere.\nThe unpleasantries are out of the way.\n\nI think the biggest negative w this location is the sheer volume that they get.  It's too hard to keep everything neat & clean.  Meaning you'll often find something reminiscent of a bus terminal if you come by after a rush.  I've never seen the outside tables NOT in disarray.  \n\nThe fact that the cashier didn't know what something in the pastry case even was when I asked him about it can't help matters.  He had to ask another employee, holding up the line.  Not good.  \n\nIt's Union Square Park.  You've got knockout views.  You've got knockout pastries & desserts.  You're at a world class destination.  When it's a gorgeous day, it is fabulous to be here.  \n\nSo if you can manage to get a clean table, you're really in the money.\n\nI've been a fan of Rulli's talent for a long time.  Since back when he only had the Larkspur bakery.  He is a true artisan.  \n\nTry to visit his original location in Larkspur.  There you'll find zero distractions from his fantastic creations.\n\n3 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-05", "description": "I can't understand why Americans keep trying to create Italian Style coffee shops (bar, as they are known as in Italy) with the same vibe and service that Starbucks offers.\n\n1- Coffee is disgusting. If you'd serve this dirty water in Italy, you'd close your business in 1 month\n\n2- Coffee is served in paper cups, even when you drink it at the table. \n\n3- The pastries are as bad as the ones you find in Starbucks\n\n4- Service is slow, inefficient and knows nothing about how to run an Italian style coffee shop.\n\n5- Wayyyyy to expensive for the lame products you are offering\n\nHere's a suggestion for the owners. Change the name of your establishment to 'Bob's Coffee on Union Square'. By doing so, you don't build up expectations for the countless people that walk in, hoping to get a taste of Italian service and quality.", "author": "Ricky R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-02", "description": "I used to like to come to this cafe to enjoy a great coffee or champagne and a delicious hot sandwich (lots of vegetarian options) outside on their patio. The nice patio is still here but the food and coffee are terrible now. There are no yummy hot plated foods or nice lattes. Just cold egg sandwiches in plastic wrap and bad coffee in a cheap foam cup. I can't stress how disappointed I was to take a loved one here this afternoon. Such bad coffee. Such bad food.", "author": "Pamela C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-29", "description": "I have been here many times and mostly enjoyed people watching. It's never been so bad as this time. We were 3 of us. One of my friends ordered a tea and 2 of us ordered flat whites. We got a table outside. The tea was given to us promptly. After 5 mins we went back to check on our coffee orders. There were 3 cups on the counter. I asked the guy who had taken our order, which two were ours. He shrugged his shoulder and said I don't know. We stood there for a while and then best guessed our order and took it. Today while going through my receipts I realized he charged us for 3 coffees and 1 tea. Such a rude person and corrupt setup.", "author": "Shabina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "On of my coworkers loves coming to Rulli. On Friday, October 9th around 10:30am, she came back with breakfast pastries for the office.\n\nI ended up trying the custard filled pastry. Flaky and not to sweet. Perfect for me. I typically don't crave sweets in the morning, but I was hungry and this hit the spot.\n\nI've never been to the cafe itself, but it looks like a nice place to chill, have a cup of coffee and people watch. I may do that the next time I'm in Union Square. I hear their coffee is really good!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-28", "description": "Rulli tends to be a little chaotic, and while that's to be expected in Union Square, the staff tend to seem a little more frazzled than they should be. With that said, they are nice; when my friend and I each ordered ham and brie panini, we then were given ham, egg, and cheese croissant sandwiches. When we pointed out that the orders were wrong, we were allowed to keep the wrong sandwiches and got our actual orders. (The croissant sandwiches were even better than the panini, as it turned out!)\n\nNice café food, nothing too special but definitely good enough eats. I do see why people are complaining about the prices; when there are so many other options as close as Macy's food court, it doesn't seem like Rulli quite measures up.", "author": "AJ P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "I am shocked by the low reviews at this spot - until I read through them. Some of these reviews are from tourists who are annoyed by pricing, so take my word for it when I say that this spot is awesome. \n\nMy husband and I came here for a quick brunch this past weekend - and though I'm a Bay Area native, I've never had the pleasure of visiting this cafe until Saturday. We got in a quick-moving line and both chose are meals. I got the favorito - the eggplant, mozzarella, bell pepper, and tomato panini and he had an Italian meat panini, I can't remember what it was specifically. In either case, we both loved our food items. \n\nWhile in line, you see the huge array of different snacks and we debated getting a chocolate croissant and cinnamon twists originally, but the opted to get the delicious looking sandwiches instead. The baked goods are also huge portions so we thought we might get too full. \n\nHe got an espresso and I opted for the chai latte - which is probably one of the BEST chai lattes I've ever had. We got a table on the patio, in the center and had a beautiful view of people dancing to tango, and people watched. Service was awesome - the cashier was courteous and helpful, and our plates were immediately cleaned off by a waiter who was bussing the area. \n\nSuch a quaint and nice experience - definitely a fun stop if you're in town!", "author": "Raji R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-20", "description": "Yuck. Blasting rap music and it was loud, dirty tables not wiped down, a girl behind counter had her finger in her mouth, girl behind register was rude and told me they ran out of chai. I walked out.", "author": "Stefanie A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-27", "description": "It's really unfortunate. They've got the prime location in Union Square so they've obviously decided to get by on that alone and not offer anything else of value... like a decent cup of coffee (ever tasted coffee that's been sitting on a burner for too long), or fresh pastries, or efficient service (the girl working there this last time was nice and moving at what I'd call a steady, measured pace, but she was literally all alone...working the register, making the coffees, serving the pastries...with a steady line of customers... Poor thing). \n\nLast time I got suckered in (after a few laps around the ice rink last winter) I said 'never again'. But today I just couldn't resist the late-summer view. Now I'm back to 'never again'.", "author": "Anton M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Quality coffee and espresso, good pastries, served fast and friendly, with great people watching (you sit right on Union Square). Warning: DO NOT GO HERE FOR A FULL MEAL. This place is a cafe designed for a break from the Union Square-area chaos (indoor and outdoor seating) with a tasty snack and/or beverage or something to-go.\n\nI love the Emporio Rulli in Larkspur, by my hometown, and was pleased to see it here.Thank you San Francisco for choosing two quality cafes for Union Square (check out Bancarella as well).\n\nQuality items I've had:\n - Espresso-drinks\n - Coffee\n - Croissants\n\nThey also have a variety of small sandwiches, cheeses, chocolates, and wine amongst other things.\n\nI took my father and my kids to Union Square for a holiday shopping extravaganza and sat outside with a coffee and a croissant for a much-needed break. The people watching was nice. You never feel like a tourist when you're sedentary and watching other people. THOSE people are the tourists, right?!", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-29", "description": "The rudest cashier for take out I've experienced in some time. Such a great spot ruined but bad customer service. Coffee was good, but ruined", "author": "Glenn B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-25", "description": "I was so excited to visit this cafe, conveniently located on the corner of Union Square with beautiful natural lighting and a classy (but relaxed) atmosphere... But my experience here was so utterly disappointing. I got to the cafe around 3pm on Sunday (yesterday), so hopefully some owner/manager can figure out who was working at this time and let them know that their behavior was unacceptable. \n\nMy main complaint: the workers here are terribly unfriendly. The guy at the register took my order and punched it in without a single smile, and seemed impatient when I took an extra 5 seconds to figure out which cookie I wanted. One of the other workers behind the counter wasn't at the register, but was grabbing the pastries for customers. She asked me which cookie I wanted, so I asked her for the one with pistachios in it. She didn't get the one I wanted (I guess there were two types with pistachios) so I apologized profusely and asked her to get the other one. She responded irritatedly with \"That cookie doesn't have pistachios in it.\" I apologized again and asked her to get the other one anyway, and she begrudgingly got it for me -- NO SMILE the entire time. When I sat down to eat the cookie, guess what? There were pistachios in it. \n\nThe food itself wasn't bad at all. I got a cookie with chocolate chips and nuts (sweet but not overly so), a cafe latte, and a scoop of stracciatella gelato (expensive pricing for tiny portions, but expected for such a touristy area). \n\nIt was a busy day, so maybe the workers were just feeling grumpy or overworked. But I really hope some action will be taken in training the workers better in terms of customer service, or hiring some friendlier people. Until then, I'll be getting my coffee fix elsewhere.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-19", "description": "DO NOT EAT HERE IF YOU HAVE FOOD ALLERGIES. Their staff is incredibly unknowable about all allergies and know nothing about the food they serve. If they do not know the ingredients they will make a guess that may cost your health. During my last visit, after realizing I had consumed gluten, I went to let them know their mistake and was appalled at their lack of care towards the situation and their customers. If I could give zero stars I would.", "author": "Martha E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-03", "description": "I know I ordered the wrong thing...\n\nI wanted something like a hot mocca/hot chocolate when we saw the Cioccolato del Doge which sounded so good http://www.yelp.com/biz_photos/emporio-rulli-union-square-san-francisco?select=KkiM0uC7vO348IkObO42fw#eKMEfRC4yVc8dwFVkMCYSA.  I was never so wrong.  It was thick like syrup, cloyingly rich and sweet, and a rip-off when two of them cost nearly $10 for a dinky cup where a good 2/3s of it was the whipped cream...\nhttp://www.yelp.com/biz_photos/emporio-rulli-union-square-san-francisco?select=KkiM0uC7vO348IkObO42fw#EeY879iyWQO3vP_etk5jKg\n\nTotally unsatisfying as a drink, I was left parched after I had it...", "author": "Lawrence L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-08", "description": "$9 for a latte and a cup of tea. not even loose leaf, but bagged tea. HAH!\n\nGTFOOH", "author": "Susy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-09", "description": "$3.00 for a stale croissant from Costco WTF?\nAll this does is make me never come back!\nYou don't save money doing this it far more expensive than you think!", "author": "Grant H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-09", "description": "After visiting this place with my friend today I was very disappointed by the horrible customer service. After ordering two Italian sodas, I saw the girl making it and notice that the sparkling water was old and had no bubbles in it. So I ask the girl to remake my drinks, where she was surprised, so I had to explain her that the Italian soda has to be made with flavored syrup over ice and fill with sparkling water. At the end the drinks taste as plain water with some color and no flavor what so ever. It's really painful for me to see this place going down. The service is horrible and the place is dirty and fill with flys. I wouldn't recommend this place to my friends which is really sad. I used to love this place and it was completely different.", "author": "Yana Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "Yelps 365 Review Challenge 2014 - Los Angeles #63 - #365\n\nNice little upscale coffee shop in the middle of Union Square, where you can enjoy a sip of coffee and people watch in the same time. \n\nThe ambiance felt as though you were eating in a coffee shop outside of a museum. Decorative plants and trees flow outside of the seating area with the downtown buildings towering above you. This truly is a downtown experience, other than your typical corner coffee shop (Starbucks).", "author": "Paul B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-31", "description": "Well, I know where to go when I want over priced coffee and medicore cakes, served by unfriendly and impatient staff.\n\nI was on vacay and I was looking for a coffee and maybe a little snack.  I went here, I was not impressed.  It was nice to be able to go sit in the park and people-watch. \n\nMaybe they were just really busy the day I was there or something, but I certainly would not recommend this, or at least not for a tourist.", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-03", "description": "I've been here several times over the years. Both this location as well as the Emporio Rulli at San Francisco airport. \n\nOverall it was not a pleasant experience. Let me explain why. While it's in the best of central SF locations, the daily maintenance and customer service are sub-standard. We came to the cafe late yesterday afternoon. There were not too many patrons to clutter my perspective. \n\nUpon arrival I noticed that many of the tables had not been cleared and the garbage was overflowing. Not to worry, we took a space in the corner and found it to be dilapidated picnic table, sticky with the previous patrons' food items. While patiently waiting for our food I had the perfect vantage point to observe one of the staff members who was attending to all the garbage duties. After finishing those tasks he promptly resumed taking food to the patrons' tables without washing his hands!!! Yuck! We watched the staff curse one another in a jocular manner, completely inattentive to the patrons who were entering and leaving the cafe. No wonder I had to ask twice to get my cake. \n\nAfter paying $18 (including tip) for two espressos and a cheesecake, one might expect a pleasant experience. No, it wasn't spoiled by an inebriated homeless dude or a noisy tourist bus. Emporia Rulli managed to bungle it all on their own. \n\nHow can they afford this location which such crappy service?!!?? Oh yeah, it's from the endless supply of tourists who want a draft beer in Union Square.", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-24", "description": "Every time I go here they steal my money. I remember paying 20 dollars for a 7 dollar salmon sandwich and then losing another 20 somehow when I came back years later. By now it's been so long not much can be done about it! But I'm sure you notice when your cash is overflowing at the end of the day. Are they not already pricey enough?\n\nI would rate lower but the strawberry shortcake was above average.\n\n5 STARS for the tiramisus.\nBut inconsistent. It appears they don't always have it. One day they have two, next day... maybe? No trace. Get the slice, it's cheaper than the small plastic packaged one.\nTHUMBS UP for the fedora cake.\nIt's a real cake, bigger than the one across the square at Bancarella. Tastes better too. Again, inconsistent in that they don't always have it. Fear it might just go out of sales and Emporio Rulli would lose the only good things about it in the square.", "author": "M R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-30", "description": "Great Caesar but we walked 2 miles for it and they were out with w no apologies. Stale croissants.", "author": "Patti P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-24", "description": "There is nothing special about this place whatsoever. Well maybe except for the fact that it is directly located in Union Square. I would be better off walking to a nearby Starbucks for coffee. The place is unclassy and the service is basic. With multiple orders placed, the baristas did not bother helping to figure out who ordered what.\n\nThe only redeeming quality is the outdoor seating so everyone can enjoy their basic food & beverages while appreciating the rest of Union Square.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-15", "description": "Came here for the first time with a buddy.  The place was nearly empty. He ordered a cinnamon twist and I ordered a cinnamon swirl.  The girl have us both the twist.  I said I got the swirl.  She grabbed the plate and toss the twist into the display case and grab the swirl.  We also ordered tea and she made that and put it on the pickup counter and walk away. Didn't say that was our drinks or anything.   She didn't even give me my reciept. \n\nEnough about her.  \n\nThe food was okay and tea was nothing special for the price. There are plenty of other spots in the area.", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Stopped here after a Alfred Hitchcock Walking Tour on 8/28/16 while on vacation in SF.  This was our first time at this cafe/bakery.  The entire staff were very nice and helpful.  My husband and I shared a Carmelized Brioche and a Sfogliatina (clamshell), of which the latter was our favorite.  I appreciated the choice of coffee which was perfect (I don't like super strong coffee). Lovely indoor seating as well as patio seating.", "author": "Janet B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "If you're already at Union Square this spot is quick and convenient. Lots of snack choices to tide you over until your next meal. The outdoor seating for people watching is a plus.\n\nActually, there are a couple of cafes and even a coffee kiosk at Union Square, and this spot is at the corner nearest to Niketown.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-14", "description": "Update: The manager of this location contacted me and apologized for the experience and I 100% appreciate that. I will give them another go next time I'm in the city. I added another star for him reaching out and will update once I try this spot again.\n\n\nI am leaving a review strictly on my customer service experience, I will leave an updated review if I have a better experience in future. I came here with my very sweet mother-in-law who wanted a cold coffee drink in the warm afternoon. She preferred a white mocha over ice, which was not on the menu, so tentatively asked if it was an off-menu possibility. Now, I have been to many coffee shops, ranging from the snooty to the down-to earth and have never been looked at like this lady did when she smirked at her and said, 'no, we can't; this isn't Starbucks'.......Wow, I was shocked at the gall of this smarmy little brat. So this wasn't Starbucks? I could've sworn I saw that green mermaid lady on the front door. (dramatic eye roll) Instead of intervening and saying all the wonderfully sarcastic things that came to mind about 10 minutes after we left, I stood by speechless and my MIL ordered a mocha over ice instead.\nThe moral of the story is this: If a coffee shop doesn't make something I'm looking for, they should (and have, until this place) suggest something they have that is similar, in a helpful way. They can think whatever they want about my lesser sophisticated way of drinking coffee but customers service shouldn't slip. Seriously, we aren't in France people, this is America and people like their coffee in many different ways, deal with it. \nThank you, I feel so much better.", "author": "Heather D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-26", "description": "Terrible service. Overpriced prices. The coffee I ordered was burnt. \nThe croissant was not flakey and tasted old.", "author": "Leslie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "I love stopping by this cute Italian cafe whenever I'm shopping downtown. They have the BEST espresso and all of their staff is amazing. Super friendly and very efficient.\n\nTry their chocolate brioche with your coffee next time! Delicious!", "author": "Kaitlin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "Stopped by during my short stay in the 415 and had saw this place on yelp so I decided to stop by. Everything was great. Good was excellent, great service and overall a great location and a great view of the downtown area. I highly recommend it during your stay in San Francisco.", "author": "Aaron J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-15", "description": "Iced coffee was ok, but would have been better if liquid sugar was available.  \nAlso had a chocolate croissant, and that was good, but nothing exceptional. \n\nNice place to sit outside at Union Square for people watching!!!!", "author": "Erik B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "I live close by and this is my favorite cafe around. I always thought it was touristy (expensive & poor quality) since it's right inside Union Square, but I was wrong. Cafes and pastries are actually very good and price is just average in the area.", "author": "Mario I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-27", "description": "Help!  There's lint in San Francisco's belly button!\n\nIf Union Square is San Francisco's belly button, Cafe Rulli Union Square is the lint.\n\nIt was an otherwise sunny day on Union Square, the tourists and residents were basking in glorious sunshine and all who came were here because Union Square represents the epicenter to our fair city.\n\nThis is a city known for its beautiful views, smashing architecture, smart people, sometimes odd but thoroughly adorable behavior and then there's our food and wine.\n\nIn fact, during this recently completed work week I spoke with people in New York, Austin and Seattle who were very much looking forward to their upcoming trips to San Francisco if only for the culinary bouquet on offer.\n\nAnd right in the middle of my beloved home town, our epicenter, our belly button, Emporio Rulli Union Square taints this city's culinary reputation by serving dishes that have not benefited from neither heart or pride.\n\nYes, it is packed on a sunny day and if you want a bottle of foreign beer or a scone, Rulli has managed to not balls that up.\n\nThe one and only small consolation was that manager didn't charge us for taking one bite of our salad and wait staff were very nice, apologetic and leaving Rulli to work at a proper restaurant.\n\nDo not patron Rulli lest you lust for lint.", "author": "Jay D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-27", "description": "Union square view and location is what the three stars are for. Ordered a cappuccino which was mediocre and the staff wasn't friendly. I ve had a mimosa here in the past which was pretty good. But meh for coffee.", "author": "Priyanka P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-29", "description": "It was a gorgeous weekday with the sun shining and a light breeze every so often...we grabbed a table outside, soaked up the sun and people watched.  What a great way to enjoy a day off!\n\nWe started the day with:\nCappuccino - $3.15\nLatte - $3.40\nBonjourno - $7.25 - breakfast sandwich with sausage and eggs - they heat it up with the panini press, so good\nbomboloni with custard - $3.35 - not bad but can be better\n\nLater in the afternoon, we had:\ndraft Peroni - $5.75\nglass of Primitivo - $9.75\nTacchino - $7.75 - turkey sandwich, quite tasty\ncup of soup - $3.6 - cream of vegetable, ok\n\nI can sit there all day...", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-21", "description": "Meh.  Pastry was cold, like refrigerator cold. Cappuccino was just Ok. Nothing like the Larkspur location.  We used to like this place. But, probably won't come back.", "author": "R D P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "8 oz GELATO FOR ONLY $5! And in Union Square! Are you kidding me? I had a Hazelnut & was asked if I'd like some chocolate syrup drizzled on top-OH YEA! It was amazing!! I'm only giving 4 stars cuz I tasted my husbands brioche & it was a little dry. Overall, great stop for a sweet indulgence!", "author": "Kathleen P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-21", "description": "Been there a half dozen time and never thought of yelping them but service has steadily declined here. \nThe last time aside from getting attitude from the cashier I over hears the other counter person mocking this poor tourist couple. \nSo I walked up and asked him if he was having a bad day. His response: I hate this $&)@ place. \nREALLY? then quite and save us all the grief. \nThey need an on site manager bad. \n\nHi", "author": "Marco M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-19", "description": "5-star Venetian Hot Chocolate !!!!!\n\nMake sure you order the churning Venetian hot chocolate on the counter, NOT the regular Hot Chocolate on the menu. \n\nThe absolute BEST hot chocolate ANYWHERE!!!\n\nI'll always stop by here when I'm in the neighborhood.", "author": "Patrick Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-24", "description": "I asked for a small coffee but I was charged for a medium coffee.Reason - god knows.\n\nI poured the coffee from the porcelain cup to the paper cup and showed to the person at the register.It was half of the paper glass sized small .\n\nI asked the person at the register any reason why I was charged for the medium when the quantity was not even half the small paper cup.\n\nThe manager came.he mentioned that it is a misunderstanding.Surprisingly ,he did not want to pay me the difference.\n\nIt was not about the 50 cents difference here. It is about the attitude of the cafe.\n\nNot sure ,why this happened to me, despite being a local person.", "author": "R P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-10", "description": "+ in the middle of union square\n\n+ / - decent paninis but i was hungry after a hour!", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-21", "description": "Food and coffee was good two days in a row, service personal were not good, specifically one person (woman) working the coffee machine.  \n\nI will proceed to say she was rude and should probably look at a different profession!\n\nLocation is captive and reflects they do not need to be polite to customers!  What a colossal failure, the service and owners do not really get it!", "author": "William S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "Good place to sit and have a coffee in union square.\n\nThis place is good - the people are friendly and the food is decent. Won't change your life though.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-15", "description": "Emporia ruli is one of the first places my bf and I went to when we went to San Francisco. With that said we came here two more times after that since it was conveniently located on the corner of Union Square. This place had a perfect view of the festivities that were going on that afternoon and to straight up people watch. Let's face it there are some pretty interesting people in out there! We ordered a platter with an assortment of cheeses (blue cheese...one of my faves), a swirl of fresh honey, fresh bread slices, Kamlata olives, candied walnuts and artichokes which was pretty mediocre. We didn't only enjoy the two glasses of red wine we ordered but also the extra glass of wine that our waitress offered us since she accidentally poured it. The only downfall is that the prices don't reflect the quality of the food.", "author": "AshnAmy -."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-15", "description": "no. I do not want a gift card from you. your genetic response to my review demonstrates how little you guys care about customers.\n\nyou can't buy me with that, especially not after the harassment we endured.\n\nNEVER GOING BACK.", "author": "Ara L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "My hubby and I were actually looking for a Starbucks but wasn't able to find one within the vicinity, so we decided to give this place a try. This coffee shop sits right in the heart of downtown Union Square where there's lots of foot traffic - which means this coffee joint gets extremely busy. \n\nThis place has definitely become our new spot for our all time favorite, hazelnut latte.  It has a very bold and flavorful aroma that is not too sweet like most other coffee shops - nor does it have that fake artificial flavor to it either. Surprisingly, this place not only serves coffee but you can also order a glass of wine right off the menu as well! There is also a pastry bar that appeared to be only the left overs during my evening visit. Those goodies did not look appealing at all...\n\nThis place is rather more upscale compared to your typical cafe. The employees were attired in white collar shirts and apron.  The staff is very friendly and well-mannered. There's indoor and outdoor seating available. Definitely a great spot to catch up with an old friend over coffee. \n\nWe look forward to coming back during our next visit to SF!", "author": "Mei W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-07", "description": "All I can say is, the Venetian Hot Chocolate! It's almost like drinking a melted chocolate bar, it's rich, it's hot, and it's delicious.\n\nThe best is going during  the winter, so you drink that cup while watching the ice skaters.  It's a very touristy  and busy area, so be ready for some crowds.", "author": "Nadeem A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "*********************** REVIEW 436 ************************\n\n          Located at Union Square, they open earlier than most coffee shops here on the weekend. The line was around the door at 10ish AM! Emporio Rulli offers coffee with pastries, charcuterie, cheese, sandwich, and Italian wines.\n\n           Took my folks and nieces here for some early latte and hot chocolate before hitting the shops for mom. Dad was shocked how inexpensive for the latte and 3 hot chocolates, less than 10 bucks! Yup in Union Square! \n\n           My nieces love the classic Venetian hot chocolate maker they have here. I also love their location in the Marina as well! It's such a well-run business!", "author": "Manda Bear B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-19", "description": "Im torn. Because it's in Union Square it has one of the best views of the park and is one of the greatest places to sit on a sunny day. Because it is in Union Square it's also one of the biggest shit shows of tourists and huge lines. Guess you can't win them all. Get a cold beverage on a sunny day and hope that you can grab one of the front row tables. They make fairly good sfogliatinas too if you need a snack. 3.5 stars", "author": "Kim N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-31", "description": "Stopped in here for a Ham & Brie Sandwich on French bread. There was nothing special about it really, but it was quite nice and fairly priced for Union Square.\n\nLocation - 5 STARS\nService - 3 STARS\nFood - 3 STARS\nValue - 3 STARS\nAmbiance/Decor - 4 STARS", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-21", "description": "Here's my favorite line from Federico Fellini's \"La Dolce Vita\"...\n\"I'm too serious to be a dilettante and too much a dabbler to be a professional. Even the most miserable life is better than a sheltered existence in an organized society where everything is calculated and perfected.\"\n...it's the kind of WTF comment you're likely to hear waiting in line here.\n\nIf you have a desire to become Eurotrash, motion your hands like Fellini and open your silk button-down shirt to your hirsute navel, by all means, this is the place for you. At least, that's the faux-fashionable type of customer that appears drawn to this glamorous kiosk...you know...the collagen-inflated woman with the perfect Buster Brown haircut...the hundred-dollar-bearing Italian tourist who orders one of everything in the extensive pastry case...the snippy, beret-headed ballet dancer who refuses to wait in line for his espresso...\n\nAs a lowly plebeian who buys his shirts at Target, I don't feel I belong here, a fact that was passively confirmed by the downward cast of the skinny server when I came up to order. I managed to overlook the self-inflicted snub and ordered a peach tart and a cup of coffee that totaled about $6. Guess what? The tart was actually delicious (look at the photo in the gallery). I sat outside on the patio, and a mime came up to me with a carnation. It was like a scene from \"La Dolce Vita\". Perhaps I am Eurotrash.\n\nCOFFEE/PASTRIES - 4 stars...flaky pastries and thick coffee...better than the other way around\nAMBIANCE - 4 stars...a European-style plaza cafe does make a nice complement to Union Square\nSERVICE - 3 stars...a tad snippy to me\nTOTAL - 4 stars...not a place I frequent, but when I'm feeling pretentiously Continental, here I will be", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-29", "description": "I love coming to Emporio Rulli especially because it's conveniently located on top of Union Square. I've been here quite a few times but the best of those were shared with my better half. We shared mochas and our absolute favorite: TIRAMISU!\n\nIn the middle of one of the busiest parts of San Francisco, the FiDi/Downtown of S.F. offers shopping, fine dining, local eateries, hot dog stands and entertainment. What I find is culture and where there is culture lies some sumptuous desserts & coffees!\n\nUpside: For coffee and desserts, Emporio is a little pricey with a cup of coffee w/ a single shot averaging to $5+ and desserts starting at $3. You'll be able to feel the quality and love put into everything they offer at Emporio. Yes, they definitely do serve alcohol for those seeking something cold & refreshing after a long morning of shopping for the women and holding those shopping bags for the men (& vice versa). Buy a hot dog from Stanley's Steamers (located across the street in front of Macy's), buy a pint of your favorite and sit down to a good snack. \n\nDownside: The only thing that surprised me about this place was seeing a slice of prosciutto and three thinly sliced slices of cantaloupe on a large plate priced for $10. I guess it can work for those who are on meager mode. \n\nEither way, it's delicious; patrons will be able to reflect on their day, enjoy the brisk air, encounter a pigeon or two and can really enjoy some coffee in/outdoors and have a conversation without the hustle & bustle of a Starbucks.", "author": "Carol L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-19", "description": "You're paying for location, but on a warmer night, or day - it's worth it.\n\nEspecially since the people watching here -  - an interesting mixture of tourists, weathered locals, and people who work in the area, is eventful. To say the least.\n\nWe stopped in here briefly and I ended up getting a mint Mighty Leaf Tea - and my cafe counterpart - got an orange soda and packaged brownie. The brownie was decent, and it's hard to go wrong with Mighty Leaf. The woman gave me an extra large cup - perfect for nursing outdoors - on  a concrete ledge - as I watched Union Square's magic unfold before me.\n\nThere are better, much cheaper sandwich and savory spots nearby - but as far as a decent pastry/dessert (though be warned that they are expensive) and a big cup of tea - goes -  Emporio Rulli is actually a pretty convenient and sweet spot.\n\nCome here for the experience - and keep your expectations for the food - a little low - and you'll enjoy this place.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-09", "description": "I have been coming here since I was a kid. I usually get tea (I am not so much into coffee). But the highlight for many is their rich Venetian Hot Chocolate..yummmmmmm. During the winter months, you have a perfect view of the ice skating rink. Beware of the pigeons the rest of the year though. They are VICIOUS!", "author": "Ariel Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "Perfect place for an espresso and pastry while people watching on a Sunday.  \n\nThe capuccino and espresso was delicious, the pastry items were simply ok.  But, honestly, you are dining here for the enjoyment of being in the center of SF's shopping buzz, people watchin, and taking in the glory of the city.\n\nIts a perfect place for a stop-over while shopping.", "author": "Natalie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-28", "description": "If I could give this place no stars, I would. \nHowever if you must go, AVOID worker: HUIQIANG. He's a jackass.\nIf you've read previous posts about the workers here and what horrible people they are, they aren't lying.\nI went to this cafe on September 27th a little after 9 am, so manager, please do the math and fire this jackass who was working.\nUpon standing in line, I was in back of two European men.\nNow I get it, I work in customer service, foreigners can be a bit harder to deal with.\nThey ordered two chocolate brioche and two coffees on separate tabs.\nThe cashier moron proceeded to make this transaction a lot harder then it should have been, verbally stating his annoyance with them for the separate charges.\nAfter they paid, he told them he'd call them when it was ready so they walked outside.\nAs soon as their items were finished, he proceeded to yell, at the top if his idiotic lungs, \"Europe! Your food!\" Multiple times to no avail.\nThen finally he says, verbatim, \"oh for fucks sake.\" \nHaha, what an impatient imbecile.\nFinally I ordered. A fruit, parfait and a tea. $11.45. Already packaged in the case.\nI got my tea and after the completion of the next two orders after mine I asked for my food. \nThis jackass went on to tell me he didn't charge me for either food dishes!\nThank god for receipts!\nOddly, after producing mine, this IDIOT, still insisted that he didn't charge me! Then he starts tapping on the register, doing, god knows what, so I pointed at my receipt and reiterated loud and clear \"fruit bowl and pafait, paid for.\" \nThen he tells me to wait on the side for my things, which I wouldn't at this point, before finally reaching over and handing them to me.\nAvoid this place at all costs! It has the potential to be amazing, minus the jerk face named HUIQIANG.", "author": "Ella A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-01", "description": "Beautiful drinks. Fantastically delicate pastry choices. Everything was delicious and lovely and you simply cannot top the location on the square.", "author": "Alissa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-20", "description": "Really captures the European spirit: in flavor and environment.  \n\nOrdered a small latte with a shot of vanilla syrup.  Not cheap @ $3.55.  But I just imagined a warm spring day in the middle of Union Square and it's worth every cent.  \n\nThe food and pastries looked tempting.  Service was surprisingly good.", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-22", "description": "Great location (heart of union square). Perfect for people watching. There was a nice selection of dessert options. The hot chocolate so rich almost bitter, but good.\n\nTwo dings though.. the coffee was not all that amazing and was overpriced. Also, the material used to make the cups and plastic water cups are very high quality which is great but not eco-friendly... I kept seeing people grab a plastic cup fill it half way with water and toss it in the trash (no recycling bin available). Pretty irresponsibly of a busy cafe to not offer recycling. Kinda left a bad taste in my mouth.", "author": "Nora N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "The customer service here is delightful everyone is very friendly and welcoming. I ordered the salmone panini. Which did not disappoint at all. I also ordered a latte which had pretty cool latte art. Definitely will come back to this cafe when I'm in the area.", "author": "Sisley C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-29", "description": "Draft Beer machine broken one day. Entire place shut down the next with no signage/reason why. Out of Perroni another day. Unfriendly service consistently. But what really annoys me is that they have these two prime locations on Union Square but treat that with such disrespect. I'm embarrassed for our City and the tourists that visit here.", "author": "Scott C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-23", "description": "(See pic)\n\nMore of 3.5 stars.\n\nBeen here numerous times but didn't find anything special to write an update since it's just a very touristy place for coffee and tons of pastries and some sandwiches/salads. Coffee was actually quite decent and did not have a face punching taste.\n\nBut writing an update for the Cialde they make and package. $15.45 for 4 slices of Italian style waffle that are for desserts, which is great pairing with Vin Santo, gelato or zabaglione.", "author": "T L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-14", "description": "I'm only giving this place an extra star because it's in a fantastic location and they do have good coffee/beverages. The service is terrible, the servers are not interested (I'm sure they probably have to deal with a lot of demanding tourists.) The food is HORRIBLE. Dry, stale sandwiches, wilty salads- it's never attractive when people outwardly tell you \"I can't add or take off anything because everything is pre-made.\" As a San Franciscan, I know better but damn, it's convenient sometimes! \n\nIf you're looking for a good place to people watch, def. have a drink (the pastries aren't that fresh either.) \n\nBut if you're looking to have lunch somewhere decent, PLEASE go somewhere else.", "author": "Lianne Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-01", "description": "Bottom Line: A fun and beautiful place to people watch at Union Square while you play tourist and enjoy some good coffee and food.\n\nOn this visit, we only had a cappuccino and an iced tea, but they were good just the same.\n\nThis cafe is situated in the heart of Union Square, and it's well kept.  Tourists are everywhere, so it's fun to people watch.  \n\nHave a coffee and a snack out here, and enjoy.", "author": "Anson G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-13", "description": "My husband and I spent the day checking out the downtown holiday scene yesterday.  The weather was UGLY but we were troopers and still managed to enjoy the beautiful christmas decorations at Union Square.  It was pouring rain yesterday so we tried to stay dry by seeking shelter at the Emporio Rulli cafe at Union Square. \n\n It was CROWDED in there.  I think everyone else had the same idea as us. \n\nI ordered a regular hot chocolate and my husband ordered coffee. \nI waited approximately 10 to 15 minutes for my small cup of hot chocolate.  It was kinda disorganized in there but I give it up to them - it was crowded!  Nice location and my hot chocolate was delicious but all in all this place was just OK.", "author": "Christine P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-29", "description": "3.5 - Location location location. On one of the few sunny days in SF, this is one THE greatest spots to be - out on the islet called Union Square - you get a great view to people watch, soak in some sun, and just enjoy being in San Francisco. \n\nWe were lucky enough to score a table with an umbrella. The Cafe is divided into 2 sections - self serve and full service. With self serve, you fend for yourself in finding a table, and fighting off the pigeons that stalk fallen bread morsels.\n\nWhile the hot beverages and pastries were quite alluring, I decided to go  with something more substantial - the Breakfast Sandwich ($7) - egg frittata, bacon, and tomatoes on focaccia. The eggs were fluffy and light as a frittata should be. Big serving too, coming as a 4\" x 8\" rectangle sliced at a diagonal.\n\nThe Tacchino Panini ($7.50) was pretty good too. Saltier than the Breakfast Sandwich because of the good portion of smoked turkey and melted fontina cheese inside, not to mention the ciabatta bread. This was served with a small side salad. \n\nWhile the sandwiches weren't to die for, the location was. And there's free wi-fi. So if you can ignore the gaggle of tourists flocking with the pigeons, this could definitely be a relaxing spot to while away a few hours.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-14", "description": "I know I'm supposed to be too jaded to love a place situated in the middle of tourist hell. But, that said, the people watching was great. The coffee was perfect. The food was wonderful. And on a sunny warm afternoon, with good company, I was very, very happy here.", "author": "Morris R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-06", "description": "If you're in Union Square and need coffee, Emporio Rulli might be a good stop.\n\nI need coffee to try to stay awake for the show Spring Awakening.\n\nI got a small cup of Iced Latte.  They charged $3.25 + .50 ice! = $3.75!  Evil small cup.\n\nIt was pretty good for coffee, not too bitter & kept me awake.  That's worth the extra charge I guess.\n\nFREE water on the side near the door if you need it.", "author": "Ann L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-04", "description": "Walking through the business district on a nice day and thought I could use a nice drink outside.  Went into union square and saw this place.  I ordered a draft Peroni which was served up in a beautiful tall Peroni glass and enjoyed it overlooking the square.  Perfect little stop.", "author": "Robert P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-16", "description": "A-ok! Emporio Rulli is conveniently located in Union Square and is perfect for those chilly nights in SF. The service was so-so, but I felt like that didn't matter because my boyfriend took our gingerbread lattes and hot apple cider to go. Their prices are reasonable and there's plenty of indoor and outdoor seating.\n\nHot Apple Cider - Delicious and perfect for a 37 degree chilly night! It was sweetened to perfection and really yummy.\n\nGingerbread Latte - I had a sip of this and didn't really care for it. My boyfriend enjoyed it, though.\n\nOverall, Emporio Rulli is a good cafe with yummy drinks and pastries.", "author": "Joyce E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-07", "description": "We went here after ice skating on a lazy Sunday afternoon, seeing that it was the only not tourist-infested restaurant around Union Square. And it was EXPENSIVE. We paid $70 for 3 (small) pasta salads, a caesar salad, a tuna sandwich, and two drinks. $70. Yeah. The food was only so-so. The pasta salad was relatively small and very dry (and it was, like, 10 bucks). I have nothing against the tuna sandwich, except for that it was also very small (at least they were generous with the tuna). So that's it. Find yourself somewhere else to eat for less. (Unless you really want to avoid lines during tourist season.)", "author": "Anonymous R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-15", "description": "It's a nice cafe in the middle of Union Square it can be challenging to get a  table due to their location but their selection is great. Affogato was very good!", "author": "Angel J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-07", "description": "This is a great place to have a drink or a snack while shopping in Union Square.  Well, it's an ok place. To be perfectly honest, if you're like me and you have a bird phobia, this is a horrible place to have a drink or a snack.  \n\nIf you're a pigeon, and you love free food and people watching, this is totally your spot.", "author": "Renee D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-25", "description": "I stopped in Rulli's today, craving a chai latte. Service was fast and the food in the case looked very tempting. I was pleasantly surprised it wasn't overcrowded with tourists as usual. \nMy chai was mostly foam and overly sweet, I could taste no cinammon or other spices. The worst part was that it was luke warm. I've been here before and have been satisfied with their coffee, but the chai just doesn't cut it.", "author": "Nastasia G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-20", "description": "As a big fan of Rulli's main location in Larkspur and their old Chestnut St cafe, during my last visit to SF I walked to Union Square in anticipation of a special breakfast. Despite the smaller variety of items offered at this location, the quality is still pretty good. Not quite at the same level is their customer service. Having more customers than tables is indeed positive for a business, a sign of success. However, it forces to make pesky decisions, like whether to give out numbers or assign tables only to parties that have all their people present. Rulli at Union Square decided to dispense with all these old school solutions and settled for a more revolutionary approach. Anyone, independently of their arrival time or position in line, can claim rights on a table by marking it with any available item. Today I was told by the staff that I had to eat standing because two tables were occupied by umbrellas and one by a bottle of water. I am not penalizing Rulli for choosing this rule, which obviously goes in the direction of increased democracy and gives everyone a chance, independently of untolerable privileges to which people who arrived earlier feel entitled. However, I must lower my rating due to their failure to inform the customers on the best strategies to win a table. My suggestion to future patrons is to bring a deck of cards and swiftly launch them on any available table as soon as they enter the door. This way one can beat any other customer trying to walk to the table to leave some paraphernalia on it before joining the line. Some of those sticky hand-shaped children toys should work even better.", "author": "Marco D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "Never thought the coffee would be as good as it actually was. The place is small so I took it to go, but the coffee was delicious!", "author": "Chela S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-20", "description": "overpriced, bland and unorganized! went there with friends to grab a drink before shopping. ordered a 12 oz hot chocolate and then waited for my drink at the window. the barista never called my name so I did not know my drink was ready.. when I walked up to the window there were 3 drinks there and when I tried to ask what these were he said he was busy! finally after serving out a few drinks he said they were hot chocolate & he'd make us a new one.. ok thanks! but when I finally got to drink it, it was more warm milk than hot chocolate! never going here again!!", "author": "JA A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-24", "description": "Food - 1 star\nService - 3 stars\nDog friendly - 5 stars\n\nBacon and egg breakfast sandwich - the bacon was super fatty and limp.  The bread was so dry it fell apart into a heap of crumbles. $7+ for this?!\n\nTurky panini -  Crispy outside but still cold in the middle. $7+ for this?!\n\nJosie poodle concurred with my assessment by pooping in the planter. My apology to the tourists from Canada sitting on the other side!", "author": "Kim W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-18", "description": "This place wasn't what I remembered it to be, at least not this time. My latte was still quite good, but the lively feel of my (formerly) favorite SF coffee place had gone the way of the dodo. The staff were very friendly with each other, but less so with paying customers.  My coffee saucer was dirty, as was the sugar/milk station.  I ordered a ham and cheese croissant which was pretty good.  The cheese was nice and melty but sadly the croissant was burnt. I guess I'll take the good with the bad, as the espresso drinks outclass Starbucks by a mile.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "Besides the expensive drinks they have, the food is surprisingly good. It's good for a light snack during the day or for a quick one during a small break.", "author": "Sanish S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-19", "description": "$8.5 for a tiny glass of sangria? And all they did was pour it from a plastic jar? And they didn't even bother to bring it to your table? Hell no. Don't even bother to try this place unless you wanna be ripped off.", "author": "Javier S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "This coffee is probably the best I've had at any food service establishment.  Strong, smooth, well-balanced, barely acidic.  This is just the regular house blend.  Your 2nd refill is free and the 3rd refill is only .65 cents.  I had the Espresso and Americano (on two occasions), a sour cherry pastry (i need that sour cherry in a jar) and a biscotti-like cookie (for dunking).  OJ is pucker-sweet fresh and sandwiches (which suspiciously seem to be a culinary students' version of the Egg McMuffin) are assembled between homemade sliced bread.  I don't recommend the sandwiches.  Go for the drinks and pastries.  The whole menu is crazy affordable for being ground zero in tourist territory.\n\nThe location is a terrific place to people watch on a sunny day.  Maybe it was because I was on vacation but the people seemed friendlier, nicer and happy.  If the view from where I was sitting could've been frozen in time and the imagery in the capable hands of a neo-impressionist, it could've easily have been in a John Hughes film.  (Big ups to the 80s!!)", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-15", "description": "Walking through Union Square today around 2 PM after a fantastic facial, I decided to stop at Emporio Rulli for a late lunch.  Bad idea - the horrible service completely ruined my post-facial high.  It started with Huiqiang at the register.  The guy couldn't be bothered with helping customers.  I asked for a Tacchino sandwich (he didn't offer to add a salad), a decaf cappuccino and a pan dolce cookie.  Huiqiang asked, \"Which pan dolce?\" (is there more than one in the case?) but didn't bother to follow me when I went to show it to him in the case.  Then he gave me a number for the sandwich that was being heated and grilled and told me to wait for my coffee.  The guy with the sandwich was ready before my coffee so he went looking for my number.  I stopped him and let him know that I'm waiting for my coffee.  Seeing me carrying 2 bags, my pan dolce and receipt, he proceeds to hand me my sandwich on a plate.  I told him that I need help carrying the sandwich because I needed one free hand for my coffee and pointed to a table outside.  He said he didn't want to take my sandwich outside and risk the birds taking it.  I asked if 1) he could wait a couple minutes until I get my coffee so we could walk out together or 2) I'll take the sandwich and he can bring me my coffee when it's ready.  He said, \"No, I can't do that.\"  What?!?  CAN'T bring me coffee?  Is the guy on a leash that prevents him from walking more that 10 feet from the cafe?!?  It was 2 PM and no other customers inside the cafe!  Even more ridiculous was another employee sitting in an interior corner table who laughed and rolled his eyes as if to say, \"yeah, the crazy things customers ask for.\"  To top it all off, the guy behind the counter hands me my cappuccino and says, \"uh, thank you\" implying that I was a difficult/rude customer.\n\nThe whole staff couldn't care less about customers much less providing service.  Glad I didn't tip but really wish I hadn't given them my business at all.  \n\nAs for the food, it was ok - certainly not worth putting up with the poor service and attitude of the staff.\n\nRECOMMENDATION:  Enjoy the square but get your coffee, sandwich or snack elsewhere and grab a seat on the steps or chairs around the park.  Rulli is not worth the demeaning hassle.", "author": "Tone C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-16", "description": "The iced coffee is pretty good here, and what's even better: taking that iced coffee and sitting out in Union Square, particularly on a wonderful, warm, sunny day.  I could have sat there all day if work wasn't calling.  Great spot to soak it up for some alone time, or grab a friend and hang out.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-07", "description": "You know, its a tourist spot, yet, there's quality in what is sold here.\n\nThis has become a meet-up spot for me. We always get sangria. No matter how packed Union Square is, the impact at the Emporio Rulli is handled well by the bartenders and waitresses running the show. It never is complicated finding a table either. Even in the middle of Union Square!\n\nIt's definitely a place to sit at and think to yourself \"Am I really here?\" and as you look around and see photographers taking photos you just enjoy it.\n\nLately, every restaurant I walk into has been in a philanthropist mood. I got pasta the other day. I don't even know what kind of pasta it was, but it was great and we never ordered it, but they gave it to us anyway, now I know of another good spot to get pasta around here.", "author": "Alexia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-20", "description": "Came here for a casual business meeting for coffee. \n\nHad a soy latte, and it was honestly one of the best I've ever had. Outdoor seating was great, and really beautiful. Having a cup of coffee, sitting in the sun in the middle of San Francisco's Union Square? What else can you ask for?\n\nI'll have to come back for lunch one day and try out their food.", "author": "Jon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-27", "description": "DRINK:\n1.) Vanilla Latte\n\nATMOSPHERE:\nIt's right in Union Square! Perfect for enjoying a Sunny Sunday afternoon to watch all the people pass by or others also enjoying the square. So it's nice to have a cafe here. And they sell beer and wine! It's kinda like a big kiosk, no bathrooms inside, very few seating inside.. just buncha tables and chairs outside. Table service section and also regular cafe seat yourself section. And oops, I thought this place was called il caffe, since that's what the signs say. But I guess that's ... Italian? for the cafe?\n\n4/4/2011", "author": "Angela L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-24", "description": "The wine and outside atmosphere was perfect. You couldn't ask for a nicer day in San Francisco. The service on the other hand was something to forget. The server kristyn just seems unhappy.", "author": "Tim D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-30", "description": "Union Square has always been a great location in search of an identity - over the years it's been redesigned several times, and today it's tiered piazza appearance invites people to come hang out and take in the heart of the city. Helping make the new square much more enjoyable is Emporio Rulli, nicely located on the eastern edge of the square so that you can sit outside and take in the sun on a beautiful day.\n\nLocation is without question Emporio Rulli's best asset, but its selection of light fare, desserts, and drinks are ideal for times you want to meet up with a friend, loved one or date for a casual experience. None of what I've had here rocks my world, but it's usually good enough to keep me satisfied and coming back. \n\nService can at times be slow - one would think that any owner placing a cafe in one of the busiest tourist areas in the western United States would realize that they are best served getting people in and out quickly, so be ready to wait in line for 5-10 minutes. (In fairness, the building is quite small so there's only so much staff they can add, but still...)\n\nOverall I recommend this place. You're not going to have a religious experience because of amazing desserts or outstanding service, but you should end up having a nice, relaxing time in the midst of downtown.", "author": "Gregg G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-24", "description": "Emporio Rulli I heart you.\n\nWhen I first moved up to SF in 2003, I fell in love with this place.  Even though I worked for the green apron company at the time, when I came to down town, I came to Union Square to take in and embrance SF. \n\nI'd bring a book and order:\n\nRistretto Hazelnut Doppio, a San Pell and whatever pastry looked good that day (usually a chocolate brioche).\n\nFor a good strong 3-4 years the staff had it down and already knew what I wanted, from a staff change and management change every 3 or so years, I would come sparingly, the ambiance has totally changed plus you can't smoke on the Square anymore.  It's definitely not the same.  I was originally going to give Emporio Rulli a 4, but because someone telling me what I can and can not do with my life, I'm taking a star back, other than that, I heart Rulli.", "author": "Edrian D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-08", "description": "Couldn't find parking at Brenda's this morning and already a line out the door and it wasn't even 10 yet.  We wound up at this tourist spot and although I have no regrets, it wasn't my first choice for a reason.  Overpriced chocolate croissant and ham/egg/cheese panini.  I wasn't surprised that it was but I did not enjoy paying $20+ dollars for 2 smallish pastries, a regular coffee and a latte.  It would've been a 2-star performance except my son really enjoyed sitting there and watching the birds (or as he calls them, the 'boyds') and the ice skaters--yes, the rink is still up.  The food was alright, the coffee much better.  So many other breakfast choices in the city so skip this cafe if you can help it.", "author": "Joc V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-26", "description": "There are two sections to this cafe. One with full table service and the other where you place your order at the counter and sit down and wait til it is delivered. That generally works for me. The operation runs smoothly and the food is tasty and attractively presented. I can't find a single fault with this place which occupies the best real estate in Union Square.", "author": "Paula H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-16", "description": "Went to this coffee shop because we were walking around in the city and wanted to take a coffee break.  The thing about this place is that it's the ONLY coffee shop in Union Square and so you're FORCED to go there.  It's not too hard to make a decent cup of coffee - so my iced coffee wasn't horrible, but if anything there was horrible, it was definitely the service.  \n\nAfter finding a table inside, we stood by the table and sat down to the DIRTY table and waited almost 15 minutes before we were able to get anyone to come and clean it.  And if anything, \"cleaning the table\" to them meant taking away the dishes and wiping the crumbs onto the floor... yech!\n\nThe place isn't the best for cold drinks - they do nothing \"blended\" (maybe I'm just too spoiled by Starbucks and Coffee Bean), and if you want it cold, they just put it on ice.  Our order was two iced coffees and one iced tea.  The iced coffee's came with no problems, but it seems that there was maybe a communication barrier when we mentioned \"iced tea\".  Though it clearly states iced tea as a menu item, it seemed as though no one ever ordered it.  The tea came hot in a mug, when asked for the iced tea, they simply provided a large glass of ice.  When we had asked the server to add the tea and the ice, he was about to pour the cup of ice into the FULL mug of HOT tea - not brilliant.  \n\nWe had also ordered a chocolate croissant and a regular croissant - both were pretty tough to eat.\n\nI'd definitely think twice about going to this coffee shop again!", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-22", "description": "Union square is very famous for the luxurious stores like Gucci, Louis Vuitton, Macy's, etc... \nOn the South-East corner of Union square at Geary and Stockton, you can find a little Italian café, called RULLI, where you can take a break after a long day of shopping. On a sunny day, you can enjoy  their terrace and the little art gallery next to the cafe. Without the noise of the street and the pigeons which perturb your relaxation time, this place could be very peaceful and calm.\n\nThe cafe gives you a large choice of drinks as hot drink (coffee, hot chocolate, tea), soda, juce or if you want it is possible to have a glass of wine. If you are hungry, you can take brunch at RULLI. They serve very fresh salads or Paninis. If you have a little hunger, you will enjoy their pretty stand of food inside of the cafe. Their prices are reasonable for a cafe in this place of the town. Inside of the building, the counter is in disarray with bottles of wine, foods, plates...\nThe waiters look very clean and professional. Every time you will be sure to be serve by someone because you will often find a waiter on the terrace.\n\nFor me this place has a lot of good advantages. I recommend it for drinks with friends, take a break or after a meeting. Enjoy it !", "author": "Valentine F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "1.IL Caffee RULLI is located at Union Square at Stockton and Geary St..\n2.The coffee shop services both inside and outside seats.\n3.There is a gallery nearby the coffee shop every Tuesday.\n4.Also, there are so many boutique fashion stores like Gucci and Tiffany&Co around the coffee shop.\n5.So many people enjoy talking and taking a break on their free time.\n6.The products of the coffee shop are quick and delicious.\n7.Even though it is the coffee shop,you can have beer,tea,breakfast and lunch.\n8.The price is a little bit expensive,but the service is very good,especially the juice is fresh.\n9.The transportion around this shop is busy.\n10.A lot of vistors come to the coffee shop.\n11. I really like this place because I could talke it easy after my school. \nI stongly recommend this coffee shop because this is the most relaxing place downtown.", "author": "CHUNG CHE C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-08", "description": "I'm a fan of the hustle and bustle of Union Square. This place is right in the center of it. It takes a REALLY long time to get your coffee, but it's full bodied and delicious. The out door seating is great.", "author": "Mahta P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-20", "description": "Seems like the majority of yelpers are quite fond of this place.\nSo am I. NOT.\n\nWhile the location was quite darling (Union Square) and was almost out of an Audrey Hepburn movie, the place lacked any sort of charm.\n\nFirst off, they had almost nothing to eat. Mind you it was like 11am, how do you run out of the majority of food? Oh that's right, it's all pre-made.\n\nCashiers were rude. VERY RUDE. I understand that I came off rather exhausted since I had a long night, but I smiled because I was hungry and nothing makes me happier than coffee and food. I asked simply if something can be altered and before I finished he snapped \n\"IT'S PRE-MADE!\"......Oh my bad, I should have known better since I'm a card carrying club member.\n\nAnyways, he forgot my apple juice and instead of being nice I just asked bluntly  \"my apple juice?\"  He grabbed it and slid it across the counter,no apology, but I carried on.\n\nSat outside with my group of friends and food came out slowly but surely. Sadly 2 plates didn't come out at all. We asked if one of the umbrellas could be taken down, never happened either, we were told frankly that one of the dishwashers will get it....even though he clearly was a bus boy. \n\nOne of the girls finally asked for a manager, who took forever to come out and when she did, she was just as rude. She demanded to see reciepts for the missing food and then when being approach for another question....she interrupted with \n\n\" I'M BUSY. LOOK AT THE SWEAT COMING DOWN MY FACE!\"\nThat's not only rude but plain gross. \nShe brought out the plates and one was wrong, oh well free fruit.\nFinally everything was out...she was gone, with no formal apology.\n\nThe food was bland,really bland, almost soggy  and the salad was wilted.COFFEE was excellent, I'm pretty sure they have better drinks than food. \nMaybe we caught them on a really off day? oh well, it was definitely an unpleasant experience,  customer service really defines an experience ( I've been a server for 4 years and counting) I might give it another try, we shall see.\n\nFYI= Pigeons seriously stake out the tables, the minute you get up they come like an army, almost like a scene from The Birds movie, I'd advise you to run and run fast.", "author": "Liz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-19", "description": "having breakfast early in the morning at rulli's brings me a diffrerent perspective of union square, no bustling crowd, no undesirable traffic noise, just fresh air and a calming peace of mind, i like to take my time and enjoy my cup of latte and croissant and let my mind goes blind for a while , sometimes simplicity brings out the pleasure of life.", "author": "Jerry S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-23", "description": "Emporio Rulli likes to occupy only a particular type of location.  Locations that are tourist ridden and somewhat isolated in terms of other dining options.  Locations like Union Square and the international terminal at SFO.  \n\nFor this reason, they like to rape their customers.  Everything here is below average, and WAY OVERPRICED. My normal, every day small iced soy latte at the Union Square location is $5.05, and at the airport it's over $6.  And what really irks me is at both locations, they don't have simple syrup at the condiments bar, so I can never sweeten my iced drink properly.  When I recommended they begin carrying some, I received a curt and apathetic reply from one of the employees: \"Yea, that's already been recommended. Thanks.\"  For a $5 espresso drink, I think they should offer some freakin' simple syrup to their customers, like almost all other coffee shops do.\n\nIn addition, the food is pre-made, nothing special, and obviously, very overpriced.", "author": "Genevieve M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-05", "description": "For the location , it was better than expected. Still overpriced for below average food (sandwiches are tiny although I enjoyed my tiny milanese sandwich...the bonjourno my bf got had limp old looking cheese and pre-packaged sausage. However, as said previously, the location is prime and I expected even more skyrocketed prices and even lower quality food. Doesn't mean you can't make your food awesome though....", "author": "Anne C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-29", "description": "The setting is gorgeous: prime location right ON union square.  Outside of that my panini was average.  It arrived at my table lukewarm.  My friend got a beet and goat cheese salad, which was pretty tasteless.  Definitely, not \"a-ok\" -- thus the 2 stars.  This place is much better for beers than food so depends what you're looking for.  Feels like they are catering to tourists who don't know any better and maybe don't read yelp.  Definitely not recommended for a lunch spot.", "author": "Rob E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-17", "description": "Glad to see something in Union Square is open early while I'm waiting for the 30 or 45 bus to get to work.  So yeah, walked in, grabbed a coffee, and bolted out to see if my bus arrived - and it was there... whoohooo!\n\n12oz coffee = $2.05", "author": "Limzer L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-16", "description": "I was here with my family for an after lunch coffee. After hunting for tables and waiting in line for about 10 minutes, we managed to order the pastries, coffee, tea and hot chocolate.\n\nAfter getting most of our order, I had to wait 15 minutes till I got my hot chocolate! Even after asking multiple times and getting reassurance that I'm getting it, it wasn't until we started yelling that this is unacceptable that someone grabbed a paper cup, poured some syrup and milk in it and gave it to me. It was horrible. After some more complaining he manager sent us away with a cookie.\n\nThe coffee was okay, nothing special. The pastries a bit dry, again nothing special. I wouldn't recommend this place even for sitting around Union Square, unless you just want to sit outside with some mediocre beer.", "author": "Peter F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-22", "description": "I like the convenience of the location because after a tiresome two-hour wait in line for a meet-and-greet and shopping I wanted to grab a quick bite.  It's a good spot to grab-n-go and find a spot around Union Square to eat your food (if weather permits).  I got the Tacchino turkey panini- plain, simple, and somewhat small for a $7.50 sandwich that comes with no sides.  But I loved how it was hot off the panini press. \n\nKnow what you want quick because it gets crowded in the tiny place and you'll feel rushed.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-07", "description": "HOLY NAME CHANGE, BATMAN!    - Place was cool, quick and efficient....  but this is not the name of the place, it has changed....   Decent place to grab a coffee before exploring the city....  Nice start in Union Square~  :)", "author": "Dean P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-06", "description": "I once spent a lovely afternoon at Emporio Rulli with my mother, sipping espresso and munching on pastries in the sun. I returned last week for a solo lunch only to be confronted with sub-par food and bored service.\n\nI ordered the caesar salad with grilled chicken. The dressing, parmesan, and croutons were sparse, and the chicken was of the most bizarre texture - what I can only describe as gooey and chewy. I kept checking to make sure it was actually cooked and not raw in the center. I also ordered a bellini, which was so thick and sludge-like, I questioned whether there was even any prosecco accompanying the peach nectar. \n\nMy server seemed annoyed by my presence and tried to rush me out quickly. The only redeeming value of the meal was its convenient location in Union Square, affording the opportunity to people-watch in the sun. \n\nI thoroughly enjoyed my first experience here last year, but now understand why Emporio Rulli is overrun with tourists, who simply don't know any better.", "author": "Britt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "Excellent place to have coffee and pastry. The staff is also nice. Try the caramelized brioche (the staff calls it the crown jewel).", "author": "M Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-27", "description": "I have an unexpectedly fond memory of this touristy cafe- breakfast at Emporio Rulli was the end to a long and arduous adventure. The premise: My fiance and I had walked past some dive named David's Delicatessen awhile back, and we were intent on going back into SF to give its \"highly-touted\" breakfast (so the window sign read) a try. \n\nSo Saturday morning, we get up at 8am and trek our way into SF damn skipping sure that we know exactly what we we're getting into w/o first consulting Yelp... or a map. At 9:30am, we're still looping endlessly through SF, wandering in and out of the Tenderloin, gingerly avoiding crackos and be-slippered hobos, working ourselves into a grump. \n\nAt 10am, fiance suggests that we perhaps settle for a different deli/cafe- perhaps Peet's? Or Starbucks? I flat out refuse. Aside from walking past 10 or 15 different Starbucks, (all within 20 blocks of each other, all mocking me with their carbon copy signs displaying frothy holiday drinks) I want to go some place new. Some place \"different.\" After all, I've just walked who-knows-how-many-miles of rolling SF hills; I don't want another Costco scone. \n \nWe end up at Union Square for a break and- well what do you know! There's a cafe right on the square! The crowd looks schmoozy and international, and the architecture suggests bad food, but we're hungry & not-so-hot ourselves (what with the sweat from the walk.) We order two cups of coffee and two pastries, and the total comes to --brace yourself-- a mindblowing $18. \n\n$18. For a pair of coffee & pastries. \n\nSneaky sneaky, guys... Not listing the prices of each food item next to their displays. Kindof a mean-spirited way to take advantage of the customer who doesn't want to appear gauche by asking for a price tag. You got me (finger guns). \n\nLong story short, the coffee was decent and the pastries were stale. Did I mention I paid $18 for the privilege? But maybe that's not the point. Maybe the point is the lovely scenery atop Union Square, appreciation of the rare San Francisco sun poking its head out from behind Karl the Fog, the ice skaters in the winter, the artists setting up their booths in the summer. \n\nAnyway, I later found out that David's Deli is rated an impressive 1.5 stars on yelp (dodge a bullet there, at least) and learned my real lesson: Bring a sandwich and enjoy the free view.", "author": "Tianyi S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-24", "description": "Great location and about what you can expect for decent coffee drinks. However tables are not bussed often enough and probably hosts one of the most unfriendly & miserable barista teams I've ever seen. Too many coffee options out there to support this place.", "author": "Bryce C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-12", "description": "1 star for service, 2 stars for the coffee, and 5 for the location. Nuff said!", "author": "Gaurav A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-10", "description": "I love the fact that people are on here complaining that this place is touristy and expensive and that's a downside.  It's in Union Square, people!! (Of course it's touristy and slightly more expensive than usual.)\n\nIt's a cute little coffee place with delicious looking pastries (I can't eat them because I eat gluten-free) and has great cappuccino!  It's also very convenient to visit before a long walk across the city.  Love it, will be back  next time I'm in the city.", "author": "Meghan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-20", "description": "This place has great sweet/savory pastries & cake slices. everything I've tried as been fresh and on point!! I'm big on good iced tea and there's is really good. plus great location to grab a light lunch/snack after shopping til you drop in union square. \n\nMy boyfriend and I ordered a couple of iced teas and i had a simple but fresh bitter almond sticky round pastry. pillowy inside, mildly bittersweet outside, my boyfriend however went all out with one of their berry cake slices, this one started off with a white cookie-like crust then there was a creamy layer, a creamy berry layer (my favorite layer), and another layer of the cream. then a thin layer of pillowy white cake, another type of cream on top of that, then finally a beautiful arrangement of strawberries, blackberries, blueberries, and raspberries. divine \n\nthe thing i like most about this place is you get what you pay for. there's nothing worse then stepping into a nice bakery and seeing all of their beautiful displays of pastries, cakes and goodies and to splurge (not only from the wallet, but of the waistband) for a treat only to take a bite and its STALE! that doesn't happen here! and i really appreciate that. \n\nthis place is also a prime for people watching! the highlight: at 1:30pm on a Tuesday there were (i counted) 10 tables of single dining middle aged women here each with a spinach salad and a glass of wine (and yes there were refills).. seriously people on a freakin TUESDAY! ha ha not only the bums get sloshed before 2p midweek.", "author": "Kristin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-25", "description": "This place is over priced. A small cookie cost $3.35 with no taste. A cup of Grande Latte costs $4.80 which is also just OK.\n\nThe table is cramped and very dirty. The waiter only come to clean it when they feel you sit too long and should leave.", "author": "Chun L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-17", "description": "Europe in the middle of San Francisco? (minus the sweater tied around the neck and the soccer jersey top)\n\nThe staff was great as were the options in the food case.  I find that coffee shops have too many sweets and not enough savory.  This place had friggin lasagna just below the croissants.  Awesome!\n\nThe coffee wasn't bitter and plenty hot.  Most of the people inside were speaking different languages.  No restrooms, by the way.\n\nDon't half step.  Come here to kill time and enjoy Union Square.", "author": "Brendon D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-18", "description": "Well, they have tap beer and people watching. How bad can it be?", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-06", "description": "This place is conveniently located in Union Square and yesterday the weather was nice so it was crowded.  My friend and I had decided to stop and take a load off to figure out our next move as we enjoyed \"girl time in the city\"  I spoke to a gentleman in the long line who told me that this was a family owned business started by immigrants and that he thought the baked goods were out of this world. \n\nThey served Mighty Leaf teas which is pretty exciting! I ordered earl gray tea for my friend and a chai for myself as well as an intriguing little pastry that had hazelnut in the description.  The young man putting the tea bags in the cups was told by me and by the woman taking orders that it was earl gray and chai at least two times each and he still managed to put an English breakfast bag in one of the cups...? \n\nOnce my friend got her head around her new flavour of tea, we sat in union square and watched children play and adults interact for more than an hour just talking and catching up.  It was delightful and the pastry was pretty yummy too!\n\nThis place has the potential for greatness as it is so well located with quality wares...the busy-ness seemed to affect the IQ of the help but I have to say the overall experience was very nice!", "author": "Liz F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-15", "description": "Great coffee and pastries and with the outdoor seating right in union square you can't go wrong.", "author": "Scott G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-27", "description": "This is definitely a tourist spot. But its a good one. I probably wouldn't make my way here with regularity, but... is a great spot to stop for a beer and a salad on the walk home from work. I've had the caprese salad and the cheese platter (shared). both were good, and worth the $9-12 price. Service was good/average. they were busy but they got around to us and the many tables that were there in fine time. i wouldn't recommend it as a 4 or 5 star place, its just a counter and a patio, but it is a patio (which is hard to find in SF),  the manger was very friendly, and the experience was good for locals and... tourists.", "author": "Adam X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-28", "description": "The Venetian hot chocolate is worth a special trip.\n\nJust remember to ask for it by name.  When I first went and simply requested \"hot chocolate\" I got a good but no better than anywhere else hot chocolate.  They didn't ask if I wanted their specialty, so I had to make a second trip.  (Not good salesmanship, folks.)\n\nYes, you can consume the Venetian hot chocolate with a spoon.  It's that thick.  Get it without whipped cream to keep it hotter longer.  The whipped cream just gets in the way anyway.\n\nThey open at 7:30 a.m. seven days a week.  \n\nThe baked goods I have had are nothing special, and are expensive ($3.35).  Oddly, a few items in their food case have price cards, the rest don't.  I had to ask to find out that a tiny sandwhich is $7.50.\n\nAnd note that you will be charged $4.55 for a small cup that is only two-thirds full of hot chocolate.  For that price, they really should fill the cup.\n\nIf there is better hot chocolate anywhere in SF, I want to know about it.  Now.", "author": "Bay G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-18", "description": "The perfect downtown spot for a cup of coffee while pondering life with a friend and taking in the ambiance of Union Square all while being serenaded by a homeless guy singing B.o.B's Airplanes.\n\nA quintessential San Francisco afternoon.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-22", "description": "location location location.  on a bright sunny day, who wouldnt want to sit in the middle of union square and enjoy a drink and a pastry?  perfect for people watching and relaxing after shopping.  \n\ni had the strawberry shortcake and the cake in the middle was stale and dry. but the weather!", "author": "claudia y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-16", "description": "Ok this place is pretty cool.  I was walking to Saks and decided to check out this place.  My latte was the way I like it good and strong.  I was drawn to this rice-like pastry that turned out to be heaven.  The name of it was rather complicated so I apologize for not knowing wtf it was.  One thing I noted was that you pay $.75 premium for coffee drinks than your garden variety Starbucks.  But hey, this one has beer and wine!  \n\nThis place actually gets 3 stars plus one star for the cool location.  You can see kids ice skate and laugh at the adults falling.", "author": "Rob Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "One of my favorite places for Italian pastries.  Torta de la Nonna, filled with custard and chocolate.  Oh, and don't eat the Cannoli, save them for me!", "author": "Arlene C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-05", "description": "Pros:\n\n+ 1 star for its awesome location, smack dab in the middle of Union Square.\n+ 1 star for the option of outdoor seating, which is lovely for people-watching on a sunny day.\n+ 1 star added for its pretty kick-ass cappuccino, which hit the spot after some hard-core shopping.\n\nCons:\n\n- 1 star for its chaotic atmosphere inside.\n- 1 star for its long lines and wait (just as bad as a Starbucks).\n\nWe're left with 3 stars for this little cafe...", "author": "Nina B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-27", "description": "As has been stated, the location is key.  And with meager options in the vicinity, it is a likely choice I will even return to.  \n\nI ordered a brioche, and they gave me an almond brioche.  Mistake.  I ate it anyway because I was halfway through it before I ran into the puddle of almond-sugar.  The brioche itself was unfortunately weak, a little stale, and reminding me of a pre-packaged product.\n\nI ordered an espresso because they use cheap milk that was unattractively in gallon bottles on the back rack.  The cashiers seamed beat.  There were no seats outside available (location, remember?).  So I sat inside.  The place is attractively built inside and out, and I never feel rushed, once I find a seat.  \n\nThe espresso was 'meh'.  Very dark roast took all the flavor out of the bean, and it was syrupy when it should have been frothy.  Tasted good when your totally famished.\n\nWithout any reasonable competitors, I may return if I find myself in the area.", "author": "Marc M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-28", "description": "Pricey, pricey, pricey...\n\nBut still I was pleasantly surprised from a recent visit here.  I tried one of their entree salads, a rather large serving of baby arugula, beets, goat (?) cheese and walnuts dressed in a light vinaigrette.  It was new, delicious and quite filling!  I forgot the name of it - Insalata di Something OMG It's GOOD, Try It!\n\nReally.\n\nAfter wolfing that down, I attacked an apple strudel and coffee.  Nice big slice.  The filling had some consistency of marzipan with apple chunks and nuts that was thick enough to earn the adjective \"meaty\".  But I still liked it.  You need a knife to help you eat one.\n\nOverall, I think if the prices weren't so steep (knocked a star down for the prices) Emporio Rulli would be a good place for a splurge lunch.\n\nGet that salad - it's worth it.", "author": "Eileen P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-20", "description": "I'm not a food handler extraordinaire but I knew when I saw all the milks out on the counter on a warm day and the Barista not using a thermometer to check the milk temperature as it was steamed, that this place was bad news. I ignored my instinct and drank my luke-warm latte while people watching on a beautiful day in Union Square. Unfortunately, within 2 hours, my beautiful SF day was ruined. I've now been confined to my house as my body turns itself inside out. I would not wish this day upon my greatest enemy. Do yourself a favor and stay far away. Head over to one of the many surrounding Coffee Beans, Satrbucks, Pete's, anywhere. I wish I had. Save yourself the horror.", "author": "Heather U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-22", "description": "2 stars for location on a sunny day. Annoyed at rude staff member who practically threw our food on the table and turned to leave without explaining which sandwich was which (they all looked very much alike). I asked if the server would bring out our coffees to the table and was told no - I had to go inside to wait for them. Apparently it is ok to leave my hot sandwich outside to get cold while I wait 10 mins inside for the coffee. Can I please have my tip back?", "author": "Maz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "We had breakfast here on a Sunday morning and it was absolutely lovely. We sat outside under an umbrella and had a great time just enjoying coffee, pastry, salad and sandwich. Their latte is absolutely delicious and so were the other dishes. One star off because most of the day this place is just too busy -- but we got there at 9:30 and had no problem.", "author": "Guido v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-29", "description": "Great location, delicious espresso drinks, yummy paninis, tasty pastries, friendly staff.  What more can i ask for on a sunny Sunday afternoon?", "author": "Yvette F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-26", "description": "I like that this place is literally on Union Square- but quite frankly its overpriced and not that great.\nThe paninis are all pre-made somewhere and brought over to the cafe so all they have to do is grill them- say goodbye to any customer requests or alterations to anything.", "author": "Janell D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "I love this place.  I love their food, their coffee and teas.  I love their views of the Union Square.  I came here for breakfast again, but was disappointed.  I placed my order for coffee and a ham & egg sandwich.  Got my coffee and the number for my sandwich.  I sat outside to enjoy the beautiful Christmas tree and the ice skating rink activities with my number placed on my table.  30 minutes went by and no one from the café brought my sandwich to me nor to check on me to give me an update on my sandwich.  My coffee was cold and the sandwich was still not ready.  Finally I waved to one of the staffs for attention (took awhile), a waiter with blond spiky hairstyle came over and immediately apologized without me telling him what I calling him over for.  He immediately informed me that their printer was stuck and stopped printing.  He noticed the number on my table and asked what I was waiting for.  I felt upset before I called him over for the long wait of my sandwich, but due to his good customer service and the willingness to take care of the problem for me, I felt less upset.  He quickly brought my sandwich out.  I asked him for a new cup of hot coffee.  He quickly brought me a cup of hot coffee to enjoy with my hot sandwich.  I tipped him even when I was kept waiting for longer than usual for my sandwich.  He deserves the tip for taking care of the customer/me.", "author": "Gina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-18", "description": "The location is fantastic. The workers were friendly and I had a pleasant view of the square itself. There are two locations, one on either side of the square, and they serve different foods. The location near Powell street sells more larger items, packaged foods, and easier to make coffee drinks. The main location, near Post street, sells Sandwiches, pastries, Gelatto, and many types of pastries. The building was clean and the service was fast. I'd say if you were going to go for a small lunch while shopping in the city, this is the place to go.", "author": "Alexander S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-16", "description": "The downside: Everything looks better than it actually tastes. Well, I guess a wilted salad doesn't really look good in the first place. Stick to beverages.\n\nThe upside: It's almost impossible to not start talking to a stranger. If it's mingling you're seeking, or at least people watching, this is a great spot. \n\nThe secret you need to know: VENETIAN HOT CHOCOLATE. So rich, so decadent, so totally making me gain those unwanted holiday pounds. \n\nI almost always stop by to grab a cappuccino and take a shopping break, hoping some impeccably dressed attractive man will try to chat me up.", "author": "Kelsey E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-19", "description": "Let's face it, this cafe is a no brainer if you're looking for eye candy. Unfortunately, aforementioned eye candy is typically A) with their Euro counterpart or B) so busy figuring out how to order they don't even so much as glance your way. Still, eye candy plays a valuable role in a single girl's life, so props to Emporio Rulli for holding it down.\n\nObviously, I want to like this cafe not only because of their attractive patrons, but because it really does have all of the ingredients for success. It has outdoor seating for people-watching, a wine menu, espresso machines and panini makers. Today, my cappuccino was good, but my salmon panini was so bad I was tempted to throw it away. \n\nMy recommendation? Order a glass of wine or a cappuccino, bring your own food, dine al fresco and enjoy the view.", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-25", "description": "nice place to stop and have some fine Italian wine and enjoy a sunny day in Union square. Alena was a sweetheart and they were helpful with selections", "author": "Bill W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-20", "description": "During the holiday season, I always take groups of children from local shelters I volunteer at to see the Christmas Tree all lit up in Union Square. A few years ago, it became a tradition to take these adorable little tykes into Emporio Rulli for hot chocolate and cookies (hey, I don't have to put them to bed). The staff at ER  are always so incredibly gracious and kind to my sometimes snotty-nosed, sometimes socially awkward, but always loving and always adorable noisy band of merrymakers. \n\nWe've been treated with such kindnesses as free cookies, refills on hot cocoa, and replacement cocoas and cookies when originals managed to slip through mittened hands. I know if the children I volunteer with were old enough to understand, they'd be incredibly grateful to the great people at ER. Because Christmas trees are soooo much better with hot chocolate and cookies. \n\n**The location can't be beat and the coffee is pretty great. Prices are a little high, but you pay a premium in Union Square anywhere you go. Indoor space is limited but the outdoor seating is the draw anyway. And as a pIus, there are the million and one pigeons outside for the children to feed, coo at, and chase about.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-05", "description": "I base this review on walking past this place 2 days in a row, stopping in one day to ask what the deal-io is here, and then finally the next day eating here.  The lure of sitting by the ice skating rink at Xmas time was too much to bear.  Had to.\n\n+1 Star - Location location location.  Near the shopping (I can see Neiman Marcus, Louis V and Levi's all from my seat), near my hotel (and lots of hotels), near the ice rink.  Nuff said.\n+ 1 Star - Outiside tables.  Glorious weather, especially in a place than can have other than that, makes one want to sit outside. Nothing more luxe feeling than having a meal outside in December when you know 1/2 the country is in snow.\n- 1 Star - Food.  It's just not good.  It's not inedible, but it is sort of like good cafeteria food.  We had the lasagna (microwaved to heat up), a fruit salad (not bad at all, very fresh tasting, lots of different fruits), a ham&cheeze pannini (super unimpresssive) and cup of soup (minestrone that tasted from the can even if it were not.  That, and two bottles of water.\n- 1 Star - Potty.  What? No potty?  Oh my.\n+ 1 Star / - 1 Star - Help.  Nice counter folks, but a bit chaotic.\n+1 Star - Vibe.  Reminds me of Europe.  Including the chaotic vibe.\n- 1 Star - Price.  See above food.  Tab: 30-ish bucks (plus tip).  Seems a little steep for what you get.\n+ 1 Star - Singing Homeless dude.  Some might be freaked out by it, but I liked the older gentleman who came around the tables and sang to people. He sang \"You are so beautiful\" at me, so I really liked it.  Be sure to tip!\n\nAll in all, though this place rather sucked on the edible front, it rather rocked on the three S's: Sights, Service and super convenient to where I am Staying so I am sure I will be here again.", "author": "Julia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-15", "description": "I don't know if the fact that we sat outside and the weather happened to be perfect made me like this place even more, but I'm definitely a fan! I ordered the pear salad with grilled chicken and it was absolutely delicious. The restaurant was on a raised platform in the middle of Union Square so it was nice to be able to look all around me at all the beautiful buildings and shops. With Emporio Rulli being right in the center of everything, there was plenty of things to watch to keep myself entertained through lunch. The salad was so fresh and flavorful- I especially loved the tender chicken I had added to the salad. The waiter was attentive and friendly. He told us how delicious there coffee was but unfortunately we had just been to Starbucks so were not craving anymore. Next time I visit I will definitely have to grab a coffee and scone. Loved the atmosphere, great food also!!", "author": "Caroline F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-16", "description": "Update 3/5/2007:  \n\nI have finally found a time that I could actually patronize Emporio Rulli.  At 9:00 am on Monday, when the air was warm and clear and calm, I dropped in after a dentist's appointment.  A latte and a croissant cost me about $5.50.  The latte was just right, and was served in a ceramic cup.  The croissant, at first, appeared to be an ordinary American bakery croissant, but upon tasting it I found a hint of orange in the flavor.  The Italian music, while seemingly a bit obnoxious when heard on the Square, actually felt appropriate inside the cafe.  Today tables lined the cafe windows, so there was plenty of seating both inside and outside.  \n\nI had a pleasant time relaxing before I went onward to my business day.  It was actually fun to watch the line grow, from a detached point of view.  If you want to read the frustration of  navigating the large line, read on.  \n\n---------------\nOriginal review:  \n\nI have dropped by three times, now.  Twice at lunch, when the air was warm and the sky sunny, and once tonight, when the air was cold and dark.  All three times there was a long line and slow service, and tonight I noticed there were only two tables inside.  I've never stood in line long enough to order.  I give up.", "author": "David D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-10", "description": "Location: 5 stars, primo for the times there are SF Jazz concerts.\n\nService: Minus 4 stars, there are more ratpigeons walking round the tables than ER staffers...\n\nQuality of espresso: Mezzomezzo\n\nQuality of pastry: looks like weekold leftovers brought via BART from the SF International Airport.\n\nSo I got the espresso at the counter and preceeded to attempt to find a seat at a table. Can I share this table with you? \nBBW: \"NO, I am waiting for my friends!!!!!!!!\"...\nMe: thinking...\"Damn witch, you don't even order anything and you holding 6 chairs here by yoself? You mus be waitin for yo hommies to be bringin da burrodown to get yo chaluppa on\"\n\nFind another table to share with someone else. The tables haven't been bused, so just clear the dirties and enjoy the sun...all 30 minutes of free Vitamin Ds worth.\n\nLaCosanostraBambinos do not see repeat business.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-27", "description": "This place has it easy.. OK make your items a little pricey .. keep the place reasonably pleasant.. OK.. the pigeons are a problem.. just make sure to clean up after them.. make sure they don't flock on the patio tables.. but *who* is gonna say that having this pleasant place to sit and sip your beer, wine, or coffee on Union Square is a *bad* thing? We seem to end up sitting here for a half-hour or 45 minutes or so every time we're in the downtown section of SF..\n\nAs our real estate agent friends like to say.. location, location, location..", "author": "Weide Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-03", "description": "A friend and I ventured into Union Square for a quick lunch. Working in downtown San Francisco, I'm used to $8+ sandwiches, so this place didn't phase me. I ordered the Milanese panini which is prosciutto crudo (cured ham) asiago cheese, fresh spring mixed greens and olive oil on a house-made focaccia. The sandwich itself was really good, the whole bite I got. It was the smallest sandwich I've ever seen (that wasn't a finger sandwich on some sampler platter). I was done a few bites and I was starving. Safe to say, I'm never going back to a place where I spend $10 for lunch and am left hungry.", "author": "Analisa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-02", "description": "Price for coffee wasn't too expensive, it was average - and on a nice day in SF, walking around Union Square with a cup of coffee makes me happy that I live here.  The coffee wasn't great, it was a little weak, but thankfully it was fresh.\n\nBut the iced tea, oh the iced tea!!!\n\nMy friend had one, and it smelled so phenomenal, I couldn't resist taking a sip.  Mind you, I'm a tea snob - I love my tea.  And their tea smelled so good!\n\nThe iced tea was as good as it smelled, and the generous slices of lemons they put in provided the right tang. \n\nTheir pastries looked pretty good - can't wait to give it another try next time.\n\nBest thing to do is probably just grab a coffee and a pastry and then soak up the nice, warm sunlight in Union Square.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-13", "description": "Ah, I found out what it's called... I just called it that cafe on Union Square! \nI was here once on a coffee date :) We sat outside, it was a sunny afternoon. It's obviously a popular spot for everybody because of the prime location. There were children about too. My date went inside to get our drinks and brought it out. I don't recall there were seatings inside. I had a hazelnut latte which was very creamy and smooth, nice. I wish they give you a glass of water like the Cafe in Paris do. I wish they have a toilette. I asked but I were told I had to go down to the parking lot.... we ended up stopping by Macy's for this! \n\nI will be back.", "author": "Bella A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-09-11", "description": "Totally irritating. What self-respecting cafe refuses to serve a cappuccino breve (made with half and half)?! The woman working there said that yes, even though they have half and half, as evidenced by the quart of it sitting on the counter, they could not make me a cappuccino with it b/c they only make them in the traditional Italian way--with nonfat or regular milk. I *almost* started in on a diatribe about how I lived in Milan for a freakin year and didn't come across nonfat milk at all, and that what they used there most often was the scary, unrefrigerated milk that tasted slightly like baby formula. I didn't see them serving the unpasteurized stuff at Emporio Rulli, so they can bite me about their commitment to authenticity. \r\n\r\nAnd a third-party gripe. My friend ordered the almond croissant that didn't even look right--yellowish and small. She was starving so she ate it, but said besides the almond sliver on the top of the thing, the contents had never even rubbed shoulders with almond paste or the like. And it was $3, by the way. \r\n\r\nI'd always walked past this touristy-looking cafe, wondered if it was any good, and decided to wait til I could find a Peet's to get my coffee fix. Now I remember what my momma always tells me, \"trust your instincts\"!!", "author": "Gretchen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-23", "description": "Glorious start to a Saturday morning. Enjoy a cup of coffee and breakfast panini and watch the city awaken as Union Square becomes alive with whatever local event is happening.", "author": "Marti H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-09", "description": "I stopped by Emporio Rulli for the first time the other day and I was disappointed.  I had high hopes because of its location and its wares (well, it's actually food and drinks, but you get the point).  I have to agree with most of the people who have complained about their service, or lack thereof.  \n\nI walked in, wanting a hot drink, and noticed that the line was long.  I attributed it to the fact that it was the tail end of lunch and they were finishing up with the lunch rush, but no...  That wasn't it.  When I finally made it to the register, I realized why the line was so long.  Service was impeccably slow, slow as molasses because it was so difficult to communicate with the cashier.  When it was my turn to order I politely said, \"May I please have the Chocolate Del Doge and the chocolate cake with a raspberry on top?\"  This started the round of \"What drink? Hot chocolate?  What kind?\"  I ordered what was being advertised on their counter.  Apparently, it's called Venetian hot cocoa, but that's not what the sign said!  She didn't get the cake right either.  \n\nI kept my cool, paid for my drink and cake, walked out and thought \"I'm not sure I want to come back here unless this stuff is really good.\"\n\nLet me tell you about the \"Venetian Chocolate.\"  It was super rich and sweet.  It was so syrupy that they had to serve it in a small cup.  They filled the cup (6 oz) half way with the hot chocolate then doused it with fresh whipped cream.  There was nothing spectacular about the drink.  It took me a while to get to the hot chocolate and it was hard not to get any whipped cream on my nose because the chocolate was super thick.  I've had European hot chocolate before and I know what to expect.  This wasn't it.\n\nThe cake was layered with chocolate mousse, regular cake, and fresh raspberries.  The mousse was delicious, but the cake itself was too dry.  The slice wasn't work the $4.50.\n\nThe place isn't the worst cafe I've visited, but I'll only stop by if someone else asks me to meet them there, or someone wants to check it out.  I don't have the urge to give them another try.  If I change my mind after another visit, I'll let you know.", "author": "Annalynn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-21", "description": "The place is at an incredible location; they are the one and only cafe on Union Square... and this is probably the reason why they still have any business. If they had the smallest competition they would be so closed!\n\nThe waiters that ignore you, the papers on the floor, and the dirty tables are not inviting, whatsoever. What particularly amazes me is the \"Hyper-specialization\": if you happen to order, as we did, a salad, a tea, and a pastry; they may come to you at three different times because apparently one person takes care of the food, another one brews the teas and who knows who's in charge at the \"pastry department\" (one of us had to go inside to eventually get it!) \n\nThe long lines inside are just a turn off, and the staff is too rude to be true. Surprisingly, and for the first time, yesterday I saw a waiter taking someone's order (yes, he physically went to the table, menus on his hand, and in a few minutes took note of the requested food and drinks) and I wondered: Are they paying more that I am? Are they really that much cuter? Is their accent funnier than mine?\n\nYes, sitting outside, having a nice coffee while reading the paper and/or watching people go by is certainly very pleasant; but the dirtiness, the rudeness, the messiness, and the insufficient and inept waiting staff simply makes the whole enchantment vanish. Too bad.", "author": "Rosa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-30", "description": "When the sun is still out it's so nice to snag an outside table and enjoy a nice glass of pinot grigio.. they let you take your time here and don't try to hurry you out.\n\nGreat spot for a simple merienda...", "author": "Nenette Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-03", "description": "Over all this place deserve a 5 stars. This location is perfect for people watching, nice little outdoor table to sit and relax in the sun. Very European feel to it. Since i can't really drink coffee, i order Gelati with two different flavors. I had hazelnut and coffee, funny that i can't drink it but i can eat it. It was great! I will try something else next time when i stop by for a visit.", "author": "Kayla D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-30", "description": "The chocolate brioche pastry is a let-down (See my photo)", "author": "Scott F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-16", "description": "It's all about location, and this place has it.  Good variety for the food, excellent drinks, and being able to sit outside on a warm day in Union Square with a fine glass of wine or an Anchorsteam - well, it's just great!\n\nGood for meeting people and friends, but there's not much value and a few too many vulturous pigeons here.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-04", "description": "My friend bought a bag of their coffee to bring home, it was that good. Nice spot in the middle of Union Square, too.", "author": "Celinda A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-24", "description": "Came here on a Saturday morning for breakfast... The weather was perfect... The food yummy and the coffee amazing!! \n\nI had the turkey breast on foccacia with fontina cheese, spring greens and roasted red peppers. The bread was grilled and was super soft! The sandwich was simply delicious.\n\nThe coffee was some of the best that I've ever tasted. \n\nThe service is pretty bad, but that's didn't change the fact that the food and coffee were tasty!", "author": "Jen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-09", "description": "On a lazy sunny day, and living in the neighborhood, we often will swing by here and have a panini and a bottle of wine. The food is decent, not great, but worth it. \nJust sitting and enjoying the hustle and bustle of downtown life, the tourists, the worker-bees and the shoppers while we sip our wine and watch the world go by. It makes me realize why I love living here, and what a great city it is.", "author": "Jason D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-20", "description": "The hot earl grey tea was good and it's a nice place to people watch but the young kid on the register gave me change for a $5 when I gave him s $20. He wouldn't even respond when I told him this, just looked away and went to the next customer, completely ignoring me. It's a shame as the teas and pastries are good and it's a nice place to hang out otherwise - just give them a credit card not cash!", "author": "Jacqueline B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-08", "description": "\"I am sitting at an outside table of Emporio Rulli. The rays of last sun are hitting the buildings. I smile to my plate of strawberries and blueberries, then take a sip from the frothy, hillariously expensive latte.  Life is beautiful. Through the speakers, an Italian tenor fills the air of the square. People are hovering over their tables, quiet conversation and relaxed poses ensure the elusion of a dreamy reality. The rush of the city is hushed here, magically guarded by the perimeter of the sidewalk. \n\nI put my coat on and walk across the plaza.  \"-Excuse me!\"  - I hear a voice.  I turn around and see a short dark-haired man with a friendly face. He looks very generic; he could be an office worker, a construction worker, or an telecommuting engineer.  \"Hi!'  He takes a step back, looking for courage, then with a gulp of air, steps towards me, flustered.  \"I just wanted to say..  I saw you sitting at the cafe.. \" -he looks down.  \"And, um, well, you are the very beautiful!\"  I smile to myself.  I've heard this before.  Ah, yes, last time was in New York, Guggenheim Museum, lobby.  A tall blond, intense blue eyes. \n\n\"Thank you\", I say politely.  The man, encouraged, picks up the conversation:  \"Are you a tourist?\"  \"Yes\"-I lie. An eternal tourist, wondering through life. \"Where are you from?\"  \"Austria\"- I lie.  At least I wish I was. And then, an involuntary jolt of ecstasy runs through my heart and I almost say it outloud:  \"And I'm meeting the man of my dreams in 5 minutes!\" ...\n\nFor a moment, I'm in my thoughts, and then I am brought to reality by the friendly man.  \"Well, welcome to America!\" - he says with delight, speading his hands as if to give me all there is about his country. \"", "author": "Anya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-25", "description": "walked over here to get some espresso and pastries two days in a row...\nit was right up the street from the hotel we were staying at- just two blocks away and right in the union square. \ntheir espresso was smooth and rich and the almond brioche was nice and fluffy light. \nwe sat outside in the square..... the views of the old St. Francis are a very lovely - along with the people sitting outside with their dogs.\nthere was a little bird that also came back to visit us 2 days in a row...\nwe called him stubby. he had a gimp foot and one tail feather...he was a brave little sparrow and would fly up to our hand to take the bits.", "author": "Noe'lle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-30", "description": "A staple Italian 'bar'. Great cappuccino and pastries", "author": "B R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-03", "description": "As a visitor here, it's hard not to be impressed with this place's location. I know it's right on Union Square and that probably makes it expensive, but I didn't care. I loved that I could walk 2 seconds out the door and enjoy my coffee in the sunshine and take in the people-watching. OK OK, I was partially in bliss because I was staying in the gorgeous St. Francis and it was no effort to get here, but still. Such a cute joint. \n\nNow, coming here to grab a drink is a different story. What's going on, do I sit outside, can I hold a table, is there table service, where does this line begin/end...chaos. We ended up leaving after waiting for 5 minutes because it was so all over the place. \n\nStill great for a coffee as a tourist though.", "author": "Purvi R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-12", "description": "Great for people watching on the square and even better for their lattes.\n\nI haven't tried any pastries, sandwiches, or any food for the matter - just lattes and americano's.  Emporio Rulli's is a bit pricey but I'd say it's probably worth it compared to Starbuck's.  \n\nThe latte's consistently come out delicious and always with foam on top.  The way a latte should be!", "author": "anita h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-13", "description": "There is really no place for people watching like Union Square; Emporio Rulli provides the perfect vantage to sit and observe the traffic passing by.\nThe coffee was good, quite good in fact, and the barristas were friendly. My cappuccino had just the right amount of froth, and the right flavor. Sure it wasn't cheap in relation to the quantity, but the best things in life never are. The scone also stood out. Not too sweet, or cake-like, it struck the perfect balance between biscuit and cookie. Much better than the junk they call scones at $tarbucks. I'll go back any time", "author": "Dana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-13", "description": "2007-12-27\n\nMaybe I've had better espresso since Rulli, or maybe their espresso wasn't as good as I remembered.  At any rate, it was a bit too diluted and tasted burnt bitter.  In other words, it tasted like any other espresso from any given espresso-serving coffee shop.  Oh well...\n\n****\nDelicious espresso!  Double for here, please!  Try the Milanese for a light lunch, and look through their dessert selections before falling in line.  It can get really busy here, but I do take in consideration where it is, so I avoid stopping by on weekends.  Hell, I avoid Union Square on weekends and during the Holidays, or at least I try to, but it's hard to pass by the square without having myself a shot or two.", "author": "Erick .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-11", "description": "This place is one of the reasons I really love San Francisco.  \n\nThe best cappuccino in union square, awesome pastry/wine selection and the best people watching on a rare sunny day.  \n\nI have to disagree with the people knocking the service.  I come here 3 times a week (at least) and the service is impeccable.  Servers (though sometimes few in number) are always helpful, often aid with the necessary swatting of aggressive pigeons, and don't mind if you loiter with your latte for an hour or two - no matter how busy the place is.  They also always put up with my constant switching of tables to score a better view...", "author": "D S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-15", "description": "I like many Rulli locations, but definitely not this one!\n\nThe only thing I really like about this Union Square cafe is the chance to sit outside on a warm day and people watch.\n\nI tried to do that today, and I realized, it just doesn't cut it when you throw away $7 for a tiny orange juice and a pastry that's too dry.\n\nInside the cafe, I always find that the floor and tables are dirty.\n\nI'm pretty easy to please, but this overpriced Rulli should at least be a bit nicer inside and deliver in terms of quality.", "author": "Sophie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-12", "description": "I went to Emporio Rulli for dinner with my friend. The salad I got cost $9.71 and it didn't taste fresh. It tasted as if they put stall walnuts and canned pears on some lettuce and made me pay $10...I think that is a RIP OFF!!!\n\n I was expecting an amazing salad for that price (I am a college student, so that is a lot of money). \n\nPositive: The location is very nice because you get to sit on a patio and look out to see all of Union Square. If you go at night, it is very pretty if the weather has not much fog. \n\nIf I were to go back here, I would get a hot cocoa and people watch because it is a GREAT location but my dinner was not good at all..... \nBut my friend got a sandwitch and enjoyed it very much. They also have a full bar which if I was 21 that might be cool! lol", "author": "LB D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-18", "description": "Consistently disappointing.  I keep going back because I work near Union Square and on the rare warm sunny days, it is hard to resist the outdoor seating in the square.  But the food is really ordinary.  Caesar salad is soppy wet, cheese plate is sparse, and panini sandwiches are dry and tasteless.  They cater mainly to the tourist set, so seems like they feel like their business model is all about curb appeal and not food quality.  For a better outdoor meal in the area, go down Maiden Lane accross the street (Stockton) and enjoy the offerings at Mocca, which is 50% more expensive than Emporio Rulli, but 200% better!", "author": "David K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-31", "description": "So I have been here a few times now, mainly for brunch and most recently for dinner.  While the food was delicous, I mean the freshest bread that I have ever been served.  The salad was so simple, and fresh and then my entree had artistic quality to it...But the service annoyed me.  Neither of us were exactly starving and it was fairly late so I wasn't up for a big meal, but our server insisted that it would be 13 minutes for the one dish to be prepared so we should order a starter.  It actually took double the time for the meals to come out.  Then the server needed to be reminded to bring another glass of wine...I don't know.  He just got under my skin for some reason....besides the ones I listed.\n\nAlso, the decor is very romantic with some of the most beautiful hand painted murals..I have tasted some of the bakery items, and I think they are very tasty.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-10", "description": "Perfect coffee and hangout place in Union square. The cappuccino was  the best compared to all of the places I have previously had it in the US. Great joint.", "author": "Gopi V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-31", "description": "Pretty standard coffee joint if you ask me. 3-star for the most part, except they've got a slightly more extensive menu and a great location - right in Union Square Park!", "author": "Brad Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-19", "description": "Some locations are just too conspicuous to be able to have high expectations at, and a cafe *inside* Union Square is certainly one of those (the fact that it was imported from the Marina didn't get my hopes up either).  So it was no surprise that the lattes, paninis and tiramisu don't scream out for love like those at, say, Mario's.  But if you're coming for people-watching, particularly on a brisk (actually we had to settle for balmy) December day when the tree and ice rink are up and the shoppers rush by with their [anti-consumerism rant redacted] treasures, you just might enjoy lunch at one of the patio tables here, and you can even get (polite, if harried) table service.  So bonus star for being an example to other tourist-swarmed eateries on how to mitigate the inevitable mediocrity.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-26", "description": "Absolutely fantastic coffee and desserts. Great location to hang out and relax after or before shopping.", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-14", "description": "Nice little spot to stop by for some coffee and a snack. Very european style cafe - pastries, sandwiches, salads, soup and even wine.  Went here on Valentine's Day after a nice walk downtown.  Two soy lattes and a cinnamon twist came out to about $12.50.  Definitely not Starbucks prices.  It was raining off and on, but we sat outside under an umbrella.  Nothing like some hot drinks in the cold weather. Romantic almost. Sort of like being at a cafe in Paris or Italy. Not that I would know, but I watch the Travel Channel and Food Network enough to imagine. \n\nThe girl who took our order was kind of weird though. I nicknamed her \"crazy eyes\" because she stared at my partner with her eyes all wide after he placed his order. I was like.. girl why you looking at him all crazy?\"  The barista made a great soy latte complete with a cute little heart design in the foam. \n\nUnfortunately, the canella (cinnamon twist) was dry and bordering stale. It looked scrumptious behind the glass. I think it was the lighting.", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-19", "description": "The espresso is good and the pastries are grand. Honestly, I didn't expect good coffee coming from such a tourist trap area. So I come here when I can and grab a cup of coffee and a pastry (either a plain brioche, an apple turnover, or anything that takes my fancy) and sit outside and tourist watch. \n\nIf I can, I'll sit in one of the small tables provided by Emporio Rulli, but I warn you NOT to feed any bird. Don't feed the cute little birdies or the pretty exotic feathered friends. But most of all, DO NOT, I repeat DO NOT FEED THE PIGEONS!! I've seen this done by many a tourist and when bird word goes around that someone's giving out food, then all creatures born with feathers (most are from the leather vested, chain tot'n pigeon gangs) descend on the hapless tourist(s). What is one to do? but to say, \"Poor schmuck\" and turn away . . .\n\nAs for the cafe's service, it's okay. I have to remember that these servers deal with tourist all day long and it's the tourist that take up most of the time. How can you wait in a long line and NOT know what the fuck you what?? Jeez.", "author": "Audrey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-25", "description": "It was a beautiful Sunday morning at Union Square.\nWe got an outdoor table, and I got this pretty Spinach Panini, yet our drink didn't arrive with food.\n\nThe waiter who dropped off my food and picked up the number plate said that we were supposed to pick up our drinks inside, so we went inside.\n\n\"What is your number?\"\n'Number? I don't know.'\n\"What's your name? Are you Pam?\"\n'No I am not Pam.'\n\"Oh I made your latte like 10 minutes ago. I will make one now for you. \"\n'Okidoki.'\n\n...and when we returned to the table with drinks...\nPigeons having a feast on our table!!\n\nMy breakfast was theirs.\nIt was a very scary scene.\n\nI gave up, took a picture of the birds and sat down at two table down. \n\nAt least I had latte that birds never have tasted in their life.\n\nHowever, a manager-like man in black bow tie, vest and pants at the cafe came to say \"We'll bring you another. But don't leave the table this time. Okay?\" \n\nYes, they gave me new one quickly, and it was fluff, warm and delicious. \n\nI wondered if the birds had tasted and knew that was so good. Anyway I was feeling much better, rather heavenly under the sun with warm food and funny incident.\n\nSure this place is touristic, and does a good job in that way.", "author": "Chacha M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-12-27", "description": "THE PLACE:\nit's a smallish coffee shop, it's pretty anonymous feeling. Usually you'll sit outside because there are a lot more seats out there.\n\nTHE FOOD:\nI've never had coffee here but their pastries aren't that good. \n\nTheir location is pretty hard to beat if you're in union square though.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-10", "description": "The perfect respite when you need it. Emporio Rulli may not be perfect, but when you've been shopping too long and you desperately need a pick-me-up, it's perfect. \n\nA latte, a mocha and a panini-pressed verde foccacia gave us the boost we needed to attack the Macy's dress department (and ran just over $10). All were well-prepared and easy enough to pick up from the counter. I can see how it could be complicated to pick up drinks, then food, but we'd nabbed a table inside and it was hassle-free. \n\nMostly, it's times like this---having a good cup of coffee with a cute boy and watching the tourists go by---that remind me why I love San Francisco. I always get nostalgic when I see tourists; the fact that so many people travel so far to see this place makes me feel special to live here.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-10", "description": "I love outdoor seating. I love coffee. I love interesting architecture. Mini Rulli totally checks off the list. If they weren't so slow and disorganized behind the counter, I'd give them five stars. The fact that it took three people to ring up, pour and serve me a small black coffee is a little inefficient. \n\nHang ups aside, this is an awesome spot to grab a soda or coffee and sit and watch the world go by. Just watch out for the pigeons.", "author": "Zac H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-20", "description": "I want to love this place: it's right on Union Square, outside seating in the warm sun w/a cool breeze, people watching, fresh food from Marin, physically appealing pastries... but.... honestly Rulli, can we just be friends?\n\nIt's priced ok, i supposed, 6.95 for panini... but even though the portions are good, they just don't look appealing! In the Bay Area, we are spoiled... not only with good quality food, but with great presentation even in average cafes. So when the only cafe on the square gives bland looking sandwiches (I know it's panini, but it doesn't look like it!), the meal is already disappointing. \nAND the freakin crazy birds have NO SHAME... they will land on your table w/their huge pointy beaks and poke at your food!!!! \n\nSo even tho my and my friend's paninis were edible and the chocolate/cream/berry cake we got wasn't too bad.... i won't be going back here... or maybe i'll give it another shot w/a big mug of cappuccino", "author": "Sofia J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-18", "description": "Great place to enjoy an afternoon coffee and watch the world go by.", "author": "Andy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-08", "description": "You are going to want to biotch-slap the people who get to the front of the line and then start asking technical questions about the pastries.  Ma'am, if you don't recognize that's an apricot, you are not going to like it. Get a croissant and a clue.  I love the location, love the coffee, love the drinks and wine, but they need to rethink the service process.  They also need to be more aggressive about shooing away the big clots of stupid high school kids ganging up on the tables without eating or drinking anything from the cafe.  Take the makeout party somewhere else, kids.\n\nOh, one last thing.  BUS those freaking tables!", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-03", "description": "Their cafe au lait is the best i've had so far =] it's nice and creamy.. and maybe because i put the right amount of sugar into the cup this time =P\n\nWell the times i've been there before.. they're kinda slow.. as in processing what i want.. and another time they didn't give me the right change.. but i don't blame them i do that sometimes when i'm overworked =/ \n\nFruit salad's not worth the 5 bucks but i guess anywhere that serves fruit salad around union square would be that price.. the fruit salad here didn't look fresh although the grapes were VERY sweet =] the watermelon looked icky maybe it was the season. \n\nIced Tea.. it was good =] i think the palace hotel uses the same tea (don't quote me).. it has that distinct scent.. couldn't place my finger on it \n\nWell if you want an outdoor cafe you get the entire package.. pigeons and people included.. i wish the pigeons would just leave us alone and make us less paranoid about being the 1 in a million to get bird crap on their head\n\nTheir pastries look like something you'd find in a high school ceramic class.. the flaky pastries are all glazed", "author": "Connie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-12", "description": "Good quality espresso, although I've had better in non-Italian joints in this city... which is both sad and shameful. That's not to say Rulli's is bad. It's not. It's just that Ritual Roasters and Blue Bottle do it better somehow.\n\nGood toasted panini. Not spectacular, but they make for a satisfying lunch.\n\nThey occasionally have budini di riso (Italian rice custard pastries). That immediately puts them in the favorable column. Other desserts have been so-so.\n\nThe service is pretty crappy. I guess that's what happens when you pump tourists through a place all day long.", "author": "Angelo B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "I love this cafe because of its location and their coffee has enough \"umph\" in it to get me through shopping downtown. I love getting the iced caffe latte. It is the perfect blend of coffee and milk over ice. No sugar for me thanks! \n\nAlso, got their chocolate brioche which was flaky and not too sweet. The dusting of dark cocoa powder on top is a bit deceiving. At first I thought, oh crap, its burned! Hahahah!\n\nLove the ambiance of this quasi-European bistro in Union Square.", "author": "Maritel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-22", "description": "I only had a hot chocolate but it was soooo good! The environment is adorable and has such a foreign and unique feel to it, not to mention it's location is perfect. The baristas were a little snobby but still a cute place.", "author": "madina a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-16", "description": "I have a love hate relationship with Rulli.  I love it's location and it's my favorite cup of coffee in the city.   I love that you can go order a bottle of wine and sit outside and people watch.  I love the music they play, the ambiance is very romantic.  (Though watch out for the pigeons!) \n\nHowever I agree entirely with Shane A's review on the service.  I am not sure if the staff are rude or if they just don't have the mental skills to ring up a cup of coffee in less than 10 minutes and in the 4 years I have been coming here I think if it's possible, the service has gotten even slower!", "author": "Jenny R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-19", "description": "Yum.  Visited the Larkspur store and Union Square. I recently organized a skating show \"A Celebration of Bay Area Skating\" to celebrate the successes of the competitive skaters this season. Lauren and Randy from Rulli were kind enough to donate hot cocoa and awesome good cookies. It was a cold night and thanks to Rulli the skaters were warm and cozy and well fed. Thank you Rulli!!!", "author": "Susan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-28", "description": "I didn't order anything here, but my friend did and we relaxed outside in the Square under an umbrella table.  The people at the table next to us left, and all of a sudden, swarms of pigeons flew from all directions to scavenge the leftovers (see photo).  It was pretty disgusting and frightening.  But my friend enjoyed his pastry and milk.", "author": "Nunya N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-15", "description": "If it wasn't for the fact that this caf is located in one of the best locations in San Francisco I probably would never go there. It is a great place to people watch and they have a lot of outdoor seating;  which is sometimes hard to find. However, I do have to agree with some of the other Yelpers that the service is lacking and you typically have to fight for an outside table. \nI as many other people are lactose intolerant and must half soy milk with my coffee. When I asked if I could have soy mocha, I was told that \"they were an Italian coffee shop and therefore did not carry soy milk.\" Excuse me! I primarily go to Italian coffee shops and have never been denied my Soy milk before. Needless to say I walked up the street to Caf Espresso (an Italian coffee shop that serves Illy coffee) and had no trouble ordering my soy mocha", "author": "Angela P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-26", "description": "So much to love about this cafe but so much to be disappointed in too.\n\nThe espresso is terrific, IF made well...If they could only combine the techniques of Blue Bottle with the roast they use here they'd have an awesome espresso.\n\nPastries are reaaally the worst here which is unfortunate as their Larkspur location is much better...Perhaps it's the volume they do or that they simply allow for pastries to stack up and become quite old/stale but the quality is substandard...Amazed whenever I see people continue to purchase pastries there...Just goes to show you, people will eat just about anything.\n\nThe location is great and perfect when it's a sunny day in SF.\n\nUnfortunately, lines do accumulate here as it's a popular tourist spot but if I'm in the area, I won't go anywhere else for a macchiato", "author": "Barca F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-22", "description": "I love this little spot. It's perfect for sunny day shopping in Union Square. The outdoor tables are packed, but if you are patient and take the time to look, you'll definitely be able to find a spot. We decided an afternoon brew on one of the only sunny days we've had in awhile sounded amazing. I was assigned table duty and found a great spot right outside the front doors. He got us two beers and a delicious ham and brie sandwich, omg yes please. The brie was perfectly creamy, and the whole sandwich had amazing flavor. Of course we decided to order a second beer, because that weather was much to nice to pass up! The only downfall was that their bathroom was across the way and down the stairs in their garage, so if you know you will need to go you should plan in advance. All of their other food looked really good- like their salads and olive plates, and of course their pastries. Their pitcher of sangria also looked like a great idea, which I will definitely be back for with friends on my next sunny day shopping trip!", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-31", "description": "The sandwich I had contained a thin layer of really crappy, overly fatty procuittio that I wouldn't even feed to my cat, some parmesan of questionable quality, and wilted greens. Who the hell puts greens in a sandwich that gets grilled? Who wants nasty soggy greens? Oh, and the bread -- their \"house-baked focaccia\" -- is garbage, too thin and doughy, flavorless.\n\nThe only upside was the bottle of bubbly water (which was NOT twist off, and was not opened for me; I had to go back to the counter and ask two different employees). The water washed the taste out of my mouth and helped erase that poor excuse of a lunch from my palette.\n\nToo bad. The location is great.", "author": "Max S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-06", "description": "I concur with other reviewers; good food and coffee (though my pastry was hideously stale today).\n\nBut that is no conciliation for ugly, throw-away cups; unbussed tables everywhere; a line that would disappear with a coffee cart out front (why should I have to explain this to people?); in general, a place that takes advantage of its perfect location.  \n\nThey don't have to try harder, so they don't.\n\nVoila.", "author": "Antoine de S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-13", "description": "If I was only to write about the service, I would give this place a -5. The staff could care less about any of their guests. And to top it all off, it took almost 30 minutes to get a prosciutto and brie sandwich. I should have just accepted my loss and walked out. I say lose the attitude, it doesn't make you look pretty. Even the Europeans in the place were appalled by their display of superiority. \n\nHowever, the sandwich was tasty, but small. The pastries looked divine and I will go back (to be treated like crap) and try some of their deserts. Maybe they will have cannoli that day. Or maybe I'll just venture to North Beach if I want Italian deserts.", "author": "Shane A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-01", "description": "My fiance and I have been here 3 times since we discovered it last week.  Funny thing is that we live downtown SF and we always walk through union square but we never bothered to stop at this place.  Wish we would've stopped by here long time ago!  The weather has been beautiful lately so we've been soaking up the sun and dining outside.  We've had their iced coffee and mocha drinks, peroni on tap, several of their paninis, pastries, desserts, and salads.  They all have been quite good.  I think the weather and being outside on union square made everything taste even better.  It definitely is very touristy but i get a kick out of seeing people come to SF from around the world for vacation and I'm lucky enough to LIVE here!", "author": "Jojo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-25", "description": "oh, emporio rulli, what is to be done with you?  i want to give you five stars, but i just cannot.\n\nyour location is magnificent - few things in this city could possibly be more entertaining than sitting outside and scanning the strange examples of humanity that stride accross union square.\n\nyour drinks are delightful - well-prepared and consistently tasty.  as well as a fine cup of coffee, you even provide decent black tea.  a boon among so many bad cupfuls of tea and coffee to be had accross this city.\n\nyour pastries are stellar - the croissants are soft AND flaky without leaving your tongue coated in a layer of grease.  i highly recommend both the almond and chocolate ones.\n\nall these fine attributes.  so why, then, does your staff have to consist of a BUNCH OF FUCKING ASSHOLES.  it doesn't matter how polite i am (\"may i\" and \"please\" are always a part of my usually uncomplicated order of breakfast tea in a small cup to go).  it doesn't matter that i tip at least a dollar EVERY SINGLE TIME i purchase above-mentioned cup of tea.  this is the only place i have ever visited where i have actually had my change SHOVED into my hand with a sneer.  after i smiled and said \"may i\" and \"please\" and patiently waited as the person behind the counter forgot to give me my substantial amount of change and then took over 90 seconds to pry open the drawer and procure it.\n\nit's actually to the point that i dread having to go in to order anything.  i feel fear.  i do not want to be abused (or do i?  see what this place does!).  but i want that tasty beverage, and i want to bask in the sun and watch bad outfits strut by on union square badly enough that i keep going back, despite the abuse, questionable haircuts, and line that i will find inside.  but maybe, if i'm just nice enough, finally one day, emporio rulli will tell me that it loves me.\n\nin other words, emporio rulli is like the stokholm syndrome, only with a killer view...", "author": "genevieve g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-17", "description": "I love the location of this cafe. It is the perfect place to sit outside with friends and people-watch over coffee and a brioche. The coffee and pastries here are also quite good.", "author": "Alexander S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-10", "description": "I love this place. It is ideal for meeting people who are not really familiar with San Francisco because anyone can find Union Square! They could do better with more tables and a more organized management of the patrons sitting at them but it works. The coffee is excellent and the pastries and snacks are pretty good, too. On a sunny day there is no better place to have a beer or a glass of wine and people watch. You'll feel transported to Europe without leaving the City!", "author": "Kevin E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-20", "description": "Fine cup of coffee.  Grab a cup and something sweet to cap an afternoon of downtown shopping...if there are no tables, get it to go and take a seat somewhere else on the square where you can gawk at gawking tourists who are giddy with the glamour of our downtown shops.", "author": "L W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-04", "description": "I have to agree with the folks who awarded the Emporio Rulli with five stars. Union Square is a thoroughly beautiful place and the coffeeshop which is Emporio complements it perfectly. The pastries are wonderful and I've never been disappointed by their brews. One time I ordered an iced coffee on a hot day, and the barrista kind of surprised me by saying, \"Here ya go, bella,\" in a really snide tone. It sounded like a sarcastic insult - that's how I could have taken it. But after I added some sugar, stirred it up, and began strolling the square (whilst sipping coffee) I realized that it was exactly what I had a taste for. Emporio Rulli could be pretentious, but it's not. It's just exemplary.", "author": "Evelyn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-11", "description": "Even if they didn't have Venecian hot chocolate (YUM!), the huz and I would give this place 5 stars for the people who work there. Tonight, the huz took out a roll of cash to leave a tip, and then put the roll down on the counter while he put the lid on the chocolate. You guessed it -- he left the roll on the counter. An hour later, I called to ask if they had found it not expecting that they had (huz was so sure he wouldn't even call). Yet, they'd found it and held it for us. We'll be going to this place long after hot chocolate weather is over -- just so we can leave big fat tips! THANK YOU!", "author": "Cydney B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-08", "description": "ew. \n\nmold on my pasta salad. \n\nand the french manager who i complained to was le-poo!\n\noh and ps, the woman, brigita, who took my order snickered at me because i didnt know how to pronounce \"glace\" as in cafe glace.", "author": "terra d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-19", "description": "Four stars for what it is -- counter service coffee and pastry bar. They do have sandwiches, but you're in Union Square and I think you could be more resourceful than to eat here. One thing, the coffee is outstanding. I drink dry cappuccinos and it is rare you can get one done properly. The people watching is great. All the folks complaining about service should maybe try a restaurant where that's provided.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-31", "description": "I always liked the tarts and coffee here. Additionally, I love the location (obviously). In general, its a nice place to refuel after a day of shopping or a nice place to get some caffeine inside in order to prepare for one.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-19", "description": "Great coffee, great people watching, and good pastries (as long as it's before noon). The service here can be slooooow if you're getting an espresso drink and you're lucky if they get your order correct BUT the location makes it almost okay. I hate those damned pigeons outside but that may just be a personal problem I have with flying rats.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-25", "description": "can't believe i've managed to NOT review emporio rulli...\r\n\r\non a warm san franciscan day, this place is just delightful.  yes, there are some pretentious patrons, yes, it getsextremely  crowded, but somehow it is all worth it to me when i have my brie sandwich in hand, and am sitting in the sun!\r\n\r\nwonderful and beautiful place for a bite!", "author": "Jill k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-04", "description": "I love the coffee at this place. Rulli is located right in Union Square and it has a great selection of Italian pastries.  They serve a great cappuccino. Head to this place before the stores open so you'll be able to enjoy Union Square without the crowds of people.  This is a favorite spot for me.", "author": "Veronica V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-17", "description": "Exceptional iced tea. Smooth and barely sweet like a Guinness in Cork. It's a small compensation to forgive the paving job they did to this once-lush (and slightly scary) park.", "author": "Brandon R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-10", "description": "I luuuuuv the grilled eggplant, mozzarella, red pepper sandwich (the \"favorito\").  Sitting at a table outside, watching people from all over the world while reviewing work in the sun over lunch and in between the endless droning hours of endless talking and questions and trying to pay attention and stay sharp on the same subject after same subject just mixed up and back again, is nice, more than nice, yep.  Love the little tiny pastries like mini creme puffs, mini tarts, little cute sugary creamy chocolatey pillows. Yum.", "author": "Today Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-27", "description": "J says: Granted the latte was pretty good, but $6.50 for a single latte and a teeny chocolate budino seems a bit much, especially when the budino tasted stale!!  Blech...", "author": "Jen Ken H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "What really makes this place so great is the setting!  The coffee is just ok, the sweets also nothing special, but getting a table outside, in Union Square on a sunny day, life changing!  It feels like a little piece of Europe in the center of this modern city.  I really cannot think of a more ideal way to spend my afternoon other than sitting outside, drinking coffee from a mug and smoking, it's wonderful!", "author": "Steven K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-20", "description": "v. v. crowded, + you often have to wait in long, long, long lines HOWEVER, it's worth the wait, try the\nchocolate-pear tart ( trust me on this one, i know it sounds blech but...)\npistachio cannoli ( little tiny flakes of pistachio, mmmmmm)\nfruit tarts ( tiny, cheerfully colored)", "author": "Holly Golighty M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-01", "description": "I knew I shouldn't have expected any more than I got at a place in the middle of Union Square.  Very mediocre panini's and rude service.  Few things annoy me more than when you order something off the menu and the counterperson looks at you like you are from Mars for thinking that they have that item.  Wife and I ordered a Lemon and an Almond italian soda off the menu.  She looks at me like we're crazy and says they don' t have those, then points to a shelf 30 feet away on which are randomly stacked bottles of syrup.  They have those ones.  So we get two other flavors and they both are poor also.", "author": "Patrick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-10", "description": "A great pit stop during a shopping marathon on the Square. Equidistant between Banana flagship and Nordstrom, so this gets lots of traffic when Amanda and I are shopping it up. The location on Chestnut has turned into a full service diner and is much better on the food side than this location.", "author": "Todd J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-04", "description": "So Euro, but with boring pastries. Great coffee though. It's so nice to hang out in Union Square on a sunny day or for a shopping break. I hadn't been back since they remodeled it.", "author": "Thanya S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-19", "description": "Slow pokes.    Even though my iced coffee took twenty minutes to arrive, I\"ll give three stars.  Maybe it was a slow day.  Or a busy day.  The coffee was great, but the wait was excruciating.  It took even longer to pay our check.", "author": "Amme P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-22", "description": "They got a great location and I love the design of the place. Right on in Union Square and on a nice sunny day in san francisco just great to sit and enjoy. Good selection of small eats and drinks. However, because of the location, they can charge higher which they do. But its worth it once and awhile and enjoy.", "author": "Leon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-09", "description": "Great for people watching, reading, etc. since the locale couldn't be more central to union square.  Food is cafe style, pastries, salads, quiches, etc. but isn't anything special.", "author": "Jared F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-09", "description": "Emporio Rulli is a great place to get a glass a wine of the day, a nice smoked salmon panini or cup of  coffee and just chilled and hang out with a good friend on a SUNNY day.   But everything else is just okay and as most people pointed out. Skip the pastries.  Not at all impressive.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-29", "description": "This is not my favorite Rulli's location. Larkspur and Chestnut Street are better. This location is phenomenal for a nice day, people watching... But my grilled panino was just so-so. I'll give them a break for now but I hope next time it's lots better!", "author": "Dana R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-08", "description": "Ordered a vanilla latte -- they put more syrup in the drink than they did espresso or milk.  Was disgusting.  \n\nOrdered a sandwich (which looked delicious sitting under the glass), but when the waiter brought me something completely different from what I'd ordered, I tried to get them to bring me the correct one.  That's when the manager came out and (instead of trying to fix the order), made a big show of telling me that I didn't know what I was talking about.  \n\nWas surreal.  A great location, but not worth it.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-06", "description": "I love coming here on a sunny day to watch tourists.  It's got a great Italian feel and also serves typical italian cafe fare. I always come here for my break from shopping. Problem is I just hate getting up and leaving.", "author": "Roger H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-06", "description": "Great snacks & wine. Good music. Sometimes it's hard to find/get a seat on the weekend. Service fluctuates between outstanding sometimes excellent other days and poor, but usually being in the first two catagories.", "author": "Ricardo O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-07", "description": "I fell in love with San Francisco while having breakfast here.  I sat at an outdoor patio on the Square observing the art sale and in ear shot of a beautiful European family taking in rapid swedish.  Needless to say, I go there quite often.  The ice tea and panini's are great too!", "author": "Robert K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-21", "description": "I'm amazed that people seem so forgiving of an expensive, inept and semi-hostile cafe. Really now. If you were stuck in downtown.... if you felt compelled to people watch, if you are willing to have your order changed by the consistancy with which they are out of menu items, then maybe, just maybe, it would be worth the effort to go there.\n\nLocation pretty, good tea and coffee, nice pastry. \n\nNevertheless, there are other pretty views and good tea in SF. Don't go unless you are stuck. Speaking of stuck... tables are frequently sticky and lord help you if you ask them to wipe them off.\n\nToo expensive for the view. There are nice cafes over in N. Beach... or closer on Sutter. There are fantastic sandwich places over near Yerba Buena, with good cookies and everything. Do yourself a favor and take a miss on this one.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-10", "description": "What's more indulgent than sipping champagne, nibbling on a decadent Italian pastry, basking in the San Francisco summer sun, while gossiping about the eye candy all around you. NOTHING! DO IT! It's buzzed, fatty, gossip girl shenanigan's at its best.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-13", "description": "I swear that this place makes the BEST cafe mocha.. Not too bitter , and taste chocolaty enough.. Other than that, they have tasty pastries and freshly squeezed orange juice..simply the best!", "author": "Iche S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-08", "description": "When the time you just wanna some coffee, with the 100% joyful smooth taste and a relaxing seat outdoor plus people watching, I came here. A bit pricey, some people say. I don't agree... 3.25 for small non fat latte, not bad at all. As usual, with the headset on, I ordered to go and then just sitting on the stairs the union square, between the rains and sunshine this noon. Not many people here, and I wasn't pay much attention to them anyway. Anyway, the staffs here are always smiling and very polite. The folks come here always nice and friendly. A homeless past me this time. He asked what I'm writing about(I was have my journal book opened in front of me.) And then he seemed just talk to himself that he was always trying to write something... and then, he wished me have a lovely day. Things like this always can make me smile. I guess this location is a big part of reasons that you will fall in love with this cafe just like I did. Feel the beats, the breath, the sunshine, the people and the city noise. One sip for yourself, one sip for a nice day and one sip for the life.", "author": "Flora F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-01", "description": "This coffee shop always seems to be busy, I'm sure the tourist to Union Square keep it that way. As a local, I've never been tempted to eat there. I would give this place a 5 star for LOCATION, but for everything else, a mere 2 star. Great place to sit and sip while people watching.", "author": "Hieu D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-06", "description": "I haven't had coffee this good since I was in Italy, not to sound like a tool, but seriously, it's excellent. There was a long line on the Saturday morning we were there, but it went by very efficiently. We bravely resisted the elaborate spread of pastries and took a table outside on a beautifully sunny SF day. My friend complained, but I think the nearby pigeons only added to the European feel.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-29", "description": "Fine, fine coffee at this place. The pastries...eh. If you can stand the long lines and rushed service (have your money ready), go for a table outside. Beware the pigeons. My last time there was marred by a bleeding pigeon that landed on our table. Blood dripped into my coffee upon its descent, which I lovingly passed onto my darling accomplice. But rejoining the line of locals and lemmings alike was worth a second cup.", "author": "Karen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-04", "description": "Location location location. What a fantastic place to grab some good coffee during the heart of the holiday season. Sipping on your delicious drink, looking at the lights and tree in Union Square, how can you go wrong. The line was long for this popular shop but it was worth the wait and helped make a memorable evening. I got a plain and simple mocha coffee and it was good. I would have had a pastry but the selection was limited by the time we got there around 8 or 9pm. If I'm in town again I will not hesitate to grab some more java here.", "author": "Jason F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-04", "description": "the best part of shopping are the breaks from shopping, and Emporio Rulli really helps extend those breaks luxuriously, and they get paid for that service, thankyouverymuch. The cappuccinos in my opinion are some of the best in city. I also find the panini--especially the Brie & prosciutto cotto, or the prosciutto with arugula and asiago--are really really yum and warming, each bite a little island of calm in the crowd. I haven't tried the pasrties because I don't go there for breakfast. \nThe pigeons are a good distraction from all the people watching--during the day they swoop down on tables as soon as people vacate them, and re-enact choice scenes from the birds with Half-Eaten Croissant playing the part of Tippi Hedren. \nI appreciate that the staff take their time to make your coffee and grill your bread--more time away from shopping! YAY!\nPlus, the creamy delicious cappuccinos, meant to be drunk from porcelain (not paper), hide a hidden gem I call caffiene.", "author": "Renu C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-08", "description": "I only order the non-fat cappuccino when I need a caffeine fix. The cappuccino is always good, however the service just sucks a$$. This place is quite crowded on the weekends and when its crowded, it takes 15 mins to get your espresso. Most of the staff comes off rude and snobby. However the espresso is good and the foam is the right consistency!", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-24", "description": "Rulli is great for it's central meeting grounds, good coffee and let's not forget the fabulous open space. SF needs more public space/ gather places. Esp, as we become a solo nation of ipods, pda's, laptops and cell phones we forgot how to interact and socialize with people face to face.", "author": "Tamz O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-06", "description": "Great warm drinks for a cool day, plus sandwiches and lots of different breakfast pastries.", "author": "Bee H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-24", "description": "I know it's a touristy area...but the lines are long and the service sucks with not even a small selection of patisseries.  I recommend going to the Marina", "author": "annie z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-04", "description": "This place is bad. You go inside and there is no menu on the wall, the pastries that they are supposed to be famous for do not have either name tags or prices. And they taste like 2 days old. If you sit inside, you feel like people ligning up near the counter are hovering above your table. If you sit outside, be prepared to allow pigeons to eat from your plate. The service...you know the feeling of frustration when you are in line and there is only one person at the counter...and the other two are just chatting instead of jumping in and helping out? Be prepared to experience that too. I know it is a touristy place, and people who actually live in San Francisco would never go there, but come on, you can do better than this.", "author": "Lena R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-17", "description": "If you need somewhere quick that is outside and away from the bustling throngs without having to duck into a hotel restaurant or department store basement that's easy to find, go to Emporio Rulli Union Square.\n\nThe desserts, coffees, and wine bar are your best bet here. Great venue to enjoy Union Square especially, during the Holidays.  OK. OK. So, you may wait in line for awhile or your salad might be a little wilted. They only have so much room in the place to handle the huge volume of customers who keep coming back for more. I love the ambience and the feel of the place. That's why we all keep coming back.\n\nYou just have to know what to order, stop complaining and chill - can't  think of a cooler place to compare.", "author": "Rose M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-30", "description": "On a sunny day, believe it or not, this is one of the best cafe's in which to park yourself with a paper, a book, and a notepad. On a sunny day, wear sunglasses and look good. The espresso here is first class, as are the baked goods. You'd think it's all for tourists, but that's exactly what makes this such a find!", "author": "adrian c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-19", "description": "The location, pastries and coffee are what make this place worth a visit.  The mob of tourists is a pain, but it's a nice place to stop off for a drink and a snack while shopping.  \n\nI've ordered paninis twice, and both times, the edges of the bread have been very wet, even after the panini press.  It pretty much ruins the sandwich, no matter how tasty it may still be.  But, it's so convenient to grab something there.  \n\nI also wish they would put up more umbrellas.  Granted SF isn't the warmest place on earth, but it still gets really sunny.  The metal tables also get VERY hot - you could cook an egg on them.  For the large number of tables, they need more than 4 or 5  umbrellas.", "author": "Claire P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-26", "description": "finally someone has said it! this is a CAFE! NOT A RESTAURANT!!\nWhat the hell is wrong with the majority of you people who have written reviews? \n\nA coffee shop isn't supposed to be like starbucks....good coffee is hand crafted, not just popped out...meaning you have to WAIT.\n\nYes, the line can be long, but do you think its due to the staff? PAY ATTENTION the next time you are there.  I watched the very patient cashier try to communicate with someone who had waited in line chatting with their friend for 10 minutes and never thinking they may need to decide what they wanted, and then they couldn't understand that drinks were called out by names----seriously?!  The staff is working fast and hard, its the people in line that are the issue (and they seem to be the same ones reviewing this place....color me surprised)\n\nThe staff is pleasant, the food good----if the city would enforce the no smoking law it would be a perfect place.", "author": "jane J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-05", "description": "i ordered a bellini, and you gave me a $9 glass of peach juice.  when i went to return it, i didn't expect a pigeon to have eaten my croissant.  service couldn't get worse, and if it wasn't in such a prime location, it wouldn't still be here today.  if you're gonna wait an hour for a pannini, you ought to at least have a seat to do so in.", "author": "Ariane R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-15", "description": "occasionally i'll stop by here on a warm sunday afternoon and i'll stand in a long long line to get an iced americano and if i'm feeling skinny maybe an oversized pastry. the 15 minutes wait time in line really doesn't bother me much as it gives me more time to stare and drool over all the decadent pastries and goodies in the display cases-- palmiers, eclairs, tarts, and brioches...salads and sandwiches...everything always looks so tempting but its one of those places where you go more for the location and atmosphere than for the fare. i suppose if i was in a hurry and it wasn't a warm sunday afternoon this caffe would lose much of it's appeal.", "author": "helen l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-22", "description": "I have been here a few times now. Everytime included a great cup of coffee and friendly employees! Speedy service, a huge selection of food (salads, sandwiches, pastries galore, which I haven't ventured into yet), outdoor seating which, is always kept clean. They are a bit pricey compared to other local coffee shops but its a nice spot to sit down and enjoy a great cup of coffee in the heart of union square.", "author": "morgan a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-28", "description": "The location is nice, it's right in the middle of union square", "author": "RO Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-29", "description": "If it weren't for the location, I would've been saying \"Why won't Yelp let us give a place ZERO stars??\" If you'll notice, the best reviews are all about the location. They're true. It's a beautiful locale. It's great to sit outside and see all the tourists and locals. But the food/drink is an embarrassment to the city. If this is what is supposed to represent San Francisco cafe society, I hang my head in shame. I've had mediocre coffee here before. Today, I was ready to order an iced coffee because of the heat, but decided to go for gelato instead. I ordered two flavors like any good Italian order would be and I got a dixie cup with my 2 scoops in it. I'm not exaggerating. It was a dixie cup with the Emporio Rulli logo and colors on it! It was such a small cup that they couldn't maneuver the standard side-by-side gelato service in it. What's worse, the gelato was only so-so and it cost me $3.50!  I was expecting at least a regular \"small\" cup if anything, but not a dixie cup! I would steer everyone to Naia in North Beach where, although the cups are also small, they are large enough to fit a good serving into it and they put more thought and effort into their flavors. Rulli only offers 5, maybe 6, flavors.... all of the American persuasion... vanilla, coffee, mint chip, vanilla. I can't remember the 5th.\n\nI'm not expecting American-size scoops as big as my head, but give me SOMETHING for my money. Gelato is NOT more expensive to make and there really is no reason to charge more for it other than the \"exotic\" name of gelato. \n\nLocals/Tourists - buy your coffee here if you must, but buy food, pastries, and gelato elsewhere! I can recommend Naia for gelato in North Beach; crepes and chocolates at Crepe o Chocolat on off O'Farrel and Stockton (near Crate and Barrel), frozen yogurt at Fro Yo on Market and 3rd, and pastries at Boulangerie on Market. I think Caffe de la Presse would even be a good alternative.", "author": "Maria Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-04", "description": "I know they must be busy at this cafe due to its location, but frankly it was horrible from start to finish. The paninis were pre-made and horrible, with wilted greens and just not good in general. How can you mess up a panini? The service was atrocious and you can't tell where to sit for service. The waiter actively avoided us for the first 10 minutes while we sat and waited for menus.", "author": "Lisa k."}
