{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "$1 coffee for a teeny tiny cup that's perfect for my consumption levels rocks my imaginary socks. Have not seen this elsewhere in SF and I really like coffee shops. And there's a sunny window (weather dependent of course) in which to perch on a stool and be glanced at by the passersby on their way to Dolores Park. Well at least it makes me feel like a local when I do this. \n\nALSO: Cute gifts and design items. There's a video shop in back too! But in two visits I haven't even gotten to perusing it with all the entertainment in the front of the shop.", "author": "Catherine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "Pretty solid for $3.00 huge size coffee.\nI like their selection of films as well with lots of Criterion Collections and important European Art films.\nFilms by Federico Fellini, Wim Wenders, Chantal Akerman, Akira Kurozawa, Peter Weir, etc ..\nThe place itself is cute and not pretentious although that I would completely understand if hipsters likes to come here too.\nI'm not a hipster and I like this coffee shop.", "author": "Rudy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "Fayes Video (and coffee and other stuff) is a great little store! One large section of the wall is devoted to little print media items like greeting cards, notebooks, calendars, and pins. All are made in limited batches by what appears to be solo artists, and many were handmade. The only drawback here was that there didn't seem to be much SF artist representation, the prices were a little more extreme than other places like stores in Japantown or Serendipity, and the selection wasn't enormous. \n\nFayes also seems to be known for its video section. To round it out, there was also a barista on duty running a mini coffee shop. While we didn't get anything other than a cup of water, the attendant was super friendly and was chatting up other customers about their drinks and the movies available in the back of the store. \n\nI might come back to check out the movies or to grab a cup of coffee, but I think next time I might look for places with larger selections like Serendipity or the card store on the first floor of Japantown's westernmost shopping center building.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-08", "description": "My airbnb host put it best: video shop turned dvd shop turned coffee shop. Unique and cute neighborhood place. Everyone that came in seems to know each other.\n\nGot an iced coffee and it was pretty standard. Glad this place is walking distance from my airbnb and is a nice relaxed place if you don't want to wait in line at Tartine.", "author": "Brandon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Great little coffeeshop with a ton of character. I've spent many a happy time browsing through the art, cards, and knicknacks, as much as through their excellent DVD collection. They have an old-style card catalog cabinet where regulars keep their handy coffee cards. Oh, and the coffee is great, and the delicate and delicious pastries are a huge improvement over most coffee shops! :)", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "My dog, Moe, and I have been going to Fayes for 15 years. It's the best way to start the day -- great coffee for me, excellent dog treats for Moe, friends and neighbors, and art! I love Fayes more than cheese. (That's big praise.)\n\nAnd the chalkboard. Read the chalkboard when you visit.", "author": "Angela G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "It's a cute little shop! There are a lot of options trinket wise put up. The barista made me a dirty chai that was more like muddy water. He 100% did not care about the job he was doing.", "author": "Jenna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Wow! Great find in the Mission/Castro area! \nI originally walked to Tartine Bakery but as usual, the line was too long for me to wait for a pastry. Worth the wait if you REALLY want good pastries though! When I walked back on 18th street/west towards Dolores Park, I noticed Fayes Coffee and Faye's Video store about 50 feet away from Tartines. I have walked by this place many times before but wanted a 'bite' to eat this late morning.\nI quickly \"Yelped\" Fay's Coffee Shop and noticed very high ratings so went to check it out. Faye's Coffee shop has a nice old-nostalgic SF 'feel' inside and was quiet when I went (10:50am on a Monday). The Barista was very nice and helpful. I tried the cold-brew coffee $3.25 1 size only/16 once aka large. It was smooth and unlike other Cafes, he completely filled the cup even though I requested \"lite ice\". They had a decent selection of pastries i.e. your typical croissant, scones, etc. but had mini-fruit pies and savory ones i.e. quiche & chicken pie and I opted to try the Chicken Pie. He said it was from a local SF shop from the Inner Sunset area (Peasant Pies??) It was very good! As you can see from my picture, it was fresh, crust was buttery flaky and full of meat inside! It was light on the vegis' but was included. There was the right amount of onions and the pie wasn't wet/oozing with liquid when I ate it (prefer in min-pies) but was not dry whatsoever!\nThey DO HAVE Stevia sugar and all other condiments for your coffee/tea including Almond, soy milk and usual non/low/regular Milk.\nI highly recommend Faye's Coffee Shop and look forward to coming back soon!", "author": "Steve F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "I had a great experience here. Forgot to ask his name who worked last Wednesday evening but thank you!! I was freaking out trying to get a Lyft to catch a flight from SFO but somehow it was not working at all and my phone battery was so low. I came in to this place and ordered a cup of coffee telling him my situation. They did not have Wifi however he let me charge my phone and also told me to try connecting my phone at the end of the block as he knew the reception on this street was somehow bad. He was so nice and helpful and I successfully got a Lyft to arrive at the airport on time! Phew. Their coffee was very good. I wish I could've stayed there longer! Thank you", "author": "Ai F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "In my prior travels, I've visited coffee shops that have amalgamated with barber shops, whiskey bars, and even a soap shop, but this has been my first coffee shop/video rental combination. Video rental specials run through the weekdays, which include $2 Mondays and 2-for-1 Wednesdays.  \n\nIn an age where Netflix, Hulu, and Redbox dominates the movie rental business, seeing a place like Faye's in the neighborhood makes me smile. I love seeing tangible, physical copies of DVDs, similar to opening a hardcover book versus reading a novel off a Kindle. If you have a tough time deciding on a title like I do, new releases are reviewed by the staff to help with the selection process.\n\nOn to the coffee. I love that they offer an 8 oz. drip coffee for $1. Sometimes, you only want a small serving size. If you're looking for single origin beans, look elsewhere. Faye's coffee blend is a dark roast for a bigger, robust flavor. They also offer a cold brew as well as cold brew concentrate that comes in a mason jar to go. No need to stuff another stamp card in your wallet that's already busting at the seams. Use the shop's old school library-style card catalog to store your loyalty card for safe keeping. \n\nThe rest of the shop is filled with cool knick-knack art pieces and ceramics.", "author": "Bailey Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "I love this place! Shops like Faye's are what make cities great, and I was lucky enough to live a block away one summer. The $1 coffee is the last great deal in San Francisco. The DVD selection is great and a good value. On top of it all, one of the last places where you can buy a hard copy of the newspaper. And oh, their honor system loyalty punch cards are super fun.", "author": "Francisco M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-14", "description": "Why is the barista so angry at the world.  Was very curt , when we asked what their specialty drink was,  she angrily answered \"coffee!\".  She wouldn't even let us throw our disposable coffee cups in the store and made us walk to the trash can \"by the bus stop\". Why is short haired lady so so mean?", "author": "Aalia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "Our barista was nice, the coffee came up quickly, and my cappuccino was delicious. Also this place is a video rental store which is hard to come by these days, so check it out.", "author": "Damian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "A dying industry but this place keeps fighting the good fight.  The best thing about this store is the selection.  I found movies not available on line such as Deliverance and Deer Hunter to name a few.   Rentals are a buck w a 3 night rental.", "author": "Alicia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Passed by Mission district in the early morning stop here for a coffee. :) very interesting little coffee, videos shop! Chilling relaxing enjoying my morning coffee there great experience!", "author": "Sunsun L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-03", "description": "Good coffee and cool store. I like the milk options and sweetener options (soy, almond and 2% milk and stevia!), but the barista was terribly RUDE.\n\nI almost walked out and I should have. I also wished I didn't tip, but I've been young once so I understand how times can be hard, but really doesn't excuse the terrible attitude. \n\nThere are so many other places around. I will not be back.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-10", "description": "Upon entering this video store, I received no acknowledgement from the staff, which was mainly a guy sitting behind the counter, doing his best impression of being too cool for school.  I went up and asked about signing up.  He assisted me with absolutely zero expression on his face, but was polite.  Given the unique organization scheme, I asked for assistance finding the three titles I wanted to rent.  He assisted me grudgingly, seeming to be annoyed at being forced to leave the counter.  He rang up my movies, took my money, and I was on my way...\n\nLater that night, I excitedly sat down to watch my movie marathon.  The first one was awesome, so was the second.  About halfway through the third, the dvd started freezing, and try as I might, I could not unfreeze it.  I managed to turn off the movie, then start it a little while later in the movie...which left me missing about 20 minutes of some of the most important bits of the plot.\n\nWell, that sucks, but it's not the end of the world.  I'll just see if I can find out what happened by reading the wikipedia page for the movie.\n\nIt turns out the sucky part happened the next day when I returned the movie.  I let the counter guy (same one as yesterday) know that the movie froze in the middle, so was probably damaged, and that it wasn't my player's fault, because the other movies had worked just fine (and I've never had a problem before or since with it!).  He said, \"Okay, cool, thanks for letting me know.\" \n\nI waited a moment, perplexed, wondering if he'd somehow forgotten to offer to refund my money for that rental which I didn't really get to enjoy.  He never made that offer.  In retrospect, I should've made it clear that I wanted my money back...but he'd already moved onto a conversation with someone he knew in the store.  So I just left, feeling awkward and annoyed.  I haven't been back since, and the next time I had the urge to rent a video, I went to Lost Weekend instead.  \n\nIt kind of sucks that I feel this animosity towards Faye's, but customer service makes or breaks an experience for me.  If the counter guy had just refunded my money, or at least offered me another rental free for my troubles, I would've continued to give them my business, because that would've been an ethical business practice.  But to take my money, give me a substandard, defective product, and then not try to make that right?  Yeah, ain't got no time for that...!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-01", "description": "Friendly barista, good coffee, and nice selection of milk for customers to use (soy, almond, skim, and 2%). Wouldn't go out of my way to come back, but it wasn't a bad experience. It's fun to browse around the shop, too.", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "Dear a**holes playing the gentrification card: this place has been here 16 years.\n\nIt's an amazing coffee, video, art selling community hub. The bathroom is adorable, and there's a cute dog contest every year! \n\nIt's unbearable amazing.\n\nProps to Brandon, one of the workers!", "author": "Amanda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-07", "description": "Love this place and the artwork available to purchase as well. It used to be along my normal route, but now I default to other closer places since my move. I'll still come back here for old times' sake.", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "So the counter is high, but the staff is great.  Flat entrance and open ordering area, benches outside.  Staff happy to fix your coffee if the counter with the sugar and such isn't convenient to reach.  Staff will suggest and get your DVDs too.\n\nThe coffee is the best in the surrounding few blocks and inexpensive.  Dollar will get you a small coffee.  The staff seems to really like animals, but will ask before giving your service dog a cookie.\n\nFaye's has been right there for decades - although they started as a tailor's shop!", "author": "SF Disability Awareness N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "Why I Heart Fayes Video & Espresso Bar Reason #36:\n\nTHIS SIGN:\nhttp://www.yelp.com/biz_photos/maX2pNMeAroeVGbcCNkTcg?select=h10PyfkKV-uk1SjiksECkA\n\n(Reasons #1 -35 include:  Hot chocolate, $2 daily rental specials, the old school library catalog that stores my frequent buyer coffee card, carousel horses, and happiness that video stores like Fayes are still around.  Netflix who?)", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "Super-cute little coffee shop that apparently sells and rents these small little disks that ostensibly contain movies. I guess it's like Netflix streaming for people who go camping? I dunno.\n\nFriendly baristas, cute space, good location, tasty coffee. Cute t-shirts. Odd little disks.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "I love fayes. I have netflix and mostly watch DVDs on my laptop but my boyfriend doesn't have wifi or a laptop and as I've come to rely more on their business I've just started to love them more and more. The selection can be weird with big gaps to me, but they have quite a bit still and it's nice to still be able to look through movies and pick one that just looks interesting, rather than blankly staring at netflix trying to make any choice or having to always know exactly what you want to watch. The service is great, the art is always awesome and the pastries are really good. The coffee isn't 3rd wave so don't expect that, but it's still coffee and if you're not into fancy shit (which I am, but my strange boyfriend isn't) then it's a refreshing find.", "author": "Ali D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "Very randomly wandered in here on a rainy morning.  Thought the frequent customer cards & library style filing were so fun.  Got a coffee & hung out for a bit.  The barista was a super cool dude & everyone that came in was friendly.  Seemed like a chill neighborhood spot.  If I lived in the neighborhood (or in SF, for that matter) I would make this my regular morning spot.  The best part? They had a really neat selection of cards, prints & other local maker stuff.  Win!", "author": "Theresa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-31", "description": "Crazy cool eclectic place. DVD's VHS, coffee and baked goods? Yes. And they're open decently late. Guy behind the counter was totally chill and made a solid iced chai. Who knew a joint like this existed?", "author": "Kim N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-16", "description": "I wanna give this five stars because I love the shop, selection, coffee and especially the section organized by film director.  But then my concern won't be given any notice.\n\nI can't in good conscience give my support for this joint until someone addresses the attitude that sits behind the counter whenever I visit.  She won't make eye contact, greet, say thanks or goodbye.  She's usually making lovely sketches instead of working, which I dont mind, but not sure if she realizes that she comes across as downright rude when spoken to.\n\nIts so ridiculous that my friend and I go out of our way to see if we can get a smile or word out and even then  she will intentionally ignore our friendliness.  \n\nHas anyone else experienced this?  I hope its not me misinterpretting things. I'll be happy to add more stars back on if management can addresses it and things improve. \n\nUntil then, Netflix doesn't make me feel bad about bringing them my business.", "author": "Bryce C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "The coffee is great. The staff was super friendly, and the shop had cool stuff. There was even a cat magazine to read while we drank our coffee. Didn't check out the video selection, but it's cool that there are still a few DVD rental places around.", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "I used to live around the corner and stop in here for a coffee and to rent a movie quite frequently. I haven't been back in five years and while the Mission neighborhood has changed a lot (with high-priced gourmet cafés on nearly every corner) I'm glad to see that Faye's has remained the same...in quality, service and convenience. I don't know anywhere else in the city where you can walk in, not wait in line, and get a teeny cup of great tasting coffee for a Buck. I hope Faye's survives the gentrification of the neighborhood. Thanks Faye's.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-29", "description": "I want to leave more stars because the ambiance and the drinks were great! But... Similar to a review left 6 months ago, I just had the weirdest experience.\n\nThe barista was sketching when we walked in which was cool... Then she had no personality and we got barley any interaction. I said hi and she just stared... \nIt was odd more than anything... Off putting. \n\nBut our drinks were great and priced well!", "author": "Bekah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "Good coffee, pastries, local gifts, treats for your dogs. I know I have a hand-drawn squirrel loyalty card in the card file but for the life of me I can't find it. Oh well, I enjoy looking for it.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "A\nRelaxed\nVideo\nStore slash coffee\nShop. Has outdoor bench for people watching.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "I'm not a coffee drinker & only was visiting from out of state -- but this place had a great feel to it & I love the trinket selection too :) I love movies so I'm also glad to see that they are still stubbornly offering movie rentals in this Netflix age. Kudos!\nI gotta suggest that you improve your tea selection. I know most people are into coffee but tea people exist too. ;)", "author": "Erika H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "This is my favorite neighborhood spot to grab a coffee while on the go. Unlike Dolores Park Cafe, they don't get crowded so you can be in and out in minutes. The people who work here are chill and since it's in a video store, it's easy to stay entertained while you're latte is getting prepped.\n\nI don't think I've ever rented from here, but I have a membership just in case. Also, check out their customer loyalty cards on the counter when you get a chance. They've got super cute illustrations and it's on the honor system, which I love.\n\nPro-tip: the bench outside is a fantastic place to relax for a minute and people-watch the hordes across the street lining up at Delfina and Tartine.", "author": "Madhu P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "What a weird place!!! I guess, it's \"As good as it gets!\" (5*) on a weird places list... actually I was directed here for their coffee - I was grabbing a sandwich as a place close by and wanted to also have some coffee.  A sandwich-man advised that I try this place, and a couple standing in line next to me confirmed.  So, here I was... getting my coffee among a weird collection of a pre-Red box video rentals.  \nNot a destination, but possible stop-by on your way place.", "author": "Marianna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "UPS Access Point in Mission that accepts packages til 10pm, cant beat that", "author": "G K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Tati is the best! She's so friendly and nice to chat with. Can't believe there is a barista as calm, polite, and friendly as her in San Francisco! Plus there are movies here... Good stuff! 10/10 would recommend. Will be back! PS join the frequent fill up card-- keep it in the cubby for easy access.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Long-time coffee shop with a sense of humor.  In addition to videos you can also find some unique gifts and cards - worth the visit just for these!  Buy a refillable bottle of cold brew to make at home.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "Love this place that is in my trendy neighborhood. Contrary to lots of others new ultra-expensive coffee shops in the area you can still get great coffee for a really good price.\nIt has an awesome selection of videos. Now it has great chocolate for tasting", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "Nice little spot with very affordable cup of coffee! Coffee is better here and the price is better than a La Linea which is across the street. This is only about 60% of the price to go pay there!\n\nDownside is seating. There are few seats inside and only one bench outside the shop. Unfortunately although the space is Inviting one cannot linger here due to lack of the spaces to sit. \n\nBike parking!", "author": "Scott S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "This place is delicious and adorable. I wish I could purchase all of the drinks and everything in the store. I love the local feel, including the frequent visitor stamp cards. I come here every time I need a coffee when I'm in the Mission. Highly recommend!!", "author": "Jamie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "It's a swell place with a good vibe. I love the lil' billboard outside that has a different artzy-fartzy look every day :-) the idea of dvd/video games rental + coffee is original and cool. \n\nIt's in a very nice area on 18th, near Mission and Valencia.", "author": "Styn V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Honestly, such a cool place. The coffee is amazing and cheap and the service is great, if your lucky enough you'll go in on a day that Brandon is working (such a helpful guy)\nIn addition to the great coffee they have an amazing video collection such great stuff you wot find on Netflix.", "author": "Adam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "What would I do without you? Our relationship is codependent, but I don't care. I could never make it this far in San Francisco without you.\n\nI love you to bits.", "author": "Shell S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "A local treasure!  I get coffee there every morning I can, and it always puts my day on a good track.  I really appreciate the:\n\nDelicious coffee\nHomemade \"frequent fill up\" cards in old card catalogue drawers\nHours: open early, open late\nCapable, drama free staff", "author": "Phoebe G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-02", "description": "I agree with most everyone who has reviewed Faye's - their coffee is great!\n\nHowever - if you are looking for a friendly and/or helpful staff - this is not the place for you. Out of the dozen times that I've walked into Faye's for a cup of coffee or to rent a movie I believe I've only been greeted once. \n\nMost recently, the women behind the counter didn't even make eye contact with me during my whole interaction. I understand that most people in our neighborhood like to act too cool for school - it is the Mission afterall - but some level of professionalism would be nice. \n\nMy advice? Stick with Netflix.", "author": "Anne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "Loved the spot, the coffee, and how they display the accessories. They sell awesome cards!", "author": "Marion K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-03", "description": "I moved to the neighborhood a few months ago and have always enjoyed their quirky signs, but haven't started going in until recently! \n\nI will always remember Faye's as the place where I first started habitually drinking coffee, as I've never been much of a coffee drinker (I somehow survived college sans coffee). I used to live without it, annnnnnd now I can't due to my early rising adult job.  The coffee and friendly staff is awesome! The atmosphere is absolutely wonderful as well, and I will love this place until I die. I'd totally rent movies from them if I had a television/working computer/time to watch movies. \n\nI will probably tell my grandchildren how much I loved it, and how delicious that pumpkin scone was with my coffee.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "Came in yesterday to get a cup of coffee while visiting my family with my 8oz mug. I was a bit shocked when they charged me a 1.50 . I used to pay a dollar all the time. I felt so bummed out I tipped the guy and left.  Not sure if they raised the price of their teeny size or not. Not sure either but I think there was a discount for bringing in your own mug.\n\nI'm not saying this because I'm cheap but I feel like it takes away from me tipping the person. The place is still a great place to go, they have their but X amount get one free, never bothered to fill one out but for some reason it just ruined my mood for yesterday that I just had to yelp it.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "Faye's is awesome. \n\nThe only reason I would not give the full 5 stars is because I don't want to have to wait in line behind anyone. This is the quintessential neighborhood coffee spot and as a bonus they've got movies too. \n\nHowever, this just a review for the coffee portion of Faye's. In any case, they serve great coffee, have great people working the bar, and they even have a great buy 12 get 1 free frequent buyer card that runs on the honor system and features cool designs. Next time you see that giant line around the corner at Tartine (and are just looking for a coffee), cross the street and head to Faye's.", "author": "T B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "This little joint saved my life. The barista is charming...but I wouldn't mess with her. Just like I like 'em.", "author": "Eric P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "Like the other reviews, I saw the line for Tartine and came straight here. Good iced coffee and really friendly service. I didn't have cash and he let it slide for this time (I guess it's obvious I'm from out of town?)\n\nGood local coffee shop in the neighborhood. Definitely worth a stop", "author": "Sneha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "This spot would be a gem anywhere, but it especially stands out in the land of hour-long brunch and bakery lines. You walk in, the super friendly worker (owner?) greets you, and you get your really good coffee/espresso drink/tea immediately. You can walk right out and go about your day enjoying your delicious cup of Joe, or you can linger to enjoy the various artwork, gifts, and videos this store offers. Overall, really friendly service, unique atmosphere, great prices, and most importantly, delicious coffee.", "author": "Carina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "Small cafe with a select of (mostly DVD) videos for rent.\nNo seating.\nLots of Criterion Collection, which are high quality, often rare and bundles with extras.\nI had a Chai Latte, it was pretty good.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "This place is freaking adorable. From the wall of movies to the kitschy stuff you can buy (I bought a card with a picture of a burrito filled with guacamole love) this place is a kind of hidden gem right in the middle of Mission.", "author": "Reyana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Thanks for still renting videos and being open in the morning.", "author": "Ellen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "The coffee is fantastic.  Easily on par with ritual or four barrel.  I'm not exactly a a coffee snob but I do like good coffee and this place always hits the spot.\n\nBut the real reason that I decided to write a review is the service.  The people here are super cool.  I really appreciate it.  So really, what's not to like?  Great coffee.  Video rentals.  Really nice people.  5 stars all the way around.", "author": "Jon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-08", "description": "Stumbled upon this place to grab a quick basic tea refreshment before waiting in line at Bi-Rite across the street.  It's a pretty grassroots type establishment in the neighborhood, so the vibe is chill and the service is pretty good.  Drinks are inexpensive, two regular teas were only $2.50  It's uber old-school to be offering up actual DVD disc rentals.  It'd be even stranger if they rented VHS tapes though, haha.\n\nAnyway, I can't remember the last time I rented a DVD from a shop...  Great place to stopover for a quick drink in the neighborhood.  Ginseng and lemon, don't think I've ever had that combo before...  There was a small fridge with cold drinks near the front, but I still think they should offer up other drink choices if possible, which should be more enticing for customers.  Overall it's awesome that they're open late past many of the other larger cafes nearby.", "author": "Kenny P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "Stumbled in here on a recent Sunday because I was short on time and Tartine had a huge line.  The coffee I got was really good and it looks like they use Illy espresso which is +.  They have a few pastries to pick from which was nice (the scone had had sucked....but thats ok, I wasn't exactly expecting a lot).  The service was lacking, not rude, but not gracious.\n\nI loved the little seating outside and the hipster vibe inside.  I cant comment on the video selection, but I do know that its one of the last few video stores in the city so I appreciate that.\n\nIm always a fan of unpretentious places that serve a great product and know their customer base well.", "author": "Alan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "I'll be the first person to admit I'm a coffee snob. \n\nBy far my favorite coffee in SF. I walk past Ritual every time to get Fayes. \n\nThe best part is that it's mainly a video store but they sure can make a great espresso. \n\nLove it", "author": "Harris G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-04", "description": "Beside the stench of hipster in the air and poor service, I gotta give credit where credit is due cuz well, I'm a pretty fair chick ;) a cuppa coffee here does indeed whup ass. Probably some of the best coffee I've had in a bit..which is a shame cuz if this place took pieces from humble pie a bit more, I'd frequent.", "author": "Lucy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-23", "description": "Who really rents videos anymore from a video store?  I have no clue how they keep their video business afloat but if you're looking for a very intense chai flavored chai latte, this is your spot!", "author": "Albie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "Why would anyone wait in line for coffee at Tartine when you can get a damned good beverage across the street at Faye's, for less than a quarter of the price?!?! \n\nFeaturing a quirky but very friendly staff, an outstanding video selection, and an odd assortment of handmade signs.", "author": "tony a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-01", "description": "I've walked by Faye's, oh, a million times in the dozen years I've lived in the Castro.\n\nBut it was only recently that I ducked inside to get a cup of coffee. My long-standing favorite, Peet's, was too far out of the way and SummitSF, on Valencia, takes way too long for what you get.\n\nOMG: I'm am now addicted to Faye's coffee. I've been getting an 8-oz. with a shot of espresso, and I think it's just about the best cup of coffee I've ever had. In fact, I'm sitting here, jonesing for one right now.\n\nI've yet to rent a movie at Faye's, but the selection looks good, too.\n\nBut the coffee . . .", "author": "Jim H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "I can't comment on the coffee / espresso, since I don't drink the stuff, but I CAN COMMENT on the movies, and the comment is: \"Woo-Hoo!!\"  Seriously, this might be one of the last of the \"Mom'n'Pop\" video stores left in America, but they are great.  My friends can't even conceive of the idea that \"I'm going down to the store to pick up a DVD\", they're so brain-washed by NetFlix and downloading and the like.  \n\nANYWAY, you really can't be the prices at Faye's: $2 on Monday, 2-for-1 on Wednesday, and I'm pretty sure Tuesday and Thursday have  something special, like $2 documentary night or kids flick night or something like that.  \n\nI know you want to hide in your apartment, never interacting with the world, doing everything via the internet, including downloading nutrients directly into your bloodstream, but you really owe it to yourself to get out every once in a while and interact with real, live human beings.  The staff at Faye's are willing to talk about movies, help you figure out what's good, what you might've missed (In Bruges, Mesrine, Moon.)  Come out, score some caffeine and video, then crawl back to security of your pod, Neo.", "author": "Invisible J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-18", "description": "What can I say about Faye's?  Great coffee, wonderful friendly staff who love the dogs I walk in with, particularly the neighbor dog who LIVES for the biscuit that they give him each morning.  So nice to have a nice, local, non chain coffee shop right in my hood.  I love the arty feel of the place too, with the posters in the window for indy bands, films and stuff.  \n\nLove, love, love Faye's!", "author": "Unemployed D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "The best iced coffee in town but the Growlers of it are to small!! I only go there for coffee but they look like they have a lot of interesting movies too if you don't like Netflix. And I love the little punch cards they are very cute", "author": "Clark L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-31", "description": "While on the early morning hunt to grab the makings for making coffee, filters, creamer and coffee and waiting for Bi-Rite to open I came into Faye's per some peoples recommendations for having good espresso. A little hole in the wall video/espresso bar adjacent to Bi-Rite lies the best video store ever. The best selection of indie and foreign films.. I perused the shop while I waited for our lattes.. The staff is super friendly sans the pompous attitude..  Love it here.. Just wish our flat that we had for the time we were here had a DVD player.. I would of spent the entire weekend in watching films!\n\nThe latte btw... was amazing!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-16", "description": "Having moved out of the neighborhood and joining Netflix, I've really come to miss Faye's. Going to the video store reminds me of being a kid. The whole act of walking down and getting some Bi Rite along the way was my favorite way to spend a night in. The selection was pretty decent but I was never really blown away. That said, I did leave with a great movie every single time.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "If this place were a person and we were on a dinner date, I'd be so charmed that I'd just stare adoringly across the table all night, floored and tongue-tied. Or maybe we could just go back to my place and watch a movie.", "author": "KC G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-12", "description": "We love Faye's.  It might seem old fashioned, but going to the video store has become a time-honored part of our weekly routine.  And I'm ever so grateful to the kind employees, who are oh-so-kind and patient when a reserved five-year-old wants to check out Return of the Jedi all on her own.  Thank you all for being a neighborhood mainstay!", "author": "C J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-27", "description": "I was dying for coffee today, but it's almost a thousand degrees out there. I went to Faye's and it turns out they have cold brewed iced coffee, and now I'm a fan.\n\nNot familiar? Neither was I. It just means they soak the grounds in cool water rather than brew it traditionally for their iced coffee, resulting in an almost chocolatey, low acid, and less bitter cup. The extraction is different than hot water brewing, so it's not going to taste like a cup of coffee only colder, it's got it's own mellow personality that's perfect for a hot day.", "author": "Benjamin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-14", "description": "Best iced coffee in the city...why? Because its an Iced Toddy and its cold brewed. In my opinion, thats the only way to make it. If you don't cold brew, its just hot coffee stuck in the fridge to cool and get bitter and gross.\nGreat movie selections too and the signage around the shop is actually art, done by the folks that work there. Keep your local video/coffee shop in business, go to places like Faye's!!", "author": "M-Britt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-19", "description": "Randomly walked into this business today looking for a cup of coffee and couldn't quite believe it's been around for so long and I hadn't noticed it. Grouping movies by director is always a good sign for me, and the dude taking care of business seemed quite knowledgable and easy to talk to. Coffee's good, too!", "author": "Jesse G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-25", "description": "5 stars is something special, but fayes is Something Special.\n\nA true neighborhood establishment with a variety of patrons. \n\nI've lived 1/2 block from Fayes for 5+ years. Sometimes I go several times a week. Sometimes I don't go in there for months. That also applies to my coffee drinking. The coffee is fine fine fine. Bring your own cup. I've never bought any treats there, so I don't know if they are any good.\n\nCard catalogue for your frequent coffee drinker card. Honor system. Amazing video selection. A++ friendly employees. Sometimes I have gone into Fayes to just check in with people and be friendly/social.\n\nMany a meet-up has happened at the bench outside of Fayes. \n\nI would be very disappointed if Fayes disappeared, and if it never existed in the first place I would wish that it did.\n\nI'm going to go rent a video there right now...", "author": "Virginia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "Nice place with a cozy feel and good space.", "author": "Captain J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-10", "description": "This is that kind of quirky store that you only get in the Mission.  My friend used to live with her then boyfriend right down the street so I used to come by here all the time with them.  Now I barely ever go in there.  \nBut I really miss getting an expresso, a cool foreign film, and then heading back to her place (stopping by the Bi-Rite for some ice cream of course). The combination of expresso stop/video store is pretty cool.\nThis was also a stop on the way back to her place from Dolores Park. It went something like this: get tan at the park; get ice-cream at B-Rite; get movie at Faye's.\nStaff is cool if you are cool with them.  They aren't big fans of the clueless: \"Is this film, Raging Bull, any good? Is it about a toreador?\" will definitely not get you the best service.", "author": "Nikki K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "just got a latte this morning and im not sure if its the monday or the taste buds but, it was the best soy latte ive ever had. set besides that.... the interior was cute! and super sweet barista!!!", "author": "Megan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-05", "description": "time to cancel Netflix: one night I was in a unique mood and the proprietor latched on perfectly to what I needed - \"Paris Texas\" - it was beyond perfect. I'm indebted. Plus, they are 2 blocks from my front door, and 1/2 block away from Bi-Rite Creamery - what else do you need?\n\nUPDATE 7/10/09:\nThey *are* as good as it gets. Two top-of-mind reasons:\n1) They started adding \"free\" movies you can toss in (yes, for free) with an existing rental. Why? Because they love us.\n\n2) I had two movies overdue by a few days. Rather than let me languish in late fees (think insurance company mentality), they instead CALLED me to remind me. Talk about \"high touch\". Bring it ON!!!", "author": "Diane B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-14", "description": "Great place! I'm visiting San Francisco and I dropped by this place to get some coffee. The coffee was great, the people were really nice and friendly and it was an all round good experience!", "author": "Paul O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "Friendly service, amazing coffee and the best bench to sit and watch people from.\n\nMy dog loves the treats that Fayes gives him", "author": "Marcia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-29", "description": "I walk into Faye's every morning for coffee before work. I love the feel of this place. It's fun to look at videos during the (always short) wait for coffee, and I like that everyone who walks in is personable; it draws a friendly crowd. The people who work there are also really nice.\n\nThis is a place where you take your coffee to go, so be prepared for that. This works perfectly for me, since I like to pick up coffee quickly before work. A local gem.", "author": "Katie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-04", "description": "The people who staff this cafe all act like they drink from the same batch of kool-aide every morning:  rude, smug, arrogant slackers.  They can barely get up from their little cubby-hole in the corner to pour a cup of stale coffee.  Always with their eyes on the tip jar.   \nRUN from this place.  RUN", "author": "Alex L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-28", "description": "Great staff and recommendations. Have to love a place with good customer service, cool movies that are not your typical block busters and serves coffee. \nI wish we have more movie places like this, just on a tiny bit bigger scale as a lot of the times the movies i want are already out.", "author": "Tasha A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "In April I decided to yelp some good coffee places in San Francisco and this one came up with very high ratings. The coffee was okay, but I was more in love with the idea of a movie rental and espresso bar combo. Only in the city can you find such an interesting mix :)", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-29", "description": "If you just don't feel like eating your tartine at tartine...this place is a great option. And by great option, I mean, you should probably get an espresso or something so that you're not loitering or you could rent a video...anyway, I don't rent videos and I don't live close to here, but if I did, I would consider coming here if I had children.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-22", "description": "Patronize your local mom and pop video store! Love the system where each new release has a little magnet below it, no magnet means not in stock! Easy. Dog-friendly (they have treats) and has an obscure collection, though new release do take time to come it. If you're local, I recommend the \"plan.\" You pay a lump sum and it makes your price per rental lower. \n\nAslo, save money and grab a hot choco here instead of tartine, it's just as good!", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-14", "description": "I'm so grateful for Fayes!  This place is such a neighborhood treasure. What a relief to see such relaxed, unassuming people who are funny and wise just naturally without trying too hard. I always smile at their chalkboard drawings and witticisms. And they have the best cup of coffee in the neighborhood, with the extremely fair price for ground coffee of $14 a pound or $7 a half a pound (I love that they aren't trying to tempt you to buy more than you need; they trust you to make your own decision without bribing you).  I only go to other places when I absolutely can't make it there. Such a lovely little bench outside too whereon I've met many nice neighbors.  As long as there is Fayes, I am happy...Thank you, Mike and Matthew. You guys are really the best and I am grateful for all you do!", "author": "Heidi-Jane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-07", "description": "Faye's, I like your style.  \n\nIt'd be difficult for me to add to what previous reviewers have written.  Folks have pretty much said it all.\n\nSo I'll leave it at this: Faye's, I like your style.", "author": "Coleman K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-20", "description": "Dear Fayes,\n\nYou rule. Your coffee is awesome, your iced tea changes daily and your iced coffee is never bitter. You have an awesome selection of movies too! Oh, and my roommate works here she is amazing and nice. Fayes is also very community oriented and brings people together, be it on the bench or with a cutest dog contest. They also reward your loyalty with free coffee days. And Mike and Matthew are the coolest dudes on the block. \n\n2 cool\n2 be\n--------\n4 gotten", "author": "Roxanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-17", "description": "Hidden gem for great coffee.  Hardly ever a line, friendly service, good prices, everything I'd expect from an indie neighborhood... I was about to say \"coffee shop\" but I see they call themselves \"espresso bar\" since they don't have any tables, just a counter near the window.  This makes me respect them even more, in a city where everyone seems to be trying to be something they're not, Fayes is honest that they're just serving espresso and not trying to be hangout.", "author": "Joyce J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "This place is awesome!  Great for a quick coffee but even better to grab a dvd from their well curated collection.  Everything from oddball indies to classics to corny comedies.  Most of the staff is really friendly and approachable for movie recommendations, except for the one girl who has been really cold to us every time we've gone in.  She gives off a really negative vibe and seems to want nothing to do with customers.  I guess every indie video store is supposed to have some attitude?  Otherwise I highly recommend Fayes, check out the fun nightly movie deals too!", "author": "Mt W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "Great selection of movies, great staff and, out of nowhere, AMAZING coffee.", "author": "Caroline J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-01", "description": "Faye's is one of my favorite parts of my neighborhood. The coffee is great, the movie selection is terrific, and the staff are friendly and helpful. They recently got a directors section, which I really like, and they're always willing to recommend a movie if I find myself at a loss for what I'd like to watch next. Also: the sign out front gives me a smile every day. Absolutely recommended: go check these guys out.", "author": "Tricia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "Faye's just gets better!\n\nBuy a 30 movie rental card for only $60.00! I love Faye's and do not miss Cutest Dog Contest!\nhttp://www.facebook.com/pages/Fayes-Video-Espresso-Bar/63018133564", "author": "trotwood l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "Great coffee, great people, great owners.  I have been getting my morning coffee here for many years.  It's a neighborhood establishment, the kinda place where everyone knows my name and I feel welcome.  Not only do most of my neighbors frequent this place, but I see many of the local restaurant and other business people from 18th street coming in for their coffee.  And unlike some of the other places around these parts, they rarely have a line and if they do - it's usually only a couple people.", "author": "Parousha Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-29", "description": "Best coffee in San Francisco, amazing selection of movies, that bench=sweet!, and the raddest business owners I know. What more do you need?", "author": "Megan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-24", "description": "I have been meaning to go in for a long time, finally did, loved it. It's a cool space, with a top notch espresso bar. You get a free coffee with your first rental, and I tested their metal with an espresso. Excellent. Maybe it should be an espresso bar where you can also rent DVD's. Mike is super knowledgeable about film, and suggested movies  for me. Went home with Imaginary Heros, which I in fact did like very much. Buy your pastry at Tartine, but your coffee--and movie--at Faye's.", "author": "Beth W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-10", "description": "I love supporting the small guys... But kindly don't you decide how much milk I want in my coffee for me... We are all individual with our own taste... Maybe I'm a coffee snob but that's my taste not yours..... You put too much milk in and watered down what I was expecting to be a fine tasting coffee... Nice staff and groovy location !!", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-14", "description": "movies (even VHS), really good coffee and espresso drinks and a super duper staff!\n\nlove faye's!", "author": "Caitlin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-08", "description": "I've been in the neighborhood for years now and appreciate Faye's more than ever, especially when it recently occurred to me that by working in both a coffee shop and video store, the people at Faye's see us in our rawest and most vulnerable moments. \n\nFor example, they are patient with me before my morning coffee, when it's hard to string coherent sentences together. They looked the other way during a Gael Garcia Bernal rental phase that probably should have alerted the Mexican authorities. They don't make me feel like a loser when I come in bleary-eyed after a long work week and choose a brainless romantic comedy over a thoughtful indie release or foreign classic. Most interestingly, they have politely offered advice on men I've brought in who are totally wrong for me. (\"Who was that dude the other night who thought Hitchcock is too scary? Is that the kind of guy you really want?\" Noted, and agreed.)\n\nThe intersection of 18th and Guerrero has become quite the destination, where crowds of people have come to clog the sidewalks around Tartine, Bi-Rite Creamery, and Pizzeria Delfina, but thankfully, Faye's feels like the most authentic place in the neighborhood.", "author": "Jill C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-29", "description": "Great espresso, open later than all the weak places around here that close at 9 for some reason.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-27", "description": "Typically, I'm a total Netflix junkie. I really like the idea of supporting your local neighborhood business but I'm sucked in by the convenience of Netflix. So occasionally I still enjoy perusing the aisles of a real video store. \n\nFaye's is cool, they have a decent selection of VHS & DVDs, not as big as the major chains but still a good selection for their size.  It's a little cramped as they have tried to fit in a much as physically possible. Faye's also has a full espresso bar which is nice. The one major drawback to Faye's is that since they don't have an exterior drop off everything is due back before closing, which on Sunday is at 7 PM.", "author": "Marissa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-17", "description": "Another great example of a local business done right. When I lived in the Nission, this was my spot for renting videos. A good selection, although in fairness nothing compared to Blockbuster. I suppose if you don't find a new release, dig into a classic, or ask the more than friendly staff for a suggestion.\n\nIn a quirky twist, you can also get coffee here, so it's good for your morning cup of Joe too.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-08", "description": "Support your local video store!  Small but good selection of movies.  They have the latest titles (although they are often already rented out).  Good price for rentals.  Friendly and knowledgeable staff.  Good coffee.  I hope they stick around for a long time.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-17", "description": "Perfect indoor date:\n\nDelfina takeout: $45\nBiRite Creamery takeout: $7\nFayes Video: $3.50 (2 for 1 Wednesdays)\n\nParking in the Mission: PRICELESS!\n\nFor everything else, there's Netflix.\n\nFayes Video is great little Mission-Dolores nook, serving up excellent espresso and a good list of foreign films for the cinemarati.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-01", "description": "This place is absolutely enamoring by its simplicity. Great movie selection, espresso drinks, a bench outside, and friendly staff. Very nice vibe.\n\nDecent espresso drinks (at times a bit slow, but the person working at the time might have been new). Great place to have coffee while your laundry is spinning next door. Or to beat the Tartine-line.", "author": "Steven D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-26", "description": "Great place. I am an old customer of Faye's. I still prefer the in the moment selection of a video store to that of having to predict the mood of future me (netflix). I am also a big fan of there discounted movie nights. My girlfriend loves the coffee, most mornings she there, at Faye's, enjoying her favorite brew. \n\nI highly recommend the coffee, and the movies.", "author": "fritz h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-29", "description": "After reading about Schmendricks Bagels selling their goods out of Faye's I decided to check it out for future reference.  I found the service exemplary, couldn't be more friendly or welcoming, the soy latte taste to perfection, not too bitter, not too sweet.  A few cello-wrapped vegan sweets available.  Only downside for those of us who like to sit down and hang out, do some reading with our lattes, is that there is no seating except for a bench out front.  Due to overal experience I'm not subtracting a star for that!", "author": "Bob G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-31", "description": "After visiting 2 Blocksucker's attempting to locate \"Entourage, Season 2\" I found it at Faye's, and it only came out 10 weeks ago.  So yes, they do have some recent stuff, albeit random.  They were also offering the dvd of \"The History of Violence\" for $7 (previously reviewed) What a deal!  We walked in with the movies, 45 minutes in violation of the time they were due.  No late fees.  Friendly service-she forgot to act like she was doing me a favor, the requisite behavior for video stores.\r\n\r\nIt gets better-Faye's has a frequent visitor card for the coffee, filed in the card catalogue from your elementary school library.  According to the sign, you're on the honor system to use it without abusing it.  Long live Faye's!", "author": "Beth V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-09", "description": "I swear to GOD I wrote a review of this place before. Must of dreamt it. Its that good of a place... \nI am sooo not a mission dyke or a mission hipster or a mission anything. I just live there. I don't understand skinny jeans but Im over making fun of people that wear them.  So, in defense of the skinny jean wearing (what did that rude guy call them, whipsters?) whatevers, the staff is actually really cool.  And when you don't follow a businesses rules like no cell phone use, then you're in the wrong whether you're talking to the f-ing pope or your grandma.  I love fayes. the selection is great, the coffee is decent and cheap and despite the rude hipster book cover, the staff is badass in my opinion. Knowledgeable and direct. Hit them up on Monday or Wednesday if you are low on cash for their 2-fers and discounted rentals. They also have supported the AIDS LifeCycle with free movies for our fundraiser AND donate free movies to different organizations and people for fundraising purposes and the like, from what I hear. Need I say more?", "author": "Liztastic C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-21", "description": "Fantastic selection of movies, always funny sandwich board text, cheap cup of coffee or ice tea, cookies for a quick sugar fix, and lenient late fee policy. Locally and independently owned, very reasonable prices, and did I mention the fantastic selection of movies?\n\nThey still have a lot of VHS tapes, and some older movies they only carry in that format. That's a drag, and I hope they have the capital to change that soon.", "author": "Holly A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-14", "description": "Hands down the BEST iced coffee in San Francisco. Super smooth and chocolaty, without even a hint of bitterness or burnt flavor. I prefer it to the other SF heavy hitters: Blue Bottle, Four Barrel, etc.  Oh and the movies are great too.", "author": "Macheeks .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-08", "description": "Five minutes ago I got the knack for a pretty rare documentary. I looked up local video stores, and, lucky me, I found Faye's video was only a block away.\n\nI was blown away to find that they had the documentary I was looking for. And I got a free rental for it being Wednesday. And the coffee is indeed pretty good. Awesome.", "author": "Joshua S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-07", "description": "Where can you go to get really good coffee and really good movies at the same time? Where do you think? Faye's!\n\nHighlights: \n1)Two-movies-for-the-price-of-one on Wednesdays\n2) they're awfully nice about reducing late fees when you are upfront about it \n3) Good selection of documentaries, classics and TV shows\n\nNow go get your movies and your coffee.", "author": "Joanna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-08", "description": "LOVE this place! Friendly and helpful people.  They really saved my bacon when I needed to rent a video for my daughter's high school class--couldn't stream it, couldn't rent it in time on amazon or netflix....This is why we need small businesses in our community.  And they gave me a free cup of tea for signing up.  Thanks!", "author": "Kathy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-17", "description": "Monday is $2 Rental Night!  \n\nSo I picked up:\nVolver\nMa Vie En Rose\nLes Poupees Russes\n(Can you tell that I like foreign films?)\n\nMy friends recommended this charming place to me today and I love it!  Great selection of movies.  Staff was sweet and helpful.  I can't believe that they open at 7am on the weekdays.  Also, Wednesday is 2 for 1 nite.\n\nIf this place were closer to me, I would be a frequent renter and forgo Netflix.  But since it isn't and I have to look for parking, minus one star.\n\nHasta pronto, Faye's!", "author": "michelle s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-12", "description": "The video gurus at Faye's usually see me on Sunday afternoons following long Saturday nights looking like who-knows-what. They have never judged me (even when I rented 'The Holiday' to help sooth a bruised heart). Come to think of it that is how the folks at Bi-Rite also usually see me. Hmmm, is there a theme in my life? \n\nI totally love this little place. They may not have the biggest selection, but I usually find something I like and it seems to me that they always have the 'New Releases' so I can't complain. Plus, I think you get your 20th rental free. That day was like Christmas in May for me...a totally unexpected little present. The staff is really nice too. \n\nIf that doesn't do it then go here just to build up good karma for supporting a local business. I don't think you will be sorry.", "author": "Zoe s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-01", "description": "Update: These folks have been lovely and maybe both me and the clerk from my last review were having bad days.  Upgrade to 5 stars - nice people, good selection, good hours. It's the only video store for me.\n*****\nVery good selection, especially the documentaries and foreign films.  But the staff is a little rude - they kind of seem annoyed when you ask for help finding a movie.  That's not weird to do in a video store, is it?  I wish they were nicer, but I do love having a good independent video store nearby, so I'll keep going.", "author": "Kaye K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-19", "description": "This place is as good as ever. When I wrote the first review I hadn't yet tried their coffee. It's good. Plus the staff is super nice. I have really great 3 minute conversations with the cute baristas.This is the only place in the Mission that really feels neighborhoody. I can sit on their bench out front. Read my newspaper, and occasionally glance over at all the bridge and tunnel trash eating at Delfina. It's a welcome distraction when I'm waiting on my laundry next door. I have yet to figure out their little video riddles in a year of being a patron. I have to admit it makes me feel kind of feeble minded.", "author": "Joshua T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-13", "description": "Living just a few blocks from Le Video, I thought I'd never need to go into another movie store ever again.  But when I heard that at Fayes you could come in at 7 AM (take that, Le Hours!), order a latte and peruse the shelves, well, I just couldn't resist.  It *is* a very small space but they put the movie covers on these cards that you can flip through (so it's more like digging for music at Amoeba than anything).  And they definitely have plenty of the obscure/pretentious stuff, the discussion of which pairs excellently with your morning caffeine. (What's this, a Criterion of \"La Ronde\", Max Ophuls' sumptuously stylized merry-go-round of amor in fin-de-siecle Vienna?  Don't mind if I do.)", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-14", "description": "Faye's is kind of a small place, but I've learned by now that \"quality over quantity\" is a cliché for a reason.  The selection of movies here might even be better than the coffee they serve, which is supposed to be great.  I don't drink coffee, but I do know some caffiends (see what I did there?) who swear by it.  To keep you coming back, Faye's has some good rental deals during the week, like $2 Mondays and 2-for-1 Wednesdays.  They also carry \"The Holy Mountain,\" a 1973 Alejandro Jodorowsky film that's easily the weirdest thing I've ever seen in my life.  Check out the trailer and then go rent it.  Seriously.", "author": "Christy J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-26", "description": "Why do they allow people to smoke on their outside bench and sitting area?  \nIt's so rude...\nSitting on the bench enjoying a coffee in the fresh air.  \nTwo customers sit down with their coffee and immediately light up foul, disgusting cigarettes..  \nSo, because I despise cigarettes I have to get up and leave.  \nHey folks, cigs are nasty...really.", "author": "Nicole N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-19", "description": "i walk all the way from the haight, past at least five video stores, 2.5 miles each way, just to rent my videos from fayes.\n\nthey have a great selection of movies, delicious lattes, and the people who work there are nice even though they sometimes give me a hard time about my late fees.  it's kind of embarrassing.   \n\nbut,  isn't that how they make money - from my late fees??  i'd say i'm keeping them in business.  i'm obviously happy to do so since i keep going back - walking across town for more abuse and to pay my late fees.\n\nmaybe i'm a masochist.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-03-08", "description": "If you're looking for new releases, yeah, go somewhere else because this place is so small they probably won't have it in. But if you're looking for some really good movies that Blockbuster wouldn't even consider, then this is your place. The help looks like they're in a band together and go out back to smoke up after their shift was over. So, what a perfect crew to recommend really great movies for you!", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-16", "description": "Videomania, Awesome stamp cards, great staff, I love it here. Classic mission hangout spot", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-02", "description": "I adore Faye's. I went in there tonight to rent a movie for the first time in three years (having left and then returned to the neighborhood) and it filled me with this wonderful nostalgia. It just feels good being in there.\nIt's tiny but jampacked with great movies. Mike and Matthew are the awesomest dudes ever. \nWas super pleasantly surprised by $2 Mondays. Totally forgot about that, and tell me, who rents movies for 2 bucks anymore?", "author": "S H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-11", "description": "Excellent selection of videos, helpful staff, non-hassly sign-up.", "author": "Eamonn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-30", "description": "dear fayes,\nyou guys are so awesome. i return every movie late and you never screw me in late fees. i feel guilty cuz i don't want you to be losing money. thanks for being so cool.....\np.s. good coffee too", "author": "p. w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-10", "description": "One-of-a-kind local business that along with Lost Weekend serves the neighborhood well when you've decided that that documentary you got from Netflix about licking psychedelic toads may not be the best date fodder.", "author": "Kai H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-19", "description": "Love this place. Very neighborly and helpful staff. Their coffee kicks butt and beats the cr.p out of the Mr. Espresso they serve across the way at an overpriced bakery francaise. Oh, and they have a great selection of dvds and videos.", "author": "T O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-17", "description": "Best coffee in the neighborhood. the bench out front is a perfect spot to watch the world go by. Movie selection is great. Faye's has it all!", "author": "hank W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-15", "description": "Faye's is the mom and pop shop where I used to rent my videos but now I get my coffee (since I hardly rent movies). They participate in local activities and really bring the neighborhood together. Every year they host a cutest dog contest and offer free coffee drinks on their anniversary. The daily sandwhich board message will lure you in where the friendly staff will strike up a fun conversation and then you can hang out on the sidewalk bench and get to know your neighbors. Try the ice coffee!", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-11", "description": "Aside form their killer movie selection, Faye's makes great coffee and has a bench to sit  on outside where you can sip on your cappuccino, look accross the street and laugh at all the people waiting in line at Tartine.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-11", "description": "Awesome. Great espresso, great service. Really cool folks with a pretty good video selection and they give doggies treats to four legged customers. What's not to like?", "author": "Andy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-24", "description": "faye's is the bomb. super chill place, super cool staff, totally random that it even it exists but that is why it is so wonderful. the coffee is actually good, the barista remembers what you like, and they have this knack for playing exactly what i want to hear. and just loud enough, too. i go to faye's at all hours of the day, and it always feels the same. there is usually someone getting coffee, someone looking at movies, and someone lounging outside on the bench. that ratio, plus the occassional dog, seems to be its status quo. which is welcome relief from the block & a half line forming outside tartine across the street. what faye's lacks for in pastries they make up for in kick ass movies. which are better for you anyways.\n\nPS: do you ever have places that you love so much that you want to re-review them? possibly everyday? faye's is that place to me. i think it is my most absolute favoritist thing about my life in san francisco. i keep on trying to give up coffee, but i could never give up on faye's.", "author": "julia r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-21", "description": "First, it is a small independently owned non blockbuster video rental store.  I could leave it at that but... I'm not going to.  The people who work there are super nice and the fact that they have coffee all the time is even better.  The little cards you fill out (to keep track of your coffee intake and then before you know it... surprise... you get a free coffee) are awesome and creative.  They are reasonable people and even though sometimes they may not have every movie you might want to see they definitely have something you will want to watch.  The sign out front is always clever and I definitely look for it as I walk by.  So, if you don't already go there.. you should...  You will be happy with the results and with the service...", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-07", "description": "The source of my imagined romances, adventures, despairs and glories: Faye's. The last life in the universe was mine when I rented it. The history of violence I learned from this store. Everything was illuminated when at last I pulled back the painted veil (and saw who painted it) and saw what happened to Kerouac and who killed the electric car and more. The store - and the unique, lovely characters that run it  - has got obscure things and all, even though the store's small and if it don't have it, they'll order it for ya, like when I wanted to see the life of emile zola. Saw golden lotus then hot fuzz. Saw the departed after all the buzz. I saw poor rich Marie Antoinette bereft of her passion but from lovers and parties who hadn't a ration of food for the poor, and here we are we're at the same point once more, such an imbalance between wealth and poverty, I saw how they manufacture consent a documentary bout Chomsky, whose life and his work have such ubiquity, its not hard to apply his theories to the fog of war or how Murdoch outfoxed us all, Enron's rise and fall. By god this is getting insane, might as well try your luck like the man who was the only one to survive from a plane \"intacto\", he lived, he went on to play Russian roulette in the desert in some club - and when it mattered most when the bullets were flying, he lived but for love. He had something to live for and for that he survived, like the Korean flick Old Boy, a guy 16 years in prison deprived. All else died, which may not be so bad in its quicker manner like a suicide club, that weird Japanese film. Take Jean Luc Goddard. Death is slow, love kills. It is as slow as one is breathless, you can't breathe while you are one the lamb and nor could he, he just ran out of breath when the cruel and uncaring journalist lent him to those who would do him in, for she was bereft of feeling and he ran out of stamina. It was sad, but much worse would occur with Goddard: much worse, damn it. Contempt. When takes no care of his woman and she falls out of love and then goes, like what Jimmy Stewart looking out of Hitchcock's rear window. In these flicks some woman always go under, like the spartans in that movie 300. That shit was cool; if I could think of a way to go, it'd be fighting ghouls. And remember it all I do, no matter how life can be unkind, I'll never wish for the fait of eternal sunlight of the spotless mind. \n\nAnd if you're too tired to finish hoop dreams all the way through, it's OK, they serve coffee too.", "author": "Max F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-06", "description": "Thanks for getting Witchfinder General in!!!!!!!!!! and all the other horror films we love so much or couldn't find at other stores. Just in time for Halloween too!", "author": "Jenny V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-02-25", "description": "C'mon, don't give the assholes at Blockbuster your money.  Faye's has most movies worth watching, and you'll feel like a Mission hipster when you shop there.", "author": "Joe R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-27", "description": "Until I visited Faye's, I hadn't seen coffee for $1 since before I was drinking it. It's good coffee, too, and it feels good supporting a lil neighborhood place like this that has an awesome video collection and isn't blockbuster or starbucks.", "author": "Alyssa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-16", "description": "Coffee is good. Movies are good. People are good. The three together equal an exponentially greater neighborhood place.", "author": "Geryon R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-24", "description": "What?  A video store AND espresso bar??  I've walked by this place a million times since I first moved into the city about 2.5 years ago.  It wasn't until my recent move back into the city that I decided to try Faye's coffee.  They serve pretty good, no frills coffee here.  $1.50 for a cup of coffee - I can't complain!  They also do steamers with hazelnut upon request for $1.75, regular size and Chai for 2 bucks or so.  I've cut back on splurging on $4 cups of coffee as of recent, so Faye's is the perfect place to feel guilt-free dropping cash on a cup of caffeinated goodness.  I have a feeling I'll be a frequent visitor as it's on my way to work in the morning.  I'd probably rent movies here too if I wasn't already a netflix subscriber and avid online movie/tv watcher.", "author": "Lynda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-14", "description": "I couldn't be happier that I finally tried Faye's. I had been braving the lines for mediocre coffee at Tartine or Dolores Park cafe before trying here. The coffee is excellent, there's never a wait and they're really nice to boot. Made my mornings worlds better!", "author": "Julia W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-09", "description": "I find it hilarious that all of my favorite Mission video stores are owned by musicians. In this case Matt Star of Track Star and Calling All Monsters fame. I'm a Netflix slut and for the most part I'm off the coffee so the only time I make it in here is when I'm tagging along with someone else.  The only thing more intriguing than the coffee \"bar\"/video store would be it Faye's doubled as a Medical Marijuana dispensary.", "author": "Mingus R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-26", "description": "it's a very small space, but they do have a good selection of movies that you won't easily find at blockbuster...\nbut it's probably better to know of a movie you want to watch and come and ask if they have it, cus just browsing can take a long time... and then the store starts crowding up and you just need to get out cus you get too claustrophobic....", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-22", "description": "We LOVE Faye's!! It isn't huge, so if you want a bigger store with more selection (and presumably more than one copy/movie), go to Lost Weekend. But Faye's usually has what we want, and always leads to wonderful discoveries. The staff are totally nice & helpful -- we always take their recommendations to heart. And, hello, espresso bar! So so good. Their baked goods are also heavenly -- the five-layered brownie is, to be sure, cardiac arrest waiting to happen, but oh my GOD it's to die for!!!", "author": "Rebecca F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-07", "description": "It's great to still have an old school video store nearby. And the guys that run it are very cool, local business people. Although it is still tough to work within the dying framework of late charges and nightly fees, they are very flexible and forgiving when you really screw up and leave a video in your car for two weeks. Great coffee and amazing music while you browse. I've discovered several new bands by looking for a Sunday night flick to go with my burrito.", "author": "H. Joseph E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-06", "description": "The beauty of small, locally-run businesses is revealed in Faye's. The movie selection is great, even for such a small space and if you have a request they'll get it to you as quick as they are able. Their coffee is also fantastic and everyone who works there is pretty much a hottie.", "author": "Conor C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-26", "description": "Videos and coffee is a brilliant combination, and there's no bigger affirmation than winning the guess-the-theme-of-the-videos-in-this-group contest.", "author": "Geronimo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-01", "description": "Best cup of coffee on the block. Take that Tartine!", "author": "kathryn s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-13", "description": "best little video rental place... awesome owners - great selection.  they'll get stuff they don't have, and serves excellent coffee!\n\na real video store, no blockbusters but real film.", "author": "Erika Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-07", "description": "This review is for their late night coffee service! After walking around the neighborhood from cafe to cafe looking for a place that still served espresso after 9pm I ventured into Fayes and was served up and awesome soy mocha. Thanks for serving 'em late keep up the great coffee!", "author": "A D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-28", "description": "Brilliance. The selection is great and the fact that they serve good coffee till 10:30pm is amazing. Now if they could just start serving breakfast tacos it would be heaven.", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-26", "description": "I don't know about \"best coffee ever\", it's decent\n\nI do like that they rent videos haha", "author": "xo x."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-22", "description": "THE best place to me in the City, to get great expresso.\n\nThey also are always quite generous in their servings as well.\n\nSkip Tartine's across the street for coffee, only go there for their baked goods.\n\nI always try and go to Faye's for my coffee fix.", "author": "jayne a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-29", "description": "Good coffee, super friendly service, just overall positive vibes. As a Netflix die hard, won't be renting here, but will be back for coffee.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-15", "description": "a neighborhood classic, these guys are great.  come for the movies, linger for the coffee and treats, hang about for the conversation, come back for the sense of community.\n\nseriously, i moved out of this stretch of the mission years ago, and still maintain an active faye's membership for those sad weeekends when i forget to drop my netflix in the mail.  in truth, i only joined netflix because after i left faye's, no other video store could compare.  \n\nit's not some giant chain rental palace, with 10,000 copies of darknight, so if you want this month's blockbuster on a friday night, you might be disappointed.  on the other hand, if you're looking for anything indie, foreign or local, you will be pleasantly surprised with your options.  and if you must, go back for darknight on tuesday night.", "author": "kaye C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-27", "description": "short version: GOOD COFFEE, COOL OWNERS, SMART CINEMA SELECTION, GREAT SERVICE\n\nmy ode to faye's\n\nI don't really rent very many movies here. I would just watch Moulin Rouge and Big Lebowski again if I did. I mainly go here for the coffee, but the best thing about Faye's is and always has been through two sets of owners- the guys that own and run it and their fabulous smart service-oriented staff. They are all just genuinely nice people. I've been going here since they were Faye's Groceries (before Bi-Rite, directly across from them had become trendy Bi-Rite, back when it was no-competition-at-all skank frozen food yukky store). Back  then Scott and Cliff owned Faye's. I had just moved into the neighborhood and they always made me feel welcomed in their store. When they left they sold it to two of their employees Matt and Mike who are also good people, smart fellows who will get your smartypants art history jokes, let you know their real opinion about a film pick while getting your espresso made and grabbing your dvd off the shelf.\n\nI go there most mornings for my coffee which generally means I'm not awake and I feel a little vulnerable. Sometimes maybe alot- if I broke up with someone or something awful has happened the crying's still on my face, even if nothing happened my idonwanna morningface is on my face. No matter- They are ALWAYS good to squinka, polite about boyfriend changes, noting, but no judging. \n\nThrough all my time in this neighborhood, Faye's owners and all their employees have been and continue to be the best balance of efficient and nice, friendly and not-too-in-yo-bidness that I've seen. If you insist on waiting in line at the enemy-of-timeliness across the street known as Tartine or if you give up on the line there- cross the street and at least get your coffee at Faye's. Their employees won't ignore you and talk to each other or look right through you while they're contemplating nothingness; they'll actually make your coffee and then take your money and give you your change. WOW. It's good to know that still happens somewhere, huh?\n\nSo why such a long review? Well I'm a chatty girl. And I'm thinking of moving in the summer, still in the city, but to another neighborhood. And I realized I had pangs of sadness. followed by fear. and then terror. WHERE will I get my coffee? Who will be smart enough to know that boyfriend #2 is not quite ready to hear you say anything that even infers there was boyfriend #1 and still not be surprised when they both come in and get along? Who will let me pretend that I am the voice of the ceramic racoon on the shelf and giggle at my raconteur-ship? These people raised me up from a neighborhood newbie to a sardonic slick chickie.\n\nWHO WILL GET MY COFFEE RIGHT AWAY? \n\nwaaaaaahhhhhhh.\n\njust go there. I'll be ok.", "author": "Squinka C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-30", "description": "while rushing down the street one afternoon (after a VERY impromptu dolores park nap which caused the rushing) in desperate need for espresso, STAT, a friend and i stumbled upon this little gem. it was rather quiet inside, but that was fine with us - we got hot, perfect shots of espresso quickly and went on our merry way down the street...", "author": "Elle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-25", "description": "i'm not sure why i haven't reviewed fayes before ...... but faye's is the best. 'nough said.", "author": "Sole A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-11", "description": "fayes saves my life.  i live two doors down.  the coffee is way better than tartin's.  video selection is ok, but if you're smart you go for the peeps and the coffee.", "author": "Daniel H."}
