{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "My favorite neighborhood sushi spot!  When I lived 4 blocks from here I would order delivery every week (in my defense it was 4 blocks uphill...)  The sushi is fantastic, the prices are reasonable, and the staff members are so sweet. One time I ordered pickup and arrived a little early, and they served me free green tea while I waited. On multiple occasions they included a free miso soup with my delivery if I ordered for two!  Fish N Gari is on busy Polk Street but is a little tucked away in the hustle and bustle. Once you have it, you'll be back.\n\nI HIGHLY recommend the honey walnut prawn roll, but it's all great!", "author": "Michaela S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-08", "description": "I debated between 2 and 3 and had to go with 2. This place gets an ok for service and it's food portions.\n\nI came for lunch and had the three item bento - chicken katsu, sashimi, and tempura. It was served with miso soup and a salad.\n\nThe miso soup was lacking so much miso paste that it was pretty clear even when stirred.\n\nThe salad was old and had a strange taste of onions even though there weren't any present. The lettuce lacked a crunch and some of the pieces were semi frozen and had an associated weird texture.\n\nThe tempura was a good portion but I didn't like seeing the shrimp vein present when I bit into it. \n\nThe sashimi has four small pieces but was fine.\n\nThe chicken katsu was very small and thin. My wife would have like it because it was crunchy, but I preferred more chicken.\n\nThe waitress was nice and the service was prompt. In and out for lunch in under 30 minutes.", "author": "Tran C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "Love this neighborhood sushi spot! \n\nI have been coming to fish n gari since they opened, and have always been greeted with friendly service and good sushi. It is definitely a very warm atmosphere. \n\nMy favorite items are definitely the rolls (the dragon roll, snow beauty roll). Sushi and sashimi are fresh. Compared to the other sushi restaurants in the area, this one is my favorite in taste and price.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-27", "description": "Everything always comes full circle I guess.\n\nI used to order from here a lot before I discovered the deliciousness that is UberEats (though that customer service, ugh) and Caviar.\n\nI got the chirashi combo. Each piece of fish (12 in total) was quite sizeable-- about half an inch thick and 2 inches long. If anything, I would prefer a thinner cut so that it would be easier to chew. Very solid sizes though. The salmon was buttery but not quite salmony. The yellowtail was pretty fresh. The tuna was of the darker red variety, but definitely fresh.  Butterfish was super fatty. However-- and it's hard to put my finger on exactly what it is, but the fish just didn't appeal to me. I felt really...stuffed after? Gotta think about it.\n\nThe miso soup they threw in was pretty standard.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-13", "description": "I decided to try this place for takeout/delivery and boy, do I regret it. I was pleasantly surprised that the food arrived early. However, that's where the happiness stopped. I ordered the 3 item bento - spicy tuna roll, beef teriyaki, and tonkatsu, along with an order of agedashi tofu. It was the saddest tonkatsu and beef teriyaki I had ever seen. Thin, flat, and sad. I attributed the unappetizing presentation to the fact that it was takeout, and decided to give them the benefit of the doubt.\n\nWithin 30 min of eating half of the food, I became violently sick. It was clear that this food was the source of my sickness, and it took another couple of days before I felt better. I will never go here again.", "author": "Kristine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "\"Polk Gulch\" has been lacking for good sushi for a while now - Nara declined long, long ago. Fish N Gari is now my go-to when in the hood. (Sanraku (http://bit.ly/2npKcJk) on Jones is my 5-star \"neighborhood\" sushi.)\n\nI am giving Fish N Gari four stars not because it is one of the best in San Francisco. But as a neighborhood sushi place, it's *really* good. Always fresh.\n\nIn the 4+ years I have been going here, I have never been for dinner, only lunch. But it is a great, great deal. Their bento box lunch - $11 for two items, $13 for three - is a steal. Otherwise...\n\nI am almost always happy with their rolls and sashimi. I was disappointed with their uni once and too scared to order again. I love uni, but bad uni is BAD uni. :-|\n\nFun rolls: Romeo & Juliet Roll (avocado, eel topped with scallop in spicy sauce) and Sakura Roll (cucumber, avocado topped with tuna and yellowtail).\n\nFlirt with owner, Tom, or daytime server, Sam, for even better service (and the occasional freebie)!", "author": "Corey M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-23", "description": "** The WORST customer service in town...\n\nWe placed two takeout orders, totaling close to $50.00, from them today. When we picked up the order, the chinese female staff was rude and cold. Then we asked for tap water, not only she did not give us the time of the day, she acted like we were bothering her.\n\nThe asian guy in the kitchen was equally bad. He gave us this mean & hateful look as we sat at the table right outside on the sidewalk. \n\nThis is totally unacceptable that having spent $50.00, they gave us this sort of cold treatment after we asked for tap water.\n\nRest assure we WILL NEVER EVER give them any more business going forward.\n\nToo bad I was not able to give negative stars, otherwise I would put -5 stars.  Absolutely unbelievable BAD BAD BAD service !!!", "author": "JC I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Hands-down the best sushi spot on poll. party platter, sake Mondays, Tom the owner is super nice", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "Decent neighborhood spot, the people who work here are really nice! I wish the rolls & soup were a little more flavorful but this is a good spot to get sushi on the go. Usually quiet and simple setting which I find refreshing in the city where so much is about being trendy or obscure for no reason at all - I like supporting mom/pop type shops like this one, good if you want good fish quickly", "author": "Lily R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "Quick in and out, good quality of fish and prices.  This hole in the wall does not disappoint and adds to the great food on middle polk.  I usually go for the bento box, salmon rolls are pretty good too.", "author": "Prakhar S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "This will always me my spot to get my sushi. My whole family just love this place and they are just amazing. They are like family, my husband and I just adore coming here and watching the games and having our date night here. My brother just love every sushi they made. They are also very nice and loving. They have a very warm welcoming atmosphere. Food is always good and everyone alway does above and beyond for the best experience!", "author": "Franny A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "This is a nice sushi restaurant. They also have a decent selection other Japanese menu items. Customer service is friendly and food is served quickly. Based on my previous visits, I really enjoyed their food. I really like their Agedashi Tofu.  It was lightly fried. The Tofu was tasty. Their sushi rolls are good. I also liked their Oyako Donburi. Their prices are very reasonable. The restaurant is small, so it can become crowded very quickly.", "author": "Hiroshi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Great lunch spot, their 2 option bento for $10.95 is solid and they don't skimp on portion either...and it's quite easy to find parking around weekday lunch hours too...", "author": "Louise K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Fish and Gari is a small little hole in the wall of a restaurant. Nestled amongst several dining options on Polk Street, you might not notice it right away but it is one of my neighborhood favorites for Japanese food. I have to walk a little farther to get here, but it is worth the effort. \n\nI mostly come here for the sashimi, but there is something about the riceless sushi that keeps me coming back. Instead of rice or seaweed, they use thinly sliced cucumber to roll the fish in. It has such a great flavor, refreshing and not heavy at all. Perfect for low carb lunches. I brought my mom in for lunch and she was pretty impressed with the cucumber wrapped roll as well. \n\nThey often have butterfish (escolar) which is one of my favorite fish to eat. Sometimes I will order an extra side of that, because it is so rich. The sashimi is often thickly cut, very fresh and filling. I better wrap this up because I am now craving sushi!!", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Looking for a good sushi place? This is the perfect spot! The food was exceptionally good and the waitresses were really nice. I would recommend getting the Hamachi Kama. Surprisingly, the portion was bigger than I thought. Ocean Breeze, Honey Walnut Prawn, and Lion King was AMAZING!! I am definitely going to come back and recommend others to come here.", "author": "You Key G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-08", "description": "My overall experience was disappointing. I ordered two rolls and honestly the portions were pretty small. I should have gotten a bento box, that's what most people I saw ordered anyways. The taste of the rolls itself was ok. The thing that really frustrated me was the lack of attention to their customers. They never came by to fill my water or tea (just something I noticed). Also, when my friend and I were finished with our meal, we waited for a while before trying to wave them down. My table was pretty close to the counter where all the workers were congregated. They were too fixated with chatting with each other or on their phones to notice me waving and saying 'excuse me'. I tried three times and without luck. Did they expect me to walk up to them to let them know I was ready to pay? I eventually gave up and my friend was able to flag down a waitress as she walked past our table. With average sushi, at subpar sizes, and inattentive waitstaff, needless to say, I won't be coming back.", "author": "Amanda T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-23", "description": "Cheap management, I wouldn't be surprised what other corners they cut besides taking pride in customer service. Especially with a health score of 75. I will never order food here again.", "author": "Corey D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "We stumbled onto Fish N Gari when our regular go-to sushi restaurant down the street was closed for renovations and were pleased with our experience. So much so that we've now made Fish N Gari our go-to sushi restaurant (our old one - Nara - did more than change their appearance, they changed their menu drastically as well as their prices). We've already decided on a few of our favorite rolls and will be back often and will share it with more friends, family, and out-of-town visitors.", "author": "Jeffrey H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-26", "description": "Highly disappointed.....I was hoping to add this place as one of my lunch spots. My food was nasty and the host was so unfriendly and rude.", "author": "Shamika A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "I've been to the restaurant a lot of times. The food and service is fantastic. I would keep on going for the food because it's really tasty and I would keep coming to eat there when I have free time. I would suggest the honey walnut shrimp to eat and the California roll to eat. It's a small place and the food comes out quick and fresh. Customer service is pretty good when it comes to the customers and they work fast.", "author": "Jacky G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "Tom the owner is a great host and really nice guy.  The fish is fresh and the service is awsome.  Highly recommend this place.", "author": "Chasen G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-11", "description": "The first couple times I ordered from them the sushi was good, the third time was a disaster. The sushi wouldn't even stay together, the rice was falling apart to the point where the whole thing spilled apart, the fish was not fresh. The miso soup tasted like salty water, and the edamame was cold and had clearly been frozen. It was disgusting, I threw it out. I'll never order from them again.\nTo make matters worse, the deliver man screamed at me, said some pretty obscene things. He was also 40 minutes late. He wouldn't come to even my apartment building door, never mind use the intercom for God's sake, so I with a 100 degree fever went down there in my pjs to pick up the food. He had left, I called to see where he was, he yelled at me again, so I stood in the freezing lobby in pajamas sniffling and shivering at that point for 20 minutes until that heinous food arrived. (At which point the food was 60 minutes late)\nI called the restaurant twice to complain and they offered no solution.\nAny business that functions like this will never ever have my business again. They should be ashamed. This was the worst dining experience of my life. \nBuy your sushi from some place else. Any place else.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "On a quiet, winter night we stumbled into this small quaint sushi restaurant. I loved it here. We ordered a 1) chicken teriyaki and hamachi maki combo 2) seafood udon and 3) ocean breeze roll. The fish was fresh and soft in your mouth. The udon is a great order! Had alot of fish and shrimp. The dressing on the salad was not watery. It was a good experience.", "author": "Shannon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Solid, fresh sushi at good prices. Friendly neighborhood spot. The owners are super nice. Free green tea when dining in or waiting for a pickup order. The honey walnut prawn roll is yummy! Good takeout spot or dine in for cheap and casual weekday night. :)", "author": "KJ G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-16", "description": "If you like soft rice come here. The  dragon roll I ordered had the softest rice. The roll was falling apart and could not eat it with chopsticks . Is soft rice their secret ?", "author": "P H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "Great local sushi restaurant on Polk Street, great fresh fish and amazing service. They are very accommodating. I do take out and always happy. It is small so take out is great and very quick! Must try! Happy to have them in my hood :)", "author": "Susan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "We got a wide range of food and I'm so glad we did because it was all delicious:\n- tempura udon\n- ume and shiso roll\n- tuna poke\n- sashimi plate\n\nI loved EVERYTHING!!! So so so good. Everything was well made and fresh, and it was all affordable too.\n\nThe service was great too - our tea and water cups were constantly being refilled.\n\nDefinitely recommend this place to everyone who likes sushi!", "author": "Mio W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-09", "description": "I've ordered sushi delivery from here at least a dozen times in the past year, and normally have been satisfied with the quality of the food and speed of the delivery. Tonight, the same guy who always delivers, scolds me saying that \"my company only delivers 1 mile away, you're 2.3 miles away and that's too far\" while reaking of cigarettes. Dude, you've done this trip before. What's the problem this time? Don't know what changed, but ill find a new sushi spot... bye", "author": "Miles C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Great local spot with fresh fish and really nice staff! Some of the rolls can be heavy on added sauces, so keep that in mind if you are looking for more fish-focused rolls.", "author": "Kaitlin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "Love this place. Its a mom and pop sushi restaurant. I ordered the lunch 3 piece bento box with tuna nigiri, spicy tuna roll and the tekka maki. It comes with soup, rice and salad. Love the sushi here.", "author": "Mandy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "It's probably a stretch just based on food but I'm bumping Fish N Gari up because the folks here are just absolutely lovely and the prices are really reasonable too. Yes there are a couple of little issues but this really does feel like a mom and pop kinda place. Literally. \n\nThe lunch specials are great deals here. The sushi lunch with a California roll and an assortment of five nigiri clocks in just under $8. The fish is fresh and the crab salad in the roll isn't overdressed with mayo. Overall a satisfying sushi lunch on the cheap that is hard to beat. The bento boxes are pretty decent too. I got mine with mixed tempura, tonkatsu, and sashimi. It's a pretty large lunch adding in the rice, salad, and miso soup. the 3-item combo at lunch will run you just $10.95. The tempura and tonkatsu were fried nicely and not too greasy. The sashimi was fresh too. \n\nMy one ding is that while the food is decent, there are little corners cut here and there like the dipping sauces tasting diluted. It's a pity because the folks in this family-run restaurant are really nice such that I'll give them the benefit of the doubt and come back to this intimate little sushi joint.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-09", "description": "I can't speak for the service inside the restaurant but DO NOT ORDER DELIVERY FROM THIS RESTAURANT! I live a few blocks away from the restaurant and the delivery guy first rang the doorbell nonstop until I got to the door (I live on the 3rd Floor). Then he demanded his tip before he gave the food, then complained that it wasn't at least 10% of the total! You're a delivery guy who went a few blocks, not a waiter who served us the food to get a 15% tip! Not to mention, the food was TERRIBLE. The beef teriyaki was extremely chewy that I had to spit it out and the sushi was puny! The flavorless sashimi in the bento box was about 1\" thin squares and the rolls were even smaller in diameter. The miso soup tasted like salt water. Avoid this place at all costs! We chose this place to try because it was cheaper than some of the other Jap restaurants in the area. Never again, you get what you pay for with an added rude a$$ delivery guy.", "author": "S L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-29", "description": "I ordered delivery from this place a few times and the food is decent. However, this time around, it's more than an hour and 45 minutes and I'm still waiting for my food. It's pretty infuriating. I called them twice and the response is always \"the food is on the way\" but that was more than an hour ago. If you're looking for timely food delivery, skip this joint.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-30", "description": "I ordered from Eat24 to have this delivered to my place right before I flew out of town a couple weeks ago. I am taking away a star because it should not take 90 minutes for delivery service of a few rolls of sushi, especially when it's close from where you live. \n\nHowever, the sushi that we did receive was decent quality. If I were in a rush for food delivery I would not order from here, but can see myself going here in person in the future.", "author": "Tracy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "Pretty good food and great price. Saki special, buy one get one for a $1!!!  Had the Bento Box which gives you a good variety of delicious food and comes with salad and rice. I would def come back to this place, but mostly for the cheap price of food and saki special.", "author": "Jks J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-09", "description": "Very rude service here! We called in an order for delivery, waited 2 hours for our food and it never came. They said it was cuz we werent at the door when they came by (which they never specified for us to do when we ordered) which is weird because we specifically wrote down to call us when the food was here. How were we suppose to know when our food came. They expect us to be waiting outside for over an hour? We were busy studying for our next exam!\n\nThey wouldnt even listen to us and instead went so far as to scold us and yell  at us that we werent taking delivery food seriously??? what??? Owner, please train the delivery guy to call whoever ordered so we know to go out and pick up the food.. And dont yell us the customer for your workers incompetence.\n\nSo rude!", "author": "Betty L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-30", "description": "Just place my first order here for delivery. So disappointed I had to write a review after 2 bites. The delivery was sloppy, the salmon was a dinky slice of fish, the salad was soggy as hell and my chicken was sitting in the salad do I had chicken drenched in dressing. Terrible first order! See pic", "author": "Lucky N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "I really like this place! So surprised because of the mixed reviews. On a particularly low key night, I decided to stop in and grab a bite to eat. I got a seat by the window, perfect for 1. I ordered a beer, and the 3 item dinner bento of sashimi, california roll and spicy salmon roll. Honestly, the spicy salmon was a bit too spicy for me so I decided not to eat it. Everything else was great. The bento came with rice, salad and miso soup (not the best I've tasted). Total for everything was under $19. I've been back a few times now and enjoyed a few of their more special rolls. I will continue coming back!", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-22", "description": "Small family run sushi restaurant.\n\nThe staff are nice and very friendly.\n\nThe sushi and teriyaki salmon were ok, but not remarkable.\n\nAvoid the gyoza, it was deep fried instead of pan fried and was nothing like gyoza should be.", "author": "David T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "Looks like a lot of the low ratings here are because of the delivery. I can't speak on that since I live down the street from this place, so I've always done pickup. \nOverall solid place. Obviously don't expect amazing food here but for the price you pay, you get your worth.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "Great service, small space, cheap sake-- buy one get one free! \n\nThis is the place to eat sushi and booze up with your homies. The prices were reasonable and the sushi was good for the price. Don't come here if you're expecting nobu level food, this is a very college-y dining experience which is great for those who are just looking for a casual lunch or dinner! Whatever dressing they put on their salad is delicious, I would bottle that stuff up and take it home with me. They also have plenty of options for bento boxes if you're craving for more than sushi! \n\n+ they take reservations", "author": "Erica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "Ordered delivery via Yelp Eat Street. We ordered\nSashimi Chef's Choice\nHamachi Maki\nSaba Nigiri\nEdamame\nAmaebi Nigiri\n\nFood was delivered within 30 mins, which is totally beyond our expectation of the estimated delivery time of 45 mins.  \n\nThe sashimi and sushi is fresh. Will definitely order from them again!", "author": "Brenda W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "This is my go to lunch place. More like a 3.7 i wouldn't take a date here but for neighborhood sushi they are decent. \n\nFish always fresh, miso is consistent and I believe they use real crabmeat for their CA roll unlike the place across the street from them.", "author": "Miguel Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-29", "description": "For real, tho. We ordered for delivery based on the mad 5-star action. Lies I tell you. Lies.\n\nWe got screwed.\n\nWorst sushi I've ever had.\n\nAvocado maki is basic, right? Buttttt, they even effed that up. Tiniest sliver of avocado I've ever seen, stuffed into a giant roll of rice. Um, if I wanted that much rice, I'd have ordered a side of rice. I asked for scallions in the roll. Denied. I also asked for spicy mayo. The roll was dry:/\n\nI also ordered the veggie roll. So disappointing. Some of the veggies tasted raw-ish. So gross:(\n\nThe edamame I ordered smelled like it'd been boiled in fish sauce. Inedible. Wtf, major abomination for a vegetarian. \n\nTo top things off, the poor delivery guy didn't understand how to use the intercom. My husband had to go downstairs to pick our food up. Half-*** delivery.\n\nOur search for an epic sushi delivery spot continues. Help me.", "author": "Gabriela W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-06", "description": "Good lunch specials.  Only complaint is that their sashimi is cut kind of thin\n\nLady with glasses who serves is not friendly \n\nDon't get the sushi. Not to San Fran standards.", "author": "Sebastian R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "This place has the best 49ners roll in the city.  Something to do with the rice I think!  \n\nI used to live around the corner from this spot and would call in for a pick up whenever I was too lazy to cook for my self.   So, I became a regular.  Even though I never sat down and ate there, the staff remembered me, my go to order and would come out side to give me my check since I would also take my dog for a walk a lot of times prior to ordering.  \n\nI can't say enough good things about this place.  I highly recommend!", "author": "Jenn V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-02", "description": "I've had two bad experiences with this place. The first one was mediocre food, but annoying issues on delivery. The delivery driver was on the wrong street, but correct address and kept insisting he was at the right building when he was a block up, while we waited in the cold for 10-15 minutes while he realized Oh! Wait, I am at the wrong building. When we received the food, it was okay. The Lazy Summer roll was creative, and had a nice taste. The rest were all smooshed into one takeout container so nothing was really distinct. \n\nMost recent bad experience was another delivery order, with delivery and food issues, once again. I ordered a bento combo, and every item of it was absolutely terrible. On top of the food quality being extremely poor, everything was ice cold. My meal started off with ice cold miso soup, dry cold rice, and was followed by ice cold tonkatsu and teriyaki beef. Some food I don't mind a little cold, but the teriyaki beef literally felt like it had come out of the refrigerator, and there was fat between the slices that was so cold it was in sheets. Definitely not fresh, and I believe its the precooked beef for the udon that just has teriyaki sauce thrown on it.\n\nThe delivery driver didn't call me, and instead somehow got into my building and rang my doorbell, late. If my suspicious are correct, he didn't have a phone, and waited outside until someone from my building let him in, which led to the extremely cold....everything. \n\nUnfortunately extremely disappointing on the takeout end, compared to all these good reviews about eating in.", "author": "Rayna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "Staff was friendly, fish portions were fresh and generous, and location was ideal for a night out on Polk. It's fast, cheap sushi - what more do you want?\n\nHighly recommend if you're craving rolls in the neighborhood, but don't want to shell out money at Ryoko's or Sanraku.", "author": "Aileen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Came here for dinner with the family. Good sushi, udon and teriyaki. Small place, not busy. Good for kids. Not sure why the bad reviews. We had a good experience.", "author": "Greg W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-24", "description": "This is the most amazing sushi place I've ever been to. Great waitress??  Lynn is the best server I've  ever met, and I've been to a lot of restaurants. Sushi? Amazing. Sashimi? Amazing. Tom, the owner? Amazing! I will never go to any other restraint.\n\nTom owns the place to be!", "author": "Logan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Solid option if you're craving a bento. Have been here twice so far (lunch and dinner). I have only ordered a 3 combo with the following menu items: california roll, hamachi maki, beef teriyaki, tonkatsu. Really happy with the quality and happy that the beef teriyaki was not dry and was not soaked in teriyaki sauce. The tokatsu was perfectly fried with just the right amount of sauce. It's about $11 for lunch and $14 for dinner.", "author": "Lauren K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-29", "description": "I ordered delivery from them and it didn't show up until almost 2 hours later. I'm not even sure if I should eat the sushi or not since it may have turned bad already.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "Great food! Very warm and welcoming waitresses and cooks. Service is superb and always ensuring that my wife and myself is well served. Prices is very reasonable and stands out as very good quality sushi. My\nFavorite is the blow fish Sushi and I love that they are always experimenting desert and new items. They really care about making sure the food taste good and have quality service.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-17", "description": "I rarely post negative reviews or any at all but how can this place have more then 1 star???? It's disgusting. I had to kill an hour waiting for my appointment and since my fav sushi spot closed I yelped and this came up\n\nNo pros. Like zero\n\nCons are : screwed up my order. Twice. As a house salad they give a bunch of leaves with soy sauce and oil.  What happened to miso dressing and you know maybe a cucumber for $6.00\n\nAvocado was dark in the only roll I ordered. \n\nThere was a smell of chlorine coming from the kitchen ( I didn't feel it at first )\n\nChef offered me a bunch of cut peaches to make up for his mistakes and poor quality and I politely refused explaining I am allergic ( which I am ) and he just rolled his eyes at me. \n\nWow... \nDo not go here. Ever.  For anything. I am far from a negative drama queen but this was baaaad", "author": "Masha M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-24", "description": "SUPER SLOW SERVICE. I don't understand how a simple order for to go could take 30 minutes. I would understand if they were busy but they only had a few customers.", "author": "Dianne P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "My friend and I were hungry one day, walking down Polk, and decided to pop in. Usually, *surprise sushi* is a recipe for disaster. More often than not, you get Safeway-fridge quality sushi, overfilled with rice and avocado, and somehow still manages to burn a hole in your wallet. Because San Francisco, or whatever. \n\nBut, all hail the food fairy, we were in for a great surprise. Great prices, friendly service, quality sushi. AND they deliver. We've had sushi from Fish N Gari a number of times now, both eat in and ordered, and I am so happy with the food.\n\nI highly recommend the Snow Beauty.", "author": "Stella T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-17", "description": "Good sushi place on Polk. Very attentive service. Fresh sushi, prices not too bad.", "author": "Peter K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-10", "description": "Came with Pia C. on a whim.\n\nBYOB! no corkage fee.\n\n+Ocean Breeze\n+R0meo and Juliet\n+Seaweed Salad", "author": "Sangita A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "This place is a gem. Always a pleasure coming here. Great fresh sushi and great service.", "author": "Jon E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-23", "description": "Great prices, good service and the sashimi was on point. \n\nFor any new restaurant I go to I have a specific dish I try to gauge the tastiness and quality of food there. This may be a flawed system, but it works for me. At sushi restaurants I always try their sashimi during my first visit.\n\nFish N Gari's sashimi was solid. I ordered the Sashimi Chef Deluxe (18 pcs) and was very happy with most of the fish on the plate. \n\nMy girlfriend and I also got the agedashi tofu appetizer - awesome! Lots of tofu and the tempura coating was perfectly crisp.\n\nThe prices were great and our waitress was very attentive. Solid 4 stars all-around.", "author": "Win R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-06", "description": "I like 99% of sushi, but this just tasted like it wasn't fresh, and the flavors were disappointing. Perhaps I just got a bad batch, but I'll be steering clear of here in the future. 2 stars because the prices were decent", "author": "Andy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "My boyfriend and I have visited this place three times now. This place is really quaint and intimate. Nice little date spot or spot to go with friends. We're quite fond of the menu as it has some really yummy choices. I recommend the Lazy Sunday in conjunction with some other rice rolls. The Lazy Sunday is wrapped in cucumber instead of rice and sits in a bed of light sauce. Really refreshing!", "author": "Tamara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "I think the food is great. I've gone multiple times and have found it to be high quality and their staff is friendly. I recommend it. It's one of the best sushi spots in the area.", "author": "Max C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "BUY ONE GET ONE SAKE or BEER!!!\n\nI repeat,\n\nBUY ONE GET ONE SAKE or BEER!!!\n\n\nok. moving on...\n\n\nFresh sushi, decent prices, quick service. Glad to have you in my hood Fish n Gari! \n\nI'd definitely stick with sushi rather than their other entree options here, though.\n\nI've yet to try their delivery, but it seems to be a popular option as the delivery guy runs in and out a lot during my visits there.", "author": "Alexis P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-04", "description": "Love this place! My go-to delivery for the Russian Hill/Nob Hill area. Delivery is quick and easy and the food is always great!", "author": "Kaci B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "Love this spot!! Cute, cozy, and quiet. :) The cold sake is great and the Red Dragon roll was perfect.", "author": "Nadine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Sushi is always good and at a good price. The gyoza is delicious and crispy.  I love that they deliver for free and have a friendly staff.", "author": "Kara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-31", "description": "After half a year and over a dozen visits to Fish N Gari, I have still only good things to say about this place. I brought picky friends on more than one occasion, one of which was a birthday celebration - each and every time, all were thrilled about the food and service, even if they weren't big sushi eaters. Oh, and they were in good health after eating here, too.\n\nAside from the Bento Box lunch special (mixed Tempura! Katsu! Gyoza! Sashimi!), the Walnut Shrimp rolls that other reviewers have mentioned are amazing indeed, as are the other house rolls. The Miso soup is tasty, the $9 Sake (\"Pure\" brand) is an amazing value for money and your tea will be refilled continuously.\n\nThe staff goes beyond the call of duty constantly. Even if we sometimes hop in minutes before they close, they still treat us with respect and don't rush us out of the door. One day when the place was actually closed already, a customer peeked in and still got some food at the bar. Not unusual to be treated to Edamame, a free roll, sliced oranges or new compositions the chef wants to try out as candidates for the regular menu.\n\nA word on those one star reviews: I find it interesting how many come from reviewers who only have a handful of reviews tops and those are often one star reviews with a random five star mixed in. Or note how the reviewers don't have any filled-out profile or Yelp friends. Hmm. Interesting. Business is cut-throat in the city, but that cut-throat?", "author": "Roland A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Never actually been in the store,  i usually order delivery. The host that usually answers the phobe is sweet, plus a few times they delivered to me even though they were closed! Food is fresh,  i usually get the Dragon Roll or Nigiri deluxe!", "author": "La Mont D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "Great restaurant. Vivian is a a great waitress. She's not there anymore but their food is still great.", "author": "Rachel X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "Fish n Gari has quality sushi. I ordered the shrimp tempura roll with avocado along with the salmon nigiri and egg nigiri. Everything was fresh and well prepared. The owner and waitress were very nice and accommodating and they played nice music in the restaurant as well. Be aware, it's a very small place, so it can get crowded at times, but it's pretty open on most week nights", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-25", "description": "The value is real here. $14 for 3 items bento box for dinner?! Sign me up! The options are pretty good too. I got the sashimi and the white albacore on that was fresh and super delish. The spicy tuna roll was worthy contender as well. The teriyaki was dry and I don't think I will get it again. Both the salmon one and the chicken. The service was impeccable and I will definitely return. Heck at this price I will even be a regular.", "author": "Trisha H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-21", "description": "Let me start by saying I am not a sushi snob or aficionado. Basically, I know (what I consider to be) \"good\" or \"bad\" sushi. I think Fish N Gari falls into the (very) good category. \n\nI came her with a couple friends who live in the neighborhood and seemed to know this place pretty well. It was empty when we walked in (it's a pretty tiny place) & the guy who was helping us (I'm assuming he was the owner) was very friendly. Honestly, I'm pretty open to anything when it comes to sushi so I let my dining companions do the ordering. \n\nWe started with gyoza, which I really liked. It was a little on the crispy side, which is how I like it. We also ordered a cucumber salad, which was, well...a cucumber salad (it's hard to mess that one up). We didn't even order edamame, but they brought it to us anyway just for the heck of it. I also don't know if it's because we ordered quite a bit of nigri & sushi, but they also randomly brought us a some sort of tuna dish. It was kind of like tataki, but was more cooked. It was yummy. \n\nAll of the nigri we ordered was good, and tasted fresh. The rolls we ordered included the Dragon roll, which I LOVED (eel +tempura + avocado is a delicious combination). We also did a Snow Beauty roll, which I really liked. I wasn't too familiar with butter fish, but I really liked it (we also had butter fish nigri). My favorite of the three rolls though was the Ocean Breeze. It tasted fresh and yummy!\n\nWe also sipped on unfiltered sake, which you can't go wrong with all. \n\nAll in all, this a great little neighborhood spot, which I would come back to. \n\nOoh...I should also mention they pretty fun music! While we were in there I heard some Journey & Heart! Can't go wrong there!", "author": "George A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "Small place.  Very good service and food.\nDid not have red wine by the glass night I was there.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "I had my birthday here and it was so fun. We reserved the entire restaurant for 32 people and the staff was so kind and amicable. It was a pretty tight squeeze, but we made it work. Small restaurant, very intimate and nice atmosphere. Great 2-for-1 beer specials. Great for groups since you don't have to pay to rent the space and they are just so sweet and friendly.", "author": "Tessa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "I have been here a number of times and loved it every time.  Seaweed salad, cucumber salad and all the veggie rolls are delicious.  My son really likes the sashimi, too.  Everything is fresh and arrives quickly and the price is good for what you get.  I highly recommend Fish N Gari.", "author": "Bess M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-21", "description": "I came here for lunch, so I opted to get the bento box. It was pretty standard. I chose to get the California rolls and salmon teriyaki. The California rolls were a pretty good size, but there was quite a bit of rice on them. The salmon was good. But the miso soup seemed like it was the instant kind.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "great hole in the wall place!  Really good sushi and Bent boxes", "author": "Drac W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "i'm usually hesitant to try inexpensive sushi restaurants. more often than not, i find myself biting into half-frozen sashimi - or worse, fish that tastes like the bottom of a trash can. i'd rather eat day-old filet-o-fish. but i was hungry. and it was close. so i took my chances. \n\nwe started with the AGEDASHI TOFU. its coating was light and perfectly crisp, yet it still retained that slightly chewy consistency reminiscent of little tokyo. and the broth was flavorful without being overwhelmingly salty. my tastebuds did a happy dance. \n\nsurprisingly, the sashimi was just as delightful. the boy and i shared the SASHIMI DELUXE and an order of UNI NIGIRI. the sashimi slices were a bit smaller than average, but the platter was still a great deal ($25 for 18 pieces!!!). overall, the fish was fresh, and i didn't leave regretting my decision to eat $1.50 sushi.", "author": "Emily B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "Delivered pretty quick on a Friday night. We ordered the Rock N Roll, Salmon Skin Roll, Spider Roll, and Rainbow Roll, and got a California roll for free!  So delicious! And arranged so efficiently in one box. Will definitely be ordering from here again.", "author": "Erik G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "I come here all the time, awesome food and service while being reasonably priced.\n\nI would definitely try the beef teriyaki is my personal favorite and they have buy one get one free sake.", "author": "Faheem B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "Excellent sushi! We order a lot and it's always high quality. Prices seem to be fair as well. Overall, an excellent place. \n\nThe only thing that keeps this from being a 5 star is their horrible online ordering tool. Beware, there is a good chance they will never get the order. I highly recommend calling them and placing the order.\n\nAgain, excellent sushi, fair prices and nice people.", "author": "scott o."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-09", "description": "So we've ordered delivery from here a few times now, and it's never been as fresh and fast as it was the very first time. The freshness and quality varies each time, although it's still usually quite good. We did have one delivery order, however, that tasted so fishy (in a bad way) that we were worried that it wasn't good anymore. Our large order went mostly uneaten. I wish the seafood was a little more uniform every time we order. With that being said, I still think they have a great selection of rolls and that everything is reasonably priced.", "author": "Regina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-20", "description": "We ordered delivery for dinner - some sushi and a bento box. The order took a while to arrive (about an hour an fifteen minutes). The main problem was that there was a hair in the bento box rice, so we tossed that in the trash. Sushi was just ok. Prices are on the lower side compared to other places, and that seems to be reflected in the quality of the food. In San Francisco, you tend to get what you pay for, right? Don't think we deserved the hair though.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "Not a bad sushi place.  Nice and cozy.  Went there because our favorite Sushi Rock were shut down. \n\nLimited menu but very good quality sushi.  Fresh sashimi.  Fresh uni.\n\nWaitress service needs a little polishing.  Otherwise sushi chefs are great.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "I love this restaurant! The food is great and the owner Thomas is the best! You can tell he's really passionate about his menu and is always coming up with new menu items. I always come here for the 3 item bento box for lunch or sashimi when I want something light. The price is extremely reasonable and portions are always generous. I will always come here for my sushi fix as long as Thomas is there to make it for me.", "author": "Mae L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "This place is the BOMB!! Buy one get one FREE Sapporo???Can't go wrong with that!!! Bring it on!!! The waitresses were such greats hosts and shout out to Alex and Fan for the free rolls. They were DELICIOUS!! Amazing service and food with reasonable prices. Would definitely recommend the Lion King Roll( Baked salmon with California roll inside. Yes! They literally baked the roll for 15 min) OMG I still can't get enough of it!! I would be back Fish N Gari!!!\n\nTip: they seem to be extremely busy when it comes to deliveries so I recommend calling before ordering so you would know ahead of time the delivery time.", "author": "Yu Hou L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "Best service I've had in years. Great great, owner and chef make sure to take care of you. Shout out to dj Tom and chef Jeff for being amazing. Not to mention the service is great, fish is quality and I will definitely be back!\n#winning #sakebombs #Polaroid #newyears", "author": "Pete S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-01", "description": "One star knocked off for an over two hour wait for delivery.  They do not include utensils with delivery.\n\nTaking a closer look at other reviews, their rating is clearly inflated by a large number of overenthusiastic five star reviews from one review users for what is mediocre food.  Nobody who has eaten their fair share of sushi could possibly declare this to be \"...the most amazing sushi place...\" with a straight face.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "Im a regular here because I always order delivery on Eat24. I usually get their 3-items bento for $13.95 w/o tax. It comes with rice, salad, and miso with your 3 item choices. I think it's cheaper than most sushi delivery on Eat24 and they give pretty good portions. I usually choose pork gyoza (not as juicy but crispy/good enough), 4 piece sashimi (4 diff types of raw fish and pretty fresh compared to the other sushi delivery I had at Eat24), and saba shioyaki (grilled mackerel.. mMm! Looks small but because its flavorful, so for me it's good enough to add to being full). Other choices that I tried are their sake maki roll (raw salmon is fresh!), chicken teriyaki is pretty good but their salmon teriyaki is better (portion of salmon is a little small, but I think thats the average size of all salmon teriyaki's). Chicken katsu is not bad.. average. The only thing that I dislike is their miso soup.. sucks lol. Don't ever order their miso.. it taste like old sake or something. Oh yeah their tuna poke is superrr bomb here! Best by far but it's a little expensive compared to other tuna poke on Eat24 delivery, $9.95 w/o tax and portion is a little small for the price. Other than that Im pretty sold on everything else :)", "author": "Sharmaine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "This place is very good.  I want to state that for qulity fish and a GOOD price this is a very good deal.  Yes, if your looking for $100 sushi meal this isn't for you.  If you looking to eat good tasting and quality fish and not pay top dollar then you won't be disappointed.    \n\nThe owner, Tommy, is a regular 'man about town'! have a drink with him and talk.  He is a real personality and understands service and restaurateuring.\n\nI fish all over the world and go here about twice a week when i'm staying at my apt around the corner!", "author": "Marc D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-07", "description": "Hearty portions, good prices and great service. I love their bento boxes esp the beef terriyaki is amazingly tender and actually medium rare..I usually have leftovers to take home from the 3 portion bento meal as they are pretty generous and flexible with those that want salad substituted for the rice. \nTheir chicken udon is also perfect to warm a chilly SF day. Tom, the owner is super friendly and helpful. Overall a great dining experience!", "author": "Juliana L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-01", "description": "Bad seafood, bone in Salmon sashimi. Decently okay service but does not make up for the sub-quality fish.", "author": "Ran M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-29", "description": "I don't enjoy leaving less-than-positive reviews, but I want to save my fellow diners from the experience I had. Fish N Gari's sushi rolls are actually quite tasty, but I cannot support this business. I ordered delivery through eat24 on a Wednesday night (doesn't seem like a night that should be too busy). Our food was not delivered until nearly THREE HOURS later. The restaurant was officially closed by the time we finally got our food at 10:30 pm. While the Fish N Gari staff were apologetic, that was the extent of their customer service. They didn't offer to give us a discount next time, or see if there was anything else they could do - Nothing! That's just not a good way to run business in my opinion.\n\nOrder Eat24 delivery from Live Bistro sushi, it's just as tasty and you will actually get your food at a reasonable time.", "author": "Anna J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-26", "description": "I have tried Fish N Gari quite a few times since they've opened, and unfortunately the quality seems to be slipping up. My recent visit will probably be my last, I arrived with a friend around lunchtime and found that a majority of the tables were empty but had not been cleared. \n\nWe were seated at a dirty table which got cleaned in front of us, and I keep thinking about how I am about to eat raw fish in the same spot.  Maybe it was a bad day altogether, the miso soup was basically hot water in a bowl, and I was really nervous to eat my sashimi.\n\nThe food:  Affordable lunch bento, sashimi cuts have been hit and miss\n\nThe atmosphere: Petite sushi bar, only about 7 tables inside. TV in the back so at least you can watch the World Cup.\n\nTry: Lion King Roll\n\nSkip: Gyoza", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-01", "description": "Decent neighborhood sushi place but don't go any time near closing.  Never have I had the check delivered at the same time as my meal and asked if I have signed the bill before I was done eating.  Obviously closing the restaurant is more a priority than good customer service.", "author": "Darlene S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-20", "description": "My wife and I were stopped by Fish N Gari for dinner on a Saturday evening.\n\nIt looked like SantaCon wrapped up just about then, and several of the restaurant's patrons looked to have participated thoroughly in the festivities.  Now, sushi wouldn't be my first choice of food post heavy drinking, but to each their own, I suppose.  Needless to say, this small/narrow restaurant was really loud with our special guests, but the volume decreased to normal levels once the Santas departed.  Despite the volume, we actually enjoyed their company. \n\nFood-wise, we ordered a few dishes:\nTuna Tataki:  We thought that this was OK overall.  Nothing special here.\n\nDynamite Roll:  I thought this was excellent.  It was severed nice and warm. \n\nOcean Breeze:  Another really good roll.  Very tasty\n\nTea, with refills, was provided free, which was nice.\n\nOK overall", "author": "Sebastian N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "We LOVE Fish N Gari. We live nearby, and it's delicious sushi delivered and served by the nicest staff. We typically order online, but went in last night a bit late (after online ordering had closed) and were treated to two extra miso soups with our take-away from the lovely staff, even though we hadn't ordered anything particularly fancy. \n\nThe eat-in service is great too - small but intimate and the service is quick and very friendly. They are always happy to deliver. Great prices for very tasty sushi! \n\nThe Screaming Roll is awesome.", "author": "Alexandra M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-09", "description": "We walked out before we could even order. The menus were horribly stained, covered in a brown, smelly liquid and the place couldn't have been more filthy. On top of that, they came over for our order 2x before even giving us menus and we're very pushy/unfriendly. Hard pass.", "author": "Dominic N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "Make friends with tom. He's the owner and the man. Literally the most welcoming and kind hearted hosts I've had the pleasure to get to know. The food is also affordable and extremely good quality. One of my favorite hidden gems on Polk!", "author": "Katie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-13", "description": "This place is one of my favorites!!\n\nPros\n- Great tea (I don't know what it is, but it's delicious)\n- Great service\n- Good quality sushi\n- Really cheap prices (~$10 for a bento box, basic rolls around $3-4)\n- They use Mogl (gives you 10% back to either keep or donate to SF Food Bank)\n\nCons\n- It's not fancy. Not a hole in the wall either, but I wouldn't bring someone on a date here. Definitely good spot for a quick lunch or dinner!", "author": "Trisha Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-12", "description": "food is not impressive   Too pricy and their sever doesn't even know the menu!   Paid 40 bucks and not even half full... Please avoid this fake Japanese restaurant opened by Chinese", "author": "Jamie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-07", "description": "Now before you wince at me for giving five stars to a small neighborhood sushi that doesn't score high in the snobby sushi circles, let me explain my math:\n\n3.5 stars for the food: The food here is OKAY. The sushi won't blow your mind, and the cuts of fish won't be the best cuts in the world. That said, the food is prepared fresh and you can taste the freshness in every bite. The rolls are full of meat and seem very rich in content--very pleased with all the rolls we ordered. The nigiri was great and didn't have the texture problems that other reviewers mentioned. Alas, the miso soup was pretty bad, and we couldn't tell if this was the leftover stuff or some alternative soup they offer.\n\n5 stars for the service: The owner, Tom, is very humble and friendly. He personally served us even after the shop's closing hours (the greatest plus in customer service IMO) and even gave us free miso soup samples.\n\n5 stars for hours, location and delivery: A neighborhood sushi joint that offers free delivery until 10pm automatically receives a hat's off from me. I work till late and having this little store to take care of my pathetic dinner schedule is a Godsend.\n\nSo there. Stop judging. Visit this mom-and-Tom shop and and see for yourself!\n\n---\n\nDistinguishing factor: Fresh, ultra-rich sushi that's served with a smile in a neighborhood setting. They also embrace Yelp's ordering feature. Click click yum.", "author": "Nick A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "One of the best take out/casual sushi places that I've been to in the city.  The people that work there are ADORABLE and we're so nice when we came in.  They gave us an extra edamame and the food was ready on time! The sashimi was delicious (butterfish INCLUDED!).  The seaweed salad was a massive portion. I tried one of the rolls (not sure which one-had eel and avocado) and the tuna poke as well.  Definitely going to be our go-to take out sushi place on Polk!", "author": "Raina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "Review for dine-in: fast and courteous service, and good portions!  I ordered chirashi which had about 11 pieces of fish, and my dining companion got the bento box which was quite big.  Fish tastes fresh.  The place was surprisingly busy for a weeknight, nearly every table full.", "author": "Sona P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-21", "description": "Definitely surprised this place has so many positive reviews. The sushi is just ok yet very overpriced. This is just your typical quick stop to get some cheap sushi with low expectations. The problem is the prices reflect a much nicer experience.\n\nOn a separate note I would advise to never get this delivered. The last time I did it took 1.5 hours. They begged me to take the food and offered 20% off but the food was obviously made much earlier so was a mistake on my part for agreeing to pay. \n\nWith the amount of sushi places in SF, I'd say try your luck anywhere else.", "author": "Faiz H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "Love this place! Live in the neighborhood & eat here all the time. Everyone is so nice, service always warm and friendly and the food is great. My boyfriend is vegetarian & there is always options for him.", "author": "Kahele C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "The Best Sushi Place Ever!!!! Staff was really nice!!! LOVE THIS PLACE AND WILL EAT HERE AGAIN! I would recommend the Lion King Roll!! it was so Delicious!! \nAnd the Tempura Udon is a recommend dish too!!", "author": "Payton L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-24", "description": "Service is 3 star, while food presentation and taste are 2 stars.\nThe waitress is very attentive, probably because we were the only table.\nWe ordered a tobiko fried rice, hamachi kama + katsu bento and teriyaki beef. Definitely tasted more like chinese food than japanese. The katsu was thin like paper. The presentation for the teriyaki beef was unappetizing, and thin like paper again.\nWith the competitions next door, we don't think this restaurant can survive too long.\nWe don't think we would come back.", "author": "w m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-25", "description": "The fish was pretty mediocre.  The sashimi and nigiri weren't very fresh and the spider roll was about as bland as a spider roll can get.  Additionally, I had to wait for an hour and 25 minutes for them to deliver (it was supposed to be 45 to 60 minutes).  The upside is that it wasn't too expensive.  But, then again, you get what you pay for.", "author": "Walter E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-05", "description": "Really really bad. Never again. I order some sashimi - it was fresh, but from pretty poor cuts of fish (kind of stringy). But that's ok, I can deal with that.\n\nWhat prompted the one star is what I got when I ordered the uni.\n\nTwo pieces of uni nigiri were served, and something seemed immediately off. The uni was dark brown instead of bright yellow, and didn't look fresh. That prompted a closer look... and brace yourselves for this... I peeled back the top layer of not so fresh uni, and below it... was what can only be accurately described as pinkish - brown slime. That's right. The sushi chef had put uni that was so old it had changed colour and turned to slime, and tried to cover it up with old uni. It was so disgusting I wanted to vomit. Let's paint the picture a bit more clearly. When I tried to lift up the uni that was on the bottom, there were tendrils that clung onto the rice. Kind of like when you try to lift up a slice of pizza - that thing the cheese does. Except it's not pizza. It's not cheese. It's pink slime uni.\n\nThere's NO WAY a sushi chef does not know about this. I think the fact that they tried to serve this says a lot about how they do business, and about what you can expect if you eat here. No wonder this place is always empty. Don't trust the good reviews. This place is just awful.", "author": "Leo G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-20", "description": "Was hoping for the best for this neighborhood place, but frankly it's not worth the health risk to eat here.  There doesn't seem to be much of an issue with the land-dwelling proteins (katsu don was passable, if gristle-y), but we ordered some hamachi nigiri that came out GREY and OPAQUE.\n\nDidn't bother rolling the food safety dice with that one, and you would probably be happier doing the same.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-27", "description": "AVOID this place. It is terrible! How I wish I could give this place \"0 stars\".. Ordered with them via Eat24  $60 worth of food. The food didn't come in 2.5  hours, when the estimated delivery time was 45 min! After numerous attempts of contacting Eat24 and them contacting the restaurant, they keep saying that the driver was 10 minutes away for another 45 minutes!! Bunch of liars! I live 6 blocks away. Honestly?! When the food finally arrived everything was cold, soggy, and every single roll looked like it was made by my toddler. Nothing but that cucumber taste in absolutely everything. Very poor quality cuts of fish. Never again!", "author": "Laurie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "Great, friendly sushi spot! Servers are incredibly nice. One of the best spots in the neighborhood!", "author": "Nelson E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Fast delivery and good sushi at a very reasonable price. If you are dining in, be aware that there is limited seating, but is still a good little neighborhood spot.", "author": "Jena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "I love this place! My bf and I always get this when we want to eat in sushi and watch a movie. It's not gourmet sushi but I think it's pretty good- and for the price, it's excellent! We always do a bento box each and share all the different things we get :) Great, solid local take-out sushi joint.", "author": "Caroline R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-08", "description": "I want sushi... in my mouth... all the time. This is an amazing new Sushi joint for Polk Street sushi addicts like myself.  There are countless mediocre / gross (sushi rock, which is terrible) sushi restaurants in Russian / Nob Hill, and only a few excellent ones.  I'm glad I randomly found this place shortly after it opened a few months ago because it is REALLY GOOD! Inexpensive too! The staff is great and friendly.  Yeah that sounds generic, and I wouldn't normally say all that stuff... but they really are.  Good stuff.  P.S. Ask for the tea, it's hot, and it's free!", "author": "Dallas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "This place has never disappointed. Back in SF after 7 months in NYC and it's our first stop on our trip (after Bob's).", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-29", "description": "I've visited many times, both as part of a group and for takeout. They are very friendly, if you come in to pick up and there might be a wait they often give you a cup of tea and, if the late might be particularly long, a little dish of edamame. The prices are not bad, the fish is fresh, and they tolerate large groups of students. That's as good as it gets.", "author": "Nicole N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "I think there sushi is actually really good for the price and place. Obviously not a high end sushi restaurant but it's a good takeaway place that has yummy sushi :)", "author": "Marina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-03", "description": "Yes! After trying Nara I tried this place as well! More upscale,\"designer\" rolls and of course a bit more money per. Fresh fish for sure and the display is wonderful! Just look at the  pictures some folk posted! I will definitively go back. This is more of a couples kind of environment than my last review and worth the  extra money. The staff is worthy of the tips and all around this place is refreshingly relaxing and a bit more traditionally Japanese in presentation.I highly recommend!", "author": "Brian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "Objectively speaking, this is a 3.5 star deal, but it gets 4 stars from me because it more or less conformed to my expectations. I was just in it for the lunch bento, so I have no idea what kind of sushi magic they are liable to perform at night. \n\nThe thing with negative reviews is that they are usually a reflection of the disparity between the expected and the actual - i.e. if you are expecting a 2-star hole in the wall and you are pleasantly surprised, that hole in the wall becomes a 5-star hole in the wall...but if you were expecting the next \"it\"-thing, a culinary revelation hidden away behind the backwalls of some urine-soaked alley - you may end up sorely disappointed and petulantly hock a 1 star at an otherwise healthy 3-star establishment! Better reviewers will attempt to account for this in some way or another, so...reader beware, I guess. \n\nBy the way, even though this is Polk street and all, it's north of California..in the case of this particular wall-hole, the urine and other assorted bodily fluids won't be (as much of) a problem. \n\nI had their 3-item bento lunch, which was about $12 with the tax - on the mid-cheap end of things, this being April of '14 and all that. A sunny day, a little outdoor table, friendly staff, credit cards accepted...not a bad deal, atmosphere-wise. The miso tasted a little bland and watery, but I wasn't expecting a good miso and frankly that has little to no bearing on the rating. Crispy tempura, decent salmon rolls, golden-fried gyoza...all satisfactory, nothing mindblowing, but this is what you ought to expect the moment you peek inside the establishment - tells the story pretty well, I'd say. \n\nSince the original misdirected post (I confused this with Nara just down the street), I have returned here once again, and was not disappointed! Salmon teriyaki was tasty, not sure about the average size of such things around town but I can't imagine theirs would be on the small side like another reviewer stated. (Where does one get a solid, large-sized salmon teriyaki bento, I wonder?) \n\nGood neighborhood bento spot, if nothing else. Would probably dine here if given the opportunity.", "author": "Manfred D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-25", "description": "Well-prepared fresh sushi at reasonable prices. The quality of the fish is much better than what I've had at some of the other Russian Hill/Nob Hill sushi spots.  Friendly service- they even offered us a dish on the house!", "author": "Ashley P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-28", "description": "A new sushi joint on Polk Street with friendly and enthusiastic staff. Unfortunately, they don't know anything about fish or rice. The chef was very enthusiastic about the Tai. I asked him if it was \"true tai\" and he replied, \"it's from New Zealand!\". I then asked him if it was madai (aka \"true tai\"), and he replied, \"it's from New Zealand! Very good!\". OK... I then asked him if it was kodai (New Zealand Snapper), and he replied, \"it's from New Zealand!\".\n\nI sighed and ordered some tai, hamachi, and salmon nigiri. The fish all looked nice and tasted good. However, there was no wasabi underneath the fish, and the rice appeared to be unseasoned (no awase-zu). The rice appeared to be normal white rice like you'd use with katsu-don.\n\nIf you don't know what I'm talking about, you probably won't care. If you do know, you realize that these people have absolutely no idea how to prepare sushi.\n\nI'm not going back.", "author": "Da Wei S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-25", "description": "Rolled in here on their second day open, and I've got to say that this is a pretty solid lunch place for this section of Polk. I'm really happy that it replaced the old Chinese joint that was here, and the interior decor is a massive upgrade compared to what was previously there. \n\nI had a bento box with sashimi, chicken katsu, and vegetable tempura. All were really good (especially the chicken katsu) in light of what it cost and in comparison to the Japanese place a block away.\n\nIt's not a 5 star best-in-SF place, but it's very good and a welcome addition to the area.", "author": "Richard H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-18", "description": "the worst the Caterpillar roll I have eaten in my life.  I can't even finish it.\ntoo much rice, not enough unagi. unagi not good either.\nsashimi is decent.\nthe complimetary kimchi dish doesn't taste good.\ndoesn't have two choices of soy sauce (ususally reguar and low sodium)", "author": "Rina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-30", "description": "Horrible service. Ordered online and was given estimated time of 35min. 35 min passed. Then 50. Then one hour. Tried calling the restaurant at that point. Nobody picked up. One thirty. One forty five. Food did not arrive. Called again and finally a lady picked up. Said the driver left looong time ago. (We are less than Half a mile away from the place.) finally, after more than 2 hour delay, the food arrived. No sorry from them whatsoever. Rude... And to top it all,  the order was incorrect (less than we ordered). Very disappointing", "author": "Raphael K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "Easily one of the best sushi spots in town. This place competes with top NYC and LA spots not only on food but also in unparalleled service. It's very laid back but after a long day of work and making tough decisions, Fish n Gari is a breath of fresh air because I can just tell them what I like and be pleasantly surprised with what is delivered. Last time I got seaweed salad, miso soup, and a variety of eel and fresh tuna. HIGHLY RECOMMENDED.", "author": "Aaron B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Inexpensive and their spicy tuna rolls and butterfish rolls are just as good as any fancy sushi restaurants out there. Oh and if you are an Udon fan, try their beef Udon, love every single drop of the broth.", "author": "Mai T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-24", "description": "This is the most mediocre sushi place ever. Seriously. I'd been dying to try this place so I was really disappointed.The waitress was great, but our sushi was so inauthentic... Rolls were like something I'd make at home with unseasoned sushi rice. Chicken teriyaki was dry and flavorless. For sushi in the same price range around the neighborhood, I'd hit up Nara instead.", "author": "Colleen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "This place is AMAZING I would definitely know because I go there at least once a week :) it's right next to my house the sushi is fresh and incredible and Tom the owner is so creative with the dishes he prepares. Try the sushi salad ! Anyways all the wait staff is great. 5 stars for the great atmosphere great food and service !!!!!", "author": "Winnie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-22", "description": "I ordered an online delivery, and that delivery guy was drunk and an hour late. But that wasn't the worst. The worst was....he delivered the WRONG food. I ordered the Sashimi Deluxe which contains 25 pieces of sashimi but instead, they delivered Sashimi Chef's Choice which only has 12 pieces. I started to doubt the credibility of the restaurant. Really bad experience and don't recommend it...", "author": "Aijia Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-03", "description": "Easily the best takeout sushi joint in Russian Hill, given the price point.  Move aside House of Sushi, Sushi Rapture, and Wasabi Ginger.  There are fair cuts of fish in the nigiri.  The rolls are rolled/cut with care, and not drenched in sauce.  I probably would never dine in the restaurant, but I'll definitely order from them again.", "author": "Kelvin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Sushi is fresh and delicious.  Love that they take orders through Eat24.", "author": "Danielle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-29", "description": "Great fish and the people who run it are very pleasant. Feels clean and good for a lunch date/dinner with friends.", "author": "Kira G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "First time in and it was phenomenal!  Great fish at a good price and Tom was awesome.  If you are in this area this is one place you should do yourself the favor of trying.  Local chef in the area and celebrating two years in The Hill and should be here for the long run.", "author": "Bob P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-24", "description": "Fishy... Better choices in the city. 1 Star since no star ain't an option", "author": "Madhusudhan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-30", "description": "These reviews are either fake or I had a bad batch.  Of note: I love sushi.  I travel the country weekly and I briefly lived in Japan.  Must say...I am not a guy that compares all sushi to the sushi I had in Japan.  I will compare this to other US sushi.  Quality was awful. Omaha beat this our by 3 stars. Not even near the ocean. I don't say that lightly as I know family businesses can suffer, but this was not good.  I ate a few bites and tossed the rest. This was after not eating all day.  I'm not a picky eater and was starving.  I was craving sushi and should have known not to trust unknown delivery sushi.  Plus, delivery guy, although kind, had really long and filthy fingernails.  Not what you want to see touching your food.  I'd tell fellow Yelpers to think twice.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "Fantastic sushi, some of the best I have had in SF. Worth any occasion. Make sure to get the chef's signature roll.", "author": "Vince B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "Great place to get great sushi, great service and all at a great price. I've been coming here for about 7months and still haven't been disappointed. Alex is one of the best sushi chef's around this city! \n\nDon't expect a wait! It's definitely a hidden gem. Oh and they deliver for free for orders over $20.\n\nGet the crunch roll but you won't be disappointed with anything else.", "author": "Rey J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "Delicious fresh fish and friendly service. Sashimi and Snow Beauty roll were delicious, as was the hot sake. I will come back. Thank you!", "author": "Jessica A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-20", "description": "me and my coworker placed an order for delivery around 11 o'clock this morning for three California hand rolls, and two snow crab hand rolls. we received it pretty quickly so my coworker tipped the driver well. we work at a salon and were with clients at the time so we didn't have the chance to check if our food was correct.\n\n it turned out to be wrong, and we hadn't received any of what we ordered. we called to let them know that our order was messed up and we would definitely like our corrected order. not too much to ask right? that's how it seemed they felt at first, too.\n\n while waiting for our order they called again. they said that we needed to return 2 out of the 5 orders we had received.  we proceeded to tell her that, in fact, none of what we got was the correct order and after checking their own receipts, they realized we were correct. they then told us that the food they had already delivered would need to be returned. even after sitting out for over an hour. who does that? not that i expected to keep the food, but Ive never been asked to return a wrong order before. especially through delivery. \n\nafter waiting another hour for our correct order it still hadn't arrived. we call to inquire when it will be here and we were told 5 to ten minutes. about 25 minutes later we call again, and are told the same thing. after another 15 minutes our order shows up. we didn't even have a chance to eat as our lunch break is only an hour long, if that get that that is our problem but still. \n\nnot to mention we both ordered a snow crab hand roll for about $8 each and they had BARELY any crab meat in it compared to their regular California hand roll. two bites in and there was no crab left. the California hand roll was very good, but not enough to be ordering from this place again. \n\nand hopefully no one else got the sushi they had us return that sat out for over an hour.", "author": "Savannah B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-01", "description": "Over 2 hours later and still no sign of food. Called to check on our order and was met with their voicemail. When I ordered here before, udon and sushi were decent, but definitely not worth over a 2 hour wait.  Looks like its time to order a pizza..", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "Service was absolutely amazing! We had 5 different rolls.. they were all fresh and delicious! Especially their honey walnut roll. This is now our go-to sushi spot!", "author": "Morgan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-11", "description": "Average stuff. We got bento boxes and some maki, with the maki being the better options. Prep quality varies - my shrimp tempura was just a big tennis racquet of batter. There are better options in this ultra-competitive restaurant city.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-07", "description": "One of the best sushi place that I have been to.Fresh food and very nice waitress.Definitely should give a try!!", "author": "Noah W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-22", "description": "Ordered delivery- didn't get utensils or soy sauce and there was a bone in the roll. Would not recommend for delivery EVER", "author": "Nicole P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "Service is always great, food is high quality. Love the ambiance. It is not nearly as loud as other Japanese spots in the area with all the drunks. Highly recommend this place\n\nUpdate. 1 year later. \n\nMy review still stands. Service and food have been consistent.  Still a repeat customer and would still recommend this place over all the other places.", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-24", "description": "The delivery was an hour late, however the delivery guy was really nice. They messed up the order, but agreed to reimburst 50% of the total bill, after delivering the missing part promptly! The food was good!", "author": "Aleksandra G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "I've only ever had the sushi - it is very tasty and simple. Not someplace I would go looking for a fancy experience, but great for a drop in dinner in the neighborhood.", "author": "Rita C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-21", "description": "Food is very good and the owner is a really nice guy who tries really hard to make sure his customers have a great experience.  Volcano roll is amazing!", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "his place is AMAZING!! Its a little hole in the wall place, easy to miss but I am so glad we went in. The fish is incredibly fresh and reasonably priced. The service was great as well. I will absolutely be going back!", "author": "Cassen U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "I come here regularly and have never been disappointed. Wonderful neighborhood spot. They always have great service, restaurant is rarely crowded, and takeout is very speedy. 49ers roll is excellent.", "author": "Ann B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-26", "description": "Christmas Eve - The food is still great! Complimentary kimchi and fruit to top and tail the meal, Ocean Breeze roll was delicious, and the fresh nigiri (hamachi and aji) was excellent. The sushi chef personally came to our table to ask what else we would like, the server Sharon was attentive and extremely knowledgeable, the decor was perfect - like green tea or wasabi wall color. Cool! Good job FnG and please stick around!!", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Very friendly staff.  Server told us right after we ordered that there would be a longer wait due to to-go orders but it felt like normal wait time.  She came by a few times to apologize and check on us.  Also brought comp edamame and sake for waiting.  Will definitely come back.", "author": "Irene C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "This place has by far the freshest fish of the 4-5 sushi restaurants in the neighborhood. \nTheir special menu actually changes depending on what is fresh that day (as opposed to Nara where the specials have been the same for 2 years).  They could use a little work on the rice; it could have some more vinegar flavor, but super fresh fish is the most important imo. Staff is very welcoming and attentive and in the three times I have been there, they have given me a free small appetizer - usually some seared fish with garnishes.  \n\nIn short - if you want super fresh fish, this is the place to go.  If you want to saki bombs and eat borderline inedible fish, go to Sushi Rock.  In between, Nara.", "author": "Easton C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-15", "description": "I've definitely experienced better. Very small amount of food for a very big price! 2 itty-bitty slices of salmon with two leafs on the side...no rice no miso..FOR $8.99! California Fried Rolls hand rolled tasted delicious BUT they only gave me 2! wtf? Check the price yourself. Def not worth it. Not ordering from here again.", "author": "Mary A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-07", "description": "This place is great! Super fresh fish and the owner, Tom, is friendly and very customer service oriented. Very happy to see a new sushi bar on polk street that isn't trying to be a big corporate chain.", "author": "Gregory G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-04", "description": "I had violent food poisoning for a full 24 hours after eating here. Nothing would stay in my system, not even water. Please be safe and consider other sushi options in the area.", "author": "Ali G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "This place is great, not too expensive, and good quality sushi.. the chef is chinese but he really knows what he's doing. The owner is really friendly and will definitely provide good service.\n\nThe rolls are presented very nicely, and very creative I would say.. great place to go on a friday night I'd say.", "author": "Howard C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-01", "description": "One shouldn't order anything other than a bento box with fried things from this place.", "author": "C J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-01", "description": "Came here for my birthday and I couldn't be any happier :) the food was very good and the decorations were very interesting!  The prices were reasonable and the staff are very friendly , everything tasted fresh I will be coming back", "author": "Allison K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "I came here for dinner and I had a very good experience. The Waitress was nice and fast, the service was great, and I recommend the sashimi, which is very fresh. 5 stars!!!!!", "author": "Heather S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-29", "description": "Five stars for value. I just discovered this new Japanese restaurant on Polk Street. I love sushi but will rarely go on my own. Fish N Gari is small, friendly, and super inviting, and the sushi and prices are better than anything else in the area. Yay! A great addition to Polk St., I predict I will be eating here often.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-04", "description": "Good prices and solid basic menu.  Clean, bright with friendly servers.  I'm happy Fish N Gari has arrived to the neighborhood.", "author": "K P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-24", "description": "This place is great! Favorite roll was the dynamite roll. Our sushi chef and waitress were amazing and just so fun and welcoming. This is a new Polk street must do, so swing by.", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-15", "description": "Welcome to the neighborhood Fish N Gari, I hope this is the beginning of a long and prosperous relationship.  You'll be seeing me a lot.  I'll be grabbing a bento box and cheap sake every chance I get.  You have a TV too, awesome.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "Stopped by for Lunch Special, and I was pleasantly surprised.  The staff was friendly and attentive.  I tried the 2 item combination with tempura and spicy salmon roll. Both items were delicious.  Tempura was fried lightly, and the salmon tasted fresh.\n\nI will come back.", "author": "diana t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-07", "description": "I think this place is the better Sushi places on Polk street. Sushi Rock is a joke, and has the benefit of being on a corner and the happy hour, and at Nara sushi, the rolls just fell apart when we tried eating it because the rice was done so poorly. With that being said, I have to be pleasantly surprised with this new Sushi place. My bf and I decided to try out this place one evening. The staff are friendly. The sushi wasn't bad at all! They had some interesting sushi rolls, and we tried a few. There was only one roll with Yellow tail that didn't taste as fresh as the others, but the other ones we tried were pretty good. The cuts of tuna and salmon were done nicely. If I'm in the mood for sushi, this is my neighborhood go to spot.", "author": "Nadia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-27", "description": "Great sushi and affordable which are two words that usually don't go together when reviewing a  sushi restaurant.  I've had several of their specialty rolls and the tea- cooked fish. Chef Tom is willing to change out items to suit your preferences. The bento box gets you two items for under 10 bucks.", "author": "gregory p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "I would highly recommend this Japanese spot. I came here again Tuesday and had the shrimp tempura roll and California roll with miso soup on the side. Absolutely amazing and delicious food. Especially the service, it never disappoints me. In particular, a waiter, Bobby, provided really great customer service, and was really friendly to my colleagues and I. You will not be disappointed. This waiter made us feel comfortable and was very kind. One of my favorite restaurants by far!", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-05", "description": "The delivery service of Fish N Gari is ABSOLUTELY HORRIBLE -and- PATHETIC!!!  \n\nThis evening I placed an order delivery at 7:31PM, I was informed by one of the staff at Fish N Gari that delivery would take approximately 25-minutes ... which almost became a 2-hour ordeal!  I had to make phone call follow-ups at 8:16PM, 8:22PM, 8:44PM, 8:55PM, 9:01PM to chase down the delivery status of my order.  Each time I phoned, the owner of this restaurant kept indicating that, \"the driver was on his way, the driver was on his way\".  Well, the driver NEVER arrived, and I had to walk several blocks to this restaurant to personally pick-up my order.  It's VERY DISAPPOINTING that this restaurant makes promises, and \"can't deliver\" (no pun intended).  I would certainly think twice before ordering from this restaurant.  And if you're running on a time schedule (like I was this evening), chances are you will never receive your meal until you are forced to have to ask for it.", "author": "Joseph N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-19", "description": "Fish N Gari is a new Sushi restaurant on Polk street that offers quick and inexpensive Japanese style food.  The lunch bento box is a good deal (under $10).  Portions are small, but sufficient.  I had salmon teriyaki and a hamachi roll with miso soup, rice and salad.  Everything tasted good and was flavorful.  Service was speedy.  This isn't a place for finding artisan sushi to brag to your foodie friends about, but it is a good choice for a quick lunch.", "author": "Seth G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-20", "description": "I have been eating at Fish N Gari at least once a week for about a year and its just plain good, fast and friendly. Service is very fast most of the time and I like that its small and personal. I think its great value and the food is excellent.", "author": "Guido W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "Great neighborhood sushi restaurant. Tom is the best and will take care of you. The place has a tv at the small sushi bar if you want to catch a game. The prices are very reasonable and I've never had anything but great service.", "author": "Brandon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-18", "description": "The food was ok but the service was unacceptable.  There are only 7 tables and 3 seats at the sushi bar.  The the restaurant was not full but busy and they probably had a lot of take out orders but I never received a set of chopsticks and napkin and my beer and water took 5 minutes to get to me...and then it took over 30 minutes for me to get my meal which was only a tekka maki and gyoza.  The table that came in after me and ordered after received their food first!  I've never not tipped at a restaurant but this time I did.  I was a little embarrassed walking out but they were terrible.  I will not go back!", "author": "Shirley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "Best sushi place ever. Fish are fresh plus the employees are so welcoming. I'd come back anytime.", "author": "Kells B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-04", "description": "We are  hoping to support our new neighbors Fish n Gari as they are new to our neighborhood so my department decided to give them a try yesterday after seeing so many positive Yelp reviews.  Unfortunately, our decision ended up being a poor one because 3 out of 6 staff got sick from the food later that day.  Good news is that a 4th staff member didn't get sick.  Only  because she was smart enough to throw away her order of the spicy tuna roll.  She said that it smelled so bad and not fresh at all..trust the nose is one reasons the human race survived for millions on years.  I hope your business the best but our company will no longer be returning in the future.", "author": "K H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-25", "description": "Disappointed!  I do a lot of ordering through Grub Hub, and Fish N Gari has been my go to place for sushi the past couple of weeks.  Last night I ordered my usual and waited 10 minutes past the time for the schedule delivery to call and find out what was going on with my order.  At first the young woman who answered said, the order was about to leave, and then corrected herself and said it was already on it's way and that the driver was backed up with multiple orders.  Nearly 30 more minutes went by before i received my order.  Not only were the rolls sloppily put together, but the seaweed salad was still nearly frozen.  I called to make her aware, and while she was apologetic, nothing was done to remedy the problem.", "author": "Marcelino U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-23", "description": "I pretty much never yelp, but these guys deserve at least a bit of a review from me.\n\nThis is hands down the best sushi spot in the neighborhood. Its probably not the very best sushi I've ever had, but everything I've tried (and I usually eat here 1-2 times a week these days) is great, and the prices are incredibly affordable. There is literally nothing comparable in either quality or price without travelling to the far ends of the city.\n\nTom, the owner is very friendly and does a great job. The fish is very fresh and tasty, and all the other options are good. Gyoza just crispy enough, the tempura light and delicious.\n\nThe best deals are the Bento boxes. You get to choose either 2 or 3 items from a fairly extensive list. I usually get a mixed tempura, spicy tuna roll, and tonkatsu bento, and they all come with a small salad, rice, and Miso soup. Approx. $11-13 for all that.\n\nBonus points for fresh hot free green tea while you wait, and as many refills as you want.\n\nI prefer Fish n Gari for lunches, as it is slow, and the prices even better so service and wait times are negligible, but dinners are also good, you just might have to wait a few more minutes for your food.\n\nDon't believe the one star snobs, this place is great and worth at least a trip or two. Everyone I've brought here has been impressed and these guys really deserve a bit more business.\n\nGive em a try, and ignore the haters!", "author": "Brendan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "One of my favorite spots on the busy polk street corridor. Great for small parties and date nights. Amazing vegetarian rolls and meatless options. The owners are so sweet and welcoming; one of those places that make you feel as if each person in the joint was VIP. Make sure to see their sake list as it never disappoints. I'm a huge fan of these guys, and make the restaurant a reliable staple in my dine out neighborhood repertoire.", "author": "Nathan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "Really enjoyed Fish N Gari. We stopped by for a quick bite and were really pleased with everything we had. It was a Monday and, in the area, not many Sushi spots are open; so we decided to stop in. The service was great; very attentive and friendly. They made us feel very comfortable. When ordering sushi, our order is pretty standard and unvaried and Fish N Gari was really good and held up to most other sushi we've had in the city. Give them a try!", "author": "Joel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-27", "description": "This place is worth 5 stars for the honey walnut shrimp alone! Great local sushi place with friendly service on Polk. Well worth a visit.", "author": "guy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "Awesome honey walnut and snow beauty rolls.. We always order multiple orders! Also, the staff are always super friendly and enthusiastic. I highly recommend this place.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-02", "description": "I used to eat at Fish N Gari weekly when my daughter went to preschool in the area last year. It's an affordable and tasty sushi restaurant run by a really great guy. Thomas, the owner, made us feel at home and was always so accommodating to my two kids, aged 4 and 2. The fish is fresh, and the other food is good, too. My kids always gobbled down their udon, and I usually got a bento box. The lunch bentos are very affordable.", "author": "Jeanie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-22", "description": "Recently went to this place and had the dragon roll and nigiri (salmon, butterfish, spicy hotate) it was good and the prices reasonable so maybe they've improved since the last 1 star reviews.", "author": "N A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "Casual, friendly, by far the best sushi all up and down Polk street.  The daily specials are always great. The sushi ranges from pretty darn good to very, very good.  I don't understand the bad reviews here. I am a sushi aficionado, having sampled every level quality of sushi in SF, NY and Japan.  This is not a destination restaurant perhaps, but it is truly outstanding in Polk gulch.  It's become my go-to sushi place when I want to stick to my neighborhood.", "author": "Nancy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-05", "description": "Friendly staff, yummy rolls, and 2 blocks from my house!", "author": "Carel H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-07", "description": "This place sucks. Went there this past Saturday for dinner around 6 pm. My friend ordered the bento box with chicken katsu and beef and I also ordered the bento box with beef and chicken teriyaki. We also ordered a spicy salmon roll. We waited about 30 minutes before we got our bento boxes. The beef was burned and overcook and my chicken was cold. My friend's beef was the same as mine. The place was not busy as we were the only ones there for quite awhile. Someone ordered takeout over the phone and I think they just forgot our order and rushed it. But anyway, when we complain, the waitress and the guy who prepared our sushi didn't make us a new beef teriyaki but instead took 15% off our bill. Instead of complaining more we paid and left. What a rip-off. Avoid this place terrrible service and food. My one and only time there.", "author": "Henry C."}
