{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "I LOVE these chocolates. All the flavors are fun and delicious. I prefer the ones without nuts but try them all! There is a crunchy super thin layer. They look ugly but are truly wonderful", "author": "Nils H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "Considering how much we enjoy strolling the Castro, Jamie W. and I rarely find ourselves walking on 18th Street west of Castro Street. No particular reason. I just think people like us get used to their routines, which is my roundabout way of saying we had no idea this shop existed until we saw the sandwich board that announced free truffles inside (photo: http://bit.ly/2kBntdo). Now why would we pass up an opportunity like that? I wanted a little caffeine after dinner, so the idea of buying a $2.25 cup of coffee seemed reasonable to me for a mouthful of sweetness (photo: http://bit.ly/2kBvrD4).\n\nNow choosing which truffle turned into quite a challenge as the display case was full of all sorts of variety from peanut butter to cinnamon dark chocolate to rum coco to even vegan truffles (photo: http://bit.ly/2laYj2p). I settled on the hazelnut once which was covered in them in pulverized form (photo: http://bit.ly/2jQlahQ). Oh yes, that was certainly a pop of goodness well worth the mediocre, overheated cup of coffee I bought. Should I come back for the $33 40-piece gift box or the $45 60-piece gift box? Such decisions should be made when I'm standing on a weight scale, so I remember how ridiculous that question is.\n\nTRUFFLE - 4 stars...lovely mouthful there though the coffee needs to be thrown out\nAMBIANCE - 3 stars...just a little shop, nothing more\nSERVICE - 3 stars...oh so quiet\nTOTAL - 4 stars...another one won't kill me, right?", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "I don't know about all the five-start reviews, maybe the flavor is great. But I had horrible experience ordering online and over the phone. The website says offer delivery, but not intuitive. I called and was told the gift boxes showed online were not available and that they don't do delivery. The person told me to use some delivery app, he didn't speak English well - that's fine but not patient as well. He repeatedly said \"I'm busy\" when I was asking how to choose flavors, then he just hanged up. It was quite a bummer.", "author": "Sophie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "The truffles and hot chocolate here are to die for. The Earl Grey flavor is my favorite.", "author": "Ya-Chu C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-14", "description": "I'm a recent transplant from New York. I don't have a dog in the fight, just trying to find good truffles in San Francisco.\n\nApparently the chef here is an alum of XOX. We tried XOX, loved it, but Castro is closer to us, so decided to try them. Hard to believe he's an alum because:\n\na) the truffles at Five Star are *significantly* sweeter (I actually couldn't finish the hazelnut)\nb) not nearly as smooth\nc) no complexity to the ganache\n\nPerhaps more suited for an American palate, XOX is truly French.\n\nSo when there is someone else who does the same thing, but better, I'd say thanks but no thanks.\n\nXOX is in North Beach. I am yet to find any other good ones in the city. I tried the bon bons at Jade and Christopher Elbo. Jade doesn't know chocolate at all, plus shells are way too thick. Elbo does mostly milk, and I only do dark. I found a fantastic one in Calistoga, though: Earth & Sky. Reccomendations? Leave 'em here!", "author": "C J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "Delicious melt-in-your-mouth truffles made by an incredibly hard-working man. They're the perfect pick-me-up to help you walk up the hill, and a box makes a great host(ess) gift. The hot chocolate is also excellent. I haven't tried the other items.", "author": "Ellen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Seriously addictive, and yes five stars.\n\nI'm not one for chocolate unless it's in a mocha, and I'm a picky eater, but these truffles have me coming back for more.\n\nI originally came in to buy one truffle. I was sucked in by the newspaper article outside featuring the chef/owner.\n\nSo I thought, why not?\n\nOne banana chocolate truffle later, and I walked out with a to-go box of 14 different ones! Smooth, chocolate, great flavors, this place is the real deal.\n\nThey literally put the truffles in a Chinese to-go box after you choose your truffles. Easy no mess and convenient, but not fancy.\n\nThey have liqueur flavors, caramel, raspberry, etc.\n\nIt changes often, and they have over 20 flavors at a time.\n\nWith that many truffle choices, I'm sure I'll be making up the calories at the gym!\n\nBut, it's well worth it.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Not fancy, just fantastic.  I don't write a lot of reviews - only when I think a place is really deserving.  Five Star Truffles certainly is.\n\nI was doing a little job across the street and saw the sign and decided I needed a cup of coffee.  Ended up with coffee and chocolate, then more chocolate.  Everything was delicious and made perfectly.  This place is exactly the kind of place you would describe as a hole in the wall, and be reluctant to tell anyone else about because you would be afraid it would be discovered.\n\nThe owner is super friendly, thoughtful and considerate, and as far as I can tell does EVERYTHING himself.  He's the kind of guy who recognizes you when you come back, and remembers you.  Make sure to chat with him for a minute and you will see....\n\nIf I lived nearby I would certainly be back frequently.  I did end up getting twenty truffles for my partner -- who kindly shared some of them with me.  They did not last very long though.  Think I will need to go back, darn it.", "author": "Warty B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-30", "description": "Be careful when ordering online. First their website is not intuitive. I never received an order confirmation email. I had to keep emailing them to find out what happed to my order. They are hard to reach and the customer service is null. When they make a mistake with your order instead of being apologetic and compensative they refer you to their shipping disclosure.", "author": "Dorothy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "Got vegan truffles for Valentine's Day here. I really enjoyed them. I would definitely purchase again.", "author": "Tatjana N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Delicious coffee comes with 1 free truffle.  The coconut truffle is to die for.  Customer service is fantastic as well.  The shop is cozy and clean.", "author": "Taina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "$2.50 for coffee with soymilk (a rare steal in SF) and the most delicious truffle I've ever had holy crap. \n\nYou get a free truffle with any drink. I got the earl grey and immediately after taking a bite my taste buds were blanketed in rich creamy earl grey-y heaven. \n\nHuge variety of truffle flavors, definitely coming back.", "author": "Val Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Quick, friendly service; delicious coffee; truffle was absolutely heavenly. Exceeded expectations.", "author": "Matthew E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "Why haven't I gone here, is the question you should be asking yourself , if you are second guessing this place at all.\n I work in the neighborhood and have always passed by this place on my nightly walks on my break and said one day I will ill come in. Today was that day!\nA cold rainy afternoon, I arrived early for work and said today is the day. \n This is a chocolate lover's dream. So many varieties of truffly goodness. \n  Hot Chocolate: Divine. Amazing to name a few words, the owner Santos uses Real Chocolate, heated up some milk, foamed it up pouring it over my chocolate and then whisked it together and top with whip cream. It was so rich . Also came with a free truffle of my choice, got hazelnut and was so yummy\n\nSo yummy in fact , I brought variety of 40  to bring to work for my co-workers  and have eaten 5 already , shhh\n\nI will be back soon", "author": "Sydney P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "Now don't let the small shop fool you. I know most chocolatier shops are pretty fancy, modern cute, etc. but this shop is truly one of a kind that I have ever been to in the Bay Area. These truffles are made entirely from scratch as I've walked in when the owner was mixing up the caramel *mouth watering*. \n\nThe owner is a nice man who truly enjoys making fresh batches of chocolates each and everyday. No trans fat, hydrogenated oils or anything like Other big chocolate companies use to make their chocolate. You can't get any fresher than this. Sorry coco Bella and Godiva but these chocolates are fresher than yours. \n\nIf you want to enjoy some authentic handmade chocolates made daily you have to make a stop here when in San Francisco. This place is right around the corner from Castro street and across from Terra Mia.\n\nIf you want great tasting chocolates at a great price for San Francisco standards you have to stop by five star truffles and pick up some truffles and a hot chocolate while your at it.", "author": "Ella P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "This business has great coffee and lattes, and tasty truffles! If you buy a coffee they'll give you a free truffle. They are friendly and generous and let us socialize and always welcome new guests and tourists. Awesome community business and really nice people. :)", "author": "Robert C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-25", "description": "So apparently this place has been in my neighborhood for 4 years and I've been too dumb to stop by. I don't know why but it got on my radar (food blog?, Yelp newsletter?) and I finally had a chance to stop by.\n\nFor $13 you get a take-out box of 20 truffles plus a sample for yourself. For $17 you can get a pretty box but frankly who needs a pretty box when the truffles will disappear in no time.\n\nThe truffles here come in over 20+ flavors plus a handful of vegan flavors. They're petite sized - maybe slightly larger than a hazelnut? - I really hate gigantic chocolates. The flavors are yummy and the box makes the perfect hostess gift or party favor. Surprise someone next time with a box of truffles instead of the same old bottle of wine.\n\nThe shop is pretty no frills - not a place to hang out. But that doesn't matter when the truffles are so good and you're not likely to lounging around eating them there anyway.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "Great sized truffles, small so you can try several flavors. Big hit at Thanksgiving, served these to family before/after Thursday so we could appreciate them! Liked the owner also. I'll go back when I need a gift, several sizes available. Priced affordably.", "author": "Laura O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Pretty amazing little coffee shop we walked by just walking back to our car.  Went in for the free truffle to come with our coffee but the Five Star Mocha is very good and coupled it with the Rum Coco truffle.  Would definitely come back!", "author": "Adrian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-07", "description": "I had an extreme chocolate craving and decided to look up awesome chocolate spots in the city. I stumbled upon this one and decided to check it out. \n\nIt's in the Castro so parking was not that great, but I found that the truffles here were so affordable! They were $0.90/ truffle and we decided to do the 20 truffles for $13. It was a really great experience for me and my boyfriend who love to try out new chocolates to expand our chocolate palate. The caramels were especially rich, which I loved. \n\nI would suggest the Jim bean honey and maples, banana chocolate, espresso, and all of the liquers. We were very pleased and will definitely come again.", "author": "Lyra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Stumbled upon this gem on a rainy morning in San Francisco. I came in for the coffee but left with a box of 20 beautifully handcrafted truffles. The owner gives away a free truffle with each cup of coffee. Once we tried the first truffle, there was no way we were leaving without buying a box of 20 for $15.", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "Five Star is a breath of fresh air in the sea of fancy chocolatiers and self-important bakeries with the direly hip names. The truffles are delicious -- top marks -- with a wide variety of unique flavors. I love that the chocolates are handmade and not machine-factory cut outs. And the humble guy who runs it is so so nice -- you really want him to do well. My family is partial to the liquor flavors -- Jim Beam whiskey, amaretto, kahlua-- but all the flavors are great. But know that the goods are super fresh and preservative free -- they are refrigerated and need to be kept that way until you eat them.", "author": "Kate A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-02", "description": "There's a nifty trick here - if you order a specialty drink, they give you a free truffle. This really rules. The prices are inexpensive, especially if you go in for a drink and a little bag of treats. These are handmade truffles, displayed attractively in large mixing bowls, and I dare you to keep from thinking about how badly you want to just bring one of those bowls home and put your face in it. \n\nNo? That's only me? Dang. \n\nI love the fruit-flavor-infused truffles like orange, lemon, and raspberry. But let's not even pretend that the Earl Grey truffles aren't the bomb - mmmmm, bergamot goodness. They're each very tiny, like the size of a little fresh mozzarella ball, and most are dusted with cocoa powder. Their small size has let me blaze a trail through more truffle varieties than I ever could with regular-sized chocolates at other specialty sweet shops. \n\nHelpful tip: their receipt reads \"Start Truffles,\" so if you try to find the place again via their name, like I did, you will be woefully disappointed! It's Five Star Truffles. I don't know why the receipt prints this different name. A truffle by any other name still tastes as sweet, though, so go here and nom your little heart out.", "author": "Austin J. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "Attention Chocoholics!\n\nThe mothership has landed on 18th street, hiding there so primly and just waiting for you to glance in...bwah, ha, ha, they have you.\n\nDon't fight it, go in, look around, breathe,\n\nThe truffles are the real deal, the choices delightful and temping, and if you're here at the right time you get to see how they make them.\n\nThe owner is a prince, helpful and engaging. And this man has a palate and he knows what tastes almost too good. Notice I wrote 'almost'.\n\nEnjoy!", "author": "William M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "This tiny shop is the best! Tons of delicious truffle flavors and vegan options too! Love that I can get delicious vegan truffles that are just as delicious as the regular ones. They also have several flavors of Mitchell's ice cream. Haven't yet tried the hot chocolate but heard is fantastic so it's on my list.", "author": "Fifi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "My husband and I stumbled across this little slice of heaven a couple of weeks ago when just browsing around the Castro.\n\nSantos is beyond sweet and kind -- and an amazing Chocolatier.  He has a tiny little shop... but as we all know, the best things come in small packages!  He's honestly one of the most passionate people we've run across in a long time!  You can taste all the love and attention he puts into every truffle.\n\nWe purchased 2 boxes of 20 truffles -- cuz my husband and I don't always share evenly! ;-)  We have been enjoying them for the last couple of weeks.  We put them in the fridge, and have them after dinner as a treat.\n\nI really like the dark chocolate, caramel and peanut butter... but they are ALL truly wonderful!\n\nMy husband got a coconut hot chocolate (AWESOME!) and I got a latte (also great!).  But next time, I will definitely get the hot chocolate.  Santos uses REAL chocolate, and whips it into a paste and then reconstitutes it before your eyes into an amazing cup of hot chocolate.  It's like nothing we've ever had before.  It's a must try!!!\n\nKudos Santos!!!!  Keep up the great work!  We'll be back... and see you soon!", "author": "J O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-31", "description": "Latte was too hot. For mission and Castro where the latte bar is high this place falls short.  The guy serving coffee is nice and the truffles are good.", "author": "V V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Amazing chocolates. I was lured in by the sign out front....free piece of chocolate with any coffee purchase. I read the article on the wall while I enjoyed the melt-in-your mouth dark chocolate and enjoyed my latte. I recognized the picture of the owner in the article as the unassuming gentleman that made my beverage! He told me the story of his mom making chocolates when he was growing up. Not only is the chocolate and coffee a treat but the owner is truly delightful.", "author": "Jenn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "This place is great. Easy to get to and always open. Great place to get host gifts for parties and when I need to feed by vegan and gluten free friends desert this is where I go. \nThe truffles are good and there is a huge selection.", "author": "Rob B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "Quality coffee without SF prices. Bonus- You get a truffle with each cup of coffee.", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "This little place is amazing, the truffles are delicious and also the ice cream (coconut) . I found this place on yelp looking truffles for a gift and I am glad I came here . Santos, the owner is a great person, very kind and hardworking.", "author": "Diana Sofia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "Thanks to Munch on Me for the free truffle samples!\n\n* Caramel cayenne - Legit spicy. Really kicks in, burns your mouth! The caramel is super sweet. Interesting contrast of flavors.\n\n* Orange - LOVE. I love citrus + chocolate flavors. This was amazing.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "I accidentally stumbled across this hidden gem. Got the banana. Chocolate and vegan coconut truffles Dee-licious !! A must for your chocolAte fix", "author": "Emoni M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "The truffles here are so good! \n\nOccasionally I like to spoil myself with a good treat and these were definitely on point. Five Star Truffles Co. is a small shop with a pretty good variety of different truffle flavors. When I think of truffles I usually imagine large, non-bite sized ones, which sometimes can be a little overwhelming to eat at once. These were small, bite sized, and full of flavor! \n\nI stopped by last week and got 6 different flavors: white chocolate, hazelnut, dark chocolate, earl grey, banana and caramel. I ate a couple with some still left in my refrigerator for this week :) They also have small boxes that would make awesome gifts for people on special occasions or holidays. \n\nI believe the owner is a one man team- he's awesome! I will definitely be back!", "author": "M W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-03", "description": "BEST TRUFFLES EVER\nmy family buys a box of 100 or more every christmas eve(even when they were on divisadero) and they are all gone by the day after christmas...mind you, this is a family of 4, we are not home for christmas dinner, and this is ontop of all of the other christmas goodies\nthey are rich, addicting, heavenly, and will send you into a chocolate coma.\nthey are expensive, but worth it. they come in great gift boxes and they always let you sample a few when you are choosing. \n\nfave flavors:\ndark choco\nespresso\ncoconut\nraspberry(i think...)\nearl grey\n\nwarning:\nsome of them are REALLY spicy..i think its kahlua and cayenne pepper", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-13", "description": "The truffles are delicious, the coffee is good, and the owner couldn't be any nicer. He's so friendly and accommodating. I love seeing him hand rolling big batches of truffles when I stop by. It's the perfect little local shop. \n\nI concur with other reviewers who said the truffles are a big party hit! If you're short on time and need a dessert, this is a great option.", "author": "Lisa F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "A friend really wanted to get truffles so we made a trip over.\n\nThe shop itself isn't too far. It's also pretty small. Truffles seriously take up most of the space in there. \n\nService is very nice. \n\nMy friend ordered the twenty piece box and got a bunch of different types of truffles. The problem with these boxes (and I guess the truffles) is that you can't tell which one is which once it's in the box. Makes for a nice surprise per bite I guess.\n\nI forgot what we got exactly but there was Earl Grey, orange, raspberry, mint, caramel, some alcoholic flavor (starts with L), cayenne caramel, espresso, coconut....\n\nAll were delicious. Finished the whole box in one day.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "Forget about Godiva crap! This local shop produce and sells best and tastiest  truffles you can get inSan Francisco. They are bite sized and comes in many different flavors. Inexpensive but tasty and made with fist grade cocoa. Love drop by for a cup of hot European chocolate  (fantastic!) and get to free truffle with every drink purchase!\n\nGreat place to satisfy chocolate cravings", "author": "Victor B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "Cannot beat this place for a good truffle in the bay area! Everytime I am in town I make sure to stop at least once. Makes me miss living so close and now I feel like I was spoiled!\n\nI also have give these as gifts to friends and is a great idea for something different around the holidays.", "author": "Lindsey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "Santos is such a great guy! I was turned on to his truffles by a friend of mine that went to his shop when it was located in NOPA. His truffles are delish!", "author": "John P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "Oh my goodness if I didn't get pimples from eating chocolate I would just stuff my face all day. \n\nThe black and white was my favorite!\n\nI also like how you can get 20 pieces for 13 bucks so thumbs up for that.", "author": "Amber H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-17", "description": "Bring it on XOX!!!\nFive stars to Five Star Truffles.\n\nAs a chocolate fan, I secretly wish that XOX Truffles (http://www.yelp.com/biz/qkHlhvv6DrCkvY54ogcPiA) engages in a price war with Five Star Truffles to steadily drop their prices to $0.10 a piece.  \n\nFrom the outside, Five Star does not look as good as XOX, but when I saw the Truffles in the white bowls, I had to ask the owner why it looked so much like XOX Truffles.  It turns out that he made truffles at XOX for 7 years before opening his own store (with partners) in fall of 2006 at this Divisadero location.  NO WONDER THESE TRUFFLES LOOK AND TASTE JUST LIKE ONES AT XOX!!!\n\nI gave XOX 4 Stars - 5 Stars for taste, but minus one star for their price.  I must give five stars to Five Star Truffles for their per piece cost being $0.25 cheaper.    \nXOX - $0.75 per piece (as of 10/08/2006)\nFive Star - $0.50 per piece (as of 12/10/2006)", "author": "トモ T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "One of the best chocolate truffle stores in SF. I visited here for the first time to get a cup of hot chocolate (which was so creamy yummy), which arrived with a bite-sized raspberry truffle.", "author": "Susan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-25", "description": "So....here's the thing. I got a groupon for 2 free truffles at this place, and it is right on my way to yoga.  \n\nI don't wanna be miss negative, but these truffles are small, I mean TEEEENY tiny. \n\nFine for free, tasty even, but I would never buy them. Sorry.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "This shop is super tiny but has a good selection of truffle flavors. They are inexpensive for truffles, which is nice because you can treat yourself with a little pocket change. \n\nThe truffles themselves are on the small side but all the flavors I had were extremely tasty, and I liked that that made me feel like I could try more. Even though they were small I was able to nibble at them with a friend so we could both try--the chocolate flavor is really rich! My favorite was the cayenne caramel. \n\nI will say though--these truffles aren't very pretty. They are cute little hand made things but this isn't necessarily the place to go if you're looking for an expensive gift. If you're going to get a lot of flavors I'd recommend having them separated somehow--they're really hard to tell apart once they get in the bag!", "author": "Meryl S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "This place is fantastic.  A true small business, run and fully staffed by the owner.  He has a large and creative selection of truffles.  We particularly liked the Earl Grey and caramel truffles.  He also has a large number of intriguing looking liquor flavored truffles.  The prices are very reasonable.  He also has a very intriguing looking hot chocolate that I look forward to trying.  These types of small, unique businesses deserve our support!", "author": "Victor O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "Tastes like more....\nWow! Delicious truffles!\nMy husband got me an assortment and my favorites were the espresso, peanut butter and bergamot. Tastes like expensive European chocolate. Awesomeness :-)", "author": "Ms S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-14", "description": "I can taste the love that goes into making these amazing truffles. Melt in your mouth goodness - doesn't matter what flavor I try, they're all delicious. If I had to pick favorites I'd go for the espresso, basic chocolate, and caramel. I got my first box of five star truffles on Valentine's Day last year - now I sneak in every chance I get for a sweet treat :D Even better deal - with every drink you get a free truffle. Love this place!", "author": "Elaine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-21", "description": "Thanksgiving potluck was made so much more fun when I knew I could just stop in at Five Star Truffles to pick up 40 pieces for the friends who might live too far to have heard of this place. \n\nMy favorites: Lemon, whisky, and espresso. \n\nHappy Thanksgiving!", "author": "Winnie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "Bought some truffles for Easter baskets and everyone loved them. They had a wide variety to choose from", "author": "Kevin l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "the truffles are just amazing. i find truffles most of the time too rich to enjoy; these are little nuggets of bliss. not too rich, absolutely tasty, mini bite sized gems dusted with cocoa \n\ntry them out!", "author": "Quint K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-08", "description": "This is just down the street from my apartment, and the question I keep asking myself is 'Why haven't I discovered this sooner!?'\n\nBy far, this is a hidden treasure on Divisadero. It's never super crowded when I'm there, but know there are many fans of Five Star. \nNot only do they have wonderful truffles, but the coffee and hot chocolate are stellar. The owner, (who is always making the truffles when I'm there) is always super friendly and helpful, and offers free samples. Great variety of truffles, but my favorites are the caramel, Earl Grey, and Kahlua. These lil' bites of heaven are so decadent, but worth every single bite. \n\nCheap and delectable truffles, awesome service with the friendliest owner----- what are you waiting for? \nPS There's free wi-fi!", "author": "Gill C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-19", "description": "Who would have thunk that a tiny cocoa covered truffle ball could produce the huge taste explosion that went down.... ALL inside my mouth. (And yes this may sound Porn-ish, but eating truffles is serious business!)\n\nThe strawberry truffles here, are heavenly. Tiny (I stress the tiny) chocolate smooth delicacies, which your taste-buds will thank you for, well after first introduction.\n\nI also had their hot chocolate with skim milk and it was one of the best hot chocolates I've had in the city. Must be some of that truffle voodoo. \n\nA pretty bare interior, but it's quiet and the sweet smell of chocolate wafts throughout the store, so what atmosphere they lack, they make up with chocolate-y aromas.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "I would never have found this place without Munch on Me. Can't beat free! I think I've just found a place to take friends to for a snack right before showing them Twin Peaks at night. \n\nThese are some of the best chocolates I've ever had. I tried the 20 for $10 deal and just mowed down 10 flavors. It could just be me but I think these chocolates require a more refined palate than I currently have. For example, I couldn't tell the difference between Coco-Rum Truffle and just plain Coconut Truffle. The Cayenne Truffle also has no kick (or maybe it's cuz my tolerance for capsaicin has reached ridiculous levels). With that being said I loved every piece of truffle I had! At $0.50/truffle or free if you get a drink I'll come back to this place every time I'm in the neighborhood. Can't wait to go back!", "author": "Don D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-06", "description": "Received a box of these from my secret santa... OMG, they are terrif!  Now I know I have the BEST secret santa this year!!\n\nNow I am really curious about who it is!", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-28", "description": "Five Star Truffles and Santos are MOVING in January! This neighborhood will definitely miss him but thankfully he's just moving about a mile away to the Castro on 18th St. The Divisadero building will be taken over by a bank but Santos is excited to have found a new space that should bring more foot traffic into his business.\n\nI usually buy the truffles 20 ($10) or 40 ($20) at a time and they are such crowd pleasers. The truffles are about the size of a Whopper candy so they go fast. I love the liqueur and nutty truffles but for Five Star newbies, I usually buy a box of Earl Greys. And caramel doesn't usually appeal to me, but the caramel here takes days to make and has a deep and not overly sweet flavor ... he could probably sell the caramel on its own. \n\nI also love the chocolate drinks like their mochas which use real chocolate of course. They are so decadent. They tend to be on the more expensive side (almost $4), but the free truffle makes up for the steep price. You also get a free truffle when you buy in bulk. \n\nWill make a few more visits to the Divis shop before it's gone...", "author": "Mimi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-03", "description": "Amazing truffles. Earl Gray and hazelnut liqueur are my faves.  The proprietor and maker was sweet, makes them by hand on premises. Also a decent selection of vegan truffles. Do not miss!", "author": "Dean B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "I'm not huge on sweets, but I do like good chocolate. I tried out 5 star recently when there was a promotion on Munch on me for 2 free truffles. VEGAN TRUFFLES. They are intense. I tried out the dark chocolate and coconut variety and could probably have eaten a lot more than 2.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-03", "description": "This little shop used to be a block away from my house so i went there about twice a month. The man that worked behind the counter was very friendly and memorized my entire family's favorite pieces!  Wonderful customer service.\n\nThe chocolate is soooo good, and as a truffle lover I must say for the price this is one of the best chocolate places in the city.", "author": "Miranda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "Randomly stumbled across this place while entertaining some friends.  It's easy to miss, even when it's pointed out to you.\n\nAnwyay, I am not usually a truffle enthusiast, but these were quite yummerific.  I got a variety of flavors--i think my favorites were the caramel and the black and whites.  The size of the truffles were manageable and the flavors were not overpowering.\n\nIf you are a fan of truffles, it's a must try.  I'd gladly go back again, and the prices are pretty reasonable as well.", "author": "Lu E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "Tried cognac, earl grey, cayenne dark, hazelnut, and orange. Personally really liked the hazelnut and cognac. Didn't think earl grey was that special. Cayenne was way too overpowering with the spicy flavor. These truffles are not beautifully presented so prolly not good gifts for people, plus they melt. But for personal indulgence, I'd recommend trying this place.", "author": "Joyce B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-26", "description": "I practically live across the street from this place, and decided to walk in one evening as they were closing. \n\nThe owners were wonderful... gave me a sample of nearly all of their 20 flavors of hand made truffles. I nearly had a chocolate overdose. \n\nBeen a fan since. I don't eat the truffles myself, but I do default to 5 Star for all my truffle needs. For example, last month when Wendy was having a crappy week, she got a batch shipped to her. She loved it despite the fact that they'd melted into a glob. That's how good it is.", "author": "Charlie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-01", "description": "They moved to 18th in the Castro area. Apparently the backstory is the owner took his previous boss's recipe and opened his own shop. They're relatively cheap truffles at $10 for 20 pieces; for this price you can basically get one of each of their flavors. Goes well with coffee.", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-11", "description": "A year and a half later - and if I could add an another star, I would!\n\nFive Star Truffles has really grown up: \nthe little hole-in-the-wall shop now boasts dark red and brown walls, the hand written signs were exchanged for a big truffle flavor & coffee board, colorful art work lines the walls and the owner proudly displays his 100 inspection scores for two years running - quite the face lift!\n\nI usually venture in just for a quick afternoon-coffee-fix-with-truffle ($1.60!) -  but most of the time, I'll leave with one of the cute take-out boxes, filled with 20 (or sometimes 40) of Five Star Truffles' yummy creations. \nNew flavors pop up all the time - though I am still waiting for the savory side to take hold: \nsalted caramel, aztec chili - anyone?\n\nAnd just a quick note to all the competitors' supporters posting here ... what's so unique about these chocolate truffles? Just google \"chocolate truffles\" and hundres of images of truffles looking just like these will pop up - so enough of the extortion/conspiracy theory. \n\n(*many of my former assistants have moved on to enter my field of business - it's the evolution of supply and demand ...)", "author": "Francis S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-27", "description": "We were in the Castro and wanted hot chocolate. Thanks to yelp, we found Five Star Truffles (a few doors down from Mollie Stones). It's a teeny little shop and service was friendly. They make all their truffles in house. We had a large hot chocolate for $4 and with it, you get to sample a truffle (75 cents) for free. I picked hazelnut, which was tasty. Next time I'll try earl grey.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-28", "description": "Cannot stop eating these truffles!  Maybe bringing home a box of 20 for $10 wasn't such a good idea after all.  My favorites so far are the black/white, espresso and dark. Still working our way through the rest in the box.\n\nThese truffles are better than truffles I've had from fancy artisan chocolate stores.  Love that this is a family run store.  You even get a free truffle with an espresso drink!", "author": "M G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-06", "description": "The 4 of us landed here for an sweet-attack. This place is one of Yelp's favorite and indeed it shows with the variety of truffles this place carries. This place carries 20 different kinds of truffles including soy and vegan ones, for all you vegans out there.\n\nMatt bought  2 orders of 1/4 of a lb of the popular claim-to-fame truffles, which had Hazelnut, Raspberry, Coconut and yummy Caramel; one of the orders for us to share immediately and to whoof down after our lunch. Our order had a  total of 24 pieces each in the 1/4 lb box that cost $9.00. What a SWEET way in ending our meal!", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "super friendly staff, vegan options, drip coffee was delicious and good price. bar seating inside with windows, small and cute great for taking visitors for a choc sample and a togo mug", "author": "K R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-28", "description": "Love everything but the tough parking. Great personal service, delicious truffles (B&W my fav). But the best thing to me by far is the hot chocolate! Best I've had, I'd go to five star just for that!", "author": "Christine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-15", "description": "Five stars for five star!!!\n\nThis place is amazing! I've walked by it a million times and have always been curious. Thankfully, I took the recommendation of a friend and stopped in for a little treat. The truffles are 75 cents each or slightly less if you buy in bulk and they offer about 10 flavors. All of them are delicious!!\n\nI suggest going here if you would like a little treat for yourself, or to buy an assortment for a dinner party. Your guests will thank you!!", "author": "Kandace K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-24", "description": "I'm currently writing my review from Five Star Truffles where I am drinking a  hot tea and digesting my cheese & jalapeno sandwich.\n\nThe sandwhich was simply made on toasted wheat and was surprisingly good. I haven't tried the truffles, but the service was friendly and the prices are right. I'm a fan!", "author": "Dylan .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-19", "description": "I would imagine truffles have a basic recipe that everyone tweaks a little bit to make their own.  How can you steal the concept of a truffle shop?  I am not a fan of truffles but I think the owner is very nice and I wish he had more foot traffic.  I prefer to support  small business owners.  We do buy ice cream there.  He sells Mitchell's which is mediocre at best.  Way too sweet.", "author": "Erika R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-17", "description": "Looks great, if they deign to serve you...\nSaturday, 4:30PM: walk in, salivate over very yummy looking truffles in the case.  Worker comes from back room, we say \"hi\", he walks back to back room, we wait 5 minutes for someone to sell us some truffles, then give up and walk out.\nToo bad, they had me craving chocolate.  It went away eventually.\nWTF?", "author": "Neal S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-26", "description": "I love finding superior hot chocolate in the most unassuming of places. Five Star Truffles and Coffee is one of those places. After a disappointing visit to Cookin', we found ourselves walking down Divisadero and stumbled upon this diminutive chocolate store. They make all of their truffles onsite and have a case of delectable looking truffles including vegan made with soy milk instead of whipping cream. \n\nI was leery about the quality of hot chocolate (being the hot chocolate snob that I am) but took a chance because the proprietor assured me it was rich in flavor. \n\nSure enough, the 8 oz. cup of hot chocolate was rich, not too sweet and had just the right balance of chocolate that provided me with a nice late afternoon treat. \n\nAt $3.25 for an 8 oz. cup and $3.50 for 12 oz., it's gourmet hot chocolate on a budget. Love that!", "author": "Lee H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-03", "description": "I thought the truffles were good. But I also thought my coffee drink was thin and weak. I asked for decaf and they got the preground grounds from a plastic yogurt tub stored in the fridge. This made me think they weren't really serious about making good coffee. The taste confirmed my suspicion.  \n\nGranted, some people (myself included sometimes) feel that decaf isn't really serious coffee, but if you have the cojones to charge as much as the Blue Bottle for a decaf americano you really shouldn't treat it as a \"throwaway\" drink.\n\nIf the owners ever read this, please consider the following suggestion: either (1) make it look like people aren't being overcharged for their coffee, and/or (2) dramatically improve the quality of your coffee. \n\nThe truffle I had was very good.", "author": "A A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-19", "description": "I've just discovered a wonderful little secret: a small, handmade truffle should be eaten immediately before your first sip of morning coffee. \n\nI usually go to Peet's after dropping my kid off at her panhandle-area preschool. But the other day i decided i should venture out, so i yelped \"coffee\" and this place came up. The thing that MADE me go there was the whole free truffle with your coffee thing. As a chocoholic, i couldn't pass that up. \n\nSo the coffee isn't the greatest, but here's why i love this place: \n\n1. it's independently owned and run. the guy at the counter is the guy who makes the truffles, opens up in the morning, and closes in the evening. peet's is doing fine. \n\n2. you get a free, delicious, truffle  of your choice with your coffee!\n\n3. Free parking is always available right in front. \n\nI'm addicted.", "author": "Paula S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-22", "description": "Very tasty little bundles of chocolate goodness. But behind the tasty is a story that leaves a bad taste in my mouth that even the chocolates can't mask.  \n\nI heard, when I first discovered this place, that there was some controversy over the owner taking the idea from XOX (where he used to work) and running with it. Well, he says he had their blessing to branch out on his own, but I have been made aware, by the owners of XOX, that this is not true. \n\nI, for one, was glad I found a comparable product that did not require me to brave the parking and multiple bus lines to North Beach to get a truffle made with as much love as it has flavor. \n\nHowever, to steal someones recipes, and business ideas, to threaten the owners of a business that you are going to take their ideas unless they comply with your terms just doesn't sit well with me at all. I would rather brave a trip to North Beach than support dishonesty. I hope everyone else who has tried one, or both, of these establishments truffles would do the same.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-28", "description": "This is really four-and-a-half stars; the half a star off for particularly poor ambiance.\n\nI often go to the corner of Divisidero and Fell, which has two cheap-if-you-pay-cash gas stations. One cold day, my stomach growled enough that I started looking for food. I stopped by this sketchy-looking diner-thing advertising its hot chocolate, coffee and truffles. The short guy behind the counter was friendly and seemed to know how to make a decent hot chocolate, so I decided to get two truffles to go with. I was totally spoiling my lunch, but, hey, it's hot chocolate on a cold day, and how much harm can two tiny truffles do? \n\nHe recommended getting an espresso and dark chocolate truffles. I pattered away down the street, truffles in pocket and hot chocolate in hand, to find real food while the chocolate cooled to a drinkable temperature.\n\nThe first sip of hot chocolate made me stop and pay attention, which, unfortunately, meant I stopped in the middle of a crosswalk with the light about to change. After hurrying to safety, I took another sip. A smoothly balanced, rich deep chocolate flavor with an undertone of sweetness and spice... Yum!\n\nI had to pass the store again to get back to my car. When the guy at the counter saw me come in again, he looked very concerned, finished up with the other customer, and asked if there was anything wrong, to which I replied, \"Do you have a card?\" The biggest smile broke over his face.\n\nAs for the truffles, they were just warmer than room temperature when I popped the dark chocolate one in my mouth. A second later, I was left wondering how so many mouth orgasms could fit into such a small package. The espresso one was almost as good. \n\nThe one unique commonality of the items I tried is the wonderful flavor balance. Five Star's hot chocolate bumped my previous favorite to second place. I will definitely indulge there again.", "author": "N M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-11", "description": "If you plan on foraging for truffles for your sweetie, you'll want to have Five Star Truffles as your secret go-to place, especially if your heart is bigger than your wallet.  \n\nI am talking about truffles of the chocolate variety here.  Five Star has about 10-12 flavors and they are all delicious.  The size is truly bite-size, just what you want with this rich and intense confection.\n\nThe location and interior don't tell you much.  It's pretty basic and no-frills, and feels more like your friendly neighborhood sandwich shop rather than a place to buy chocolate and coffee.  Don't be put off though - these truffles are of excellent quality and on par with the ones you find in more dressed-up shops.\n\nYou can buy individual pieces, or purchase a cup of coffee which will entitle you to a free truffle of your choice.  There are the classic flavors like dark chocolate and raspberry, and exotics like Earl Grey tea and black & white.  VEGAN alert:  5 Star now offers 2 vegan varieties - I tried the Orange Dark Chocolate and it was divine!\n\nYou can purchase 40 truffles for $16.00 or 80 truffles for $32.00.  Now, isn't that refreshing, considering that your average artisan chocolate runs $2.50 a piece? They offer gift boxes, but the regular box is the much better presentation - Chinese take-out box with a pretty foil sticker on top.\n\nTruffles are great to bring to a dinner party or to cheer up a friend - and at these prices, they are a luxury that you can indulge in without an ounce of guilt.  Truffles for everyone!", "author": "Liz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-11", "description": "Don't let the unassuming storefront and interior fool you, these truffles are from the gods, and fit for royalty. I'm not sure what to make of a truffle store in the middle of my neighborhood, but for now I'm lovin' it and not asking questions.\n\nThere are a bunch of varieties to choose from but some of my favorites so far are caramel, dark chocolate and hazelnut. The very nice owner makes the truffles himself, and told me he plans on experimenting with new flavors! You can get a couple of truffles for yourself, or go for a box, which would make the perfect gift (for you or somebody else, I suppose!).\n\nI'm ready to support this new addition to my neighborhood, despite the dangers it promises to my model figure.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-12", "description": "Walking to grab a bite in the Lower Haight last night, I happened upon this lil gem.  I'd heard about this place....like one hears about the Fountain of Youth, or searches for the Holy Grail but never finds it.  I have found my new place of worship.  I have found what i seek and i shall seek no longer.  Coffee and a truffle for $1.25?  I believe that is perfection.  I believe that it will cure my wrinkles, and get rid of my already graying hair, and hopefully emit some pheromone that has all the hot men knocking down my door...drama free of course. \n\nI had this BEFORE dinner.  I almost decided I didn't need dinner, but figured a decaf coffee and one amazingly perfect mint truffle wouldn't tide me over for the rest of the evening.  I arrived 5 minutes to close.  The gentlemen running the joint didn't say anything about time...they just let me into their own version of heaven.  Their kids must have thought i was amazing and felt my new energy this place brought me,  because Brody was with me, and instead of petting him...the little boy came over and pet me.  I know I'm soft...but pet worthy?  I don't know.  \n\nI ordered a mint truffle, and a decaf coffee, but they were out of decaf.  Soooo, they offered me decaf americano for the same price!  What sweethearts.  They make all their chocolate there, and their selection was great, but i just wanted the one.  I left this poorly decorated, underused space with the feeling that i could do anything.  Don't judge a book by its cover.  This place is not what it appears.  If one truffle could do this to me...I'm scared as to the effects of a whole box.  I hope I don't start to believe I'm super-girl and attempt to jump off buildings like people on PCP do.  Could happen.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-19", "description": "Best Truffle's in the city!  Sometimes in life, the best things come in unassuming packages.  Five Star Truffle's is the perfect example.  \n\nI heard about this place and had to check it out.  I just walked over and yes, the store front is totally unassuming.  The shop is no frills.  You are not going to get professionally designed logos, or fancy shopping bags here, you're going to get kick ass truffles.  \n\nI spent some time in the store talking to Santos, who is one of the owners.  Santos is the small guy behind the counter.  He has an accent and a very happy face.  Santos worked with a popular chocolatier here in the city for seven years, and was wanting to try some new recipes to perfect their existing truffles.  His former employer wasn't interested in trying to make a better product so Santos thought that was a sign it was time for him to take a chance and open his own place.  He's put his life into opening this little business and that is why it is such a humble place.  Hopefully the word will get out and business will be good to he and his partner.\n\nAll the truffles are handmade original recipes by Santos himself.  He gave me a taste of the strawberry truffle which, normally I wouldn't have thought I'd like but it was awesome.  The truffles are on the smaller size but the perfect size, in my opinion, for a bite.  \n\nI tried the espresso, hazelnut, caramel (the bomb!), coconut, and strawberry.  They were all excellent.  Great texture, great flavor, and totally fresh.  They make truffles daily.  \n\nSantos has been working 12 hours a day 7 days a week since opening his store.  Besides being a friendly guy, the truffles are excellent.  Excellent product, nice people, what more can you ask for?  \n\nSupport Five Star Truffles please!", "author": "James M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-15", "description": "I heart this place!  They received 100% score and award for food sanitation and cleanliness.  I mean, damn, literally, you can eat the truffles off the floor!  No joke!\n\nThe owner really conceived and nurtured his business to something that has become quite a gem in the Panhandle.  The truffle selection is unique and you can score a box full for a reasonable price and give it as a gift or eat them all by your lonesome.  Seriously, this place is so rad and the owner's self-made man story is awesome.  Please support this business because it's businesses like this that warm your heart - besides the killer hot beverages!\n\nSweet place, pun intended...", "author": "Dorothy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-17", "description": "These truffles may be small and expensive... but they are flavorful and addicting. Many favors to choose from and haven't had a bad one yet. Favorites are banana and whiskey! Nice friendly staff also!", "author": "Kara D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-09", "description": "Just a man, some delicious handmade truffles, and a dream. He uses Cacao Barry chocolate and offers over a dozen variations, from standards such as hazelnut and espresso to the more exotic earl gray and wine. Far from overpowering, these are delicately balanced morsels of pure delight, the kind you can enjoy on a daily basis. I highly recommend stopping in, picking up a box (just $7.50 for 20), popping a few in your mouth and passing the rest out to random strangers you meet. Truffles earn double karma points! Triple, for supporting a small business run with love, humility and infectious enthusiasm.\n\nUpdate April/07: To those who would criticize the founder for stealing the recipes from XOX Truffles, where he worked for many years... It certainly casts a shadow over the business. However, I ask you to consider two mitigating factors. One, the recipe for a raspberry truffle is not exactly a trade secret. \"Theft\" is a bit of a strong word to use when it comes to truffle recipes. \n\nTwo, I will say something but first I must qualify it by noting I know nothing about the internal operations of XOX Truffles or Five Star for that matter. But generally, in my view, the food service industry in SF exploits immigrant labor. It's built on it. It's its backbone. So many kitchens in the city are powered by immigrant laborers who work their asses off but are powerless to negotiate anything more than a pitiful wage. And for those of you who would preach the magic of the market, it's a *political* disempowerment, stemming from plenty of non-market forces that keep them in an exploited state. Something to think about before anyone gets all high-horsed about the kitchen slaves running off and stealing massa's recipes. In a fairer world, the people who work in the kitchen... ought to own it.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-08", "description": "This is the down and dirty spot to get truffles. The truffles are excellent here and they have a plethora of flavors that are alcohol-free. The prices are amazing (a box of 20 for $7.50!) and the guys are super nice. \n\nFive Star Truffles is disarming in its decor - the place is pretty bare bones and you get the impression that they've just moved in and are still setting up... only... they're not. Don't let the surroundings fool you, though. The truffles are top notch and, if anything, the lack of atmosphere contributes to the charm because it probably helps keep the prices so un-ostentatious. \n\nFive Star Truffles has the charm and beauty that small-business America and the American dream are all about. Go there and buy a bunch of truffles even if you don't like chocolate. You can wander up the street to the Panhandle and give them out to people in the park and know that your money has helped support one of the unique businesses that make SF such a great place.", "author": "Hannah Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-08", "description": "Chocolate Math\n\nEarl Gray truffle                          5 stars\nRaspberry truffle                        4 stars\nHazelnut truffle                           4 stars\nService                                         5 stars\nPrice (2 for $1)                            5 stars\nAtmosphere                                2 stars\nTOTAL                                        25/6 = 4.167\n\nFor 50 cents a piece, these are one hot deal! The earl gray are the only ones I lost my mind over. I'll be back to get my chocolate on and you can bet these little treasures are going to find their way into gift boxes around the holidays. Clean the place up already, Truffle Lady! Appearance is everything!  I guarantee that if this place was a little brighter, cleaner, and more inviting, you'd have one hell of a business on your hands.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-14", "description": "No false advertising here, they have some really awesome truffles here!!  I came here by a recommendation by a friend who knew I had a thing for confectionery sweets.  Normally truffles in shops like these can be pretty expensive treat, that said I walked in and was immediately greeted by the owner of the shop Santos.  You could tell that he took pride in his craft and was happy to share it with you.  My initial game plan of stop by pick up a box of truffles and a cup of coffee turned into a whole tasting affair.  His truffles are smaller and as a result you get to taste a number of truffles without all the guilt.  That's what I kept telling myself anyways, but some of his flavors were ones that I never even thought to make let alone taste.  Some of my personal favorites were the earl gray, carmel, java and red wine!\n\nFinding parking can be a little tough if you drive, but it is so worth it!  You can buy his chocolates by weight, or if you want just a piece you can get one for .50!  But trust me, you can't just have one piece, that type of will power and control melts away the moment you walk in and smell those rich heavenly smells of cocoa.  I'll be back soon to once again to indulge in those chocolate confectioneries....", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-26", "description": "My only complaint about this establishment is that it is dangerously close to my house. Fifty cent dark chocolate hazelnut truffles within walking distance. I guess that's two complaints: the truffles are too close and too cheap. Oh, and they're tasty too. That makes three complaints.\n\nIf I can't fit into my pants at the end of the year, you'll know who to blame.", "author": "Timothy O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-20", "description": "\"A new truffle shop??!?\" \n(car screeches to a halt, fervent search for nearest parking space begins)\nI am a sucker for chocolate...fortunately this great no-frills shop didn't make me feel like one. Instead it made me feel like a pirate who stumbled upon an ancient (and curse-free) treasure...saavy?\n\nWhile trying to figure out if I needed to taste one before buying a box of twenty, I ordered a latte (I was seriously indulging...nothing gets me in the mood for fabulous hand-made chocolates like a hot latte). Before I knew it I was saying \"two of each, please\". \n\nMy first try was the raspberry liqueur truffle - exquisite and tiny, the flavor and texture was perfectly heavenly. \n\nI think Santos had the right idea when naming his new business...five stars it be! Arrrrgh!", "author": "Jessa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-27", "description": "yummy truffles.....and they are small enough that I don't feel guilty about eating them ..since you do get a piece for free with cup of coffee.\nI like the carmel and the coconut. Santos the owner is a nice guy too!\n\n but i wouldn't  go in there to hang out and sit .....just get your stuff to go.", "author": "kelly p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-12", "description": "Today I was walking down Divisadero and had the misfortune of stepping on a ketchup packet.  Messy and distressed, I made a beeline for the first spot that might have a napkin I could mooch.  \n\nHere my luck turned - I stumbled on Five Star truffles!  Rather than taking offense that I wasn't there to shop, the man behind the counter fed me chocolates and cheered me up.  He was incredibly kind and shared a bit of the story of the business, which is family-owned.  \n\nLet's talk about the chocolate though - these truffles were amazing.  They're fresh and handmade and sized so that you can sample several flavors without feeling too guilty.  They have a couple flavors of vegan chocolates, which were DELICIOUS.  I'm glad I know of a good way to fatten up my vegan friends when I want to . . . this place is going to fall into my rotation all too regularly.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-14", "description": "When it comes to truffles, or any serious and intense chocolate delight, looks should mean NOTHING.  Taste rules.\n\nQUALITY, PEOPLE, QUALITY.\n\nThat being said, stop on by here when you're driving between the Haight and Pac Heights.  It's just a few blocks from my apartment, next to a Wells Fargo and the Cheese Shop, and across from the always busy hand car-wash.\n\nItty bitty bits of flavored moist cocoa densed rolled and covered in a thin layer of coating chocolate and rolled in cocoa powder.  Roughly twenty flavors including strawberry, hazelnut, coco rum, lemon, orange liqueur (affectionately spelled: liquor), raspberry, and cream of mint. Available one by one for 50 cents, or in larger amounts--twenty for $7.50.\n\nMy sweetie bought me a 20-box for Valentine's Day.  He thought I was cute as I gingerly carried around my tiny Chinese take-out box.  We threw it in the fridge when we got home (recommend to prevent melting--plus it tastes even better cold).  Dug into the stash after dinner--VERY IMPRESSED.\n\nAs others have said, don't let the small and unassuming storefront dissuade you from stopping in.  The staff are welcoming, kind, and patient as you pick out flavors.  \n\nDefinitely coming back. You should try it.", "author": "Robyn E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-08", "description": "There are truffles and there is coffee. There's no iced tea, but they never claimed that there was any. \n\nThere isn't much in the way of atmosphere, but they're friendly and you can get a whole mess of chocolatey goodness for not too much money; Try the earl grey truffles! \n\nFour stars for now; if they do something to make the space a little nicer, and if the coffee turns out to be reasonably good, they will have become the Five Star Truffles and Coffee that they aspire to be.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-03", "description": "Would you like to sign my petition? I believe that truffles ought to cost more than $7.50 per box of 20! Otherwise there is no barrier to me eating 20 amazing truffles per night and charging less than $2 PER truffle is just socially irresponsible. \n\nOk, not really, the guy who owns this place is amazing. He makes all the truffles himself and obviously enjoys his craft. I stopped here on the way back from attempting to buy fruit and he let me sample all of the truffles I was considering purchasing. Coconut, red wine, earl grey, mint, caramel, etc. \n\nMy favorite? The caramel truffle. It's like someone dusted dulce de leche with cocoa powder and allowed you to pop them in your mouth one by glorious one while walking down scenic Divisadero. \n\nSo, yes, adjust your expectations for what the shop should be like - there are plenty of hoity toity chocolatiers around, but very few places you can get amazing truffles for thirty-seven and a half cents a piece.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-27", "description": "Pretend there are bagpipes playing.  Also, if you could just imagine a wee drumbeat in the background, and a little bit of hi-hat, then you are conjuring up the music with which I would like to introduce the best damn chocolate I've had the chance to sample in this fine city:  \nFIVE STAR TRUFFLES.\n\nThere are no less than 20 ways to get your chocolate fix here, bunny-doo sized nuggets of nib-induced pleasure are presented in big latte mugs.  For the anti-moo in you, there are now three different kinds of VEGAN truffles which I did you all the favor of sampling today.  \n\nIt was really demanding work ,and I feel like I should be getting kickbacks for all the work on my mandible.  A possible cleanup allowance for the party that was held in my mouth would be nice too, but I'll be a martyr for the cause and spill it sans monetary compensation.  \n\nThe truffle is an experience all its own...almost a candy coating on the outside but really only enough of a \"shell\" to keep the gooey goodness inside from leaking all over the place.  Think of it as the cacao-inspired exoskeleton of a chocolate ant.  Protective, but not good when mixed with toothpicks, deflected sunrays, or other poky objects.  Don't leave these in the car on a warm day, or you'll be sad.  Either that, or you'll be licking chocolate mass out of the deceptively deep corners of Santos' mini-takeout boxes.  Sadly, I have had to do this and it isn't any way to spend an afternoon at Dolores Park!  Plus, it looks like you may be eating something fiercely gross and people stare.  Much better in round truffle form, washed down with a cup of their yummy, not-too-strong coffee.\n\nI can't bear to deduct since they are everywhere, but I have a hovering half-star deduction for the cloud of fruit flies that always seems to want a piece of my chocolate when I'm leaving.  Back off, a-holes!  I share my truffles with NO ONE!  I had to get Kung-Fu with the flying fiends in the doorway, which did make my next couple visits kinda awkward, but overall was worth my efforts.  Those delectable little bites were all ME!\n\nI guess all God's creatures have a little sweet tooth.  Big ups to Santos for keeping mine happy!", "author": "Lea N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-10", "description": "great americano!  \n\nand you can get 20 truffles for $10 if you get them in the chinese take-out box instead of the fancier box.  \n\nthe cayenne truffle is SPICY!\n\nearly grey is my favorite.  for 50 cents a truffle, i don't know how it gets better than this.  oh wait, it's a block from my house.  bliss.", "author": "Dao H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-03", "description": "Every so often -- about once a week, I'd estimate -- I get excited about my neighborhood. This usually happens while I'm running some kind of menial errand at one of the fine establishments on Divisadero. This neighborhood excitement used to be triggered by running into a friend on the street, but to be honest, I don't even need that anymore. The spirit of the 'hood alone can send me into a fit of smiles while I'm out walking.\n\nSunday is \"Small Coffee & a Truffle for $1 day\" at Five Star. Who knew? I've had XOX Truffles before (one of my roommates used to work there), & I know the guys who run FIve Star came over from that fine establishment, so I figured they would hold up.\n\nSurprise, surprise...they do. No slouch on the coffee, either.\n\nI'm going to go ahead & say it: $1 cup & a truffle is perhaps the finest weekend bargain in the 'hood. But shhh...let's not advertise TOO much. The last thing I need is a line next weekend when I drop back in for the Sunday special...", "author": "Pete J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-15", "description": "I can't believe the Lower Haight has its own homeade truffle store now!  These are the same sort of tiny, soft, lumpy-looking chocolates they make at XOX Truffles up in North Beach (they actually look somewhat like the savory black truffles that grow underground).  You buy by the number--$7.50 for a little chinese takeout box of 20 truffles--and can pick from a number of standard but delicious flavors.  Dark chocolate, caramel, hazelnet, almond, raspberry, etc.  The caramel is delicious, filled with meltingly soft homeade caramel.  All the rest have a flavored chocolate filling.  I've liked everything I tried.\n\nDidn't try the coffee (which comes free when you buy a box of chocolate) but it smelled good.  I'll have to save that for next time.\n\nIt's got a very unassuming storefront right next to Country Cheese--hope they can find the business to stay open on this somewhat random location on Divis!", "author": "Robyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "What an adorable place. I've gotten the delicious coffee here twice (they have soy milk btw) and my husband gets truffles all the time.  The interior is nothing special but the truffles are amazing and the owner is very friendly.\n\nLast time I went they had three vegan flavors: orange, dark chocolate and coconut. The coconut was my favorite.", "author": "Laura V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-27", "description": "By far the best truffles i have ever eaten.  They are around nickel to quarter sized, made fresh daily and they have around 20 or so different flavors.  I had a free second to talk to the chef and he says he never stops experimenting with different flavors.  They even have vegan truffles.\n\nThe red wine and the white chocolate are my favorite!", "author": "Brian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-16", "description": "I love supporting people like these guys. \n\nSeriously great story and great coffee and SUPERB truffles. \n\nEarl Grey is my favorite flavor. \nBonus points for vegan truffles.", "author": "Elsa E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-28", "description": "Yummers --- hopped across the street to this place while my car was getting a wash.  This place is fo realz...great little nuggets of truffles in all sorts of flavors -- my favorite was the coconut...but all that I tasted were tasty.\n\nDropped one star for really weak coffee, but otherwise, this place is super - and yes, with VDay approaching, i'm sure this would be a great gift for anyone in need...", "author": "John R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-29", "description": "The moment my mouth started to register the experience of the caramel truffle, I knew I was in trouble and for the first time in my life, I can identify with a crack addict.  Seriously.  A wave of resignation tinged with terror overwhelmed me withing two seconds of tasting this chocolate, it was a complete and total loss of control and chemical induced revelation that told me I am a Five Star Truffle addict.  Santos, maker of chocolate crack, how can you be so good and yet so bad?  You may just be the higher power in my life.  Santos Chocolate.\nOh my god.  OH MY GOD!  I am up sh*t creek with this place.  My dog will soon become very familiar with waiting for me outside this shop.  Lucky for him, because it means extra long walks to work off my little addiction.", "author": "Aimee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "This is a terrific place for chocolate!  Hand made chocolates by a master maker!!  This is a one man shop.  The owner is a wonderful guy---very friendly, courteous and delightful.  The chocolates are THE BEST around.  Try out these marvelous creations.  CHEERS!!", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-07", "description": "These ain't yo mama's truffles.  No smooth round perfectly shaped Stepford truffles here. No sir, these are craggy, roughly shaped, dense dark bombs of pure SINFUL chocolate.   \n\nHow glad I am that Santos decided to locate his new place on a route I travel every day.  Now I can't help but stop in for a coffee and truffle. or two. heck, make it three.   Especially the raspberry and espresso chocolate truffles. They make my mouth sing!\n\n It can be kind of a pain to get out of the parking spots when the cars are  whizzing by on Divis, but that just gives me a chance to sit and savor another truffle.  traffic, what traffic?", "author": "Smruti S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "Five Stars for Santos who still makes a delicious Café Mocha with \"Real Chocolate\" not the super sweet liquid squeezed out of a plastic bottle customary found at most coffee shops. AND Caramel Cayenne is a must.", "author": "Aline L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-11", "description": "Really good coffee with three bonuses:\n\n1. Coffee cup lids that twist completely shut, enabling your beverage to stay warmer longer.\n\n2. Free truffle with every coffee\n\n3. Humor, as the guy making my coffee, whom I asked for nonfat milk twice (standard, gotta be sure), replied that my free truffle would not be nonfat.\n\nTouche.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-22", "description": "Fellow Yelpers,\n\nThe name says it all. Enough said.\n\n2009-03-07 Update: Coffee seems to have really taken a dive in quality. Same delicious truffles though.", "author": "insipidphishie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-19", "description": "In search of a cup of coffee, I wandered into this place while getting my car washed across the street. I was immediately struck by the no-nonsense, hole-in-the-wall feel of the place. While ordering my coffee, I suspiciously eyed the dozen or so bowls of truffles in the refrigerator case by the register. In an era of $7/bar artisan chocolate and flawless, upscale packaging and presentation, I was simultaneously turned off by and intrigued by this no-frills establishment. It reminds me of candy stores I've been to in developing countries.\n\nThen I spotted 'Earl Grey' among the truffle flavors and my curiosity (and the $0.60 price tag) got the better of me. The cashier threw in a caramel truffle, insisting that it was the best and I must try it. Oh my! The caramel was so smooth, creamy, buttery, toasty and complex, I thought this might be my first taste of real caramel. Couple this with the smooth, balanced cup of Cafe Grecco coffee, and look out. I might need to start getting my car washed more often.", "author": "Allison F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-13", "description": "Wonderful truffles made by a really sweet entrepreneur who's trying to make a go of it.  He's even got vegan truffles!  And many kinds at that.  The prices are the best you'll find.  I'm used to having pay bucks and bucks for truffles, and this is the first place I've found where you feel you're really getting a good deal.  The fact that it's a small business owner that's doing it all himself makes it even more worth it.  Definitely check it out.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "I would have never ventured into this place had I not seen the \"Stealing the recipe\" comments of the other posts.   If you put this idea into context  whom ever he stole these recipes from must have stolen them from someone else.  It is called \"training\".  You take a chance when you have someone else make a product for you.  Welcome to America ... btw we make Champange here too!!!  lol\nThe truffles are pretty good.... the intrigue and ingenuity deserves 5 stars.", "author": "John T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-11", "description": "In this new much nicer location it makes taking a walk in the Castro much nicer.  Try the \"Earl Grey\" ... amazing flavor.", "author": "Jhnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-31", "description": "Randomly came in today during a mid-afternoon urban hike.  \n\nThe truffles caught my eye while the barista brewed my Americano - which came out excellent - and I decided to order 3.\n\nDark Chocolate - rich, creamy... the moment I popped it in my mouth, I knew I'd discovered a rare treat.  \n\nHazelnut - have you ever imagined an entire bottle of Nutella, compressed into the size of a marble?  \n\nEarl Grey - love at first bite.  \n\nSuddenly, I'm at risk of developing a sweet tooth.", "author": "M. P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-20", "description": "Five Star Truffles deserves Five Yelp Stars!\n\nYummy truffles in a variety of flavors. Our faves are the black and white, espresso and the soy truffles.  The prices are pretty good - about $10 for a box of 20 truffles.  However you may end up eating a handful of chocolates at a time, so order accordingly!\n\nThe guys that run this place are the nicest guys around. They give samples if you ask for one too.", "author": "Mel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-04", "description": "i will share this secret.  you want theses truffles.  that's not the secret.\n\nthe secret is this:  the truffles come chilled.  but they are a mouth orgasm if you let them reach room temperature.\n\n* * *\n\nfive star truffle is reopened!!!!\n\n4251-A 18th St. in San Francisco, California 94114 \n\nhttp://www.fivestartruffle.com/", "author": "Peter K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-10", "description": "God dammit. Here I was all ready to write a glowing review about Divisadero's own little keebler elf and his chocolate magic land and I have to find out all of this? Extortion? Dishonesty? Poor buisness ethics?\n\nHe seems like a nice enough little guy. The earl grey truffles he pops out are fuckin tasty....\n\nBut to find out the man I used to visit each and every morning before work to reup on caffeine and chocolate was really just selling me sweet, sweet dishonety...Well it leaves me feeling a little confused, a little angry, and for some strange reason in need of a hug.\n\nI guess I'll just have to find another place to find the best hot chocolate in San Francisco.\n\nIt would have been 4 stars, but I knocked it down to 3 due to this recent discovery. I'll just consider it the chocolatey equivalent of the cheap ass grocery store knock off brand items I always end up purchasing cuz I'm a cheap bastard.", "author": "Steph-a-saurus, Grr. J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-05", "description": "I had the most disgusting latte of my life here - true!  It had NO foam... it was as hot as liquid coals.\n\nThe truffles were OK but not amazing and well... this whole place, including the candy, lacks soul.  The employees did not seem at all invested in the company or very interested.  They also didn't really speak English and couldn't even pronounce the names of the truffles.\n\nThere were a swarm of flies everywhere and a loud little girl who was catching them and screaming in delight when she smashed one in her hand.  All of that echoed in that empty, dirty little place and created quite an experience.  There was annoying loud dance music on, which didn't suit the place at all.  The dark chocolate and coconut truffles were pretty tasty.\n\nOverall, this place is more affordable than a fancy place, but somehow all the magic and soul were removed too.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-05", "description": "Not giving 5-Star 5 stars.  I've had better.  I tried about 10 different truffles one day, but the only one I really liked was the caramel.  I couldn't even tell the difference between several of the fruit flavors because they were just sugar.  There are better ways to get a choco fix.", "author": "Luke M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-29", "description": "Absolutely fantastic!  \n\nSure the decor is lacking but the truffles more than make up for it.  Melt-in-your-mouth nuggets of deliciousness.  The proprietor makes them on site and in a slew of flavors and types. \n\n$1.60 for a coffee and a taste of heaven?  \n\nHow can you beat that?", "author": "Adrienne J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-04", "description": "Wonderful truffles.  The owner is really friendly.  They even offer a free truffle with any coffee drink.  Can't beat it!  They serve cafe grecco coffee out of north beach, which is excellent.  Best coffee in the neighborhood!  Also, Apollo coffee up the street sells five star truffles.\n\nFive stars for five star truffles and coffee.", "author": "Luke G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-09", "description": "5 star truffles is fantastic. A great little gem on Divisadero. It falls under the radar and is just waiting to be discovered. But what a great little place.!!!! \n\nThe owner is not only a wonderful truffle maker but also very kind and always happy to help his customers. It is a steal, with any coffee you order you get one of his hand made truffles included. \n\nCome support this small business owner on Divis, it will be well worth it.", "author": "amy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-30", "description": "Definately sort of an odd hole-in-the-wall, but the truffles are pretty near identical to those from XOX in North Beach, and they're quite tasty, and they're pretty cheap too which is nice.\nHere's a tip: Earl Grey is a hell of a lot better than you'd think.  damn.", "author": "Don H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-25", "description": "Like, OH MY GAWD, right?\n\n\n This place is totally like that girl Laney in She's All That. I mean, you go into this place and think, omigod, what a DUMP! Who'd wanna be seen in this skeezy hole? Like, it's a total joke and you figure only a drama spaz or someone icky from the chess team would go here. Serious mathlete territory. But it's totally not like that. Because, like, once you get to know it, you get to thinking, y'know? And I'm not someone who thinks, but really, this place gets you to think stuff like Maybe it's not what you see on the outside that counts. I know, totally not me, right? But then you get a little taste of what they're really all about and omigod omigod omigod, you wonder what you ever did without it, you know?\n\n\n ~deep breath~\n\n\n Sooooo, you've gotta like get over your first impressions and try a truffle here. Or, like, five thousand of them. 'Cause they're like sooooooooo good!!! They're these little chocolate thingies and they're sooo sweet, and they've got like a million different flavors. Like, I totally don't like tea, 'cause that's like something English people would drink, and I'm like American and stuff? But I'm so in LOVE with the Earl Grey truffle. I don't even know who Earl Grey was, but I think he must've been totally cute and sweet. I wonder if he's royalty or something.\n\n\n ~deep breath~\n\n\n So, like, yeah. Quit being so superficial and try these truffles. I know the place is gross and it's on a skeevy street near Popeye's, and I heard that truffles are dug up by like pigs and stuff. But I don't care! I'm so totally eating like a whole BOX of these next time I get dumped. It'll be total sugar therapy. Not like I need therapy or anything, but like, you know, right?\n\n\n ~deep breath~\n\n\n So, mmm, yes. Good chocolate turns me into a giddy little girl.", "author": "Omid T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-14", "description": "YUMMEE truffles that TASTE & LOOK LIKE XOX TRUFFLES but  cheaper they're $ .50 each (while xox truffles are $.75).......thanks toro e.  for the background info on why this is so..........per toro e.'s review:   \n\"I (toro e.) had to ask the owner why it looked so much like XOX Truffles. It turns out that he made truffles at XOX for 7 years before opening his own store (with partners) in fall of 2006 at this Divisadero location.NO WONDER THESE TRUFFLES LOOK AND TASTE JUST LIKE ONES AT XOX!!!\"\n\nhad a variety of flavors on my 1st, which was also my last visit in december -- which were all good.  per reviews, need to try the earl grey....\n\nthough this place on divisadero  sucks in regards to interior ambiance compared to xox truffles in north beach, the reality with my not-so-rich self is that i'm going to have to go with five star truffles for the price -- i get more for my $$$.  besides i never eat 'em inside the store (even at the cute xox truffles store).  i usually take my truffles to go, so  i can choose the ambiance of where to eat those  'lil bites of chocolate nirvanas....................", "author": "Cindi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-14", "description": "This is one of the best bargains in the city.  \n\nGreat truffles - the best by far are the carmel, with the liquid center that caresses your mouth as it seeps out of the chocolate.  Don't chew it!\n\nYes, the same as XOX, but better location and much nicer counter service.", "author": "Bay G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-29", "description": "5 stars for the red wine truffle, 4 stars for the dark chocolate truffle, 3 stars for the mint truffle (mint flavoring was fake tasting). Avg 4 stars. This place is definitely not what I was expecting: It is much more bare bones than any other confectionery I have ever been too. The truffles are good but not as  pretty looking as Joseph Schmidt's. The truffles are in no way uniform in terms of size or shape but they are tasty and fairly cheap. \n\nA box of these for a party would be great and having a few while walking was a good source of sugar and a nearly perfect treat,", "author": "Courtney R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-12", "description": "I was really bummed when I was describing Five Star to my friend and she said that everything I just described sounded like XOX truffles. Oh well, I guess, no stars for originality, four stars for everything else.\n\nThe owner is super nice-I got a free truffle with my order. I haven't tried the coffee or hot chocolate but the truffles are superb. They're nuggets, or rather, nibblets, but the flavors are really rich and delicious. You'll savor them-well, considering the size, you'll have to savor them. \n\nI agree about the packaging-even with the fewer pieces, it should be simply, but nicely presented. These are truffles after all and each one should stand proudly on its own, not be clumped together and piled into a takeout box.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-14", "description": "Delicious truffles, one free with your coffee.\n\nThe coffee is pretty awful, though. I'll admit I'm a bit of a snob, but if you're going to try an interesting upscale quirk like truffles, at least serve some decent joe.\n\nThe owner is very friendly, seems like a great guy.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-09", "description": "A diamond in the rough. \n\nReal rough. \n\nSo rough, in fact, that I can honestly say I would *never* have walked in there (despite all the wonderful self-touting reviews taped on the door) simply based on the looks of the place alone. I know... how pretentious of me, but still. I want a place like this to lure me through the door, tempting me with seductive decor and glamourous wrapping so that I *need* to buy the goods just because they look so damn appealing . \n\nYes, I'm a sucker for sexy packaging.\n\nBut alas, my visual senses will have to take a back seat to my palate alone when it comes to 5-Star Truffles. I went in prompted by my girlfriend, on a hunt for the perfect champagne accouterment to give with our Christmas gifts. And after sampling flavor after delectable flavor, I ended up buying more than I could possibly give away. Which is fine because now there are more for me.\n\nSo yes, I've learned a valuable lesson here. Don't judge a book by it's cover. Forget that there is absolutely no curb appeal here whatsoever. These little nuggets of heaven stand up all on their own.", "author": "Bella B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-18", "description": "Unbelievable. Do not come here. The staff does not care for you at all! I ordered a truffle, paid, and when the man handed it to me, it dropped. I was not given another truffle, but was told I needed to purchase another one and \"there was nothing he could do about it.\" I'd go to Walgreens for a truffle than come here again.", "author": "Kimmy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-14", "description": "Great truffles, friendly staff. Stop in for a box or a single piece!", "author": "K. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-24", "description": "They are FABULOUS.  And only 50 cents:  AWESOME!!!!\n\nDon't let the look of this place fool you. Its all about the chocolate and all about my wallet so I'm all about Five Star.", "author": "Daryl D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-23", "description": "Simply put I know most everything about chocolate. I work for an unamed company that incorperates VERY high end chocolate, so basicaly I have had chocolate from all over the world(made and growen) and I must say i was very happy with these truffles. These truffles are not the best but they are really good, and for the pirce(0.50 a pice), i will most definatly go back, but dont tell my boss, he Hates that i eat chocolate from other places.\n\nby the way the coffee here is pritty good!", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-13", "description": "These guys learned their craft at XOX in North Beach.  The truffles here taste just as good.  It is conveniently located near to where we get our car serviced and washed, so we stop by a few times a year.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-12", "description": "What's not to love about .65 cent truffles!?  These are pillow like rich and creamy and decadent truffles; These truffles require no chewing; just melting.  Some of my favorites: raspberry, caramel, and lemon.  I really want a sea salt and Meyer lemon.  Such a low key place with wondrous truffles at a non-big city price.  Such a nice treat for body and soul--Five Stars truly is a Five Star.", "author": "Jaime Patricio M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-11", "description": "100% addictive truffles, made on the spot by the owner, who is super sweet.  Completely low-key place with truffles, coffee and a couple of tables.  I only tried the strawberry and the caramel and can't wait to go back to try the other flavors.", "author": "Kristen N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-10", "description": "I love this place.  Best hot chocolate, amazing truffles at an unbelievable price, and no snootiness.", "author": "Tamsen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-14", "description": "Easily one of the most accurately named places in the city!  I've now tried 5 different types of their freshly-made truffles, and they are all fantastic.  Seriously, next time you are in the dog-house, stop by, buy the lady some truffles, and prepare to reap the rewards when you get home.", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-08", "description": "I like this place and hope they do well. I found their prices very reasonable and the guy even cut me a deal since I was buying a bunch for a large party. I think the inside and the packaging could use a big makeover and it doesn't make me want to linger, but I'm there for the chocolate which is delicious. \nI checked it out before I knew about the whole \"recipe stealing\" drama, but I have to say, I don't really get it. I can't speak to the lying part, and if true, I wouldn't like being lied to either. But, I worked in high-end restaurant kitchens for 10+ years and I can't even count all the sous' to come and go, stealing techniques and exact recipes, and taking them to other places. A lot of guys skip culinary school altogether and simply apprentice in a bunch of kitchens with the express purpose of picking up things along the way. It's an open secret in the food biz and everyone knows it (that's why some places have their sous' sign non-competes or won't give recc letters unless you've been there for at least a year-- XO was lucky to have this guy for 3+). And why does he need someones \"blessing\" to start his own place? I've noticed more local artisanal coffee roasters popping up with the success of Blue Bottle. Are we really supposed to boycott them too if their roasters learned recipes and techniques from BB? Anyways, I personally don't think XO has much to worry about given their high-profile, friendly service and much cuter ambiance, but if Five Star can provide a similar product at a lower price more power to them.", "author": "C R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-08", "description": "OK, I really try not to eat too many sweets. But this is my idea--I buy 5 Star Truffles for OTHER PEOPLE. And the fellow behind the counter always gives me a bonus truffle to sample. And...I've noticed that you can peal off the sticker of the box and sneak another truffle or two out and seal it back up before presenting it to the recipient of your generous gift and no one is the wiser. Definitely worth the subterfuge. These little gems are fabulous.", "author": "Donna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-07", "description": "I have never actually been in this place, but as soon as I see that little chinese food to go box full of chocolate truffles, my face lights up! I absolutely love these little guys and could eat 15 in a row (which I probably did the first time my boyfriend brought them home). Once I was enlightened to the price of each truffle, I learned to savor them a bit more. Truthfully, they are worth every penny. My favorites include the cayenne pepper, raspberry, and hazelnut.", "author": "Julia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-19", "description": "I tried walking past without going in, but the smell of the caramel was too yummy. It's 10:41 a.m. and I am having Earl Grey truffles for breakfast.", "author": "Karlee D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-25", "description": "Okay so maybe these guys were just having an off day when I came in.  I dunno...I'm a sweets fiend and I just didn't think the dark chocolate truffle I had was exciting.  Maybe I should have gone for a more exotic flavor.  My iced mocha was pretty terrible too.  It was gritty, watery, and just lacked flavor in general.  They get one star because it's a default, one star for a free truffle with every coffee purchase and one star for having super cheap truffles.  Let's face it, I've got two birthday girls this weekend and no ideas so I can buy them each a gazillion truffles at 50 cents a piece and I don't have to eat them.", "author": "Jill D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-09", "description": "Went in for a cup of coffee not knowing a thing about the place or its truffles--or apparently the bitter chocolate truffle feud, but Santos gave me a free truffle with my cafe Americano, so I choose the coconut and that was all I needed to be hooked like a crack whore. Damn it was great with my coffee. I left the place with a variety of 40 truffles for a party I am having this weekend--now all my friends will be hooked too. Sharing is caring, so go and try a truffle and see for yourself.", "author": "Deborah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-06", "description": "who me?  truffles?  what?  i don't have any!  i don't know what you're talking about!  ridiculous!.... oh that?  around my mouth you say?  *lick* ....oh um....yeah i fell in on my face in some dirt while hiking...with zeus...um i mean he just totally dug his face in dirt and licked me all over...*smack*....what?  what's that?  i look like i'm having an orgasm you say?.....oh?....ohhhh....ohhhh...ohhhh!!!\n\nyeah.  truffles good.  $7.50 per box good.  owner very sweet.  me likey.", "author": "Josie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-15", "description": "Yes, the truffles are amazing - but lets not forget the other 1/2 of the business name - I had one of the best lattes in my life there this weekend AND I got a free truffle with it.", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-12", "description": "A few months ago I decided to try all of the truffles available and I have to say that the dark chocolate and caramel truffles are the absolute best! Consistently great truffles! And...for the holiday season, the nice staff can prepare truffle gifts in boxes with a ribbon to finish it off.", "author": "Ileana H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-09", "description": "Tasty tiny truffles! At fifty cents a pop, it's no trouble to buy a handful of these. You can get one free with a coffee drink, but I've gotta warn you, the dollar coffee is of the dishwater sort. So buck up, get a latte and pop a truffle in yo' mouf.", "author": "Nick D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-02", "description": "caramel truffle.\n\ntry one and sit down. no driving. it is completely intoxicating.\n\nsit.\n\nand it does feel like a corner store, bare, but they are brand spanking new, probably without the funds to splurge on decor.\n\ngood people, good truffles, good for me....", "author": "Walrus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-02", "description": "Yelp to the rescue again.  This time I find an awesome new truffle store in my neighborhood and a painless way to take care of office holiday gifts.  The \"regiftability\" potential is admittedly low (how thoughtless of me), but I can't imagine that'll be much of an issue with these delectable morsels.  The variety of flavors in insane, with the earl gray.truffle being a worthy choice among many.", "author": "Leon R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-23", "description": "I understand the frustation some of you are expressing about the supposed \"stealing\" of recipes and business idea, but you can't patent an idea like coffee and truffles - plenty of people could have thought of it.  And if you say the truffles taste different than I guess they're not the same recipes.  There are lots of recipes out there for truffles.   I for one would never make a trip over to North Beach just for truffles, but if I'm there I'll stop in XOX for one.  Five Star is far away from North Beach, so I find it hard to believe that they're stealing any business from XOX.  So, I think you should cut this guy a break.  He's trying to start a business with what he knows best - making truffles.  Plenty of pastry chefs learned from and got ideas and recipes from other pastry chefs, then took those ideas to their new jobs.  I don't really see the difference here.\n\nBottom line: the truffles are yummy, the coffee is good, the place is unpretentious & a great spot to go in while getting my car washed.", "author": "Heidi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-23", "description": "yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum yum.\n\nand at 50 cents a pop, you can yum yum yum yourself all the way home. or at least through the panhandle.", "author": "Bee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-07", "description": "This place is amazing! I walked in there and the owner was cooking caramel! You could smell it outside. Every truffle I have tried has been to die for... of course caramel is the best (and black and white). Not to mention you get a free one with every cup of coffee. LOVE this place", "author": "Katie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-15", "description": "Considering five star truffles is my facebook interest, I love this place.  I've been going to them since he opened the store.  The owner is the sweetest man who always has a smile on his face and even showed me how to make truffles.  The truffles are to die for and coffee is great and cheap.\n\nI love giving this place my business!    Go!", "author": "Alysa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-16", "description": "What an absolute pleasant surprise.  I was so happy that I found parking in the hood 20 minutes prior to my appointment at skin city...I walked into the shop to have a cup of coffee and then Santos, gave me a free truffle to go along with my coffee (what a score!).  It immediately melted in the mouth.  The coco on the outside of the truffle was the perfect amount of bitter to offset the creamy sweet inside.   Then I immediately thought about  serving them at my party.  Within the first hour of the party, all 40 truffles gone! Completely wiped out! I'm pretty sure that that someone licked the bowl.  Nice going Santos!  I'll be back for more:)", "author": "Valarie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-25", "description": "No more Mitchells! Instead, there are different types of hot drinking chocolates! The newly painted walls also make the place look much nicer!", "author": "Judy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-03", "description": "The interior of the place looks like a ghetto taqueria.  The truffles are the size of a quarter.  Don't go here if you're expecting Godiva-sized truffles!  BUT I HAVE TO GIVE THIS PLACE CREDIT FOR THEIR.......CARAMEL TRUFFLES.  Downed a whole take-out box of these little delectable babies and it sure made my soul smile, hehe.  Especially because they were so cheap!", "author": "Joellene B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-18", "description": "I thought my BF was joking when he asked me if I wanted coffee and a truffle on divis, B.B. is right--this place has zero curb appeal, which makes it even better! Sweet service, the caramel is super creamy, the earl gray delicious, and the hazelnut covered in a fine coating of mmmmm.", "author": "Sita B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-29", "description": "Wow!! My husband and I walked into this place to get a quick coffee and was pleasantly surprised to say the least. The man behind the counter (maybe the owner?) was incredibly friendly as he served up tasty coffee for a whopping $1.00. My husband ordered a latte -also tasty, and we ordered two truffles. THE TRUFFLES WERE FREE BECAUSE WE ORDERED COFFEE!! You can order 80 truffles for a measly $30. The service, the coffee and the truffles were all fantastic and I'm definitely going back.", "author": "kristen v."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-29", "description": "This rating is based on the coffee service ONLY.  I've been walking past this place and noticing \"Free Truffle with Coffee\" - so, I go order a coffee and I'm told \"Sorry, no decaf today.\"  I figured they were out, so waited a couple of days and tried again.  The guy said \"Well, we have decaf coffee but don't have a machine to grind it\" . . .HUH?  Why would a coffee specialty shop have no grinder?  Is that weird??  The owner is seriously lacking in some basics here.  Sorry 5-Star, until you get your coffee act together you're in the doghouse!", "author": "Barbara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-22", "description": "I had the earl gray, caramel and dark chocolate truffles and it was awesome. I also got a tasty soy cappuccino to go with adding a nice contrast. The owner was super warm and gracious. Great little get away while getting your car washed at Touchless Divisidero.", "author": "Sanaz E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-03", "description": "i recently moved a few blocks from Five Star Truffles, and happened to be walking by one day and though they looked suspiciously like XOX Truffles in my old hood, North Beach.  lo and behold, after chatting w/ the owner (Santos, nicest guy ever...and hardworking) i found that he had worked at XOX for years.  however, he assured me that his formula was different, better, and thankfully, CHEAPER (for us chocoholics...).   \n\ntho the decor leaves a little to be desired, who the f*ck cares when i'm staring at a refrigerator case full of tiny nuggets of chocolatey goodness!  their caramel is my #1 fave, followed closely by the earl grey.  and you get a free one w/ every order of truffles or a cup of coffee.  i actually got 2 free ones last time!  OH JOY!\n\nwhere else can you get homemade, fresh, beautiful, yummy truffles from a local business at 20 for $7.50?   yes, do the math, that's 37.5 cents a piece!  or 50 cents for one - i say buy in bulk!  they last in the fridge for a few months.  a nice thing to offer your guests!\n\nwe gotta keep them in the neighborhood...how about some local artists go in there and offer to help him spruce up his walls in exchange for selling their art???", "author": "Suzanne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-26", "description": "Pretty awesome. I've only had truffles once before just to give you all full disclosure and these were far better. Good prices since you can get truffles which are way better than see's candy boxes, they are cheaper, and the come in a box that looks like you just got back from a thai place.", "author": "Eric E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-21", "description": "5 stars indeed...  I used to be one of the few people in my little world who didn't like dark chocolate, but I sure love it now, especially the caramels and the earl grey truffles from this place.  Service is friendly, and the free sample is a nice touch.  The really bad thing is that I want to go here and get a box of 20 pretty much every weekend, and that is something I really don't need to do.  I know where I'm getting my holiday gifts this year, folks...", "author": "robyn s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-08", "description": "Stumbled across this place the other day. A couple \"D\"elicious truffles stumbled into my mouth. Kept on stumbling.", "author": "Shane B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-08", "description": "I hope my brother isn't right when he said he read somewhere that this place was closing down... sigh.. went for a car wash and decided to walk into Five Star - and WOW, I do love their truffles. i'm pretty sure we bought 20 truffles two days ago and we only have two now. Addictive and flavorful, hopefully they'll still be there next time I show up! (Favorites: hazelnut, cayenne (beware the kick!), any liquor....)", "author": "Jeannette L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-11", "description": "gave me a sample right off the bat (I chose vegan dark chocolate):  two stars.\nhad VEGAN truffles for my lactose-intolerant sister: two more stars\noffered me a taster of a second flavor on my way out the door (flavor: black & white): two more stars.\nConclusion: six stars.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-18", "description": "Umm... five stars? The homemade, super cheap truffles are delicious! They always throw in a few more than you order and give a free sample. Don't bother with the coffee though, it's terrible. Just eat some more truffles.", "author": "Leah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-18", "description": "This is  a super car busy intersection, but there's a parking lot that oddly enough is under used and pretty easy to access. This means there should be nothing stopping you from getting some of these delicious treats.  It's not real showy, but it's clean and very straight forward: glass case and a note... very good thing.  The place is like the neighborhood: a secret pocket of goodness and the owner's don't get much nicer. I recommend it, it's nice.", "author": "jesse l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-09", "description": "It's alright.....the size of the trufflles are uneven, you can't tell which one is earl grey or what .... some are half domed some are nugget looking... unattractive. The flavor is there but can't compare it to a high end- made by a Chef. Looks like rejects from a restaurant....  I'm not surprise if it's cheap....the quality is lower but a quick fix for a low price.", "author": "freewill m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-07", "description": "in my neighborhood of countless coffee shops, i eschew all others specifically to come here.  and i'm not the only one, as this establishment draws a line of caffeine-starved patrons eagerly awaiting its opening each morning (despite the presence of several other coffee-purveyors less than a block away).  the owner is sweet and little excites me more than, after handing over my cup of morning (or afternoon. or evening.) coffee, which is always tasty, he asks me \"Would you like a chocolate?\"  Because I get one free with every cup of coffee.  And hell yes, I would like a chocolate.", "author": "Dani B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-12", "description": "The caramel truffles are AMAZING!!! I love this place and totally want to support it - but I usually struggle wtih how many truffles does a girl *really* need... I need to start buying these and giving them to all my friends :)", "author": "sara m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-27", "description": "This place is classic SF... before all of the \"gentrification\" that everyone loves to complain about.  It's small, virtually un-decorated, and honestly not terribly appealing... and I mean that all in the best way!  I'm not sure I'd hang out there and eat truffles and drink coffee, but get a box to go and you'll be in heaven.  The Earl Grey ones are amazing, but I didn't find any that I didn't love, honestly.  It's so refreshing to see truffles as they are supposed to be... lumpy, small... I know that doesn't SOUND good, but it is!  Almost without exception, desserts that look amazing don't taste amazing, due to all the cornstarch and gelatin and crap that makes them look shiny and nice.  Truffles were originally named for their appearance, and has anyone seen an actual truffle lately?  Ugly little buggers.  So, to wrap this up.. go support this little guy in the chocolate world because he's genuine and kind, his chocolates are genuine and down to earth, and they are trying to make it in a world where \"genuine\" is a rare word to use.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-30", "description": "oh crap.  delicious chocolates available on the way to my girlfriend's house.  cheap delicious chocolates.  my attempt to eat less sweets is dangerously close to failing.", "author": "Peter H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-05", "description": "um. yum. will update review when i actually come into the store (have been avoiding an in-person visit in an effort to keep a well proportioned booty. my friend snuck a box into my fridge. cute lil smallish thank GOD chinese take out box filled with truffle delights. these were bite-sized dark choco truffles filled with the most divine caramel and dusted with bitter cocoa powder. heaven. plowed through them in 5 days. not bad! love you mean it.", "author": "Mary V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-19", "description": "The truffles here are to die for.  I tried the hazelnut and caramel truffles and experienced a fabulous taste explosion in my mouth!  The storefront could use some help....we walked into a swarm of flies and it looked more like a donut shop. For a chocolate shop, I think it should have a more polished look. And they could use help with packaging for take away orders...they use chinese fortune cookie boxes.  I'd love to get a box to give as a gift, but I'd have to repackage them before giving it away!", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-19", "description": "This place is ghetto, but the truffles are indisputably good. Pick up a box of 20 to go and pop them in your refrigerator. You even get a free sample with your purchase. They will last a while, or as long as you and your fat ass roommates can resist popping every last one into your mouths.", "author": "M. W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-18", "description": "been going here since i lived in this hood, four years ago. their chocolates are bar none and their sampler boxes make the best holiday gifts. although, i hear chase bank wants to move in and put up a branch.   :(  just another reason to hate chase. as if there weren't enough reasons already....", "author": "abby c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-17", "description": "nearly identical to xox truffles, just as good, and an alternative location that may make it more convenient for other people who dont especially want to go to north beach.", "author": "christopher a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-23", "description": "The truffles are delicious and the service friendly (owner operated).   This is the kind of shop I would go out of my way to support.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-02", "description": "best hot chocolate and mochas... our new favorite, good stop while getting your car washed too", "author": "Thomas B."}
