{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "My favorite vendor at the Eat Real Fest was Frozen Kuhsterd! \n\nI ordered the ube custard bar dipped in ube chocolate, topped with ube cake crumbs. Pure ube madness! Can't get enough ube! Every bite was amazing, and it didn't give me that weird taste after you eat something sugary. That's how I knew it was made with the highest quality ingredients! I couldn't finish the entire thing because it melted, and the chocolate shell got a little too sweet by the end-thankfully they served it to me with a plate. But it was sooo delish!", "author": "Megan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "I tried Frozen Custard at Undiscovered SF in August, and it was amazing! I tried the white chocolate matcha custard bar with Ube chocolate dip and dark chocolate drizzle. It was absolutely amazing! The chocolate was just the right amount of creaminess and sweetness. My friend got the coffee custard bar with dark chocolate dip, and he also enjoyed it.\n\nI will definitely be going there to try some of the other desserts!", "author": "Nikki G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "WOW. Best experience ever!! Jack London Square is where I was introduced to this incredible treat..!! \nIf you happen upon their stand... stop!\nYou'll be very happy you did...", "author": "Mary R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-13", "description": "While this isn't my favorite frozen custard food truck, I can't deny how yummy their custard is. It's actually pretty damn good.\n\nI've been to this truck a few times at different Off the Grid events and festivals, and I can honestly say that their frozen custard is pretty standard. I'm pretty boring when it comes custard flavors because I usually stick to vanilla. Something about original vanilla custard just drives me wild. But for the more... \"adventurous\", they usually have at least 4 different custard flavors to choose from.\n\nBut the toppings?! I'll be adventurous with those! I'm a sucker for almonds and sauces on top. I would highly recommend the pairing of almonds and burnt caramel because it's simply delicious AF! A dynamic duo that will taste delicious on practically any flavor of frozen custard. If you wanna get wild and crazy with it, you can always make it into a sundae or a donut sandwich! They also sell donuts for purchase here, but I've never actually had them.\n\nThe prices are pretty comparable to any other frozen custard truck but all of those fancy toppings can add up quickly. I usually visit this truck while it's at the Pleasant Hill OTG and it never seems to be too crowded. But if you see them at Oakland First Friday's or any type of local festival, be prepared to wait. If you're a lover of frozen custard, I would give them a try.", "author": "Shayla B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "I never had Ube and the custard style popsicle. One bite and It was so divine. The flavors was so amazing. I will try the Cookie Monster next time.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-12", "description": "We went to Alameda location 2 weeks ago since Frozen K. was scheduled but sadly... they were not there..", "author": "Regine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "Frozen Kuhsterd is for sure one of the better ice cream trucks within the bay area. I got the opportunity to try it out when I was at the Live 105 BFD music festival earlier this year. Since I'm pretty much addicted to anything with s'mores, I just had to order the s'mores sundae!\n\nPrice-wise, it was a bit expensive for the quantity that was given, but it was still totally worth it. You can taste the quality within the ice cream and toppings. Each bite just kept tasting better and better. The moment I finished devouring it, I already wanted another one!\n\nIf you are ever near this truck, be sure to chase it down! Forget about counting your calories. This is perfect for your cheat days. ;)\n\nIG: @ravenousfork", "author": "Tam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "We were at outdoor event in Lafayette and I thought I was going to melt. This truck helped...got 2 servings of the custard with a variety of toppings... I am a fan.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-20", "description": "Frozen Kuhsterd has been on my to try for ages and ages and when they showed up at my company's OTG event, I was sooooo excited! Granted, they brought with them a very limited tasting menu so my experience definitely isn't one that I can compare to a regular OTG/food truck experience.\n\nBut anyways, I tried a scoop of their toasted coconut flavor and thought it lacked a fair amount of coconut flavor despite being amazingly smooth and creamy. Towards the end, it was also just unbearably sweet. My friend hypothesized that my topping of corn flakes was to blame. But I thought the cornflakes did add a nice crunchy topping for a change in texture.\n\nThat said, I'll still be more than willing to bear the lines for a real Frozen Kuhsterd experience whenever that may manifest itself.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Ordered the s'mores with cookies and cream ice cream and it was amazing! A little pricey for the small cup but it is heaven. Perfectly roasted marshmallow with graham cracker cereal that tops this cup to perfection. Beware of how delicious it is. I highly recommend the s'mores.", "author": "Peanut P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "STILL a must try and still a personal favorite. Not only do they have unique flavors, but they also have various ways of presenting those flavors; whether it be simply in a cup, in a donut sandwich, bread pudding style, etc, and now they also have Frozen Kuhsterd BARS. Yes that's right, bars. \n\nI revisted Frozen Kuhsterd on National Ice Cream day at SOMA EATS, so you bet that they had something special in store for everyone. Their normal ice cream truck sadly had no line and I couldn't understand why and then I turned around and saw their frozen kuhsterd booth selling the bars and it all made sense - everyone was trying out their new creation! My friends and I still grabbed a scoop of ice cream from their normal truck to hold us over while we wait in line for the ice cream bar hehe. We tried the red velvet cookies and cream. The way I had imagined the ice cream to be from the sound of it was that it would be red velvet ice cream with crushed cookies inside of it. However what it ended up being was vanilla ice cream with red velvet cookies crushed inside of it, so there wasn't too much red velvet flavor in it. \n\nWe finally made our way through the line for the bars and we ordered their popular S'more's bar. I love the new ways people make s'more's! They use a vanilla ice cream bar, dip it in chocolate which acts as the adhesive for the graham cracker, then they smear marshmallow fluff on it and torch it. Sounds delicious right!? And the taste delivered! It was like eating a frozen s'more, something I would definitely have again!", "author": "Maleah M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-10", "description": "Wanted to grab dessert before I left Off the Grid: Fort Mason last Friday, March 4th. Wanting to try a new place, I picked Frozen Kuhsterd. I stopped by around 8:30pm.\n\nI ended up getting a Single scoop ($3.50) of Four barrel coffee. The frozen custard was rich and creamy with great coffee flavor. The custard is actually really dense, so I didn't need much to satisfy my sweet tooth. In fact, I didn't even finish the scoop. You can also get your custard with toppings or in sundae or sandwich form.\n\nThe cashier was nice, but when I went to pay, she moved the iPad and I accidentally the $2 tip option. Apparently I didn't have to sign for anything as it processed right after. I tried saying something, but she was already moving on to the next customer. This is partly my fault as I should have been pushier. I would have tipped a $1 anyways, so it was only a $1 more. I was more annoyed at the principle of the matter than anything else.\n\nGood frozen custard, but watch out for the automatic credit card approval process. You may end up tipping 57% like me!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-08", "description": "Gluttony standing 10ft away alert................\nI love their concept....creative frozen custard with a scoop-able experiment.\nNot your ordinary boring kind of day. Starring at their truck I see this cupcake on top of custard? OOOOH and AHHH's I'm crying and really want one.\n\nTGIF because it was CHEAT day and too bad I'm at OTG... what did I order?\noh with multiple choices of frozen kuhsterd I got four barrel coffee flavor with many choices to top it off! I'd like the burnt caramel on top and a choice of cupcake. Ooohh is that chocolate? I'll take that! Paid and stepped to the side for about 3mins, and wala! BOOM HEAVEN!!!!!!!!!!!!!!!!!!!!!\n\nThanks Frozen Kuhsterd!!!!!!!!!!!!!!!!!!!!!!!!!!!", "author": "Kathy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-15", "description": "I am not a huge fan of frozen Kuhsterd custard just because I find it pretty rich and overly creamy. However I recently tried their Filipino chocolate rice pudding dessert (\"chomporado\") and it was so satisfying and perfectly sweet. YUM!!\n\n4 stars just for that - can't wait to come back!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "So glad I tried this food truck! It satisfies any sweet cravings.\n\nI got the four barrel coffee flavor with burnt caramel and marshmallow toppings ($5). The dessert was large and easily shared between two people. The frozen custard was soo creamy and smooth. I thought the burnt marshmallow fluff on top was very unique. I really enjoyed it!", "author": "Linda X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "I was ecstatic to find out about the Haight location. My favorite is the Napa Sundae ( Vanilla ice cream, caramel, EVOO, and Himalayan salt). OMG! Love, Love, Love. Must try. The staff are super friendly and has great customer service.", "author": "Jess T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Place: it's a small store and has no seating places. It's located next to a cafe which I liked, because I was able to feed my kids (6yrs and 9yrs) some lunch before feeding them ice cream. It's located in a nice neighborhood, but parking can be problematic, but I think that's a problem wherever you go in SF. This place wasn't too far from the Golden Gate Park. We went to the Koret Children's Quarter Playground afterwards to have the kids play off the ice cream. \n\nFood: I'm not a big ice cream fan place and I really liked the ice cream here. I didn't try any of their specialties, but I liked how you can dip your ice cream with your choice of toppings. My kids dipped theirs in the milk chocolate and it was kind like eating a Crunch bar or Hagindaz bar of your choice. I dipped mine with the Oreo crumbs and it was scrumptious. My husband got the Thai ice cream dipped in the vanilla chocolate and it was pretty yummy. I would definitely go again just to try the other stuff on their menu.", "author": "Mad D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "Can I just have the Thai tea and white coffee one delivered to me bi-weekly!? For a girl who doesn't like ice cream, I sure have a lot of favorites. \n\nThe consistency of this sweet treat isn't really like ice cream. It's more so on the side of a frozen yogurt, but more stiff. Eventually it melts like ice cream does and turns into slop if you don't eat it fast enough. It's quite unique and thus that's why I like this place. \n\nThai tea has strong thai tea flavor! None of that weenie light stuff. Don't you hate when you can barely taste what something is suppose to be? \n\nWhite coffee. I had to ask them what white coffee was. The kind man said it was similar to sucking on a whole ungrounded coffee bean. Wouldn't it still be brown?? o_O It's white FYI, hence the name. Well whatever that sorcery, it was my favorite out of the two, but both are pretty close!", "author": "Dianna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "OMG! I have Tiffany D to thank for as I saw her pic of her red velvet cupcake sundae the day before and met up with her Saturday as Frozen Kuhsterd foodie truck came to the Oakland Chinatown Streetfest! I was debating what to order as you know I am so indecisive! I actually had a scoop of their frozen custard awhile back that I wasn't very enthused. It was just okay back then.  \n\nBut my mind changed recently as I went for their cupcake sundae.  They actually have other concoctions too.  I am a changed person now!  I had the chocolate cupcake with coffee frozen custard and caramel topping.  Dang that was pure sweet heaven bliss!!! If you like ice cream and cake then this dessert is for you.  But doesn't everyone like that???\n\nI was searching for the dessert truck the next day and was very sad they weren't around.  I felt very lucky that they came to the Streetfest and it was so very convenient for me!  If you stumble upon this truck, don't you dare pass it up bc you are missing out on one of the best desserts Ever!!! I gave it one less star bc it wasn't there Sunday or they don't come out to Sactown enough if ever???  I'm sure you can find them in the Bay fasho!!!  I better start following them on social media now!  LOL.", "author": "Karen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Sorry vegans.... #alltheeggs.\n\nIf you've never had frozen custard, go, now. You are missing the bomb-diggity deliciousness of rich creamy frozen delight. Kuhsterd's got this down to a T, with the BEST Four Barrel Coffee flavor ice cream, just for the fact that it's custard. Also great is the standard Vanilla, you will NOT find a better tasting ice cream texture at any store or window. No, you don't taste the eggs--you just taste rich and creamy goodness.\n\nIf you've ever had Haagen Daaz, and can appreciate it's amazingness, do yourself a favor and get some Frozen Custard because that's like straight up clouds in a cup o'custard.", "author": "Nerissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "Tried this cute food truck for the first time at Off the Grid. I ordered one of their frozen Popsicles with a vanilla base. I just wish I remembered the name of it, but it was a variety of red velvet, chocolate fudge, and I think cereal dipped on it. SO MUCH GOODNESS!! I was worried it'd be like having diabetes on a stick, but surprisingly, the ice cream wasn't overly sugary, and the cooled fudge made it a super soft and warm treat......my mouth is watering.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "Hi, I'm Olaf and I like warm hugs!!!!\n\nOkay, so it's not that Frozen.\n\nThis is frozen custard.\n\nI'm really liking their Thai iced tea and their coffee flavor here.\n\nWith the check in, which they don't even check I just mentioned Yelp, I got a free sticker and a free topping.\n\nSo I settled on their coffee custard with the condensed milk topping. So basically it tasted like a Vietnamese coffee drink.\n\nLet it snow!", "author": "Jack R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "Had an interesting experience tying frozen custard for the first time at Off the Grid Fort Mason. Though prices were pretty steep for would be ice cream, what really makes me appreciate this tent is that the flavors are so unique. For example, I got the Napa Sundae and I still taste the olive oil with sea salt in my mouth. My favorite however is the coffee with oreo crumbles.\n\nOverall, a bit too pricey, but still an experience worth checking out. I think it's a great addition to OTG and hope it stays for a while!", "author": "Bryan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-16", "description": "The company I work for hired Frozen Kuhsterd to host dessert for our entire staff, roughly around 200 employees. I was very excited at first as it was a nice and sunny, but not too hot, but perfect for a frozen treat. The FK staff did a good job at pumping the frozen yogurt out in a timely manner with the mass amount of people waiting for some creamy goodness.\n\nThey offered the following flavors: Vanilla Bean, Four Barrel Coffee, Chocolate, and Burnt Caramel. I sampled a few and they were not too bad, but as a few other Yelpers, pointed out, they were pretty sweet. I am not a frozen dessert snob, but I really could not tell the difference between FK's offerings and a large tub of Dryers from the grocery store. I do not mean to bash on them, but I was fairly disappointed they did not offer some of the odd ball flavors that Yelpers were posting pictures of on FK's page. As for toppings, they brought along some crushed almonds, oreos, corn flakes, and sprinkles. Not too creative, but not too terrible either as most expect that at any ice cream or gelato shop.\n\nI would love to sample some of the other flavors if I get the chance in the future as they may much better than what I experienced today.", "author": "Ryan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-18", "description": "I'm not sure why I haven't grown an obsessive fondness for frozen custard. After all, I'm the one who orders caramel flan for dessert at a Mexican restaurant when others order churros. Custard pie was my favorite as a child. Not apple, not blueberry, but custard with the nutmeg sprinkled on top with a side of Cool Whip. So why was I not overjoyed when I saw this truck at the Friday Night Market at Civic Center? I think it's because I didn't grow up with it like Midwesterners did. You wouldn't buy it in the frozen food section of Jewel Supermarket. You had to get it fresh at a shop with a spigot big enough to let that intensely dense cream come out in a slow ooze.\n\nYou can tell there's a ton of butter fat and egg yolks in frozen custard to satisfy the high-risk sweet tooth. Founder Jason Angeles learned to make the real thing at a two-week crash course in St. Louis, recruited three buddies as partners and became an immediate hit among the hipsters at various food truck congregations in the Bay Area. And why not? They serve all the cool-sounding creations like the $6.50 Dynamo Donut Sandwich; the $6 Napa Style Sundae with burnt caramel, Himalayan salt and EVOO; and the absurd self-indulgence of the $16 \"FK Your Diet\" Sundae which sounds like your basic kitchen sink (photo: http://bit.ly/1xdFjop).\n\nJamie W. and I were feeling the need for a bit of dessert and decided to try the $6.50 S'mores Sundae which allowed us a choice of our own frozen custard flavor, two layers of honey graham crackers, chocolate syrup and toasted mini-marshmallows on top (photo: http://bit.ly/1Fzf9Oc). Although they offered temptations like White Coffee, Strawberry Basil and Thai Tea, both of us felt Vanilla Bean made the most sense given all the sweetness in that cup. I must be getting old because I found the concoction just way too sweet to enjoy fully with the best part the toasted marshmallows since they did evoke my days as a Cub Scout in front of the campfire with the scoutmaster leaning toward me and...uh, never mind. Somebody hand me that blowtorch.\n\nSUNDAE - 3 stars...lots of sweet ingredients that ended up being too overpowering for me but hey, to each his own\nAMBIANCE - 3 stars...party truck!\nSERVICE - 3.5 stars...they put it together pretty quickly considering the toasting needed for the marshmallows\nTOTAL - 3 stars...audience for these sweets appears to be a lot younger than me..I just suggest they see a dentist afterward", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "I like it when you do it right thurrrrr. Right thurr!! \n\nGot me some of that donut bread pudding sundae and went straight to frozen delight heaven. \n\nOhhhh boy!! This truck is explosive!! Don't be hesitant, dive in. These desserts are hitting heavy on the sexiness Richter scale. Worth every calorie.", "author": "Rosalyn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I give this place 5 stars. Jason the owner has great customer service and I like the fact that he uses organic ingredients.", "author": "PremiumShotz P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Who doesn't like super rich, creamy ice cream sandwiched between a variety of carb-filled desserts? Frozen Kuhsterd's creations are decadent and ideal for those who like their sweets combined with even more sweets. You have desserts combined with other desserts that are dessert-flavored - I had a red velvet cookies and cream custard sandwiched between a creme brulee donut with condensed milk. There was a lot going on in each bite (in a good way) - red velvet cake, cookies and cream, the burnt caramel and vanilla custard of creme brulee, sweet fluff of the donut, and the light glaze of condensed milk. I could feel my heart start to race from all the sugar, and it was glorious.", "author": "Hali M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "Nom Nom FACTOR ALERT!  \nI got the donut bread pudding with frozen custard. I was very pleased. The donut was ON POINT full of cinaminny GOODNESS and what brought it all together was the frozen custard  it was the perfect amount of sweet that wouldn't make your teeth hurt.  I am definitely coming back! The customer service was great, very nice man taking my order.", "author": "Claudia T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "Stopped by for the Eat Real Festival to get something cold to eat since it was SO HOT that day. My friend and I decided to split the Kouign Amman Sandwich ($8), which was rich and decadent. This is definitely quite the hefty dessert, and although I enjoyed it, I would prefer just the kusterd in a cone/cup versus in a kouign amman. However, I'd recommend trying this once if you're a kouign amman fan!", "author": "Amy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "Brownie points for trying something super weird - ie. virgin olive oil in ice cream o_o It was interesting, but I don't know if I'd go and get that ice cream flavor (napa sundae) again.", "author": "Belinda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "I got the chance to try Frozen Kuhsterd at a recent Yelp event. The available flavors were horchata latte and cereal milk. Of course, I asked for one of each.. (; \n\nThe horchata latte was basically a coffee flavor. I love the taste of coffee, so I really enjoyed it. However, the cereal milk flavor blew my mind! It really tasted like cereal milk -- creamy with a hint of cinnamon. This is a flavor I would love to buy a gallon of to keep in my freezer. I can't recommend this particular flavor enough. \n\nThe two employees serving us were both very nice and polite as well. I love it when small businesses have both a great product and great employees. I will definitely be on the lookout for this truck whenever I'm in town!", "author": "Liana B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-14", "description": "Not nearly as good tonight @OTG Cupertino as I remembered from Bacon Fest 2 years back. Scoop of Four Barrel Coffee frozen custard was a little icy, left a fine-grain texture on my tongue, and lacked coffee flavor.\n\nVery disappointing.", "author": "Lindsey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "Why have I not gone here sooner?! I've seen this truck on various occasions but never tried it until coming to the Eat Real Festival. Not many places do custard or if they do it tastes too much like yogurt but Frozen Kuhsterd knows their ish when it comes to making a great custard!! \n\nI'm one of those types of people that is scared to try new things so I didn't want to try their \"different\" flavors like cookie butter or cereal milk lol maybe next time. I got the vanilla bean and topped it off with burnt caramel sauce, OMG!!! It was to die for!! I'm picky with caramel but that was the best and I honestly could have had that alone lol but the custard was wonderful too, it was creamy and rich and I would take that over regular ice cream any day. Now whenever I see their truck there's no way I'll be able to pass it by cuz it's that bomb.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-27", "description": "Frozen Kuhsterd is one of the food trucks that I had my eye on.  Noticed that they were on the schedule for Off The Grid Alameda and Off The Grid Pleasanton.   So, I went to both places in order to try them out.\n\nAt Alameda, my wife and I each ordered a different sundae.\n\nChamporado Sundae with Vanilla Bean Frozen Custard was my wife's choice.  I was not too impressed with this combination.  Turns out that I like Champarado better without frozen custard.  My wife liked the sundae better than I.  (3.5 stars)\n\nDonut Bread Pudding Sundae with Vanilla Bean Frozen Custard was my selection.  Enjoyed it better than wifey's order.  I do not know if they make their donuts or someone else makes it for them.  Was not crazy about the donut,  The Vanilla Bean Frozen Custard was delicious, though. (3.5 stars for this sundae)\n\nIn Pleasanton, only I had ordered something from their truck.\n\nNapa Style Sundae for $6 includes Vanilla Bean frozen custard, burnt caramel, extra virgin olive oil, and Himalayan sea salt.  Was intrigued by the flavor combination.  Wifey did not care for it.  I, on the other hand, thoroughly enjoyed every spoonful!  Yummyness!!!  (4.5 stars)\n\nIn the future, I probably will stick to just their frozen custard flavors and not have any sundaes. They only have 4 flavors available each time, and they rotate the flavors.  Hopefully, I will catch them at times when they have some of their erotic flavors available!", "author": "PatrickJ T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "I've had Frozen Kuhsterd a few times, most recently at Spark Social. The Thai Iced Tea was spot on. Add some five star caramel sauce and a horchata cupcake (a little dry, but forgivable), and it makes for the perfect indulgent delight. \n\nDefinitely go for a sundae or at least one topping!", "author": "Cristina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "Money can't buy happiness, but it can buy Frozen Kuhsterd.. and that's basically the same thing. ;)\n\nThey're at different places every day, so check their website or their twitter to see #WheresFK. I had the pleasure of catching them at the SF Friday Night Market. The Night Market itself was pretty lackluster, so the only place we got food from was Frozen Kuhsterd. Getting dessert before a real dinner... why not?\n\nFrozen custard is ice cream that is made with a higher egg yolk content, making the ice cream creamier and denser. They make a bunch of different flavors, but only serve four on a given day. We got a scoop of Vanilla Bean and a scoop of Thai Tea with condensed milk and corn flakes. It was basically happiness served in a cup. Although it was freezing already, I couldn't stop scooping more ice cream into my mouth! \n\n1 scoop for $3.50 or 2 scoops for $5. Each topping is an additional 50 cents, but you get a free topping if you check into Yelp! So what are you waiting for? Go get FKed!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Without question, the best ice cream and dessert place in the bay area!! Stop thinking and start heading over there now!", "author": "Joel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "They came out for Off The Grid: Great Mall. I was at work and I already had some food from the other food trunks that was around them. And I wanted to get desert. \n\nMy manager and I wanted desert. He kept it simple with a one scoop vanilla bean with Cinnamon Toast Crunch while I got the s'more sundae with chocolate ice cream. \n\nI devour it. It was so good.\n\nI would come back to them if they come back out for off the grid.", "author": "Kristy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "These guys were at the Yelp Oakland zoo family event and they were super nice.  \n\nWe tried samples of their vanilla bean and coffee kuhsterd and we really enjoyed them.  I've got to say that I like the kuhsterd better than ice cream!  \n\nWe've got to take a trip down to their storefront soon!", "author": "Veronica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "I was drawn to the blue truck with the anthropomorphic dessert cup logo. I'm not sure what 'West Coast style frozen custard' is supposed to be, but I was curious to try.\nThey have a plethora of flavors, including the classic and familiar, some alcoholic, as well as some very strangely intriguing ones, like White Rabbit candy, Avocado, and Miso. Even their toppings are unique, like tapioca balls and ramen. \nIt seems like their trucks serve only a few flavors at a time, which makes sense. It wouldn't be the best use of their resources if they loaded up dozens of gallons of different flavors into a truck all at once.\nIt seems like Cereal Milk is very popular. I tried the one from Momofuku and while it was good, it wasn't amazing. So I got a double scoop of the Four Barrel Coffee & Thai Iced Tea for $5. Two generously sized mounds of custard plopped into a plastic cup. It was deliciously sweet and creamy, like I thought it would be. To me, both had an interesting gritty texture, probably from ground coffee beans and tea leaves(?).\n\nIt's cool that they have partnered with several local coffee & dessert shops and created some very decadent sundaes. It seems like they come up with new combinations all the time.\n\nKids Scoop: $2.50\nSingle: $3.50\nDouble: $5\nSundaes: ~$6-$7\n\nI'd be interested in trying out other flavors, especially White Rabbit candy, or Ube, or Coffee Mint Mojito.\nI enjoyed it, but I'm still left wondering what makes frozen custard different from ice cream? Also, what makes this custard 'West coast style'?", "author": "Joy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "This sundae treat on a Friday was royalty! \nFrozen Khusterd didn't disappoint. Vanilla layered Icecream over burnt caramel, splashed with EVOO topped with melted marsh mallow...Heaven was here on earth for the few minutes it took to devour it!", "author": "Dee R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "I tried Frozen Kuhsterd for the first time recently and can say I'm a new fan :) I saw on the OTG Facebook page that they were going to be offering White Rabbit one day and knew I had to give it a try since I absolutely love the candy!\n\nThey hadn't officially opened for business when I arrived but they were very friendly and answered my questions as well as let me try some samples.\n\nI sampled their White Rabbit and it absolutely tasted like the candy. I was very impressed! When it came time to order I ended up adding burnt caramel as a topping. The burnt caramel was good, but it took away from the flavor so next time I would consider going topping-less to really savor the flavor of the frozen custard.\n\nI follow them on social media now as I am eagerly awaiting the next time they will be offering White Rabbit, or any other flavor that might tickle my fancy. They've got sundaes and other goodies too which I may just have to try some time :)\n\nDon't forget to check in on Yelp to get a fee topping!", "author": "Carnita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "On any given tuesday the local Off the Grid showcases several food trucks, this one being one of the better dessert trucks that I have had.\n\nThere ever changing flavors of ice cream always amaze me when I stop by there truck, yesterdays options which I never see anywhere was white rabbit (as a flavor for ice cream), and few others, everything that I had here was good, primarily go for the bread pudding which is semi warm making all the ice cream around it melt, \n\nServed in a medium sized cup, bottom small top wide, so you can access the bottom if needed, bread pudding, topped with white rabbit flavored ice cream, let me just say JESUS CHRIST this is good... AMEN!!!! bread pudding is slightly dense, easy to cut with a spoon and delicious with every bite, I do recommend the white rabbit ice cream to pair with the bread pudding \n\nI will be back again and order other items but for now that bread pudding is the way to go\n\nbread pudding with ice cream *****\nservice ***** smiles from all staff\nprice $\nambiance **** food truck no place to sit, bring your own seat, table, canopy =)", "author": "Clarence A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "Love their Napa Style Sundae - Scoop of Vanilla Bean frozen custard with a bottom layer of burnt caramel, topped with Extra Virgin Olive Oil and Himalayan Pink Salt. Bomb! At $6 each, they are a little pricey but so worth it!", "author": "Veronica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-27", "description": "Don't forget to check in for the free topping! Ran into this by chance while we were out looking for lunch. There were a couple of food trucks out in Foster City and I couldn't resist getting some dessert. One scoop proved to be enough for me; it's really filling.\n\nGreen tea strawberry topped with oreo crumbs: not that much green tea, more so strawberry. It was disappointing to find no hints of matcha. Otherwise, it was a nice treat.", "author": "James N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "In love with their cereal milk flavored custard! You know it's good when I come back for more! It reminds me of the cereal milk soft serve at Momofuku Milk Bar in NYC. It tastes just like the leftover milk you slurp on after you eat all your cereal. They soak their custard in corn flakes to give it the nostalgic cereal milk flavor. I've also tried their four barrel latte custard. Not a fan.\n\nThey currently run in a food truck, but hopefully, they'll have a permanent store.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "7/14/15 (update):  Much better \"ice cream\" this time around, compared to my last try of their vanilla, which was icy.  I call it ice cream cause that's what it tastes like.  Not the smooth, rich, frozen custard I make at home anyway...\n\n1. Li Hing Pineapple Sundae $6.00: Good flavor mix but somewhat simple.  More simple than other offerings I've had of theirs.  No sauce as far as I can tell.  Just marinated pineapple, whipped cream, and a sprinkling of the \"Li Hing\" powder, which kinda tastes like the Mexican sweet chili spice they use on various dried fruits.  I got their Mexican Chocolate for the ice cream--it turned out to be a good match for the Mexican-like spices.  5/10\n\n2. Mexican Chocolate \"custard\" [not]: As mentioned previously, doesn't taste like custard.  But at least in this case, it's good ice cream (I can't say the same for their other variations.)  It's smooth (great) and definitely has a strong Mexican chocolate taste.  Very good.  I think this is the strongest ice cream I've tried from them yet.  8/10\n\n3/5\n\n#truck #icecream #frozencustard #sundae", "author": "Dean C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "If you want some smooth cream in your mouth that will get you FK'd in more ways than one, you gotta get some of my personal faves: Thai tea, Burnt Caramel, and Vanilla Bean. But if you can't choose just one, you might as well get a sundae [and] \"FK your diet\" that gives you sampling of a few of their delectable frozen kuhsterds.\n\nBut I do want to put this out there. Jason, the owner puts a whole lot of thought into his frozen kuhsterds.I remember before he even got his truck and was still carting his flavors, how particular he was with his flavor profiles. He held this taste testing event in San Francisco simply to choose the best \"vanilla\". All of us were blind folded and remember all of them were so good! This just goes to show how much he cares about his product and those that he serves. \n\nGreat frozen Kuhsterd, great team.", "author": "The Fuzzies S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "huge fan! from food truck to cater to the store! i love them!", "author": "Jan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "FK is the king of Asian flavors.\n\nI had the black sesame custard one night and was hooked. I was eating dinner elsewhere one night and they offered me ice cream: green tea or black sesame? \nWell, duh I went for black sesame since I was craving FK.\n\nugh. waste of calories.\n\nThat black sesame ice cream was garbage. I've had a few FK flavors now: vanilla, white chocolate, avocado, black sesame, Thai tea and DAYEEM! My favorite is definitely the black sesame, but the Thai tea is so good. It is SPOT ON. You know what the avocado custard tastes like? Vietnamese coffee shop avocado shakes. You know which ones I'm talkin about, the Viet coffee shops that serve it to you with the extra milk on the side *wink wink* \n\nAnyway, for my Yelp buddies and FB friends who have been asking me where the heck I keep eating these FK sundaes at every single week, *LIKE* the Frozen Kuhsterd Facebook page to keep track of their whereabouts and see the menu! \n\n... and yea, I know. I have a problem. All good. I love bad b1tchezzzzz that's my fuggin problem... and I love FK that's my fuggin problem. SO FUGGIN GOOD\n\n\nP.S. When they have the Kouign-amann sammie available, ORDER IT.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "This review is long overdue, but sometimes I like that I may forget to write reviews, and then revisit a place after awhile and still get wowed.  So the first time I visited the Frozen Kuhsterd truck was a few years ago at SOMA Streat.  We actually shared a scoop of the milk tea flavor.  And everyone who knows me knows I don't do milk tea because I only like the fruity Americanized teas, but this was so good.  It had a teeny subtle tea flavor, and the milky flavor worked well the creaminess of the custard.  It was thick enough and not too sweet.  We also got to talk to the guys for a few minutes, they are so sweet!  \n\nFlash forward to last month at OTG Serramonte.  We just like a slew of other people still wanted dessert even when it was freezing cold.  So we waited in line for dessert.  But there were so many choices..I'm not gonna lie, I was tempted to get the cronut ice cream sandwich or a silvana ice cream sandwich.  But we kept it simple with a scoop of cookie butter custard.  It tasted just like the awesome Trader Joe's cookie butter, and was nice and creamy.  The single scoop is huge too, so you definitely get your money's worth here.  Maybe next time we'll be adventurous and get toppings, but the custard here doesn't need it at all, because it's great on its own.  \n\nGet some of their custard when you see these guys trucks and you won't be disapointed.  What if it's freezing out?  You still won't be disappointed for sure, because the satisfaction in your stomach will outweigh the cold.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-02", "description": "They were the MAIN reason I showed up at Sunnyvale's 2nd Annual Fry's Food Truck Event and I'm sooo glad I got to experience it. THEIR CUSTARD IS THE BOMB!!!! The guys behind the truck were super friendly and they let us sample their custard before we made our decision on what to order.\n\nWhat I swallowed:\n\nCOFFEE CUSTARD: I don't even DRINK COFFEE but this ish was the BOMB! YUMMMYYY!!!\n\nMILK CEREAL CUSTARD: YUMMYYYY! WTH! MORE PLEASE! \n\nI completely forgot what the second one was.. but I remember once I tasted it.. it was a hard decision to decide what to order..\n\nWhat I ended up ordering:\n\nMAPLE BACON DONUT SANDWICH with MILK CEREAL CUSTARD and BURNT CARAMEL SAUCE: If I could SLATHER this thing all over my body I would.. I couldn't stop eating this! I was very sad when my dish came to an end. I keep dreaming of the damn custard.. it's THAT GOOD!\nhttp://www.yelp.com/biz_photos/frozen-kuhsterd-san-francisco-3?select=ys0CRv-iRRySKs2l-vIOxg#WZdHNL9F0VWPRGLf1GQcbA\n\nOn my way home from the event, I looked over at my friend and we both agreed we shoulda ordered some more custard to-go. Dang.", "author": "Vivian A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-24", "description": "Over the past couple of years, I have gone to this truck around 7 times. Four of those seven times, they were sold out of what I wanted (even though it was only 30 minutes after they opened). Twice, they weren't ready to serve certain items.\n\nThey seem to be either overstaffed or short staffed and unprepared for business.\n\nThey've upped their prices. Six dollars for a tiny scoop of frozen custard is a bit much. Their cupcakes were tiny and on the stale side when I've tried them.\n\nI need to stay away from this truck.", "author": "Ladi Da A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Grabbed a cup at the How Weird street fair and it was delicious.  They have a number of delicious flavors.  I opted for a coffee mix with Oreo cookies on top.\n\nInitially I had good intentions and planned to share with friends.  After feeding each of them a bite, I devoured the rest of it (whoops...).  Absolutely delectable, I look forward to grabbing another cup soon!", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "Off the grid: Cupertino ~4/21/15\n\nI'd love to give this place a 5...but once again the customer service was just plain RUDE.\n\n*Jason, the owner of Frozen Kuhsterd is a very nice and honest seller. From my last review, he addressed the issue, and gave me ice cream that was of Frozen Kuhsterd's size standard. I gave it a second chance, and was impressed by the normal and generous size. Very friendly/professional, and handles his business well.*\n\nHowever, the customer service was straight up rude and mean today. They called me out as \"Oh. YOU were the girl that wrote the BAD review.\" Okay, so double scoop is on the house, but the employees decide to use it as a leeway to complain and humiliate me for writing such a bad review? Isn't this backfiring? It caused a mini-commotion among the customers, and it was embarrassing! And then the guy, I don't remember his name, tells me that that the small scoop that I had was normal, and it shouldn't have been \"an issue\" and etcetera, claiming that he worked there for so long and that tiny tiny scoop is normal, since they apparently \"don't serve anything bigger, it's ALWAYS been this SMALL\". No, it has not always been that small; it's obvious from yelp pictures, personal experience, and word of mouth.\n\n***He tried to put the blame on me, and nagged at me for writing a review that was bad, saying that it wasn't their fault the scoop was tiny and defending himself/FK, even though I came in happy and didn't even inquire about the past incident.\n***Very Unprofessional and Whiny***\nThe employee kept addressing me as the \"girl who gave a bad review\", and this is no way to treat a customer. How you treat me/service/food/etc is how I rate honestly...and you should not be complaining...other people review honestly too, good or bad.\n\n I think by me going there to get the  scoop, it should have been a happy thing; since last time the scoop was considerably very small, so it would have made up for it, but instead you guys lash out at me. Not cool. Even though I appreciate the ice cream, the customer service is pretty bad. \n\nHowever the owner is very generous, and does care about customers, and quality of ice cream!", "author": "Julie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-15", "description": "I'm a one man kinda woman.\n\nWell, that's until a little man in blue came into my life.\n\nHis name is Mr. Frozen Kuhsterd and he's the BEST I've ever had. PERIOD. http://www.yelp.com/biz_photos/zvqoeNxrfZKqbUFlNiKplg?select=ys0CRv-iRRySKs2l-vIOxg#Bjd4gffkw5ViLGesRvXdUA\n\nHe comes in different flavors but vanilla custard is my favorite, perfectly scooped on top of his beezie, Ms. Butter Love. I guess you can say, I had a menage a trios. My first ever. *Giggles*\n\nButter Love's Pear & Grape Pie A La Mode w/ Vanilla Frozen Custard & Burnt Caramel Sauce ($7)\nhttp://www.yelp.com/biz_photos/zvqoeNxrfZKqbUFlNiKplg?select=ys0CRv-iRRySKs2l-vIOxg#ys0CRv-iRRySKs2l-vIOxg\nLuscious chunks of sweetly tender pear and grapes tucked inside a sinfully rich and insanely flaky buttery crust with an incredibly mouth-watering crumble made me tingle. Thickly dense and deliciously aromatic creamy vanilla custard made my body quiver. Together, Mr. Frozen Kuhsterd and Ms. Butter Love made each one of my toes curl, both eyes roll to the back of my head and made my heart skip a beat.\n\nPure, subliminal ECSTASY.\n\nBite after bite, Mr. NSS glared at me with a big kid pouty face about to go kick rocks.\n\nMr. NSS: \"You look like you just had multiple orgasms; I wish I can do that to you.\"\n\nMe: \"There, there Snookums, you may want to try for ONE first.\"\n\nOTHER NOTES: \n*Very helpful and friendly staff.\n*Over 40 flavors; 3 available each day (Cereal Milk is most popular).\n*$3.50 single scoop, $5 double scoop, $6 sundae, and $7 pie parfait/a la mode.\n*Partners with Boba Guys (for sundaes) http://www.yelp.com/biz/boba-guys-san-francisco-2#hrid:XW2eKfPr7WU3DUQkdWtzbA and Butter Love Bakeshop (for pie parfaits/a la mode) http://www.yelp.com/biz/butter-love-bakeshop-san-francisco\n*They're at the SoMa StrEat Food Park every Saturday from 11 AM - 9 PM http://www.yelp.com/biz/soma-streat-food-park-san-francisco.\n*Also available at Suika Bento Café on Wednesday-Saturday 6 PM - 10 PM (extended hours not listed on Yelp) http://www.yelp.com/biz/suika-bento-cafe-san-francisco#query:Frozen%20Kuhsterd.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Disclosure: These 4star reviews are soooo irritating! You don't like it because it's creamy?! That's the point of \"Custard\". I'm so sorry there are so many dummies out there, but this is Yelp and it attracts the loud and stupid, but really bumping it down a star affects the positive visibility of the business, they're better off without your 4star review. 5 or bust. Anyway. Just saying. If you're looking for Fro-yo there are plenty of places on every corner. \n\n\nThis is the only dessert I ever need again. I didn't see the FK your diet sundae or I would have had it! I love everything they offer and want all of it every time. I had the donut breadpudding sundae with burnt caramel and vanilla bean khustard. I want one of these permanently in Alameda. Omg! Heavan. This and some Korean Fusion and I can die happy. Seriously eat my dessert first errrrrrry time this truck rolls through. God Bless Khustard!", "author": "Stardust N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "The best excuse for a cheat day.  Their vanilla  is not like your basic vanilla ice cream.  My favorite is their burnt caramel. Only the best toppings as well.", "author": "Gin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "LOVED the Four Barrel Coffee and Thai ice tea flavors, which we sampled before going all in. The scoops were very generous, and two scoops will only set you back $5. The also have sundaes that feature their vanilla bean flavor, but where's the fun with that?", "author": "CQ N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "My friends and I trekked through the streets of SF looking for this truck. Yelp directions led us astray, and we ended up on the wrong side of town... but we couldn't give up as we had already put in so much effort!\n\nWhen we finally arrived, I ordered a scoop of bourbon kettle corn with burnt caramel. It was really tasty, and the flavor was unique! I could actually taste the bourbon! It was a little on the sweet side, especially with the caramel, but it was still good. It had great texture too - denser than your typical ice cream, but still smooth and creamy. \n\nAlso tried some of the four barrel coffee custard - less sweet with a very strong coffee flavor, perfect for coffee lovers.\n\nGreat customer service!", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-20", "description": "Okay Thai Tea was amazing. It tasted exactly how the drink tastes and that's all I could ask for. I do want to try one of their special concoctions next time but thai tea was perfect for my first time. \n\nI tried this at Off The Grid: Serramonte and the flavors they had that day were Vanilla Bean, Thai Tea, Mint Cookies and Cream, and Cookie Butter. \n\nSide note: I'm still so confused as to what \"frozen custard\" is. It looked and tasted like ice cream so I don't mind at all!", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "It was a hot, blistering 4th of July at the Island Reggae Festival at Santa Clara Fairgrounds and I was tipsy, dehydrated and HANGRY! While there were plenty of food trucks, all had insanely long lines and I was about to throw a bf if I had to wait to get some food. Thank the lord baby Jesus that I decided to angrily walk around until I stumbled upon this diamond in the rough. There was no wait and service was quick. I originally wanted the S'mores sundae but they were out so I settled for the Napa Style sundae. And OH EM GEE, so thankful that I did because it was deliciousss! Who knew EVOO, Himalayan sea salt, and burnt caramel would go so well with ice cream?! The vanilla custard ice cream was unbelievably creamy and melted like buttah. This place is AWESOME and I wish they had a location in SJ.", "author": "Jenny O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-16", "description": "Finally, an ice cream type truck! d:\n\nNo really, it's quite good. Custard itself is creamy and lightly sweet. It's a good idea for a base in a frozen dessert and the guys who make it, make it well. \n\nTheir menu is pretty interesting. Definitely some Asian inspiration going on in there. I was very curious for the boba sundae but ultimately wanted the Thai tea custard. But it was sold out. \n\nSo, I got the vanilla custard with house made chocolate sauce and cinnamon toast crunch. I got a small so that was $3.50 + 50 cents per topping. Kind of pricey, but the quality is there.\n\nTheir product is advertised as creamy and dense with a smooth finish which I can now vouch for. I liked the texture and the flavor overall.\n\nMy co-worker got the pear pie sundae thing which was crazy good. I shied away from that because it was $7, but it's worth a try.\n\nOverall good truck. I've been wanting to try it again ever since.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-16", "description": "Yumo!\nTheir Irish coffee custard is delicious!!\nThe guys who run it are really cool too!", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "It's no secret that some like it thick for a soft landing.  At Frozen Kuhsterd, you can have it thick for sure but don't expect a soft landing.  This dense stiff serving of frozen goodness is sweet, creamy, and silky smooth as you allow a spoonful of Kuhsterd happiness to slowly melt in your mouth.  People like Elite Ringo M. aka 'Food Kid fAAt City' and friends hunt down this truck with an adventurous sense of foodies' excitement and anxiously wait long lines just to do a little bit of Akinyele and put it in their mouths.  If Crystal Johnson came by with Akinyele we'd definitely see her singing 'Put It In Your Mouth' with a whole new set of lyrics:\n\nNow you can lick it, you can lip it, you can taste it\nI'm talkin every spoonful don't you waste it\nBaby, come line up, so FK can fill our cups\nIt's frigid lickin good, and I'm wishin Kuhsterd would\nHave an extra truck so the line can move fast\nI'm always sprung about to order after 30 mins passed\nJust eatin me a Kuhsterd\nThe way FK dish it out they pack such a tasty treat\nAnd I can eat it up\nI put it in my mouth\nPut it in your mouth\nI said your salivating mouth\nI said your Kuhsterd fiendin mouth\nAnd we could just eat it up\n\nYou know which one I would put in my mouth? In my FK lovin mouth?  I'd take down that Four Barrel Coffee with Cornflakes for that crunchy texture to go with that beautifully smooth custard.  It's rich but you won't find it hiding any Benjis.  Somehow, this Frozen Kuhsterd has the power to make you leave feeling like a million bucks after taking up your time and a few bucks from your pockets.  Impressive.", "author": "Colin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "Tried them out at the large sactomofo event.  I ordered the regular cronut with the cinnamon toast crunch custard and the cereal on top.  It was good and didn't have to wait that long, but they are a little pricey.  I would definitely try them out again.  Too bad they are not usually in Sacramento and only bay area.", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-22", "description": "Frozen Kuhsterd at Eat Real Festival 2012- Vanilla3 (cubed), Blue Bottle Coffee and \"Cinnamon Toast Crunch\". Cinnamon Toast Crunch is my favorite kid's cereal...now in frozen custard form. That's hot.  Sundaes $5 - Boba Guys' Sundae - scoop of choice, plus condensed milk, choice of boba OR almond jelly. Bacon Waffle a la mode -Liege bacon waffle topped with burnt caramel and scoop of choice. FK Breakfast - scoop of choice topped with condensed milk and choice of cereal. Halo Halo - Flan Flan ta-tas's leche flan topped with scoop of choice, ube and crispy rice. o-m-g, to die for. These guys are sundae geniuses. \n\nAt Yelp East Bay Beerwalk Empire event - Dark Chocolate Stout and Honey Graham Cracker. Tried both. Dark Chocolate Stout was my favorite because it wasn't super chocolatey like chocolate ice cream and not overly sweet. \n\nFrozen Kuhsterd is as addictive as ...falling in love. :)", "author": "Liv K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-22", "description": "We ordered Frozen Kuhsterd for the night before the wedding celebration.\nThe ice cream is too sweet and the taste is not impressive. The staff wasn't bad but wasn't too helpful.\n\nNext celebration I would order another company .", "author": "Lilly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "Delicious! Tried the Napa Style Sundae and was pleasantly surprised by the way the olive oil complimented the ice cream. Also tried a cupcake sundae with a vanilla cupcake with vanilla ice cream and strawberries--a yummy take on a strawberry shortcake. I'd definitely try them again to explore their other combos and flavors!", "author": "Susan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-06", "description": "I tried this \"frozen custard\" at Foster City's off the grid.  This is not authentic frozen custard. I grew up in The Midwest, home to frozen custard. This was very icy ice cream.  I was extremely disappointed.  I would definitely not recommend it.", "author": "Karen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "This truck is pretty awesome. I've had frozen custard from quite a few places and trucks, but I don't think I've ever seen as many options as this place. Lots and lots of toppings to choose from and also sundaes too!\n\nI just wanted a light dessert and got a single scoop with no toppings. I was most curious about the Cereal Milk flavor. Like, \"Noo, it can't be. Is it gonna taste exactly how I think it's gonna taste?\". And yeah, it tasted exactly how I thought it was gonna taste. The first taste I could distinguish was that of pure cold milk, but then the sweetness immediately hits. It's literally just like a creamy frozen version of the milk leftover after a bowl of honey nut cheerios or something. The texture is lighter than other frozen custards I've tried. It's a bit more soft serve-y, but still very creamy and packed with flavor. \n\nYeah, pretty awesome indeed! Would love to come back and try other flavors with toppings next time. I saw that they also let you sample flavors before you order, so definitely taking advantage of that too!", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "Hello, my name is Clarice and I have a serious case of \"hungry eyes\" (literal English translation of a Filipino phrase which means what you see look so delectable that your appetite becomes exaggerated to the point that your perceived hunger becomes greater than your actual hunger, resulting in a lot of leftover food). I usually am able to keep this \"affliction\" a secret, but Frozen Kuhsterd's FK Your Diet Sundae proved too much of an opponent that I had no choice but allow the hungry eyes to win.\n\nI have been following their truck on Twitter for a while now but for one reason or another, our paths have never crossed until they made the fateful decision to be part of Off The Grid: Pleasant Hill, which is near me, at a time when I can actually make it. At last, thought I, here is the chance to see if they are worth the hype. \n\nTheir flavors that day were Vanilla Bean, Four Barrel Coffee, Cereal Milk, and Thai Tea. I was already pondering getting the Four Barrel Coffee and Thai Tea while willing my curiosity about the other two flavors to go away, when I saw they offer Halo-Halo Sundae. For a Filipino girl like me who keeps seeing halo-halo posts on her FB feed for the past two months, that was really a delight! Forget getting just two scoops, I wanted a Halo-Halo Sundae. But of course, my eyes simply had to look at everything and rested on \"FK Your Diet Sundae - all of our flavors and toppings with your choice of Mission Mini Cupcake and Doughnut.\" I looked at their selections of cupcakes and doughnuts and they had NUTELLA and salted caramel, respectively. \n\nI am an entitled girl who believes she can have it all, and by golly will I have them all. I like frozen custard. I like cupcakes. I like Nutella. I like doughnuts. I like salted caramel. I shall have frozen custard, cupcake, and doughnuts. I shall eat them all! Woe betide anyone who tries to tell me about calorie count and such health stuff. So FK Your Diet Sundae is what I finally settled on.\n\nI was awestruck the moment I saw the sheer monstrosity that my hungry eyes made me order. I was the recipient of the hateful \"How can you be slim and eat all these frozen custard?\" glances (Hungry eyes, people, I order considerably more than I can eat). I was stopped by a few people so they can take a picture of my frozen treat. I was overwhelmed. But I ordered it and I stood by my order.\n\nSo, the frozen custard. Oh. My. Goodness. How did I exist on this Earth and not have had this amazingness a part of my life heretofore? The custard is smooth and rich, creamy and not overwhelmingly sweet. It is difficult to decide which one of the flavors that day was my favorite, but I can tell you that mixing all four flavors together in one bite was heaven. The Nutella cupcake was moist and delicious, and the salt from the salted caramel doughnut counterbalanced all the sweetness going on in my palate. Their FK Your Diet Sundae may have been a monster, but I want that monster to hide under my bed so I can have it for midnight snack. I want that monster to be my friend.\n\nI did not finish the sundae, but I am a certified Frozen Kuhsterd fan. Till next week at OTG: Pleasant Hill (yup, I know you will be there June 11th and 25th)! Your Halo-Halo Sundae and I have a date!", "author": "Clarice O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-19", "description": "The cool/risky thing about these guys is that you don't know what flavors and sundaes they're going to have when you visit - some interesting, some traditional, but all very creative. The menu seems to differ from day to day, but thankfully they were handing out samples when I came, so that was helpful in making my decision.  \n\nI visited them (or more accurately, was on a MISSION to find them) at their tent at Maker Faire. Their prices were a tad higher than usual due to vendor fees, so a single scoop was $4, while a double scoop was $6, and toppings were 50 cents each, including burnt caramel, sprinkles, chocolate and strawberry sauces, etc. I ordered a single scoop of cookies and cream (a safe flavor for me) with chocolate sauce. The flavor of the chocolate sauce was a little off but it wasn't a big deal because the frozen custard was still good! I sampled the cereal milk flavor, but it might be an acquired taste. My boyfriend got the donut sundae, and they had some interesting (but delicious-sounding) types of donuts for that. The size was slightly smaller than we thought it'd be, however the owner mentioned he had to use smaller donuts for this event. I guess I just need to visit them at their truck instead sometime!\n\nThere is a check-in offer for 1 free topping and 1 free sticker. With that, my scoop with one topping was only $4, and you get a cute sticker of their mascot.\n\nI think my expectations were too high because I was a teeeeny bit underwhelmed afterwards. Everything was pretty good, but I was not blown away like I thought I would be, and it was a little pricey for the size (given, these prices were a little higher than normal). I would still come back though, for the creative flavors and combinations...aaand because I am a dessert addict and I want to try their \"FK Your Diet\" sundae, Cookie Monster, and boba sundae. Yum!", "author": "Brittney K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-19", "description": "Frozen Kuhsterd is a Frozen Custard Dessert Truck. I had a wonderful \"taste\" when the Truck was parked at the Heritage Day festivities at Old Borges Ranch in Open Space Walnut Creek. It's not quite up to Wisconsin (e.g. Leon's) standards, but it's pretty darn good.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "I've had Frozen Kuhsterd two times and I loved every bit of it! Frozen Kuhsterd isn't as thick as ice cream and not quite as thin as frozen yogurt. It's somewhere in between but it is definitely rich and creamy. I can't get enough of it. I feel like there is always something new every week. It surely keeps it interesting and has me wanting more and more. I think their newest creation was the white rabbit candy turned into Frozen Kuhsterd. One things for sure, it never gets boring here and it's exciting to see what else they come up with!\n\nThe first time I tried Frozen Kuhsterd I had the burnt caramel with the burnt caramel topping. Anyone who loves caramel has to order this! The second time I ordered the cookie monster and halo halo bread pudding (which was one of the specials that week). The cookie monster was exactly how it sounds! It came with three different cookies with two different kuhsterd flavors. I ordered the coffee and cookie butter kuhsterd flavors. Super delicious and I'm pretty much addicted to cookie butter in general. The halo halo bread pudding was satisfying and it was a good mix. I also tried a mini roti kuhsterd bun from Honeyberry. If you've ever had a roti bun from Honeyberry, you can already imagine how good it is with a scoop of Frozen Kuhsterd! It's a match made in heaven! \n\nLastly, I always say- no matter how cold or foggy it is outside, there is always room for Frozen Kuhsterd! Now go and get some!", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "Even if San Francisco was the coldest city in the US and I'd still probably find every reason to visit these guys. Forget Italian Ice, gelato, froyo, or ice cream, kuhsterd in the frozen form is where it's at. As a current east coaster facing unbearable summer humidity, it's hard not to seethe from jealousy after trying the myriad of flavors they have available day in and out.\n\nThere is no shortage of wonderful flavors, all must be sampled at some point. There are seasonal concoctions and lots of \"premium / exclusive\" flavors worthy of palate experimentation. One cannot go wrong with any of them, which means it's a win-win for all!\n\nMy favorites from their exclusive flavor line are: Ube (purple yam), Black Sesame, Cinnamon Toast Crunch, Vanilla Bean, and Maple Butter. If you're looking for something with a bit more \"umph\" it's time to move to the premium bunch of frozen kuhsterd. Ones like Reposado Tequila, Buena Vista, Red Velvet Cake Batter, and the Coffee Mint Mojito are straight game changers. It's all stupidly good that wanting another is only a natural reaction.\n\nThe dudes running the truck are super friendly and they sure know how to turn a profit. From around $3.50 a scoop or $5 for two, some folks might wince a bit considering the portion size. If it's just about the experience, throw in some extra $ for a dynamo donut or waffle. Sprinkle some bits of extra toppings to really make it rain.\n\nOne last request: Please come to New York?", "author": "Jando S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "I've seen this truck a couple times at OTG & finally save enough room to try it at Stonestown location. Soooooooo good! I had the donut bread pudding with salted caramel custard. The custard was the highlight! Next time I'll have to try the coffee flavor.", "author": "Charlyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-24", "description": "Came across the gem at the Eat Real Festival. I've been coming to this event ever since its inauguration. And boy was excited for Frozen Kuhsterd.\nIt was nearing the end of our day at ERF, but we needed a dessert, we stumbled upon this massively long line and when we saw the menu we decided to wait in line. \nLets just say it was TOTALLY WORTH THE WAIT. We got the Boba Sundae but the secret one where it was boba AND almond jelly. \n\nSo good, wish we got two. \n\nCan't wait to spot this truck again!", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "Got a chance to try at the Tech Carnival.\nWaited in a huge line, but it was all worth it.\nThe guy behind the counter was super friendly and really made my frozen custard experience fun. And made the wait fun too. (honestly I didn't even know it could be fun lol) Normally people who serve you dessert look like they hate their job.. but not this one.\n\nI tried the Thai tea flavor and Coffee... super delicious.\nThe thai tea really tasted like frozen thai iced tea.. the flavor was there!!\nSame with the Coffee flavor. It tasted like there were fine ground coffee beans there.\n\nWorth a try!!", "author": "Suzie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "I'm a fan! love my ice-cream that doesn't melt too fast.", "author": "E T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "I forgot the exact name of what I had because I experienced memory loss bliss after the sweet concoction. all I know is, there was a red velvet cupcake, vanilla custard, and condensed milk involved. life changing for sure! \n\nwill be stalking out this truck from now on.", "author": "Nicolette P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "Destroy my healthy eating habits any day! What guilt do I have? NONE.\n\nMy boyfriend and I shared the Potato chip frozen custard with burnt caramel sauce and Donut bread pudding sundae. \n\nBe careful! Donut bread pudding sundae does contain some traces of peanuts since my boyfriend had to stop eating it sadly. Don't want no allergic reaction while we were out.\n\nBut I'm pretty sure he wanted to order everything there after walking a bit in the heat.", "author": "Corie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-06", "description": "THAI TEA!\n\nThe most amazing and creative flavors accompanied by superior customer service! Yes yes, how can you go wrong!  Very rich flavors and on the sweet side but definitely worth the wait for them to finally be at SJ movable feasts", "author": "Grace M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-02", "description": "For real, for real, for real my heart bursts with Filipino pride when I discovered Frozen Kuhsterd.  I first encountered this arctic delight at the Eat Real Festival 2013 - the \"bibingka Sundae\" caught my eye.  At first I thought was this a typo of some sort? Upon closer inspection I realized this is the same \"bibingka\" from the motherland. \n\nPeaked my interest and peaked my taste buds. First a lesson in Bibingka- Bibingka is a type of rice cake from the Philippines traditionally eaten during the Christmas season. There are different variations, oh but the taste. For me it's not just the taste but  the fond memories of Post-Christmas eve mass...So, naturally I stood in line for this \"bibingka sundae\" - the sundae came with a scoop of thai iced tea custard layered in between 2 slices of miniature bibingka cakes and drizzled with ube (purple yam/taro sauce.) \n\nWhat a brilliant way to turn an unexpecting bibingka into a masterpiece - which instantly reduced me to a fond childhood memory. Bravo Frozen Kuhsterd!\n\nThey also had a surprising take on the ice cream sandwich - not with cookies but with miniature donuts - I mean holy hell (Donut) HOLE - amazing.  Maple Bacon Donut with Four Barrel Coffee Custard - \n\nI was so impressed with Frozen Kuhsterd that I did my internet stalking, I mean research, and here's what I found:\n\n\nhttp://fareandsq.com/2012/05/10/qa-sweet-talk-with-jason-angeles/\n\nDo yourself a favor, whether you're Filipino or not, make your way to Frozen Kuhsterd!", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "So during Game 7 of the World Series 2014, I decided to buy myself an early celebration treat since I knew the SAN FRANCISCO GIANTS were going to win! And of course they did!\n\nI got the maple bacon Dynamo Donut with chocolate ice cream and caramel sauce. Truthfully, I hated the donut and ended up scraping all the ice cream and caramel off of it... But the ice cream and caramel were amazing. The ice cream is really creamy and surprisingly not too sweet. They gave me a pretty generous scoop. I think it may have been because there weren't too many customers since everyone stayed in to watch the World Series. My lil girl got their graveyard special which was chocolate ice cream covered with Oreo cookie \"dirt,\" gummy worms, and a speculoos cookie. She finished hers quicker than I finished mine! \n\nThe customer service was also great. The workers were helpful at helping me make up my indecisive mind. I would definitely repeat this place. It's too bad that the day I finally decide to try this place, it was their last appearance at OTG: PH.", "author": "Char D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "When I went they only had 2 flavors available: Thai Ice Tea, and Vanilla.\nI got the S'more with Thai Ice Tea Frozen custard.  It was good. The two toasted marshmallows on top was a nice touch in addition to the graham cracker crumbles and the chocolate syrup. \nIt seemed a tad pricey for the amount I got, but this is inside a food truck park, so it's expected.", "author": "Heejin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-19", "description": "I found this truck at an Off The Grid food truck event in Pleasant Hill. I got the Napa Style Sundae for $6 which is vanilla bean frozen custard, burnt caramel, extra virgin olive oil, and Himalayan sea salt. It was very delicious but pricey especially for the small portion the give you.", "author": "Tootie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "Great customer service and delicious custard!! Super creative sundaes and custard flavors :) can't wait to try some more next time! Oh and adorable free stickers, too great.", "author": "Jordyn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "It's no wonder this place has such high reviews. The service is personable and the recipes for their ice cream combinations are unique. I tasted Frozen Kuhsterd at a Halloween event yesterday and the two guys manning the booth had the most adorable ice cream cart ever. \n\nMy group got the boba soaked in Jameson + some sort of ice cream that I didn't quite hear the name of. Boba and ice cream? Whaaaat???! Yes to my surprise, it actually  tasted delicious. The boba was squishy and the ice cream was so creamy. I tried both flavors that they had, and thought the pumpkin flavor was on point. The texture of the ice cream was smooth.\n\nThe guys at the booth were prideful in their operation and recipes. They have a food truck, but I hope they get to open a store soon!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "My work catered from this place for an event and it was pretty good! I tried the Thai tea flavor and it really did taste like I was slurping down a cold Thai tea, minus the ice cubes. I also tried the cereal milk flavor, which tasted like vanilla, but with a subtle cornflake flavor. I liked the Thai tea flavor better, but both were good.\n\nYay for frozen treats at work!", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "UM. OMG. HOW HAVE I ONLY RECENTLY DISCOVERED THIS???\n\nI recently met Frozen Kuhsterd at a networking event they were catering, and let me tell you, this stuff is LIFE CHANGING.  I was a little hesitant to commit myself to one scoop of Thai Tea and Black Sesame frozen custard.  Between the two, the Black Sesame really spoke to me, and even though I'm not a huge Thai Iced Tea fan at restaurants, this was absolutely to die for.  Being on a wedding diet, I make myself available to only a few cheat meals, and this was absolutely worth it.  Having had the opportunity to really pick Jason's (the founder of Frozen Kuhsterd and an absolute kick-ass/rock star guy) brain on how this concept came up, and it only makes me want to hit up their truck even more.\n\nI want Greg to try this, and if he loves it, this has high potential for our late night snack to be served during our reception next year :)", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "So...in between hoping to stalk Ty Flo & pouting that he was no where in sight, I tried the Frozen Kuhsterd truck. The Soma Streat Food Park was crawling with cameramen, PA's, & food trucks from Food Network 'The Great Food Truck Race' (which, admittedly, I've never seen.) \n\nToday was my first time trying frozen custard...FK, you were fpx's first! I ordered the Boba Guys Sundae (see pic.) OMG, white coffee frozen custard ($6.50, like a creamier, dreamier ice cream), condensed milk, & tender boba. I almost pulled a Meg Ryan a la 'When Harry Met Sally,' it was *that* good. \n\nThe guys running the truck were very sweet. Can't wait to try other flavor combos! \n\nSo...even though Tyler (love of my life) never did show up, my evening was not wasted...I managed to find something else yummy to put in my mouth...", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "thai tea frozen kuhsterd. what a brilliant, brilliant idea. \n\ni've also had their four barrel coffee and sampled their other flavors. i like the boldness in their unconventional flavors. very creative while staying within happy gastronomical boundaries.\n\nlet's get FK'd up!", "author": "Charmaine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "OWE EEEEM GEEEEEEE\n\nOh.My.Guhsterd\n\n\n                         YOGU BOBA SUNDAE\n\n                           |   O O O  O O O |\n                           | O  O  O  O  O O| -- Soju soaked boba\n                           |   O O O  O O O |   (boba from Boba Guys)\n                           |                           | ----- KUHSTERD\n                           |                           | --- Yogu Jelly\n                           ++++++++++++++  \n\n               O  ----- YES!!!! (Frozen Kuhsterd addict)\n              / | \\\n               / \\\n\nWhere have you been all my life?! (Not the addict, which is me...but the sundae).\n\nBlack sesame Kuhsterd + Soju soaked boba (and pretty good quality boba too from The Boba Guys) + Yogu jelly. What a killer combination.\n\nThe black sesame Kuhsterd blows away Marco Polo's black sesame gelato (and even that is purty sexcellent). And is fantastic with the limited edition yogu boba sundae. It's $7 a pop but it's a nice change from spending an hour in line at TPumps with the spring break kids from high school or college (who are either underage or too lightweight to partake in something like this).\n\nThe matcha white chocolate is also very very sexy indeed.\n\nAlso, don't miss the Napa Sundae. It's vanilla Kuhsterd, EVOO, Hawaiian black (lava) salt, burnt caramel sauce. Extremely decadent. I did a REMIX EDITION and customized it with White Coffee Kuhsterd (great!!!!) soju soaked boba. Incredible multi textured flavored sexyness that surpasses a HK style out of the oven pineapple bun with a slab of salted butter inside!  Because I'm smooth like that, and dats how I roll.\n\nFour barrel coffee? No brainer, make it a Kuhsterd Kafe Sua Da, Boba Sundae. Add Boba Guys boba, condensed milk, and it is quite heavenly.\n\nBut Black Sesame. Yoo Ahhh SEXY!\n\nIn the words of Ahnuld Schwuhzenugga's character from one of his movies (not the one where he plays an Irish American cop from Chicago and still speaks with an Austrian accent) \n\n\"THIS IS DA REAL QUAID, GET YO AHHHSSSSS TO FROZEN KUHSTERD!\"", "author": "Ken K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-13", "description": "I actively seek out the Frozen Khusterd truck. I follow them all over the Bay Area. They're THAT good!! \n\nKhusterd is an eggy-er type of ice cream. Thicker denser consistency. Soo yummy. \n\nTheir flavor selection varies everyday but is always on point. And for a truck that just sells frozen custard, they do a great job of offering many options. They average 4-5 flavors a day, but have tons of toppings to mix and match. And are always featuring creative sundaes that include specialty cookies, cupcakes, and desserts. \n\nVanilla Khusterd topped with Burnt Carmel and Cornflakes is my absolute go to. Sounds plain and boring. But it's everything but plain and boring. It's like heaven in your mouth!!! Craved it when I was preggers with my son. And almost a year after giving birth, I still crave it like crazy!! \n\nOther yummy flavors we've tried-- Cookie Butter, Ube, Polvoron, White Coffee (topped with toasted marshmallows!!) All so delicious. Can't go wrong!", "author": "Arcie Marie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-23", "description": "I ran into Frozen Kuhsterd at a company event (complimentary!). Hadn't heard of them before... so I lined up. Delicious!\n\nI went with the Thai Tea w/ Condensed Milk TWICE. The third time I got in line, they ran out.\n\nExcellent kuhsterd. Better than ice cream on a windy day? I think so!\n\n--\nPHOTO:\nhttp://www.yelp.com/biz_photos/frozen-kuhsterd-san-francisco-3?userid=Vx-l5rI0xAiN4SeBonrgkw#NtZSMzRFYFzjqhO0DKKctw", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-28", "description": "I finally got to try Frozen Kuhsterd a few months ago during Cal Day when the truck came onto campus! After eating lunch, I wandered over for dessert and saw that they were serving Vanilla, Four Barrel Coffee, Thai Tea, and Honey Graham. Besides the kuhsterd, they also have treats from Dynamo Donuts, Mission Minis, and Boba Guys, so there's lots of options! \n\nWhat I ordered:\n- Thai Tea Boba Guys sundae ($6.50): http://www.yelp.com/biz_photos/frozen-kuhsterd-san-francisco-3?select=cneTsUt4WjoM2BzvtmHANw#cneTsUt4WjoM2BzvtmHANw\n\nThe boba sundae comes with a single scoop of any flavor, boba, and condensed milk. I thought it was a bit pricey considering two scoops cost $5, but it was yummy nonetheless! I was debating between Coffee and Thai Tea, but chose Thai Tea to make it similar to a frozen boba. The kuhsterd was super creamy with a slightly sticky texture and I really liked it, except towards the end, it ended up being a little overly sweet. This might have been the condensed milk's fault though and if I ordered the sundae again, I would probably omit it since the other ingredients are sweet enough. Boba was soft and chewy, and this was definitely fun to eat!\n\nTIP: Free topping with Yelp check-in offer!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "This review is for their vegan ice cream served at Very Vegan Sundays. \nBF and I got the Li Hing Sundae with strawberry ice cream and a scoop of thai ice cream.\nO. EM. GEE.  So legit, and so delicious. I admit that I was bracing myself for the \"vegan\" taste that lingers in some vegan alternatives, but this tasted like the real deal. \n\nI would add an extra star if I could, in hopes they will add the vegan options to their daily menu. (PLEEEEEASSEEE?)", "author": "Kathryn U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "I am a HUGE fan of fk after 3 days @ HSB Fest in Golden Gate Park eating Thai Tea with Burnt Caramel sauce topping. OMG-stellar treat. Yum. The quality is superb & all organic ingredients. Need I say more? Run over whenever they are featured. As to person saying he can't tell difference between fk flavors/taste & Dreyer's, I would ask, do you pay ANY attention to how your food is sourced & processed?! If 'no', just shop Safeway ice cream aisles!", "author": "Lin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "Simply amazing! I have been dyingggggg to try their Thai tea ever since my brother said how much I'd love it. And I do!!! It tastes better than the drink! I'm such a huge sweets eater and this scoop of heaven definitely satisfied my sweet tooth cravings. I had gotten desserts first..... Before getting any real food because I actually went to off JUST for FK...so after all the other food I wanted more Thai tea custard :'( they had another flavor, polvoron - it was ok. Wasn't sure what's it suppose to taste like but it was still good. I hope have something green tea or mango like in the near future!\n\nin addition to their heavenly custards, their customer service was also great. Super friendly and welcoming :) not every truck was like that! Smiles with every scoop, now how about that haha And the little cartoon custard is just too cute ! I can't wait until the next time I get to eat FK's custards again !!!", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-22", "description": "NAPA STYLE SUNDAE?!?  Perfectly creamy vanilla plus burnt caramel syrup AND olive oil with salt?  Yes.  Do it.\n\nSo, for the three of you know follow my reviews: you know I'm a huge frozen custard fan and or snob.  I practically have a shrine to Milwaukee's famous Kopp's frozen custard in my living room.  I sanctimoniously poo-poo'd NYC\"s not-quite-Kopp's Shake Shack.  And until I found Smitten's chocolate ice cream in Hayes Valley, I winged constantly about never being able to find the incredibly creamy perfection known as genuine frozen custard anywhere in California.  So when I say that FK's vanilla frozen custard is the real, creamy, fatty, sugary deal, I mean it.  \n\nSo why only 4 stars? I had a combo cup with other flavors, and they weren't as good.  But that Napa style Sundae will change your life.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "I love dessert. It's always my favorite part of a meal. Naturally I enjoy ice cream too. I had heard good reviews for frozen kuhsterd and was happy to see them in San Lorenzo.\n\nI got the vanilla bean with burnt caramel sauce. Hot damn it was good. I shared with my husband and son, since it's summer and I'm trying to be good BUT we were all basically fighting for more. DELICIOUS!\n\nI have a feeling I will be seeing them every Thursday for food truck mafia, and that makes me a very happy camper.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "I went to Off The Grid at Fort Mason for the first time last Friday after dinner, so all I had their was dessert. My sister asked the person working there to recommend us something because everything looked so good. We tried coffee ice cream with red velvet and almonds - omg it was sooooo good! I love cupcakes and I love ice cream and never thought to put them together. It was around $6 so somewhat on the pricer side. Overall I would go back and probably order the same thing again lol", "author": "Pammy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "ABSOLUTELY DELICIOUS!!! This food truck and the guys who run it are the best! It's hard to pinpoint which flavor is my favorite; they're all so unique in their own way. Their frozen custard is so rich and smooth with a lot of volume. This is in contrast to the liquid nitro ice cream that are more chewy in texture.\n\nThe thing that makes Frozen Kuhsterd great is the people behind the food truck. Jason and Alex, who are two of the founding partners, are some of the coolest people you would ever meet. During my first visit they made me a beer float, which was not on the menu, after I heard about them making it for a popular ramen restaurant. Yes, this is with real beer and it was damn good. These guys are very accommodating, opened to suggestions and really cool to chat with. \n\nIf you ever spot Frozen Kuhsterd in your 'hood, you must try them.", "author": "Albert L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "Very first time trying frozen custard at this food truck. I had the cinnamon toast + cookies & creme. It was delicious! Tasted like a slightly melted ice cream. Was full of flavor and very creamy. I will definitely be coming back to frozen kuhsterd in two weeks when they're at off the grid!", "author": "AJ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "DELISH. I love ice cream and I think I'm a great judge when it comes to different types. I love this truck. Don't be turned off by the cereal milk! I first had cereal milk when I was NYC at momofuku and thought it was weird. This time at Frozen Kuhsterd... i LOVED IT! Take a chance with the cereal milk, I assure you that you won't be disappointed!", "author": "Anh T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-01", "description": "I've been chasing this truck for months and I'm glad I was finally able to catch them near my house at Hiller Aviation.\n\nThey're constantly switching custard flavors and dessert, but I got the frozen vanilla custard between a maple bacon donut with salted caramel.\n\nThe custard itself: YUMM! Thick, creamy and rich. It's like ice cream, but better - and I love ice cream! I wasn't even disappointed to pick plain old vanilla. It was delicious!\n\nThe maple bacon donut: I could do without this. The donut wasn't as light and fluffy like I like and the bacon tasted really weird. There was too much grease or something and it set off the sweetness of the whole dessert. There was just something about the bacon taste that I wasn't a fan of.\n\nSalted Caramel: I'm not usually a fan of this, but I decided to try it based on the raves of other yelpers. This was actually really good. I like the sweetness of the caramel and it had a really good and not too sticky consistency.\n\nMy sister also got a mini peppermint chocolate cupcake - good, though taste like any other peppermint chocolate cupcake. I would rather spend that extra dollar on another topping.\n\nOverall, I'd definitely be back for the custard and try the other desserts when they bring them back!", "author": "Sophia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "I've been wanting to try Frozen Kuhsterd for the longest time, so when I saw their truck at Off the Grid: Serramonte, I was stoked! The wait was about 5-10 minutes, which wasn't that bad because the employees are super friendly and very welcoming. My sister and I decided to share a \"Boba Guys Sundae\" with a choice of custard (we opted for vanilla bean) topped with condensed milk, and what I assumed was Boba Guys' almond jelly and boba. The total for the sundae was $7, which is a tad bit pricy in my opinion, but was sooooo worth it!\n\nBoba Guys Sundae - This dessert was definitely worth the calories! Boba, almond jelly, condensed milk, and vanilla bean custard was the perfect combination for a chilly night at OtG. I've never had frozen custard before, but this frozen custard was about the consistency of gelato. Also, the boba and almond jelly seemed fresh!\n\n4 stars for now! The dessert and the customer service were amazing. The prices? Not so much.", "author": "Joyce E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-05", "description": "I love Frozen Custard.\n\nIt is really popular in the Dallas area, but currently Frozen Kuhsterd is the only place I've found  in the Bay Area that offers it.\n\nFrozen Custard, like Gelato, has its own unique mouthfeel and taste compared to ice cream.  By its nature, I think Frozen Custard is such a great product, and as such, I think Frozen Kuhsterd is a great food truck.\n\nHowever, even though Frozen Custard is great, the flavors here didn't really pop.  They aren't the best flavored (or maybe I just tried the wrong flavors), and there is a really small selection, so in a place with actual competition(like the Dallas area), it might not do so well.  But since there are no other options, I am a fan of Frozen Kuhsterd for even existing.\n\nBesides the Frozen Custard, they also offer some baked goods like Dynamo Donuts(unique flavored donuts) and bread puddin' so that they can make bread puddin' sundaes or donut sammiches.  Those options sound cool and would love to try sometime.  Looking through the pictures on Yelp, it appears that they also make really unique items every once and awhile as well.  I like experimental food items and would love to try them sometime.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-24", "description": "My daughter likes this so we were customers twice. She got the smore thingie and it seemed ok. I ordered coffee custard on top of rice pudding. The custard was ok, but the rice pudding was nauseating, like wheaty oatmeal. Can't see how anyone goes for that. Fortunately they were nice enough to replace it. Sorry, I don't get frozen custard at all. Particularly at $6 a pop. If there is a good flan or ice cream truck, sign me up.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "Its like ice cream but better.\n\nThe burnt caramel which was the only flavor i tried - was excellent, intensely rich and creamier than ice cream, and even though it was sweeter than I expected or would've preferred - it kinda works. \n\nIts basically like an ice cream with all the good qualities - amplified.\n\nIf you're a fan of ice cream and dessert - you will be a fan of this truck, if not - you still may be pleasantly surprised.", "author": "Oleg H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "Great dessert food truck.  I don't even care what flavor, everything I've had here has been awesome. The Custard flavors are unique and represent the bay areas food diversity. My favorite is the White Rabbit Vanilla and Cookie Butter. My best toppings are the burnt caramel and the strawberry sauce. I would eat the donut sundae everyday!", "author": "Vas T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "So I noticed that the Boba Guys work in conjunction with these guys, so I had to check it out. I went to the SOMA StrEAT Food Park today - for the purpose of trying the frozen custard out. I've only had it once in my life, and that was in Seattle at Yellow Leaf (and probably one of my top favourite desserts of all time now). \n\nI ordered myself a plain white coffee frozen custard and I was totally amazed. I can't wait to go back again and try some different things out (like their sundaes, or their donut + ice cream combos).\n\nCan't wait to check them out again. Definitely my newest favourite dessert.", "author": "Joanne W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-17", "description": "I love desserts, and I LOVE Frozen Kuhsterd! I tried this awesome creation awhile back when my boyfriend brought a pint home.  I took a scoop (truth be told, the whole pint) and immediately fell in love! I have tried cereal milk (one of my favs), thai tea WITH BOBA, and I just tried the irish car bomb sundae today. I love that these are unique flavors you won't find anywhere. Seriously, when have you heard of irish car bomb flavored sundae?  I find them at the SOMA Street Fair in SF and I usually try to get something that I haven't tried already with their creative flavors and toppings. I definitely do come here when I have my cravings for Frozen Kuhsterd and take a pint with me home and with summer time coming around, it will be harder and harder for me to pull away from getting more!", "author": "Victoria K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "Omgggg!!! So good!! I didn't even feel like eating ice cream. I've been visiting SF for a week so I was so full. But my mom said she's split it with me and I caved in...so glad I did! My first bite blew my mind. We shared the burnt caramel flavor. Unreal! Frozen custard is definitely better than ice cream!", "author": "Christina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "PROS:\n--Came here for Off the Grid at Serramonte for the first time for dessert. When my boyfriend and I first saw it, we were like, \"Custard?\" I went to just look at the menu and saw that silvana ice cream sandwich and was like, \"MMM!\"\n-Not too long of a line.\n---I saw the 2 for $7 deal for two silvanas and choice of ice cream but just wanted to try one. I ALSO had $3 worth of quarters (What a bum, I know, haha) and an actual dollar. I went up to the window and asked if I could just have one and the guy said, \"Of course!\" and if I could pay in quarters! Embarrassing to the max but he was so nice and even joked around with me and was pleased to accept. \n-I ordered the Ube silvanas and thai tea ice cream. I took one bite, AND WAS AMAAAAZING.\n\n\nCONS:\n--Kinda pricey, (2 for $7, 1 for $4) but it's a food truck, they gotta make that dough doe. ($$$)\n\n\nOVERALL:\n-DEFINITE YUM FACTOR!\n-Great service, awesome flavors.\n-Plan to definitely stop by next time I see them.", "author": "Veronica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-18", "description": "I love this truck!!!! \n\nI went with the Burnt Caramel and I love caramel. There tons of flavors to chose from though and I WILL definitely change my order on the next run in!!!\n\nFast service, can have a few people waiting, but you should expect that by now.", "author": "Roger A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-22", "description": "Warm or freezing weather... I still crave a treat.. or two from the fun and creative guys at Frozen Kuhsterd. \n\nLove this stuff and love getting FKWASTED! I mean c'mon, always friendly service, the combination of  Frozen Kuhsterd + Boba= WINNER, and don't even get me started on how amazing the burnt carmel topping is!\n\nAlthough, I still have to try the Thai Tea flavor, which I hear is beyond amazing... but I'll soon eventually get to rave about it myself since FK is going places and it's awesome  to see them in the line up for major food events in the Bay Area, if you haven't gotten FKWASTED, you must!", "author": "Megan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-19", "description": "Decadent (and very rich) dessert options for a food truck, for sure.\n\nMost items are big enough to be split, unless you go for a cupcake (which is actually baked by another company and sold on the truck). \n\nI do think it's pretty expensive for what it is, but you can't say it tastes bad or you'll find similar innovative offerings many other places.", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "This is by far my favorite dessert food truck in the bay! My first time trying Frozen Kusterd is at a Elite event at the Layover in Oakland. I immediately recognized the artwork too. I can say Frozen Kusterd team is awesome, even while their packed line in the Eat Real Festival they were still able to move the line.\n\nThe couple times I tried Frozen Kusterd sweet treats. Avocado is really good and condense milk, OMG! The second time I had FrozenK is when the Eat Real Festival is at full swing. The organic cinnamon toast crunch is a new favorite. It satisfies my sweet tooth for the whole day!\n\nI am going to find myself some more frozen kusterd!", "author": "James N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "yummy! with 6% egg as compared to 2% that's usually in ice cream what isn't to love? eggs make everything better. The custard is silky and actually more creamy then ice cream. the first time I put it in my mouth the owner knew I was a convert. Thanks Yelp events for showing me the light.", "author": "Sabrina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-14", "description": "HIGHLIGHTS:\nS'MORES SANDWICH\nHOT CHOCOLATE\n\nDuring my recent trip to SF, swung by the Frozen Kuhsterd truck during the Eat Real Festival/First Friday.  Mutual friend Debbie knew the owner of the truck, Jason, who gave us both the S'Mores sandwich and the Hot Chocolate, free of charge.  The S'Mores sandwich was fantastic!  The Hot chocolate was chocolatey but also seemed to have some cold vanilla ice cream in the middle.  Both were awesome!  I wish we had this truck in LA!", "author": "Navin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "I have only been able to catch this truck twice. The last time I was here they had a white rabbit candy kuhsterd which I thought was the oddest thing ever. \n\nI debated whether or not to try it because it can either be super delicious but it can also go really wrong. I decided to give it a try and I was really pleasantly surprised! It was so good and it tasted exactly like the candy. If you are able to catch that flavor, I really recommend that you try it. You won't be disappointed.", "author": "Diane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-24", "description": "I pre-order as soon as I find out Frozen Kuhsterd comes to my work.  I came on a rainy day and there was still a line!\n\nMy husband is a huge fan of Thai Iced Tea, which he swears is Thai iced tea in ice cream form.  I fell head over heels with their Avocado flavor. Not too sweet or too rich.\n\nThe guys that run the truck are really cool.  I feel like they're extended family.  Now if only black sesame is available when I'm in the front of the line to order.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-22", "description": "Frozen Kuhsterd...LOVE!!\n\nIt was my first time having frozen custard and I loved it. I wish this truck were around the South bay more often. The line was longer than long at Eat Real '12, but they were able to serve people efficiently, so the line moved fairly quick. \n\nI'm a huge coffee lover, so I went with Blue Bottle. This was amazing! Mmm. I'm dreaming about this as I'm typing this. The bacon waffle sounded so amazing, too, that I asked for this on the side. \n\nMy bf, whose a big kid, went with the cinnamon toast crunch, no surprise there. He topped his with strawberry sauce and one lick brought me back to my childhood.", "author": "Cindy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "I was really hesitant to try this place because I have honestly never tried frozen custard or knew what it was; however, after one try, I can honestly say I'm obsessed. My first pick was the smores sundae with vanilla bean custard and it was amazing. It literally tasted like it was a smore toasted over a campfire with the perfect frozen treat to match. I thought it was the perfect combination and sweetness. My second choice was the rice pudding sundae. It had a nice contrast from the cold leche flan frozen custard to the warm and tasty bread pudding. Definitely in love with frozen kuhsterd's creations and unique flavors.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "FK's Thai tea custard with oreos blows regular cookies and cream flavored desserts out of the water. I've had frozen custard before but I never thought it could be this good. FK needs to have a regular shop at SFSU.", "author": "Susana T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "OMG! I had the champorado sundae with cookies & cream on top, it was sooo ooh good! #pregnantladysdream lol. Thank goodness my husband thought of getting dessert at Off the Grid ^_^", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-11", "description": "When I think of custard I think of those egg pies that sit in the shiny glass cases of Chinatown's finest bakeries. They call out my name and Frozen Kuhstard was no different. After a couple of beers at Yelp's Beerwalk, I gravitated my way towards Frozen Kuhstard...unique phonetic spelling I might add,. Never before have I had \"custard\" frozen so it was worth a shot and I was surprised at how creamy it was!  It had the consistency of slow churned ice cream and the flavors were far from the usual! There were two unique flavors to choose from during the event: \n\n1. Dark Chocolate Stout Beer\n2. Honey Graham Cracker\n\nThanks to Jason's generosity, I was able to sample both. The dark chocolate is super rich and tasted just like chocolate with just the slightest hint of stout at the very end - and how fitting was this flavor for the event?! Love it. As for the Honey Graham Cracker, it tasted exactly like what you'd sandwich your s'mores with!\n\nNow, I told Jason that I would quote him on this and to this I vouch: \"This is amazing-ness in a cup.\" It really is.", "author": "May D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-09", "description": "YUM! \n\nI didn't really know what Frozen Kuhsterd was, but its like gelato and ice cream.  If you like your ice cream silky you want Frozen Kuhsterd! \n\nI loved their Corn Flake (Cereal Milk) & Cinnamon Toast Crunch (Cereal Milk).", "author": "Arlynn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "A high quality product from a very nice proprietor. Buena Vista is awesome. I think as Californians, this is a treat that you just dont get here very often. So many other flavors that i need to try.  This is a different flavor everyday for a month!\n\nBlue Bottle Coffee\nFour Barrel Coffee\nCoffee Mint Mojito\nFresh Mint White Chocolate\nSpicy Mexican Chocolate\nSpicy Pumpkin Chocolate Pie\nDirty Chai\nCheesecake\nPumpkin Cheesecake\nBuena Vista\nCinnamon Toast Crunch (Cereal Milk)\nCorn Flake (Cereal Milk)\nPort Wine Strawberry\nRed Velvet Cake Batter\nGuittard Dark Chocolate\nAvocado\nVanilla Trinity\nMaple Butter\nBurnt Caramel with Salted Coffee Caramel Swirl\nRoasted Coconut\nSpiked Cereal Milk* (Jameson Whiskey and Cereal Milk)\nBuena Vista (Jameson Whiskey and Blue Bottle Coffee)\nWhite Chocolate\nCookies N Creme\nGreen Tea White Chocolate\nTequila*\nPeanut Butter\nChocolate Malt\nVanilla Malt\nRoot Beer Float\nCola Float", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-29", "description": "I loved this food truck. But I was a little bit disappointed because of some ice-cream that has too much sweet toppings.\n\nI prefer some simple ice-cream in this food truck. Vanilla or Oreo thingy was so nice! I love it!\nHowever once I tried something weird ice-cream.. Such as an ice-cream between doughnut, ice-cream that has bunch of toppings (marshmallows with chocolate syrup and peanut butter etc.) I wasn't able to finish my ice-cream.. It was too sweet and sweet. Everyone was freaking out as assuming the calories of that. Never try this kind of icecream if you are considering your weight.. \n\nIn spite of this bad experience of too sweet ice-cream, the reason I give you rating 4 stars is the general ice-cream is awesome. So don't add any other sweet stuffs plz...", "author": "Summer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "OMG!  I finally got to try Frozen Kuhsterd after lusting after them online for months.  I was NOT disappointed either.  I had their Four Barrel Coffee and vanilla with almonds. The custard is so creamy and extremely tasty.  I can't wait to try their funnel cake with custard.  Can you think of a dreamier combination?\n\nSpecial mention to Alexis and owner, Jason, who I got to meet recently.  Keep up the great work and PLEASE visit the South Bay more often!", "author": "Judi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "Frozen Kuhsterd serves up some pretty tasty treats. Their custard is very smooth like soft serve, but it's a lot more creamier and has a much richer flavor. I've had pretty good luck with Thai Tea and condensed milk.\n\nThere's some things that could improve. The Spiked Cereal Milk needed more booze. I couldn't really taste any Jameson in it when I had it. Now that I think about it, they could probably put more cereal in it too. The burnt caramel sauce also didn't taste that burnt. It just tasted like plain caramel. Bi-Rite's awesome caramel has way more of that intense burnt flavor which makes it taste so amazing. \n\nI haven't tried all the flavors, but I think Frozen Kuhsterd is pretty enjoyable overall. They stop by my work almost once a week so that makes it a lot more convenient too. It'd probably be 3 stars if I had to go out of my way to get there.", "author": "Nei N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "DELICIOUS is all i can say. The bread pudding Custard is amazing. Great staff, very friendly. I get excited everytime I see this truck somewhere!", "author": "Jason D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-09", "description": "I never really considered until I wrote this review that 3 stars was A-OK. I used to consider to mean, yeah, good, but some major issues. But I'd have to put Kuhsterd at A-OK. It's tasty but I didn't feel that the flavors really \"popped\" for the price. I would go for the Toast Crunch if anything - better than anything else we tried on that cold, windy day.", "author": "Tatiana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-09", "description": "A well-executed, clever dessert idea for all seasons. \n\nKreamy Kuhsterd: It's been a year since we've met but, baby, you still turn me on.", "author": "Lara W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "So yummy! I feel fortunate to have gotten the chance to catch up with this food truck (they only make frozen custard) when they came down the peninsula to Hiller Airplane Museum. We tried four scoops and enjoyed them all as they were smooth and creamy as they should be. The toppings made them even punier, elevating them to a gourmet treat. The strawberry topping is homemade and you can really taste it, its Devine. Marshmallows toasted to perfection, with a slight char on them really brought a lot of flavor to the party (if you're not a fan of the charm try these they are so good that they might make you a believer.\n\nI did start with my toughest test, vanilla. If they can get vanilla right then you know that they are paying attention and care about the product they are serving you. Their vanilla is good enough that I ordered  second cup so I could focus on their yummy toppings. I recommend that you ask for samples because everything I tasted was so yummy that I can't ecocide just one. Give them a try and pick your own favorites.\n\nThe service was excellent prices reasonable, and the owner, Jason was super friendly, was happy to answer my million questions patiently and thoroughly. The speed of service was very good and in the two hours tat I hung out at the food event I did not spot one error. Every single customer was very happy.\n\n=======\n\nSince Frozen Custard is new to the West Coast I though I'd offer a guide to get everyone interested up to speed:\n\nFrozen custard was invented in Coney Island New York in 1919 and is essentially ice cream with added egg yolks which gives it a creamier texture. It was popularized in the 1933 Chicago World's Fair which is why I believe that most people erroneously believe that frozen custard is a Midwest only treat. It actually has existed on the East Coast (I remember enjoying it in the sixties and seventies in New York City) and is still available there, albeit not as easy to find as in the Midwest.\n\nBecause true frozen custard is very dense, the maker can adjust how much air it contains as the cream is stirred (air is not added or pumped in) during its creation. The most dense frozen custards will only have 15 to 35% air (overrun) but in some regions, frozen is served as a \"Soft Serve\" with 100% overrun (meaning that it is half air). This causes a lot of confusion with soft serve ice creams, but the two actually are different products.\n\nIce cream by definition in the US, is: a frozen dairy dessert that contains between 10% and 16% milkfat; 9 to 12% milk solids-not-fat (this where the casein and whey protein are located plus carbs; 12% to 16% sweeteners; 0.2% to 0.5% stabilizers and emulsifiers (yuck) and finally 55% to 64% naturally occurring water. If the ice cream has air intentionally pumped into it (most except gourmet ice creams have huge amounts of air in them) then these numbers would be lowered to as much as half of what is listed here.\n\nIf you add egg to that, then you get a frozen custard however, different people and different regions, make it differently. Some adjust their machines to work the custard a little more which traps more air into it so they can over it as soft serve, some add so many egg yolks that it takes on an eggy yellow tint.\n\nIn the US a frozen custard, according to the FDA, is suppose to have at least 10% milk fat and at least 1.4% egg yolk solids. FDA Frozen Desserts 21 CFR 135.110(a)(2)\n\nI recall seeing recipes in New York calling for egg yolks to be added but they called it an Ice Cream or a rich ice cream or a premium ice cream even though they were technically frozen custards. I suspect there are a lot more people out there enjoying frozen custard than actually realize it.\n\nMy favorite frozen custards are the ones that are eggy (otherwise why bother) and firm (low percentage of air in it) because they are most different from gourmet ice cream.", "author": "Bob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "My first year of Eat Real Festival and my 3rd day in a row for frozen kuhsterd, I came on a Friday with my sisters for their vanilla and thai tea flavor! \n\nThe thai tea was amazing and its all homemade!!! I came back on a Saturday hoping for their thai tea flavor but they replaced it for Blue Bottle coffee flavor , which was also good, and the line was crazy long!! Omg, but anywho, I came back today (Sunday morning/ 1st in line) and today must be my  lucky day, they have a gallon left of the thai tea flavor, so I got a snoop of Blue Bottle coffee flavor and a snoop of thai tea flavor frozen kuhsterd!! Ahh, made my morning! Yes, I had frozen kuhsterd for breakfast !! That was yumm!! I am hooked!! I shall hunt them down the next time when I am in the city!! ;-) \n\nThanks Jason and Alex for getting my custard in a jiffy!! Oh, and sorry for being a ladybug about the thai tea flavor frozen custard, I really wanted my thai tea frozen kuhsterd.. :-X", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Had a chance to try it out at Yelp's Spring Fling at the Oakland Museum recently and they did not disappoint. Choices were Thai Iced Tea or White Coffee. I went with the White Coffee, made with Four Barrel coffee, and it was creamy and delicious, just like coffee ice cream but creamier. I can't wait to find their truck and try some of their other flavors.", "author": "Ian A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-04", "description": "Did not live up to the hype.\n\nPleasant service.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "I was so upset that the Tuesday that my boyfriend had off was the day that they weren't going to be at Serramonte OTG.. I follow them on Twitter @frozenkuhsterd and they announced that the we're going to be there! Yay! I crave this as soon as I'm done with my frozen custard. Yes. It is that good. I've only tried the vanilla bean and Thai tea custard sundae, but ohhh my my my... They are the best. It cost $6.50, and worth every penny! It's soo creamy, sweet and just melts in your mouth. Their boba is pretty good too. The employees in the truck are always so kind and helpful! They let you sample their different flavors if you want! I'll be back next week! :)", "author": "Pauline E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "Frozen Kuhsterd is hella good! \n\nThe Frozen Kuhsterd truck was parked outside the Asian American Art Museum for last night's CAAM film festival's screening of Amrit Singh's \"Dosa Hunt\" and rap performance by Indian Bastards from Hell (Himanshu + Dapwell of Das Racist fame) and after peeping all the stellar Yelp reviews, I knew I had to try.\n\nI was initially undecided between the Thai iced tea and black sesame flavors, so the rad folks scooping the frozen custard (similar to ice cream with the addition of eggs!) yesterday let me sample both and then decide. Thai iced tea easily won out...and a day later, I'm STILL thinking about that deeply flavored, perfectly creamy, slightly spiced, delectable frozen iteration of Thai iced tea!\n\nForget fried bananas, sweet sticky rice pudding and roti drenched in condensed milk, every Thai restaurant in the City should have THIS on their dessert menu!", "author": "Cheryl L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "Have you been FK'd yet? \n\nMmmm, the creamy goodness. I've never had any of their sundaes or cupcakes, but the custard alone is amazing. Flavors I've tried: vanilla bean, thai tea, cookie butter, cookies n creme, toasted almond, horchata, and cinnamon toast crunch - still so many more to try! My favorites are definitely horchata and cinnamon toast crunch. You can also add toppings for .50 cents each, but I like it by itself. Oh and the girls that take your order are always pleasant! \n\nUpdate - They now have the \"Boba Guys Sundae\" at Moveable Feast: Foster City! Yay. It's a sundae featuring a single scoop of your choice, almond jelly, condensed milk, and San Francisco's own Boba Guys' boba for $6.50", "author": "Alexandra K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "I'm biased since I love anything frozen and/or with custard.  Thus, this is the closest to a hybrid of ice cream and custard with unique creations and combinations of toppings.  The Napa sundae was a delight with the salt on top for a savory taste.  i'll have to find this truck and try some other flavors again.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "Finally found the frozen kuhsterd truck after all these years at the Off the Grid in Serramonte. Every time I wanted to come there was always some special event going on in the SOMA Street Food park. Anyway, it was a nice and sunny, yet windy day and I was in mood for frozen custard. I know the best Frozen Custard is in Las Vegas, so I needed to find something similar here in SF Bay Area. The Napa Sundae cost $6 because they used organic ingredients, vanilla custard, Carmel and sea salt. I thought since I drove all the way out here, I might as well splurge. it was very tasty and great to have after I had dinner. Creamy and smooth texture. I can taste the sea salt which gave it an interesting taste mixed with the Carmel. Yummy in my tummy as I took my time eating it. I was impressed that it came with a thick and big blue  spoon. I will keep this sturdy spoon. :-) Next time, if I am the area on a Tuesday, I'll be sure to stop by.", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "Chatted up the owner, Jason, at a Yelp Elite event for a while last night. Really nice guy, he was totally open to criticism and was super friendly, and I've been considering doing my own food start-up and he gave me a lot of tips.\n\nHis custard is denser than ice cream, more smooth, and it actually freezes at a higher temperature so it doesn't hit your mouth as cold as ice cream. The flavor last night was Pumpkin Cheesecake and while it had a deliciously strong cheesecake flavor, my friend and I couldn't taste the pumpkin as much. I noticed it a little when I went back for seconds. The graham cracker crust crumbles on top add nicely to the flavor, giving it a much more authentic cheesecake feel.\n\nJason was also really cool about taking suggestions for flavors too. He draws  inspiration from our shared faves - Momofuku Milk Bar, Humphrey's Secret Breakfast. We also both LOVE Bi-Rite's roasted banana.", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "Great tasting ice cream. I tried the vanilla, coffee, and chocolate. I went with the scoop of chocolate + burnt caramel. The combo was a bit sweet for me, so next time I'll keep it simple and stick with just a scoop (or maybe add some nuts on top).\n\nThe coffee flavor is outstanding. It tastes like their premium vanilla custard blended with ground up beans.\n\nThe sundaes are a little pricey. I would just stick with getting the regular scoops and maybe add one topping.", "author": "Ron Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "Let it go.\n\nOver 200M enthusiastic views: https://www.youtube.com/watch?v=moSFlvxnbgk\n\nOver 200 enthusiastic reviews: Creamier than ice cream. Tastier than gelato. Not nearly as healthy as frozen yogurt.\n\nJust one scoop into this decadent and delicious vanilla treat knew this was a moment to let all healthy eating discipline go.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "I've been to this spot a few times in the last couple of months and really enjoyed my experiences.  I've had the Cinnamon Toast Crunch Custard with Chocolate Syrup, Ube Custard and Polvoron Custard Sundae.  All were very good and had the perfect amount of creaminess.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-29", "description": "Hellllllllllllz yeah, this custard is the bomb diggity! The Jamo Corn Flake concoction is super tasty. I am kinda upset that I can't have any right now. I need more! MORE WHISKEY CUSTARD!\n\nI hope they will be at the next Yelp! event that I attend.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "Tried out the Frozen Kuhsterd truck at the Foster City Movable Feast night.  They offer a competitive price.  I had a single scoop with burnt caramel. Really good combo.  I didn't notice that they offer boba.  If I ever get to try out this truck again, going to get boba.  Mmmmm!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "Thai Tea, Cereal Milk, Blue Bottle Coffee, Chocolate Malt, Polvoron, Mint Chocolate Chip, Vanilla Bean, Cookie Butter....\n\nNo that's not FK's menu...it's all the flavors I've tried. (I'msoashamednonotreally)\n\nThere are no bad flavors, only ones that you might love more than others. And there are new flavors all the time...it's obv these guys take their craft seriously.\n\nThe variety of toppings, like the Kuhsterds, is always fresh and inventive. Silvana ice cream sandwich?!? (If you don't know about silvanas, it's worth the google I promise). Donut bread pudding sundae?!?! Boba?!? Eff yes.\n\nTip: Save room and time for your Frozen Kuhsterd. Savor the smoother-than-butter texture, high quality ingredients. And keep going back and trying new flavors.", "author": "Angelica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "I am not a frozen yogurt or custard kinda gal.  I like mine just plain ice cream.  No matter how sugar coated it may seems. I am not sold.\n\nHaving said that, I had the pleasure to attend a loopt event held by my friend, Connie, and there I was introduced to a upcoming company by the name of Frozen Kuhsterd.  At first, I had no inclination to try something new and from two guys with frozen custard in their hands.  I went ahead anyways and was blown away.  It was very creamy in texture and actually tasted like ice cream. Yummy!\n\nBecause of their persistent and passion for their products, I had the opportunity to taste a delicious product in which i wouldn't have try.  I like that .  Taste and determination is a good combination.\n\nTwo nice looking guys with spoonful of what look like and taste like ice cream.  I am totally sold.  Won't you?.............", "author": "Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-03", "description": "GOT THE LAST T-SHIRT!! Big upps for letting me have it.\n\nJust like my Elite gal pals Jane A. & Mary-Anne C. (who already beat me to reviewing this place,) I too had the priveledge of sampling some Frozen Kuhsterd at last night's Yelp's Elite Event.\n\nOh my word. BLEW.MY.MIND. \n\nSPIKED CEREAL MILK!!!!! As with most great inventions, Jason confirmed my suspicions that it was created on a fluke and I am so thankful for this wonderful discovery!! I'm surprised I never thought of it myself because I used to drink Jameson like it was my job, paired with cereal and milk as the perfect hangover cure but I never thought of actually ingesting the two together and thank goodness someone was thinking out of the box (or really really drunk) when they created this heavenly concoction. \n\nWhen I think of cornflakes in milk, I automatically think of nasty soggy cornflake chunks that have been sitting in milk too long and are falling apart and hanging together for dear life but this version is NOT even like that!! The cornflake is such a sweet little surprise in constrast to the smooth creamy texture, and then TA-DA, here comes that Jameson flavor to heighten the experience even more. I swear, it was a party in my mouth and only Frozen Kuhsterd was invited. \n\nThe cookies & cream flavor was okay too but SCM stole the show and seemed to be a crowd fave, perhaps b/c it's so \"different?\" I wanted to ask them about other liquor infused flavors in the future (Hennessy Sugar Cone, or Vodka Cranberry perhaps? Let's patent this now!) but didn't want to seem like an alcoholic. I was already a groupie at their table the whole night asking for seconds as well as bumming off Mary-Anne & Yohanna's seconds, and then eventually thirds. I probably would've eaten out of the container if they hadn't ran out and plus I started to get drunk off it (just kidding, maybe, maybe not) and plus my stomach started to hurt (really though but it was my fault, not theirs). Major crackhead status with the Spiked Cereal Milk. Like, seriously. Even up to now, I still can't stop thinking about it. I need counseling for my obsession and withdrawal, it's almost frightening.\n \nThe only advice I have for them is why aren't these small batches packaged yet??!!! Let's expand on the business development, and commercialize a little bit, unless you want me to stalk you and I'll totally eat up all your supply everywhere you go. Like Mary-Anne C. said, if you EVER need a taste-testing panel, holler!!!!.... and I'll even work for you in exchange for pints of Spiked Cereal Milk. I already have my uniform, my handy dandy Frozen Kuhsterd t-shirt.\n\nBig Supporter here. Frozen Kuhsterd Forever.", "author": "Joraine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-14", "description": ":Q\n\nThe reviews don't lie--Frozen Kuhsterd is AH-MAZING! \n\nI had the pleasure of trying Frozen Kuhsterd at Rock Wall Winery in Alameda. I ordered the Corn Cereal Milk custard with cornflake topping (free with yelp check-in).\n\nO-oh man. So good. So good. It tasted just like a rich soggy cereal AND I LOVE SOGGY CEREAL. The crunchy cornflakes also added to the custardy cereal experience, mmm.\n\nThe service was very friendly and happily offered samples. 10/5 stars, will try again.", "author": "Adri A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-03", "description": "EASY PALATE PLEASERS\n(5 stars)\n\nStumbled upon Frozen Kuhsterd at the Elite Yelp event at Rickshaw Bag Works and was instantly a fan, follower, and future stalker. I'll give you six stars if you add an extra scoop in my serving. They are a traveling piece of work, follow them on twitter (@frozenKuhsterd) to get your FIX'Ns...\n\nI'm a huge icecream kind of person, so I'm sure i'll like frozen custard. I'm very picky with the taste of my frozen desserts but Frozen Kuhsterd had me hypnotized after a dabble of their spiked cereal. AND it's 97% organic (there's one ingredient that wasn't organic - fogot what it was) but i'm on the healthy regine and majority of my meals are organic; so that fact definately put a smile on my face.\n\nHEFFER-STYLE STATUS.\n\nSPIKED CEREAL - The texture of the of the frozen custard was very smooth and light, kind of like froyo. And the infused flavor, THESE YOUNG PROFESSIONAL STREET VENDOR SCIENTISTS ARE GENEIUSES. The infused flavors worked well against each other and not one flavor was over powering then the other. \n\nWill i be back? I'd love to try their other flavors. Great meeting them personal and wish them the best success. \n\nJABA APPROVED... Until the next review.", "author": "Jane A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-14", "description": "Forget about Bi-Rite, Mitchell's and Humphrey Slocombe! Frozen Kuhsterd is the best frozen treat in town. Every unique flavor is perfectly creamy and smooth, with just the right amount of flavor that it doesn't overpower the natural delicious taste of the ice cream.  \n\nThe owners are all extremely awesome, genuine dudes that are very passionate about what they do. They also showcase their Filipino heritage, as well as various other fusions of different ethnic cuisines in many of their flavors and interesting sundae creations. \n\nI also love that they partner with other cool local businesses like Dynamo Donuts, Four Barrel Coffee, and Don Bugito, and even host pop-ups on their truck. \n\nAll these things combined make Frozen Kuhsterd one of the most important innovators currently shaping the future of the Bay Area food scene, and I definitely see big things happening for them.", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "You don't have to like ice cream to like Frozen Kuhsterd.\n\nWell, you can't *hate* ice cream, or at least the basic properties of it (cold, soft, flavored), but if you know me, you know that I'm a real scrooge when it comes to ice cream reviews. Why?\n\nBecause ice cream shops always serve up flavors that you would never find in real life. Would you ever *eat* a rocky road of your own volition? Not a real rocky road, but a smattering of nuts, chocolate chips, and marshmallows? No. And so general ice cream flavors are commoditized, shops are fine peddling them, and reviewing such product is a lot like eating dutch crunch from three different sandwich shops and claiming that one is head over heels.\n\nBut what if your ice cream was something more? If it were measured not along a dimension of \"flavor,\" but a dimension of experience? Like the good old fashioned soda machine days, before coca cola and Pepsi owned 90% of the market? Ice cream flavors like Cereal Milk? or Thai Tea?\n\nI can feel myself getting too into this review already, so I'm going to cut it short. Try those flavors if you happen to pass by Frozen Kuhsterd, and tell me it wouldnt be worth standing in line for. And let me tell you how much I hate standing in lines...", "author": "Christophe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-29", "description": "I tried Frozen Kuhsterd out at Eat Real Festival 2013 based on the recommendation of Yelp itself (per its' Eat Real Gluttony Guide). Unfortunately, I had been banking on trying their Dynamo Donut sandwich with Four Barrel coffee custard, but it wasn't available at the time, so I ordered Thai Tea frozen custard with burnt caramel and condensed milk as toppings instead.\n\nI have to say, I was pretty much blown away. I knew I was risking extreme gastrointestinal distress (I'm lactose intolerant), but I couldn't pass this goodie up. Due to my own ineptness, I couldn't finish the frozen treat because it ended up being too sweet (darn you, sweet tooth, for wanting caramel AND condensed milk!!).\n\nI only wish this food truck was closer to the Financial District (and that it wasn't approaching winter...) so I could eat this delectable dessert more often! Some of their other flavors sound AMAZING and I'm definitely going to try a new one whenever I happen to come across them!", "author": "Anna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-26", "description": "Frozen Kuhsterd looks and tastes similar to gelato but isn't gelato.  something about egg whites and density. the main thing, the texture is tight. no air holes.\n\nlocale: firehouse art collective(6/26)\n\npricing: 3.50/scoop, 5/2 scoops\nflavors: strawberry with port wine, blue bottle coffee.\n-strawberry sublle\n-coffee flavorful not full flavored.\n\nkuhsterd drips:\n-addictive, couldn't stop eating it\n-not too sweet, sugar probably not added.\n-samples freely given.\n-would repeat with other flavors.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-13", "description": "Soo good! We tried the Napa and the bread pudding ice cream. The bread pudding made the ice cream to heavy and not as awesome as I hoped.\n\nHowever, the Napa ice cream was delicious and perfect! Can't wait to try it again!", "author": "Iliana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-27", "description": "The guys here are REALLY nice.  They look like aspiring hip hop artists with a part time food gig... which seems to be the thing.  I don't know why I'm shocked at their friendliness -- it must be from the eclectic/fancy food = stuck up attitude.  But here, they offer you samples when you're not sure and just emit a really good vibe.  \n\nThe Four Barrel coffee custard is really delicious and strong.  I probably didn't have it in the ideal setting at the Forage SF Underground Market where they don't have proper cooling.  My custard melted fast.\n\nBefore ordering, I also sampled the cereal milk flavor which totally tastes like the name.  Now if only they could implement a variety of cereal flavored milk.  I wouldn't mind some Apple Jacks cereal milk... hint hint.", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-14", "description": "Had the opportunity to taste Frozen Kuhsterd for the very first time at a Loopt event.  Wow, my first thought was, amazing, delicious, flavorful goodness!  Then, I was introduced to the two guys who are the creators/makers of these delicious frozen custard goodness and I was even more impressed.\n\nThey really care about their creations, and it really shows.  Even at the event, they kept asking every person who tasted the two flavors what their thoughts and feedback were... I like that they are super humble about their products but at the same time they know what they have rocks... \n\nCan't wait to have more of that creamy yummy deliciousness!", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "Frozen custard? Mmmm, who knew?\n\nWas at the Bacon Festival today and Frozen Kuhsterd happened to be there. Tried their special Waffle Bacon bits on top of Vanilla Bean and it was delicious. Babe tried their White Coffee flavor and that was very tasty too. Flavors are perfectly balanced with flavor and sweetness and the texture is extremely creamy and smooth; very similar to gelato. I'm extremely curious of their White Rabbit flavor since I loved that candy as a kid. Too bad their not located here in SJ... or it might be a good thing because I'd be visiting this place everyday which would not be good for my waist line...", "author": "Vivian K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-13", "description": "It was a nice sunny day at the Dolores Park on Sunday.  Friends and I were picnicking and two guys come to us and ask us if we've ever had Frozen Custard.  A collective No and an offer of free samples captured our attention.  One of the owners, Jason was offering up a Four Barrel Coffee and a Mexican Chocolate.  Both were equally amazing.  The texture is nothing like what you would expect.  Its like a mix of ice cream and soft serve.  The coffee was better than Hagen Daz Coffee, I swear to God.  The Mexican Chocolate had a good amount of cinnamon and I don't even usually like Chocolate ice cream.  We ended up buying a pint of each, which was a \"special\" intro price of $6 a pint.  \n\nIf you see these guys around the Mission, do yourself a favor and try the stuff.  You won't see ice cream in the same way!  BTW, you can follow them on twitter according to them!", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "Frozen Kuhsterd - They're absolutely unstoppable.\n\nSince day one, they've been on a mission to differentiate themselves from other desserts. They're better than your traditional ice cream or soft-serve fro-yo. They push boundaries and bring us the unexpected.\n\nFrom Thai Tea to Peaches & Cream, they never cease to amaze.", "author": "Brenda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "Had a couple rounds of Avocado and Milk & Cereal custards at the recent Yelp Event at The Layover Lounge. Both custards were delicious and not too overwhelmingly sweet. It was very creamy. Jason was really nice and took care of us as we were waiting for the lounge to open up. The avocado was refreshing. I was surprised with and without the condensed milk how the flavors did not fight each other and the avocado flavor shined. I really want the cereal they topped the milk custard with. Very crunchy and played to my other senses.\n\nHope to get to taste more of their concoctions (for a reasonable price of course ;) )", "author": "Carolen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "i had this yesterday when is was 40 degrees from the food truck hu hu hu -.- \nnot the cheapest ice cream i had but one of the best. i had the 4 barrel coffee ice cream, and god it was good. it actually taste like coffee unlike the really sweet types. really good! definitley reccomend it :)", "author": "Claire S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "FK's Thai Tea flavor is absolutely delicious. Gotta come back to try all of the other flavors they have. Would highly recommend to anyone to go try you won't be disappointed!", "author": "Lester F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "We hired Frozen Kuhsterd to make ice cream sundaes at our 150 person wedding in Piedmont, CA. The sundaes were a huge hit - we had guests going back for multiple servings, and everyone was raving about the \"Napa Style\" special sundae, consisting of vanilla custard, EVOO, homemade burnt caramel sauce, and Himalayan sea salt. Frozen Kuhsterd ended up being one of the highlights of the wedding for guests, and we've received endless compliments from guests. The Frozen Kuhsterd staff was professional, friendly, and easy to work with. They brought a branded cart that looked great at the venue and their overall presentation was great. The quality of the custard is exceptional - if you're a soft serve fan, or frozen yogurt fan - you'll love it. The flavors are unique and they don't use any artificial flavors or colors. I hope to work with them again!", "author": "Chloe S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "Pretty freakin' delicious! \n\nLove the smooth and creamy texture, and the variety of options.\nDefinitely prefer this to Smitten...", "author": "Christine S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-15", "description": "Customer service strictly: never showed for an event that they were invited to and accepted. I am sure the kuhsterd is good, but wouldn't know...nice job!", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-18", "description": "Welcome to BESTEST Frozen Custard Truck in the world!\nYou will not find this quality, flavor, and great food trucker, Jason & Alex!!!!!\n\nI've eaten \n*Black sesame\n*Green Tea Macha w/ White Chocolate \n*Cinnamon Toasted Crunch\n*Irish Coffee\n*Cereal Milk\n*Taro\n*Irish Whiskey\n*Chocolate Molt\n*Potato Chips\n...and more!!!!!\nThese are all flavor you may able to taste, but they have different flavors every time.\n\nI've never tasted FK x Dynamo Donuts combination so far, but all pic tells me everything and my hungry stomach says \"Go get it and destroy it!!!!!\"\n\nI would love to have it someday soon!\n\nGive FK yourself, you'd NOT disappointed every scoop :-)", "author": "Marina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "This food truck was at my high school's 75th anniversary carnival and thank goodness. It was a very hot day and they made many sales. I liked the Thai ice tea flavor and I want more.", "author": "Infodiva B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "This is my 2nd time and they improved their offerings to 5 sundaes that use Mission Hill Bakery, Dynamo Donuts and another local food purveyor at SF.\nService was excellent and provided me a sample because I was so indecisive between the Four Barrel Coffee and their Thai Tea. The Four Barrel Coffee has a strong, smooth and chocolate notes coffee frozen custard,but this wasn't too rich. On the other hand, you got to try the Thai Tea (one of their seasonal flavors),a distinctive Thai ice tea in frozen custard that tingle my taste buds wanting more. These flavors are exceptional on their own. \nI tried their Burnt caramel bread pudding sundae,so you can choose 1 flavor with bread pudding and their owned Burnt caramel. I would rate this as a 4.5 because the bread pudding complemented well with the Thai tea frozen custard but the Burnt caramel was thick buy cloying sweet. I didn't taste burnt notes of caramel though. This sundae is too sweet but it was kind of comforting because of the bread pudding. It tasted like the Spotty Dick, an English bread pudding that had some spices but the Burnt Caramel was the sauce. Of course, the sundae was topped with freshly made whipped cream. This cost $6 .\nYou should try their Napa style sundae= it's their vanilla bean frozen custard with a light EVOO  (not too strong olives oil but good for dessert), and their caramel sauce. Don't let EVOO fool you or stray away for just trying their sundae. Also,try their donut or cookie ice cream sandwiches.Yummmm.....:)\nOnly dessert ice cream truck I would go back to try for dessert. They had 4 featured flavors at that time during the Fremont Street Eats (Vanilla Bean, Strawberry, White Chocolate Mint and Thai Tea). \nCheck on their Twitter and their website where they are going to be at. This custard was 4.5 because it was smooth, dense and  the flavors were phenomenal. They will rotate 4 flavors at a time, and sell baked goods like cupcakes,  and few other baked goods from Mission Hills Bakery and Dynamo Donuts. Then they partnered Four Barrel Coffee to make a signature coffee frozen custard. Then Frozen Khusterd makes over 30 original and seasonal flavors of this frozen dessert. They are the only dessert food truck that makes excellent frozen custard in the West Coast. Try it and you won't regret it.\nService is 6/5. I mean the girl was a sweetheart and gave me 2 samples because of my indecisiveness between the Four Barrel Coffee and Thai Tea flavors. Their scoops are huge for a Single ($3.50) and it was like almost 3.5 to 4 inches high. The Kid scoop is like $3 which almost 2 to 2.5 inches  in height. The double scoop is $5. They offer ice cream sandwiches, cones, scoops and their signature sundaes partnered with other local SF bakeries and a coffee purveyor.\nFood is 5 and menu has greatly improved. \nAmbiance is still bustling, busy, and yuppie happy feeling. Cleanliness is 5.", "author": "Jade M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-01", "description": "Best. Frozen Custard. Ever. \n\nReally enjoyed my thai tea flavor custard. Perfectly creamy, sweet, and rich. I think it was near $3 for their smallest size? Good price!\n\nWill be hunting this truck down for more custard!!", "author": "Ashley N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-09", "description": "I haven't tried the frozen custard yet, but I just met the mastermind behind this genius concoction @ the Yelp in the Hundred Event earlier today. His name is Jason and he's a cool dude. I only talked to him for a few minutes but his outgoing personality was mesmerizing. I could tell that he is passionate about the food that he puts out. Very knowledgable, too. He, himself, deserves 5 stars already.\n\nHe is currently cranking out his next project: Sugar & Spun, which is his own take on cotton candy. You know something is as good as it looks if it gets written in the newspaper. Read it here: http://insidescoopsf.sfgate.com/blog/2013/08/08/sugar-spun-brings-a-new-kind-of-cotton-candy-to-san-francisco-with-some-help-from-shrek/\n\nAt the Yelp event, I tried the four barrel latte and chocolate banana cotton flavor. Although both flavors were unique, I liked the four barrel latte more. Coffee anything will always win my heart over. But don't fret if you're not a coffee lover. They offer other flavors such as spiced mango, strawberry and cream, and cheesecake. Who would've thought that cotton candy can portray such flavors and still be tasty? It lightweight reminds me of cupcakes, except it won't create a crumbly mess. Give it a try!", "author": "Annie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "Kids scoop vanilla bean with burnt caramel. Delicious! Loved the vanilla bean flavor. The burnt caramel flavor wasn't overpowering. Definitely going to be one of my favorite combos.", "author": "Yvonne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-01", "description": "Been wanting to Frozen Kuhsterd in ages and was so excited to finally get to when I saw them at the Eat Real Fest 2013. So many that I wanted to try but unfortunately I didn't have a big group w/me to share so had to settle on one for this round. I enjoy Four Barrel Coffee so opted to try this flavor first (especially since I love Blue Bottle from Humphrey's). The frozen custard was sooo creamy and had lots of flavor. I simply can't wait to find them again and try their other flavors!", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "The people that work the food truck are awesome! Genuinely super friendly people and are clearly passionate about their custard. They were basically dancing with joy when explaining the different flavor / topping combinations. It was awesome. \n\nSpeaking of the custard- wow SO good. I got the blue bottle coffee with almonds and each bite was divine. They had a ton of super intense sundays and combos involving donuts, but that's not my style. Just give me a scoop!", "author": "Kerry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "I never paid much attention in my high school U.S. history class, but I do seem to recall my teacher mentioning all sorts of terrible things happening during \"Custard's Last Stand.\" \n\nI don't get it.  I tried Frozen Kuhsterd's Thai tea flavor ($3.50 for a large scoop) at the SF Street Food Festival, and it was wonderfully delicious.   How can something so sweet and flavorful and creamy bring about anything besides peace?  Imagine a creme brulee, but denser and served cold.  You can customize your custard with toppings, including the condensed milk that was recommended to me as a complement to the Thai tea flavor, but I found no need for the added accoutrements.  It was just sweet enough all on its own.\n\nOh, I see:  it's Custer, not Custard, for all you history buffs.  Well, I think the lesson to be learned is that the U.S. would have had more luck winning over the Indians with Custard than Custer.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "Decadent y delicious! Silky, creamy texture that only frozen custard can give :) YUM!!!\n\nThe Thai tea and condensed milk combo was bomb!!! As was the coffee with corn flakes! \n\nI will definitely be coming back!", "author": "Maya-Luisa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-31", "description": "Spotted their truck at an Off the Grid. I hadn't heard about them but I've recently developed this interest in frozen custard for the past year ever since I was introduced to it in the Mid West and so I knew I had to try Frozen Kuhsterd. I opted to not get any additional toppings or drizzle because I just wanted to taste the frozen custard on its own and a good frozen custard does not need to hide behind any toppings. I got the thai tea and coffee flavors and they were absolutely delicious! I can't wait for the day I spot this truck again so I can try their other flavors!", "author": "Cindy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-18", "description": "I actually tried them at a Health festival in Union City at Quarry Lakes and it was a REALLY warm day and frozen sounded delish!\n\nthey have a few flavors out for us to buy, coffee, vanilla bean, taro, thai tea\n\nOH MAN OH MAN was it freaking DELISH!!\n\nMy BF and I tried the Four Barrel Coffee and Thai Iced Tea - HOLY moly so GOOD\n\nOVERALL: They need to come to the east bay more often!! :)", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-18", "description": "Feedback is everything. The custard alone is good. IMO it tastes just like ice cream. So given the price for one scoop you are better off going to B&R. The specials that feature donuts, cupcakes and what not are terribly stale and taste terrible. Fix this. There is no excuse for it. Just fix it.", "author": "Jin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-03", "description": "Nom nom nom, yum yum yum :)\n\nI've been a Frozen Kuhsterd groupie for awhile; more like I followed where it will be parked and finally saw that they were going to be at Off The Grid in Daly City! I jumped on the chance to go here and eat dinner just so I can try Frozen Kuhsterd.\n\nI had the Thai Tea and Four Barrel Coffee - I prefer the Thai Tea more. It's extremely creamy and soft, I love me some soft served ice cream and this is what it reminded me of except that it is more creamy! Thai Tea was really good and taste like you were eating a nice cold Thai Tea. \n\nThe boyfriend thought that it wasn't a big deal and that it was over hyped and it is just ice cream and there was nothing special about it.", "author": "Mona L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-07", "description": "Tried their \"kuhsterd\" for the first time at off the grid of telegraph and i didnt really like it. First of all, it was too pricy for a dessert. Second of all, i guess i had a different interpretation of what frozen custard would be. This just tasted like an overpriced ice cream.", "author": "Cherry Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-19", "description": "I've always said, I can give up pasta, rice, but not my sweets. I mean...I did decide to go on an ice cream-venture to find the best ice cream shop along the Peninsula, so I would think I have some expertise right? :)\n\nFrozen Kuhsterd to me is a combination of ice cream and gelato...very smooth, creamy, and such a delight. I am a big fan of the flavors, its toppings, and the customer service FK workers provides. Ask them what combination works best, and they won't hesitate to let you know. Of course they know how to create the perfect balance. I mean you would think that a bacon-pecan pie topped with blue bottle coffee kuhsterd, drizzled with condensed milk would be over the top, but what a masterpiece! Today, I double-fisted with a single scoop each of the ube and thai tea. Both were devoured within minutes! (Oink!)\n\nWhenever FK is available on Gateway, rain or shine, I am there. I am looking to tasting more the flavors, and will make sure to order pints to go next time.", "author": "Eunice M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "This place is the BOMB! \n\nNot only the people were nice and welcoming, but their custards were great! Many different flavors where you can't buy else where! \n\n*Handmade custards* \n\nMy favorite flavor was the Thai tea custard (runs low at times causes its so popular!)\n\nRECOMMEND!!", "author": "Kim C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-11", "description": "Frozen Kuhsterd boys are the best! They're so friendly and happy all the time maybe it's because they're making bomb ass ice cream all the time! I've had the cinnamon toast crunch ice cream with CTC on top- kinda tasted like cereal ice cream which is fine by me. I've also tried the plain ol' vanilla with chopped almonds- sometimes simplicity is the best. \n\nOnly complaint is if you get a plain scoop of something then they put it in this tiny plastic container and the ice cream is practically spilling over the edge so if you don't eat it really fast then it starts to melt and get pretty messy.  If you get something with toppings it comes in a plastic cup so you're good there.", "author": "Jojo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "This is hands down the best frozen dessert of any kind in San Francisco, and possibly the best customer service in the city. Besides that,t he owners are awesome and down to Earth, they love to chat if they have time. There really is nothing negative to say about them except that you can't buy it on every corner, haha.\n\nEvery single thing I have tried here has been amazing, but in particular I recommend the hot cola float, it's very unique and the heat changes the flavor and texture considerably, it's almost like an herbal drink. If you're a fan on Fernet you would almost definitely like it. Hey, maybe that can be another flavor for them to try...", "author": "Joshua B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "I tried this place at the recent yelp event I went to and what is there left to say that other yelpers left out- nothing besides *insert some cheesy/ corny line that defines the pure goodness this place is. I had the crack pie custard and omg it's almost better than the actual thing. I was so impressed and I am seriously thinking of renting their truck or stand out for my graduation brunch ( it's not everyday a Black woman earns her masters- so why not celebrate big with some custard, right?) Plus the owner was super nice and down to earth, what's not to love!", "author": "Desiree C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-01", "description": "Wow. We've had custard in Milwaukee (supposedly the home of custard ), but this blows it away. Thai Ice Tea Custard, Chocolate Malt Custard, Strawberry Custard -- and that was just one day's menu.\n\nFind their truck in the Off-The-Grid directory or at their web site, and hunt them down !", "author": "Richard H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "Although I have yet to try his awesome creations straight from the truck (**sad face**) I HAVE got to try several flavors available at Ssisso, and I am a HUUUUUUUGE fan! Seriously, I don't rave about things, but I will tell anyone and EVERYONE about Frozen Kuhsterd and his awesome creations!\n\nTo date I have sampled:\n-black sesame\n-espresso (or some coffee/mocha flavor)\n-avocado\n-Cinnamon toast crunch\n\nThey have all been unique, flavorful, and DELICIOUS! Very creamy, but not so heavy feeling. I personally have been a fan of the black sesame and the avocado, which is interesting because I'm usually all about flavors that are going to be full of boldness (like the cinnamon toast crunch one). \n\nAnyway, if you stumble upon his creations somewhere, get some FAST and be prepared for a real treat!", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-31", "description": "Went Yesterday had the smores sunday 6.50. It was OK, nothing out of the ordinary or anything I would go WOW about.  Limited choice of flavors in pleasanton. The service staff was very friendly. I would have to say that I wouldn't go out of my way to try this place again and I might go elsewhere because it wasn't worth 6.50 so alittle pricey.\n\nall in all an ok experience", "author": "Dave O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-12", "description": "When I heard \"frozen custard\", I imagined something different, but it turned out to be regular ice cream. But they do have some great flavors! I tried the banana rum and liked it.", "author": "Hema R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "The truck parked at my workplace today and MAN, was that an awesome surprise! I had a cupcake sundae - Horchata cupcake, cereal milk custard, and burnt caramel sauce. Well worth that extra couple of miles I'm going to run today ;)\nFrozen Kuhsterd, you rock!", "author": "Anne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-28", "description": "YUMMMMMMMMMMMMMM\n\nFrozen Kuhsterd came to the Eat Real Festival in Oakland, and my roommate and I made sure to come by! I was super looking forward to their blue bottle coffee, but they gave the last scoop to someone right in front of me. :(((( \n\nAmongst the three of us, we got a scoop of vanilla, cinnamon toast crunch, and the bacon waffle sundae! Yummmm! The frozen custard is the PERFECT consistency: it's soft but thick and creamy. Sooooo good! The vanilla was really yummy, and cinnamon toast crunch seriously (cereally??) tasted like cereal! Sooo good! Their custard is also like the perfect sweetness!\n\nThe bacon sundae was also good! The bacon is cooked into the waffle, which is served with a scoop of vanilla on top. The waffle was kind of hard, and a little difficult to eat. Would probably pass on this and just get the custard on its own next time.\n\nCan't wait to be back!", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-22", "description": "The GF and I came here and ordered the Boba Guys' Sundae.  I have to say that my mind was already made up about this place when I noticed that the sundae had boba made from Boba Guys.  (See my Boba Guys review).  The tiny $7 sundae just did not hit the spot for me.  I would have preferred to buy a pint of ice cream from Safeway. :( .  The black sesame ice cream was okay tasting.  The boba killed it for this sundae though, and not in any good way.  The boba was bland, for lack of a better word.  I would not come back here.  I am sorry my fellow Yelpers.  I do not agree with the high ratings.  Haters gonna hate on this post... I know it.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-12", "description": "Getting carded to buy ice cream?  Priceless.  \n\nAt SOMA Streat Food Park on Cinco de Mayo the only flavor they had left was Resposado Tequila.  Each scoop ($3.50 per) contained 1/3 shot of resposado tequila and yeah, they were checking i.d.s.  \n\nThis stuff was great.  This is the 2nd time I've had Frozen Khusterd's product and I liked it equally both times.  Much better than Humphrey Slocombe, in my opinion.  Discounts on multiple scoops in a single cup or cone.  I had to go single scoop, designated driver y'all.", "author": "James A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "I approached this food truck wanting to try the most unique flavor and ended up getting \"frosted flake cereal milk\". The taste was spot-on. Truly did taste like the milk left over after eating frosted flakes haha. It is much creamier than icecream thats for sure. \nI'm an icecream LOVER. I work at a icecream store...I eat it everyday. ALthough it was more creamy, I would not pay the price again. I think i was around $4 for a single scoop with no toppings? It was a good experience though.", "author": "Jessica A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-07", "description": "Don't know if I just caught this truck on a bad day, but it definitely did not live up to the hype. I was disappointed that they didn't have more interesting flavors like kettle popcorn and cinnamon toast crunch custard that they had listed on their website. Instead, I had to settle for a plain dark chocolate with a boring topping. I really love frozen custard, but the consistency was not as rich and creamy as the other custards i had tried in the past. Overall, I was underwhelmed.", "author": "Arathi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-16", "description": "The chocolate float is cold, creamy and delicious. They do a really good job of maintaining the quality of their frozen desserts--if it had been served to me at my office, I would never have known it came from a food truck.", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-22", "description": "Fantastic. I had the Corn Flake Cereal custard with oreos, sprinkles, and caramel. It was every bit as fantastic as it sounds.\n\nSo good.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-02", "description": "All my friends know I LOVE my sweets, like LOVE. I can have the biggest dinner, but still make room for delicious dessert! AND NOW YOU KNOW TOO. :)\n\nI am on the constant search for the best dessert in San Francisco. I finally got the chance to try Frozen Kusterd and I FELL IN LOVE. If you haven't tried it yet... you better go find their truck! I guarantee you will fall in love too. Yes, I guarantee. \n\nI am a sucker for cheesecake AND it just so happen that they had a cheesecake flavor with the graham cracker chunks on the bottom. (drool)! I got a chance to talk to the owner and found out that all their ingredients are local, organic, and natural!! Delicious with natural ingredients?! I am SOLD. :)\n\nYou know what.. don't take my word for it.. GO try it and see for yourself.. When you realize I was correct, come back and thank me ;)", "author": "Kalok L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-04", "description": "When it comes to frozen, creamy dessert I don't really discriminate. I will eat a tub of generic supermarket ice cream but can also appreciate artisan ice creams as a special treat. I'll also admit that I don't taste a huge difference between frozen custard and ice cream. \n\nBut what makes me dream about Frozen Kuhsterd are their creative flavors and smart sundae combinations. Their custards like Cereal Milk, Dirty Chai, and Burnt Caramel can stand on their own. But when I have dessert, I want the whole shebang. The first time I tried them at the Asian Street Festival in the TL, I tried the cereal milk sundae with condensed milk and cinnamon toast crunch and thought that would be my fave but I was blown away with the one with azuki beans and matcha syrup. The balance of flavors was perfect. \n\nAt the Eat Real Festival, I tried their interpretation of halo halo with custard atop flan with puffed rice - I need the crunch. I love liege waffles so this sundae with a mini bacon waffle is really what convinced me to stop by the ERF. It did not disappoint. \n\nI'm so over most mediocre food trucks and food concepts that just pile creamy, rich crap on top of fried grease. These guys know what they're doing and I will continue to stalk them. Smart to collaborate with local bakers for baked goods to pair with the custard. Wish I'd tasted their ice cream sandwiches with pandan cookies and kouign amann (next big French pastry to hit the US...forreals).", "author": "Mimi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-24", "description": "YUMMY!! I'm hooked!! Everytime the truck is in my area we are there!! Sometimes I feel like a stalker!! \n\nThai Milk tea with condensed milk and honey grahams or Four Barrel Coffee with Burnt Caramel or a Coffee donut with four barrel coffee and condensed milk OMG I could go on and on with the combinations...they are ALL DELISH!! \n\nJason and Alex are so friendly and I feel like I've known them FOREVER!!", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-18", "description": "What I ate: Frozen custard!\nVisit date: January 13, 2012\nFirst time? Yes.\n\nI had never had frozen custard before...until now! I didn't know what to expect, but I was pleasantly intrigued. Two flavors were served; I tried both. :)\nThe Buena Vista is like an Irish Coffee -- made with Blue Bottle coffee and Jameson Irish Whiskey. Oowee. Here's your alcohol fix for the day (a bit too strong for my taste). The Jameson makes the consistency a bit like a slightly melted froyo.\nThe Cinnamon Toast Crunch -- tastes just like cereal and milk topped with a Cinnamon Toast Crunch crumble. This flavor was more my style. It was creamier and the cereal topping added a nice texture. Another helping please. \n\nPS I tried Frozen Kuhsterd at a Yelp event. I'm not sure where they'll turn up next, but watch for them! You won't be disappointed!", "author": "Erin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-26", "description": "I was pretty much expecting this to taste like regular ice cream. I had low expectations which is why I opted out of the toppings and just got one scoop of plain ol' vanilla. I figured if I didn't like their most basic custard then I'd probably not like the others. Boy, was I wrong! I don't really know how to describe the taste. Not your run of the mill ice cream or froyo. Kind of like leche flan for all my fellow Filipinos but not exactly. It's its own hybrid. \n\nCan't pin point the taste, all I know is that it's on point. See what I did there? \n\nDefinitely trying the different variations next time I encounter this baybeh. Thumbs up!", "author": "Abigail D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-18", "description": "Thai tea frozen custard! Man, i love frozen custard and I love thai tea! i was this close to getting the sundae that added boba and almond jelly onto it... It'd be like a frozen milk tea ya know? \n\nI didn't (and I still regret it) but I topped my thai tea frozen custard with corn flakes instead and that was yummy. The custard had a really strong thai tea flavor - I love that they don't hold back.\n\nMy one gripe comes with the texture  - if you're used to frozen custard from Texas... this lacks the smooth, velvety, and dense consistency that I've come to associate with frozen custard. I'm gonna describe it, so bear with me - but frozen custard should be like super dense soft serve ice cream. Like soft serve gelato, ya know? This just felt like - normal ice cream... but delicious! \n\nOverall though, this was a very enjoyable scoop of a frozen treat that's almost like frozen custard but not quite. Check it out!", "author": "Karina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-28", "description": "Ever since I heard about Frozen Kuhsterd, I've been scratching my head. \"Wha? Is that like an egg tart frozen? Are they served in little dishes?\" I really didn't know what frozen custards were, my closest encounter with them would be the Concretes at Shake Shack in NYC. ANYWAY.\n\nTo answer your question, frozen custard is pretty much like ice cream. Like denser, creamier, richer, melts in your mouth but not as fast as ice cream. Meaning, it's like the butter of ice cream. Mmmmm. Butter.\n\nAs a ice-creamy desserts fanatic, I especially love ice-cream brands that like to be adventurous and come up with new flavors all the time. Like your staples? Frozen Kuhsterd's Cereal Milk got the tasty factor on lock! Light in flavor, not too sweet, smooth texture. I would love this in an Affogato (idea guys!)  \n\nI can't wait to hit them up again to try their Thai Tea, Chocolate Malt, parfait sundaes and ice cream sandwiches. Hope they'll be around a lot more now that they have a truck!", "author": "Faffy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "Frozen Khusterd was at our schools Centennial celebration and I got the joy of trying their delicious custard.  My daughters couldn't get enough of the s'mores sundae and haven't stopped asking me when we will be going back.  The owner Jason is such a great guy so make sure to visit Frozen Khusterd.", "author": "Meghan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-25", "description": "I was pretty excited to come across this truck at Off the Grid Serramonte since I always heard about how delicious frozen custard is. \n\nThe line was about 20 minutes long (which was fine since that's usually a good sign) but by the time we got to the front they were sold out of several of the custards and toppings. I was really hoping to try their boba so that was a bit of a disappointment. \n\nAnyway I ended up getting two scoops of their four barrel coffee flavor with the burnt caramel topping ($5.50). The custard itself was very creamy (it reminded me of Mitchell's Ice Cream) but I didn't find it that flavorful compared to something you might get elsewhere. On the other hand, the caramel topping was delicious, definitely my favorite part. \n\nI'm determined to try their boba so I'll definitely be back to try more.", "author": "Cara K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-14", "description": "Avocado oh so good!\n\nThe guys were so nice letting me try all of the flavors. And then I expressed my enthusiasm for seeing them in their truck so they gave me a box of mini cupcakes to share with my office! we're fans :D\n\nPlease come back to mint plaza!", "author": "Julia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-23", "description": "Simply delicious.  Interesting flavors, interesting toppings, and reasonable prices.  The coffee custard I had was excellent, with burnt caramel topping.  I hope to see them again at the StreatFood Park- will return for sure when my sweet-tooth gets the better of me again!", "author": "Andy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "Thai Iced Tea - in a word, delicious! Smooth, velvety flavor that wasn't too sweet. Would love to try out other flavors the next time I patron Off the Grid!", "author": "Gabriel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-28", "description": "I had my first taste of frozen custard a few years ago when I was living in Seattle and I was really sad when I moved here and SF didn't really have any frozen custard places.  Lo and behold the boyfriend and I discovered that Frozen Kuhsterd existed last weekend.  Fast forward to this weekend and we were at the Treasure Island Flea Market and what do we see but the Frozen Kuhsterd food truck.\n\nI got a double scoop of the vanilla and we enjoyed it under the shade of a tree.  It was a little icy, but the flavors were really good.  I'm a little disappointed about the amount I got, I kind of feel like the scoops could be bigger (2 scoops for 5 bucks) but I'm not going to complain about it either.\n\nIt wasn't as good as the place in Seattle, but it still hit the spot.  I would definitely get some more if I saw them around town (but I doubt I'd seek them out either).", "author": "Quynh-An P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "This place is so amazing! I think it's my first time having custard. \n\nWe found it at the SOMA Food Truck Park today. No line. A little pricey.\n\nWe got the Maple Bacon Glazed Donut over Four Barrel Coffee custard with Burnt Caramel drizzled over it. So freakin good!\n\nDefinitely try it out.", "author": "Jack K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "Really fantastic coffee flavor in the custard.  Also, the custard itself is delightfully rich and creamy, without being overly sugary.  \n\nFantastic experience.", "author": "Di Yin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "Frozen Kuhsterd was serving up four flavors today at OTG Pleasanton and I ordered a scoop of the Guittard Chocolate. It was a flavor I hadn't ordered before and it was good. My only minor complaint was the icy texture of the Kuhsterd. I'm used to it being creamy (cuz it usually is), but today's batch of chocolate had an icy texture.", "author": "D B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-09", "description": "Tried the dark chocolate stout beer and honey graham cracker flavors served by a couple of not bad looking Flips today at Yelp's Beerwalk Empire.  Who knew that Filipinos are the masterminds behind this East Coast and Midwestern dessert?  \n\nWhile I'm by no means blown away by these particular flavors, I'm definitely intrigued to try their creative and unique flavors.  The dark chocolate beer stout tasted like chocolate, and the honey graham cracker flavor was overwhelmingly honey, though the graham cracker crumble added a nice contrasting texture.  Will have to stop by their shop if I'm ever in their neck of the wood.  Or better yet, hopefully their mobile food truck will make it out to the East Bay to garner some more fans on this side of the bay.", "author": "My H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-15", "description": "Today Frozen Kuhsterd came to my old school and I just HAD to visit and get one. I had ordered the Thai Tea \"kuhsterd\" with a maple bacon donut drizzled with burnt caramel. It was AMAZING. I am a HUGE fan of Thai Tea and the flavor of the drink was perfect in the kuhsterd. The sweet and salty combo was just perfect. I will totally come visit the truck some day when I am in the city. I am dying to try their boba sundae in collaboration with Boba Guys.", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-04", "description": "I don't get it.. Why is this place so hyped up? I waited in line for about an hour for this at the jack london square street fair. I thought that it would be amazing since everyone was in line for it. But sadly it really wasn't that great. I mean don't get me wrong it was good but not what I expected. It was a out $4 for a really small cup of pretty much ice cream.  Totally not worth it. It was also REALLY SWEET..too sweet for my taste.", "author": "Nguyet T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "i was able to give them a try at the eat real festival in 2012.  i ordered vanilla custard over a bacon waffle, and i was immediately in love.  its superrrr creamy!  the custard in addition to the waffle gave it the perfect touch.  i cant wait until i encounter this truck again!", "author": "mong linh n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "We saw them in front of the Ferry Building. It was cold but because we were bundled up, a frozen kusterd sounded awesome. The server was friendly and approachable, he was very patient with us as we had a few samples before making our purchase. We got the Vanilla Beam with Cinnamon Toast Crunch topping. Their vanilla bean was delicious! We would get it again. If only you guys can come down to SoCal!", "author": "Stefanie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-04", "description": "You know when you have a bowl of cereal and your milk takes on this amazing 'no longer just milk' taste? The cereal milk that remains is the best bit of a bowl of cereal, right? Just me then? No, you're the weirdos! \n\nIn any case I tried Frozen Kuhsterd's Cereal Milk offering and it was a taste explosion in my mouth. It could be the best frozen dairy dessert I've ever had. It was closely followed by their mocha flavour. \n\nDon't think about it. Just do it. Your mouth will thank you. I can't guarantee your waistline will say the same...", "author": "Lani P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-03", "description": "Frozen Kuhsterd Kusterhd Kuhsterhd, no matter how many times I eat you I will keep misspelling your misspelled name. This is the one truck I consistently look for now on vendor lists for the billion food truck gatherings that now occur in the Bay. Because I'm always hunting for sweets and this wins big in the dessert truck world. And the Creme Brulee Shop is now three steps from where I work.\n\nThe first time I had them was actually at Suika, and it's nice that they have places where you can always find them. There I had the thai iced tea, and this was the first week Suika was open, so the guy was generous and threw in some boba for me. The ice cream (that's basically what it is) was amazing. The texture and the flavor blew me away. I was hoping for similarly strong and unique flavors from the truck, but at least when I went at Oakland First Fridays, all they were offering was coffee, chocolate and vanilla. Slightly disappointed, until I ate them. My friend and I ordered the \"Napa style\", ie vanilla with sea salt and caramel, and a Four Barrel coffee with oreo and burnt caramel toppings per the guy's recommendation. I loved them both. Don't knock Napa style til you've tried it! My friends still felt it was a little unusual and too strong on the olive oil, but I thoroughly enjoyed, and finished, it...The coffee with the toppings was awesome, highly recommended combination.\n\nThe small size was plenty big, but the price is still a bit high, especially when you consider that toppings are 50cents each. And note that most of the pictures are of combinations people put together themselves. Even if it's a set, recommended combination, you still pay the full premium for the toppings.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "The Blue Bottle Coffee flavor was pretty darn tasty for all you coffee lovers out there! Although, I must say, I didn't get the \"custard\" part  - all I saw and tasted was ice cream? Don't question it, just enjoy it.", "author": "Mansi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-24", "description": "I really think these guys got it down.  The \"Kuhsterd\" is super smooth and the temp was just perfect.  just cold enough to enjoy yet not freezing where you have to worry about a brain freeze. I had their product when they first opened and it was good and different but it seems like these guys finally mastered it. Great product, great flavors (they have tons to choose from) and most importantly great people running the business.  Hopefully they can open up a store so I do not have to keep chasing down their truck! Keep it up! \n\nThe coffee \"Kuhsterd\" is a must try! You can still smell the freshness of the coffee beans!", "author": "Robin n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-27", "description": "Eh.  Definitely not better than ice cream but they have an interesting idea.  I was surprised at the taste of the custard and couldn't decide if I actually liked it or not.  I was a little blue that I didn't find Mr. Blue to be as amazing as everyone said it would be.  \n\nThey were at the SF Mad Dash and their flavors were very limited.  For my first cheat treat after running the 5K, I got vanilla bean with caramel and cinnamon toast crunch.  My FAVORITE cereal!  All 3 flavors blended nicely but there was something weird about the custard.  I can't quite put my finger on it but it threw me off a bit and I didn't want to waste any more calories eating it.  I wasn't wasting much because their portions are so tiny.  And for the price!  Talk about highway robbery.  $7 for about 1/2 a scoop of custard, I squirt of caramel and 1 tablespoon cinnamon toast crunch.  The portions were prefect actually but not for the price.  Either lower the price with the same portions of give more portions for the same price.\n\nI give them 3 stars for now because I only had one flavor and would really like to try their other flavors, like the mint flavor.  The idea of the custard ice cream is really new to me so I think it's going to take some getting used too.  I'm willing to give Mr. Blue another chance if he doesn't make me blue again.", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "I finally got to try this a few weeks ago at G Food Lounge and it did not disappoint! I had the Thai tea flavor with condensed milk; it was kind of amazing. It's really rich and creamy so be prepared, especially if you've just had a huge meal. \n\nYou can sample any flavor, so if you're not sure what you want, just ask to try something. \n\nI'll be back!", "author": "Nadia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-11", "description": "FROZEN CUSTARD IN SAN FRANCISCO!!!\nWOOOOOHOOOOOOO\ni hope they make it big!!\ni have no idea how california claims to have happy cows yet barely anyone here knows what frozen custard is!", "author": "beth m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-05", "description": "My sister made me.\n\nAnd I liked it...! Service was nice, these guys are pretty nice dudes. I was suppose to check in for the free topping deal but they said I didn't need to, but I did! \n\nI deserved 2 toppings but I was pretty sure I was pushing it. Cool dudes. Cool, cool, cool.", "author": "Karry D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-30", "description": "Got the Vanilla with burned caramel at the Treasure Island Flea Market today. Sooooooooo good.", "author": "Kajal G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-01", "description": "After standing about forty minutes in line it was somewhat worth it. I had a bacon waffle with a scoop of vanilla custard and burnt caramel sauce. The custard is as expected - good. Tasty stuff with good consistency. If it's a hot day it will melt quickly. The caramel sauce is done very well and adds to the tastiness. The flavor of the bacon waffle turned out better than I expected. It's pretty salty but if you eat everything together it's somewhat magical.\n\nMy biggest gripe would be the freshness of the waffle. The waffle was REALLY stale. It's a leige waffle so I wasn't expecting anything airy, but I couldn't even cut it with the given spoon. I ended up having to eat it with my hand. If something isn't fresh they should just take it off the menu. I would have rather just gone with two scoops of custard than the waffle option. Oh and my last gripe would be the portion size. It's rather small for $3 you get less than a 1/4 full of a plastic cup.\n\nThe organization within the truck was ridiculous. The workers were looking at tickets super confused and disorganized like they have never done it before. Simplify the menu and organize your food line. There's no reason why it should have gone that slow for custard that's already made and needs only one or two toppings.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-05", "description": "Who knew kuhsterd could be so good!!! no seriously...the pumpkin cheesecake rendition I had at the Yelp Elite event was absolutely scrrummppptious!!! It was so legit it tasted like I was eating pumpkin cheesecake ice cream! It wasn't too heavy and the graham cracker bits added just the right about of texture. \n\nTheir logo is absolutely adorable too!! Good job guys!! :)", "author": "Kristen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-06", "description": "The first time I tried this truck I was not impressed at all, but it must have just been an off night because since then I have been back MANY times and have had nothing but delicious custard! The s'mores sundae is my absolute favorite, the gram cracked cereal is totally perfect on it! \nAnd the cookie butter flavor... I can't even describe it's deliciousness. Definitely a truck to visit!", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-12", "description": "friendly service, though i cant really tell it apart from ice cream, interesting consistency, creamy, sweet (but not everyone will like the sweetness).", "author": "Long C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-03", "description": "Mmmmmm.\n\nFirst, I'm an east coast girl who loves custard.  And it's damn hard to find out here.  And when you do find it, it blows.  So I'm so happy to finally find some good custard around.\n\nI had the pleasure of trying Frozen Khusterd out last night at a Yelp Elite event and just like Jane A, I too became a Facebook and Twitter follower/stalker.  And we're not the only ones.  So clearly its not us, it's them, and in the best sense.\n\nI tried their Spiked Cereal Mix with Jameson.  Alcohol can be a tricky ingredient to work with, but I tried it anyways and they mastered it perfectly in this recipe.  It wasn't over powering and didn't mess up the consistency.  It was light, creamy and had a hint of a kick to it.  Sold!  I wish I could have taken a pint home, I already know of a few people who would love this stuff.  I hope to see them around again and more frequently, even if summer is ending.  Because custard is perfect all year round, no matter how cold it gets.", "author": "Jen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-10", "description": "Dee-lish!\n\nIf you're an ice cream lover, than you will absolutely adore Frozen Kuhsterd! The flavors are unique and on point. My favorite by far is the cinnamon toast crunch, mainly because that's my all time favorite cereal! :)  It's insanely yummy! I can't wait to try all their other flavors!", "author": "meems k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "Always happy to see Frozen Kuhsterd the most amazing and creative flavor\nIt is delicious I can't wait totry it again!", "author": "Wendy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Love this truck and their fun flavors! My favorites are the cereal milk and thai tea custards. I usually order them in a boba sundae or with some silvanas. Staff is so friendly and don't mind if you request several samples to try new flavors :)", "author": "Krizia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "this is hand's down the best frozen custard that I've ever had in the history of the world. and the only flavor that I have consistently ordered was vanilla.\n\nmy husband and I first tried the frozen custard at off the grid across from the ferry building and we've been fans ever since.\n\nfrozen kuhsterd people, if you so happen to see this, do you sell this deliciousness in gallon form? I will bring my own container, pretty please.", "author": "Le E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-17", "description": "More KUHSTERD please!!! I had probably at least four scoops at the Yelp Holiday Hangover last Friday. It was by far my most favorite thing there. The Buena Vista (Irish Coffee) flavor was super delish, nothing like a shot of Bailey's (groossss) but it had a rich Blue Bottle coffee and Jameson flavor that was so perfect and way better than the drinks they were serving at the bar. \nThe Cinnamon Toast Crunch was superb as well, the kuhsterd was so creamy and smooth with the bits of cinnamon toast crunchies on top! Such an inspired combination of flavors and textures.\nNow I just need to know where I can devour all of the kuhsterd for all the days there aren't Yelp parties in my life.", "author": "Mary Ella D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-02", "description": "I tried their booth at the \"Jet, Set, Fete\" Yelp Elite event on Sunday and must say that I am now a fan of frozen custard! I am usually a sorbet/frozen yogurt kind of person but after trying the store's crowd favorite, Cereal Milk, I'm going to add custard to the list too!\n\nHonestly, custard doesn't taste all too different from regular ice cream, except it's less thick and rich. All the sweetness and flavor without the extra calories I guess!\n\nI met Jason at the event and he was super nice, letting us try all the flavors and telling us how he got started and what the flavors were all about. \n\nNot to be too redundant, but my absolute favorite of the night was Cereal Milk. It's topped with an unknown brand of corn flakes...but I was really hoping they'd put some condensed milk on there too! However, that was only reserved for the avocado flavor :(.\n\nAnyway, Frozen Kuhsterd's custard is a nice change of pace from the regular desserts that I'm used to consuming. Check them out if you want to try something different - you won't regret it!", "author": "Chival N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-03", "description": "Spiked cereal milk.......if you haven't had it, you better find these guys and get some!!!!\n\nI ran into Frozen Kuhsterd at last night's Yelp Elite 'Back to Cool' event.  Hmm...I've heard of ice cream, frozen yogurt but never Frozen Khusterd and if Khusterd really means custard in plain English spelling then I'll be dammed.....cuz I love custard.  And if I wasn't lactose intolerant I would've came back for seconds and thirds and fourths LOL.  \n\nThe taste was definitely there and it was overpowering or to creamy.....it was just right =) The other flavor they had was cookies n' cream and that was actually real good too but I fell in love with the Spiked cereal milk.  Jameson in khusterd.....man you guys are geniuses!!!  No I'm not an alcoholic but if you gave me about 2-3 cups a day of this I think I'd pass to say that I am one.  Hmmm....I wonder what alcoholic Kuhsterd they'll think of next.  Make sure to hit me and Joraine G. up....cuz we'll be your taste testers LOL.  \n\nOh and my last note, you guys need to pair up with Dash Cafe and their caramel waffle pretzel looking things....they went together quite well!", "author": "Mary-Anne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "I love me some Frozen Khusterdddd. Mmm. This is defs a dessert food truck must try! Always left satisfied :P", "author": "Krystal O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-26", "description": "These guys have something really special going for them and that is texture. Totally creamy with just that nice film of succulent fat that you might expect from a delicate truffle or something. I'm krazy about their flavors like four barrel and cereal milk and i cannot wait to see what other krazy concoctions these guys will produce.  \n\nMy only :( is that they are in SF and not in the bay but hopefully someday peeps in the yay can also experience this delectable treat!", "author": "Seb M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-15", "description": "Jason and his team are great!  They came into our office to serve ice cream during our ice cream social and did a fantastic job!  They brought in Cereal Milk (it really taste like it!) and Blue Bottle Coffee flavored ice cream.  Both flavors were delicious!  thanks guys!", "author": "YUMM E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "oh my MY yummy!!!  I follow this truck everywhere!  I love the four barrel coffee with burnt caramel!  Jason and his crew are awesome and so friendly.  I am so happy they are busy!  Best dessert truck!  Thank you for coming to the Bay!", "author": "K B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-17", "description": "Frozen Kuhsterd - somewhere between gelato and ice cream, but with a lot more egg. The texture . Very smooth and creamy! I know it's on the East Coast, so it's about time that frozen custard made its way over here.\n\nI recently tried the Four Barrel and Mexican Chocolate. Both flavors were delicious and when it came to the Mexican Chocolate, it delivered a nice punch to the back of your throat. Loved their interpretation of Mexican Hot Chocolate.\n\nYou can find them at the Underground Market and through their Twitter account. \n\nI wonder if they are looking for taste testers! :P", "author": "Tinna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "Frozen khusterd is my go to dessert after taking my lady and daughter out to eat. I gotta have the Yuzu Saki. Its just the right amount of Saki!\nMy girl who has me drive to dessert places all over the city loves the Salted Caramel w/ coffee swirl. My daughter loves the Cereal Milk. Find out what your missing out on!", "author": "andrew m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-16", "description": "Desserts? I have another stomach for em! My old review just didn't do it justice. It's been over two years and the heart and soul of FK remains the same. With their ever-growing number of flavors, you're bound to fall in love with one, if not all. I'm a creature of habit, so my go-to would have to be the Spiked Cereal Milk. Booze is clearly the answer to everything. They've since expanded to custard in donuts, boba w/ custard, and even don bugito custard... I may have to draw the line there, but for those adventurous eaters -- do it. I mean, who am I to judge.. I would love if they had a durian flavored custard, but I think that's just wishful thinking.\n\nI had one of those days where I thought I'd get a small and it would suffice. Wrong. It was a hot day at the Maker Faire in San Mateo. I knew FK was vending nearby, so I made my rounds and ended up at their tent. After finishing the first one, I wandered around a little bit more, but there was no denying I'd go back. I think it was Four Barrel that day.. Satisfaction was equal to and/or greater than Shame. \n\nThese guys love what they're doing, and want to create the best. Also that custard logo.. cutest custard guy.. nom nom nom.. oops.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "Love their flavors, especially the four barrel coffee with condensed milk. Seasonal flavors, like the pumpkin chocolate are excellent, highly recommend", "author": "Dy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-23", "description": "Frozen Kuhsterd's logo is adorable which isn't important info to know, but good job for standing out (and I bet it has no problem catching the ladies' attention)! \n\nMy friend and I bought a pint of the Four Barrel flavored custard at the Underground Food Market. I figured we were the first of the night to do so because all three guys surprisingly said \"woah\" when I ordered it lol. Anyway, I loved how delicious and strong the Four Barrel tasted. I can't see how anyone could NOT like it. \n\nWe opened up sharing the pint with two other friends. Between the four of us, we couldn't finish it! Custard uses more eggs to make than ice cream! And you really don't need to buy an entire pint like we did to get satisfaction.", "author": "Bets Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "Had my first taste of Frozen Kuhsterd at their booth during Eat Real in Oakland. The cookie butter custard - SO good. It was rich and creamy (like a custard), and was surprisingly not heavy. A fulfilling, unique dessert.", "author": "Krystine D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-06", "description": "I had a sampling of their Mexican Chocolate and Four Barrel Coffee yesterday at a Loopt event, and I must say, it was absolutely superb! I'm from the midwest and have not had frozen custard in over 6 years, and this really took me back. This is the REAL THING people, go out and try it if you get the chance. \n\nIf you've never had frozen custard, it's incredibly creamy and delicious. The texture was perfect, and the flavors were divine! The Mexican Chocolate had a bit of a kick at the end, but it was not overpowering. The Four Barrel Coffee was amazeballs, I'm craving for some right now...\n\nHurry up and open a storefront! :-)", "author": "Dexter C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-05", "description": "Hi my name is Gwen but my friends call me Sweetie, because of my predilection to diabetes-inducing foods. Therefore, you know an item is too sweet if even I think so. I had high hopes for FK given the 4.5 stars and multiple reviews. After one failed attempt at trying this food truck at SOMA, I was finally able to make a date for this place when it was at Off the Grid: Serramonte. I started the trek by creating room in my tummy. This began with the idea to run two laps around Lake Merced and ended with one lap around LM. I braved the cold and wind standing in line to order the match sundae, which included green tea syrup, red beans, whipped cream, and your choice of custard. I chose the Thai iced tea flavor. Maybe it was the custard flavor that made the sundae too sweet but halfway through it, I had a fleeting thought that I should save the rest because of the sugar level. That rarely happens. \n\nShould I ever be nearby FK coincidentally, I'd give it another shot but I wouldn't seek it out by following the website for the truck's location.", "author": "Gwen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-19", "description": "These guys are awesome. I grew up on frozen custard and own a custard shop myself, so I know custard. This is the real dea l-- proper continuous flow machine and all. They're flavors are innovative and creative. Love the Napa one--so fun and tasty. Keep up the great work FK!", "author": "Zoe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-16", "description": "Love the fresh, innovative and tasty frozen treats by these guys. \n\nThe Spiked Cereal Milk is a creamier, more palatable version of  Humphry's Secret Breakfast. Me likes!\n\nThe guys that are behind this venture are super friendly and super fun too! Hey, do you expect any less from a company with such a cool logo?\n\nKeep it up Frozen Kuhsterd.", "author": "Jackie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-11", "description": "So. Friggin'. Good. \n\nI consider myself an ice cream connoisseur, and am pretty critical when it comes to good ice cream. Some people compare frozen custard to ice cream, but I would compare it more to gelato. What is frozen custard you ask?\n\nIt's this creamy, rich frozen treat that is made with more egg yolks and less air than ice cream. And Frozen Kuhsterd takes it to a whole new level. This, my friends, is beyond just any old \"ice cream.\" The texture is so amazingly smooth and creamy, and the flavors I've had are just delicious. They make only about 2 flavors at a time in small batches, so you can taste the real care and thought put into making this. I love how they always have one original-type of flavor, and then a new, creative one, like spicy mexican chocolate, or blue bottle coffee. OMG, I'm salivating just writing this....You know when something is real good when you are left thinking about it days after and crave it some more.\n\nToo bad they don't have a store open yet, I think I need to go get me some more right now!", "author": "Emy s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "\"what the hell is frozen custard?\" was my first thought. I knew it was dessert so I had to get some on this blazin hot SF day. I opted to go simple with a scoop of vanilla bean. One of the guys suggested a burnt caramel topping and I was immediately sold. Delicious and the right balance of creamy goodness. I can't wait to try the other flavors!", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "Am I just supposed to just go back to regular ice cream after this? Ben N Jerry's can suck it as far as I'm concerned.", "author": "Megan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "This was a food truck, the first ever frozen custard i have ever tasted. And it was quite good! If you're in a creamy mood i really recommend this place to you! I had the cinammon toast crunch flavor and it was nice and thick, sweet but not too overwhelming and the cinnamon was light as well. The pricing is not bad at all and you get a cute sticker! The service is really fast and friendly too! Definitely a place worth going too!", "author": "Lena T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-02", "description": "OMG Amazing!  I grew up eating my mom's home made custard, but she didn't freeze it.  So, this is my first time to try it frozen, and oh yeah, I'm a huge fan!!  The graham cracker topping and bottoming (???) really drives it home.  The guys are super nice too and encouraged me to come back for seconds...  which I did.", "author": "Chloe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "So I promised the guy running the truck that if I enjoyed his pick of custard bread pudding I would write a review... and was he RIGHT! I can taste it now... my tummy feels like itll explode because ive eaten so much but it would not matter... give me seconds... NOW!", "author": "Joe D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "\"It's not ice cream, it's frozen KUHsterd\" is what they told me, and well I think it's great! Finally had a chance to try them at the Haigh Ashbury Fair and I want to go back, but sadly they aren't always around when I need them. I had the coffee flavor with a light drizzle of condense milk and ohhh that was heaven. Not much to say beside go try it if you haven't. Prepare for the guilty pleasure.", "author": "Khanh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "nailed it.\n\noh gosh, i've had my eye on this wandering food truck for ages, so when i saw the cute lil kuhsterd cup on the truck at Pink Saturday tonight, i felt like i had struck gold. and i might have...at least in the sense that i felt richer when i left than when i came, because frozen kuhsterd more than satisfied every tastebud and coated every inch of my tummy in deliciousness without tapping too deep into my pockets like so many SF ice cream shops are apt to do.\n\nokay, down to business. i was torn between the red velvet cake batter and the four barrel ice cream, so the super sweet gal in the truck let me have tastes of both! mmmmmmm creamy, hefty, and popping with flavor! both of them. this would be a tough decision, but i ended up with a kid sized coffee ice cream with crushed almonds on top. the serving was generous and for only $3 i got more ice cream for half the price of other wicked-outrageously priced ice cream trucks around SF.\n\nmy stomach is usually bottomless, but i was so satisfied after just that scoop + nuts on top that i didn't want much of anything else all night. SO SATISFIED. so happy. join me in this bliss and track their truck down. decadent. delicious. delightful. definite do.\n\nalso, holy smokes some of their sundaes and ice cream sandwiches looked like the most amazing type of amazing in the history of amazing things. i will bring a friend with me next time and we shall ingest massive quantities of kuhsterd awesomeness.\n\nuntil then. until then.", "author": "Theresa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-22", "description": "This was insanely delicious. I literally devoured the entire cup of Thai Tea custard in less than a minute.  \n\nThe Thai tea flavor could maybe be a bit stronger, but the texture and the thickness of the custard was seriously ridiculous good.  I'm salivating just thinking about it.\n\nI've had a lot of ice cream in my day, I prefer thick ice creams/ gelatos, and I would describe this as a really thick ice cream. Droool. \n\nThe only thing I would change is that I wish the scoops were bigger.", "author": "Leslie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-20", "description": "Frozen Kuhsterd is soooooo delicious. Whenever I see the truck pop up somewhere, I gotta go there. Thai tea and regular vanilla are the only ones I've tried, but are so creamy, just perfect sweetness, and delicious. They have unique toppings and flavors! Give it a try sometime :)", "author": "Natalie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-18", "description": "Best in class for custard! They are always surprising me with new flavors. You must try the Boba Guys sundae.", "author": "B C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "i love frozen custard!  i wanted to try this place for awhile but the timing never worked out.  so it was a total treat (...) to spot them at soma street food on valentines day!  i chose honey graham cereal milk with burnt caramel...yum!  plus the people working there were SO nice and didn't make me feel like a loser for checking in on yelp to claim my free topping.\n\ncan't wait to go back and try thai tea!", "author": "Christy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-22", "description": "Today we tried the Smores with Vanilla ice cream. Overall it was just ok. Paying $7 for the dessert was steep for what you get. The vanilla custard was just average. Maybe I ordered the wrong thing however it was highly recommended by the girl who took the order.", "author": "Jerome H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "You can tell that their ice cream has quality.  Tried the cupcake sundae with vanilla bean and red velvet cupcake and it was so good! The texture of the ice cream almost reminded me of gelato!", "author": "Dee S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "I've had them a few times with all different flavors and they're pretty good. Some might be more on the sweet side depending on the flavor through, but when you pick the right one for you, it's good.", "author": "Annie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-11", "description": "Having lived in SF for almost 20 years, I am thrilled to see the new interest in frozen custard.  I am a native of St. Louis where frozen custard is legendary, not a novelty at all.\n\nFor it to even exist on the West Coast or SF is somewhat of a miracle.  I love Frozen Kuhsterd for that.  I do have a criticism, however.  The focus on quality needs to improve.  I noticed that there were ice crystals in my 4 barrel coffee 2 scoop.    Frozen custard should not have ice crystals.  Perhaps the focus should be on the quality of the mouth feel, not on coming up with new flavors.  At the legendary Ted Drewes in St. Louis, the smoothness quality is the focus.  The huge variety of topping options is what is supposed to jazz up frozen custard.\n\nAccording to Ted Drewes' website, \"By definition, frozen custard must have at least 10% butterfat and 1.4% eggyolk.  The amount of air, also known as overrun, truly separates frozen custard from traditional ice cream.  Frozen custard has 20% overrun or less.  This reduction of air is what give frozen custard its silky smooth texture.\"  http://www.teddrewes.com/sitecontent/dynamiccontent.aspx?pid=76&uid=D18D6B6C-7948-4C04-8F59-12F77F9F3F49 \n\nPerhaps the key to quality is having it freshly made, rather than flash frozen or stored at sub-zero temperatures.  Could producing it on site inside the truck be possible, rather than transporting it from a production facility, which I understand Frozen Kuhsterd does?  \n\nCustard is made by sending it from a refrigerated hopper through a valve into a freezing chamber lined with beaters. The frozen custard is pushed through (extruded) out the front of the special machine and into a waiting bucket, ready to be served. Because it is not held in the chamber, there is very little air, known as overrun, beaten into the custard. This low overrun creates the dense and creamy texture.\n\nBy comparison, soft-serve custards, yogurts, and ice creams are made using what is known as a batch freezer, where the mixture remains in the machine and the overrun is as much as 100%, causing ice crystals to form. Frozen custard should not have ice crystals.  (See also http://www.thedairygodmother.com/what-is-frozen-custard/).", "author": "A. N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-05", "description": "Frozen Kuhsterd....the newest and best thing out there! Their flavors are unique and quite tasty. The collaborations they do with other businesses is pretty genius. I had their Maple Bacon Donut(Dynamo) sandwich with Thai Tea Kuhsterd which I think was one of the best tasting desserts I've had in a LONG time! The staff was quite friendly. Owners Jason and Alex.....you guys are awesome!!!! Keep up the great work! Can't wait to try more of your delicious creations!!!", "author": "Manvil B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-03", "description": "The 5 stars goes to the original silvana + coffee custard sandwich!  Brownie points to the nice guy that told me about the secret menu not advertised.  $4 for one, $7 for two.  Compared to the Creme Brulee Cart and other dessert carts that cost a little more for smaller portions, this is actually a good price!  Looking forward to trying more flavors!", "author": "Mary Ann M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "I've tried various concoctions at events FK has been at, and have never been disappointed.  The white coffee flavor is currently my favorite, but I need to make it to SOMA Street food park so I can try the special boba drinks and sundaes that I keep seeing pictures of.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-28", "description": "Had a coupon for a free custard, so my husband and I tried it out yesterday after lunch... SO good!! My husband was thrilled that this lil frozen custard shop was actually a food truck, so he was sold after sighting it a block away. I had the vanilla bean custard with strawberry sauce (actual sauce with whole strawberries) and condensed milk. The custard itself is super creamy and you can tell they use a lot of egg yolk from the richness of the flavor, much like creme brûlée. The strawberry sauce tasted homemade and I just flat out love condensed milk. My husband has the cinnamon custard which tasted exactly like cinnamon toast crunch cereal. He had caramel over his. Very good!", "author": "Kae H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "ok nicest guys ever. They were at the north beach farmer's market this weekend which was awesome. The guy that took the orders was mad nice and recommended some stuff. i tried the four barrel coffee and thai ice tea. Both were DELICIOUS but I got the thai iced tea with condensed milk which was also delicious. it is exactly what it should taste like in ice cream form. I wish they have the boba special though. I'll ahve to try that next time.", "author": "Tao Tao W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-13", "description": "This is the first time I have given five stars on Yelp.  But, Yelp says that five stars is \"As good as it gets,\" and that is true of FK's frozen custard.  I love soft serve ice cream and I am often disappointed with the texture.  The frozen custard at FK has the perfect soft serve texture.  We tried potato chip custard with caramel sauce.  It was awsome and made me wonder why I ever waited in a line anywhere else.", "author": "Amber B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-14", "description": "Hands down my favorite dessert food truck.  My favorite is the Four Barrel Coffee- with or without the burnt caramel sauce. If you're a fan of Haagen-Daaz coffee ice cream, you'll probably like the Four Barrel Coffee custard. The Thai Tea is also really good.    Service is always super friendly and pleasant.", "author": "Lois B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "FINALLY got to try this super delicious treat at the 20th Street Fair. So happy I did. I had the spicy chocolate mini donut with the Four Barrel Coffee Custard and a drizzle of caramel sauce. SWOOOOOON......hope a brick and mortar shop is in your future or you have some mission establishments serving this seriously delicious delight on a regular basis soon. My physique might not need it but my mouth does.", "author": "holly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-06", "description": "Even if the custard wasn't delicious, I would still give them 5 stars!  These are just the nicest guys ever.  They make a point to greet customers and thank them for their business.  I always get a little TLC too since I have allergies. \n\nThe custard though is delicious and they  have interesting and yummy combinations.  Who knew you could make avocado ice cream?!", "author": "Jessine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-07", "description": "I grew up in Milwaukee, the mother of all frozen custards and this comes pretty close to the real deal.  Had a vanilla on New Year's day and really enjoyed the taste.  You guys need to open a shop.", "author": "Philip K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "The custard, while limited in flavor selection, is thick and creamy to near perfection. Toppings are a bit repetitive (four kinds of cereal, but no fruit or the like), and the pastries are occasionally a bit too dry. But the custard itself is worth walking miles for.", "author": "Gavin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "My husband and I stopped by and had a sweet treat from Frozen Kuhsterd last night at the SOMA Street Food park. These guys are incredibly nice, friendly, and super helpful. They patiently explained some of their different treats and offered to let us try several different flavors. I've never had frozen custard before, and was pleasantly surprised by how yummy it tasted! We shared the donut/ice cream sandwich made from the Dynamo Donut guinness pear molasses donut with vanilla custard and the burnt caramel topping. Fabulous!", "author": "Lilia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Good ice cream and bunch of different varieties.", "author": "Jack J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-20", "description": "Vanilla with chocolate sauce, sprinkled with peanuts.  YUM!!!  You'd never think it was frozen custard.  It's like an extremely smooth ice cream, but richer.  Just try it.", "author": "Denise M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "Delicious custard. I had the coffee custard with oreos in it. MMMM will definitely stop every time I see that truck!", "author": "Sam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-25", "description": "First, the guys who run this are creative, personable and professional. Second, they have taken the time to take what could be a very straightforward dessert and twist it to make it simply elegant. From the interactions, to the menu explanations to thge desserts themselves I look forward to when I see them again.", "author": "C K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-18", "description": "My schedule almost never overlaps with the FK truck but 5 stars just for the boba sundae", "author": "Kimberly N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-18", "description": "I like this truck. It adds an extra little dash of amazing to the already yummy \"normal\" custard. Their flavors are delish, my favorite was the spiked cereal.", "author": "Roxanne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-17", "description": "I'm so glad they come down to the South Bay. It is the smoothest, creamiest ice cream. We've tried four barrel, cereal milk and kettle corn. All were fantastic. Their burnt caramel is a must try. The boba sundae with Thai tea is different but so so good. They also carry yummy cupcakes and donuts. What's not to love?", "author": "C G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "The Frozen Kuhsterd is the most magical thing I have ever had the pleasure of tasting. My taste buds were having the time of their lives when I ordered the red velvet cupcake with vanilla kuhsterd topped with burnt caramel. \n\nMUST. HAVE. MORE.", "author": "Niki J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-16", "description": "my GF has been raving about how good REAL custard is and how I need to try it.  So she comes with me for a bay visit and we find this truck by accident, of course we have to try it.  And I am amazed at how I didn't know about real custard before! Their spiked cereal was AMAZING!!! I cannot stress it enough! GO GET SOME NOW!", "author": "Josey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-17", "description": "Holy mother of pearl. Honey Graham Cracker frozen smooth creamy deliciousness!!!! That's all you have to know! I had the pleasure of tasting this delectable dessert for the gods at the Yelp event: Beerwalk Empire. So glad I had the chance to or I don't know when I would ever be able to find this gem. Now to hunt them down like a stalker and try more flavors.", "author": "My C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-14", "description": "Finally made it out to try this truck.\n\nDID NOT DISSAPOINT!\n\nI got the Vanilla & Coffee with condensed milk topping.  \n\nWhat you waiting for?\nGO GET ONE!", "author": "Andy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-22", "description": "Sensational treat. Got the cookies n cream with burnt caramel and sprinkles it was heavenly. Fel got chocolate with nutter butter. Wish I got more than 1 scoop! When oh when will you be back to oakland?", "author": "Natasha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "I can't believe I still haven't given props to these guys, they are super nice and their frozen custard is the 1st I've ever tried and it's so BOMB! And don't forget to get the syrup topping!", "author": "Karen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-24", "description": "Not too unlike ice cream, just a lot more dense and richer. We tried the cinnamon toast crunch and the vanilla with burnt caramel. Good stuff.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "I was able to check out zee Frozen Kuhsterd the Yelp Elite Back to Cool opening party at Rickshaw Bags.  Me being me, I leapt at the chance to try the Jameson Irish Wiskey and Corn Flake flavor, which was quite nice, cool and light and fluffy, sweet but not too, and subtle.  I look forward to the chance to check out more of the yumminess, and I think you should too!", "author": "Bad Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-21", "description": "I first tried Frozen Kuhsterd at a Yelp event at Rickshaw Bags last month. I was able to sample the spiked cereal and the cookies and creme. Super delicious. Both frozen custards were creamy and flavorful. Where can I pick up a pint to take home with me? Lol! I'm lookinf forward to seeing Frozen Kuhsterd at another event and to try other flavors. Two thumbs up!", "author": "Frances V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-13", "description": "This Kuhsterd is far better than ice cream and the flavors are perfectly crafted. I need to give this product a high score and two big thumbs up! Seriously I am not a fan of sweets but this isn't a typical dessert and it isn't anything you'll regret trying.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-01", "description": "I didn't realize what I was missing till I tried their custard!\n\nI had their Pumpkin Cheesecake today and I enjoyed every last bite @ the Yelp event: Haute for the Holidays at Bare by Tru. Bottom layer of graham crumble, frozen custard, and graham crumble sprinkled over the top. Not too sweet, just the way I like it.\n\nThe other frozen custards I've had before melted sort of quickly and were closer to soft serve, which I learned is not true frozen custard! The guys are super nice and knowledgeable.\n\nFK custard looks like a plain old scoop of ice cream, but it doesn't melt as fast =D Don't you hate it when have to rush to finish your treat before it turns into a overly sweet puddle of mess!\n\nNo problem here :)", "author": "Angel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "Oh, my, goodness. Looks like this is an up and coming food truck? Had this at the Yelperstitious Holiday Party and it was oh so GOOD. Had the Cinnamon Toast Crunch Cereal Milk version which was a dense, creamy, and delicious combination of flavors! It was topped with little bits of Cinnamon Toast Crunch cereal, which added a whole other dimension of tastiness to this dessert. Missed out on their Buena Vista flavor, but I'd definitely go through the effort of trying to find them again. Now the only trouble is actually trying to find this food truck... :( Hope they have a larger presence in the Bay Area soon!", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-12", "description": "The honey gram cracker is amazing! It  has a very honey flavor and swirled honey crystals and gram crumbs. Delicious.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-23", "description": "full disclosure, i know these guys. \n\nthat doesnt take away from the integrity of this review. actually, like ive said many times before. i am much much more critcial of my friends. thats probably why i dont have too many.\n\nso even though i know these guys very well,for one reason or another, i didnt sample their product for a very long time. maybe it was the fact im not much of a sweet tooth person. maybe im way too grey goosed out most of the time...\n\nabout a year after they had their first test runs, i had the pleasure of trying some.\n\ndude. texture. texture. texture. im sure all sorts of flavors will come and go with these guys, but to me, the most significant thing about their the product was the texture....\n\nand the taste? and the flavor? well, the first thing i thought after the first spoonful was, WOW i wish my s/o was here. she REALLY NEEDS TO TRY THIS! this is some freaking good stuff.", "author": "Euge L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-03", "description": "My brother traded a few of my mini quiches (two bites) for three scoops of Cereal Milk and three scoops of Four Barrel Coffee. Both were creamy, delicous and I felt like there was a party in my mouth. Awesome.", "author": "Mariebeth A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-23", "description": "Bought a pint of their cinnamon toast crunch cereal milk at the Asian Heritage Street Celebration.  Tastes exactly like cinnamon toast crunch goodness!", "author": "ML N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-04", "description": "Frozen Kuhsterd....AMAZING!\nThe team came out to a do a catering event I attended recently.  I tried Frozen Kuhsterd for the first time...and i'm in loooove!  \nTried the Vanilla, Burnt Caramel and Thai Tea (!!!) flavors and all are so amazing.  I love the consistency (so creamy and smooth), flavor, freshness - topped it off with ground almonds and you are all set!\n\nSo yummy!!!", "author": "C L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-28", "description": "It's good but honestly nothing special. Portions are ridiculously small for the price and they were honestly kind of rude. I was ignored for the longest time while waiting in line while they were chit chatting. I don't like to complain but you can at least acknowledge your customers and tell them you'll be with them in a bit. It's super expensive and overpriced and portions are stupid small. It's good but not worth the price", "author": "Jewlz L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "It was good... but it tasted like soft serve. It didn't wow me. I'm not sure what to hype is. They must have really good branding!", "author": "Anne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "I ran into Frozen Kuhsterd by sheer luck!  But my next visit will be strategically planned!  I live in the South Bay so I'm already watching where I can go to get my next fix.  Born and raised in New York City, I'm pretty fussy about custard.  I tried the frozen kuhsterd donut bread pudding or something like that.  It was amazing!  I'll be back!", "author": "Merryl K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "delish custard/ice cream at streeat eats :) wish they had more flavors but all that was left was the cinnamon toast crunch which was very tasty", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "never again - $3.50 for a small scoop of vanilla custard that did not taste any better than a cheap supermarket ice cream plus there were ICE crystals in it.", "author": "Nadia Geddi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "hello, before off the grid came to Serramonte daly city, the nearest food truck market was at san mateo caltrain, one of my favorite ice creams was the thai tea frozen custard with peanuts and I still really want the recipe from the owners, the owner said he would email me sometime when he has time, so but it was the best thai tea ice cream I ever had! these things are a trend for a foodie", "author": "Ava R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-02", "description": "just tried their thai tea flavor today and it was unspeakably divine. i would give a billion stars if i could. i had condensed milk as a topping and as far as desserts go, this combination cannot be beat. the guys at the truck were incredible again and offered me an extra topping for free :) FROZEN KUHSTERD, I WILL LOVE YOU 'TIL THE END OF TIME (as lana del rey sings)...", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "tried the black sesame and avocado........all I can say is, yummy yummy for my tummy =) LIKE", "author": "Christine E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-11", "description": "frozen what?  jason's kuhsterd is on point!  kuhsterd is so smooth, not too sweet.  the density is perfect!!  who doesn't like cereal milk?!!  it's awesome by itself or it's great with cobbler.  you will want more than 2 scoop, trust me!  if you haven't tried their stuff, \"friend\" them on facebook and find out their whereabouts and also what new flavors they have in store for you!", "author": "Simone F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-20", "description": "INCREDIBLE. PERFECT. DELICIOUS. PERSONAL. I hired these guys for my wedding rehearsal dinner. They showed up on time, set up a gorgeous dessert station, served incredible delicious desserts. Commissioned insane cookies. (We got red velvet and bourbon choc chip cookies and fresh white mint and cinnamon toast crunch cereal milk custard!)--The ice-cream sandwiches were an incredible hit among my guests. I recommend these guys whole-heartedly. I was so happy to support a small local business--trust me, these guys won't disappoint!", "author": "Lauren Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "I've been a loyal fan of Frozen Kuhsterd for a while now. And I cannot remember the specific event, but the one sundae that popped my FK cherry was the boba sundae and that's with Thai tea custard, condensed milk, and obviously boba. I'm very picky with desserts, but it was love at first bite. To be honest, it's a bad idea for me to have custard in the first place since I'm lactose intolerant. BUT I cannot and won't stop. It's so worth it even while I'm racing and hoping I make it to the bathroom afterwards. Anyways I've had the pleasure of trying all the other flavors by now and I absolutely love the basil strawberry custard and the Thai Tea is a close second. Try it if they have it. It's super refreshing and not too sweet! & if that doesn't tickle your fancy, just ask the employees of FK. They know best when it comes down to what will satisfy your needs. I'd definitely say that FK has earned its way to my heart through my stomach. I love this truck so much that I always try to make it a point to visit when it's around", "author": "Kaleena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-08", "description": "I have never had frozen custard until i tried the cereal milk at the Metreon, instantly, i was a fan. I've tried a few of their other flavors and my favorites are salted caramel with coffee swirl, cereal milk and the cinnamon toast crunch. If you like bi-rite and Humphrey slocommbe, Frozen Kuhsterd is defiitnely comparable, if not better :) I read the other reviews and cant wait to try the four barrel coffee flavor. If you havent tried frozen khusterd yet, you are definitely missing out.", "author": "Carla P."}
