{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Great Sushi Bar \n\nAmazingly fresh sushi. The fattest rolls I have ever been served. The Chirashi had a nice selection of sashimi. The service was great. Would eat here again in a second.", "author": "John W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-29", "description": "Where does this restaurant state it's automatic 18% gratuity? Right on your bill when you get it! HA! I purchased apple juice (for a child), 2 regular rolls (2.5stars) and an appetizer (3stars). My bill was $53! Food was okay, but definitely no where near worth the price.", "author": "Vee D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-24", "description": "Can we start with how there was no soap in the ladies room and they said they had ordered some but it hadn't arrived yet. Concerning. It made me wonder if our food was going to be okay to eat. Am I going to have food poisoning later? I hope not. The spicy tuna was oddly textured and the waitress had a hard time filling my water to the top. Every time was only half way and I had to flag her down. We both got bento boxes and I mean I guess you get what you paid for. Rolls were loose. Nothing amazing. I'd recommend trying somewhere else before coming here.", "author": "Susie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "Strolled into quiet Cannery Shopping Center. Noticed a lot of vacant shops.  The red bricks are beautiful, the signature of the Cannery and its history, but it creates an atmosphere of confinement.\n\nLooking for a light snack and a cool place to hang at 2:30pm.  Ordered their appetizer specials from the board, hamachi and albacore sashimi alacarte.  Good fish, nicely seasoned with oil and homemade ponzu sauce.  Romantic way to chill out on a Spring afternoon at the wharf.", "author": "Connie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "I had the spicy tuna roll, an order of the salmon sashimi and an order of the tuna sashimi. Food was delicious. It is quite touristy since it's along the main drag toward the Golden Gate Bridge. Great for date night.", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Quick service, good sushi. Kind employees. It's also super close to the water (2 minute walk), so I recommend a nice take-out picnic in the park across the street.", "author": "Jules F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "Amazing food and great service! The miso soup was a nice and tasty start to a great Bento Box lunch special.\n\nOur waitress was very kind and even chased us down after we left a bag of souvenirs at our table, saving the day!\n\nDefinitely a good stop if you're looking for a tasty, quick and inexpensive lunch!", "author": "Matt D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-01", "description": "If you want to come here and have themselves tip themselves as up to 18 percent because they want to. Come here. If not, I would avoid here. Grab a quick sushi bite, somewhere else.", "author": "Mimi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "The bento box at lunch is pricy ($19+) but then again, what isn't on the wharf? I like the teriyaki steak - probably the best I've ever had. The sushi is good - not exceptional but not bad by any means. \n\nI wish they had a discount for employees in the area like their competitors do. That would make me go to them more often.", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "Called ahead since I was not sure if they would be open X mas eve. They said there were so I ran on down. The rolls I had were delicious. Heads up if you order a soda it comes in a can and it's  $3.00. We ordered 4 rolls and it came to around $60 so pretty average unless you fond a place that does all you can eat.", "author": "Jonathan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-03", "description": "Japanese food is our favorite kind of food to eat. Unfortunately this place was one of the worst I have ever tried. The food is way overpriced for the quality and quantity. Their rolls were so skinny that they wouldn't even stay together. I had to rerun my Donburi bowl of fat and the waitress tried to tell me she would take 50% off when I only took one bite. I won't be back and I advise people to eat at one of the many restaurants around the area. I still gave her a 18% tip because she was friendly and I felt bad it was completely empty there.", "author": "Ashlee u."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "Excellent quality chirashi. Amiable and attentive service. I indulged in the Swamp Roll in addition and could eat it everyday.\nNot for the budget conscious... it's sushi in San Francisco after all.", "author": "Timothy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-11", "description": "Good spot for a quick sushi craving thats right in the between ghiradelli square and pier 39. Basic sushi place with couple signature rolls. Small portion sizes but decent.", "author": "Varsenig K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Lunch stop.  Beef Udon for me and bentos for the wife and kids.  Bento was good as well as Udon.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-22", "description": "Charged me $2 for a hot water and lemon! Their food is overpriced and service was unfriendly. They wouldn't serve us unless we ordered more... We ordered oyster shooters and they refused our order. We thought it was strange because if they have one item on the menu, and we want that one item, couldn't we order it? They were rude and not interested in our business.", "author": "Kim H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "The two rolls that we got. Firecracker and Philadelphia were good. You can taste the freshness in the fish. There was not a lot of flavor but overall tasty. My daughters friend got the Bento Box and that was almost more tasty than the sushi. Very expensive, one of the most expensive sushi places I've been to and I love trying new sushi spots.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-21", "description": "This was one of our favorite Sushi restaurants in the Fisherman's war area. This restaurant recently changed ownership. It's not the same quality food anymore and the service is not the same either.", "author": "Mirjam D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "Miso soup was good. Sushi was excellent. I recommend migo, shrek, and spicy tuna. Great place if you're looking for sushi", "author": "Echols J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-08", "description": "The food was good, but the waitress was extremely annoying, she wanted to decide for us what to order, when and how to eat our food. She also requested a mandatory tip! The food is a bit over priced. I don't recommend this place.", "author": "Berenise F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Great food, great service and great atmosphere. We found the prices quite reasonable as well. My favorite was the San Francisco roll. But all six rolls my group shared were phenomenal. Chef Shawn Lee is awesome as well. We will be back next trip.", "author": "Apollo G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-24", "description": "Good food but we wont return \nWhy? Cant afford it after tax, tips\nWe will eat at areas where we can afford\nIf we are the owner of this location we would reevaluate make affordable 2 all", "author": "Chef C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Service was fantastic! Very attentive, but not pushy...sushi was served quickly, and was fresh and flavorful!", "author": "Laura W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "DO NOT COME HERE !!Worst place I have EVER been to! My friends and I eat sushi pretty regularly so we know what we like. We came here for my friends birthday.. we did not like our food. It was old, dry and disgusting. We also found a piece of plastic in our teriyaki sauce. We told the manager we didnt like the food so we weren't going to pay for something we didn't eat. Owner called the cops on us, I could not believe it! We sat there just in shock. Worst experience of my life! DO NOT COME HERE !!", "author": "Victoria M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "We came to SF to celebrate my friends birthday because we love sushi. We order what we always order when we go to sushi places, because it's what we like and are familiar with. We ordered teriyaki sauce for the side and my friend found a piece of PLASTIC in her teriyaki sauce, told the waitress and continued to wait for our food. Long story short we all agreed that we didn't like our rolls and that we didn't want to pay for something we didn't eat and the manager lectured us, yelled at us and told us that it was our fault we didn't like it when we are very familiar with the rolls we got. It literally looked like the the rolls were sitting in the fridge because all of our avocados were black. The waitress was really nice but the food was terrible and the manager was really unprofessional. Don't waste your time here.", "author": "Lucy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-21", "description": "This place was in a tourist attraction area.  There were heavy traffic during the day time, but in the evenings was when it was nice.\n\nMy daughter and I happened to be here.  We ordered sashimi and 2 rolls.  They were well prepared.  The rolls were nice presented along with a tight roll in order for them to not fall apart.  On top of that, I smelt the fish.  There was no order.  Fresh fish has no order.  \n\nI enjoyed the service.  Very nice from immediately being greeted to the my check, they were friendly and attentive.\n\nRating\nFood:  4\nService:  4\nPrice:  3\nAmbience:  4\nOverall:  4\n\nI thoroughly enjoyed this place.  After a meal, it was easy to get into the tourist mode.  Although I am from the bay area, there are times I pretend to be one of them.", "author": "James S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Absolutely delicious sushi! Pages of special rolls with pictures made it easy to choose and the quality exceeded our expectations. Definitely recommend!", "author": "Shelby L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-15", "description": "Came back fora re re try for quality and as expected, i was not let down!!! They suck here!!  $15 for sushi and I am already hungry for a burger and fries. The portions are stupidly small here.  It's only for tourists who don't know any better.", "author": "R G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-13", "description": "Sushi is one of my favorite foods to eat while traveling.  I visited the Flying Ninja with a colleague while in town on business--incredibly disappointing experience.  We ordered a few rolls of sushi to start--I got the Spider Roll.  It was the most tasteless, boring sushi I've ever had.  The rolls were small and overpriced for what they were.  I would have preferred grocery store sushi over this.  The place was nearly empty and the staff barely spoke to us even though we sat at the sushi bar.  It was not a great taste of San Francisco.", "author": "Molly P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-01", "description": "We were trying to get to another sushi bar that my son had searched only to find out they did not open to 5pm.  We continued walking and came down by the wharf and stopped in.  We are outside in this beautiful day.  Service was pleasant and prompt.  Dragon, spicy tuna, spicy salmon and shrimp tempora rolls.  Dragon roll was great!", "author": "Todd L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "They had quite the long list of specialty rolls I've not seen elsewhere. Went out of the comfort zone and tried one with mango and strawberry. Albeit good, I would probably try something a bit more traditional next time. Regardless, still a good deal and would go back.", "author": "Austin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-27", "description": "Bad customer service and even more terrible food! The Hawaiian Poki is horrible DO NOT TRY!\nHardly ANY tuna and WAY too much sauce.", "author": "Gianina G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-24", "description": "Came here w/ my brother during my visit to San Francisco. It was a 5 minute walk from our hotel, and I was craving sushi. Choosing this restaurant was a huge MISTAKE. \n\nCustomer service: HORRIBLE. Walked in and they didn't even greet us. Took forever to ask what we wanted to drink. Took forever to come back and ask for our order. Never refilled our water. Never took our empty plates. They automatically add a 18% tip even though they didn't deserve it. \n\nFood quality: Good but nothing special. For this price, you could probably get much better at different sushi restaurants. \n\nPrice: Same as other sushi places around town, but I think you could probably get better quality at other places. They also try adding a 18% automatically to your bill. Please let your customers decide what tip to give you. They definitely DID NOT deserve 18%. \n\nOverall: Would definitely never come back to this place. Would recommend trying out other sushi places.", "author": "Lenzi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-02", "description": "Nice little stop when walking around the wharfs ... ok sushi (there is better in SF) ... we sat at the sushi bar and ate as fast as we could ... bugs flying every where (no nothing on food or in food case area that we saw) but they where flying every where. Server seemed to want to get us out of there as fast as she could (mind you no one else at bar and only two other tables) ... grabbed our plates before asking if done ... brought check and walked away before seeing if we wanted anything else and where 1/2 done with our beer.", "author": "Misty L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Excellent sushi, staff was very friendly and the ramen was ok nothing special. However the sushi was top notch! Price is around normal for a nicer sushi place, aka not cheap, but not outrageous", "author": "Michael B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-13", "description": "If I could give this a 0 Star, I would. I go to sushi restaurants religiously, and this place is disgusting for the price. Please, spare your time and money and avoid this place.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Yummy! Met all my expectations and more. The food was great. I came here with my family and we all differ in what we like to eat. But this place fed us all and everyone enjoyed there food. \n\nRecommend the udon noodle soup :)", "author": "Lizzy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "First time eating here and it was SO GOOD I had to yelp. We ordered Ramen, a California roll, fishermans wharf, and the firecracker roll. ALL we're to die for! Hannah was our waitress and it's the first time in the past couple of days we've actually had great customer service. I'd recommend this place to anybody else who enjoys a good unique sushi roll back home. 5 out of 5!", "author": "Jesse R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "Come here to get your fish fix. The sushi here is a fresh alternative to the boiled, buttered and fried options down the road. I love sitting on the patio outdoors and they were okay with my dog sitting under the table. I've sat at the sushi bar (without the dog) too but outside is nicer even if Fido is not with you. They offer Sapporo on tap. You can order the more creative rolls if that is your thing, but the nigiri here is a bit of loveliness: an expertly sliced piece of fish delicately draped over a small pillow of rice ball. It practically melts in your mouth.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Chef Adam was the best :D !!! \nLoved all the plates. I had nigiris + hamachi kama (with some sashimi from it also) + oyster shooters and more :) My favorite was the sake nigiri with yuzu sauce on the top. It was perfectly seasoned with the balance of sweetness with sake. Loved the service. They were all nice and friendly. \nI willl def command CHEF ADAM !!!!", "author": "Yumi K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-22", "description": "Good enough for tourists who don't know any better but terrible quality for SF locals. Way way overpriced with the quality of food court food, plus 18% tip added REGARDLESS of how much you spend (even $21 for one bowl of ramen). BTW don't get the ramen. \n\nIf you want better Japanese food, go to Grandeho's Kamekyo or Miyabi Sushi nearby. They're way worth it!\n\nIt's sad that this place has such a high rating because of all the endless tourists who don't know any better.", "author": "Aqu T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-01", "description": "This review is for Sunday, August 30th. \n\nAn early dinner, around 5, for my friend and I as we were walking along from the Maritime Museum. Of course the whole area is full of tourists and the weather was just so perfect on this particular day, it would have been a shame to not be outside! We stopped on our walk at Flying Ninja, seeing as the place was empty, and sat outside.\n\nI should have known better, but ordered the tempura ramen. My friend ordered the California crunch roll. His roll was pretty tasty and good in portion size. My ramen was good in terms of portion as well, but was rather bland. It was a chicken based broth with what looked more like spaghetti noodles. It tasted more like chicken noodle soup, minus the chicken, as opposed to ramen. The tempura veggies and one shrimp were served on the side. I say I should have known better because I have previously worked in a ramen shop, and you don't go to a sushi restaurant expecting tasty ramen; you expect tasty sushi or rolls. It was also a little odd that the waitress brought out a little caddie or sorts that held the soy sauce/chopsticks/napkins, then asked if she could \"borrow it\" to give to another table. Does the establishment only have one set of soy sauce and napkins? \n\nNot particularly keen on this place and don't really feel a desire to come back. I'll definitely go for a bread bowl with clam chowder instead!", "author": "Malika H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "Only in town for less than 24 hours went on Alcatraz tour... And we were looking for sushi with a view?!  We asked a pedicab driver and he took us to  a little hidden gem we would've never found on our own !! \n\nThe sushi was fresh and  fantastic the restaurant was clean and friendly.  No view of the water but the food was what we were really after !!  We sat at the sushi bar so service was timely even though it was during the week and wasn't real busy anyway. \n\nA great find ! \n\nwould return  on the next visit for sure!", "author": "Dani B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-18", "description": "I was visiting the area for the first time and got hungry, so my friend and I decided to stop by Flying Ninja Sushi mainly because they offered patio seating and it was a beautiful day. After settling down and glancing at the menu, I knew we should have relocated but alas, we were tired and hungry so we settled. I'm still kind of mad at myself though because there are so many more food options along the pier!\n\nSo as I opened the menu, I was initially happy that they clearly show pictures and describe what you're getting. This was quickly changed as I flipped the pages and realized that 90% of their items are cooked, and 100% drenched in sauce. It was very disappointing because the way I see it, if the quality of the fish was good, then you do not need to cook it or have it swimming spicy mayo or eel sauce. Not to mention, pricing wise, it was definitely more expensive simply because it's at a tourist spot.\n\nAll in all, I would not come by again.", "author": "Joey R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Absolutely perfect!  Great atmosphere, with quick seating.  Everything was fresh and tasted as expected.  My wife and I highly recommend this for sushi if you are staying near the bay.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-26", "description": "I came to this location twice while staying in the Bay Area. Flying Ninja Sushi is conveniently located about two blocks from Fisherman's Wharf. Close enough to the touristy area, but far enough away where you're not overwhelmed by the high traffic area. \n\nBoth times I came in it was for lunch. I was greeted right away by a friendly server and was told to pick my own seat. The server remembered me the second time I came in too, even though it was over a week later. Both times I ordered Rainbow Sushi and a Philadelphia Roll. Both were so good and fresh. One time I did order a beer as well. \n\nPrices are a little on the high side. For just two rolls, it was about $25 before tip, with beer it was about $30. Considering the location, I understand the prices though. \n\nI'd come back here next time I'm in the Bay Area and am craving a sushi fix!\n\nCheers!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-13", "description": "Sushi was just okay and service was a little slow, which was surprising because when we came there was only a few other people dining. When looking at the menu, there are photos of every specialty roll. We ordered two, but when they arrived they didn't look as robust or expertly put together as the photos, so that was a little disappointing. My kids enjoyed the gyoza and plain ramen.", "author": "Shauna P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "I had the Seattle and Lion King. Both were very good. Be careful though,  some things that come with(in) other rolls aren't mentioned on the menu.\n\nThe price is consistent with the area, a little high, but understandably so.\n\nI'll be back.", "author": "grep w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-25", "description": "The service was pretty good, but the sushi was sub par. The atmosphere was average, but the prices were pretty good for the location.", "author": "Jay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "We stumbled on to this place with hubby while looking for food/ snack for me cause my breakfast wasn't pleasant so I ended up sending it back earlier... We were walking by the restaurant, name of the place caught our eyes (it's a inside joke with us) and I looked through the menu (I loved the fact they had pictures that showed their special rolls and explained what was inside and on the outside..) and Godzilla caught my eye.. The interior was modern clean and beautiful.. The staff there are super friendly and greet you with a smile.. \n\nRight away we get seated and  they get us something to drink right away.. So we went in to try the Godzilla appetizer, not only did it look appealing to the eyes but it melted in my mouth, like heaven's orchestra playing a beautiful song.. OMG!! The food was amazing, I just wanted more.. \n\nLol a few hours later the very same day after the uncorked festival at Ghirardelli Square, we decided to come back with another couple because I has such a amazing time here earlier and my husband friend's wife loved sushi so it was a win win situation..  We all get seated and we ended up ordering Godzilla of course!! I was non stop talking about it it earlier so I had to show them.. We ordered: Golden Gate roll, Amigo roll, Lion King, O'farrel roll and chicken teriyaki for hubs friend.. Everything tasted like heaven in my mouth!! I must say properly the best sushi I've ever had in North Cal.. Now I know why the golden gate roll is there best seller, it's a spicy tuna roll with cucumbers and more tuna, crunchies, unago sauce on top.. Lion king roll is good for someone who doesn't eat raw fish at all, it's cooked crab meat & salmon with avocado and baked in house sauce.. O'farrel roll was a light tempera deep fried roll with yellow tail & salmon green onion, tabiko & chili sauce.. Amigo roll i can't remember the fish used but I do remember it was wrapped with rice paper instead of seaweed, and it had tabiko, spicy mayo & unagi sauce on top.. Everything was just so amazing here.. The price tag for all this food was well worth the money, simply because of presentation, taste and freshness of everything..  \n\nthe waitress were really attentive with refills and asking us if we needed anything.. All 4 of us left really satisfied.. Hubs told the chef he really did a amazing job with all the food, gave him a huge tip an told him we will be back here when we come back to San Fran..", "author": "Diana B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-02", "description": "Nestled in a super touristy area I can see why their prices are so high....because they can be.\n\nI spent like 40 bucks on simple rolls. It was good, but it was not like OMG OMG OMG BEST SUSHI OF MY LIFE.\n\nThey do have a menu with pictures which I did find nice, because sometimes you really have no idea what you will get.\n\nI ordered plain rolls, but my friends all got specialty rolls. The total bill for 4 of us was like $130.\n\nThe tables in the dining room are very close so you'll feel like you're kind of on top of the people at the table next to you. \n\nSo it was FINE....not like bad or terrible or anything but also not like OMG WOW.", "author": "Meg H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-23", "description": "We opted to come here for convenience sake, since we were at Pier 39. \n\nThis is your basic inauthentic \"Japanese\" sushi place that you may opt for if you're really just looking for somewhere to park your bum and grub. \n\nThe tap water tasted especially bad, so you're pretty much forced to order something from the drink menu. The tuna in our rolls were unnaturally red (almost like there was some sort of food coloring in it), so I don't even want to guess what quality of fish they were using. That said, I wouldn't recommend ordering any sashimi here; I'd probably stick to the rolls that are  deep fried or doused in spicy mayo and tempura sauce.\n\nAlso, the price point is tourist-targeted and SF-inflated. $9 for a spicy tuna or spicy salmon roll? These usually run for $5-6 even at the authentic sushi spots. \n\nService was good, but because there were few patrons in the restaurant.", "author": "Diana K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-01", "description": "This place is ok they charge you for everything even spicy mayo! They're rolls look nothing like their pictures, they're tiny! Greedy with their sea food.", "author": "Sita C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "Excellent sushi. Very fast and in such a great location. So much to do around there and then stop in for some delicious food.", "author": "Pete W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "Tourist visiting from San Diego and we stopped in for dinner.\n\nFOOD:\nWe ordered 5 different rolls and they all were prepared very well.  The rolls were nice and tight so they didn't fall apart on you.  The presentation of the food was fine and it did taste really good.\n\nSERVICE:\nWhen we arrived the place wasn't busy at all so we were seated fast.  The staff was very friendly and attentive.\n\nNegatives:\nThe only bad thing I can say about the place is their prices.  A regular roll was $10 and a special roll was $13-15.  Maybe we are spoiled from San Diego, but we can get special rolls for $10.  Other than that, this was a good place to visit.", "author": "Doug H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "Order Bento Box for lunch with a much better performance-cost ratio. The food is pretty good for me and my family.", "author": "凱翔"}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "I don't want to hurt the business but man... Awful restaurant where they treat their workers like shit and using fish that is no good for customers to eat. Yuck. If I can give less than 1 star I would. Horrible service as well as their thin thin sashimi to get more profit. I would never come back here to eat.", "author": "Kaylee K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-18", "description": "How many ways can I say don't go here? We stopped in here for more food after finishing a small meal at a place just a couple doors down (half the group were tourists hoping to try many local foods). Already having eaten, and seeing that the prices were EXTREMELY high, we decided to just order some oyster shooters (after finding out uni was not in season which was not their fault at all). The place was pretty quiet for dinner rush hour (mostly empty) Service was quite rude to us when we asked for 3 oyster shooters (one person also ordered a hand roll, another a water) and had to go check if they had any in stock, after reminding us we need to order at least a portion per person. They came back to reprimand us for not ordering enough food (no rules anywhere saying we had a minimum) and told us we couldn't only order alcohol and the kitchen refused to make our order. Now it's important to note that these were listed under the FOOD appetizers and so we assumed they counted as food. If they were good, we probably would have ordered more. To make it even worse, the staff gathered at the till to loudly complain about us in Korean. Unfortunately for them we had somebody in our group who was fluent as well and translated it all for us. We asked for the bill and they changed $2 for a glass of WATER. That's just spiteful. Do not recommend this place at all. They only had a couple other customers, most of the place was empty, and the staff were all just standing around. No reason to treat us so poorly. Overpriced, rude, and a waste of time. The hand roll was mediocre at best.", "author": "Alba Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-04", "description": "It was a mistake coming here. Tourist trap!\n\nMy boyfriend and I were walking around the area and were getting hungry, so we settled for the nearest sushi spot. \n\nThis place was totally empty. Should have took that as a sign that this place wasn't that great. Haha \n\nGot the bento box and the boyfriend got two different rolls. The bento box was meh. I got teriyaki salmon and it looked and tasted like it was microwaveable food. The sushi was also not that great. It wasn't all that fresh. You think it would be since it's by the wharf, but no. For subpar sushi the prices were really high. The 3 item bento box was like 22 bucks and the sushi rolls were like 12 bucks and higher. I guess they can get away with charging prices that high since it is a tourist area though. \n\nIf you're looking for good food it's best not to settle in tourist areas. Lesson learned.", "author": "Christine E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-10", "description": "Low quality food and service needs work. 18% GRATUITY IS AUTOMATICALLY ADDED to your check on the taxed amount even for our party of 3. Beware of the different lunch and dinner menus -- dinner prices are significantly more expensive and may not be worth it. I paid $10 for a bowl of plain ramen (NO toppings) -- literally just broth and noodles. They cannot split checks (even for 3 people) and were very hesitant to break change for a $20 even though we could see the cash in the register -- we had to walk down the street to another place to get change. I'm not normally so critical of food places but the service really bothered me.", "author": "Allie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-31", "description": "Rolls were far too big. I had a spicy salmon roll. It came drenched in spicy mayo sauce. It did not help that the salmon was tasteless. It may be a good sushi place for the location, but you can probably get a better lunch for less else where in the city.", "author": "Mithra V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-07", "description": "The ramen broth tasted like dishwater and the sushi roll was sticky and plain. But worst of all, the service! The waiter had an arrogant attitude and rolled her eyes when asked questions about the menu. But why would she be serviceminded when 18% tip is being added to the the bill.", "author": "Mikkel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-01", "description": "Mediocre rolls and below average service. Came here on a friday night and the place was empty (and cold). This place is tailored to tourists. There are much better options if you're local and can afford spending more time doing some research on where to go.", "author": "Roberto F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "Located in a tourist hotspot, this restaurant's prices match up well with the place. Inside, the restaurant is nice, and the service was quick.\n\nI got the Ramen combo with the tempura ramen and spicy tuna roll. \n\nThe Spicy Tuna Roll looks a little too red. It's not bad but not amazing. A little expensive for what you get but not too expensive.\n\nThe Tempura Ramen has the tempura on the side. A little less vegetable than I expected. The tempura was good and the soup and noodles were also good, although a little plain. Portion size was appropriate. Overall a good choice, though a little hefty.\n\nOverall the combo was filling and the food was good, and although it was hefty, it wasn't a bad place. There was a moment when our waitress didn't know what Togarashi was (it was on the shelf) but that was cleared up quickly.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-23", "description": "Fish: I order Chirashi. It's assortment of raw fish including tuna, salmon, shrimp, white fish, and toko (Japanese octopus)  The fish is not very fresh. Similar to the sushi you get from the grocery at best. Toko smell very fishy, not the usual seafood smell, but the smell when it's out for more than couple days. My friend's mouth will have little bubble when the fish is not fresh. As soon as he tried some pieces, his mouth starts to bubble. Plus, we ask for non-caffeine tea because my friend has sore throat.  The waitress accidentally gave us a low-caffeine tea and told us that was non-caffeine tea. It's definitely a bad night for my friend. The $1.5 added-on tempura was not to bad. It came with one tiny straight shrimp tempura, golden sweet potato, and onion ring. The dipping sauce didn't have graded radish. When I asked, the waitress said they do not serve the dipping sauce with radish. Maybe I just used to authentic Japanese restaurant. \n\nThe only reason I was eating here because my friend was sick with fever and  need a bowl of hot soup. After eating the sushi, I felt a bit sick because the fish was not fresh. I didn't try any of the special rolls, so I am not sure how are they.\n\nBottom Line: Don't eat here unless someone put a gun on you, so you must to. Go somewhere else if you have the opportunity.", "author": "Candy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-30", "description": "It was ok. Overpriced because it's in a touristy area. Standard sushi rolls. Strange layout with the room in the back. No view. Better to sit at the counter or looking out the window on a stool. For the udon soups, make sure to get stuff in it, b/c the broth literally just comes with noodles and broth (for $10 :-/ ).", "author": "Jessica G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-18", "description": "I came here after a wine tasting at the Sf winery.  The prices are definitely high, but their market special sushi selections were very, very fresh.  We ended up ordering the uni (sea urchin) twice because we thought it tasted so good.  The rest of the food was not quite on par, which was kind of strange.\n\nWe ordered a pork ramen.  It was quite standard, and the portions were generous.  We were pleased with it.  We also shared a spicy scallop roll, a philadelphia roll, white tuna nigiri, all which were only mediocre.  The sushi chef was interactive and fun, and their service was excellent.  The location is awesome as well.", "author": "David C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-27", "description": "Pretty good sushi at a good price. I ordered a (big) rainbow roll, miso soup, and a coke and it came to $20. Not the best sushi I've ever had, but definitely fresh, and took care of my craving. Good location.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-12", "description": "This is one of two sushi restaurants that is near the Fisherman's Wharf area. We were in a sushi mood, and we came ti Flying Ninja Sushi to take care of it. \n\nOrdered a couple of rolls and a bento box. Had the mango roll, but I didn't think it was good. Maybe the mango wasn't fresh, but it just didn't have anything going for it. The salmon roll was tasty, as was the soy paper roll. Good flavor. Tried the chicken teriyaki. Average at best. But since one in our party doesn't do sushi that was one of her limited choices. The salmon sashimi was excellent. Fresh and buttery, it was delicious. \n\nService was good, although she did forget to bring us water and part of our order at times. She was quick to bring whatever we needed when we asked though. Flying Ninja is okay, just an average sushi restaurant near a highly trafficked tourist area. If I was outside Fisherman's Wharf I would definetley try a different place.", "author": "Humberto G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-15", "description": "I wanted to like Flying Ninja so much. Their mascot is a ninja!!! But their sushi was lacking especially for the price. I went in just wanting to grab one roll while I waited for a table for dinner. And it said \"sushi on the go\" so I thought they would have rolls pre-made. Even though they didn't have sushi pre-made, I still ordered the Apocalypse ($17). I must have been really hungry because I feel like the employee tricked me into getting the most expensive roll on the menu. Even worse was that the roll was so average and even border on terrible. The fish was not fresh and the roll was tiny. \n\nWhat I recommend:\n\nGo somewhere else for sushi. If you are hell-bent on eating here.... DO NOT get the Apocalypse.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "This review should have been written in April...never had time....so here we are!\n\nAfter my conference in the State Capitol, I ventured out to San Francisco to meet The Dude for quality time weekend. Countless transfers from train, to bus, then to a cab, I could hear my stomach raging within me. I asked The Dude where he was taking me and he surprised me here, at The Flying Ninja. It was walking distance from our hotel, which was pleasant. My friend came along and we had a good experience. Unlike KRU in Sacramento, this sushi parlor could have more items or surprise items on their menu. I'm just spoiled with all the very traditional sushi bars in Los Angeles. \n\nI felt like they tried with their \"boat\", but the sushi seemed dried (if the edges of the albacore is darkened) so I didn't touch it. The Dude probably knew what was going through my mind...so he ordered more SAKE! I think I'm giving this restaurant 4 stars because of the cute hostess and the sake, which we received for free. And free us always a good thing.....unless you woke up the next day and find that you're not even close to your hotel! Wtf?!!", "author": "Cici M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-22", "description": "Very bad service attitude and force charging 18% tips. When I ask them, they said they do that to everyone. Sushi bar opened by Korean, rolls are very lose and unoriginal compare to other road side sushi bars.", "author": "Yi R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-12", "description": "Sushi quality was lower than expected. Ordered a chef's special # 2 roll and it came out with a tiny bit of 2 colored salmon, a piece of shrimp tempura, rice and spicy mayo.  Pathetic if this is what the chef puts together as special.   Nothing special about this place what so ever.  Go somewhere else this USA huge waste of money.", "author": "Stacey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "My boyfriend & I loved this place!  Hanna really made it easy too order due to it being our first time there. She has to be the most friendliest person I've ever met at a sushi restaurant lol. We will definitely be back again!", "author": "Mari V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-18", "description": "Very reasonable and fresh sushi at around the right price. The service is okay, don't expect a fancy environment or very authentic feelings but the food will be good.", "author": "Stefano Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-22", "description": "Showed up at 8:30 pm to sit at the bar for some sushi. As soon as I walked in the guy behind the bar told me they were closed. I walked out, looked at the sign on the window, and it said they were open until 9:00 pm.\n\nI'll take my business elsewhere from now on.", "author": "Danny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "This place is average. Average sushi and average service. It was clean and nicely decorated.", "author": "Savvy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "For the rest of our second afternoon, Joe and I wandered around past Fisherman's Wharf, and we stumbled on Flying Ninja. I was actually looking for something quick to eat, a light snack to round off the chowder we ate earlier for lunch.\n\nThere were a few tables seated, a majority looking like tourists also wandering around the area. The interior was quite modern, with large glass windows facing the main sushi bar, letting in great natural light. We were seated closer to the back of the restaurant, a small room that I assume could be made into a private room for such functions. This section was completely opposite, with barely any light coming in, and a TV screen on the far wall. Totally different atmosphere!\n\nThe menu is extensive ranging from small appetizers, hot entrees, sashimi, nigiri, rolls, and even udon and ramen bowls. Having our fair share of ramen already, we opted for something light. We originally wanted to order an assorted nigiri dish but our server advised us against it. When asked why, she shyly commented that the sushi chef was a new hire and not as experienced with nigiri yet, but more familiar with the other dishes, particularly the rolls. Their rolls did look fairly unique but I mainly wanted different bites of food, rather than order one roll between the two of us.\n\nSo we decided to start with the ahi tuna poke. The tuna was nicely seasoned, although could have used a longer time in the marinade. Served on a bed of mixed greens, I though of it more as a salad. It wasn't until I ate some of the greens when I realized a lot of the sauce or marinade was underneath! The fish was fresh though, nice and slightly firm. For the price, it was actually a substantial dish, especially when we both thought it was a small plate when ordering from the menu.\n\nOur sushi combo came with miso soup and a salad. Seeing that we only ordered one sushi plate to share, I was surprised when she gave us each our own sides. Bonus! The miso soup tasted different from all others that I've tried before although I have no idea why. It seemed more flavorful, and definitely more salty than usual. A good start! I absolutely love Japanese style salads and their dressings. I finished my bowl in no time and moved to Joe's bowl seeing that he only ate the cucumber slices and wasn't too keen on eating the rest. Too many vegetables?\n\nSushi combo B was an assortment of salmon, tuna, white and yellow fish for a total of 16 sashimi pieces. Beautifully presented and the pieces were quite large. It also came with a bowl of rice (each!), although that didn't arrive until much after. Not sure what the hold up was, perhaps the fresh rice wasn't ready yet but Joe had no complaints and ate his, while I decided not to waste and told our server to hold on mine.\n\nNormally I would get bored with just eating sashimi for a meal, but the fish was fresh and had a clean finish. Along with bites of my salad, it was the perfect snack for us! Although not the best to get in San Francisco (I'm sure), it was a nice place and fared a lot better than some of the sushi restaurants in Edmonton. With a small capacity, I can imagine this place getting filled up during dinner time. Price is right, location is great, would definitely return if I was in the area and was hankering sushi!", "author": "Cindy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-17", "description": "We stopped here hoping for happy hour, but they didn't have it. Sad Panda. We ordered a couple regular rolls that were tasty. The best we had was the Godzilla appetizer. It had a rush of flavors, fried garlic, tempura asparagus wrapped in ahi tuna sprinkled with ponzu sauce. It's a nice spot for tourists, and we are tourists!", "author": "Melanie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-19", "description": "There's two entries for this place, but I'll just review here since this has a lower star rating (in which maybe my 3 stars can give it a little boost)..\n\nCheap eats in SF are hard to come by, especially in touristy Fisherman's Wharf.  So finding this place on Thrillist was surprising.  I went here with a friend and he wanted a spicy Philidelphia roll which was not on their menu.  They were nice enough to accommodate his request and the roll was only $7 for 8 pieces.  Not bad, right?\n\nIt's a typical sushi place.  But if you're on a tight budget and crave some Americanized Japanese food, then this place would be for you.", "author": "Vira P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "Ate sushi at 11 am and had the freshest cuts of fish ever.  Very friendly staff, ask for their recommendations and they will tell you the best cuts they have for the day.  For us it was the blue fin tuna.", "author": "Nick J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "The sushi was super fresh which is what we liked. We did have to take food to go since it was closing time. But the fact that they were closing and still made great sushi was a phenomenal feat! Definitely would like to come back!", "author": "Nancy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "Fresh sushi and amazing service... I haven't enjoyed sushi as much as I have since I tried this place and I know my sushi... I lived in Japan for 3 years... This has come really close to it... Wish they had Orion beer but it's still yummy food!!! I definitely suggest eating here if you haven't tried it yet", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-01", "description": "Not bad, fresh fish, good flavor and friendly service. Went for lunch before biking over the Golden Gate Bridge and wanted to try sushi in the Bay Area. My friend and I ordered a few rolls and I also had to try a bowl of ramen. I was kind of shocked that we were the only people in the entire place, but the sushi was tasty and I would go back.", "author": "Libby P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "This place truly is amazing. I have always loved sushi. But I had the best sashimi ever here. It really is a hidden gem amongst the millions of clam chowder places that surround it. If you are in the mood for something different I highly recommend you check this place out. Especially if you already know you like sushi. The sushi chef is one of the best I've ever met. It was truly a wonderful surprise.", "author": "Cassandra E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-21", "description": "I'm glad that there's a Japanese restaurant in the Fisherman's Wharf Neighborhood that isn't going to try to rob you blind. Given that I got katsu, sushi, rice, salad, and soup for all under $10, I'd say that they are fairly priced. \n\nThe portions are a little smaller than restaurants in less-kitschy areas, but hey- it's filling. \n\nNot too much else to comment here- good service is usually what you'll get unless you go on a busy Friday when they get drowned with tourists, (no offense to you Yelp Tourists reading this right now) and with several places to eat right around the area, it makes for a good restaurant to order some food to go for the nearby San Francisco Maritime Park!", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "Do you know what California sushi has that DC sushi doesn't?  Fun.  I don't know why restaurants in DC can't get creative with sushi, but they just don't.  So it was great to come here and find fun, creative dishes with different sauces and flavors - they tasted good, too.  We tried three different rolls and some ramen as well.  Everything was great.\n\nIt's a quiet restaurant off the main drag, which we liked.   The football games were on TV and we were able to relax and enjoy our meal in relative peace.  Service was prompt and friendly.  A good choice if you're in the area and don't feel like eating a bread bowl with chowder from every other Fisherman's Wharf restaurant.", "author": "Kristen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Glad I came here. Adam took real good care of us. I sat at the bar with my assistant Haley for over an hour over delicious fresh sashimi and yellowtail. I was worried about the rating on the Yelp. (Well at least Haley was) however I was gonna try it here anyways. Glad I did.  The service was great. Loved it. I found my spot from now on as a regular down here in the bay. Thank you guys.", "author": "Tommy Smalls S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-24", "description": "We tried the California roll, Spider roll and the Philadelphia. All were great, but the Philly was the most unique. Nice staff, it was a quick snack for us.", "author": "Racheal B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "Saw this place while eating at the restaurant across the street. We made a trip all the way out to San Francisco again just to check it out. The rolls were good. I would say this place is pretty comparable to most fusion sushi places Ive been. The wasabi was a little sad and had no kick to it though. I wouldn't be apposed to going back if I was in the neighborhood.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-24", "description": "Easily a Tourist trap and not so much a \"hidden gem\" of a restaurant. It's convenient to get to if you are already out near the piers but not worth the money you'll spend. We ordered sushi combo B $60 and it was not anything special. Food didn't seem so fresh for being mostly sashimi. Also had 3 others with me and ordered a few other rolls. rice was mushy and salmon was chewy and disgusting. I was disappointed because the reviews were awesome and I had my family visiting me and they wanted a good sushi spot to try.. would not be going back.", "author": "K M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-13", "description": "Went there with a party of 8.  Arrived about an hr before it closed so we felt kind of rushed with waitress asking if we wanted anything else we needed to let her know within 15 minutes.  I guess she wanted to get out if there on time. \nAnyway... We ordered several sushi rolls.  Crunchy rolls,tiger roll, crab roll etc... The food was very good and it was fresh.  The restaurant was kind of empty which was a bit confusing because it was good food and a Friday night.  Would visit again.  Maybe a bit earlier.", "author": "Raquel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "Difficult to find vegetarian options, especially this close to such fresh beautiful fish, but alas this is what I'm doing for the time. On that note they have Sapporo and miso soup, which is always a great start to a meal. Add in the wonderful veggie sushi rolls including the veggie rainbow, mango, and avocado, just to name a few, I would definitely come back. The service with our drinks was a little slow, a few time I was in desperate need of water with a mouth full of wasabi, but that's part of the individual flavor so even that was not too big of a deal. All in all a great dinner experience.", "author": "Alyse L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "Decided to get sushi take out on a Monday night. Service was very quick and the food was delicious. Pricing was OK - coming from Chicago, the price was similar; nothing crazy. Staff was great and the sushi chef was very friendly and made my experience very pleasant!", "author": "Jill S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-04", "description": "Was so hungry after biking to Tiburon and back to SF. It was around 3-4PM or something which was not best for having food. This restaurant looked good, so we gave it a try.\n\nWell. I enjoyed the food and had good time. But I don't think it's a great sushi place actually. The fish was not bad but not too great. The rice of nigiri sushi was... too sticky. It's not the right rice for Japanese sushi and more like Korean rice. They are mostly similar but a bit different in.. texture(?). And they didn't bring enough ginger pickle like gari for 12 pcs. It was only enough for like 3 pieces. Wonder if they understand why gari is useful for eating sushi...\n\nWell. It was okay, I didn't have bad experience, Asahi beer was good, but there are definitely better places.", "author": "Jay Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-22", "description": "I don't normally review places but I felt like I had to for this place. I decided to go here since it's pretty close to my work and I really wanted Japanese food so I ordered the chicken donburi that came with miso soup and salad. I first got the soup which was pretty good but then I got the salad and the salad was frozen and tasted very stale. I couldn't believe a restaurant would just give a bowl of icy wilted lettuce to their customers!!! I then got the chicken donburi bowl and it tasted weird like it had been sitting around for a long time the egg was very watery and the chickens texture was a bit chewy. I wouldn't recommend this place to anyone it was also a bit pricy considering that all of their stuff is probably frozen and doesn't taste like it's even made in the kitchen. This honesty has to be the worst Japanese restaurant I've ever been to! I thought I'd review this place to warn anyone thinking of coming here it really does suck!", "author": "Ariana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "The bomb! Soo good! \n\nInsanely fresh, really nice people! \n\nAll in all very nice place! \n\nHighly reccomend it!", "author": "Sean H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "Hidden gem! We would definitely stop by this place again. The sushi was so fresh and flavorful. The customer service and attention was great", "author": "James P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-29", "description": "I wanted to love this restaurant just for the name.  It was not bad sushi but it was not great either to the point where I do not even remember what we ordered and ate. The service was just ok - they seem to just want you in and out fast. Again, nothing really made a huge impression on me.", "author": "Mikhail H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-13", "description": "Good sushi but kinda bummed me out was that us only being only 2 people they put an auto gratuity of 18%.\nI found it rude in a way like they expected us to not leave anything\nI work in restaurants too so i know that an 18% is added on but only for 6 or more people.\nKind of a turn off", "author": "Viancy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-30", "description": "its a boutique sushi spot in a beautiful place at the Cannery building near fishermans wharf. it sits right at the corner of the entrance so you cant miss it.  although we were in the bay area and should have gone with some clam chowder or something, we decided on some sushi instead...mainly because it was still happy hour! =)\n\nwhat we had (with my one word review):\n\nvegetable tempura roll (great!)\nrock and roll (yummy!)\nspicy tuna roll (eh)\ngarlic edamanme (blah)\n\ncompleted my meal with ice cold sapporo and hot sake.", "author": "Sara C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-09", "description": "We got the tempura udon. It was good, very flavorful. It was a big portion, shared it between two people. Also had the salmon delight and it was a good size portion as well. The salmon was good and the sauces on it were very tasty and sweet. \n\nThe service was quick only because we were the only ones there. And the server was really nice. \n Average price. For udon, one roll and a beer came out to be $34", "author": "Genie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "Very Good Sushi!!!  So we walked around San Francisco (it felt we walked around the ENTIRE city). Finally found one that is open on Sunday.  It was worth the walking and the wait!  We were all tired and salty, but then we got here and we are all Happy Happy Happy!!!  Would definitely recommend this place to everyone!!!", "author": "Natasha B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-27", "description": "I'm not gonna lie, my boyfriend and I chose this place because of the name. Guilty.\n\nThey were on the LivingSocial deal--$20 worth of food for $1. Total deal right? We were excited, found parking and entered the restaurant. We were greeted by a LivingSocial employee--not a waiter/waitress-- and he gave us a sticker and checked us in. Hmm, okay we said. Minutes later after standing around, we seated ourselves. There were only two servers, a man and a woman and they seemed like they had their hands full. It took forever to order and even LONGER to get our food. And when I mean LONG, I mean it took ONE HOUR AND FIFTEEN MINUTES LONG. Now, parking at the wharf is not cheap and we must've spent a good $4 before even getting our food. \n\nA man (maybe the manager) finally came out after an hour and gave us edamame beans--something that should've been done after 30 min of waiting. Our food didn't arrive together but I ordered the Chirashi dish and my boyfriend got the lunch bento special with chicken teriyaki, octopus balls and this delicious fried fish cake with tartar sauce. His dish was better than mine since I only received 4 small slices of sashimi with my chirashi. \n\nAfter we received the bill, we noticed we were charged with automatic gratuity which the manager quickly fixed. He also gave us $10 gift certificates as an apology so we would return. I guess we'll visit again on a Sunday (for free parking) and I'll re-review this place again!", "author": "Vikki K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "Funny that this restaurant is not very busy, because the food is artful and very good, the prices reasonable, the green tea good quality (even tho it's a tea bag), the restroom clean, and the service fast & with a smile. Definitely a hidden gem in a very touristy area.", "author": "MJ L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "Five stars for food, two for service. But worth it for delicious and reasonably priced sushi.", "author": "Makenzie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-30", "description": "Tried the 119, Scallop and Tempura rolls and everything was fine. A great location by the wharf which is the biggest plus for me. The sushi is geared for all of the tourists and it's satisfying. No uni on the menu which is a sign that it's not an authentic Japanese restaurant.  The server and sushi chefs are also very friendly.", "author": "Gerry T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-10", "description": "Everything was good but we ordered fried crab legs and they was so Nasty. Do not I repeat do not order the crap legs . Yeee", "author": "Angelica O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "My family and I visited here as we were guests at the Argonaut hotel and sushi is always a good idea. We came for dinner and had made reservations. We asked to sit outside and had our 1.5 and 3 year old with us so I asked for the kids menu. There is no kids menu but you have a bento box option which is $19 for dinner. We also ordered four speciality rolls. The sushi was amazing and even though it's pricey-it's decent sized rolls. My husband and I ate every bite of the sushi and my kids enjoyed the bento box. Other reviews said it's pricey but it's sf, you're on the warf and if sushi was cheap-I'd probably be weary to eat it. I didn't give it five stars because I think they should have some kid friendly options, starting with kid friendly cups. We would eat here again!", "author": "Christina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "Nice service. Fresh fish. Interesting specialty rolls. Hit the spot after an afternoon of bike riding.", "author": "Tena H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "I ordered combination B & it came with four different sushi's. You can't switch one of the sushi's for other options though. Drinks were a little on the expensive side. They had good soup & delicious house dressing.", "author": "MariBel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "This place is totally underrated. I had the bay scallop roll and California roll and have to say it is by far some of the best sushi I have had. The service was extra friendly and speedy. If you are around fisherman's wharf and feel like sushi, it's a must have!", "author": "Adam F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-22", "description": "I thought the rolls were great. The Golden Gate was especially good. Service was spot on. It's a little more expensive than normal but it is in a tourist area.", "author": "James N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-20", "description": "Working next to Ghirardelli Square, cheap eats are hard to come by as this is mainly a tourist area. I can't eat at In & Out everyday so looking for reasonable places is difficult. Flying Ninja is a new Japanese Fast Food restaurant that opened up a few months ago. \n\nTheir pricing is considered reasonable for the area therefore I gave it a try. The average price of $9.00 was not worth it at all because their portions are too SMALL for my appetite. I'm so lucky I had a sausage egg McMuffin with 2 hash browns for breakfast to tie me over. Two of my co-workers went to Cold Stones to order smoothies. I'm sure my other two co-workers and I will have to get a deli sandwich later.\n\nWe ordered the following and everything was served in paper bowls or boxes.\n\n1. Eel Bowl\n- No more than 6 pieces of eel and a 1  1/2 servings of rice. $8.50 for this? I can buy a frozen package of eel at Kukje supermarket for $1.99 when its on sale!!!\n\n2. Chicken Teriyaki Bowl\n-  Where's the teriyaki sauce? Are they trying to conserve? Again 6 pieces of chicken and 1  1/2 servings of rice. $8.00 for this? My coworker had a similar tasting chicken teriyaki bowl in the frozen section in Costco. Thank God for Popeye's $2.00 Tuesday! \n\n3. Kimchi Ramen\n- Where's the Kimchi? I paid $.25 more for the Kimchi ramen for 2 pieces of cabbage??? See picture!  You can buy a big bottle at Kukje supermarket for $4.99! Aside from the portion, the miso soup base was tasty but the noodles were a bit over cooked.\n\n4. California Roll w/ salad \n- Can't complain here. $7.50 for 8 pieces of Cali roll with 4 green leaf lettuce and a teaspoon of potato salad. \n\n5. Chicken Karaage\n- The Karaage was good and recommended. For $4.75 I would suggest a few more pieces chicken, not just 6 small pieces. Even McDonalds sold 20 chicken nuggets for $4.99!\n\n6. Super Roll\n- I ordered the super roll but after looking at the menu now, I think I received the Tiger Roll. Let me explain what happened. My order was called. I went up to pick up my food and I brought it back to my table. I opened up ALL the boxes and it seems as though I received a complimentary order. After inspecting them and organizing the table, the waiter came back, took the order off my table, brought it back to the counter and gave it to another guest. This is a BIG no no in the restaurant business. How much does some rice and 6 small slices of C-D grade sashimi cost? Can't they make another order? If I was the other guest, I would request for another order. \n\nWord of advice to the owner: If you want to attract more local business, may I suggest serving larger portions? This will bring you more local and tourist business and you can gradually reduce the portions if you want later on down the road. Consider it a Chinese marketing technique. \n\nI didn't have a satisfying experience but i was lucky I was accompanied by good people.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "Good California roll for a good price! The service was nice also! Not too over priced about 7$ a roll, not anything surprising and it was good, I would recommend!(:", "author": "Liliana D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-06", "description": "First time here. Got the San Francisco roll and it was good, but nothing spectacular - I've had better. Miso soup was really good. Decently priced. Service was OK.", "author": "Taylor E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "My boyfriend and i really craved sushi tonight after all the fish and chips/clam chowder we had this past weekend! We saw this location after getting off the cable cars! We were a little bit hesitant because there were not many guests but we went in anyway. Boy were we surprised!! \n\ni had the beef teriyaki bento box and he had the bay scallop roll and it was seriously delicious !!! \n\n1) really good service\n2) underrated \n3) delicious and a great variety", "author": "Jamie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-28", "description": "This was one of the worst customer service experience I have ever had! Women waitress were rude and not friendly the water they served was awful and tasted old in addition to the bad service the waitress spoke to me after I paid sounding very upset that I did not tip and told me to tip next time or else. I will never eat there again!!!", "author": "Tifani F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-09", "description": "Congratulaitons, the first one star ever from me :)\n\nI was there this morning and couldnt even finish my sushi plate, the rice was flavorless and the fish was dried and not fresh at all.\n\nIm not THAT picky when it comes to sushi because im a sushi guy BUT if you're looking for a good sushi place, u better go to Kamekyo which just a few blocks away.\n\nI paid $32 for the meal (my sushiplate and my gf's ramen which was left almost like when it first served)\n\nMy suggestions : if you dont know anything about sushi, DONT open a sushi restaurant :( it was even worse than my self cooked sushi.", "author": "SuShiLoveR I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "Great fresh sushi close to fisherman's wharf. Chef is very accommodating. Great fix in the touristy area of San Francisco.", "author": "Bruce B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "Great food, prompt service, way underrated. \n\nI'm very surprised this place was only rated 3.5 half stars. I went in at 4 in the afternoon and it was dead so service was great. Everyone was very attentive.\n\nWe ordered the Donburi Chicken and Chicken Bento Box. Everything was cooked perfectly. The chicken was perfectly cooked, juice and moist. The sides were spot on and just a notch above what you would get at a carousel sushi place.\n\nThe place is somewhat dirty and was kinda warm, humid inside but it is by the Pier and it mostly a glass room.", "author": "Tuan N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-23", "description": "Not bad for a sushi place in Fisherman's Wharf, and great staff, but they take forever to bring your order!\n\nI'd go back there if I was in the neighborhood but nothing to make a special trip for, I mean they're okay sushi, a bit creative but not as edgy and tasty as Ozumo.", "author": "Yekta A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-05", "description": "Walked in on a Monday afternoon to just one patron at the bar. First off, the location is beautiful. Right on the corner near the main area of the Wharf. If there wasn't construction, I bet business would be a lot better for them. High vaulted ceilings and windows on almost every surface made for a different feel than most sushi joints. \n\nOrdered two rolls, which came out to $30 with tax. At first I thought that was a little high for a $$ rated place,but after seeing the size, the price is well warranted. Chef was conversational at the bar and made sure the rolls were perfect before dressing them and serving. \n\nService earned this place an extra star. My drink was constantly full, and they made me feel like I was at a high end bar. \n\nRolls were delicious, and hearty enough to where I couldn't finish all of it (usually never a problem). \n\nIf you're looking for an alternative to the greasy, heart attack inducing greasy food at the wharf, hit up the flying ninja.\n\nEDIT: Attached a photo (#37), Golden Gate Roll and Sunset Roll.", "author": "Jesse C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "Visited this place while staying in Fisherman's Wharf in San Francisco. It was a nice little sushi shop. The staff was friendly and the service was fast. It wasn't too pricey either.", "author": "Karl W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "This place is a hidden gem in a touristy spot. The service is quick and the food is delicious. I would definitely recommend to a friend.", "author": "Mallory T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-07", "description": "Was there this past December with the family. Good service and good sushi. Nothing impressed me, but it was good enough to visit again.", "author": "Lili M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-26", "description": "Had lunch there today; not much to write about as I found it the be mediocre sushi. Our order of Gyoza was brought to us cold and there was nothing spectacular about their rolls or sashimi. Pretty average.", "author": "Sabrina F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-02", "description": "horrible horrible    don't eat here      nasty nasty nasty\n\ncame in on sunday night , the waitress was nice. but the guy behind the counter  was smoking outside and he came back directly to the   front bar\nwhere he is making the food and started to make sushi. really and i tell you he did not washed his hands we asked  for him to wash his hands he said \nis his  job and we don't tell him what to do.\n\nhis  nails were dirty long. nasty watch whos making your food. apprently he is the owner. or something but seriously  we called the health department.  this is disgusting. don't eat here  you could get sick. i wonder what goes on in the back!", "author": "Jorge O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-03", "description": "I was expecting fly me to the moon, but i ended up hell instead.\n\nI totally understand that Non-Japo-Sushi place have to have all Japo dish as Curry.\n\nNo one even wondering why Curry at Sushi place.\n\nRamen too.\n\nYes, you can get a bowl of Ramen at Sushi place in U.S.\n\nWTF?\n\n15 dollar Poke Don was a crap.\n\n12 dollar Chicken Karaage Curry was piece of shit. And the funny thing was that it wasn't Karaage, it was grilled. \n\nThe Teba-Zaki, Japanese style Chicken wing, was extremely sweet.\n\nSomething seriously going wrong about the place.\n\nI think most customers here are tourists, I don't know that is why it is OK to serve Yo-Yo-Japo-Food?\nI had to go to bathroom 10 minutes after eating the crappy Poke-Don for crying out loud, and twice after within one hour.\nThe curry taste nothing but a instant 3 minutes kind.\n\nThe place is totally lame.\n\nYou'll find a sign says the best at the wharf, but FXXX, worth not going.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-19", "description": "My wife and I dined here during a visit to the city. We were not impressed with the Sushi or soup. The sushi fell apart pretty easily, and the soup was not flavorful. In addition, there was a hair in the soup. The restaurant made no effort to make up for this issue either (other than removing the item from the bill).", "author": "Vishal G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-23", "description": "Good sushi--probably the best salad I've had at a Japanese restaurant in awhile. Their hours are a little short, with the restaurant closing at 9.", "author": "Cassie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-11", "description": "I work nearby, so my co-workers and I often come here for lunch. The Fisherman Wharf roll is my favorite ! The price is slightly high but within that area, it is acceptable.", "author": "MinhAn N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-18", "description": "Oh Flying Ninja...So sad. \nCame here a few times with co-workers and we thoroughly enjoyed our experience. BUT! \nThe new owners I'm sorry to say have really messed this establishment up. \n\n1. Our order was wrong. \"Pork Curry\" does not translate to pork katsu. I ordered the 3 item bento but clearly was denied one item. When I inquired about my tempura, the waiter said that it would be right out... 15 minutes later, it was. \n\n2. The sushi is now complete unsatisfactory. The previous owners really took pride in serving the freshest sushi. A California roll is BASIC. I don't care if you use imitation crab, just don't macerate it in mayo before you put in a roll.\n\n3. Come on! refill the hot tea! You can do it!\n\nOn the plus side my co-worker did enjoy the spicy tuna and the tempura. \n\nSide Note: When your putting a menu together, use spell check because veggie is not spelled \"vege\".  \n\nSome may think we are overreacting but we were the only guests in Sushi Ninja at lunch time on a Friday. Our experience should have been decent at least. \n\nDear waiter, your smile was appreciated but after messing up our order so terribly, we did not leave smiling. So sad.", "author": "Jessica V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "This was one of the worst places that I have been in my life. I would have given it a 0 star if i could. First of all, the water was very tap water tasting and the cups were super dirty. They did not provide any straws at all. The prices for 2 bowls of ramen came out to 40.59 because of a 18% tip that they charged everyone apparently (no sign of it anywhere). If the ramen was good, it would justify the price however the food was not good at all or even decent. The broth just tasted salty and plain and the noodles when brought to us was already soggy. Customer service was bad as well. Won't ever come back again.", "author": "Kevin N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-08", "description": "I was looking for a Japanese restaurant opened at 4.00pm, and this was the closer one that I found. The food was very good  with the right temperature. I giving just 3 starts because in the Sashimi the charged 2$ because instead of 3 types of fish I just wanted 2 (tuna and salmon), that's the only complain that I have. But the food was good and they served quickly.", "author": "Sergio G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-12", "description": "We came here on a Friday evening and found the staff and service absolutely excellent. The sushi is heavily \"Americanized\" with lots of interesting combinations. It's not excellent although it's definitely worthy of being called good. Amidst all the touristy options, this is one of the better ones.", "author": "Angela K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-01", "description": "Devoured the Spicy Tuna roll, miso soup, and small salad in an embarrassingly small amount of time. They probably thought Godzilla was seeking refuge under my jacket, however, I was just ravenous. My meal was delicious and was met with great service. In addition, the prices are below average for the Fisherman's Wharf area. Eureka!\n\nI love the grand windows that let in tons of light, while also allowing me to people watch. This spot is people watching at its best. Watching and listening to tourists are a riot, especially the finicky Russians. \n\nFlying Ninja sucker punched my hunger pains and I look forward to another bout. Hiiiiii-ya!!", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-19", "description": "I've been to this location several times and the spicy tuna is great. The spider roll and chicken teriyaki was not great. California roll is good. Lunchtime was empty, always seems to have seating at the sushi bar or a table.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-18", "description": "I went there last night. I travel and eat sushi at least 3 times a week. I was very disappointed in the service, the quality of the sushi, and the warm beer. I won't go back. Paid top dollar and got low quality.", "author": "John V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "Excellent location, really kind server, fresh sushi. We had the Golden Gate and San Francisco special rolls...they were both delicious. The Sapporo draft is the cheapest pitcher on the wharf that we have had. Stop in!", "author": "Quack Attack Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "The specialty rolls at this place are awesome! We decided to do a small sushi tour in San Fran, and were happy we stumbled on this place. We tried Ozumo, but it was a little pricey and I am more into what specialty rolls are offered (Ozumo is very limited). The sushi was fresh and rolls were delicious here. I will definitely be back when i visit San Fran again.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-05", "description": "We have order Omakase(Chef's special), It was so delicious,\nThey are located in Cannery building . I have not been that area\nso many years, how refresh to visit tourist area too.\nI don't have to go Japan to eat good authentic Japanese food any more.", "author": "masae M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-27", "description": "One of the best restaurants on Fisherman's Wharf for sure. The sushi is really fresh and you get a good meal for the price you pay. You don't get your food extremely fast but they give you some soup while you are waiting, so you get satisfied by it. I've tried a lot of sushi because I'm addicted to it and I don't think there are many sushi restaurants in SF that are as good as this one.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-26", "description": "This place was a pleasant surprise. Couldn't decide where to eat, SO glad we decided on this one! The tuna sashimi was fresh and delicious. Totally melt-in-your-mouth status. Presentation very nice too! The cable car roll was sooo tasty! The unagi roll was also delicious, while the ahi roll was just ok. Service was prompt and efficient. Enjoyed the happy hour beer deal. We will be back!", "author": "Cynthia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-02", "description": "Very fresh.  I highly recommend the snowy crab roll.  Delicious.. Service was also good.  Would def go back", "author": "Christina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-26", "description": "Sushi was pretty good. Ramen soup was pretty good as well. I would come back if I'm in the area.", "author": "Liz L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-10", "description": "This place is a hidden gem amongst the so many tourist driven restaurants.  Living in San Francisco you would think that it would be easy to find great sushi.  I believe that the difference between good sushi and great is the level of service and interaction with the sushi chef.  Most of the places I have tried are okay, mostly lacking the service.  Kevin the sushi chef at Flying Ninja is great and keeps the mood going.  P.S.  he is down for sake bombs!!!!!  Locals suck it up, I know the wharf can be drag but there is light at the end of Hyde (free parking too!)", "author": "Jason L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "If your staying by Fisherman's Wharf or around the area for lunch definitely go here. The fish is EXTREMELY fresh. Probably the freshest I've had anywhere. The sushi is very reasonably prices. Very good for what you pay. Your not paying the $$$$ prices of JapanTown and getting a great meal. I don't know what other are people talk about slow service. I went around a busy time at night and got my sushi fairly quickly and the staff was really friendly, love the sushi chef.", "author": "Maxwell G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-14", "description": "I was starving after biking 17 miles, and wanted a place to eat that wouldn't cost an arm and a leg.  I was attracted to Flying Ninja by its cute logo and the place looked pretty nice inside the big windows.  I ordered a nigiri combo that had sake, tamago, unagi, maguro, and I think hamachi - this comes with a little green salad and a bowl of miso soup - for I think $10 or $11.  The guy at the counter was very nice, and agreed to let me substitute the tamago for tako (octopus), since I don't like tamago very much.\n\nThe rest of the prices on the menu looked really reasonable, especially since I'm used to paying a lot for Japanese food most places.  Took about five or ten minutes for the food to arrive, and I have to say that everything was very tasty.  The rice part of the nigiri was a little smaller than I was used to, but the fish portions were plentiful, and very fresh-tasting.  I typically find salad dressing at Japanese restaurants to be hit or miss, but this dressing was good, kind of citrusy.\n\nNice, cute decor, clean, and friendly staff.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-15", "description": "Formula Japanese fast food.\n\nJust say no.", "author": "Jim M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-14", "description": "It's an o.k place. Not the best when it comes to sushi or bowls, but it is affordable and quick.\n\nThey are nice and polite and have always had a smile when I came in.\n\nI've had their chicken teriyaki bowls and I give that 3 stars.\n\nTheir rolls are good and taste fresh (which is important).\n\nAnd their miso soups has never tasted the same the three times I tried it. : /\n\nSo, if you looking for quick sushi in the area, I'd recommend it.", "author": "Cindy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "Super fresh fish.  Reasonably priced for the Wharf.  Very good service.  Great options for locals in Russian Hill.", "author": "Desiree G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-31", "description": "4 stars for the whole experience.\n\nI went here for lunch today with my texted Living Social voucher- $10 for $20 worth of food. Um awesome? Yes. Plus it's super convenient to where I work, which is even better!\nImmediately upon walking in the server greeted me and continued to be super friendly throughout my wait. The rest of the servers were really nice too and made a point of remembering my name.....and they were also hot. Yes, I always notice that haha. \nI ordered the Gold Rush roll, which was really tasty. It was made of tuna and avocado with yam and squash on top. I also ordered the gyoza and a seaweed salad. They through in an extra miso soup, not sure if that was on purpose or a mistake, but it hit the spot. The seaweed salad was lacking in flavor, but it can't be amazing everywhere.\nThe place itself is cute inside, and has outdoor seating. I also noticed it has a good happy hour, which includes $3 sake, sake bombs, shochu cocktails, beer, etc. $4 wines, $1 off rolls. I'm definitely going to be checking that out one of these days!\nThe food is a bit on the pricier side, but what can you expect in these touristy parts of the city? \nAll in all, I left leaving happy and full.", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-21", "description": "Shared the large Sashimi plate with my father, all the fish was thick and perfectly cut. It was everything I expected, and the service was excellent. Everyone that worked there was so kind, I really have to thank them. I live in Alameda, but I'm going to make the drive again just for a great meal!", "author": "Chris I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "We tried a few different speciality rolls, all of which were delicious.  Paired up with a cold Sapporo on draft... Excellent :). Giving 4 stars instead of 5 due to the sake oyster shooter... Pass on that one.", "author": "Mindy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-12", "description": "Generally good. California roll and seared salmon skin roll were the best. Golden gate roll was good too. Avoid the Sunset Roll which had pieces of lemon on it. It was not a good flavor. Individual sushi pieces were good, not great, but certainly good. Cost was reasonable relative to the local area, particularly for the beer. Waitress was very nice. I would go back again.", "author": "Bruce M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-05", "description": "I asked the waitress what I should order, and she gave suggested the Golden Gate roll. It looked nice, but it was flavorless.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-22", "description": "i guess it's cheap for sushi rolls, but you'll still pay $9 at least once you add tax, and they give you a napkin so teensy it's pretty much only a token attempt at a white paper thing we hear you people like with your meals, and for plain water, a dixie cup sized serving. been a couple of times in the last week or so but don't think i'll be going back.", "author": "Gwynnie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "Very good quality cuts convenient to all the action near the wharf and the cable car. Service was as good as the sushi! Recommended.", "author": "Brian F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-08", "description": "the prices are definitely higher than expected.  the decor was cooler than i anticipated.  i hope this place improves and gets better stars; the neighborhood could use some decent restaurants.  \n\ni ordered two maki rolls (rock and roll and california); the bf had unagi don.  \n\nthe rolls were surprisingly good.  if a place can't get these two basic (and not authentic, btw) rolls right, you should be worried.  but they had a really good rice to filling ratio and the rice itself was good.  \n\nthe unagi don was fine (this tastes the same everywhere, really... can't go wrong) except the portions were small.  it was probably the smallest unagi don i had seen in awhile.  i would've gotten full from it but not the bf.\n\nnot sure whether i would come back. i might come back just for those two rolls.  at their prices, i don't feel like trying anything at the risk of being disappointed, especially when i already have places in mind for curry, ramen and sushi.\n\nwhen the cashier took our order, she was very sniffly and had a runny nose.  when she rang us up, she used the back of her hand to rub (wipe?) her nose.  i was slightly disturbed by that.  i didn't know if she had a cold or allergies.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-07", "description": "I came here not expecting much but was pleasantly surprised. I ordered mainly nigiri and some sashimi. Everything tasted fresh and the service was great. We sat at the sushi bar and the chefs were very friendly. All in all I would rate this a satisfactory experience and would come here again.", "author": "Nico S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-22", "description": "The bet spicy tuna I've ever had, ever. Sweet place too the best place inthe boardwalk.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-24", "description": "Was starving on my lunch, went in and ordered the Shrimp Tempura Udon. The broth, while hot, was oily, flavorless and gross. They gave two tiny pieces of the shrimp tempura and there were no vegetables or anything else in the soup. Seriously $9? for this?", "author": "S .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "Pretty good. The bento had a big portion with good fresh items. The soft-shell crab was unique and tasted great. The sushi rolls were generous and tasted great. Heck of a deal on the ramen too.", "author": "Doc M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-04", "description": "I had some time to kill around the wharf. Decided on a quick sushi fix. I tried the amberjack, wonderful texture, great smooth flavor. Really tasty, and reasonable for this touristy part of town.", "author": "eric c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-28", "description": "Ugh. Not very good. Chicken donburi was too saucy and chicken was overcooked. Tempura was more like conventional batter too.", "author": "Ian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-04", "description": "I was at the recent grand reopening of this restaurant under a new chef -Nori.  I have to say his take on sushi is amazing.  Everything was delicious!  It is affordable, quick service, and creative take on the food.  Even the Chicken Katsu and tempura calamari were better than anywhere I have eaten for those who dont' eat sushi.  There is definitely something for everyone! Also, try the sweet potatoes that are stacked like Jenga.  yummm!", "author": "Marichele D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-17", "description": "Another overpriced lackluster addition to the rest of the corporate food tourist traps in the Fisherman's Wharf area. Not where this local would go if given the choice.", "author": "Art L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-20", "description": "Wonderful sushi, wonderful service, wonderful everything.  We had whatever they recommended (Alcatraz, the Basements, Tekka Maki, Tiger and \nMussels in Sake and to drink, a Sake Bomb).  We cannot rant and rave enough!", "author": "Faith S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-31", "description": "I love this place ever since New ownership  , ! BTW what ever happen to that one gentlemen I think his name is Montenegro  very respectful I only went there because  of him .", "author": "Sage S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-19", "description": "the spicy tuna is super good! definitely must try! egg ramen is very great and not that oily than any other ramen. however the udon soup tastes so different and more intense. i don't really like the udon but my friend like it. the price is so expensive than any other ramen or udon. the service is good.", "author": "Allentine T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-20", "description": "A nice little place to escape the clamor of the tourists in the Fisherman's Wharf area. We were there at happy hour and left very happy, with a nice saki and a Japanese Porter,  along with the meatiest spider rolls I've ever eaten, cooked just a litle soft (less crisp than I prefer).  Good edamame, too - plump, tender, just right salty.", "author": "Bill V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-15", "description": "We had the sushi/sashimi 18 piece sampler with some Sake to wash it down. Service was great, waitress picked a perfect bottle of dry Sake for us. The tuna and salmon were among the freshest we have ever had, my biggest complaint was that there was not more of a variety. The waitress said they focus on the tourist-friendly items, not much of a demand for sea-urchin or eel in this area. The miso soup was perfect, the salad was pretty good. Prices were in line for the area, which is a little high but fits the quality of the food.", "author": "J G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-15", "description": "Well its FINAL - NEVER COMING BACK!\nsame with all my co-workers\nso sad.. the cashier guy is gone, the menu changed\nthe food quality changed\nwhich makes sense y i was disappointed last time - the gradual change.\nthis time: how would you like some soggy sushi?? seriously?!\n\nso if u want the 20% discount for working around there, you're gonna have to ask and they're gonna seem lost becoz it was the other owner who gave it but they'll still honor it for now at least.\n\ngo to GRANDEHO KAMEKYO instead its only 2 blocks away and theyre quality never changed.", "author": "Janet W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-10", "description": "bad service, bad food. nothing was right here. rarely do i not eat all sushi. this was so bad i left most of my lunch at the table and got out quick. the worst of the worst.", "author": "S. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-15", "description": "We tried to go to a sushi place away from the Wharf but it was closed when we got there so we trekked back to Flying Ninja because we were hungry for sushi and a bit lost on a Sunday night. It worked out fairly well though. The service was pretty \"meh\" (our food came and we still didn't have our drinks...and it was not busy at all), but the servers were at least pleasant. I also really appreciate the casual environment as we have a two year old and can't do \"fancy\" with her along. I will break down the food for you:\n\nMiso Soup: Yummy, comfort food. I love Miso Soup and their's was very good.\nChicken/Beef Teriyaki: Not bad. Portion seemed a bit skimpy but I give it a solid 3 stars. \nSpicy Tuna Rolls: Totally decent but comparable to grocery store sushi rolls. Just \"pretty good.\" Nothing \"fishy\" or off-putting at all.\nSashimi Tuna: Fresh and delicious. Would totally order this again. \n\nIn all, the bill for 4 people came to around $70 and we were full and our sushi craving was satisfied. The location was good for our touristy selves and we took a short walk over to Ghirardelli square and had some wonderful dessert. \n\nI don't know if I'd eat there again (maybe stop by for a quick sashimi tuna snack?) but it was totally decent.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "Super delicious! On new years eve we decided to randomly step in for dinner- best idea. Service was very accommodating and friendly. Food was fantastic, I really feel like these people know what they're doing here. Very fresh. I would suggest this place to tourists and locals.", "author": "Taylor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-24", "description": "Landed here after four days in the area eating crappy food. I was not in the mood for some lame, tourist laden, heavy Italian-American slop. You know what I'm talking about, lame Italian bread drenched in a mix of margarine and butter and a shake of an Italian herb mix served with a tasteless iceberg lettuce dominated salad, some hot house tomatoes and limp carrot strands next to a bowl of linguine and clam sauce where the clams were probably from China...you get the picture. \nI was aching for something kinda clean, something not laden with animal products. So, I stumbled into this little place and stayed because the servers were all so kind. Met two lovely young kids from Korea - one a waitress, the other a sushi chef - who told me in their broken language a bit more about Korean food and how they missed their families.\nI digress...\nThe food. I had the seaweed salad, a shitake roll and a bowl of udon. Simple. All three dishes met my expectations, fulfilled my cravings and didn't bust my budget. \nLike anything in life, it's as much about the people as anything else...\nSo, if you find yourself caught in Fisherman's Wharf Tourist hell and can't bear the thought of another weak bowl of cippionio or pasta carbonara, give this a chance -- and engage your server or chef!", "author": "Annie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-29", "description": "I actually went there yesterday and it was their grand opening. I was very impressed with their food. It was a lunch meal so the meal was light and very well presented. It is intended to be sushi on wheels. \n\nWe ordered the California rolls which was nicely made and also the Teriyaki Chicken which was also very nice too. You get sticky rice, potato mash and a small green salad with the chicken. I actually really liked it - well done guys!", "author": "Benjamin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-22", "description": "We went to this place while visiting the Wharf,  The eel sushi was cold, they had a power outage for 15 minutes while we were there, so they could not warm or cook the eel, so they decided to serve it cold, nastiest site I have ever seen.  Service was slow, very cheap and stingy with their portions.  They have no restrooms, they let us wash our hands in the Chefs sink.   Stay away!!", "author": "Aram T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-12", "description": "The menu goes up $5 after Lunch for the same items. Sorry kids if you're going to charge $20 for a roll it better be from heaven. Meh. just OK.", "author": "Theresa R."}
