{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "This place is hallel. I got the pastrami and it was fantastic! \nThe people even speak Hebrew!!!!!! \nWow I am impressed!", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "I've been coming to this place for years. The regular pour-over coffee is consistently perfect and the paninis never disappoint. Can't go wrong.", "author": "Ilya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "I love their ginger bread it is so good and fluffy with the steamed vanilla milk. I usually get these on cold days but I bet they'd be good anydsy", "author": "Simone G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Best place in the city they have the best coffee ever lovely people \nGood place to hang out", "author": "Mohammad M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Tired of claustrophobic, no electrical outlet, over priced, filthy coffee shops in the Sunset? Go the extra mile for an independent, large, airy place with lots of clean tables and plug ins for your wi-fi device. The coffees are made in a row one at a time and kick like San Francisco beans of yore. I recommend the $4.88 grilled cheese sandwich with delicious slightly-herbal crispy sourdough and perfectly melted ample cheese. The $4.75 garden bagel has just the right amount of high quality spread softened by a nicely toasted bagel of your choice with bite size vegetables stacked inside. Mouth watering food, strong coffee, industrious and respectful family staff and neighborhood regulars--it's my go to. Parking is best in the pretty neighborhood off Ashton.", "author": "Vince's S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-03", "description": "Overall, I like foglifter. It's a chill place to hang out, the food is decent if boring, and the coffee is actually quite good. It's quiet and family friendly. Nice feel inside. \nUnfortunately The staff here changes once a year or so--which makes sense since I think they are usually students. But this current batch (Summer 2017) is rather awful. They are indifferent at best, rude at worst. Greeting customers kindly with a smile is pretty standard service 101. I really hope they all leave at the end of the summer. \nWith Philz as new competition, the owner is going to have to hire or train better people. An update to the pastry selection wouldn't hurt either.\n\nUpdate: I recently boosted my review after the latest round of employees, very nice and attentive bunch of folks now (Fall 2018).", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "Excellent area to break away from the hard knock life. I had a New Orleans Iced Coffee and hit the books here. Once you settle in, you'll feel very cozy. This place is totally NOT a hipster cafe and you may not have to worry about the same kind of City College folks. This place is serious.", "author": "Elvine V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "Ive lived in this neighborhood for 20 years and have seen this place change ownership several times. This time the new owner just updated the facade and the interior a little so they could raise the price on everything. Both drinks we ordered were watered down and cold (hot chocolate & chai). They were out of whip cream, which well known, is every child's favorite part. It still smells like mold at the front counter and its condiment area is still super cluttered, ugly, and unorganized. Everything looks broken. There's a sound system with no music playing and a tv with nothing on it. The flooring is all warped and even the lighting doesn't match. Different name and still as grungy as ever. Super disappointed...wont be coming here again. Should have gone down the block!", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "I had their lox but in a croissant. Delicious!!! Their latte was also the best I've had in years! Check this place out!", "author": "Julien N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "It's sad how far this place has went down hill. This was one of my favorite coffee shops in the city when it opened a few years ago, friendly staff, a hands on owner and an overall good vibe. \nNow it's the most inconsistent coffee shop I got to. It's hit or miss with the staff, some make a decent latte while others burn the shit out of it. Same goes for the food, I just had a ham and cheese croissant and the outside was burnt while the inside was almost frozen.\nIf it wasn't for the awesome owner they would be getting 1 star. From now on I'll only go there while he's working since he actually cares about what he gives his customers.", "author": "travis m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "Nice neighborhood place with great coffee and a decent array of yummy food. Dedicated, hard working owner, staff is unfortunately less dedicated. Worth a visit, buy local.", "author": "MJ J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "This has been my go to spot on the weekends. And today will be my last. This new employee refused to\nmake my usual breakfast item which I had been getting for years. She could not tell me why today she couldn't make it.  I did not catch her name. But she had a tattoo near her neck area.", "author": "Mase S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "This is a spot I'd never head to again if not for the location. Coffee tastes a bit burnt and wifi can be a bit spotty. Ambiance is ok.", "author": "Anastasia Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "Great little cafe on Ocean with lots of seating and good music to study to. I'm not much of a coffee drinker but I am a fan of their chai tea lattes, smoothies and sandwiches. Most importantly, WiFi service is great here too!", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "I love this spot. It's light, airy, and the staff is really nice! \n\nOnly constructive criticism: I would definitely go here more regularly if they offered a medium or light roast. They use a great brand of beans for their pour-overs and espresso, but only ever seem to have dark roasts--honestly didn't even know Sightglass did dark since most specialty roasters keep it on the lighter side (less burned)! Would love the option to have something a little brighter. \n\nAlso, prices are a little prohibitive (egg on a bagel is like $7!) considering how many students go here. \n\nStill my favorite place in the neighborhood though. The owner seems like a very nice person. Thanks, Fog Lifter!", "author": "Nessa F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-08", "description": "She was rude and disrespectful. Ordered a grilled chicken panini and waited 20 min before decided to go and ask what had happened. That's when she informed me that she had run out of chicken. Before I decide to go and get my order I saw another girl get 2 of them (2 grilled chicken chicken paninis) and she came in 10 min after I did. I think it is very disrespectful to complete someone else's order if they came in way after me.\n\nEdit\nDeleted the picture but I will be returning to speak with the manager of the place to talk about the disrespected service received", "author": "Enxhi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "A cute cafe. I prefer drink a lot of coffee, but their Chair Tea Latte is really good. I like this location because it's close to City College. Also they have Wi-Fi and parking (a big plus). Nice stuff and friendly owner. They have a big selection of appetizers. It's a good place for spending your free time.", "author": "Vicki G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "I live near Fog Lifter and what a delight it is to have in the neighborhood.  Pure class, I'd describe it.  Such a tastefully created and beautiful interior.  I always like to go there, relax, have a cup of coffee, maybe get something to eat, and do some reading or writing.  And the people that work there are nice to my dogs when I bring them to sit outside.", "author": "Kai M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "Great place to come to, work and have a nice coffee! Awesome meeting place. WiFi is good & the new owner is pretty friendly! Clean restroom. Four stars because food has been off sometimes & coffee too but they have great salads!!", "author": "Aki G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Great coffee - they do pour overs of Sight Glass coffee and sometimes stump town too. While the menu is somewhat minimalist with sandwiches and additional options, they make a lovely oatmeal in the morning. Great staff and atmosphere too!", "author": "Mike K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Oustanding new place ,Sudents at City college I recommend everyon to check it out .the Boss is friendly ,kind and provide good service have the honor to meet him ,thanks  for his kindness and hospitality.Super.", "author": "Manny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-28", "description": "Not only is their iced mocha amazing but their customer service is exceptional. This cozy cute cafe is on the corner of Ocean Ave and Ashton Ave in San Francisco. There is a warm feeling the minute you walk in and they also have beautiful paintings as well as reading materials. They also have a bench out in front and tables outside. This is a great way to start my day.", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "Friendly staff. I was there when someone was training and was able to ask questions myself. Parking wasn't the best, but I needed to get work done. I'm not from the area, but I'd be back.", "author": "Clifford J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-30", "description": "Decent coffee shop that would be generally good for studying or reading or hanging out...\n\nJust not on hot days. They don't turn on the A/C, and it gets quite stuffy inside with not enough airflow.\n\nI would definitely come back when the days are cooler (and bring a jacket).\n\nParking can be quite difficult.", "author": "Kaje Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "Free wifi, lots of seats, and decent neighborhood parking.\n\nLove the amount of tables here and most importantly the amount of light this cafe gets. I really love a well lit cafe that sets a good environment for studying. They serve blue bottled coffee here, and I always shoot for the New Orleans iced coffee with sweetener and 2%.", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-11", "description": "I rendezvoused with friends there earlier today. Nice neighborhood cafe. I like the positive vibes from the place. \n\nBut I hate the service! I ordered an egg salad sandwich with salad. Circa 15 minutes later, I asked about my order. Didn't get an apology. I'll just have to wait and see if my friends want to meet up there again.", "author": "Julio B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Best coffee shop in the city! Variety of food and drinks, good music, parking is pretty easy around and the people that work there are so nice. I definitely recommend this place.", "author": "Gloria B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-02", "description": "Here's the review I wish I could leave:\n\n\"A mostly comfortable cafe with limited space but big windows, plenty of outlets, reliable wifi, and good coffee. The prices aren't great but not terrible, and the music is usually pretty good. A little out of the way for people without a car but you do what you can with the cost of SF real estate. Overall a good deal. Four stars.\"\n\nBut if there was ever a time to start saying I just can't even, this is the exact moment where I just...can't...even.\n\nFull disclosure, I came in with someone who already posted a review below. But I was there too, so I get a vote too, and in the end, the wages of sin is death.\n\nForget someone's latte? Fine. It happens. I've worked in food before--twice in the front of the house--and I get that things get busy and even when you're running as hard as you can sometimes not everyone will be completely satisfied. But when you mess up, the bare minimum that's required--and all that's required, if you're dealing with reasonable people--is to apologize and fix it as soon as you can.\n\nToo much to expect in this case, apparently. Instead of finding out why a customer was waiting, the barista calling herself Jenn J. chose to chat with her fellow staff members and ignore my friend, paying her no mind. Then upon learning of the issue, the same Jenn J. accosted this same customer in an icy tone. The words may have literally been, OK, we'll start that for you right now, but it came out as a sneer, and in a way that conveyed the request for a drink already bought and paid for 20 minutes ago was a major imposition.\n\nI don't know the reason for this hostility. I also don't know whether or not I was paying for someone else's supposed sins when Jenn J. later denied me entry to the restroom. To be sure, there was a piso mojado sign up, but that usually means watch out and be careful, not, the restroom is out of commission. Even if it was, the explanation was suspect because too long, and because of the gratuitous observation that I could use it in ten minutes, \"if you're still here.\" Maybe she didn't mean anything by it. But I finally decided, I don't care. I only have to ask these questions in the first place because of the completely unnecessary hostility she visited on both of us earlier--hostility that neither of us came looking for, and that neither of us reciprocated.\n\nAnd now I come to find that Jenn J. herself has responded to the first review describing this situation with an insulting and demeaning personal message. To the owners: Straight up, fire this person outright, or I will never patronize your business again. There are plenty of people--including both the customers whose morning she ruined that day--who take pride in their work and know to treat their customers with decency and respect. If that's not something you require of your staff, well, good luck with that.", "author": "James D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "I really like this place, mainly because of the quite ambiance I can actually get work done. I ordered an ice tea, it was fine but took awhile and the girl behind the register was apologetic about it. I felt bad because other customers were being rude about the wait time, they were short staffed and that's not the employees fault.", "author": "Alison J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "The music, bright space and average coffee, the convenient location keeps me coming back (2 doors down from my yoga place). If you could care less about service while needing a place to do some studying/ working, this place is decent.\n\nIf you know your a type of person who cannot tolerate average food, delayed food service or unwelcoming cashiers, I would refrain from coming here.  I give it 3 stars for now.", "author": "Carleen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-18", "description": "My two stars is for the really bad service! I always go back to this place cause is only one block to where a live and the coffee is good, but I feel today was the last time. I am tired of the really bad attitude and uninterested way people work in this cafe. Its like they are making you a favor and don't realized we are paying a pretty expensive coffee. \nIn my case, they forgot my orders several times, if I go between 5 to 6pm they always say its too late and kitchen is close, tho the cafe closes at 7pm. When that happens I always asked them just to warm my croissant with the microwave, but they don't like this either. \nI just can't understand why such a bad attitude towards their jobs. \nI do wanna say that it got a bit better since they change some of the employees, the new girls are somehow nicer than the guys before them.", "author": "Nicolas B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "You're kidding me right\n\nAll I have to say is why would you give a customer burnt food !", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "I love that they play good study music there so it makes it good to work at. They're coffee is good and also their food. Great staff too!", "author": "Jade J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-19", "description": "Young guy serving needs to listen to what the customer orders! Got my order wrong and thus ended up over charging me. Heard the word chicken so took a stab at what I ordered even after I clarified twice. \n\nAsked for it to be 'eat in' still gave me food in a to-go bag.\n\nOnce I got the right sandwich it was pretty good. \n\nBut they need to work on the guy taking the orders to get them right. He also told me to take someone else's order!!! Duh!!!", "author": "Leena S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-08", "description": "These new Latin chicks except for the one with the glasses, are SUPER rude!!!! The skinny one with the red super acne looked me dead in my face and ignored me  when I asked her when will the owner return. When I asked her about it she rudely said she's working and gave me a crazy look. The other who barely heated my croissant tried to heat it up in the microwave. Before that I was waiting for a while to be helped. I asked may if I may give my order really nicely, she snapped back rudely saying they're busy. Smh. \n\nAfter today I'll never come back. This staff is the complete antithesis from the ones before, they were professional prior and super helpful. Too bad unprofessional employees can give your business a horrible look.", "author": "Zaariah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-10", "description": "Good coffee and Good food. \nBut parking sucks (gotta find street parking)\n\nWhat a smart location. You have your mix of customers (students, locals, gymmers and people like me who like going to different cafes). \n\nMostly students and locals. Hence, it can get pretty packed. No worries, lots of tables and outlets scattered around. Tbh, I wasn't found of their table layouts. If you're like me and you like having square tables and space, they don't have much of that. It's perfectly fine if you grab one, but be willing to share!!! \n\nCafe Mocha: 4/5. Loved the cute art. Definitely felt like it was a good combination of chocolate and lattee. The chocolate wasn't too sweet, but just subtle enough to enjoy. I wasn't a fan that my cup wasn't hot enough for me. I was hoping that for a rainy Saturday, a good hot cup would warm me up. \n\nMushroom & Spinach Quiche: 3/5. I wasn't too found of it. I think I've had better quiches (including that one time I cooked it during school). \n\nSalmon Avocado Panini: 4/5 Delicious! Smoked salmon w/ capers, onion, avocado, cucumber and w/ some sort of spread. It was a very strong flavor due to the capers but that was perfect. As delicious as it was, I wish they would add a bit more contrast to the flavors. AKA, add more cucumbers, some tomatoes or lettuce. \n\nI think prices are reasonable. And it's always a great feeling supporting small businesses. \n\nFifi would come back here again for studying purposes. She'd avoid going during midterm or final weeks though.", "author": "Fiona L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "The fog lifter is very close to me, so yes its great for local people in the ocean avenue area. \nI've gone a couple times for a quick coffee, \n but I have to tell you it's a great spot! The sun is always shining and the coffee is nice and the bagels are Yum E :)", "author": "Tere C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "I hardly write reviews on places. But i have to, due to the rudeness of the Saturday morning staff. It was my 1st day trying this cafe. Not familiar at all with the way this place works. \nI work across the street so i wanted to have a little coffee and a snack before work. Jessica, the cashier seems to be having a bad morning. \nNot very helpful and very rude. I ordered a bagel and  she asked if i needed any spread. And i said yes, expecting her to give offers or options. Instead, she gave me a look. Then i asked for it on the side, since i didn't know how it was offered. \nIt took a while for our order to be ready and i wanted to know how much longer, to what she replied  \" there are 3 orders before yours\" with an attitude. When my coffee  was ready.. it wasnt placed anywhere, instead left at the counter. I had to approached them to asked if it was my order. \nShe was very rude responding to me.\nLater, when a asked another worker what the girls name was. She said why?? With an attitude as well. She responded. Jessica.\nI said because i will complain about her rudeness. Which she when over Jessica and told her what i had  said. \nWhich to jessica responded  \" i dont care\"..\nThats not the way you treat your customers. Needless to say, i will never be back to this place.\nAnd because of my job, im able to reach to a lot of people. I will  recommend NOT to visit this place.\nOften i see small business complain about chain restaurants or coffee places take business from small shop. But if you treat your customers so poorly, we will prefer those big companies because we at least  we get an apology for the bad service.", "author": "Andrea G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-21", "description": "The coffee is great, the food is meh, the service couldn't be worse if they actually put effort into it. They'll take over 20 minutes to make a sandwich when there is no line and only two other people in the whole cafe. No apologies when things take longer, no smile when you enter or leave, and no thank you's ever! I come here after school a couple times a week when I'm in the mood for coffee better than Starbucks and service worse than a prison :)", "author": "Virginia J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-12", "description": "Went here a while ago with my sister. service was awful. I bought banana bread and the waiter asked me if I wanted it heated up. I asked for it to be heated up and she stuffed it in a MICROWAVE and completely forgot about it, going around helping others. While I was waiting for the bread she actually sat down at a table for 20 minutes and chatted with her friends. Hopefully she doesn't work there anymore. She was completely distracted by her friends and it ruined the whole mood. Very disappointing for SF.", "author": "Niki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "I been coming here for almost two years and this new owner who just bought the spot had made it even better. I had a mocha today morning and it was great. I also got the pastrami sandwich pretty good!! Service was wonderful!!!", "author": "Anas S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Always come here for there North Beach panini and also there house brew. Great spot to get some work done, read, or spark conversations. It's great for yoga lovers too because yoga flow is right next to it!", "author": "Anuja S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-12", "description": "Atmosphere is good, quality of coffee is also good. However, whenever you ask for a more specific type of beverage, they generally mess up. This has happened many times when I ordered an Americano.", "author": "Raymond F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-21", "description": "I've been coming here for 3 years consistently, and only recently have I noticed a change in the customer service of this place. They don't care for your time and have incredibly poor service. It doesn't even feel like most of these baristas recognize you as a regular human being. Other reviews have confirmed the same experience.\n\nOtherwise, the location is great and the coffee and food are still decent. Good place to study or work, as long as you distance yourself from the staff.", "author": "Amanda A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "Real good coffee and latte art. Also, they serve Sightglass Coffee now. Definitely a nice spot to visit when you seek a cup of latte or mocha carefully handcrafted. It is always good to know that we have flexible coffee options here in the city.\n\nReasons for the 5 star rating:\n- spacious path between chairs and tables (+1)\n- drip coffee (+1)\n- clean facility (+1)\n- good service (+1)\n- nice, friendly staff members (+1)\n\nFree Wi-Fi available - props to this amenity!\n\nIt is near 24 Hour Fitness, great spot for the quick caffeine fix after the workout. Overall, positive first experience here!\n\nFYI:\nThe KT Ingleside / Third Street has a stop on\n- Ocean Ave and Dorado Terrace when coming from City College of San Francisco\n- Ocean Ave and Jules Ave when coming from West Portal Ave", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "Awesome neighbourhood coffee shop!\n\nFogLifter is run with a lot of love and care. I love coming here on a foggy morning and get a nice cup of warm coffee. You can come here when it's sunny as well, and take a seat outside or on the benches. \n\nCoffee - local and tasty. It's made to order and poured, so it will take a few minutes. Just a heads up, in case you're in a hurry, so you might want to avoid the crowds from yoga class ending.\n\nTea - they have about a dozen different types (Mighty Leaf style) \n\nFood - good selection for all your breakfast/lunch cravings (cookies, bagels, sandwiches, breakfast muffins, fresh fruit, OATMEAL mmmmm) \n\nSmoothies - my faaaaavourite! These are absolutely delicious =d\n\nThere are plenty of tables for people to work and study, just be respectful and don't spread out at a 4-person table if you're alone, especially during busy weekend times. Dog-friendly with their outdoor seating!", "author": "Jade T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Amazing coffee!! The view from inside is so nice the owner is so chill he offered to show me the city too i recommend to go try his coffee", "author": "Swift L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-22", "description": "WARNING: There is something disturbingly wrong with the manager here. She is hostile, bad-tempered and unpredictable. In short, we asked her not to mop near our table while we were eating, and she became verbally abusive, berated us and ordered us out of the cafe. This woman is a lawsuit waiting to happen.\n\nWe arrived 45 minutes before closing on Aug. 20 and asked a young employee at the counter if they were still serving, since the food was wrapped up, a section of the cafe was blocked off by chairs, and there was yellow tape across the bathroom entrance. She said they were open, so we ordered coffee and pastry and went to sit down at one of the available tables.\n\nMinutes later, the manager (Erica, with tattoos, wearing a backwards baseball cap) pulled out an industrial bucket and wet mop reeking of cleaning fluid and started slapping the mop around. We asked her to please hold off while we were eating, that the fumes were overwhelming (this is a completely reasonable customer request - not to mention the fact that it is bad practice to clean while a restaruant is still open!). She became instantly combative, said this was how she did things and we could leave if we didn't like it. We were stunned.\n\nWhen my husband commented on her rudeness and said he had just been in Japan where customers are treated like honored guests, she interrupted \"Good for you!\" He started to respond and she said, \"Shut up, old man!\" When he raised his voice in reply, she walked menacingly toward our table and threatened to call the police and have them throw us out of the café (absurd - for asking that she not mop near us?!). She also said she was banning us from ever coming back.\n\nWe are longtime patrons, working professionals, and have lived in this area for 20 years. We like to support local businesses. But we've never had such an outrageous thing happen, in this neighborhood or any other. \n\nThis manager has no business interacting with the public. She poses a danger to others and is a liability for the business. Her hostile, angry outburst was a fireable offense. It's a shame the owner seems not to care (he ignored a letter we sent to him).\n\nOurs is not an isolated incident - many other customers have been mistreated in recent months (see other posts). We want to warn others about the potential risk of interacting with Erica and encourage anyone who has had a negative experience to post on Yelp or report threats to city law enforcement.", "author": "Peppi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-02", "description": "I used to like this place a lot more, but lately the service is now where as friendly as it used to be and I don't like that when you pay with a card, it immediately asks you to tip a minimum of 20%. Please just pay the employees more. I think part of the reason my service was lousy was that I put 18% in the jar for a bagel sandwich and did not tip the minimal 20% that they asked for on the ipad and they probably didn't see that, but I just refuse to pay 20% tip everytime I get a coffee or a bagel when there is no table service. That is just too much. Just give everyone a raise and stop asking for tips, please. Otherwise a pretty good spot!", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-01", "description": "REALLY rude service here. \n\nI ordered the eggplant panini. The menu (as you can see in my picture) lists pickles as one of the ingredients. My sandwich came without pickles and when I asked for some at the counter, the girl working there said \"I don't think we have pickles\" (even though they're listed on three of their sandwiches). Then a girl working in the back said pretty rudely, \"Well, first of all, that's a typo on the menu\". Then erase it? The menu is literally on a chalkboard, couldn't be an easier problem to solve. They seriously wouldn't give me some freaking pickles for a sandwich with pickles listed on the ingredients? What kind of sandwich place is this? \n\nLater my friend asked for some jam for his toast, which they wouldn't give to him either. I guess they don't have jam or pickles or customer service here.", "author": "Elen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "I'm a sucker for cozy cafes and this place is def a hit! Not only are their tables and chairs modern and appealing to the eyes, but their drink menu isn't too overwhelming as well. They have the standard coffee and teas all under 4 dollars and a wide selection of FOOD, other than your standard pastries you would find at any simple cafe. \n\nThough I came on a rainy day (this may have played a HUGE role in my opinion of the place because rain+cafe=major feels, ya feel) there was still a packed housed. Everyone was either working on their laptop or reading quietly to themselves. Even side conservations were kept to a minimal. In terms of atmosphere, this place gets bonus points! \n\nThough I hope this place does not get overly hyped/overly crowded, I did want to leave a positive review because of my awesome experience. So check this place out and enjoy (=", "author": "Mary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "This is a review for a visit from years ago when it visit opened.\nI just remember loving the cream cheese variety the bagels, and thinking that the coffee was a religious experience. Will return again soon to see if this still rings true.", "author": "Shantall E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "This place is great for a studying and getting work done day! Little bit small but feels open and kind of spacious.\n\nThis is my first time here but I'm very satisfied with staff who rang up for my Garden Bagel, they were very friendly ad nice. I also like the music that's played in here and it's not played too loud either.The Garden bagel consists on cream cheese, cucumbers, red onions, and tomatoes. Although it says on the menu that you get your choice of spread, I wasn't asked what kind of spread I would like. I don't know what other spreads they have and I wasn't informed so I guess I will ask next time.\n\nThere's a variety of seating here with good quality tables and sofas. There's also a very unique looking picnic table with nice benches. There are also long table that can hold abut 6 people, small 4 person tables, 4 couch like chairs and a bunch of small round tables. For your devices, there's about 10 outlets available as well.\n\nRight by a residential area but parking is pretty packed even though there's a lot around. But I could spend all day in here so it's worth walking a couple blocks down for!\n\nI'l be back again!! (:", "author": "Laura Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-01", "description": "Jenn J, the barista lady on duty that day, kindly sent me a private message. Word to word copied below:\n\nI am certified and trained Barista. Call me what you want little liar. Now you can go ahead a write a false review but we both know your lying. Grow up.\n\nLiteral quote can give y'all a hint of the attitude you would get from this place.", "author": "Mi Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-09", "description": "3.5 stars, if we want to get specific. \n\nPros: The coffee here is decent, there's lots of seating and parking is pretty easy around here. The convenience of it being near my house leads me to gravitate towards this place. The baristas are really sweet and overall there is a chill neighborhood vibe.\n\nCons? Food is a tad overpriced (expect to pay $10-11 for some pretty basic sandwiches, after tax). The bathroom is a freezing, dingy ass dungeon and it's prettyyyy gnarly in there. Think: wet floors, overflowing garbage can, dirty sink.. AND IT'S JUST SO COLD IN THERE. I really think they could work on keeping the bathroom cleaner.", "author": "M J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-05", "description": "Service was unacceptable. Food was okay-nothing special-but no mistakes.\n\nAfter eating we were asked to move, which was fine. We moved the table out of its original spot anyways, so as two servers we understood. \n\nWe decided to leave after moving the table back and looked around the door for a place to bring our plates. We both didn't see anywhere so we stacked our plates and headed out. Three steps out the door and a yell comes from behind the counter, \"WILL YOU BUSS YOUR TABLE!\" \n\nI guess we missed the little hole in the area that looked like it was just for sugar and utensils. Regardless, this was unacceptable.\n\nIf you are looking for nice people with better food (because why wouldn't you) I recommend going two blocks over to Java on Ocean.", "author": "Luke R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "Uhm yeah wow why did I give this place only 4 stars before? I'm hooked.\n\nThis place is walking distance from CCSF, but if you really gotta take the K or drive, then by all means go for it. But the walk there is actually really nice, especially in the morning when you gotta wake up, like me. It's a small quaint little cafe near 24 hour fitness. Inside you'll find small tables, two sets of couches by the window, and a long table for people to share. There's a very homely atmosphere here, great for catching up with a pal or to study up and read.\n\nThe menu is fairly vast, serving coffee and tea, smoothies, salads and sandwiches, and pastries. The workers are very attentitive. They work fast and help you through the menu if you ask them. \n\nThis place serves some legit delicious coffee. I love coffee and have tried some places that serve the legit kind of coffee (not the kind at Starbucks, just saying) and this place has got it down. I love Chasing Lions at CCSF, but sometimes I gotta get around to other places. They serve drip coffee here and you can actually see them do it right by the register. Neato!\n\nI've had the following:\n- Caffe Mocha: this can be served in a cup if you're planning on staying, or in a paper cup to-go. Their mocha is very strong, the chocolate is rather prominent if anything. It's a warm and silky drink that isnt too hot, but it's warm enough to warm your insides on a cold day. If you have a sweet tooth and would prefer not to deal with the strong taste of coffee, this is your best bet.\n\n- Macchiato: this is preferably served if you are planning to stay in the cafe. Their traditional macchiato is served in a tiny glass cup, somewhat like a shot glass lol. This drink is pretty strong, they dont use too much cream and it goes straight down with a bitter cocoa taste. A preferable drink for those who can handle a few caffeine jitters. You can also take it to-go, but i believe thats a different macchiato.\n\n- Hot chocolate: what i really like about this place, is that they have drinks for kiddos too. Their hot chocolate is really smooth and has a hint of cream in it. Naturally the chocolate is dominant in taste, but it goes down nicely.\n\nLATTE ART. They do that here. It's pretty cool, if you show them a picture they may actually try to make it. But I am satisfied with the classic leaf latte art :). They accept cash and card whooop! \n\nI think i might frequent this place more. When i try their other drinks i will update this review heh.", "author": "Jerianne G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "So I decided to stop here for a cup of tea since it was quite cold out. I decided on a vanilla bean tea which was very good. The atmosphere here is more of a casual environment. There are quite a few students here since a college is very near by. Overall a great experience and great prices I will definelty be back.", "author": "Asseret B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-23", "description": "Consistently poor service. Obviously being courteous and welcoming to customers is not a priority. Wish it was because everything else at this place is great.", "author": "Edward H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "BEWARE: THIEVES STEAL LAPTOPS HERE!! Not the business' fault as they do have HD cameras installed but I've been here on two separate occasions and both times saw someone come in and steal someone's computer from right in front of them! Very scary and sad :(\n\nAnyways...onto a more positive topic, I love the food here! Their sandwiches are deliciousssss and incredibly generous portions/pricing. Faves are the North Beach (Portobello Mushroom, Goat cheese, sun-dried tomatos, onions, spinach) and the Vegan Falafel with Hummus!\n\nTheir coffee is super strong (a bit too bitter for me) but I do love the spacious workspace here and the wifi and ample outlets.", "author": "Jingxi Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-07", "description": "Ordered a panini and coffee.  The coffee was great.\n\nThe panini came with the following ingredients noted on the menu: salami, provolone, tomato, spinach, and red onion.  I ordered it without cheese.  However, they also put mustard which I absolutely hate.  Other items on the menu note that they have mustard or other sauces, but this panini did not.\n\nWhen I asked them to remake it they refused, and the owner (? person in charge) got very upset and inferred that I 'should have known', which was extremely rude.  Eventually was able to get them to refund me but did not provide any type of receipt.  Here's hoping I don't have to contest the charge.\n\n2/5: +1 star for the friendliness of the other workers, +1 for the coffee, -2 for service, and -1 for inaccurate menu. Won't be coming back unfortunately.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-22", "description": "Good spot n good Americano but after not coming back for so long, I gave it another shot to see if things have changed. Not really, same reason why I stopped coming-the music. The rap and hip hop playlist is filled with inappropriate songs including swearing. I tried to drown it out w headphones but music is a bit loud. Difficult to work so I'm going to where old ppl go-a quiet cafe with quiet music.", "author": "Mark H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "I really like this place. This cafe has a lot of natural sunlight. It's not hard to find parking. Always have good service. It has a decent crowd of customers. A lot of people study or hang out there. I personally don't drink coffee, but they have a good selection for tea.  Decent cafe food was well. \n\nThis is a good place for people who want to read and relax.", "author": "Rachael C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-01", "description": "My boyfriend and I usually come here on mornings about once every other week. Recently we came by here one morning to get some coffee and egg & cheese croissants (the only things we ever order here). After ordering, we waited about 20 minutes with no egg & cheese croissant called up. We have ordered them many times before and we know that it does not take that long to make, even on a busy morning. He went up to remind the folks behind the register that we ordered food, after which they assured us that they'd be coming up soon. We waited about 10-15 minutes longer to no avail. In the meantime, we observed other customers' drinks and food getting served (including sandwiches and a *plain* croissant). I hate to bring the race angle into it, but it should be said that my boyfriend was the only black guy in the cafe and we were the only mixed race couple. I'm willing to give the employees the benefit of the doubt, but it's hard not to feel singled out when everyone else seems to be quickly served except us.\n\nAnyway, we ended up just getting a refund with no explanation as to what had occurred. I don't know if new management is to blame, but this just really put a dent in our morning. I used to love this cafe and I didn't want to give a negative review. I also work in customer service, so I sympathize with how tough it could get sometimes. Yet I also just wanted to somehow get my voice out to let the establishment know that these basic requirements were not met, our experience was unsatisfactory, and our morning routine was completely thrown off. We will not be returning.", "author": "Lyzette G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-09", "description": "My first experience at fog lifter's was when I got a hot chocolate. It tasted like dish water with a bit of cocoa mixed in. Couldn't finish it. 1/5\n\nI decided to try it again and got another hot chocolate with extra chocolate. This was 3297598% better. It was super yummy and they added whipped cream on top (which they did not do the first time). I guess the quality of the drinks depends on who makes it. \n\nAlso got a lox bagel and they ran out of bagels so they used a croissant instead....\n\nWifi is a-okay as well. It disconnected a couple times but other than that, it's fine.\n\nTip: Do not eat outside food in there. I learned the hard way. :P\n\nALSO, REMEMBER TO CALL AND ASK WHAT TIMES THEY ARE OPEN ON HOLIDAYS BECAUSE THEY DO NOT UPDATE THEIR YELP VERY OFTEN!", "author": "Anna H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-05", "description": "Good coffee and good cookie, but the customer service was lacking. Way too pushy to get us out the door after we paid left tip and there was still 30 minutes left.. loud and unnecessary reminder that 15 minutes remaining and restroom was \"closed.\"  Not cool, bro, I had to pee (coffee). \n\nPoor customer service.", "author": "Jingo Django J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "It's a rare occasion to find a spacious coffee shop in San Francisco. It's even rarer to find it not completely full! The bf and I stopped by here today because we were looking for free wifi (password: garlic14) and the quaint \"Fog Liter\" cafe came up in our search results -high ratings, Blue Bottle drip coffee, outlets and tables? I'm sold! \n\nIt's 2 in the afternoon on a beautifully lit, overcast Saturday and this place isn't overpacked. Big tables - great for groups of 6, solo comfy sofa chairs, and tiny circle tables for two; choose whatever suits you best! There are still vacant chairs and a regular flow of customers coming in and going out. People are reading the newspaper, books, on their laptops and iPads (me on my phone typing this review out) while sippin on delicious blue bottle caffe. They have some chill music with good beats playing. I feel very relaxed - I'd love to study here if I was a student. \n\nPROS\n-As mentioned before, free wifi! \n-Comfy sofa chairs \n-Friendly baristas\n-Restroom included - if it's locked then that means someone is inside\n-Tons of outlets so bring your chargers!\n-They serve good here too! Sandwiches, soups, bagels... Yeah the dude next to me just ordered a Lox bagel and said \"you guys are too good to me\" upon picking it up. Pretty cute if you ask me. \n\nIf I'm back in this part of town looking for a place to chill, I'm stopping by here :)", "author": "Grace J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-23", "description": "Called several times to place in an order but no one picked up. There were 3 people working when I got there and they weren't busy. I knew my panini would take a while and sure enough, I sat there for a while waiting for it. Ugh \n\nOrdered the salmon panini and it was super salty. It has capers which is the cause of the high salt content but instead of just a few, if basically covered the bread and was spilling out. Portion is filling.\n\nLots of pastries, cookies and drink on the menu. They also have salads.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "I ordered 7 bagels for take out one day for a morning meeting. I placed the order over the phone and surprising in ten minutes I got a call letting me know my bagels were ready. Not sure if they do this on a regular basis, but I really appreciated the call ! *Thumps up ! \n\nOh ! & the bagels were also yummy ! I ordered jalapeño with plain cream cheese and also blueberry with plain cream cheese :D", "author": "Samantha Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "Unpretentious little cafe where one is not required to genuflect at the feet of the Himalayan coffee gods. I prefer my iced coffee with chicory not unlike an Oxford comma: to wit, a way to make things better that is not extrajudicially enforced.\n\nTry the quiche. They both microwave it but then use a hovering panini press to crisp the filigreed edges. Delectable.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-22", "description": "Fog Litter is a nice place to chill on Ocean Ave. A community table, a couple of smaller ones, and sofas. Overall a very laid back feel, with friendly baristas.\n\nI've a half an hour to kill and enjoyed my Blue Bottle based AMERICANO ($3) as well as a fresh donut.\n\nThis place is frequented by locals and the student folks at CCSF. Not much parking available but worth the walk if you're stranded in the area.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "A nice quaint small business cafe shop on Ocean Ave. \n\nI went in on a Saturday morning and it was packed! Probably because of college kids are preparing for their finals and yoga students from the studio down the block called Yoga Flow just finished their morning ritual. I got their organic chai latte - it's spicy and yummy goodness!\n\nThe service is great, w/ like 4-5 girls handling the register, making the food, and mixing the drinks. Parking is hard to find but I was lucky enough to park on that 10-minute only parking!", "author": "Jan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "It's a great atmosphere for studying, good music. Not super crowded and lots of tables to sit at. Good wifi, very easy to study. Lots of tables. They have a good menu and they were very friendly/good customer service.", "author": "Clara D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-11", "description": "On my latest trip to Fog Lifter, I sat in the middle community table. This table is perfectly located to catch a really severe cross breeze that makes me feel like it's a Chicago winter (COLD!). I felt compelled to downgrade my review after my latest experience. \n\nI left my parka at home today so I tried closing the door. The chef came over and told me to leave the door open for ventilation! I get that it can get stuffy but this lead me to believe that the kitchen doesn't have an adequate ventilation system. This made me think of one word... UPGRADE.\n\nUPGRADE THE VENTILATION SYSTEM! On my last visit visit, I overheard the owner saying he clears like thousands a day on food alone.. So, I know it's not for a lack of revenue. \n\nThe food is decent and the coffee is decent but at least Greenhouse doesn't make me feel like I'm going to catch hypothermia.\n\nFor the record, the ends of the room might not be as windy. I just can't believe how a successful coffee shop be inadequately retrofitted. I'll be back.. but with my winter coat.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-05", "description": "The cold brewed coffee is so delicious and probably my favorite drink here. It's brewed in some 24-hour long process, giving it a very bold and non-bitter (in my opinion) taste. However, there is a limited supply of cold brew coffee available each day, so come early and snag a cup! \n\nIt is also worth mentioning that they use high-quality coffee beans for all their drinks, including Blue Bottle and Sightglass (I think they rotate) :) \n\nDrinks aside, this is an awesome place to camp out with your laptop! Great natural lighting, lots of tables, abundant outlets, fast wifi, never too crowded, good choice of music, enough (free) street parking 1-2 blocks away. Definitely one of my go-to cafes to work in the immediate area.", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "This cafe lifts the fog as well as my spirits!\n\nThis is a nice spot to get work done with their free wifi, ample seating and tables, caffeine, and good food.\n\nTheir sandwiches are all deliciously made with quality ingredients. My favorite is the smoke turkey provolone with hickory-smoked turkey breast, provolone, organic spinach, tomato, and a pesto aioli. Their bread choices include wheat and dutch crunch. I enjoy how filling and tasty yet healthy their sandwiches are.\n\nTheir chai latte is also good. Milk options include whole, nonfat, almond, and soy. Thumbs up for latte art, too!\n\nI also got their blueberry monster smoothie once. The texture was a bit chalky to me, and I'm not too keen on getting it again.\n\nI'll definitely be back for their sandwiches and wifi!", "author": "Tanya A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-27", "description": "I go here only when I have to. The menu is nice the sandwiches are ok. But the pricing of the drinks are a bit high. I mean, a good latte is great but let's be reasonable as well. The seating is decent. I especially like the big cushioned seats. Nice place to go to chill and read. It gets crowded quickly as well. My recommendation is to go grab a cup sit outside and relax.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-16", "description": "Updated. It's been a year since I've been here. Unfortunately the new staff are very rude, unfriendly and not kind. \n\nSad, but I won't be be coming back here again.", "author": "Amira G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-05", "description": "I'll be honest, I had a hard time figuring out all the hype. Was the coffee good? Yes. We also had smoothies, which were definitely tasty.\n\nThe tough part is that I felt like I waited too long for my coffee. I totally dig and understand the whole trendy \"drip-style\" coffee, but the allure wore off after waiting in line for so long. If I had to guess, I would say that I waited for 10 minutes, before getting to the counter. At the counter, I waited another 3 minutes to be acknowledged. After that initial wait, the employees were friendly and kind.\n\nI agree with the other reviews... If you're looking for a place to read or study, look no further. Order your coffee and expect a wait time longer than normal.\n\nIf you're looking for a quick, Starbucks type of experience, this is not the place for you.\n\nI'll be back, but I'll be sure to choose a time when I'm not in a rush!", "author": "Brian F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-13", "description": "I was in the area to pick up a package and wanted to check out local cafes that were laptop and WiFi friendly.  Fog Lifter is right across the street from the gym and there's plenty of neighborhood parking, so I figured it would be a solid choice to camp at for a while.\n\nTheir menu looked pretty good and I needed lunch so I opted for a sandwich.  I ordered a turkey and provolone sandwich, which took forever to deliver.  There was also no provolone in it, but did come with a lash hair.  I was so disappointed by the experience that I probably will never order another sandwich here again, instead opting for one of their prepackaged items like drinks.  I would have taken it back except I really didn't get the sense that the girl behind the counter cared so I just dealt with it.  In retrospect I should have sent it back.\n\nService was really unfriendly and I was definitely not getting a good vibe from the grungy cashier girl.  The WiFi is decent though and there's plenty of places to sit, which make it an appealing place for students to study.  I'll try other cafes before finding my way back here next time.\n\nFood: 4/10\n\nService: 4/10\n\nPrice: $\n\nAtmosphere: 6/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-20", "description": "Nice little shop, but apparently they don't carry change. Didn't even get to order anything.", "author": "Jacob M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Fog Lifter Cafe is the perfect place to spend time and get work done on a sunny day! Right off the K Line in Ingleside, the Fog Lifter cafe is extremely accessible, yet not overly crowded.\n\nWhen looking for a place to be productive, I have three criteria: space, food, and connectivity. The Fog Lifter Cafe meets all three! The food is pretty on point. The coffee options are what you'd expect from an establishment in San Francisco (pour over etc) and they have great bagel sandwiches for lunch. Additionally, there is free wifi, enough outlets, and plenty of tables to make oneself comfortable. \n\nFor the floating student or employee, I definitely recommend adding Fog Lifter Cafe to your list of cafes!", "author": "Sophia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Great cafe with quality food and drink. You definitely get what you pay for at the Fog-Lifter. \n\nAmbience = cozy and warm, interesting locally built tables and benches\nWaitstaff = friendly and efficient\nLocation = great, right off the K-Ingleside, limited car parking, but I've always found free spots.\nWifi = strong and clear\n\nCould you ask for more from a coffee shop?", "author": "B. A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "Nice and cozy cafe on Ocean Ave.  Stopped by on a chilly afternoon with the other half.  Neither of us are coffee drinkers, so we both opted for tea.  They serve Mighty Tea Leaf.  I got the herbal ginger and he got the green tea.  $2.50/cup.  Good amount of seating, huge windows for lots of natural light and nice tunes.  Parking can be hit or miss but we ended up in the residential area.  Location is across the street from the 24 Hour Fitness and Target.", "author": "Liv A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "I live in the neighborhood and have been here more than a few times. I've seen a lot of reviews that have complained about the people working there but I've never experienced any attitude or bad service. Their coffee is good and they don't mind customers hanging out for a while using their free WiFi.", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "\"All Day Breakfast\" and great service all day. Coffee made by the cup. WiFi and some places to plug-in for power. Good overhead lighting and indirect light through big, unobstructed Windows. Friendly locals frequent this cafe. Indoor seating for over 50, and a few tables might be outside at the sidewalk.\nLOCATION: Free street parking everywhere and metered spaces on Ocean Avenue.\nSERVICE: They aim to satisfy and I see a lot if smiling going on. \nSANITATION: Very clean. The bathroom key thing is necessary. Simply return it using a paper towel to keep your hands clean. \nDISABILITIES: I have never seen any obstructions on the sidewalk. The entrance has double doors. There are no steps in the customer access areas. \nMENU: Posted on the wall.\nBeverages: Hot from the Barista and cold from the chill box. Araciba coffees.\nDECORATIONS: Tasteful and complete. Nothing distracting and there is some art to admire.", "author": "The Adv G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-03", "description": "For the Sunday afternoon counter help, the finer points of making an iced mocha are evidently much less compelling than the details of their personal lives. This I judge by the volume and length of their commentary on same, and the ridiculous near-10 min. it took them to make a simple drink. \n  \"Be the star of your own life,\" said a wise man once, implying that to do so was necessary and also sufficient. These two, instead of treating customers like interlopers in their conjoined one-woman shows, ought to take that message to heart.\n\nWhat emerged from this loud and long production was a weak concoction, light on flavor. Its price wasn't posted on the menu board, but was ring up at a rich $4.50", "author": "John H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "Great coffee and I also got the smoke turkey provolone which was delish!!!\n\nVery nice place to study and chill.\n\nStaff was friendly and service was fast.\nparking sucked, but hey, its on the street.\nPrice was good and so was the food.", "author": "Roger A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "I have been coming to Fog Lifter for several months now. When I left the neighborhood, my biggest loss was being so close to this great place. Bummer!\n\nI still come back at least a couple of times a month, from North Beach and plenty of nice coffee options. So you know my 5 stars matter. :)\n\nThe Fog Lifter crew always remembers me and Brillo (Service Dog/ person helper professional)! Every employee strikes me as friendly and invested. The 2 kind-hearted and efficient gals who ask about Brillo, you always make my day. And the chef makes great grub, with such a warm attitude. *blush*\n\nYes, the coffee's good! Sight Glass brand, hook me up! I like their white chocolate mocha, vanilla iced coffee, or a simple coffee straight-up (I add the extras). Chai lattes are yum: spicy goodness.\n\nDo order the tasty yet simple grilled cheese (made by the awesome chef)! The soup option changes, I have enjoyed it every time. I think you can try a small sample cup, but yeah you want it. The sandwiches are great (and big). Cookies and such are available, too.\n\nThe atmosphere is casual and relaxed. Always clean. Lots of laptops and books, but friendly strangers readily share tables. It's got a communal feel.\n\nIndoor/ outdoor seating options. Music usually playing, various genres.", "author": "Mary S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-13", "description": "I live around the corner from this coffee shop.  I've, frequented it several times.  The food is pretty tasty, the  However, the coffee is really acidic and way to strong considering I like strong coffee.  I've actually vomited twice after drinking their coffee believe it or not.  And if I didn't throw up I felt very nauseous. I have a strong stomach too.  If your there for food I'd say go but don't risk the coffee.", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-21", "description": "I came to study at this Cafe on 8/21/2016, around 2PM. I needed to use the restroom, so I ask the guy at the counter if I can get the key to use the restroom. He told me, I couldn't use the restroom cause I haven't bought anything. I told him I would be buying something later as I would be there for a couple of hours studying. He said I couldn't use the restroom which I thought was crazy, but it's their rules. I sit down to study and he came over and told me I had to leave cause I haven't bought anything. I wasn't bothering anyone in the Cafe, which wasn't even half full, with plenty of seats for people to sit. I got up and left and went to another Cafe!", "author": "James H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-05", "description": "I might increase my review later, as I'd like to work out of here more often. Parking is plentiful (around the corner and down the block is all-day parking). \n\nThe coffee is decent, but when you already start with blue bottle coffee its hard to mess it up. Blue Bottle coffee without the crazy lines that happen downtown! That plus a relatively comfortable place to work and strong WiFi makes me inclined to come here more often.\n\nI'm just a little iffy based on staff here. Staff in general are cool. They run your orders pretty quickly, and from my best guess are probably students. They're just not the most customer-service oriented or...for lack of better words, professional. \n\nWhen I got my coffee, I was relatively friendly and the staff was...not. But I don't need bubbles and smiles all the time. It just felt a little curt/rude when I don't believe I did anything wrong. Hell, for a $3.50 coffee, I tipped $1. They were also complaining about what I can only assume was a yelp review, as the female behind the counter mentioned \"flagging it\" several times, as evidently the review was about her. But...maybe there's a reason this girl was mentioned in a previous review. \n\nI'd normally bump this place to a 4 star, because its a place I WOULD like to return to (though...if I come back and get mean service, I'd hazard a guess that they found out who I am and is not pleased). I'm bumping down because...of unprofessional demeanor. \n\nIt looked like someone had left a jacket, as this female staff skipped over to a table and loudly exclaimed \"someone left their jacket!\" Then. She promptly puts on the jacket. And sniffs it. \n\nUmm. No. I'm sorry. If someone left an item, you should only take it to the back or a safe place and hold it in hopes the person comes back. Feel free to wear and sniff if the jacket's been there for a month or even a WEEK and no one's returned to claim it. But. To wear someone's jacket who left it there for maybe an hour? No.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-05", "description": "Me and my husband have been going to this place over 3 years. I can't believe what just happened today with the girl behind the counter kick us out in front of everyone and yelled at us because of our service Dog. \nMy husband it is a Veteran and we have the dog certified by the VA which allow us to take the dog even in airplanes. This person that made us the sandwiches calls herself \"Manager\" I am completely discussed in state this here folks, but I have to take out of my frustration somewhere and thanks to Yelp that everyone can see this including the owner- having someone like that in your business watch out before you go broke and lose your customers. \nShe even state don't come back here anymore (seriously) because of my service dog? She looked back at us psychotic and tried to get physically aggressive over us and the dog. I almost called the cops on her and the other girl behind the counter was encouraging her to fight. \nI hope the owner of the shop replies this to me or I will take legal action based on this unacceptable behavior from someone like this. She completely disrespect a United States Veteran with disability. I don't know who trained her as a \"Manager\" and said she knows the law and bla bla bla. NO YOU don't know the law and you don't know how to treat people. The time we were there was exactly 12:35 of August 5th 2016. I would love an explanation from the owners on this one feel free to contact me. I hope the owners will do something about the rude staff they have on board before someone close your business \n          \n  2011 0334309-00 FOG LIFTER CAFE, THE 03/21/2011 21-MAR-11  \n    1901 OCEAN AVENUE      \n    SAN FRANCISCO, CA 94112      \n    ------------------------------------------------------      \n  Owner SWIRKY JAWAD H   21-MAR-11  \n    SWIRKY MARIA   21-MAR-11", "author": "Gilmar G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-06", "description": "The coffee is ok. My cup was cold, which is surprising for manual drip. The service, however, was the worst experience I have had in a long time.\n\nI went in at about 7:30 am on 8/5/16. First off the woman who made my bagel threw it on the counter for me to pick up. Then she and her coworker thought it was hilarious to loudly start laughing at a homeless man that was standing on the corner (I have been in this neighborhood for six years. That guy is very sweet and is very mentally ill). They were making really gross, demeaning comments, pointing loudly, and shouting stuff like \"stay off drugs!\" I turned around and started to defend the man, and then the main barista or cashier (African American gal wearing a ridiculous shirt that said something amongst the lines of -I kid you not-\"thanks for giving me your little petty opinion\") said \"why are you giving us your opinion?\"  I dropped it then and walked out. I don't understand how such ignorant, disgusting people are allowed to work in this place. It's okay to have different opinions about homelessness and the like but making fun of mentally ill people is never ok. \n\nAfter reading some other reviews, including a woman who was harshly kicked out for having a service animal, I will never return to such a pathetic establishment that has no interest in being a good part of our growing community and is more devoted to discriminating against folks and serving subpar food.", "author": "Ana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "Decent food.  Nice people at the counter.  Clean.  Coffee drinks are pretty good.  Warm and pleasant ambiance.  \n\nOne star off for the Tip Jar, which bears a sign urging us to tip, and then bullying us: \"Do Not Be Rude.\"  I am a generous tipper and these people earn their tips.  But I simply cannot tip when being admonished in advance.  Doesn't work for me.", "author": "Ernest F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "Fog Lifter is one of my favorite cafes to study at in the area. They serve Blue Bottle Coffee, have delicious lattes and mochas, and offer an extensive menu of salads, sandwiches, and pastries. \n\nThere are plenty of seats, with tables for two, comfy couches by the window, or a long table that's perfect for groups or sharing with fellow cafe-goers. \n\nThe cafe boasts a nice clean and bright space with few distractions inside and the corner location and large windows allow for abundant people watching and lots of natural light. Friendly employees and free wi-fi are the icing on the cake. A great neighborhood cafe and a highlight of Ocean Avenue!", "author": "Deanna Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-20", "description": "Horrible service.\n\nI used to be a loyal customer - I live very and close and it was my go-to spot. Now I avoid this cafe at all costs due to the very rude staff. The girls who work there greet you with extremely bad attitudes and are not friendly whatsoever (you'd think they'd understand what customer service means). \n\nToday I witnessed the \"chef\" get into a verbal altercation with a customer b/c this customer wanted change and they wouldn't break his $5 bill for him. \n\nWith my own personal experience, every time I ask the cashier a question she responds with very rude and demeaning remarks. I understand the owner is probably thankful for his new \"manager\" so he doesn't have to be around as often, but they are driving customers away! And it looks like I'm not the only person who feels this way.\n\nAlso, I made a yelp account today just so I could post this review. I've never felt so offended.", "author": "Janelle E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "Great coffee, nice people, cool decoration, good seating, fast WiFi. \nThey have very high quality coffee and they brew very well. Never tried the food though.", "author": "Michelle J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "Great environment for getting work done. Great music and helpful staff. Pro tip: they will make any sandwich into a wrap.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "Spacious cafe with many open tables. Not too loud or quiet. Suitable environment for studying & Free wifi!", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-04", "description": "Don't know what they're doing half the time. Long waits for an order they are going to mess up anyway. I'm not writing this because of one bad experience. Maybe if I order slower they will get it right. After waiting so long for my screwed up orders the last thing I'd want to do is wait even longer for them to fix it(probably would screw that up too). How hard is it? This place is not even that busy when they mess up orders and it's 9/10 times they mess mine up. So I'm done here for now.", "author": "Lev D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-07", "description": "Horrible service. Ordered panini took almost 25 min for them to inform us they were out of roast beef. I then ordered a quice...took over 20 min to get that and when I did it was cold! SERIOUSLY?  NEVER AGAIN", "author": "Kathy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-05", "description": "Vegan falafel was awful for 8.15 not enough filling.. they are only good for coffee. Service was good, just very disappointed in the food. It was terrible, i will never eat here again..", "author": "Shaun L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-29", "description": "I have been here several times, but seriously doubt I will be back after the way I was treated by the young lady with the just below shoulder length dirty blonde hair working on Dec 29th just after 1pm.\nDear owner- if you read this, you might want to talk to her. If she is treating other people as rudely as me, she is costing you business.", "author": "Jon M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-28", "description": "They are super coffee snobs. Extremely Rude. Made me feel extremely bad. Straight up just said no to what I wanted . I'm not homeless.  I was clothed. There was no reason why I couldn't get my order to go even if it's served cafe only. First of all dumb rule. Second, have a better attitude when trying to educate me... Who are they to tell me how I should drink my drink?!!!! I couldn't believe the customer service. It's just freakin coffee people!!!! Stupid hipsters behind the counter had terrible attitudes. Horrible. I'll never go there again. As I was leaving there was another lady who was walking out saying \"you know?! I come here all the time! You can't treat me like that!\" Huh...", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Very great cafe! Great service and the food is always great. The coffee is pretty amazing as well. Atmosphere is also very comfortable and relaxing", "author": "Rudy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "Fog Lifter Cafe does not literally lift the dreaded fog on Ocean Avenue, but they do lift your spirits in the midst of a busy week!\n\nServing Blue Bottle Coffee from early bird morning to evening dusk, Fog Lifter provides the much needed boost to any travelers in the fog. Weary wanderers can also find a hot sandwich here if the weather gets too cold outside.\n\nMy favorite thing from this cafe is actually their coffee cup caps. It's smooth and steady to the lips, optimally designed to enhance your coffee drinking experience. There are ample space in the cafe for dwellers to study, hang out, or simple to wait for the fog to lift. Pretty cool place to say the least. \n\nBut when CCSF loses it's accreditation, many surrounding businesses like Fog Lifter may be put to sleep from the reduced traffic. Let's hope this little cafe has enough caffeine up it's brewers to stay awake through the tough times.", "author": "Ringo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "Came by July 4th morning, and surprise, they were open!\n\nI was visiting home for the weekend (living/working in LA now) and was craving some delicious coffee before starting the day. After searching through yelp and with the recommendation of a friend, we were advised to try Fog Lifter Cafe since they serve Blue Bottle Coffee. \n\nI ended up ordering a almond milk latte. The drink was perfection Perfect aroma, nice roast, the right amount of foam, none of that burnt taste. \n\nI was really happy with my choice and my friend got a lox bagel that was really generous on the salmon.\n\nIf i'm ever back in Sf visiting my neighborhood, i'll definitely stop by. It seems like a nice place to study.", "author": "Diane T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-11", "description": "Nice cafe with wood floors and plenty of wooden tables & chairs. Free WiFi and nice staff who are willing and able to customize your food or drinks however you may want it.\n\nHowever, the 3 star review is primarily for what I ordered (I'm sure other things may be great from what I've seen of other reviews). The chai latte was only a bit warm, not hot, kinda diluted tasting, and served with too much foam. The apricot bar was alright, although it was tougher to chew than I was expecting.\n\nOtherwise, it's a great space to study or meet up with a friend.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "Fog lifter is my go-to when I need to get some work done in an active environment. I enjoy their smoothies and pour over coffees. They are always featuring a pretty decent blend. I sometimes stop in after a workout and pick up a sandwich as well. Their omelette bagel is delicious, as well as the eggplant panini! You can add avocados/tomatoes for an added bonus. There is plenty of seating, both indoors and out. I just wish they had better connectivity to their wifi! :(", "author": "Sarin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "I love this neighborhood coffee shop.  The food is great, the pastries amazing, the breakfast sandwiches/bagels on point.  The staff is awesome.  The coffee is on point. It's really a perfect combination of things that make this my go-to place for coffee/breakfast.  I come here then take the muni across the street to work, making the start to my day as pleasant as can be :).", "author": "Ghizal A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-03", "description": "Nice little cafe if you need to get some work done and don't want to go to an overcrowded Starbucks. It's spacious and plenty of tables to choose from. \n\nThe coffee is okay. They stopped serving Blue Bottle Coffee though. The food is good and filling if you need a bite. There's a variety of sandwiches to choose from. My boyfriend always gets their fruit smoothies, which are good. \n\nParking might be tricky, as it is on a busy street like Ocean. But, there's always residential parking that lasts 2 hours, I believe. So if you don't mind the walk, park there for free!", "author": "Liezel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "For anyone looking for a study/reading spot that's easily accessible by public transportation and not too far from both City College and SF State, Fog Lifter is a great option. The cafe has a variety of caffeinated beverages for those of you looking for an energy boost (they've switched from serving Blue Bottle coffee to Sightglass in recent months - freshly brewed) in addition to a great selection of sandwiches, salads, breakfast items, and pastries. \n\nEvery time I come here there's ample seating (both inside and outside especially with a relatively new parklet right out front) for anyone looking to camp out and beastmode for a few hours before an exam. The staff is friendly and they're always got an incredibly diverse music playlist going, which is pretty fascinating (today included Ben Howard, Avril Lavigne, and a Mongolian throat-singing ballad just to name a few)! \n\nAll in all, great natural light, prime location, reasonably priced food and beverages (with an impressive selection both hot and cold), and free wifi. Fog Lifter is a great addition to the Ocean Avenue neighborhood and hopefully won't be leaving anytime soon!", "author": "Cheston W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-30", "description": "Good:\nSlow Drip Coffee is rather delicious\nBruce Cost Ginger Ale (Jasmine flavor? Didn't taste any jasmine though)\nMusic (Italian circus-like. Gotta learn the name for it. Think Cirque du Soliel)\n\nNot so much:\nOat bar (pretty dry)\nSlow wi-fi (password: garlic14)", "author": "Alice R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "Great place to work on your papers, school work or just write.  Good coffee.  Good number of tables and chairs.  But they need more outlets.", "author": "Nicole V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "I come here every weekend with my bf. There's plenty of tables and chairs and outlets to charge your phone/laptop. We LOVE the almond milk chai tea latte, lox bagel, pastrami panini, and the salmon avocado panini. Besides the great food and drinks the staff is always really friendly which is a huge plus. :]", "author": "MissChelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-06", "description": "I really like this place - this was not my first experience and definitely not last. \nI think the biggest attraction for me was ambience of the place, it's welcoming and friendly, works equally as a refuge on a cold and rainy day and a nice open space on sunny warm day with tables outside to enjoy the Sun. You can find all different kinds of people there - students with their laptops and books, girlfriend meeting up for coffee, a family having breakfast (at least 3 generations from what I could tell), a passer-by coming in for a cup of a delicious Blue Bottle coffee... and me - just stopping by to get some good coffee and breakfast/ snack/ light dinner. \nTried so far - Coffee! yes, Coffee! pastries are OK, but focus on their quiches and sandwiches.  The nice \"feature\" about this place - they listen, they customize, they smile and they make it happen! not on the menu - not a problem as long as they have ingredients to make it (or at least my experience has been like that).", "author": "Marianna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "The fog lifter is one of my favorite places to get coffee or breakfast and study. The quality of food and drinks is awesome and the staff is always nice and friendly. They also have a really great chai that isn't too sweet or spicy.", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "Just a little bummed that they are not serving blue bottle coffee anymore but the sight glass that they are now serving ain't bad either! \n\nAnyhow,  I just love love love the vibe of this place ;)", "author": "Catrina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-23", "description": "I was only there to catch up with a friend. He got a drip brew and I got a chai latte with soy milk. It was nice and creamy and the right amount of sweet. \n\nIt's a quaint cafe, definitely a study spot type of place. Most of the people who were there seemed like they were there for a quiet work space. Staff was nice. My friend tells me it varies. They seemed to have a good selection of other teas and vegan snacks. \n\nI wouldn't mind going back.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "I love this spot. They have outdoor seating which is nice on a sunny day, and it's convenient for me because I live close and I love coming here to get some studying done or to grab a quick bite and some coffee. The coffee is really good and their sandwiches are delicious as well. The grilled chicken panini, turkey sandwich and Caesar chicken is delicious!", "author": "Tanya M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "In my opinion, this is one of the best coffee shops in the neighborhood. Located right off the K, right across 24-hour fitness, and reasonably close to City College, it's in a pretty prime location for just about anyone. It's a very cozy cafe for people who are catching up with a friend and a great study spot for people trying to get some work done. \n\nMore importantly, the coffee and food here is very good. I'm a huge fan of Blue Bottle coffee, and although it makes me a little sad to see Fog Lifter now using coffee from Sightglass, the coffee here is still very much worth it. Not to mention, the staff here is also super friendly and willing to help you out! Yes there are definitely better coffee shops elsewhere in the city, but still come check this place out because it's one of the better ones out in this part of the city.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Fog Lifter Cafe is a great little neighborhood cafe that serves some great coffee with some basic food options. I come here quite often when I am working remotely. There is free wi-fi and plenty of outlets. The place is comfortably full with neighbors reading or SFSU or CCSF students working. BART is not a far walk and the K passes by regularly. I have to say their new orleans iced coffee is my favorite in SF. They make any drink with almond milk, which is great for me (lactose free). Their food is sandwiches, smoothies, and salads and is pretty basic, but is made fresh and served hot (well not the smoothies because that would be gross). The service is pretty chill and I really love the music that they play. I'm serious, I have never had to put my headphones in here. It's great! The bathroom can be a little untidy at times, but nothing ever too gross. One thing I really enjoy about Fog Lifter is their variety in seating. They have community tables, small tables, and really cozy chairs. There is also a little cabinet with flyers for community events. It's just a really cozy and chill place to get gooooood coffee!", "author": "Isabella G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "This is a cute little cafe. Their vegan felafel is honestly amazing. They serve it warm which is perfect for rainy foggy days in the city. I originally came here to study but my laptop died so I was unable to. Yet, they have a lot of outlets so it's a plus when you remember to bring your laptop charger. Overall great customer service plus friendly vegan food that's cheap around CCSF campus.", "author": "Jazmine Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-01", "description": "This is a great and cute little coffee shop. I come here to do homework most of the time. lots of space, plugs, and the staffs are amazing. Super super nice people. two stars minus only because it's always f***ing cold and loud music quiet distracting. The food is also kinda pricy. but hey, it's a cute neighborhood coffee shop. Great coffee, btw.", "author": "Thyra K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-23", "description": "Friendly service. Fresh bagels and lox. Overall a great place to start off your morning. \nAnd a very relaxed vibe with local neighborhood peeps.", "author": "The Foodie O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-23", "description": "The coffee is good but the service and people are rude. I would not recommend this place for people that like nice service. RUDE RUDE RUDE.!!!!!!!\nAlso you have to buy something before using the bathroom that's just not right. I will buy some sheeeezzzzz.", "author": "Oscar T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Definitely the best coffee shop in the neighborhood. They sell good quality coffee. I had their iced coffee: which they cold brew with added chicory. Not my cup of tea as I like regular cold brewed. \n\nCame here on a Sunday morning (around 10) and no seating. So my bf and I sat outside. Luckily it was nice and sunny. I kept an eye on the barista so I can pickup my sandwiches when it was ready. He went out of the way to serve us instead; that was really nice of him. \n\nThe sandwiches were decent. Delicious enough, but not a must-order. I would definitely come back again.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-28", "description": "I would give zero stars if possible. I came in after my workout. The cashier with a beard was extremely rude, snatched the money out of my hand. He was so rude I did not even want to eat here.", "author": "Maira R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "Beats Starbucks, peet's and Tully anyway.\nMy regular is mocha! Back anytime anyway!\nNice music and great friendly community around.\nRight on Ocean and very convenient. Cute bike shop also next door, \nTatoos anyone?  also right next door!", "author": "Bob W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-06", "description": "Glad to see a decent coffee shop in the area. The prior shops didn't have quality coffee so the space was always empty, until now.\n\nFog lifter did smtg right. Quality coffee, lounge seating, wifi ~ simple combination and customers come filling up this place every weekend.\n\nThey even have a nice parklet for additional seating outside. Nice touch!", "author": "Ju D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-25", "description": "Fog Lifter Cafe:\n\n+ good, Blue Bottle drip coffee\n+ nice food selection. i had an Everything bagel w/ a Sundried Tomato spread that I believe was mixed in-house; tasted decent.\n+ great place to study or relax (clean, comfortable, open space; plenty of seating and large tables; quiet)\n+ nice service", "author": "Diane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "Wonderful service from a friendly team no matter what time I come in. Fog Lifter has one of the most affordable capuccinos in the neighborhood, unlike those jerks at Java On Ocean Coffee House whose owner rips people off and charged me like $5 for a tasteless cappucino. That being said, the truth is that I do not  keep coming back over to Fog Lifter Cafe because is cheaper than its competitors, I keep coming back due to the friendly staff this shop has. I haven't seen a single frown on an employee face, doesn't matter if I come early in the morning or in the afternoon a few minutes before the time the shop closes.", "author": "Sylvester C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-14", "description": "I used to come here often but recently the quality of service and food has dropped. Portions have gotten smaller and the staff has been slow. After waiting 20 mins for my food they forgot my smoothie order, no apology or anything and no sense of urgency. While waiting for my food there were several staff just standing around doing nothing. Finally after 5 mins I get my drink and again not a single apology about the long wait. I would have appreciated them telling me how long my order would take or if there is a back up of orders.", "author": "Jonathon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-09", "description": "I got out of YogaFlow and decided to stop by and grab a latte.  The downfall is that it's a one size cup across the board, thus their gluten-free chocolate chip cookie was among fairly good.  The place is great to bring a laptop and work, but not for reading a book.  \nI have to say I like my latte foamy and the barista here nailed it!", "author": "Fabiola V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Never mind the displays of enticing cookies and pastries in the front, seductively beckoning to you in the morning when you're just trying to order a nice simple coffee. \n\nNever mind the coffee, the Blue Bottle drip coffee that makes you all warm and energized for the day, despite the fog rolling in every morning without fail, the coffee made by the baristas.\n\nNever mind the baristas, the coffee masters behind the counter who are so incredibly sweet and cheerful and nice, giving you wonderful \"Smile\" designs in your morning latte to remind you that life is wonderful. Actually, do mind that. \n\nAnd on a more helpful note, great Wi-Fi, spacious, delicious salads.", "author": "Mandy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "I grew up near this side of town so it makes me happy having Fog Lifter Cafe around! The owner and his pup are the sweetest! The coffee and food here is great! I usually go for their cold brew or soy latte.. it's perfect every time. Their yogurt parfaits are really really good! It sucks that I lay off the bread because they have wonderful looking sambos!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "Wow. Kick-ass. Gnarly (remember this word? ). As good as it gets.\n\n I miss this place greatly, because it was fundamental to my survival just a short time ago when I wasn't working. Let me tell you what makes this place so fan-f'n-tastic. The workers! So much character, always cheerful, and they know their coffee beans! I like everyone that works here and they all have their own distinct personalities so you'd think an acting troupe had invaded this shop! \n\nThis spot has it all, occasional live music, diverse recorded music (great list), corner window views of frequent Ocean Ave near-crashes with the Muni Metro, bad-ass buff dudes going into the 24HR fitness across the street (for the ladies); for the guys: gorgeous eager and inconspicuous-looking women nearby the gym. And if you want cool, older dudes living off a pension by sitting under parasols drunk on the sidewalk while listening to the Giants, yep, you have that too just up the street! Soccer moms, hipsters, and college students unite at this place where studying gets serious after 5 PM. \n\nWith a tattoo parlor, yoga rooms, Eastern and Western (medicinal) herbal remedy places surrounding this spot, your life will enthusiastically become an Ocean Ave Bubble. \n\nUpdate: they got a cozy parklet in front! Seats! \n\nWish there was more than one!", "author": "Peter F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "Wonderful customer service and delicious Salmon Avocado Panini !! This cafe is very cozy with comfy cushion chairs. It's very relaxing and it's been awhile since I've been to a cafe that hits me right in my heart. I will definitely come back. Great job guys!!", "author": "Karen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "This incredibly cozy cafe make me want to claim a spot and pass the hours. The incredibly friendly barista expertly hand crafted my Ethiopian slow pour coffee and told stories while she did. This is the kind of place to bring a friend for a quality conversation, to hole up with a good book, or even work on a project.\n\nI miss this place and am looking forward to going back. I stumbled across it through Yelp and am glad to be able to turn around and strengthen the profile. Well worth a visit.", "author": "Michael A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-28", "description": "Now serving Sightglass coffee.... the drip coffee was too acidic for me, and the cookie  was really sad. The gingersnap cookie was super old.. as it wasn't even chewy anymore.. more like very dry and crumbly. The pastries in the case also didn't look too appetizing... as they looked more than a day old. Place also closes at 7:00 on a friday night.... I had to relocate somewhere else to study. Not the best.", "author": "Eleana H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "I tried this place for the first time today and I have a cafe crush. As soon as I walked in I felt cozy and welcome. The staff was smiling and that's a nice change from the norm at a lot of cafes. I was planning on getting a latte and decided to ask the barista her favorite drink, and she recommended the almond milk cappuccino. I went for it and was SO glad I did. It was so rich, I couldn't believe it was almond milk. It was perfect! I also ordered an everything bagel with cream cheese and it really hit the spot. Unfortunately, I didn't have time to hang around, but I really wanted to. Lots of seating, plenty of it comfy looking, and a device on the wall telling you to go ahead and play your own music FOR FREE!! If I ever get around to writing that novel (about what, I have no idea), I will head to Fog Lifter to do it. I'm excited to have discovered this place!", "author": "Liz M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "Friendly service, great coffee varieties, and bathroom available for customers.  I always change up what coffee to get based on mood. Music is a nice compliment. Wait time is inevitable considering there's only 2 workers and sometimes 1. Some people need to be more patient.", "author": "Jinnie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "Selfishly, I am afraid to give this place five stars because it might get busier... love the chai; not too sweet for me.  It's a quaint place with comfy chairs and small tables to do work.  \n\nOne of my favorites.", "author": "Cass H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "Locally owned. Very classy. Generous hours and lovely food and coffee -- you can't ask for more. You will be welcomed here :)", "author": "B K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-05", "description": "~What happened? Maybe I caught Fog Lifter on a bad day, so don't go when it's crowded in the morning. I went for my new Orleans iced coffee and I was all excited, only to find that it tasted like dirty dish water and I couldn't even drink it. I was so sad, that used to be my favorite drink ever, so I forlornly threw my $3.50 wasted coffee drink in the trash and went to get an iced coffee at Quickly's for $1-sadly, it tasted better. Very nicepeopke and a great cafe normally.~", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-04", "description": "Excellent service by blond girl and dark hair guy!\n\nMochas come with TCHO chocolate, yes!! Excellent, Mocha on the second try.\nI sat here all of sunday studying (free wifi). outdoor & indoor seating was great. \nOrdered a quiche for $5 and it came with a salad, all delicious and fairly priced.\n\nnice crowd, not too busy, just enough. Great atmosphere.\n\nLoved it here.\n\nTheir cookies look like the BEST cookies on the planet. Try one and let me know how they are!\n\nAlso, they have blue bottle coffee", "author": "Grilled O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-21", "description": "Waited 25 minutes from placing order to getting food. We'd only ordered oatmeal and an egg and cheese croissant. Had a too sweet smoothie that tasted like they use syrup instead of fresh/frozen fruit. Staff was pleasant but overall a disappointing experience.", "author": "Linda P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "Good coffee drinks...and great sandwiches!  And I love the interior of this place...it's a great place to hang...something I wish I could do more often.  But...I have to confess.  I probably get treated better here than many as my daughter works here!  So...my review is biased...which is why I only am giving 4 stars...", "author": "Richard J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "I came in around 8:30am on a Tuesday, the staff was very friendly and smiley. Jenny was my barista and poured a delicious drip of one of Sightglass Coffee's darker roasts. You know it's a good cup of joe when you don't have to pour milk and sugar in it! The space is great for doing work or simply sitting and watching passerby's, the bathrooms were clean, and the condiment station was fully stocked. Pay a visit, you won't be disappointed!", "author": "Kimberly R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-25", "description": "Its a monday afternoon and I came in and the first thing I asked is if they have a restroom. someone helped me and handed me the key attached with humongous spoon. It put a smile on my face as the restroom is way decent for anyone to use. As I returned it, I was tryin to get something to drink and eat before I die myself from hunger. I stood there looking at the menu looking confused on the menu (if youre not a regular, which unfortunately I am not) and not even one offer from the staff to help me figure out what I want. I ended up getting something safe to get so I got myself a tea. cold weather, hot beverage.. boom. but thats not the end of it. As I didnt know that there are types of teas to choose from and their menu for the tea was another battle for me to fight on. I thought I won and its all over but, its just getting started. took me another minute to decide and this lady staff in front of me looked like she tired of her work or doesnt wanna work in there no more. blank staring me like \"order already.. geeez\" kinda face. I decided to get whatever and I decided to get a bagel for my tummy. suddenly she uttered, \"we dont do bagels no more\" and I was confused as I see lots of bagels in front of me and didnt fully understood what she mean so I asked her to repeat what she said and meant they dont toast or warm up the bagel no more. I flared up inside as I try to shout inside my head bout what kind of coffee shop is this who sells bagel but dont warm them up? but because im starving, theres no way i would hate and not eat a cold bagel. I could take the cold bagel cause im pretty sure shes colder than it and im happy im not getting her but the less colder bagel instead. she sounded surprise that I still want em even if they were cold. she has the look on her face that I am really making her work and its pissing her off. finalized everything and i thought its all done yet again, as I paid, i was asked for my signature and whooosh, she flipped the iPad in front of her and wow! if its not attached to the base of it, she wouldve sent it away flying. well, that all leaves me for not givin any tip. must be harsh for me as I know that I need to give tip but with all that, i cant. sorry but not sorry as she is not either. ate my food and left.", "author": "Ian N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "Decided to stop here after hitting up CVS across the way. \nI got the coffee and the zucchini bread-both delicious, and a nice balance of bitter and sweet. I am really digging the drip coffee they made...\nI should stop here more often.", "author": "Rose M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-21", "description": "Pour-over coffee from Sightglass! Tasty soups by Blue Dish Catering, including vegan and gluten free options, quality fresh made sammies like the salmon avocado panini and the chicken breast with melted provolone. The food is a notch above the rest and yet Fog Lifter Cafe doesn't put on airs. \n\nThis independent, cheerful hangout is a work place for locals, with WiFi and a chill enviro to hang out or catch up with a friend, read or surf and listen to some good tunes in the background. The art on the walls is all by locals and it's mostly for sale. \nFoglifter Cafe has a heart, you can feel the beat and it will win yours. I'm following on Twitter, are you?  @FoglifterCafe", "author": "Roanna Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-29", "description": "They only serve blue bottle coffee - in usual blue bottle one size only - and I'm not a blue bottle fan (tastes sour to me). Otherwise I'd give them an extra star. Food is ok, decent selection of pastries/sandwiches. Strengths are location and wifi.", "author": "p f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "Im back again with a lucky parking space in front. I ordered the sandwich panini with a cup of coffee for just over $11.00.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-20", "description": "I really do like this place. The only complaint I have is every time I come here for a sandwich or salad it takes forever. So if your in a hurry. Don't eat here. Everything else is perfect.", "author": "Dani G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-05", "description": "This was a new place that I found on my way to work.  I'm a fan of the parklet outside as it would be a great place to sit and relax on a nice sunny day.  The inside of the cafe is great too, with free wifi.\nTheir food and drinks were good.  I'd definitely come back to do work or study.", "author": "Serena L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-19", "description": "Staff here is extremely unhelpful.  Went in to do some work, wifi wasn't working, and they refused to reset the router or help in any way.", "author": "Hung N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-05", "description": "Laptop camper here. Fog Lifter Café took over a place I've camped at numerous times; it's still a good spot for camping (free wi-fi, outlets, quiet, easy parking) and lingering. I think it's the only place in the area that serves Blue Bottle Coffee. They have paninis, soup, smoothies and pastries.\n\n* West Coast scramble: Bagel with egg and cheese needed salt and pepper.  Greasy and bland.\n* Latte: it's Blue Bottle but the latte had a bitter aftertaste, not well made\n\nIt's spacious with plenty of small tables. I wouldn't go there on a warm day because the windows make it feel like a greenhouse inside. Best on foggy days.\n\nYou know you love me. X0 X0, laptop camper.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "Great cafe! Coffee here is really great and the place has a good layout for just hanging out and working / studying / relaxing. \n\nThis place is a real gem. The food is good too!", "author": "Sven S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "Chill vibe, Blue Bottle coffee (and a generous portion at that) -- great place. Lots of open space so great to work or have a meeting.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-01", "description": "I have been coming here for years after the gym for coffee. I finally tried the food and I have been missing out all these years!!!!! BOMB! I ordered the smoked salmon avocado on dutch, and it was so good I am craving one now. They use this delicious garlic spread that can make anything taste good, its awesome! Huge fan I will be ordering more for dine in and to go from here on out! If you are in the area, MUS TRY!", "author": "Ed S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "Latte was great, with cute latte art! Bagels were nothing special though.", "author": "Lexy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-27", "description": "I came here with my old dude friend.\nTwo old men sitting by the window having late morning coffee.\nThe dripping coffee was really good.\nI really liked the sesame bagel with smoked salmon.\nThe pastrami panini was awesome!\nThe service was friendly, comfortable seats and there is a clean bathroom and every thing but that's not all, there was more.\nA yoga studio up stairs! \nI saw many ladies holding a yoga-matt with yoga-outfit walking by! \nAnd few of them came in here to get smoothy or something.\nWhat a \"Yatta\" moment for a straight dirty old man! Mmmm, mmm\nSo, I was singing this song.\nI'm A Girl Watcher!\nBtw, I am not anti-gay.\n\nI'm a girl watcher\nI'm a girl watcher\nWatchin' girls go by\nMy, my, my\n\nI'm a girl watcher\nI'm a girl watcher\nHere comes one now\nMmmm, mmm, mmm\n\nI am just a dog\nWhen I threw away my toys\nI found a new pastime\nTo dwell on\n\nWhenever I detect\nMembers of the other sex\nI play the game I do so well, oh\n\nI'm a girl watcher\nI'm a girl watcher\nWatchin' girls go by\nMy, my, my\n\nI'm a girl watcher\nI'm a girl watcher\nHere comes one now\n\nHello there, female\nMy, my, but you do look swell\nCould you please walk\nA little slower\n\nI wonder if you know\nThat you're putting on a show\nCould you please walk\nA little closer\n\nI'm a girl watcher\nI'm a girl watcher\nWatchin' girls go by\nMy, my, my\n\nhttp://www.youtube.com/watch?v=raJWuz7qQVc\n\nGreat spot! I'll definitely go back!", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "Great neighborhood cafe. The sun-dried tomato spread bagel is amazing.", "author": "J. C. B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "This cafe serves Blue Bottle coffee and good quality teas.  The manual slow drip coffee filter cones were a nice touch. They appeared to have a good sandwich selection, and I'd like to go back and try for lunch.  Cool vibes, really helpful and friendly baristas, and cool spot to just chill solo or with a friend.  We were approached by one of the patron's doing research on happiness for a future book which led to interesting conversations.  Overall really enjoyed my experience, my hot tea, and the company.", "author": "Nova P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-15", "description": "I went here last Sunday with my fiancé. My fiancé ordered our food so they did not see me at the cashier. Very rude servers! I had to use the restroom & was told it's for customers only & I had to order to be able to use it coz it has keys etc.. I had to tell them I am a customer & the way the short frizzy hair woman with tattooes all over her body talked to me was so belittling.", "author": "Janie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-30", "description": "I really enjoy shops who use the Square as their operating system for their registers since I don't always carry cash with me. However, I know better than to pay with my card next time. \n\nI gave a small 15% tip for my purchase because the girl who helped us took in my order fairly quickly and the transaction went smoothly. There wasn't anything wrong with the food I ordered but they weren't anything special either. When my food finally came the staff didn't package up my food to go like I asked for which isn't a big deal but after packing up my food, they completely forgot about the second half of my order. \"Oh right...\" was their response and they produced the food not long after. \n\nNow I know to put in tips AFTER I receive my order even though ordering food to go usually doesn't require a tip. However, I cannot blame the staff entirely for their mistakes. There was a customer/friend/some ONE the staff knew on a personal level who was HANGING OUT and chit chatting with them (more like distracting them) as they were working. This guy had the need to station himself at the doorway where the staff walks in and out from behind the counter onto the cafe floor. When their barista was trying to deliver a cup of cappuccino to a customer, he had to maneuver himself to the side because this \"customer\" didn't understand to get the hell out of the way. \n\nCome on dude, seriously?? No matter what your relationship is with the staff, how could you not understand they were working?? The next time I visit the cafe I really hope not to see this customer again since his presence affected the staff's quality of service. Hang out with your friends outside of work, not as their working.", "author": "Fanny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-20", "description": "I live Downtown, nowhere near this cafe, I was with A friend yesterday driving by, asked if they could pull over real quick so I could just hop out & grab some java . . . . . . H O L Y  R U S T E D  M E T A L  B A T M A N!!!!!!!\n\nI took A picture of my beautiful chocolate/coffee heaven cause it had three little stars in the froth, pretty so pretty :o]\nI now know All about Blue Bottle, I wish Id gotten the name of the cute barrista w/the shaggy hair who created something almost too gorgeous to drink, so that I could praise him here. I have NEVER tasted A mocha this good & I have had some seriously fantastic delicious coffee in my time. \nNow I will forever be dreaming of fog lifters & most likely always  be trying to justify going all the way to the other side of town . . . . . . .  for coffee   lol\n\nOMG OMG update . . . . I just saw the Bunny pictures!!!!!!! Bunny Froth!!! Im jealous! Time to go back", "author": "A L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "I'm a student that goes to SFSU so not that far from the cafe however this place has an average tasting Mocha for my taste. Service the staff was welcoming and the prep time for my drink was not that long! The ambiance is just what a typical cafe should be like very cozy and calm. Lots of tables for everyone to find somewhere to sit and also very clean area c: this is my first time coming and I would say I would come back!", "author": "Jose J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "This place surprised me. The atmosphere was chill and quiet enough to do homework or study. I ordered a smoked turkey provolone panini. Honestly he sandwich didn't taste as good as it looked. They panini pressed it with the lettuce inside so the vegetables were all soggy. I gave the cafe a 4 star review for its environment. My friends bought the drinks and they enjoyed them and their deserts looked delicious.", "author": "Arthur O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-02", "description": "Did I really think getting out of the house and away from my normal distractions would really help me do my homework? \n\nI have been here for hours and all I've done is open the web page my homework instructions are written on. Never fails. Street parking was easy to find and free on Sunday. For a place called \"Fog Lifter\" it sure is located where the sun don't shine and its an amazingly nice and sunny day here in San Francisco. \n\nI got a Salmon Avocado Panini and a Mango Tango smoothie. For a $10 sandwich, I would expect real avocado instead of some weird watered down avocado spread. The sandwich was mediocre and over priced. The smoothie didn't seem like it was blended really well. The first half tasted only of yogurt and the second half tasted heavily of honey. Bleh. \n\nThey have the coolest \"pour over\" coffee maker. You get to watch them make it right before your eyes. As the guy working there said, \"Its like a coffee maker without the maker. I'm the maker.\" Haha. Service is okay, definitely wouldn't say friendly at all though. \n\nThe space is beautiful. Its one of the few nice places in the area. Its nice to finally see a good business located in this space after seeing countless ones open and close in a matter of months. Its huge and bright. Makes me feel like the beach should be across the street. \n\nFree Wifi is a plus but there was no paper towels or soap in the bathroom. Come on guys! Basic necessities here. \n\nI might check out Java on Ocean before coming back here but its good for what it is. I just wouldn't order anymore food.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-11", "description": "Nice atmospheric cafe in San Francisco's Ingleside district. The average hipster transplants should feel right at home here if they are craving a \"genuine\" SF experience thanks to the constant overcast and the intermittent rumbling of Muni street cars. Drinking PBR's in Dolores Park is still the gold standard, though.\n\nI've here twice to catch up on some work remotely, but I can only halfheartedly recommend this spot for studying since they sometime play jarring death metal music at volume levels which I consider above reasonable. There are a decent amount of plugs for your laptop, but not nearly enough to cover a majority of the tables. On that note, some of the tables are quite wobbly and need their legs adjusted.\n\nStill, this would be a great spot to meet up a friend for a quick hangout. Unfortunately the two times I was here, the coffee was sour. But their food smells good, though. Free WiFi is also a plus.", "author": "William C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "If you're looking to get work done in peace and quiet, Fog Lifter isn't ideal. The Muni train runs along the block and they play their music pretty loud. Otherwise, they have a pretty decent menu with variety of sandwiches and drinks. There is an ample amount of tables and seats which is great if you're meeting with a group of friends.", "author": "Glecie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-29", "description": "Finally, REAL coffee in this 'hood.  No more having to scramble up $1.65 for below sub-par, way below mediocre coffee. I'd rather pay double the price and come here for BLUE BOTTLE!!!\n\nImagine.. You can have Blue Bottle coffee right after the gym, or right before hopping on the Muni to get to work.\n\nHeavenly. \n\nWell, minus the MUNI part. \n\nThe owners are very friendly and they have done an amazing job remodeling this place. Love it.\n\nP.S. $5 minimum for credit/debit card! Just a reminder for those of you like me who don't carry much cash.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-09", "description": "30 mins for 2 bagels and dry oatmeal. I have been coming to this cafe ever since it opened. Not the first time I've received my order in an untimely manner. Bummed that the service continues to suck. I'll take my business to Philz up the street from now on.", "author": "Melissa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "I come here to study every once in a while. I love the iced white mocha and their sandwiches are pretty yummy as well. Dig the free wi-fi too! The workers are also super nice.\nStay away so that it doesn't become over-crowded! Please? :)", "author": "Karen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-13", "description": "I'm glad something like this finally opened up in the neighborhood! This place is a huge contrast to the cafe that was here previously, much more modern and welcoming. The quality of the coffee is better since they serve Blue Bottle coffee here and the pastries are DELICIOUS. Most of the pastries are from Sweet Mill, which I've never heard of  before but I'm a new fan now.\n\nThe location is excellent since it's right on the corner and the cafe has huge windows, allowing the light to really shine through so the space feels open. Ocean Avenue is a relatively quiet street and fellow patrons at the cafe tend to be mellow, so this place is an ideal place to do work. They do offer free wifi and there are several outlets around the cafe, although there could always be more. \n\nI usually don't hang out in cafes, usually just running in and out to grab coffee when I'm on the go, but I definitely see myself hanging out at this cafe regularly now since it's so close to my house and quiet enough for me to do work at.", "author": "Le D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-27", "description": "Bravo to Chelsea and Ryan!!!! Not so much for that one girl... Read on!\n\nWhy?\n\nOn Saturday (Jan 25, 14), my bf and I decided to find a new spot for us to get some work done with hopes to make this our new cafe. Like every serious person who likes to get out of the house, get work/study done, find a yummy and healthy cafe, with awesome wifi along with great smoothies/caffeine fix, bright, airy, lots of windows, open space, and friendly attentive staff that seems to really enjoy themselves? (Btw, we always drive by this cafe to and from WholeFoods and 24).\n\nHere's what happened. The bf and I knocked out a ton of work from 3-8pm closing. We were exhausted by the time we left, our brains were fried. We left and didn't realized till Sunday (yesterday morning) that my bf had left his laptop case, inside was the battery charger (super awesome battery charger that can charge multiple devices at once even iPad and laptop without having to recharge it after...I gave him for Christmas!!!). \n\nI called around 11am, someone answered that seemed very mellow and tired. I mentioned that we were the last of two couple that left before closing. I even in detailed told her where we were sitting (two square tables put together before the window table next to the armoire with magazines/flyers) told her my bf left his laptop case on the chair that he had tucked in. Not even a hold or, \"let me check,\" she just said (and I knew she didn't look for it).\"no there's nothing here.\" Great! She seemed unhelpful. Being that my bf is a patient man, he was understanding of their situation, (the bf: \"I remember retail, they're not going to look for it, they're busy or something.\")\n\nAnd me...I rarely take no for an answer, I called just about under 5 minutes later with hopes to speak to someone else that was more awake and helpful.\n\nI forgot her name but after asking questions she was one of the two girls that was tending the cafe on Saturday. I asked her the same, she said no and it wasn't there, but was more responsive and asked for my number in case she finds it. I asked if she was the girl with the beanie that closed and she said, \"no that was Chelsea I didn't close.\" I knew then she was the other girl that was there with Chelsea, but remembered it was only Chelsea closing and asking us if we needed to throw anything away from our table. I knew that if I talked to Chelsea she would have remembered us, after all there were only two couple that stayed till closing.\n\nWe then decided to stop by around 1pm or so. My bf went in and approached a guy name Ryan, and miraculously Ryan knew exactly what my bf had left and mentioned that Chelsea found it last night and Ryan opened the cafe earlier. Ryan went by the back area (kitchen) and my bf's laptop case and expensive battery charger was inside it! Viola! It was there! Maybe is was a miscommunication on some of the staff, but it was night and day between the 1st girl who answered, to the second girl, then Ryan in person. \n\nBravo to Ryan and Chelsea for not being dishonest and helpful. \n\nFrom the 5 hours of experience at Cafe Fog Lifter, although I didn't interact  much with Chelsea or come to the front register area (the bf took care of that for me), I'm an observer and being in the PR/Marketing field, Chelsea is good for your business. She was very interactive with everyone, she walked around the cafe, cleaning, changing the music station, making small talks and was overall a breath of fresh air to hear/see.\n\nMy bf and I plan to come back soon to thank Chelsea and hangout for a few hours and enjoy our day, maybe not work for too long this time.\n\nOh, I can't forget about their tasty and healthy choices of food, blue bottle coffe, drip coffee and cozy atmosphere. Fast wifi, too!\n\nAnyone can open a cafe, but not everyone is lucky enough to have it all. \n\nCheers!", "author": "Jules V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "First time at The Fog Lifter after passing by it every morning on the way work and the drip coffee was definitely better than expected. Def coming back some more.", "author": "Blossom W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "I always hit the Americanos up here.  I wonder which coffee they use in their espresso machine...also blue bottle... I dunno?  \n\nThe Americano is more consistently good than Java on Ocean up the street which is generally too watery.\n\nThe employees are super friendly and the place is clean and well laid out. It's almost a tad too sanitary/organized for a cafe!\n\nThey really need to turn the music down and change the channel though, not sure why they picked a steady stream of blasting pop music.  I rarely can find a seat and have never found a couch/armchair.  Other than that this place is a total winner.  Cool to sit al fresco on a nice day too!", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "I choose Fog Lifter out of the cafe's in this area of Ocean for the following reasons:\n\n1. Friendly service. I think the guys that work here are friendlier than some of the other cafes on Ocean which can be borderline clueless.\n2. 24Hour Fitness across the street. Sometimes a drip coffee is all the motivation you need.\n\nIf you come in have a quiche or a breakfast burrito. Ryan makes a great iced latté. An Ingleside neighborhood staple.", "author": "Charles S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "FINALLY! Thank you Fog Lifter for being the first decent, walkable coffee shop to open in my neighborhood. No offense to some of the other dingier businesses along Ocean...\n\n+ Good Blue Bottle Coffee\n+ Fast, free Wi-Fi\n+ Lots of outlets and tables\n+ A great study space\n+ Good cafe food\n+ A surprisingly bright and open space with big windows (to see the fog)\n\n- I wish you were open later than 8 pm\n- If you also had beer on tap, I'd love you even more", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "Me being a huge sucker for cafes in SF I decided to check this place out! Also a friend showed me their cute latte art which was a mega incentive for me to go! \n\nThe atmosphere is really chill, reminds me of the cafes back in South America! Staff is super friendly and dont make me feel rushed like a few places I have been to. \n\nThey serve blue bottle coffee so that was a big plus also drip coffee, I am sold!\n\nAlso their latte art is amazing! Each art is unique! Their food is really good too, I recommend the chicken breast panini! Super amazing and delish!! \n\nI will def come back here again!", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-22", "description": "You would think for a guy who comes here all the time that I would give the place a higher rating. I'm literally here every other day. I would love to give Fog Lifter at least 4 stars, but lately I've developed a love/hate relationship with the place.\n\nThe people who work there are great, friendly, and courteous. The internet is fantastic. The snacks and tea are decent, though just a smidge on the pricey side. The atmosphere is fantastic for chatting with random strangers or working and listening to great tunes. I've made friends with most of the employees there and had some great discussions on life and what not with them. \n\nSo here's the deal breaker. When I go to a place I don't want to be breathing the exhaust from what's being cooked and walk out of the place stinking to high hell. Especially, when I have to run out to an important meeting or something. Unfortunately, this has been happening all too often lately. I see a fan up near the ceiling and it doesn't get turned on to help with the ventilation. This is problematic and  I'm starting to loathe coming here. I hope they can solve the situation soon. \n\nI've been a loyal patron and my loyalty is being tested :(", "author": "Ehb T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "I am a regular here - mostly for the coffee and sometimes their bagel options. I started coming here after a bad experience with my previous cafe and am overall happy. That being said, it depends on the staff for me. I often come here in the morning before work and when the owner is in with his regular staff, I love this place. They know my order and are always very friendly. However, there is a specific girl who sometimes runs things and when she is there, I hate ordering. She's complimented my purse several times but never remembers my order. This morning I ordered an iced latte to bring on MUNI like I usually do and only after did she inform me that the cafe was out of straws and smiled as if it happened all the time.", "author": "Tatiana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-09", "description": "Love that they serve Blue Bottle Coffee here! \n\nI come here a lot to study. There are a lot of space available plus free wifi. Sometimes the wifi doesn't connect so you have to ask the staff to reset the router (happened to me a few times). So save your work, in case something happens! There's also plenty of free parking in the area so you don't have to worry about the meter. \n\nI like how it's also across from 24hr fitness. Makes it convenient when I want to get my homework & workout done on the same day.", "author": "Cara N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-23", "description": "I have never given any restaurant or business in general a bad review because quiet honestly I know how social media can ruin someone's reputation and I also understand that opinions are subjective. However, with that said, I couldn't ignore how I was treated today at Fog Lifter Cafe.  I come here at least 3x per week to get coffee for myself and bagels for the kids. Today, I went in with my 4 yo and ordered us lunch. When we sat down, my son noticed that there are samples of pound cake next to the register and asked me to grab him one little sample. He ate it and asked me to grab one more, when I took the second one, I was told (in a condescending way) that it's one per customer (to which I explained, I'm one costumer and my son is another costumer). Her attitude was beyond rude and when I came up to the \"supervisor\", Erica, her attitude wasn't any better. As I tried to explain to her that this is no way to treat a respectable/repeat customer, she basically walked away from me as if she doesn't hear what I'm saying. Neither my son or I ate our lunch (which I spent over $25 for and left a 20% tip), I paid prior to this incident, and we both walked out of there. I'm appalled by this. This is beyond rude and I have never been treated this way. I hope something is done about this, not for me as I will never step foot in that place, but so others don't get to experience what I experienced today.", "author": "Marina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "This place is one of my fave cafes. They have good food, a cool vibe, and a kind staff. Oh, and their drip coffee?! Dee-lish! I'll be back soon Fog Lifter!", "author": "Steph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-01", "description": "I am not a coffee drinker so I do not know how to judge on the quality of their coffee drinks so my rating is for other things that gives this cafe a 5 star rating.\n\nThe staff members are really nice! Nice and warm greeting when I order my drink and recieve my drink. Happy staff team shows they enjoy working there and makes the cafe environment even better.\n\nI come here to study and it is a good cafe to study in. Of course there are folks who get drinks and carry on conversations at the cafe, but it their conversations are not obviously loud or anything like that so volume wise, I can study here. Furthermore when people get phone calls (and they are considerate of other people at the cafe), they take their phone calls outside. Keep in mind, not everyone is that considerate and sometimes some folks do talk loudly and talk on their phones at the cafe too.\n\nThere are many tables and chairs available for meet ups, studying, etc. There are wall outlets to charge your devices. There are large windows so you can easily look outside.\n\nThe cafe is neatly and cleanly organized. The seating area, food preparation area, and the bathroom is clean. Clean places are always a thumb up for me!!\n\nEven though I am not a coffee drink, I do like the drinks I have tries so far: hot chocolate, dark roast drip coffee, and latte.\n\nLastly, this cafe is across the street from 24 hour so after my study session in the cafe, I walk across the street to the gym!", "author": "Shirley M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-19", "description": "Eh for the price and pretty limited selection of sandwiches/breakfast foods, it's a decent cafe to stop in and grab something. There wasn't a size option for my chai tea and it was quite expensive for the size.", "author": "Walt W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-07", "description": "This place is HORRIBLE! I was recommended by a friend and went in deciding to skip Noahs  for the first time for a lox bagel. BIG MISTAKE! The owner was at the register. I ordered the lox bagel. I asked if I could have half hummus and half cream cheese. The owner told me he didn't want to do it because the hummus was runny and sloppy when you put it on the bagel. I told him all they needed to do was cut it in half and do the spreads. So he rang it in. I asked for it scooped. He rolled his eyes... and rang that in. I could see is customer service skills lacked big time. He tells me the total is 10 something. The bagel was $7.75 plus he was charging me $2 for the hummus lol. Okay fine. I questioned the displayed price of the bagel. It said it was $6.75 for the entire lox bagel with everything.  He showed me the itemized pricing which said: $2 for the onion bagel, $4.75 for the lox and toppings and $1 for cream cheese which totaled $7.75.  The price that said LOX BAGEL with cucumbers, capers, red onions, lox and cream cheese read $6.75 and I was asking him why am I getting charged an extra $1 ? He said for the bagel. I explained to him the menu read LOX BAGEL with the toppings for $6.75 which means it comes with everything it says on his menu for $6.75.. nowhere does it say the bagel is extra. Then his employee behind him said \"that's what you get\" very rudely. Who owns a business  and allows their employees to bad mouth a customer?! I said nothing to her she looked like she came from a dumpster anyways, like she didnt shower. I asked him to honor the price it says. He said he would change it later but he's not going to do anything about it now and can't change the price.. I told him I run restaurants for a living and when we advertise something on our menu for a price we have to honor it and that's what his menu read. IT GETS BETTER!  He then turns around pointing to a sign saying he is refusing service to me and has the right to... After being rude to me as a first time customer, trying to be lazy just because hummus gets gloppy, rolling his eyes, letting his employee badger me, false advertising, not honoring posted prices he then refuses service to me. I have written one yelp review in my life but  told him I would write one as i proceed to walk out. OH FOR SURE. And as im walking out he continues to yell at me saying \"oh yea?! another yelp review!\" I have never in my life experienced anyone so miserable that acts like that to someone who is starting their day and contributing to their business. It was the most horrifying experience i have ever had. I have been in the restaurant industry managing fast casual to huge 400 seating fine dining restaurants for the last 15 years with hundreds of employees. If I could give 0 stars would. He and his staff lack serious customer service and business skills. No wonder they are stuck working at a coffee shop. Needless to say I will NEVER go back again and I am going to spread the word that false advertising, attitude and allowing your staff to attack your customer is not the way you run your business. Customers help your business stay afloat. They are in your house. You honor what you advertise and you give service with a smile. Customer service is about a happy business exchange. You people should learn the key to customer service which is believe, listen, apologize,satisfy, and thank and I definitely did not get any of that. For every one customer that has a bad experience, they are going to tell as many people as they can not to go there. As a business, fighting over a $1 to keep all the customers you would be losing is not worth  it... that's REAL business thinking. Now look, here I am writing a yelp review because of how I was treated when it could have been easily resolved if they knew how to handle the situation. They keep it going that way they will eventually go under. Greed is not the way you execute. Karma will come back to bite them. UNPROFESSIONAL.  I went to Java Beach Cafe they are better SERVICE FOOD  and PRICES and with a smile", "author": "Nory M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-10", "description": "I came here one Sunday night to their open mic, and I was pleased. I liked their mocha latte with foam on top. The atmosphere was warm and welcoming with the employees being super nice and helpful. I suggest giving the employees a little extra tip. I hope they have more open mic nights.", "author": "Paul V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-09", "description": "Friendly service. Good cup of joe. Pick up a quick breakfast or juice.  Nice bright space.", "author": "Heather R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-01", "description": "Clearing the fog.\n\nWoke up with one of those will I ever wake up feelings.\n\nOne Blue Bottle themed Americano from Fog Lifter gave me my answer: Yes. Appreciated the extra shot of sugar free vanilla when I said it needed more.\n\nSipped between bites of a lowfat yogurt parfait topped with boysenberries. Perfect.\n\nSeeing as this yelp is coming at 4am might be back again tomorrow.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-01", "description": "Sweet spot of chilling: 1-2 hours\n\nIf you are trying to squeeze this in while waiting for your muni, you will miss the train. Not the fastest most efficient place, very small business type processes. That can be nice for some. But not for a yuppie commuter. Neighborhood desperately needs a Starbucks. We have 2 cannabis dispensaries but no Starbucks for Christ Sakes! \n\nWhere this place soars: If you like hipsterish new age-y music and want to hear music that you heard in DRIVE or on HBO's Girls then this place is the right energy.", "author": "Nathaniel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-16", "description": "This place is so inviting and great to sit in. I'm not a big coffee drinker, so I can't speak to that, but their chai lattes are so good (when the right person makes them).\n\nI've come in here a couple times to study, and I've felt so comfortable. The WiFi is good, the people are really chill, they have food should get hungry. I ordered an avocado and salmon panini, and it was delicious.\n\nMy only complaint is that sometimes the music is too loud and tends on the weird side. I guess it depends on who's in charge that day, but once a song started out with 30 seconds of just static-y whispering, which drove me insane.", "author": "Trisha K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "I tested out this cafe because I need a place to be productive and as a student at CCSF this place was a contender because of it's proximity and let me tell you I loved it!  They have plenty of seating, and the tables are beautiful. They have a fair amount of outlets so if you're typing an essay you can stay here for a bit. \n\nI bought a vanilla tea and an apricot square so I wouldn't feel like a freeloader and they were both delicious. In order to pay with a card you have to spend over $5 or $6 and if you get what I ordered then you're good to go. \n\nA couple of other yelpers mentioned that the music is a bit loud. I don't have this problem. I went there to read my textbooks and I had absolutely no problems concentrating, and there was a decent amount of people and the noise level was still fine for me. \n\nAll in all I love this place!", "author": "Cristina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-06", "description": "I am such a fan of this place. Great food and coffee to fuel your work sessions. Lots of light. The most friendly crowd that regulars the place and the staff is THE NICEST and most sweet. They're very thoughtful and just genuinely cool personalities. They seem to all get along which makes it even more of an enjoyable place to be. \n\nI'm a fan. \n\nI usually get the Salmon Avocado Panini as a salad - delicious.", "author": "Courtney P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-10", "description": "They refuse to let u order expresso  to-go,  you must drink it in-house. New policy they implemented. i used come here all the time and i always ordered my expresso to go. I mean for $3, you'd think it would cover a cup to go. I don't  understand this reasoning and won't be back until this changes.", "author": "Aych K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-12", "description": "I stopped for lunch in this area last week and was lured by a window sign saying here saying they serve Blue Bottle coffee here. I read the buzz about this label elsewhere on Yelp and had to give it a try.\n\nThey served four different brews, and I was recommended the Bella Donovan brew as a first-timer. It was good, will make me want to try the other ones when I'm around this area.\n\nThey also serve sandwiches, soup, and such here. It looks like a good place for those also during lunch.", "author": "H K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-27", "description": ". Great location and good drink options. However They have forgotten to put my order through two separate times in the past month, leaving me to wait around until finally I get up and remind them", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "I absolutely love this cafe. So glad it moved in the neighborhood. Really brings up the moral. Love the Blue bottle coffee and the friendly service and clean beautiful atmosphere. If you near ocean avenue looking for coffee it's worth skipping Starbucks!!", "author": "Missy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "Delicious coffee and food. The staff are friendly and knowledgable about their food. \n\nI had the north beach panini with portobello mushroom and it was delicious! I've also had the Mediterranean one with spinach. I'm not a vegetarian but they are SOOO delicious I could be! \n\nI'm a Starbucks fan but am more than happy to support a local business as terrific as this one!", "author": "Melinda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-16", "description": "It was a nice coffee shop. Only problem is every time I go there, they forget my order. I end up waiting 30 to 40 minutes for a bagel and even when I tried to change my order, they didn't refund my money. Coffee didn't taste that great to me, maybe I'll give this place another shot but I'm not rushing to this cafe for coffee and breakfast since they disappointed me twice.", "author": "Alyssa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-04", "description": "I live so close to this cute coffee house, and I love to do my work here. The cafe they serve always surprise me. There's one time I got a bear on top of my mocha, and i got a bonny another time!! They totally made my day. But because I go here often, so I noticed that not everyone will do the special shape....kind pity!\nI love here, but I have to say sometimes the cooking smell is a little bit annoyed to me, and it's chill inside, so I always wear my coat on. Even they have those drawbacks, here is still my first choice! :)", "author": "Vicki F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "Great location on Ocean. They have a parklet in front, are right across from my gym (24 hr), and serve sightglass! Prices are very reasonable. What more does one need?Service friendly, casual. Crowd casual, laptopers, and neighborhood regulars, students likely from City College. I had a Gibraltar rightfully served in cafe only. It was great. I have visited other cafes in the area, but this hits my sweet spot in quality beans, convenient location, great space.", "author": "E. W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-02", "description": "This was a disappointment. My chai latte tastes like steamed milk with barely any chai, if any. The carrot cake, however, was quite tasty and sweet. I just wish I had ordered a coffee instead. $3.50 for that chai was not worth it at all :(", "author": "Anna O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-12", "description": "Great place to get some great coffee and also another reason why Ocean Ave is pickin' up as one of the cool spots to hang out and/or study. \n\nObviously as you can tell by many of the reviews here that the coffee is sourced from blue bottle and surprisingly priced quite nicely. The espresso is fantastic, brewed with a wonderfully creamy head and their regular coffees are brewed by the cup (which is a superb method, making every cup unique and perfect). But this isn't a blue bottle review! \n\nAnyway the owner is a real swell guy (and I'm not just sayin' that cause he's also my neighbor haha) who was at the front when the store just opened. Now its manned by a motley crew of baristas who, although quite efficient at what they do, are a bit on the icey side. For being people who work at coffee shops, they often look as if they could use a cup themselves now and again. Someone noted in their review below that they are sort of mean hipsters...I wouldn't go that far but I would recommend that they certainly work on bringing energy to what they do. \n\n(I, being a poor college student, also find myself working as a barista so I know the importance of a good attitude and demeanor when making coffee for folks in need of their own perk up)\n\nThe sandwiches are really fantastic too: fresh ingredients, well made, and sizable. Can't complain. \n\nPlace offers wifi to go with their brew and also occasionally host great live music so I recommend stickin' around and havin' a chill out as you might get lucky and see some live music! \n\nIn summation: great coffee, great food, great vibe. -1 star for rather lack luster employees.\n\nDefinitely a recommended place!", "author": "Dzu N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-13", "description": "Overall, I enjoyed this cafe. The coffee was nice but not quite standard blue bottle quality. I like the free wifi...I recommend they lower the volume of music. \n\nThe staff is nice. :)", "author": "Mr. Bill S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-27", "description": "Always out of something.... bagels , turkey etc. Coffee use to be good but recently it has been a weird acidic flavor. Use to go because it was close by but I think I would prefer Starbucks ( which is eehhh too) but at least I know what I am getting.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-25", "description": "I've lived around this area for over 25 years, but I never visited this place before today. I always go to the Vietnamese restaurant across the street for lunch. The other day we passed by again and I said to my daughter, lets go there next time. So, today we gave it a try. Just like most cafes, there are a lot of young people with laptops and stuff. We went there after lunch time, so there were plenty of seats available for the three of us. We ordered 3 panini (North beach, Roast Beef and Chicken) for each of us and a drink. It was very hot today, we didnt get any hot drinks. I'll definitely try the coffees next time. So, we ordered our food and the total came up more than I expected.. Then I asked the lady for the receipt, but she didn't give it to me, i don't know why. Well, I thought, let me talk to my son, maybe I was wrong. We only ordered 3 sandwiches and 1 ice tea, and I paid over $35??? The panini is no more than $8 each, plus an ice tea, $35? Then, my son went to the counter, picked up the food and asked the lady about it. She looked into the computer and then realized she pushed the wrong button. I was overpaid by $8. I'm happy I got the money. Later, the lady came to our table and apologize for the mistake she did. I thought that was kinda nice. I bet she already said sorry to my son, so it wasn't necessary to apologize to me again. I really appreciate for her attitude. Well, the panini was so delicious. It was big. I thought I was going to save the other half for later, but we all ended up finish everything. It was so good, that I forgot to take a picture!! Any way, we will definitely go back for Salmon panini and coffee drinks.", "author": "The Black Cat C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-07", "description": "Cute cafe with wifi. Parking in the area isnt' great. Had the quite and it didn't have much flavor. great service though.", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-22", "description": "It's nice this cafe but prices seem steep esp for sunset Merced area. Coffee string but nice.", "author": "obgyn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-19", "description": "Great coffee.  \n\nGreat yogurt parfait with fresh cut strawberries.\n\nAwesome service.", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-12", "description": "Close to City College, BLUE BOTTLE COFFEE FOLKS!\n\nNice Staff, Good Atmosphere for studying, Great food (bit overpriced), yummy pastries, and good accessible WIFI \nNothing bad to say about this place, recommend this place to anyone", "author": "Mary D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-06", "description": "I've been to fog lifter a couple of times, not because I chose to, but because my friends were raving about blue bottle coffee. \n\nIf you want something quick and fast, this is not the place to go. Thankfully, the times I've been here, I had to work for a couple of hours. The reasoning behind my thinking is that because they take so long to produce mediocre coffee and food. Yes, the food is pretty fresh but every time I order a sandwich or a bagel, they are always out of my first choice... Really??? The blue bottle coffee was also mediocre and sloppily served... After all the hype I've read, this place doesn't deserve it.\n\nService was less than mediocre. Okay, I get it, hipsters hang out here, but do hipsters servers have to be a snob and apathetic to the customers. Every time they took my order,  I can sense that they think they are too cool to be taking patrons' orders. I, the customer, has to muster up that energy and smile to make myself feel better and maybe put a smile on the barista's face.\n\nI tried and I did give the establishments multiple chances before I decided to write such an unsatisfactory review...", "author": "Anette N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-07", "description": "This cafe is conveniently located right by the yoga studio which is great should I ever require a substantial pick me up afterwards. I haven't wandered in here too often but the service has been solid but the chai latte is a bit too sweet to make it a go-to drink.", "author": "Shauna S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-21", "description": "Had a great Cafe Latte here with a croissant sandwich \nI like they way the did drip coffee here.", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-03", "description": "Others' complaints are that the staff is not friendly and extremely rude.  I think this is an understatement - they take no prisoners!  \"Huh\" is a popular entry in their limited vernacular. They don't know how to properly drip coffee.  And can't tell you the county of origin.  They used to serve Blue Bottle before they ended wholesaling.  Too bad, because no one knew how to prepare it.  They have served me stale - as in \"HARD\" - baked goods.  I ordered a soup once . . .  the owner said it was very good.  It may have been \"very good\" about a month before I ordered it; the texture was mush.  (I can take exception since I do have functioning teeth, in sufficient quantity).  I asked the barista - the type you wouldn't take home to meet mama - if I need a key for the rest room.  She is no slave to fashion and I think she hides a whip under her apron.  \"It's closed, we have to clean it, there are only two of us . . . I don't know when it opens . . .\"  Not what my kidneys wanted to hear.  She obviously had gestapo training. \n\nI think the staff is docked half pay if they smile.\n\nNot my idea of what a cafe should be.  Adios amigos . . .", "author": "Richard D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Got a drip coffee and granola with yogurt and fruit.. If I could have it every day I would. The coffee was great and the granola was fresh and amazing. Great independent coffee shop!", "author": "RN S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-25", "description": "Great place to study, blue bottle coffee, free wi-fi, tasty sandwiches and a lot of different snacks to choose from.\n\nToo bad they close early.", "author": "M W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "I have no complaints about this spot. It's great to have a spot like this that I can walk to in less than 5 minutes. Staff is super cool and they know how to make coffee; whether a drip or espresso drink, they do it well. What makes this spot really special, are the people that work here and are regulars. I WFH, so I have made this my second office. I finally tried the McLifter and it was delicious.", "author": "Eucalyptus J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-06", "description": "The name Fog Lifter Cafe is somewhat of a misnomer. The fog is settling around the coffee shop as I type this.\n\nEven though they should rethink their name, this coffee shop is a decent place to sit and drink a cup of coffee. Most of the tables only seat two people, so it is probably best on your own or with a friend and not a big study group. Plenty of people sitting on their laptops or reading the newspaper. Bonus: power outlets that are reachable from most of the tables.\n\nBlue Bottle drip coffee is $2.25, while not the cheapest cup of coffee, the slow drip is a nice touch.", "author": "Annaliese D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-15", "description": "I'm really sad about how things are going at Fog Lifter Cafe. I still go, but have learned to not do anything on the internet there because it frequently kicks you off and I recently lost a lot of work. \nAlso, the coffee, particularly the drip is very bitter. Not sure why.\n\nSad face.", "author": "Dbs B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-09", "description": "Always see this place when going to the gym. Finally came with my friend after dinner across the street. We were greeted upon arrival which is a refreshing thing to experience. I ordered the blueberry monster but was told that they couldn't make the monster and instead offered a mixed berry substitute. Not bad but would still have preferred a full blueberry drink. My friend got a latte which tasted a little coffee bitter to me. All under 8 bucks.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-08", "description": "Welcome to the neighborhood,  Fog Lifter Cafe!  I stopped by this morning...opening day... and it's immediately apparent the new owner has done a great job of modernizing the place! (formerly Kings Coffee)  Airy, bright...plenty of tables inside and out.. free wi-fi, plasma t.v, newspapers, and a very energized team behind the counter!      Absolutely delicious pastries ( I swooned over their fabulicious apricot crumb cake) and they feature Blue Bottle Coffee!    More blends arriving soon (including a special Turkish blend with frest mint coming I'm keen on sampling) said the charming owner/barrista  who made my coffee this a.m!    \n\nThe Fog Lifter Cafe is located on the corner of Ocean & Ashton Aves....just across the street from the 24 Hour Sport on Ocean Ave! This place should do well with the foot traffic, the gym members and SFSU and CCSF just blocks away!\n\nCheck it out!!!!", "author": "Karen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-22", "description": "That is some great coffee, and the smoked salmon avocado sandwich rocked. Best part was the word 'smile' written in the foam of my latte. I was forced to follow its instruction...", "author": "Robert H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-18", "description": "Excellent and convenient coffee shop on an otherwise bleak stretch of Ocean Ave. Staff is uniformly friendly and professional and there's usually tons of space if you're looking to linger. Vegan cookies are a plus.", "author": "Albert S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-05", "description": "Man, I am so bummed to write this review but I wanted to share my experience.\n\nI've been SO EXCITED for Fog Lifter to open up!  I live right up the street and I planned on making it my daily morning stop on my way to work.\n\nI went in a week or two ago and my excitement promptly fizzled.\n\nI walked up to the counter and there were only two other customers in there-- a girl on her laptop at a table, and a guy ordering at the counter in front of me.  I stood behind him a bit, and looked over the menu while I was waiting to be helped.\n\nThe guy in front of me wasn't buying anything, it turns out.  He was standing there chatting with a man I have to assume is the owner.  He was standing at the cash register, but he was going on and on about how fresh his ingredients are and how proud he is of his cafe, so I'm pretty sure he's the owner.\n\nCool, I'm all for pride in your work!\n\nSo I wait.  And wait.  And I'm being completely ignored by the owner who is so into talking about how his cafe is the best place in the world that he can't even say hello to me or ask one of the guys behind the counter to help me.  So I wait more.  And wait.  And wait.\n\nFinally one of the other workers noticed me and took my coffee order.  He was super friendly and nice, cracking jokes while he helped me.  I liked that.  The one star in this review is for that guy.\n\nWhat I didn't like was all this time the owner STILL hasn't even acknowledged I'm there, and the poor guy helping me had to physically MOVE the owner out of the way in order to ring me up.\n\nOh, and the icing on the cake?  The owner was SLAMMING other local businesses.  It's one thing to be proud of what you do and your cafe, but he did NOT need to mentally go down Ocean Ave and put down almost every single other business on the street, naming names and saying you're so much better than they are.  Real classy.\n\nThat was my first impression, and it will also be my last.  I won't be stepping foot in there ever again, I'll simply take my daily business elsewhere.  (You know, to one of those other local business that were talked about so unprofessionally!)", "author": "Tamara N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-13", "description": "I am still loving this place! I stopped by recently and enjoyed another wonderful cup of coffee and opted for a ham and cheese croissant. All was fabulous. I grabbed a table and knocked out a paper for class. \n\nThe atmosphere is picking up here! The staff was quick and efficient, everything looked fresh, and the place is spotless! This place looks top notch from the outside too, especially at dark. Glad the neighborhood is getting more options with this level of quality and service. \n\nI'll keep coming back!", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-16", "description": "I've gone back MANY times after my horrendous 4th of July experience.  I was REALLY angry that day.\n\nBut things have gotten better.  I stick with their Three Africans drip coffee and it's always solid.  One time I messed with a latte and iced coffee.. it wasn't all that great.  Plain cup of joe does it for me!\n\nTheir, \"big oat bar,\" is delicious.  It's a dry, not too sweet, and kinda plain (sounds kinda bland, huh? No...it's good!!)  which I really like with my coffee! Yum!", "author": "anita h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "Stepped in here today to get coffee. Lots of hip kids on their Macs, typing away. Friendly baristas, and plenty of seating.\n\nBlue Bottle coffee! :)", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "This place is awesome. The staff is very kind and genuine. They go the distance to help you create whatever you'd like (even stuff not on the menu) great food!", "author": "Erik B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "Pretty much my favorite cafe in the city.  I love the coffee, the food, the staff is always friendly and there are comfortable places to sit.  This is important to me.  Maybe more important than it should be, but here I am.", "author": "James F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "Very nice new place! There are two decent coffee places along Ocean, and this is one of them (the other is Java on Ocean). Their coffee and mochas are perfect, and the ambiance and setting is nice. It feels very open and inviting just when you're walking in, and the food they offer (though somewhat limited says my friend), is good, and made fresh. Because of this however, the service can be a little slow. It took a very long time for them to toast a bagel and put cream cheese on it when I went a few weeks ago, and I'm not sure if they've been able to speed it up at all.\n\nI'm optimistic however that any negative things (both in their service speed, and things said in the other reviews), will hopefully be resolved. This is a new business and kinks are going to be there to be ironed out. For what it's worth, this is a place to try.", "author": "Betsy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-02", "description": "One of my favorite cafes in the city! I like this cafe a lot, indeed, I have been so many times the employees are all very nice to the clients. I always order either a Chicken Panini or a Spinach and mushroom Quiche and I have never been disappointed with the food. They also have a great selection of pastries, cookies, muffins and other fattening delicacies that have been forcing me to stop by the 24 hour fitness around the corner - I need to burn those extra calories I get every time I visit this cafe. Those pastries are so tempting, at least in 3 or 4 occasions I was on my way to the gym and I decided to stop to grab a coffee and I ended up having coffee and cookies or other items and my plan to go to the gym was cancelled. I can blame them for the extra pounds I have put on during the last weekss, aside that, this coffee shop is among the best ones in the Bay Area.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "Good place to get sandwiches and coffee. \n\nWe work at home and the power went out a few months ago, and we simply moved to Fog Lifter and waited the power outage out. \n\nThe owner is really nice too and often takes your order and brings you your food.", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "I just keep finding myself back here. Why?! Well It  must be their killer coffee and laid back attitude. I swear I fell asleep here the other day and no one cared! Haven't really tried their food. This place used to be King's coffee shop about a year ago and that place was mediocre at best. The way they micro filter their coffee here makes the lattes super creamy and delish. Also it's right next to the best soup place in the 'set Pho Ha Tien! Hmm I  think I'm getting an idea for another review...", "author": "Matteo C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "Nice coffee shop on Ocean Ave. Clean, great coffee, lots of tables, good smoothies, and well lit work area. This is definitely better than the other coffee shops on Ocean.  Their staff is always ready to help, but they can working on their approachability and sincerity.\n\nIt seems that most of their things are a bit over priced.  On one occasion, I got a Vitamin Water there and was surprised they charged me $2.25 for the same size bottle that sells for around a dollar elsewhere.  On another occasion, I got a mocha and, although it was good, it was over priced.\n\nCleanliness, free wifi, and a good location definitely gives it 4 stars.", "author": "Joe Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-12", "description": "Walking distance from my brothers' house. Love visiting here for a delicious cappuccino and kids hot chocolate for my girls. Upscale touches without the cost! Very nice!", "author": "Gemilyn R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-16", "description": "They get 4 stars just for having Blue Bottle Coffee.  No fancy flavors just great coffee. My daughter & I shared the tuna pannini. The bread was toasted nice & crisp on the outside, warm & buttery on the inside. The tuna was full of flavor & not overly mayo-ed(yes, my word)to death. Interior of shop was very simple & neat. Newspapers to read, wi-fi to use or people to talk to. Glad to have a NEW coffee place other then the large chain places that think they make a good cup coffee.", "author": "M G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "Went in here 4 the first time today not bad altjough they were out of blue bottle coffee the owner assured me that he had something equally good. Not crowded came after hitting up 24 hour . The owner was pretty nice we chatted for a bit he has another cafe on cole st . It is nice to see something that has organic food & fresh salads in the hood.\n\nI will be back again....But ehhh step it up & order more coffee he sold out on the weekend it's monday Imma hit it again in the morning and we shall see", "author": "Kim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "My first visit to this nice local cafe was exceptional! They have a down to earth feel, and I appreciate the great customer service. I didn't wait long to order and they brought my order to my table. They are quaint in size, but I like that they are smaller and also not a chain cafe.", "author": "Cristin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-18", "description": "While waiting to get my haircut next door, I decided I need a pick me up for the morning. \n\nI ordered a mocha. The coffee in the mocha was a little watered down/not strong, but the beans were a perfect roast: not bitter at all, and flavorful. Chocolate flavor was slight but good distinct hint. It appears they use dark chocolate shavings. I would say the mocha is a bit over priced, but looking at the menu, everything else is actually really cheap (coffee only menu).\n\nOverall, it wasn't bad. Not the best mocha I've had, but I would come back to try their other coffee drinks. Like a lot of the coffee shops in the city, they specialize in organic/fair trade blends. They also carry Blue Bottle, which is awesome.", "author": "Marc T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-20", "description": "I understand the stuff is expensive but reusing grounds for multiple pour overs? I mentioned how sour my coffee tasted, who knows how many pour overs my grounds had seen, and was told \"you can always buy something else\".  Coffee snobbery on Ocean? Misplaced.", "author": "Stanley J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-23", "description": "Fantastic atmosphere, sunny and clean and very relaxing. \n\nThe internet is free, and so far very reliable. Lots of plugs along the wall. Perfect spot to get some work done while enjoying a coffee or sandwich.\n\nThe coffee and food are both great. I'll be back for sure. \n\nVery well put together considering it just opened. Welcome to the neighborhood!", "author": "James F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "This place serves blue bottle coffee and have a big open seating area. The coffee is good because it's blue bottle but lacks that coziness that you want in a rustic/ antique/ broken couch coffee shop that I find comfortable. The space is so open that u can hear everyone talking. I was the one catching up with my friend so I felt disruptive to all the rest of the people that were studying. \n\nOverall, a good experience but just not good enough to get a 5 star.", "author": "Hei Ming C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "Very nice black and white mocha, good wifi and a diverse (though yet, for me, untried) menu of food options.  The MUNI K train stops 1 block away at Ocean and Dorado / Jules, or it's about a 12 minute walk from the Balboa Park BART station along Ocean Ave.  Inside is clean, well-lit (even on a foggy day) with not-too-loud music playing.  I would caution laptop lovers out there that there aren't any terribly many plugs, though if you sit anywhere along the edge of the room you'll find a plug within about 6 feet.  Highly recommended!  Open till 8pm every night.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "I come here literally every weekend. This cafe is one of my favorite places in the city to relax and study. The environment is nice and chill, the staff is awesome, and the food is to die for. If you're a coffee addict or a college student this place is TOTALLY for you.", "author": "Alex J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-06", "description": "Cool staff, good coffee, lots of space and chairs and VEGAN cookies! Also vegan option falafel which I haven't tried yet but really cool place seriously.", "author": "Sara G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "I still love Fog Lifter, and the service here is great. I do miss the breakfast burritos though!", "author": "S E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-09", "description": "I live around the corner from this place, I m a big fan.", "author": "Alyssa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-10", "description": "meh...coffee grinds in an iced coffee nasty, so-so sandwiches and salads", "author": "Long C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-04", "description": "I like the atmosphere of this place, though I'm a bit disappointed with the strength of the chai latte. The flavor was super mild and I'm being honest when I say that I'd prefer a much stronger spice flavor. Maybe it was a fluke?", "author": "Alexandra R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-13", "description": "I get coffee from here at least twice a week. Staff is always pleasant, coffee is great. \nHowever, Sunday 8/11,  was a little different. Instead of my usual drip coffee, I ordered 2 sandwiches to go. It took 20 minutes from ordering to receiving my order. 20 minutes!!! \nOn top of that, I saw one of the baristas (short asymmetrical blonde hair, tattoo back of her neck) keep touching her hair and her face and then would handle drinks without washing her hands.", "author": "Melissa P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-25", "description": "My favorite coffee is mocha and blue bottle coffee makes an excellent mocha. I was excited for the neighborhood to finally have a blue bottle coffee place, but I was totally disappointed. Fog Lifter Cafe may have \"blue bottle coffee\", but it's no where near as the quality of the blue bottle coffee places downtown.\n\nMy mocha was pretty bland, bitter, and didn't have the nice artistic drawing. Not that the drawing matters in terms of taste. It's more for show that skill and care went into preparing the coffee.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-09", "description": "I love this place! Great coffee made by people who obviously care about coffee, healthy snacks (including smoothies the way I make them at home, just fruit, juice and yogurt---what else!?) friendly staff and relaxing atmosphere. I'm a nanny for a little boy with autism and I always feel welcome here.", "author": "Gabriella V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-28", "description": "I had to update this post. I have returned since my last post and they have way improved. The staff is friendly and the espresso was tasty and effective. They have a lot of space for studying or working on your computer which is also nice.", "author": "Heather T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "I made my own bagel, tomato, avocado sandwich... :)- Quite place to work and good background music.", "author": "Sam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "This place will always be a little extra special for me because it was the first place I found to retreat to when I was brand new to the city. This place has delicious blue bottle coffee and a variety of espresso drinks that are perfect for a foggy day. They also have really delicious food options! The egg and cheese croissant was a buttery breakfast indulgence that I would gladly have again. My favorite part about this place is how genuinely friendly the employees are! Every time I am there, the people brighten my day. I would definitely recommend this place of you're looking for a great little neighborhood coffee place with its own character.", "author": "Shannon P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "I came here a few times (once after I got my tattoo next door and the second time after visiting the tattoo shop next door again lol).  Love their white mocha and they also make great sandwiches. I've been to the coffee shop that's across the street from them or down the block from them. Eh, not that great.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "My first visit to Fog Lifter Cafe. Opted to come here due to my recent disappointment at the Peet's in West Portal.  \n\nI walked in, the place looked nice and first thing I noticed was the proudly serving Blue Bottle Coffee.  Their 1st star, I ordered a mocha, soy milk with light chocolate and an almond croissant.  Giving 2nd star for having my fave pastry. The cashier was friendly 3rd star, they offered gluten free cookie for my dear friend Hilary, 4th star and when I got my drink....to my amazement there was a bear face wearing a bow tie made on top! 5th star!! \n\nOmg, this made my day and the drink was delicious!!\n\nI'm a fan and coming back!", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-22", "description": "I love this place! Very close to home and conveniently located across the street from 24 fitness.  \n\nThe Chicken Cesar sandwich is really yummy.\n\nIts a cool place to sit back and do work (free wifi) while appreciating the view of the dense fog outside.", "author": "Anthony Xavier S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "It was pretty in-and-out for me, but my friendly barrister hand-poured water through one of the melitas lined up in a row, with my selected coffee. So, it was a fresh, custom-made cup. It was a little bitter in the end, but I appreciated the strength and unique way this was made. It certainly wasn't my father's diner coffee.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-24", "description": "Anywhere with blue bottle coffee is a winner in my book! One random day, I needed a place to study and kill time and this cafe catered to all my study needs. There's a large space with plenty of seating, outlets, blue bottle coffee, food and free wifi. It was a modern, yet comfy space with nice people and calm music. I would definitely come visit again if i'm ever \"stuck\" around the area!", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-13", "description": "Come for the Chai Tea latte or blue bottle brewed coffee. Very comfy, spacious neighborhood cafe.", "author": "Farah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-05", "description": "Love this place. I am a coffee addict, I've tried it all. I mean it when I say this place is a gem with the best iced coffee in my opinion. Plus the staff is super friendly and the vibe here is just really nice. Check it out!", "author": "Mel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "Great coffee shop.  Their food is good too.  Also there is a parklet just outside which is a nice addition to the place.", "author": "Annabelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "This is my go to cafe in the neighborhood. It's clean, modern, and friendly. They sell  Blue Bottle coffee, have free wifi, and there are plenty of outlets for your laptop! The food is okay, nothing to rave about. I recommend the Vegan Falafel, Hummus sandwich and the iced coffee (Warning: this drink is highly caffeinated). They also have a wide selection of cold drinks if you want something other than coffee.", "author": "Donna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-01", "description": "I love their coffee, it's excellent.  Nice atmosphere for somebody who would like to grab a coffee and read a magazine.  I wouldn't exactly consider it to be studying friendly.\nThe service doesn't seem to friendly but I would come here again", "author": "Bobby L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-04", "description": "Needed a quick breakfast...checked out yelp for nearest, decent place! WOW! Wasn't sure about it at first... Thinking is there enough options? Well, yes there are! And the service is fabulous!!! These guys make you want to come back! Oh! Did I mention the coffee! I've heard Blue bottle coffee is great and now I can say it IS great!", "author": "Halina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "The bagels are toasted and creamed, just right. Perfect\n\nThey make really great cakes and croissants as well. Definitely try the pumpkin spice cake. I think that's what it was. With chocolate chips in it. Mmmmmm Yummm!", "author": "Yaj R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-05", "description": "Spacious and airy with its high ceilings and ample seating, the cafes interior has a good, welcoming vibe. The sandwiches are filling and delicious, if a bit over-priced. The coffee is truly wonderful. They always take the time to put adorable designs like cats and bears into your mochas lattes, which I certainly appreciate. For those who don't drink coffee, Fog Lifter offers a yummy hot chocolate and a wide selection of herbal teas. \n\nI've been coming here to study for almost a year now and I've mostly been pleased with my experiences here; outlets are plentiful, seating isn't usually hard to find, and the the noise-level is tolerable. However, lately I must complain that they've been pumping up the volume a tad too much on the music. It's to the point where you can't even hold down a conversation. I appreciate their selection of chill-out cafe notes, but hey, tone it down! Even with earplugs I can hear the speakers-a-blaring! \n\nThe main reason this review gets only 3 stars instead of a solid 5 is the music. Fog LIfter, if you keep your music volume turned down to a reasonable level then you'll get better reviews :)", "author": "A W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-09", "description": "I just ordered a breakfast croissant from this place and soon after consuming my meal discovered the egg was rotten. I lost my meal, several times,  all over Ocean Avenue on my way home. The egg was GREEN on it's way back up. Never coming back. I should have just gone to Whole Foods.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "Great coffee, friendly staff, yummy sandwiches at lunch time. And pleasant outdoor seating. I see a couple reviewers said the coffee is too intense. (It's Blue Bottle, people. It's actual coffee, not Folgers. Add a little water if you must.) Anyway, I like this place and its mellow vibe.", "author": "Warzie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-17", "description": "I had my worst and most disguising iced coffee here. I ordered one iced coffee an it was THICK with coffee bean sediment inside my coffee. I ask for a replacement, the second one looked fine but tasted AWFUl. I had their regular coffe before and it was good. I don't know what's wrong with thei iced coffees", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "This place is awesome. The staff is friendly and always happy to be working. Once they even gave me a coffee when I realized I did not have cash on me.", "author": "Brenden C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "Really nice service and delicious food! I love the drip coffee! I'm giving 4 stars because it's overpriced", "author": "Simi J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-17", "description": "They have a sign at the register that reads \"no cell phones when ordering\" or something to that effect. Makes a lot of sense, it's rude when customers try to order while on the phone. It was ironic that with that sign posted the girl behind the counter was completely ignoring me while she was at the register totaling receipts or something. No I'll be right with you or even eye contact to let me know she sees me and she will help me when she's done. A guy came from behind the counter to help me and as he went to use the register to charge me, the girl still wouldn't get out of the way so he could provide me with good service even if she didn't. I ended up feeling like my business was bothering her. As I consumed my purchase I couldn't help but notice that all other employees seemed pretty nice while she remained indifferent to other customers. At least she made time to chat with and be friendly towards her coworkers. It would be nice, and good business if she treated her customers the same way.\n\nNow the food, I had an awesome turkey and provolone sandwich the first time I came, it was pretty good. I ordered it again another time and it was terrible. It was made with different bread, little to no cheese, and I swear the first time it had some sort of pesto mayo or something like it that made it taste delicious, the second one-plain and dry. On another occasion, I met up with a friend who was having quiche served with salad. It was great, the spinach salad had goat cheese crumbles and I could see on the sliced tomato that it had been salted and peppered. Since I ended up eating half of my friends food, I got up and ordered another quiche no more than 10 minutes since the first was ordered, totally different experience. The quiche was the same but there was no cheese on the salad and no salt or pepper on the tomato. Bland! \n\nIn summary, food is hit or miss (apparently due to lack of consistency or attention to detail from the too cool for school hipster staff), service sometimes okay sometimes makes you feel like you are bothering them if you need to be acknowledged.", "author": "erika e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-17", "description": "Coffee here is good but what gets the 5 stars is the really cute girl at the cash register that does an excellent job pretending to give a shit about what's going on in your life. Thanks, you're the best!", "author": "Kendog .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-20", "description": "Nice little local cafe. They serve Blue Bottle coffee, which is organic and fair trade, and also very yummy. The milk they use is also organic, so even tho it is a bit pricy, you get a good bang for your buck. The people are friendly, and on Sundays, there is live music. Definately my new favorite coffee spot.", "author": "Tiffany K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "Nice place to get a cup of coffee and sit there to get your work done. there are free wifi and the downloading speed is good. It is pretty crowded on Saturday and Sunday Afternoon.", "author": "Li L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-30", "description": "I live right around the corner and took way too long to try this place. Went in while my best friend was visiting from out of town. We each got bagels, she got a coffee and I a tea. Everything was great. The best part was that both of the employees working were incredibly nice, conversational, and inspired me to want to return. I really like the overall atmosphere of the place. Can't wait to return! Thanks guys. :)", "author": "Stacey J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-04", "description": "Had a iced coffee today. It got some weird taste. Even though it was only like $2, I couldn't finish it because it tasted nasty. Seriously, how could mess up the most basic iced coffee.", "author": "Evan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-22", "description": "I really want to love this place because it's so close to my house, and the decor is nice, and the place is always clean. BUT, I went there today and there were two apathetic barristas who obviously would rather be ANYWHERE else doing nothing (like picking out hipster-sweaters) than doing nothing behind the counter of this cafe.  \n\nI had not eaten all day, so I wanted to order a bagel sandwich for lunch, but they ran out of bagels (really, that's half of the menu?!), so I ordered a vegan falafel and hummus sandwich. It took the sandwich over 25 minutes to appear even though the place was entirely empty when I arrived.  I also had ordered a famous \"blue bottle drip coffee\" and 30 minutes after ordering, I went up to ask where my coffee was and the guy said, \"oh, I forgot\" to make it. Nice. So I had to wait 10 more minutes for the coffee.  So, just a 40-minute wait for a small coffee and a 25-minute wait for a sandwich when the place is empty.  Awesome service guys!  They were literally standing there just staring blankly into space.  I spent $9 for these two items.\n\nFinally, a few people wander in and they also wait at least 15 minutes (to 25) for their coffee.  This is so striking, that I say aloud, \"wow, this is the first coffee shop I've ever been to where no one has a coffee in front of them.\"  SO, 6 people just sitting in their seats waiting and waiting endlessly. For coffee. Wow.  I so want to go to Starbucks right about now!\n\nSo then comes the sandwich. Ugh. Really, really terrible.  The \"bread\" is actually a wrap, not panini bread as advertised (they just panini press it)  and the falafels are re-fried to a burnt crisp in really old (bitter) oil and taste VERY foul.  They overdid the tahini and not enough hummus, so overall, the sandwich is the most bitter item I have ever paid to eat.  It was 1 pm, so out of starvation & convenience, I ate it anyway.  To top it off, the sandwich sent me straight to the bathroom in a bad way 15 minutes after eating it.  You think that's a coincidence?  By BF went straight to the bathroom 10 minutes after just taking a few bites. They should call it a bullet sandwich.  So it was like buying a $7 enema. :-p\n\nDO NOT VISIT THIS PLACE unless you have 20 minutes to waste waiting for a small cup of coffee or you really need to end your bout of constipation FAST.  \n\nBoth stars above are solely for the look of the place itself, which is nice. Zero for service and product.  By the way, the first time I came here, I was buying a coffee a few minutes to nine on my way to work...BIG MISTAKE! I had to cancel it as ten minutes later, no coffee in sight. Half of the slowness is the workers' fault: they just don't care.", "author": "Lisita P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-25", "description": "to be quite honest, i RARELY go around the ingleside/CCSF area, but this cafe made me think twice. and also, my friend is one of the baristas here, so you better be nice!\n\na pretty spacious cafe with awesome seating and selections. plus, they serve blue bottle, which is awesome considering that around the area, it isn't the 'mecca' of gourmet coffee goodness. just saying! \n\na must try= FALAFEL WRAP. it filled me up and they give you a generous portion of it.", "author": "Marc K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-11", "description": "I wish this place was around earlier.  It was great coming here when I was working from home and needed to get a new setting for work with some free wifi.  The coffee is excellent and they put effort into the process.  The owner is super nice and the shop has a nice, warm atmosphere to it.\n\nAside from the coffee, their sandwiches are excellent.  The North Beach in particular was surprisingly delicious.  The only downside is that it's a little pricier due to the high quality of their food and drink, but it's all worth the price.", "author": "Jonathan G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-09", "description": "Finally walked down to this highly spoken of coffee spot and I was a bit disappointed. My Western Scramble everything bagel was dry and flavorless. I'm used to the personal drip cup coffee, but the setup is poorly executed. The coffee drops from pretty high and splashes all over the side of the paper cup (I would rather have had a ceramic coffee cup), the coffee was good enough, but having to get up and see if my coffee was ready was really annoying. Standing around watching it drop didn't seem like a good plan, there were 3 cups up there and not sure which one was mine. When it was finally ready, the splash on the cup was a mess. My spouse got sick after her croissant egg sandwich, so I won't be going back.", "author": "Nadia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-15", "description": "Loved their coffee, which they brew each cup. WiFi is a bit slow, but ok with me.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-07", "description": "New! Old King's Coffee Shop is now the Fog Lifter Cafe. We are so happy they are here. I had an excellent espresso macchiato. They just opened today 1901 Ocean Ave. corner of Ashton, across from the Astronomical Society of the Pacific. Please welcome them to the neighborhood, Kenneth", "author": "Kenneth F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-18", "description": "What is Wong with Cafes claiming to serve Blue Bottle coffee and instead churning out mediocre run of the mill espresso. \n\nI so wanted to love this place. Ocean avenue needed a decent coffee hangout. I came here a few times when Fog Lifter opened and the owner was making the Caps and Lattes and they were pretty good. Obviously he had been trained by Blue Bottle. It had what I wanted - not too hot creamy and not bitter. \n\nI have been back 3 times in the last month at it has become progressively worse. Clearly the barista's have NOT been trained. No attention to detail. Scalding hot, bitter and Starbucks foam. Not what i paid $3.50 for! \n\nI hope the owner reads this and understands that you cannot just throw a blue bottle logo on your window and produce shite coffee. Well at least they got the prices right.", "author": "Hud B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-03", "description": "My Wife and I stopped in for coffee and found this nice local coffee shop. Spacious and populated by the usual suspects along with one time visitors like ourselves. Though we enjoyed the local flavor the coffee was brewed by adding hot water to the grind in a filter held by a funnel with the cup a few inches below. This allowed the water to drip freely into the waiting cup. Nice idea however the coffee ends up tepid at best as it cools on its way to the cup. Granted this was a cool SF day but aren't most Summer days like this? Since I stay away from Microwaving if possible, this would have been the only way to make my coffee HOT!. The inventory of sweet rolls etc. had been picked over by the early crowd no doubt as we struggled to find something to have with our coffee that we liked. We also noted the servers were having conversations that were continued until completion while we waited to give our orders and again as we came to the counter to get our coffee. Some on site management, customer policies and alternative brewing techniques would help this establishment. Good luck, Michael M.(SF Native).", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "Cute place for people watching while wired on blue bottle single drip coffee! There's also large enough space to do work without feeling suffocated by fellow caffeinated creatures. Plus the option of choosing your own (free) music is not too shabby.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-19", "description": "Def my favorite coffee place around campus. For City College students, this place is as good as it gets, the coffee is well made, the place is wide and very environmental friendly, the staffs are kind and friendly plus a great place to study! Im def happy with the coffee i get, i also ordered the organic garden variety salad, which was well made and healthy too....the only downside is that the place is a little far from campus....but def will be here again when i have to study!", "author": "Cavin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-15", "description": "I like the feel in here.  I like to come in for a cup of coffee and sometimes a bagel or muffin and read or chat with friends.  Staff is very friendly and likable. Sometimes they make cool designs on my mochas ($4).  I don't think the coffee drinks served here are the best I've had (but I'm not someone who knows a lot about coffees, I'm just referring to my preference), but they're quality coffees, made well.  Blue bottle coffee, wi-fi, good sunlight in the mornings, friendly staff, right across the street from 24 Hour Fitness Gym.  nice..", "author": "A T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-26", "description": "New Orleans Ice Coffee. Nice open area. Friendly staff.", "author": "Wayne Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "Still a great place! Great ambiance and great food although the coffee is not something I like, its good coffee i just personally have my own bias about where i buy my coffee from but this has to be a GREATT sandwich!", "author": "Hubert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-22", "description": "Best coffee on ocean avenue and nice, open atmosphere inside.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-10", "description": "I'm so happy to see this cafe open in my neighborhood! Welcome! This, plus the soon to come whole foods in the former Kragen site are going to do a lot for scrappy Ocean Ave.\n\nJouad (I'm probably misspelling his name) has put a lot of effort into fixing up the old King's cafe into a contemporary, blue-bottle slinging establishment. \n\nIt's tastefully painted and full of light. There is wood flooring and a lovely wide countertop. I'm told there might be a parklet in the works, which would be fantastic!\n\nI'm thrilled that he's serving blue bottle, using Roman Espresso as the house bean, and 3 Africans for the drip. He's selling bagged beans as well. \n\nThe pannini menu looks interesting, I will have to try that soon.\n\nI'd love to see proper, thick brown earthenware cups and saucers (like they have in Italy or at other blue bottle cafes, as it retains the heat really nicely. The walls could probably use some art (local art!, yay!), but overall, I'm really looking forward to spending a bit of time in my newest local cafe!", "author": "A P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "Stopped in on my way from the dmv, needed a nice treat for myself and was famished. I can't say how nice it is to walk into a coffee shop and be greeted with a smile instead of a scowl. When I couldn't decide what to munch on, a suggestion was made. The atmosphere is relaxing and homey. My almond milk chai was perfect and so was my falafel with avocado. I'm happy I stumbled in. If I'm down this way again, I'll be back. 5 NOM stars.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-16", "description": "I like this place, great open atmosphere & can't go wrong with Blue Bottle coffee. My first visit was a bit weird, employee was a bit unfriendly, but every time since service has been great & professional.  Keep up the good work staff.", "author": "Kyle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-17", "description": "TheFogLifter is right across the street from my house, which is bad for me. Bacause their coffee is great, their tea is great, their sandwiches are great, their panini's are great, i mean...how do they get everything so right? they have an awesome staff and great atmosphere.", "author": "Cassandra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "Thanks for opening up! I love this new cafe. They have great blue bottle coffee and nice staff. Its very spacious and clean and there is a ton of room to study or relax on couches or at tables. They also have free wi- fi and lots of bike parking!", "author": "M K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-10", "description": "This cafe is a new discovery for me.  The friendly staff serves drip Blue Bottle coffee, and I must say that this coffee is now one of my new favorites in the city.  Definitely good enough to drink black - no cream required.  The great space and free Wi-Fi seal the deal.  The next time you are driving down Ocean Ave, check it out.", "author": "Wayne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "This is my local coffee shop and I love it.  Working bathroom, outlets for laptop, nice baristas, almost always you can find a seat, etc, etc.  5 stars!", "author": "Max H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-11", "description": "The first time I came here I ordered an egg and cheese croissant and a tea. I took a few bites before I started to read my book. It was very tasty, so I ended up eating it all before I delved into the world of Murakami. Then, as I was reading my book, I started coughing uncontrollably, out of nowhere. I wondered what the cause was until I realized that the whole cafe had filled up with a smoky feeling from all the sandwiches that were being made. I was the only one coughing, which made me feel like an anomaly, so I tried to move to another area of the cafe that had better ventilation. As it turned out, wherever I sat, I had the sensation to cough. At one point, I was relieved to see the door opening to let air in. I couldn't open the door and leave it open because it was one of those cold and windy days in San Francisco, where if I tried to open the door, the customers would likely give me the death stare. I couldn't take it anymore, so I had to leave that place.\n\nI still go back occasionally. It's a nice and wide coffee shop, and the tables are nicely spaced, such that everyone can get their own corner and not be bothered. I wish they did something about that smoky feeling though.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-06", "description": "I went in here craving a sandwich one day...I ordered a chicken with avacado and they ran out of chicken so I substituted salami...best sub of meat ever, and now I am hooked....it is close to home, cool vibe and really brings a lot to the neighborhood...will be back soon...", "author": "Ryan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-03", "description": "Good food and coffee. Live music too!", "author": "Daniella O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-28", "description": "Bagles are good, but way over priced. I love the Blue Bottle Coffee though!", "author": "Alex G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-16", "description": "this place is great! The new owner really fixed it up and now they serve blue bottle! Big plus", "author": "Prentice S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-04", "description": "So I absolutely love having a decent cafe in my neighborhood. But, in the spirit of improvement, please make sure that the lattes are served nice and hot. Great place, can't wait to try the food. Really, Ingleside REALLY needed this place. Java coffee is terrible!", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-24", "description": "Nice and convenient to where I live AND finally I can get a decent cup of coffee by my house. So far its been consistent. Can't say its my favorite \"by the cup\" coffee place...(philz has that place in my heart) but its good.", "author": "tee c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-10", "description": "I used to love this place - quiet, great location for studying, right across from my gym, and plenty of cute guys.  Today a woman with a small 5lb dog came in for coffee, tied her dog to a chair, and ordered her beverage.  I'm not a dog hater - as a matter of a fact, I have a 90 lb long haired cuddly rottweiler who I adore. But I would NEVER - N E V E R - bring her to an establishment that serves food because her fur flies everywhere.  Not only did this woman enjoy her drink and read a book for well over an hour, but one of the young male employees ran over during a slow moment to pet the dog and returned to work without washing his hands.  My own dog's fur in my food is tolerable because I know where she's been.  But would I pay for it? Not a chance.  Really disappointed. I'd come back to study, but will not be purchasing drinks or food.", "author": "ashley d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-11", "description": "Lou's, Roxie's, etc...Could Fog Lifter be among these greats?  After a local \"casualty (another sammy place in the area closed down),\" we decided to try the sammies at Fog Lifter.  We ordered the hot pastrami with avocado and salami paninni...both decent sammies, but unfortunately, I was not blown away. If you've ever read my reviews, I'll say it once, and I'll say it again, how I evaluate many sandwich places (first) is by the hot pastrami.  There was nothing \"wrong\" with the sandwiches.  It just merely appeared like a flavor of Vanilla compared to chocolate gooey goodness, or some other hipster, outlandish flavor they have these days.  If you want something seemingly traditional and you are at the shop studying/doing work, this is not a bad choice.  If you are on the hunt for the best sandwich in the city, let's continue to run around and eat together!", "author": "Steph W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-30", "description": "This is the best coffee shop in the neighborhood! It's located across the street from the 24 hour fitness, for that evening tea or tasty roast beef sandwich and other tasty pastries. I highly recommend this friendly establishment to everyone and you will not be disappointed.", "author": "Vincent J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-23", "description": "It's alright. Not much of a coffee drinker so I'm not the best judge, but it was fresh and it did the job.", "author": "M R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-30", "description": "Blue bottle coffee on good ole' Ocean Avenue with an owner with a heart of gold--YES!", "author": "Elle S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-05", "description": "This place gets two stars for the upscale look but they're coffee is weak, bitter and overpriced. They advertise \"Blue Bottle Coffee\" and I really don't get what the hype is all about.  A \"large\" coffee is a Starbucks tall and is $2.25. Don't waste your money.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-02", "description": "Very nice cafe. The staff is friendly, and the interior is very nice and spacious.", "author": "Keith A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-11", "description": "I'm a big fan of their New Orleans Iced Coffee, smoothies, and sandwiches.  It's a great place to work or study, the wifi is free, and the bathrooms are clean.  It's also conveniently located across from a 24 hour fitness and a pretty good Vietnamese restaurant, and close to a MUNI stop (for the K/T routes).", "author": "M. N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-14", "description": "I loved my espresso, cappuccino, latte and individually brewed coffee and each was a work of art. The Blue Bottle Coffee logo caught my attention at first, and the espresso drinks were made with the same skill, art and love that other shops of its kind are noted for. The place also has a casual hang-out atmosphere, the sandwiches are exemplary too, and the baristas aren't snobs.", "author": "Marion H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-05", "description": "welcome to the hood! good people making a go of it. Let's support them. Just up the tea game: brew the iced tea unsweetened and get some more brands of hot tea bags.", "author": "hunter w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-08", "description": "I've worked from here two days now and really like it! Delicious Blue Bottle coffee makes for a lovely, roasted-smelling almond milk latte. They have yummy pastries and sandwiches as well. The ambiance makes for a nice, professional-yet-laid back vibe. The big windows let in a lot of light even in this neighborhood. Wi-fi is free with no limit like the cafe down the street (last I went there years ago, there was a time limit which makes working from there difficult). There are a few outlets to plug into, and while the parking is metered right along Ocean, you can usually go around the corner to Urbano or Ashton and find something non-metered there. The staff are all cool, and the guy who I think is the owner is super-friendly. Deducting one point for a bathroom that isn't on par with the rest of the establishment. There were enough supplies and it's not gross or anything, but not tended to as often as the rest of the place, and it's kind of dark which lends a kind of dingy air to it. But that's my only complaint. Overally, really nice place.", "author": "Deb T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "Fresh Food Fast! Try this place you will like it. My favorite is their Soup with Salad or a Panini. This place is very clean. They scored 100% on their Health Report.", "author": "Sheri S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-12", "description": "Cute little cafe. Took my kids there for hot chocolate and the barista did amazing art right in the cup: drew two little kittens with the foam!", "author": "maria b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-23", "description": "i want to write something positive, but it is hard.  have been here many times after working out at 24 hour fitness which is opposite.  it is pretty clean and they the atmosphere is nice.  unfortunately, the negatives far outweigh the positives and i hope the owner figures this out\n\n1.  most of the staff is borderline incompetent, slow and surly and wouldn't get past the first two minutes of a starbucks interview\n2.  if the coffee is blue bottle then they really know how to mess out making good coffee.  half of the time the coffee lukewarm\n3  wifi works well when it works, but 20% of the time the router is down, and the staff usually tells you that it is a problem with your laptop\n4. don't order the food.  go across the street to get a decent (vietnamese) sandwich\n\nsorry for the bad vibes i am giving off.  like others have mentioned, i hope starbucks opens nearby", "author": "James C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-14", "description": "Blue Bottle coffee, great food, friendly staff and a lot of cozy space inside and outside to hang....", "author": "Les L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-15", "description": "I like the exterior and interior of this cafe. It's very sunny and spacious inside. It's ZEN like. The menus are easy to read. I was not hungry so I just had coffee and toasted bagel with butter. Very nice. Simple and very affordable. I can say that from a teacher's salary!", "author": "Magdalena D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "The Fog Lifter Cafe is amazing! It is so refreshing to see a new business open up especially in this economy. The coffee is wonderful, staff friendly and the owners are very hands on within the shop. I highly recommend Fog Lifter Cafe if you are looking for a delicious cappuccino (my favorite) and some quite time to yourself. Coffee has always been a love of mine and Fog Lifter Cafe has never let me down!", "author": "Teresa V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-12", "description": "i love this place... i came once and and the second time i came around they remember my  drink. they great with customer service super nice! great selection of food and pastries. and i love their coffee its nice smooth and bold coffee flavor.  i do wish it open later like till 11pm but thats never possible with any good cafe. i just love a late cafe. not to mention the cafe is huge spacious and great atmosphere. i also wish there was free wifi so thats a downer.", "author": "Thaleda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "This place has great chai and it's a great place to study or just hang out with friends. I love the casual atmosphere and the sandwiches are great too! On the other hand, sometimes staff members get confused on which order was for whom. If this could be more organized, then I would give this place 5 stars. The live music on Sundays is just okay. The band is great but the singer is okay.", "author": "Palina P."}
