{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "Frank Chu was protesting before it was cool like it is now (Thanks Trump! ) \n\nAs an OG protestor I think it's time we send Frank to Washington to take care of business.", "author": "Gene X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "I understand ever word Frank says. Not just mentally , but physically. His words vibrate my synapse. I feel as though he is talking from a higher power. I could listen to him for hours.", "author": "socountyplbr a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "Frank keeps fighting for the 12 inter-galactic xeno-multi-political species that govern us. \n\nKudos Frank.", "author": "S O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-03", "description": "He's often at my work. Yes, I'm a factory lineman for multicolored DIY vocab picket signs. And Laughing Squid and Adidas.\n\nI've had to break his slumber. But he mostly just hangs out, chills. I've seen him writing; writing what, who knows.\n\nHis gun x hostages x police incident is cautiously perched in the back of my mind in case he reprises his role.\nhttp://en.wikipedia.org/wiki/Frank_Chu#Before_his_protests\nhttp://www.yelp.com/biz/frank-chu-san-francisco#hrid:9WETS1rOGTns-_SUEuQf4A", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "Frank Chu is awesome, I hope he comes to my retirement party. I see Frank every day, all over the place, perhaps even in my dreams. Frank is a man among men, I have herd he has powers, like a ninja, mind control I am sure. Frank dresses well, he's one snappy cat, as cats go, ya know. Remember the galaxies Frank Chu. :-)", "author": "Harold F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "When I was younger, Frank used to scare me because he was much more louder and belligerent at times. \n\nBut over the years, he's calm down quite a bit. When I worked in the FiDi area, if I saw him, I would always offer to get him a cup of coffee or water. \n\nHe's very clever besides walking up and down Market street... he will normally appear at big press conferences or trials. \n\nHe knows how to market himself.", "author": "Peta C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-07", "description": "Frank Chu looks like the same guy who wandered around oaktown's downtown and chinatown area years ago. he then carried hand written signs about  jesus christ \n\nhaven't seen him for awhile. seems frank  has gone on to greener pastures in s.f.\nhis messages about the 12 galaxies now has paid advertising on the opposite side..\n\nlooks like he's clean up his act (semi neat clothes) wikipedia mentions he lives in oakland, or is Frank the other guy's brutha?\n\nnot saying these preacher types look alike but there is a resemblence.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-22", "description": "Frank is the MAN...\nThanks for picking the Hall of Justice and announcing my retirement.", "author": "Sherman L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "I just happened to look away from the gay pride festivities for a second and spotted that multicolored, Impact font-covered sign in the sea of rainbows and stoned teenagers, making its way up Market. \n\nMy heart stopped. \n\nI started excitedly patting the boyfriend's shoulder and excused us from our friends' sides as we ran after Frank, the Laughing Squid logo emblazoned on the back of his sign. \n\nAfter tapping on his shoulder and asking for a picture, which he posed for (photo: http://www.yelp.com/biz_photos/2tbN_rppko8MbwCj_v_APQ?select=sPlVT6m9H4hHugK31VD29g#D6unnXkbIPfeJOra1G44eA), we returned to our friends who looked at us bewildered. \n\n\"It was like a chance meeting with a unicorn,\" I began. \n\nMy best explanation a moment later was that seeing Frank is like encountering Rorschach, his \"The End is Nigh\" sign in tow, during one of his patrols through the city as his alter-ego.  \n\nAnd while that fits (though I don't know how well Frank could be charged with upholding Kant's concept of categorical imperative), I later amended that Frank is pretty much a San Francisco institution much like His Imperial Highness, Joshua Norton I. \n\nHe's just one of these so-called harmlessly crazy personages to which the city had just opened up its lovin' arms and embraced. And with good reason. \n\nNow ... when's Frank Chu going to start printing his own money?", "author": "Christine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-27", "description": "Sure, there are plenty of local weirdos in every city whose intrigue has captured thousands, but the mystique of Frank Chu might put him in an elite class of his own. What would Union Square be without him?\n\nPerhaps outside of Leslie, the cross-dressing transvestite in Austin, Texas... Frank Chu is my favorite nomad in the United States. I mean, there was even a music venue in town named after him at one time (12 Galaxies)! If that doesn't speak volumes, I don't know what else will!", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-13", "description": "One crazy ass Asian mutha!\n\nHow the hell could one person be everywhere all at the same time? \n\nIt reminds me of the movie titled Cookie's Fortune, where Charles S. Dutton plays a character that seems to be everywhere at the same time when witnesses were being interviewed. \n\nIt's hilarious; but this man, Frank Chu, takes his craft very seriously. I gotta tip my hat to him since he is a fascinating character, and have personally witnessed him getting FREE lunches while being interviewed by local print media. \n\nDude got his 12 Galaxies sign and spreading his message...whatever that may be.\n\nDo your thing, Frank Chu. Just don't bother me.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-03", "description": "Thank you Frank Chu... for being there so many times over the years.  Seeing you out and about warms the cockles of my heart and truly makes me feel like a local.", "author": "Chloe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-06", "description": "You aren't truly a San Franciscan unless you know or know of Frank Chu.\n\nGod bless him and all 12 of his octo-galaxies.\n\nXantric\nZerbophobic\nGalaxy", "author": "Stuart Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "Long live Frank Chu. I hope he gets his deserved royalties. I appreciate him educating the world on the 12 galaxies, zergatronics and the kaxdrujullions of populations.", "author": "Geordie V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-15", "description": "Do not underestimate Frank Chu.  In fact. I would advise against estimating him at all. Frank Chu has an insight unique to him because Frank Chu is not one of us. How, you ask, would this man know so much about the 12 Galaxies? Where does his original take on the language come from? How can he be in so many places, possibly at once?\n\nFrank Chu is clearly no mere mortal.  He is not the only one among us, but he is the most visible. \n\nWe are very lucky that Frank Chu is on our side. He has been protecting us from the evils of the 12 Galaxies and the offices of the American Presidents for many years. And he has the dedication and the perseverance to go on.\n\nWe all owe Frank Chu a debt of gratitude. Rate him appropriately.", "author": "Margaret G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "I never thought I'd Yelp a person, but if anyone deserves one, quirky (a major understatement) Frank Chu certainly fits the bill.\n\nBorn March 24, 1960 is one of San Francisco's best-known eccentrics, protesting against US Presidents, corporations, individuals, & most importantly to him, the 12 Galaxies, since the mid-nineties. Most of his rants & signs appear completely nonsensical to the average person, but then again, Frank claims he's not from this planet.\n\nRegardless of how one finds him, he's garnered quite a sizable following that includes a restaurant being named after his signs (the now defunct 12 Galaxies on Mission Street), his getting free drinks & food at various establishments, a Wikipedia entry, maintaining MySpace & Facebook pages (w/ over 1,000 friends!), a Frank Chu Sign Party at 111 Minna Gallery, two female roommates (including aspiring local fashion designer & former Matt Gonzalez campaign worker Kristina Hoerler), & various media interviews. Not to mention a Frank Chu Protest Sign Maker page. (http://acme.com/chumaker/)\n\nAlways carrying his trademark picket sign & usually dressed in slightly distressed business wear & shades, Frank's near daily routine is to take BART from his Lake Merrit home & prowls Market Street, usually between the Montgomery Powell Street stations, unless there is a more crowd/media-drawing event elsewhere. In which case he'll pop up there, regardless of the event. \n\nWhile generally polite & coherent, if one asks him about his protest of the day or anything 12 galaxies-related, you'll be inundated w/ gibberish that will hurt your head. Seriously. \n\nTypical signs include ones that  highlight the benefits of  \"Cotsgrogrenigul Coverage\", decry the \"perils of Nexsrojrenikol\", or bemoan \"Qwintrozenikulled Suppression\".  And drawing attention to the 12 Galaxies, of course.\n\nThe backside of Frank's signs have been sponsored by the likes of Blondies Pizza, Rasputin Records, Laughing Squid, Barbary Coast Consulting, Harputs adidas, Learn iT!, Quiznos Sub, Rasputin Music, Chris Daly's 2006 San Francisco Supervisor campaign, & Phil Angelides's 2006 California gubernatorial campaign for about $100.00 per week.\n\nAlthough he started w/ & stayed w/ ranting against the 12  galaxies, in mid 2007, he began to increase the number of galaxies he has a beef w/ & is up to over 8,685,000,000 galaxies.\n\nFrank has even had a legal dispute w/ the Zegna Group over the term & website zegnatronic.com.\nhttp://www.wipo.int/amc/en/domains/decisions/html/2004/d2004-0416.html\n\nOn the more serious side, Frank suffers from a history of mental problems & had been prescribed medication. In early 1985, Frank took 11 members of his family hostage in his home in Oakland & fired a .38 pistol at a police officer who came to investigate, but missed. Police cordoned off a ten-block area for three hours. Chu eventually released his hostages & surrendered to the police.\n\nSanta's Yelper sez: \"I hear Frank's looking for another roomie, preferably female that are willing to go on double dates. Any takers?...Heh.\" Really funny, SY, really funny. But true. And scary.", "author": "Tadashi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-13", "description": "I love Frank Chu. My friends who work in the Chinancial district say that they know it's gonna be a good day, when they see Frank Chu walking down the street.\n\nFive stars for this San Francisco icon!\n\nThe frank chu tribute at bay to breakers was also a hit:\nhttp://www.flickr.com/photos/pixiegrrle/151900347/in/set-1085284/", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "If you're at some event, and you're marveling at the crowd, but you don't see Frank, you're not at the biggest event on the city that day.  The man can sniff out a crowd and cameras like a Kardashian.  I hope he gets his billions from the 12 galaxies.", "author": "D W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-24", "description": "This guy is the truth! I love Frank Chu:) When the whole thing blows up and it's about to end, I'm riding shotgun in Frank Chu's mothership! \n\nhttp://www.youtube.com/watch?v=l9s4onLnxEw&feature=iv&annotation_id=event_752942", "author": "Bill M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-13", "description": "OMG, he has a wiki page?  That's f-ing awesome!!!  \n\nI used to go to 111 Minna Qool pretty frequently and saw him there every time.  Then I would head out to another venue, and there he was again, and again, and again.  I think he's a clone or a triplet or something created by the Chinese. :P", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "THIS DUDE IS EVERYWHERE IN SF and i bet you he's walked on every street!!!\n(gazillion to infintiy stars)\n\nI swear, i love playing \"where's waldo\" with Frank Chu at any event in SF. He is in the crowd. he will be there limping, wearing his shades, and carrying his 12 Galaxies (creepy) sign around. Infamous in SF and only locals know about him. Let me tell you,\n\nIMAGINE gay pride pink party with thousands of gays partying on the street half naked and here's Frank Chu carrying his sign in the middle of dancing gays. IMAGINE these political protest and everyone holding up political signs and here's Frank Chu in the middle with his weird ass sign, of all signs... his political sign stands out! haha IMAGINE SF's city pillow fight with thousands of people holding up their pillows ready to bash each other and here's Frank Chu in the middle with no pillow just holding up his sign. IMAGINE a busy shopping center and frank chu passed out sleeping in the food court still holding up his 12 galaxies sign in hand. IMAGINE the outrage of the SF Giants worldseries breakout and there's Frank Chu walking the streets with his sign. IMAGINE the busy business streets of the financial district (rain or shine/day or night) and here's Frank Chu standing in on the corner like a prostitue holding up his sign. \n\nWhy he carries that sign, I have yet to bother asking him. But i've taken pictures with him and i've said hi to him multiple times. I even heard him get up on his cell phone and chat it up with someone (he's NOT mute). But overall, he's a humbled man in a weird way. I give him mad props for walking around SF streets the way he does and being so famous for who he is. If i can do something  for this man... i'd give him new shoes. I know its his job to do what he does and if someone could tell me the size of his feet, i'd buy him some fly ass nike's to sport around the hood.\n\nHats off to you my friend!!!!!\n\nFYI, i just saw him a few hours ago in the Financial District.", "author": "Jane A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-04", "description": "I was at a Carnaval party this past carnaval Sunday.  A kind of underground houseparty by one of the main D.J. organizers behind Come-Unity.  It was a pretty small party, not a ton of people yet. The D.J. was spinning skillfully, the urban-techno-hippie-hipsters were beating out good rhythms on the drums, and people were blissfully dancing.  \n\nAnd in walks Frank Chu.  He strolls into the kitchen, sets down his sign, and proceeds to serve himself food from the counter, go through the fridge looking for drinks.  He sits down by the soundset, eats, gets up, serves himself again, eats some more.  Leaves, comes back, bobs his head to the music once, eats some more.\n\nAnd then he leaves.  Soon afterwards, loads of people started streaming in and the party really picked up.\n\nHouse party blessing by Frank Chu.  Priceless.", "author": "Padawan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-13", "description": "You've probably seen Frank Chu walking around downtown holding his 12 Galaxies sign.  Sometimes he gets paid to advertise on his sign.  Once he advertised for 111 Minna Gallery, and another time he advertised for Y3! \r\n\r\nTo some he's just plain freaky but not me.  I've seen Frank a lot over the years.  Most recently he can be seen dancing with his picket sign on stage at Qool on Wednesdays which is nice.  Qool welcomes anyone because they're good like that.  But this is about Frank Chu...\r\n\r\nToday I was walking down Montgomery Street to catch Muni home.  There was a big protest between California and Sacramento.  A lot of people were screaming and chanting, \"Free Palestine!  End The Occupation!\".  I'm chanting along as I walk through the protest which is really crowded on the sidewalk.  I'm having a time getting through and then I spy Frank Chu ahead.  I see him and smile and yell, \"Hey Frank!\".  He sees me and waves at me and smiles back.  \r\n\r\nIn the craziness of that scenario, my \"home base\" was Frank Chu, the \"crazy\" guy with the 12 Galaxies sign.  \r\n\r\nIf you think someone is crazy or strange because they tread a different path away from the pack, think again.  Give people the benefit of the doubt, don't judge...you just might get a smile and wave back when you could use it.  Okay yeah, Frank Chu is definitely marching to the beat of his own drum but I admire him for that.  If you treat someone like they're crazy they react to that energy...yes, I said energy.   \r\n\r\nShow people the way you want to be treated by the way you treat others, crazy people and all. \r\n\r\nRock On Frank Chu!\r\nhttp://12galaxies.20m.com/", "author": "James M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-28", "description": "We love our Characters in San Francisco. In a tradition dating back to Emperor Norton these beloved kooks have been the heart of the city. http://en.wikipedia.org/wiki/Emperor_Norton\n\nWhen I first moved here there were lots of characters. I remember the elderly twins, the silver guy, the mouse man, etc. At the time SF was more artsy and more affordable.\n\nUntil some more come forward Frank Chu carries on the tradition alone. http://media4.px.yelpcdn.com/photo/8N2fAhprz19PQV4WwDquiA/l That's a lot to ask of one man but Frank is determined; Frank has a message. Frank wants to be paid for the reality show they are secretly filming of his family and he wants you to know that the other galaxies aren't very happy with our presidents.\n\nI personally prefer vintage Frank Chu back when he had only heard from 12 galaxies. I guess word has spread in space that there's a man willing to lobby for them because couple years ago the number of galaxies that Frank Chu is advocating for jumped exponentially, I don't even know what the current count is.\n\nI love Frank Chu because I love San Francisco and whenever I see him I buy him a beer; Bud light is his favorite. I've seen him smile and I've seen him get upset; I've tried to understand him but it all goes right over my head. I hope he lives to be 100.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-06", "description": "Frank Chu....is the MAN. \n\nhttp://en.wikipedia.org/wiki/Frank_Chu\n\nI wish I had a wikipedia entry. \n\nI see his man EVERYWHERE. \n\nI finally got a picture with him at the Yelp party last night. \n\nI would have taken one with him at the Folsom street fair...but let's just say I couldn't. \n\nMan, he's even sponsored!", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-09", "description": "Frank Chu is a legend and THE MAN!!!  When I'm walking around the city I'm always on the look out for Frank.  He's like Asian Waldo,except he really stands out because of his sign.  He is either the craziest guy to currently grace SF or a marketing genius.  He's capable of infiltrating everything, from public protests to news broadcasts to private parties.  He even has people pay him to advertise on the backside of his banner.  GENIUS!!!  I bet it's all a front.  I bet he secretly works for some machiavellian, marketing conglomerate and ear spies on everyone to learn what people are into, but if you ever talk to him the \"crazy\" front comes out.  Maybe he works for YELP....oooo conspiracies abound.\n\nOk, ok.  Maybe I'm making a myth of the man, but seriously folks, for a complete nutjob he sure is market savvy.  \n\nMy favorite memory of him is watching Gavin Newsom on tv smarming about something or another and slowly, but surely, Frank starts creeping into the camera view.  I bet he plants a gps transponder on all the politicians in this city.  Wait, is Frank the Batman?\n\nOh, and for those who \"don't get\" Frank, what the hell is there to get?  He's crazy!  Anyone who actually tries to have a frank (pardon the pun) discussion to try to \"get\" him should either stop taking life too seriously or get themselves checked out.  Have fun with him.  He's harmless.  \n\nRock the Universe Frank!!! One day those aliens will come back for you.  Kepsphrenicalled Hypnosystenic!!!", "author": "Ehb T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "Gotta love me some Frank Chu. I keep wishing someone would do a documentary on him. XD", "author": "Lisa F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-27", "description": "The greatest thing about Frank Chu is that if you say hi, he'll say hi back.  It's good that the 12 Galaxies are getting some friendly representation here.\n\nApparently, he's sponsored by Laughing Squid now.", "author": "Andy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-21", "description": "Frank Chu/Chiu is my homeboy.  My friends and I saw him at 111 Minna and chatted with him for a bit.  His beer of choice is Budweiser.  \r\n\r\nHe had an extra \"12 Galaxies\" sign in his bag and gave it to me.  I felt like I won the friggin' lottery!  Unfortunately, my drunk ass forgot it at the bar.  The sign would have looked SO cool in my living room (beat *that* in the kitsch department, Urban Outfitters!).  I even got my picture taken with him.  I should've asked him to sign my boobs.\r\n\r\nhttp://www.topramen.net/krista_frank_me.jpg", "author": "Karen F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-02", "description": "Frank Chu's sushi sucks and the service was terrible.", "author": "Da Wei S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-15", "description": "Frank gets invited to ALL the parties and gets his drinks for free... hmm...\n\nI have a great photo from Love Parade 2004.  I'll have to dig it up and post it here.", "author": "Roger L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-29", "description": "Any major outdoor event in San Francisco isn't *really* a major outdoor event in San Francisco until Frank Chu shows up. Once you see that sign bobbing over the crowd, you know the party is on.", "author": "Colleen O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-20", "description": "I saw Frank today and said \"Hey Frank!\", gave him a high-five, and asked him what the good word was. He told me, \"They were filming me, so I told them I was a movie star. And then I told them about the populations in other galaxies.\" I told him to keep up the good work and rode off on my bike.\n\nFrank knows his shit. He's good people.", "author": "P A U L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "frank chu saves!!!! thank you frank chu and your persistence to be one of the greatest social art forms to ever exist!! I always wonder if he's an alien because he seems to have stayed the same age for years.", "author": "Adriana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-22", "description": "I have had the lucky fortune to witness probably one of the finest moments in San Francisco pop culture...The infamous (?) Frank Chu (seriously, he held 11 people hostage) was joining us at the 100 Years of Struggle event at the Palace Hotel....We had a barbecue for the hotel workers outside, and Frank joined us in the celebration. While waiting for a cheeseburger, I saw Mr. Chu walk up to the grill, look down and grab a hotdog right off the grill and walk away just eating the grilled meatstick. And off he went to the picket line with his 12 galaxies sign (currently sponsored by Laughing Squid for just $100/week!). And there he went to fight the CEOS, the 12 galaxies and Bill Clinton while eating several plain hot dogs through out the evening.\n\nWith people like this in the world, and especially more so in San Francisco- these are the reasons I stay here. Isn't life quirky?", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-17", "description": "Frank Chu is a homeless guy that lives in Oakland, carries signs, and protests everything. The last two items above are correct. As a constant publicity hound, Frank will go anywhere (in San Francisco) where something is happening that will attract the television press. He also shows up at street fairs, ribbon cuttings, monthly meet-ups and rallies. He rents the backside of his protest sign allegedly for $100 a week. That is very good spare change. \n\nI am very far from judging the mental state of Frank, but he is a highly functioning (fill in a condition or mental disease), and as such gets my admiration for dealing with life in such a unique and colorful way. I am amazed at how adaptable human beings are given any particular set of circumstances.  I have to laugh. The Yelp \"Have additional tips on this business?\" has one initial question: Good for Kids: My answer is no.", "author": "Theo J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-19", "description": "Frank Chu is a really friendly guy and local eccentric. He's reached a degree of celebrity within the city and pops up almost anywhere that a large gathering can be seen.\n\nI ran into him at the Wharf and he let me take a photo of him next to my friend from out of town. I asked for a short update on the 12 Galaxies (I'm told it's now penta-trillion galaxies), and then carried on my merry way.\n\nI'm still trying to figure out if he is a secret genius or a mad man (both? how thin is the line?). When I was ready to head off he quickly read my body language and paused for long enough to let me thank him and say goodbye.\n\nHighly recommend.", "author": "Philip W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-25", "description": "Frank was in full effect at the Love Parade yesterday and quite popular with the ladies I might add. Have a look:\n\nhttp://flickr.com/photos/larryrubin/46324365/in/set-1011823/\n\nAnd of course, no cultural icon is complete without an official t-shirt:\n\nhttp://www.cafepress.com/thongwriter.36857185", "author": "Uncle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-09", "description": "I had a Frank Chu sighting today!\r\nI was in my friend's car stopped at the traffic light on Post and Montgomery. It was around 5p and Frank was walking up Montgomery St with his 12 galaxies sign in hand. \r\n\r\nYes, my brush with a celebrity.", "author": "Helen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-03", "description": "He's here, he's there, he's bleeping everywhere Frank Chu.  The modern day Joshua Norton with his non-sense 12 Galaxies sign.  So much that a club was named after him back in the day.\n\nHe's not someone I would talk to given the personal issues he has, but most people love his sign and what he's \"protesting\" so simply put--when in Rome... I wouldn't want to party with him but just seeing him at an event like the Lovevolution, Carnaval, or the Bay to Breakers (so much that even a group dressed up as him) makes everything more lively.\n\nPlus he needs the bucks--figured he got some sponsorship on the back of his sign (plus he's gotta keep making those signs from a Galaxy far far away).  I've grown to accept him as part of the SF landscape (similar to Marian and Vivian Brown) but in a more eccentric way  that the City has come to love (re: Tim Lincecum and Brian Wilson).  So, he gets 4 stars.\n\nFrank's the man.  Might as well name an alley in SF after him (even if he's from Oakland)... ;-)", "author": "N.A. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-06", "description": "Every once in awhile I'll spot Mr. Chu shuffling along on his focused way and I'm immediately reminded of one of the many reasons I love to live, work, and play in San Francisco.\n\nHe is an icon.  He is a constant.  He truly is special.  Knowing he is around doing his thing just makes me simply happy.\n\nThank you Mr. Chu....and thank you San Francisco for loving him.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-22", "description": "Frank Chu, the man, is an institution.  \n\nI've had an opportunity to talk to Frank at the 12 Galaxies (the bar where he gets free beer, not the far away universe where his family's life was broadcast as a hit television show, for which the CIA still owes Frank several billion dollars) and I have to say that he is hard to follow, but sweet-natured and passionate.  \n\nI have never met another person who was more compelling in the belief  that they were due a ridiculous sum of money as the result of an interplanetary conspiracy.  \n\nWe are blessed that San Francisco has been given Frank Chu, and I hope that people would not mock him, but greet him with compassion and acceptance.  Frank's aesthetic sensibility, conviction, and unique spirit have played a substantial role in making our city the gem that it is, and we should thank him.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-14", "description": "Frank Chu is my pal Alex's friend. She just got invited to his birthday party in March by his personal assistant Cliff (I think that's his name).  \n\nFrank yelled at me once down in the financial for a cigarette, and sort of freaked me out, but deep down i was touched that he would single me out.", "author": "Kristin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-08", "description": "By order of the 1,000 galaxies that have suffer from the crimes that the ah 12 galaxies that commit murder cases and treason cases and ah rape cases are gultied by support of the Bush adminstration and the Hoover administration. ah Clinton, behind closed doors in the White House ,has ah spied the CIA with ah my roomate which the CIA filmed me and my familiy has ah Clinton to pay me my royalties as a movie star owed me $25 billions for ah filming my life for Universal Studios and Hollywood film industry which is in the 9 billion galaxies population. For telepathic reasons I was interviewed by Dennis Richmond of KTVU Fox 2 and Kiet Do of CBS 5 news for ah the knowledge of the KGB that have used the spy cameras that brought hurricane force winds to the 545,000 galaxies that I met Joe Montana who is the greatest quarterback in football ...\n\nFrank Chu is San Francisco.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-07", "description": "Most unusual Frank Chu sighting the other day: \n\nI was on the 31 heading home after work, and saw a man seated in the front most seat opposite the driver. I was perplexed... sure, it looked like Frank, but no sunglasses, no sign above his head touting whatever randomness he chose to broadcast/protest that day...  Is it him? I wondered. \n\nI didn't see the sign, just a jacket behind him. He just looked like a slightly weary businessman headed home after a day at work, staring out the front of the bus so he could see where we were going. To see him so out of his element made me feel like I had caught an A-list actor at Target.\n\nA stolen glance as he got off the bus confirmed that it was indeed him. His sign had been tucked upside down and had been resting between the seats and the stairwell, the stick hidden under his jacket.\n\nSo, he had been a weary businessman after all.", "author": "Tara B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-19", "description": "My friend and I were crossing the intersection at New Montgomery and Market, and there he was standing there with his 12 Galaxies/Y-3 advertisement-sign.\r\n\r\nme: \"Look! It's Frank Chiu!\"\r\n\r\nconfused friend: \"Who??\" (looks around for a hot guy)\r\n\r\nme: \"Over there, holding that sign!\"\r\n\r\nconfused friend: \"Oh. Oookaaay\"\r\n\r\nme: \"Nevermind.\"\r\n\r\nThanks Yelp. If it weren't for you guys, I wouldn't have known his name or gotten excited when I had a sighting of him.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-15", "description": "Lost? \nLooking for something? Ask Frank. He gives the best directions in the City.  His specialty is, of course, downtown.  He knows the grid inside and out, having walked the streets like a million times.\n\nI bet he knows where every single Starbucks and Walgreen's locations.", "author": "Pea H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-23", "description": "This man is a moron.  The last time I ran into him, his fly was down.  \n\nI suppose if I sewed a quilt completely out of maxipads and waved it around town wherever there may be a rally - I'd get a little media coverage as well.\n\nminus one star for selling out to advertising .  At least stick fully to your lunatic mission and use both sides of your damned sign.\n\nCalling occupants of interplanetary craft...good grief; bite me!", "author": "Mc Matty b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-15", "description": "I see this guy EVERYDAY.  Finally tonight, I googled him.  \n\nWhat can I say, deep down, Frank must really want the Coen brothers to make The Big Chu.", "author": "Ian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-18", "description": "You know, I'll bet this guy's achieved some level of unsung stardom, his ever-changing protest sign is practically an instant VIP pass to just about every venue and event in SF... and anywhere in the 12 galaxies for that matter.  Almost.\n\nHis eccentricity aside, public fascination in his personality and his message represent something about Northern California living that I've always liked:  curiosity that's unafraid to get up close and personal to actually learn something about one whom too many other people would instantly dismiss as a worthless freak.  Look around the web and print:  there's a lot of respectfully inquisitive stuff that's been written about him.\n\nA lot of people sing his praises as \"SF local flavor\".  S'cool, but you know he LIVES in Oakland.  That's right:  MY town.", "author": "Alfonso E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "Frankly, (hardy har)...I must give Frank 5 stars. \nFrank's out of this world.\nFrank....... chu dont even know until you've seen him!\n\nHe's a legend in San Francisco. An asian man, sometimes with shades, sometimes not...always dressed in a collared shirt strutting along his picket sign promoting and standing ground for his \"12 Galaxies\" theory. He makes his way out to the city daily, dedicated to spreading his beliefs through his sign. He'll quietly walk around with his sign on the streets or at events, but he is also known to voice his opinion if you start something with him. \n\n12 Galaxies? Ask him, he'll tell you. Word on the street is some bars are required to give him a beer. \n\nRead about him in wikipedia. \nAhhh....Just another well known legend in SF. \nAnd, if you live in this city, you're eventually bound to run into him! \n\nSee ya around Frank!", "author": "Catherine O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-08", "description": "Professional Protester.  \nSocialist.  \nMy lover.  He'll take you to the 13th Galaxy.  \nOK.  Not really.\nHe's a capitalist.", "author": "Corrie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-12", "description": "I haven't seen Frank Chu in a while, but I always liked reading his crazy \"12 Galaxies\" signs and seeing which former president he wanted impeached that week.  There was a while where he had signage for his sponsors (Quiznos, etc.) on the reverse of his picket.  Bring back Frank Chu!", "author": "Andi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-12", "description": "Am I the only one who thinks Frank Chu is a nutjob?  Like, a TOTAL nutjob?\n\nI first encountered Frank at a party at Mr. Smith's (on 7th St) in 2002, where he nearly bashed me with his sign because he couldn't see in a dark room with his sunglasses on.  Then I moved here in 2005 and see him frequently while on my way to work.  I've never spoken to Frank, but he goes out of his way to get in my way every time he sees me.  I'm an agreeable fellow, honestly, so I don't get Frank.\n\nFrank's funky sign with its made up words is intriguing, which is why he gets two stars instead of one.  Perhaps someday when he's not busy getting in my way, I'll ask him about his clever turns of the English language.\n\nWhat does Frank DO, anyway?  And do the sunglasses ever come off?", "author": "Evan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-09", "description": "Frank.  Oh Frank!  Damn Frank, I'M TALKIN TO YOU!\n\nOkay now that I have your attention! I remember seeing Frank from my retail days on market, way back when!  I once followed Frank about 3 steps behind, just to see what his route was.  He gets a movin pretty fast and is rarly ever distracted.\n\nI wonder how much Frank would charge for shameless self promotion on the back of his sign?\n\nThings that make you go hmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm.", "author": "A P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-03", "description": "Every time I see Mr. Chu I feel like all is right in this beautiful corner of the world called the San Francisco Bay Area.", "author": "Meggie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-20", "description": "Frank got naked at my party.  He looks like a normal guy without his sunglasses.  \n\nIf you see him, invite him to a bar for a regular beer (Budwiser) and he'll tell you all about himself and the 12 Galaxies.", "author": "Gwen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-30", "description": "Choose Chu.  Of course he is a total nut job, but I have found him harmless, a little bit taciturn but always civil.  Of course, I don't know what in the hell he is talking about, but serious snaps for local iconic, idiosyncratic flavor in the Emperor Norton tradition of San Francisco. \n\nI have fond memories dressed in my Pee Wee garb for Paul Reuben's Day and having *Frank follow us* around.  Good times.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-18", "description": "A Haiku Ode to Frank Chu...\n\nMan of mystery. \nLover of twelve galaxies. \nSunglasses shield you.", "author": "Hannah Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-09", "description": "Frank was at my birthday picnic at Stern Grove this past summer.  I sh*t you not.  My friend Trav started talking to him at a Muni Station and brought Frank with him.  \r\nhttp://orangegirl.com/gallery/bday05/abp\r\n\r\nFrank loves to self-promote.  He fished out a SF Weekly article about him.  The article has been folded and opened so many times, there holes in it.  He should laminate that thing.  He actually spoke in english as oppose to the other 2 times he yelled at me on Market St in some 12th galaxy language.\r\n\r\nAnyhow we had a very nice picnic spread that we shared with him.  Someone brought Cheeze Whiz (gross) and crackers.  We showed Frank how to eat it and I think he ate the whole thing.  You teach a man to fish...i mean cheeze-whiz...", "author": "Julia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-02", "description": "I saw Frank in the Mission and he told me that he recently met former president Jimmy Carter at a book signing.  Jimmy gave him a free signed book and Frank filled him in on the 12 galaxies. \nThe word is spreading.", "author": "Johan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-10", "description": "Frank is one of the symbols of San Francisco.  I've seen him everywhere from the financial district to Union Square.  When he talked with me, he was fully coherent.  So much for thinking he's off his rocker.  Frank proves that the universe provides all you need.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-18", "description": "Screw the man screaming about god in front of the cable car then at Powell or even the mayor. I think I would actually listen to what 12 galaxy man has to say before any of them. He is too funny and nice, but who the HELL us he really? I don't know I just see him everywhere I go and I love taking photos with him for fun and waving at him like he's my buddy, he must think I'm crazy. I miss wed at Minna seeing him and the guy in the wheelchair and the bald old man dance, those were the days.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-18", "description": "Frank Chu was my welcome to San Francisco moment when I moved here 10 years ago. Love him. Love the mystery. Love the evolving vocabulary and the new velcro technology on the board. Loved it when he first got the idea to get sponsored on the back of his board. Loved getting down with him at the Saloon - he was wearing a blazer, a tie and an earpiece and telling all the women he was Secret Service.\n\nYou got my vote Frank - I don't care what it's for - you've got my vote Mr. Chu.", "author": "Ali N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-27", "description": "This guy should be called MR San Francisco, because I see him literally every day. There are a few days I don't see him actually--then I see him somewhere at night. Although, when I first came to SF he was really approachable and nice about whatever the hell he's protesting, but lately he's slipped a little bit. \n\nI saw him today (naturally) outside the Men's Wharehouse screaming at some random person. That's not the Frank I know. Rumor has it that there is a person out there protesting Frank's protesting. Only in San Francisco. My God. \n\nBTW-- Frank is paid by the City of San Francisco to walk around the city doing what he does, just like every other original bum out here.", "author": "Tim Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-31", "description": "I saw him today at the North Beach Jazz Festival in Washington Park.  There was an exchange of cash and then he handed his sign over to some guy and so he could put on this shirt the guy gave him which said \"Frisco Fights\" which I think is some minor boxing circuit.  His sign is now totally unintelligible; I had no clue what anything meant other than \"12 galaxies\" as all the other words were gibberish with no celebrities or anything.  He's gotten a bit belligerant as well at times during his rounds in the financial district.  I think he's losing it.  Yes, I know that statement is ironic.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-05", "description": "Frank is a great guy.  Frank would join my old boss and I for lunch or a beer from time to time.  On one occasion I asked him what was with the whole 12 Galaxies thing, and as far as I could understand it - there is/was a huge conspiracy that is as far reaching as the 12 Galaxies (some sort of intergalactic governing body of some authority), the C.I.A., and numerous politicians/celebrities.  Said conspiracy resulted in the theft of Frank's idea for the World's Richest Family - a would-be television show presumably about the world's richest family.  \n\nResponsible conspirators are described by Frank as being guilty.  Frank has confirmed that George W. Bush, Bill Clinton, John F. Kennedy, and other ex-presidents are all guilty.  Originally, before the attempts as permitting gay marriage, Gavin Newsom was also guilty.  However, following that, it is my understanding that he is no longer guilty.  Walter Kronkite is also innocent.  \n\nI just love how happy Frank looks whenever he finds a few other protestors with signs - he always joins the protest, and looks like he feels right at home.", "author": "Matthew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-26", "description": "Frank is the coolest.  Reliable, professional, yet hipper than anyone I know.\n\nIn short, he's a true icon, and San Francisco wouldn't be the same without him.", "author": "Christy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-03", "description": "Strange.  Very strange.  Has told me many times about how the government owes him millions.  Once I saw him at 111 Minna sleeping on a stool.  Was he wasted?  I dunno but he sure smelled like he was.\n\nFrank gets a new sign every week at Signographics.  Usually around 3:30, uses the bathroom and then reads a few pages of the dictionary.\n\nThis is true.", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-28", "description": "Frank Chu - Emperor Norton reborn?\n\nThere are many rumors about Frank, some may even be true.\n\na. He should have been a film and music star, but the mysterious \"12 Galaxies\" that control the universe conspired with various US presidents (all of whom have been cloned and live under the Whiite House) to prevent this.\n\nb.  Prior to this mistreatment and his one-man crusade against the \"12 Galaxies\", Mr. Chu worked in admissions at UC Berkley.\n\nc. Frank eats at Lefty O'Douls every day he's downtown and enjoys the roast beef.\n\nd. Frank has an almost magical sense of where and when TV cameras are/will be filming.  Almost no local crowd shot lacks Frank's presence.\n\ne.  Frank sometimes gets on stage at the 12 Galaxies and lets the crowd know what's going on in his life.", "author": "Gustie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-18", "description": "12 Galaxies GUILTIED: Frequent sightings at the corner of Bush and Montgomery around 9 am. \r\n\r\nThe FrankChu Vocab Report: Frank has moved beyond the -tronic, -vonic, -gonic, whatever-ic, and moved on to -ical, like gigmojunikal, zegnatronical, hecknocrapnikal, etc. His signs are more beat up than usual but the \"word of the day\" changes every day.", "author": "Trixie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-12", "description": "A downtown SF staple. I've worked in the FiDi for 10+ years and often search to see if he's around. I love when its Halloween because someone will dress up like him and have a crazy sign like him! My personal fave was the sign that simply said 'Who's your daddy?!' \n\nP.S. You probably don't want to engage him in conversation because needless to say he's nuts, my coworker did years ago and got an earful.", "author": "La C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-15", "description": "Frank is everywhere! Working up on 3rd and Market, I use to see him all the time, walking with a coat, and his crusade sign of \"12 galaxies\". in that aspect, he is a hero for being out there, everyday, protesting and protesting walking around with the sign. \n\nMe and my friend saw him one day talking nonesense to these tourist while they were waiting for the light to change. it couldn't have not changed any faster,.. We went up to him and said \"hey frank\" and his demeanor totally changed from crazy bum guy to decent nice guy trying to prove his point. \n\nNot sure what is point is, but its a delight to see him walking around and protesting. I smile everytime I see him and whip out my camera when I do! :)", "author": "Wilson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-28", "description": "Frank Chu is his own man with his own placard. Five Stars for character alone. That said, when he's bending your ear at the bar, keep your drink out of his launch area. His pie-hole can make a target-rich environment of your cocktail.\r\n\r\nOnce, while I was DJing at the Argus, he was on my then-GF like a cheap suit. He wasn't being a creep, he just followed her around like a stray dog and wouldn't get out of her grill. Sadly, I had to jump chivalrous and tell him to scram, one of only two times I've ever done that while DJing. In his defense, he totally stepped off.", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-18", "description": "I remember seeing Frank at a screening of a short film about him last year. He slept through most of it.\n\nKeep it up, Frank!", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-20", "description": "I love Frank.  I can always trust he will be at one of my shows, or at a city event.  This cat is so hip, he let's people pay him to advertise on the back of the sign.\n\nHe is the culture and flavour of this town embodied.", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-20", "description": "And who is that at Miriam W.s birthday party at Qool at 111 Minna last week? Why its the 12 Galaxies guy! Why who is that at the Saturday before Halloween in the Castro? Why its the 12 Galaxies guy! Who is that marching behind Mayor Newsom at the Gay Pride parade 2004? Why its Frank?  \n\nUnlike the countless sign holders and gospel tellers in NY, Frank knows how to stand out with his consistent branding at every major event.  \n\nHowever, the \"Jesus Christ Loves you\" guy is catching up with you Frank.  He was there at the SF Half Marathon last month and the Emerald Across the Bay yesterday and I have to say when in Mile 5, its nice to see that type of encouragement, I mean that guy, rumor has it, died on the cross, and if he can do that I can totally finish this race. SO I don't know Frank, you better step it up.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-14", "description": "I saw F.C. in front of FCUK in Union Sq, hahaha, what a coincidence. \r\n\r\nYup, I saw Frank Chu donning his sunglasses and carrying his infamous 12 Galaxies sign walking in front of French Connection. Haven't seen him in awhile, maybe he was on a hiatus? :)\r\n\r\nUpdate 5/20: Saw him at the Asian Heritage Street Fair on Irving St. He was talking some locals and I overheard them saying to him, \"It's good seeing you again, haven't seen you in awhile...\" Guess SF does miss this character every once in awhile...", "author": "Yan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-11", "description": "Man this guy has been around for a long time! Never spoke to the dude, but after watching this video interview with him, I'd better get caught up on my knowledge of the 12 galaxies, hurricane devices, FBI, CIA intelligence operations, etc... \nhttp://55broad.video.blip.tv:8000/Insurgent-FrankChuWordsOfWisdom324.mov\n\nhaha... he's a nut.", "author": "shaun l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-14", "description": "Anywhere where there are people, anywhere where television cameras lurk, Frank Chu is there.  Be it an Anti-War rally, a gay rights demonstration or just a BART station in the evening, Frank is always there.  i don't know if he's quite the genius of Joshua Norton, Emperor of the United States and Protector of Mexico, but he certainly has his appeal.", "author": "Herbert S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-04-25", "description": "Poor nut job stuck in some sci-fi novel, psychotic breakdown due to trauma or maybe a past life. \n\nOr more likely he just had too many drugs in the 60's?", "author": "Valerie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-25", "description": "Today I asked Frank if he was going to be at the bar named after him (12 Galaxies) on Halloween.  He replied that his presence will be required in the Castro, where he can protest among the largest number of people about why Bush doesn't pay taxes.\n\nGo Frank.", "author": "kathryn a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-24", "description": "Does anyone agree w/ me that Frank Chu himself should have a review on Yelp?  The Tamale Lady gets a Yelp, shouldn't Frank?", "author": "Des Esseintes I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-02", "description": "Small fish, big pond.\nStill, it's good to see the same fish swim by in different neighborhoods.\n\nUsually shows up on cue from mentioning \"this is where one would normally see Frank Chu\"", "author": "E.Mo. .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-10", "description": "Well the best sighting though was when Frank Chu was wandering around with the lesbians in front of The Kilowatt during the Dyke march last summer. And what exactly is his complaint? Something about 12 Galaxies? Well I saw Blade Runner over 15 times Mr. Chu, and there aren't 12 Galaxies, there's just this one inescapable dystopian shit hole that we've got here, you dumb fuck!!! Speaking of Blade Runner, I have been waiting 24 years for Rick Deckard to knock on my door, ask me what I think it means to be human, and ply me with his dark, depressing tirades and unicorn-themed philosophizing. What exactly are memories, Deckard? Come stand in the shadows with me, and I will do my best to explain. Where did I come from? Where am I going? How long have I got?", "author": "Eggs M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-14", "description": "I have spent plenty of time with Frank and he can be very sweet but I want to warn people that as interesting as he is, do not forget he does have a serious mental illness, it is untreated (he refuses therapy and medication) and he is potentially dangerous.I had to distance myself from him after he asked me to buy him a gun. Having had a past episode with holding his family hostage and shooting a police officer he cannot buy one himself. I explained to him the obvious reasons why he should not get one and It did no good because he later offered a friend of mine money to buy him a gun, this person also refused, but eventually he will get one and being reality challenged (no matter how normal he can sometimes appear in conversation) who knows what or when his paranoid delusions will cause him to use it. Once again Franks a nice guy and I'm not trying to talk trash just keep people safe. Just want to put that warning out there so people know who they are dealing with..", "author": "Kristina H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-05-19", "description": "Didn't his fifteen minutes of fame expire ten years ago?", "author": "Gourmet G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-20", "description": "Does anyone else find it slightly disturbing that his sign is now completely unintelligible? It used to make sense. Well, if you consider calling for the impeachment of Woodrow Wilson 80+ years after his death for crimes against some sort of intergalactic confederacy making sense. I guess he's still awesome in a way that only truly insane people can be.", "author": "Josua P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-05", "description": "Born on the 24th of March, 1960, this has got to be the hardest working man in protest-ness!  Seriously, you can't go anywhere without seeing the always-debonair Frank and his ubiquitous sign present, marching about, doing his thing, whatever it is.  Frankly (no pun intended; or maybe, now that I think about it, it is), I'm surprised there's no review about this oddly fascinating San Francisco character.  I remember watching KRON-4 in the mornings with Phil Matier, and more often than not, there would be Frank Chu, bright and early in the morning, marching around with his trademark sign, dark glasses, short sleeve shirt, and passive expression, regardless if he was \"IMPEACH\"ing \"CLINTON\" (\"I want to be the first person to impeach an ex-president,\" he once said.), \"STRATOSPHERICAL,\" \"WASPROVENICAL,\" \"CHRONOGROKENIAL,\" or his favorite, \"12 GALAXIES.\" (from whence, of course, the club got its name.)  Last I saw him, at QOOL, he'd somehow made his way to 365,000 GALAXIES!  Now, that's one busy bee if you ask me.\n\nFrankly (once again, no pun intended), I think EVERY city/nation-state needs its own lucky protesting-prone alien -- we're no different here in Baghdad-by-the-Bay.  Thank God we have Frank.  What could we do?  I've got an idea:\n\nCESIROGRENICAL ERGONOMICS.\n\nHey, come on kids; it's worth a shot!", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "This man is a SF Legend!  And a likeable one, not like that cranky NO SEX guy who is always on Market Street.", "author": "Jenn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-05", "description": "whenever i see frank, he makes me smile. he's the one constant in our ever changing city. frank is dedicated and resolved in his belief. he's quirky and wacky yet completely endearing. if the rest of the country can't figure out san francisco, then frank is san francisco within san francisco. the man is a treasure to our city. one of these days, i sincerely hope that we name a street after him.\r\n\r\nby the way, frank actually holds the guinness book of world records for longest consecutive protest. it's true. now how many people can say that they have their name in the guinness book?", "author": "frisco j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-29", "description": "So many times I see Frank downtown or at the ballpark, and so many times he's denoting new vittles of wisdom.  One, though, remains particularly salient in my brain.  Two words I had never before seen juxtaposed and have yet to see since: \"Copious Horrendous.\"  Frank Chu makes Stephen Hawking look like a dullard and a lummox.", "author": "Doug K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-08", "description": "seriously, does he have a million doppelgangers or is he really just everywhere?   i was at the Up Your Alley fair the other day and i said to my friend \"ha, wouldn't it be funny if Frank Chu showed up here?\", and i turn around and there he is, like 2 seconds after i said that.   or maybe he's like Everywhere Man from Batman and can clone himself...http://en.wikipedia.org/wiki/Everywhere_Man\n\nwhatever it is, it's kinda eerie how that boy gets around!", "author": "Suzanne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-15", "description": "Yo, Frank Chu is the best \"local flavor\" a city could have... Like, Ba-dow!  He's Fantastic.  Once, at a barbecue at Pop's like 3 years ago, he fed me a hot dog, it was, almost, romantic.   He always seems to pop up in the right place, and I love the way news guys help him get places and stuff, it's just grand!  His cool violent history holding people hostage story is pretty cool, too, like one glorious day, Frank is just going to decide the free beers at 12 Galaxies and the local celebrity are over-rated and he's gonna snap, and in some fucked up way, I'll find this hilarious!  Actually, this is a bit hyperbolic.  Frank is very human and approachable and I think just as sane, if not saner, than people who shop at Bloomingdale's and driver gigantic Hummer vehicles around.  He's just, you know, kind of got his own message about the CIA owing him lots of money because his family's life was broadcast as a hit television show to millions of viewers in a galaxy(ies) far, far away...  I mean, don't we all?\n\nSo, yeah, you should hang out with Frank and buy him a beer, he always remembers you and after all, it's kinda cool to have a friend out there, in the interplanetary ether, you know, just in case.\n\nFrank, you rule!", "author": "Ben V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-09", "description": "Frank Chu is the best protestor in the Bay Area. Hextrotronic!", "author": "Mitsi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-28", "description": "Frank Chu is giving Emperor Norton a run for his money.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-31", "description": "Frank, your TV appearances are up, but your in person appearances are down.  2nd and Market used to be your anchor.  I am still here, but where are you?  Still, when all my friends - even Tim- were too smart to do another shot of tequila with me at 12 Galaxies, there you were.  I did not come to honor Frank, but to impeach him.  Kudos.", "author": "Lemmy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-29", "description": "Frank Chiu manages to show up at all the cool parties in town.  I went to watch a concert at 12 Galaxies, and there he was.  I hear they actually named 12 Galaxies after his sign.  Wow.", "author": "Kris L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-02", "description": "one star off for being crazy.\r\n\r\none star off for selling out and having ads on his sign.\r\n\r\none star off for pretty boring repitition.\r\n\r\none star for not getting crazier\r\n\r\none star for persistence and finding his way to all the protests.", "author": "Today Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-06", "description": "Forgot to Yelp about this- but I have only exchanged glances with the man.  BUT I did get to hang out with all of his 7member fan base who decided to dress up as him on Halloween.  That was soooo much fun!", "author": "Yelper A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-07", "description": "Frank Chu added the necessary \"WTF\" to my lunch hour to make me snap out of my work-induced trance and enjoy my meal.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-18", "description": "Frank Chu!  Haha, I remember first seeing this mofo when I started working in the FiDi.  Cracked me up!  I thought he was a crazy homeless person until I found out the dude lives in the East Bay and is supposedly pretty well off.  Must be if his life's work is to walk all around San Francisco  carrying his crazy signs.", "author": "Luis M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-14", "description": "Plus: One of the stand-out features of San Francisco.  This dude is the spiritual heir of Emperor Norton.\r\n\r\nMinus: Republican.  Guy must be crazy.", "author": "Will S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-01", "description": "I saw him at Kearny and Market Yesterday. He was advertising Minna again. I think he may have lost weight, his gut didn't stick out like usual. His clothing looked better pressed and sharper than usual.", "author": "Joe D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-19", "description": "cool.\nanyone see the crew of Frank at this year's B2B?\n\nfab-ulous!", "author": "Bea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-09", "description": "I kinda miss Frank. We use to share a moment every day on the corner of Montogomery and Pine. But ever since I quit working in the financial center, I no longer get to hear about the 12 Galaxies. :( Thank goodness that Frank gets out and about. I've seen him a couple times at 111 Minna - if you watch him carefully, he's actually dancing. Well, ok, maybe he's just vibrating because he's standing so damn close to the speakers.", "author": "Peter S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-17", "description": "It's definitely not Downtown San Francisco without him and his sign. If you're wondering, lately I've been seeing him do his rounds in the Financial District during lunch time.", "author": "Zell C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-15", "description": "Frank Chu is an icon. An establishment. A staple of San Francisco! His signs used to make more sense and included mostly english and a single line of gobbldygook (back in the \"Impeach Clinton\" era). These days however, I'm afraid they've degenerated to complete nonsense. I blame the Republicans! He has a freaking restaurant named after him for goodness sakes where apparently he gets free food. He has his own fan websites. Seriously. This guy is hardcore. 12 Galaxies! Hextrotonic! Ebullent Inoculations! Waste! Cykrozirtequo!", "author": "Jordan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-05", "description": "This guy has his own Wikipedia entry.  This guy has a huge bar in SF named after his picket sign.  One morning I walked into McDonald's for an Egg Mcmuffin.  This guy was sitting next to me, enjoying his 2 apple pies.  I love THIS GUY~ But what's with the selling out and free shit? Did Pink Man do anything like that?", "author": "Joyhan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-13", "description": "My friend once invited him into The Royal Exchange for a beer. As the night rolled on, one thing led to another and my friend and his boys headed over to the Gold Club (nudie bar). Frank came too and carried his sign with him the whole time! Frank got kicked out of the Gold Club for trying to touch the strippers.", "author": "Cindy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-30", "description": "thanks to google maps street view, Frank has been captured for posterity in his natural environment:\n\nhttp://laughingsquid.com/frank-chu-located-on-google-maps-street-view/ \n\nhella SF.", "author": "Denise H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-03", "description": "I am dying of laughter right now to see that others have noticed this man..... I was recently filming a protest near the civic center and I couldn't get him out of my shot, he kept jumping in front of the camera. I then saw him more recently at the filmmore street fair and got to show my bf who i was talking about. 3 stars for making me laugh especially this post. Thanks Yelp!", "author": "Sari G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-06", "description": "The silver lining on every cloud.\nMaybe your protesting, or doing something that takes itself serious, but he'll be there, and he'll brighten your day.\nDon't expect him to remember you, but expect him to say something worth listening to.", "author": "Boone A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-01", "description": "Local celebrity who you will find at every major event. Any guy who can manage to get himself on TV all the time and has a bar named after himself is cool in my book. :)", "author": "Candy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-19", "description": "Frank Chu in a leather bar in the Castro on Easter...yes...with his sign.", "author": "Adrian N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-23", "description": "I see him at least 5 times a week. What he's lacking in mental stability he more than makes up for with pure determination.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-28", "description": "was at 12 galaxies a few years ago and watched a live drum n bass show... anyway frank chiu was there so he sat with us at our table with his bottle of beer... i think it was bud...\nanyway so he's talking about his stuff that i couldn't really hear cus of the loud music...\nhaven't seen him around downtown lately though...\n\ni wonder what the link between the venue in the mission has to do with his 12 galaxies thing....???", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-07", "description": "Frank was the man back in the 90's, then he sold out to Rasputin Music a while back. Though I think that he flipped the script on that ad campaign. An intergalactic juggernaut, Frank is everywhere where you want to be.", "author": "Be N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-14", "description": "You are not truly a San Franciscan until you've had a run in with Frank Chu.", "author": "Don O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-10", "description": "5 stars for his speech/video (check google) in which he drops knowledge on: Quintrological Galaxies, Alphatronic Rockifications, Humanoid Spacifications, Quadraloglical War Crimes and Tetralogical Cosmopolitans!!!", "author": "I. O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-13", "description": "It's hard to tell where he falls on the scale of \"schizophrenic\" to \"performance artist.\"\n\nThe first time I ever saw him, I was visiting San Francisco to hang out with a friend who was visiting from London to go to a professional conference--I did not yet live here at the time, and had never even heard of Frank Chu.  His sign said, among other things, \"Impeach Garfield.\"  As confusing as this was to me, it was even more confusing to my British friend, who did not know we had had a president named Garfield.  He thought Frank had something against the cat.", "author": "Zannie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-20", "description": "I love reading his signs as well as feeling the creep vibe every time I see him.", "author": "Ericka A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-19", "description": "I love that Frank is always at the events that I'm at. My one question is: Does Minna gallery actually pay for the advertising space on the back of the sign or is the foodie lying to me again?", "author": "Terika B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-07-20", "description": "I saw him a few weeks ago at the SF Pride parade sans sponsors.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-19", "description": "Frank is the KING!   I just ran into him and got his latest update: he was in the parade yesterday talking to Mayor Gavin and then on the news.  I also saw him on tax day outside the Israeli consulate walking with his sign in a protest.  You go Frank!", "author": "Chard M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-30", "description": "I must admit that I didn't know this guys name until I stumbled onto these reviews. But, I see Mr. Chu more often than I see my own brother. To me SF wouldn't be SF without some guy carrying a sign for no apparent reason and then suddenly YELLING in strangers' ears. I deducted one star because he scares a lot of tourists. With the yelling. Not that there's anything wrong with that.", "author": "Johnny O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-15", "description": "This man is a fucking San Francisco LEGEND! The definition of an icon, Frank Chu has earned his stripes putting in countless hours on the streets of the city propagating his senseless intergalactic message.", "author": "Peter B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-03", "description": "Talk about dedication... Frank has been making his daily rounds (Financial District, Union Square, etc.) for years. I see him almost every morning, like clockwork, as I head towards my office -- and it brightens my day. I heart 12 galaxies forever.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-28", "description": "all this talk about frank chiu being a mascot for san francisco and i've only seen this mofo in oakland, walking to bart at about 7 am in the morning.  i think the sf institution actually lives in the east bay! scandalous!", "author": "Laura B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-09", "description": "If you're a true San Franciscan, ya gotta love Frank Chu. I first remember seeing him around when his sign read something like \"IMPEACH CLINTON! for Crimes of 12 Galaxies!\" Something like that. It was quite odd, as Clinton had already been impeached. Well, for something else. It cracks me up that there's a hot debate in the local Psych community about Frank's \"condition.\" Self-described professionals can't seem to agree on whether he's schizophrenic or not. For my purposes, I simply smile when I see him, sometimes say hello. He can be quite cordial and plesant, but it's best not to try to reason or argue with his Galaxies campaign. It's his mission and that's final. :-)  While in reality San Francisco's notorious \"crazies\" are not always the happiest of people, they certainly do add local color. Frank is the only \"classic\" that I currently know of. The Naked Yoga Guy doesn't really count. I don't include Marian and Vivian Brown, bless their hearts, because while they are visually quite striking and memorable, they are not loony.  I miss Suzie Sounds and LaSalle LaSalle. Anyone remember them? Gone also are the Red Man, the White Lady, the masked skaters and skating fandancers and sadly the Human Jukebox. Thank goodness the mimes went away with the 70s. They may not have been \"crazy,\" but they were one of the more obnoxious icons of local color.", "author": "Dean E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-07", "description": "he is building a clone army. seek his minions and ye shall find him.", "author": "Delilah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-15", "description": "Frank is awesome. Period.  He was even on my firm's scavenger hunt.  Classic SF.", "author": "Kay F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-02", "description": "i have a frank chu story--- here it goes.  one day i was with some work people at royal exchange, and we're kind of sitting by the window.  my coworker sees frank, and is like \"there's frank chu!!\" (he's a big fan) and he kind of waves him inside.  So Frank Chu actually came inside and sat with us, and we bought him some beers (budweiser of course) and he told us some of his conspiracy theory stories.  anyway, the whole time, i was just sitting there amazed that we were hanging out with frank chu!  I felt kind of like we were hanging out with a celebrity!! he is kind of one, right?  by the way, if you didn't know, he does have real corporate sponsership--at least that's what he told us.  at the time, I think it was yahoo.  so awesome!", "author": "Yvette H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-09", "description": "I had been calling him the 12 Galaxies man until a friend directed me to Wikipedia. Low and behold, Frank Chu's got a Wikipedia (and an extensive one at that) entry written about it. The day after I found, and absorbed all there was to this man and his sign and his legendary status, I hopped on an F car headed down Market. The car made a stop and who should board... Frank Chu, sign in tow. I may have sat there giggling for the next five minutes just having been in such proximity.", "author": "Emily P."}
