{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "A solid neighborhood deli that deservedly sees crowds of people during lunchtime. Pro tip: order ahead of time here on Yelp before you make your way here so that you can skip the line and pick up your order upon arrival.\n\nThe Italian combo sandwich on Dutch crunch has been one of my go-tos: a huge heap of meats embedded in some really nice, fresh, delicious bread. When I'm not in the mood for so many calories (or processed meat), the falafel pita sandwich has also been a dependable go-to, although here I order a larger size to compensate for the fact that it's not meaty.\n\nThe owner who mans the premises is a super cool guy, and in addition to the sandwiches, you can grab sodas, chips, or other snacks. It's basically your urban neighborhood corner store with a deli that punches far beyond its weight. Thanks Yelpers for an exceptional find!", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "This spot was recommended to me by my coworkers in San Francisco. They mentioned it was a staple sandwich spot in the city and we had to try. \n\nIt's a really small shop that looks like it hasn't changed in many years, not a bad thing at all. They had many different options for sub sandwiches, a small deli fridge with some salads and a large selection of drinks, chips and candy. \n\nThe staff isn't super friendly or outgoing, but work with a purpose and bang out sandwiches relatively quickly. \n\nI ordered the Italian combo sandwich that had salami, ham, cotto and cheese on soft sourdough. The ratio of meat to veggies to bread was solid, and overall it was a good sandwich. \n\nNothing to knock your socks off, but a really solid sandwich.", "author": "Jonathan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-24", "description": "*3.5 Stars\n\nGreat bread, no fuss sandwich shop. Get your sando on the hard sourdough roll! The cold cuts, however, are not my favorite. I feel like the meat quality could be brought up a notch. Feel like they have a good thing going though. Consistence joint good for a casual quick bite. \n\nWhat I ordered: Italian combo with everything on the hard sourdough roll.", "author": "Hannah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Best sandwich I've had in a really long time!! We got turkey with american and all the toppings that come with it. It's served with mayo on one side and mustard on the other which sounded weird but ended up being delicious! The bread was great too. I got the hard sourdough which was a little tough on my teeth so maybe I'd recommend going with the softer one. \n\n\n\nThe person taking our order was very nice and friendly and patient. There's limited outdoor \"seating\" I.e. a bench and a couple stools. We took ours to go and walked down to the fisherman's Ward to eat there. I'd definitely recommend doing that it was fun!! Again, would HIGHLY recommend.?", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "Delicious sandwiches! Italian New York style deli. The small is big! When it says 6 inches...they mean 6 inches wide!", "author": "Jen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Whenever I'm traveling, I'm a big fan of eating wherever the locals eat.  Yeah, sure, touristy stuff is always fun to do, but when you see a line out the door for an unassuming eatery, you knew I had to ditch whatever lunch plans I'd made, and stop in. \n\nFreddie's Sandwiches has been around since 1926, and walking into this sandwich shop will time warp you to that era.  Old wood shelving, a simple counter top and deli meat display case, weathered menu and an old school register. Place your order, stand to the side and wait (not long) for the hard working sandwich makers to put together your sandwich.\n\nI went with the turkey pastrami (hot) and was not disappointed.  It was stacked high, tender and juicy, and perhaps the best part was it didn't have the stringy pieces traditional pastrami normally has (oh, and I could swear I was eating regular beef pastrami the whole time).  They also cut the sandwiches in half, and individually wrap the pieces, because these sandwiches are PACKED and you'll have trouble eating the whole thing.\n\nAfter spending two days in San Francisco, my wallet was starting to yell at me every time I opened it up to spend money (stuff is expensive here).  Not at Freddie's. The price I paid for my enormous sandwich and soda (around $12) wasn't bad at all.", "author": "Rafael A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "One of the best subs I've had in SF!!! I also love marina submarine, but it's cash only and the line takes forever- this was so easy, half the price and almost even better! Ordered 1 sandwich on Eat24, was at my door in 30 min and the order was spot on. Got the club sandwich on soft sour dough bread and the bread was truly soft (other places say soft, but I find myself trying to rip through it) and there was plenty of meat. Excited I have a new go to and can get just 1 sub straight to my door now!", "author": "CJ T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "I stopped by here to grab a sandwich after a tour of Alcatraz Island. They were in the process on cleaning all of the deli equipment in preparation to close, but still were able to put one together for me.\n\nI ordered a roast beef sandwich on sourdough bread. The sandwich was incredible-- there was plenty of roast beef, the sourdough was fresh and light, and the rest of the sandwich was delicious. Very happy that I chose to go here over nearby Boudin.", "author": "Ben C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "Small and local sandwich shop. My favorite.\nQuick, cheap, tasty. There is a lot of variety of menu.\nI got Italian combo small size with onion roll. $7.\nEven small size, it was more than I can finish for lunch. I went there Friday noon but there was only 2 customers before me. They made my sandwich right after I ordered there and took only a few minutes.\nI want to try crab sandwich next time.", "author": "Nazuki Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Best f*cking bologna sandwich ever and I don't even like bologna!!! I was recommended this place by a former manager and have ordered from them a few times now! Get that sandwich!", "author": "Desiree B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Solid deli perched on a hill in North Beach, and close enough to my workplace for a nice midday walk. This beats having to go down to Trader Joe's for lunch, and it definitely beats overpaying for a sandwich down in the Financial District. I spent less than $10 here and walked away stuffed, so this is definitely a good lunch choice.\n\nI went for a small Italian sub with small side of potato salad. The Italian sub was delicious and the meat bountiful. Their salame and salame cotto are special standouts, while ham is a reliable, salty addition. All the fixings here includes pickles, onions, lettuce, tomato, mayo, and mustard. Some add-ons are free, such as their garlic spread, which is a little similar to the one at Little Lucca down south. If you're coming with another person, you could theoretically buy two sandwiches and swap, as they come wrapped as two halves.  For $6.95, this is a San Francisco steal.\n\nThe potato salad was sadly not what I expected. This tasted like a mishmash of egg salad and potato salad, and I don't really like egg salad. However, the portion was quite good for $2 more. \n\nThe other sides, like pasta salad and potato chips, are also relatively affordable. There are also many drink options if you're craving something sweet. From Mexican Coke to guava Fanta, there's bound to be something from your childhood that you desperately want to have. And if anyone gets a chance to try what looks like homemade baklava on their counters, let me know how it goes, 'cause I'm craving.", "author": "Gwen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "In a tiny little hole in the wall store but these sandwiches are so good!  I'm so glad we decided to walk two blocks from the Pier 39 tourist trap!!!we both had the hot pastrami sandwich. Yummmmmmmm", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "Straightforward and unpretentious sandwich shop that gets you in and out with minimal fuss. Freddie's Sandwiches has been serving lunch sammies to hungry customers since 1926. That's almost a century now! \n\nChoose from 20+ sandwich options and numerous  kinds of bread (e.g. sourdough hard vs. semi-hard vs. soft roll). Anything from Jewish classics like hot pastrami to everyday staples like chicken salad. My personal favorites here are the Hot Copa and the Italian Combo. The latter consists of a mix of hams, salamis, and cheese. Yes they are pretty meat-heavy options but oh so satisfying. I've found the small 6\" sandwich more than enough for me but you can go larger (8\") or \"I hope you're sharing\" huge (half or whole loaf).\n\nLines can be long during prime lunchtime but they're pretty efficient and try to get you in and out as quickly as possible. It's satisfying sandwiches, quick service, and the fact that they accepts cards that make Freddie's a lunchtime staple in the neighborhood.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "Delicious, fresh subs with a variety of bread options including Dutch crunch and soft sourdough. A small is around $7 and is certainly not small. It comes sliced in half and a small could feed 2 people. A great to-go option!", "author": "Leeyen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "BEST deli sandwich I've had in the city! Better then molanaris! I know! Never thought I'd say it! They're peppered turkey and Dutch crunch is unbelievable! Hidden little gem! And been around since 1926!!! LOVE LOVE LOVE this place!!!!", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "First time I came in 2016 i had and loved the Italian combo I ordered! This time I decided to try the club and also try Dutch crunch bread and it was seriously the best decision I've made!!!!!! I've never had Dutch crunch before but I think it might be my new favorite. I typically always get wheat or white bread so if you like those kinds seriously give Dutch crunch a try here. Your welcome ;p", "author": "Jaz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "As many already stated, their sandwiches are great. It's a little pricey, but the quality is worth splurging on. You can also call ahead & place an order, but even as a walk- in customer, the longest I had to wait was maybe 10-15 minutes.", "author": "Lucy G. K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "My favorite place to get sandwiches every single day. The owner is super friendly\n\nMy go to sandwich is the smoked turkey, dutch crunch bread, pepperjack cheese, with everything, toasted. Definitely try either the jalapeño/pepperocini/garlic spread. Pepperocini is my favorite.\n\nIf you're in the mood for a fatty meal, definitely get the hot pastrami", "author": "Dylan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "I love this small and local sandwich shop! Everything from the food, the unpretentious look and feel of the shop, the plastic benches outside, the friendly owner and staff; this place is what I imagine in my dreams when I think about a great local business. It just has that local family-owned business vibe that I personally love.\n\nWhat I liked:\n* Great tasting sandwiches with generous amounts of meat and fresh ingredients\n* Interesting shop with a ton of drinks/sodas lining the shelves\n* Small local restaurant vibe with plastic benches outside (if you're high brow, this might be a con for you, but it added to the vibe for me)\n\nWhat I disliked:\n* The wait is fairly long since this place is popular and many people order on the phone and pick up. This isn't a place I would go to if I was in a hurry.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "I can't really write much about this spot since It was catered for a meeting I was just at. I really enjoyed the potato salad, well I love potato salad so it isn't really hard to impress me. \n\nThe sandwich... well that was just ok. It's hard to impress me there when I have been so privileged with Roxie's (my childhood sandwich hot spot in the city).\n\nBut I'm thankful either way. :) If I am ever near, I'd try their tuna. Looked appetizing!", "author": "Jray M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Dutch crunch! The Italian was amazing. As was my tuna salad on whole wheat.  No real sit down spot except benches outside, but it was a beautiful day.", "author": "Kristen O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "I got a turkey sandwich and while it was delicious, I did not think it was worth the price. I would highly recommend ordering online first because the line gets quite long especially around lunch time. It is one of the few good places in this area though", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Fine sandwiches made with care and good ingredients.  Nice bread.\n\nMy only complaint is that their accompanying salads (pasta, potato & egg, coleslaw) are always a little disappointing.", "author": "William K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-03", "description": "Delicious! that's what my husband said. We actually stumbled onto Freddie's by chance. We were walking down Stockton toward the wharf.  I saw the sign, since 1926,  has to be good. Ordered the Club Sandwich on semi hard sourdough, the best bread ever. They even had it lightly toasted. The sandwich was excellent. Took a little time to make the sandwich, lots of selection of drinks. Will visit if we ever in SF again.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Pros: Gotten the Italian combo once but not for me. Extremely generous with the meat. I normally get the veggie sandwich every time I'm here. Super fresh and lots of flavor.\n \nCons: Typical long wait during lunch rush hours make this small local shop kinda cramped. Try coming at least 15 mins before noon or placing your order online. \n \nOrdered: Small Veggie Sandwich ($7) \n \nWould I recommend: Yes!", "author": "Terry N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Best sandwiches In San Francisco I had ever tried. Nice little mom and pop store, easy grab n go. Affordable and good quality foods to make their delicious sandwiches. A must stop location when your around the Fishermans wharf.", "author": "Kristopher G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "My go-to Sandwich spot which is saying a lot because NB has a TON of sandwich options. Their soft sourdough bread is sooo good on my Italian sando.", "author": "Garrett S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "These sandwiches f*** sh** up!!!%#&^! Apologies for getting all vulgar, but saying \"these sandwiches were really good!\" would not suffice to the level of GOODNESS SERVED IN THESE SANDWICHES!!!¡¡!! \n\nGot a hot pastrami to-go, not knowing I had a hell of a sandwich on hand. As I was on the sidewalk walking towards the pier, we unraveled the sandwich and when I took a bite, I had to stop. I had to stop walking to take in what had just happened to me. I was in disbelief that I could ever have the thought that I may like these sandwiches more than Ike's love and sandwiches. \n\nI went as far as to go on Zillow to look at how much housing around this sandwich place was, even though I already knew I could never afford it HA. Anyway, if you happen to have 4 million $$ laying around, I'd recommend living right next to this sandwich shop because it's so good you could probably eat it 3 meals a day ;)\n\nHope to eat you again soon Freddie's!!", "author": "Annie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Great local place to grab quick lunch! Tasted great and had tons of options, people were very friendly as well. I would recommend and definitely go back.", "author": "Isabelle O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Favorite sandwich spot, ever. The soft sourdough is the best bread I've ever had. The small size is way more than enough for less than 8 dollars.", "author": "Pj M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-29", "description": "I really cant add anymore than Adam S has said but this is a legit sandwich shop. \n\nHad a chicken salad on dutch crunch...and everything was good. The bread is very fresh. The chicken salad was amazing. \n\nAlso had a side of potato salad and it was good as well.\n\nAtmosphere is nonexistent but that's not why you're here!\n\nPrices are fair", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Been looking for a place like this! A delicious sandwich shop that is a hidden gem. Has a great local feel to it, everyone was so courteous and friendly. Got the hot pastrami and it was SO GOOD! I'll definitely be back and will recommend to everyone who's hungry!", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "I went here a month ago and was told the workers were tired that the excuse was given I believe from the owner I paid for cheese and I wanted chicken in my sandwich but it was flat with no meat \n\nI took it back and did a review on this sandwich shop and said actually what had happened & \n\nTHIS IS THE RESPONSE I GOT FROM FREDDIES SANDWICH SHOP TODAY 10/9/2017 AT 7:45am\n\nWho the hell are you to bitch about some cheese! Get a life and quit your complaining! We definitely remember you and please don't ever come back!", "author": "Jay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-11", "description": "I was quite intrigued by such a high Yelp score near such a touristy area.  It's a bit into a residential neighborhood, so it's definitely not touristy and seemed quite popular with locals.  Apparently it's been around since 1926; though the aesthetic is very 60s/70s.  The sandwiches are packed with a ton of meat and are reasonably priced (for San Francisco).\n\nItalian Combo on Dutch Crunch (Whole Loaf): Apparently one of the more popular items, so had to try it.  It had four types of meat (ham, dry salami, pressed ham, salami cotto) and provolone cheese, all in generous portions.  I ordered the 25-inch whole loaf, since I was feeling gluttonous.  I had it cut into 4 sections and just 1/4 was enough to fill me up for lunch.  Yay, leftovers!  Technically speaking, it seemed like two small footlong loaves since my sandwich had four end pieces.  No fancy ingredients, very no frills, but still delicious.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Such a nice place. Staff were very nice to our three kids. A nice break from the touristy area yet close enough for tourist to walk to. Delicious sandwiches.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-28", "description": "Pretty mediocre sandwich place. Clean small and efficient. I got the pastrami sandwich as recommended but was not a huge fan. Tried it with their spread with all the fixings except mayo. The meat itself was really salty but there was plenty of it.  The soft sourdough bread was killer though! I ordered it through Yelp because I work nearby and this was one of the higher rated places. Theres definitely better sandwiches out there so I wouldn't go out of your way.", "author": "Navdeep D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "Tour guides will probably take you to Molinari, so here's how you get the best sandwich there:\nHead northwest on Columbus towards Vallejo\nTurn right on Stockton\nTurn left on Francisco.\nWalk into Freddies and order an Italian Combo on dutch with hot pepper. \nBest sandwiches in the city by far.", "author": "Scot V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Sandwiches the way sandwiches should be!\n\nFreddie's is one of those places that you might walk by time after time and not get curious enough to walk into, but once you do you'd hooked for good! \n\nThis little place offers a wide variety of sandwiches made with fresh ingredients that are combined in variety of delicious ways! If you are visiting North Beach and want to grab something on the go, Freddie's is the place for you! If you live in or around the neighborhood and want to grab a sandwich before you go on a hike or seat in a park and have picnic or just have an awesome sandwich, guess what? Freddie's is the place for you! \n\nMy favorites are Italian Combo and Mortadella Sandwiches, but everything else I have tried has been good. No one can beat Freddie's when it comes to quality and price! Don't believe me? Find out for yourselves! :-)", "author": "Afshin A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-28", "description": "Good sandwich! Waited a full half hour for it.\n\nLine size is deceiving... they take orders by phone (& online?), so while line not so big they have huge orders of 5-10 sandos at a time queued up ahead of you, people coming in and out to grab. It'd be nice if they said something. If line were around the block I would not have come in.\n\nTakeaway: Sandwich good but not that good. Call ahead, or otherwise go somewhere else.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "My favorite sandwich deli spot, so glad it's in my hood!  Nice owner and staff, delicious fresh salads, many drink options and love the cookies and baklava. Stay awesome Freddie's...", "author": "Lola M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Amazing deli sandwiches. I'm a sucker for a solid cold sand which and this place does the trick! \n\nTurkey pastrami on semi hard sourdough, top notch stuff!", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Been coming here for years, one of the best sandwich spots in the city! They have a line so call ahead to get your order.  They are so nice and the sandwiches are fantastic!", "author": "Sheila N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-16", "description": "We come here for their reviews. We were expecting excellent sandwiches. The sandwich were average, not bad but no reason to go back. There is no seating, although the owner was kind to get us some chairs, but if you are expecting a side down place, this is not it. Sandwiches are good size.", "author": "Adelaide B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "Great service, I had the popular italian combo it was the best sandwich. I would make this a must to try while in San Francisco.", "author": "Sherrie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Favorite sandwich place. Ever. \n\nStellar service. Beautiful bread. Delicious dinner, lunch, or breakfast. \nI usually get the Italian combo. The small easily is enough but the loaf ensures that I can enjoy Freddie's for more than just one meal. Soft white bread is a MUST. The sandwich contents are perfect for the bread-to-filling ratio. Salami, provolone, ham, and everything else promises a variety of flavor in a single sandwich. \n\nParking is tough nearby, but can always find street parking up or down the block and the short walk is well worth it.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "The best Sandwich Spot hands down. My personal favorite, hot Coppa on Dutch crunch everything on it and the spicy spread. I'm addicted to it! I've been coming here for almost a week now. It's really hard to find a spot with good deli sandwiches but I am so lucky to find one so close to my job. I guess that says a lot since this place has been here since the 1920s.", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "90 years is a great run.  Think about it, when this place got started, Calvin Coolidge was the President.  Silent Cal.  I kid you not.  The Depression was years away, Franklin Roosevelt wasn't even the Governor of New York yet.  It was Prohibition.  Several of my grandparents weren't even born.  There was no such thing as Mickey Mouse.  No Golden Gate or Bay Bridges.  30 years away from the Giants and Dodgers coming to California.  Don't even think about TV, Computers, or Cell Phones.  Or, Smart Phones.  We are talking seriously back in the day.  Old School.  And, my friends, there is a reason Freddie's remains:  \n\nFreddie's makes a damn good sandwich.  It is not the most novel sandwich.  It is not a foodie adventure.  There are many fine sandwiches around but I'll tell you that this is my Desert Island place if I could only have one place because they do things right.  \n\nI was first exposed to Freddie's several years ago on Nob Hill.  Freddie's #2 was located on Pine Street, between Polk and Larkin.  They had the exact same menu.  The first several times I passed by I thought little of it.  Then I tried the Italian Combo.  I don't remember how I struck up the conversation exactly, but the proprietor recommended the Pepperoncini Spread on the sandwich.  From there, it was on like Donkey Kong.    At any rate, Freddie's #2 became Ti Ti Cafe (same menu, new owners, who I believe were former employees).  That lasted only so long.  Now the location is occupied by Cookie Love.  I am very sad that it is gone.  It had been a while.  Finally, I decided to venture over to the OG Freddie's in North Beach which dates way back.  \n\nThis is a stout sandwich.  They slice the meat to order and put a lot of meat on your sandwich.  The fixings seem to work just right.  The bread is delicious.  I'd love to tell you what makes this place special, but I feel very confident in telling you that they just have the mojo, vibe or quintessence that is intangible.  The echoes of a 90 year-old shop live on.  It's no frills, you have to go out of your way, and they aren't open late.  I have literally gone out of my way to grab a sandwich to take home for dinner.  So good.  \n\nHere are some things to note:\n\n1.  The Italian Combo.  This is the signature sub.  They would recommend it on Soft Sourdough.  It's Salame, Ham, Cotto, Pressed Ham and Cheese.  I always go with regular fixings, no mustard or pickles, add oil and vinegar and the vaunted Pepperoncini Spread.  Oddly, this is the cheapest sandwich.\n2.  The Bread.  All of the bread is delicious.  They have multiple versions of Sourdough, as well as Wheat, and Dutch Crunch.  BTW - If you are not a SF-ista, you may not know what Dutch Crunch is.  Check out the Wikipedia article.  It's great bread.  The bread at Freddie's is an attraction unto itself.  I will say that the Semi-Hard Sourdough is a bit chewy, but it is SO tasty.\n3.  They slice it fresh to order.  They have a full selection of great deli meats.  They can make them hot or cold.  I have a hard time going with anything other than the Italian Combo, but there are so many others.  The sandwiches are meat driven.  No cutesy sandwiches.  \n4.  Spreads.  The have Pepperoncini (mild), Jalepeno (hot) and a terrific Garlic Spread.  Delicious.\n5.  The Size.  They have Small 6\", Large 8\", Half Loaf 12\" and Whole Loaf \"24 Inch.  A Half Loaf is a heck of a Sandwich.    \n6.  Old School Factor.  You can't emphasize this enough.  This is one of those great old school places that simply are not going to be duplicated.  You think a winning formula can never die.  What I'm about to say is sad but true:  It will.  Great old school places always cease to be what they used to be.  I urge you not to miss out on this one.  \n\nTruly, this is one of my favorite places in San Francisco.  I wish that #2 was still a block away, but that ship sailed.  If you haven't been to Freddie's, go soon.  It is a terrific spot and one I will go to at least every other week for as long as I remain in SF.", "author": "Adam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "Freddie's is a neighborhood gem. Just out of the bustle between the wharf and the pier it sits north of Russian Hill on Stockton. This is an old school joint. Don't expect the fanciest decor, but when you and the gang need a reasonably priced well portioned lunch sando Freddie and the gang will hook you up.\n\nThere are lots of bread options like Dutch crunch, sourdough, French breads, whole wheat and more. Tons of choices from a healthy veggie or egg salad to the decadent pastrami or mortadella. Pro tip - hot pepper spread is good on everything.\n\nFreddy is incredible. He makes supporting this long time local shop a no brainer. It doesn't hurt that you can pre-order takeout on the yelp app", "author": "Adam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "My first time going to Freddie's was about 10 minutes ago. The vibe is super legit and old school. I ordered the Italian combo on sweet dutch w/ 'chini and garlic spread and now have a massive flavor erection that will probably last more than six hours and demand I consult a physician ASAP. \n\nWill be going back to try the pastrami, egg salad, buffalo chicken and everything else.\n\nAlso pepsi in a glass bottle and tater salad that's off the chain. \n\nRegards, \n\nMitch", "author": "Mitch G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "When Thursday evening's \"one drink\" turned into five drinks and you're feeling a bit worst for ware, Freddie's is the ultimate Friday hangover sandwich. OG deli style, piled high with meat, with house pickles, mustard and shredded lettuce. I never wanted it to end.", "author": "Hugh W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "I truly believe this is one of the best Sandwich Shops in San Francisco. There so good and the people are warm and friendly. They make your sandwich quick (but not poorly built). There is also outdoor seating. Definitely give this place a try! You WONT be disappointed! (All of this is written as I eat my sandwich) : )", "author": "Jessica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "Amazing sandwich!  Stumbled upon the shop and was glad we went in.  Shared a large turkey on sourdough and we both had plenty!  Best deal in town so far...", "author": "Deb R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-11", "description": "I will try this place again when they aren't crowded so I can have my sandwich made the way I like it.  I must say they were very organized and moved smoothly through the crowd out the door!  Very nice owner and staff!", "author": "Kathy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Such a solid spot! Being able to purchase through yelp ahead is awesome because I order then stop there on my way to the airport. Then I have a sandwich that will hold me over through a whole day of flying!", "author": "Alexa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "The Italian combo was delicious. The service was fast and everybody was nice. Can't wait to go back and try the other sandwiches.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-17", "description": "I kept hearing how great this was but sadly as a foodie, the bread was way too hard and the Italian sub keep coming out because I had to bite so hard, and I ordered semi soft...\n\nI have had better in Oakland. But it was not bad at all. Better than average. :)", "author": "Carenna W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-14", "description": "i want to like this place as much as everyone else, but they never make my sandwich right. \ni dont like mayo and mustard on my sandwich. so i always ask for oil and vinegar and never seem to get it. i even ask for extra oil and vinegar or lots of oil and vinegar and everytime get a dry sandwich with no oil and vinegar.  i go there cause its 2 blocks from my job, and everytime end up wondering why i return", "author": "Oiland V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Solid, hole in the wall place for sandwiches. I got the turkey pastrami sandwich on semi-hard sourdough bread. The bread was delightful. The innards were a perfect ration of lettuce, mustard, cheese, and pastrami. I was also really hungry so that helped a lot. My company's vegetarian sandwich also looked so fresh and delicious, and he confirmed. \n\nDefinitely recommend this place for a low key, easy, on-budget meal - only if you want something delicious.", "author": "Pam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "Delicious subs made in a tiny diner with outside seating only. An almost movie like Italian family prepares the food and if you're lucky you can catch a seat in the shade on a bench on the East side of the building. \n\nFun neighborhood to people watch in as well. Everyone from school kids to millionaires in classic cars out and about on a sunny day.", "author": "Sam C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "I'm just bummed that I've worked around the corner from this place for a year and a half before I discovered it. It's popular, so ordering online ahead of time if possible will save you precious lunch break time. I can't say enough good things about the variety in this place! Seriously, you have never seen such a broad offering of sodas and chips to pair with your sandwich. If you feel like biting into a delicious chewy fluff cloud, go for the \"soft sourdough\"; doesn't disappoint! My go-to is the Italian combo, but everything looks fantastic. There's minimal seating outside and none inside, so be prepared to eat on the sidewalk. Great neighborhood for it though!", "author": "Emily B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-10", "description": "You've gotta love hole-in-the-walls. There's something great about family-owned eateries with a lot of heart and local flair. Freddie's is one of those.\n\nIn what looks from the outside like a small convenience store are perhaps the best sandwiches in North Beach. That being said, though, they're still not worth going out of your way for.\n\nThe best part of Freddie's is the incredible number of fresh breads they offer. Want dutch crunch? You got it. Like onion rolls? Bingo? How about sourdough? They've got three varieties for you. You can get your sandwich your way and enjoy it on some great, hearty bread.\n\nThe condiments for the sandwiches are also solid. The cheeses aren't soggy, the veggies are fresh, and the spreads are pungent and flavorful. If you don't like heat, I would still recommend you go with the pepperoncini spread. For the spice fiends: jalapeno spread. It's worth adding on to your sandwich (at no additional cost).\n\nUnfortunately, I find the meats a bit lacking in Freddie's Sandwiches. They're just somewhat standard deli offerings. Sure, there may be some fancier-sounding Italian offerings, but they're still not excellent. A good Italian combo has high-quality meats, often cured in-house. Mine here mostly just tasted like over-hydrated ham. Perhaps the pastrami would be a better option.\n\nThere are better places to dine in North Beach/Telegraph Hill, but if you're particularly feeling like a sandwich, this is a good place to go.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "We could tell this place was going to be authentic as soon as we saw the giant sandwich on the window outside. \n\nStep inside and initially it's confusing. A wall FULL of candy and snacks. Giant cloves of garlic hanging from many points on the ceiling-- I didn't know vampires were so rampant in North Beach. And then a deli counter right in front of you.\n\nI got the veggie and add black forest ham-- VERY satisfying. The small sandwich is definitely big enough. There were 5+ breads to choose from, and I can't remember the total $$, but it was definitely reasonable. \n\nA very local corner spot- so the line wasn't too long. There are no seats, though, (except for a bench outside) so you gotta get it to go.\n\nCan't wait to go back to this magical shop.", "author": "Steph D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Used to work nearby. Great sandwiches, I still go out of my way to pick up lunch here from time to time.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "I can settle for this shop sandwich! I love eating outside and enjoying the San Francisco sunny weather", "author": "Zki R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Really really good sandwiches....big and cheap. Nothing over the top or extraordinary, just another gem of an SF neighborhood sandwich shop.", "author": "James A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-11", "description": "The wait was almost an hour for 2 cold sandwiches, defitnetly should call in to place your order. The sandwiches were better a few years ago, but still overall I give the food a B-", "author": "G G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "This is an amazing sandwich shop.  No frills, no big name chain just your little ma and pa corner sandwich shop with great sandwiches.  The Italian combo on semi hard sour dough was delicious.  They pack it full of meat and use my favorite shredded lettuce.  It is a very hearty sandwich.  A small made for a very filling lunch.  No dining in but they did have benches and small folding tables outside.  It was a great stop on our self guided tour of San Francisco.", "author": "Alan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Simply put. Best bargain in San Fran. Awesome handmade sandwich with lots of whatever you ask for. Price makes this a delicious and filling bargain. Here is the hint.. the small sandwich is actually big.  Hidden Gem just a couple of blocks off the Embarcadero.", "author": "Jay J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Every time I am near Freddie's I stop in, in fact I'm going there for lunch today! They make the best deli sandwiches I have had in the Bay Area.  The place always has a line trust me when I say there is a reason for it. If your in the area I highly recommend this deli for breakfast, lunch, or dinner. As stated before they always have a line so I highly suggest calling in a phone order for pick up. Happy eating!", "author": "Scott Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Great sandwich from an authentic old school shop. Had the Italian Combo, it was great.", "author": "Richard R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "It's not like this place is a secret, but be prepared for a line and a wait. Advice to the newbie, order on the left, wait on the right. Freddie's make excellent and honest sandwiches the way you want them. Not all the foofooey stuff that SF is known for, just good sandwiches, made by hand to order. When your job takes you to the Fisherman's Wharf area, and the last thing you want is tourist fare, having this place 4 blocks from work is a little bit of daily happiness. The egg salad is creamy deliciousness. Get it and enjoy. Small bits I learned; if you want to avoid the lines, go before 12 or after 2, and get the small sandwich unless you're famished, the large is like 2 sandwiches in one. Please, please, keep the old school charm.", "author": "Roger G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "If you want fresh and good sandwiches. You should come here. It was my first time and liked it.", "author": "Jasmine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "What can you say about Freddie's that hasn't already been said?  That Freddie's is 11 years shy of the century mark?  That Freddie's is 11 years older than the Golden Gate Bridge?\n\nI just wish I had a Freddie's in the east bay.  I ordered the italian combo (dry salame, ham, salame cotto, pressed ham, and cheese).  I ordered a large, but probably should have ordered the regular.  It was huge!  I'm dating myself, but we use to call that the Dagwood (Bumstead) sandwich.  Best sandwich I have had in a while.  Also ordered the pasta salad.  Artichoke hearts, olives, great seasoning along with the pasta, goes great with the sandwich.  \n\nI'm glad I walked there to/from the Embacadero.  After that sandwich and pasta, I needed to walk off some calories (but it was worth it!).", "author": "Bevin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "We were exploring San Francisco and just wanted a sandwich And let me tell you about this little hole in the wall. The sandwiches are amazing here and so fresh. I seen so many kids from local schools coming in to get food and the owners knew most of them. Thought that was a cool touch. Support your local businesses.", "author": "Rick G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Love this place! Quick, delicious subs with fresh ingredients. The man at the cashier has been there over 20 years and he is just a great, friendly guy! \n\nThey have great hours, open until 4! And what I love the most is that the ladies making the sandwiches use gloves! It makes me feel it's much cleaner than nearly everywhere else in the city. The gloves!!! Yes! Clean food!! And for a great price!", "author": "Lynne M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "Biggest complaint is that they are slow. No matter if you show up to order or place a pickup order on Eat24, they always seems to take 20-25 minutes to make your sandwiches. \n\nIt's a complete hole in the wall and recently they've added a few chairs and tables outside.\n\nBut no matter, we don't come here for the nice decor, we come for the delicious italian combo w/ dutch crunch bread! \n\nProbably the best sandwich in North Beach, besides perhaps Molinari's", "author": "Mingmei N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Had a pastrami sandwich and I LOVED IT!! Their meat is VERY GOOD! .... also they have benches, chairs and little movable tables outside! Perfect for a sunny day in SF", "author": "Lloyd N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "Oh my god this was so good. Everything was so fresh  and the service was quick and kind.", "author": "Haydn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "Great old school Italian deli tucked away in north beach. According to the window, Freddie's has been around for almost a century (since 1926!) and they're definitely doing something right! Mostly focused on Italian style deli sandwiches. You can choose your bread, meats, and toppings and they make it to order. \n\nThe sandwiches are huge - I got a \"small\" hot coppa with everything on it and added pepperoccini spread and my boyfriend got a large  Italian Combo and he couldn't finish his. \n\nWe took ours to go, walked down to the wharf and hopped on a ferry to angel island, hiked to the top of Mt Livermore and ate our sandwiches while enjoying views of the Bay. We got our sandwiches on hard sourdough rolls which was perfect for packing along for our hike bc the bread didn't get soggy. It was a great treat to have yummy sandwiches after the uphill hike. Although, I will say that our packs were significantly lighter after polishing off those sandwiches!", "author": "Alison H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Freddie's is awesome. One of the best bang for your bucks you can find for a sandwich in the city especially with the Italian Combo. Service is great and I always enjoy Ed. Does a great job of remembering you as he has regulars. The size of the food is plentiful, definitely no need to order a large sandwich. Nothing I would change about this place. One piece of advise is during peak hours the wait can be long---call ahead, fax your order or use one of the apps they are partnered with to place your order ahead of time.", "author": "Matthew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "Freddie's is the best. I live a half block up Stockton and go here whenever I can. I'm usually at work during their hours but go every single time i work from home. \n\nEddie, who works the register, is always happy to greet you and always gets my very picky order right. \n\nGreat ingredients, very friendly staff, I feel so lucky that it's 25 steps from my front door. Love it so much!!!", "author": "Mackenzie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "I remembered their salami sandwiches during lunch time when I was going to school across the street here decades ago! Still around and strong, and the salami and mustard on soft french roll still taste exactly the same. One bite and the memories came rushing back.", "author": "Peter T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "Unassuming, no-frills Italian deli in North Beach.  The Italian Combo was solid, and a great value given the size of the sandwich.  I ordered mine on sweet Dutch crunch with pepperoncini spread based on a tip, and the pepperoncini spread especially was a great (mildly spicy) addition.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "Didn't want to go to a tourist spot for mediocre sandwich. This is not far walking from Fishermans Wharf. Old time mom and pop sandwich shop. Got the small Italian combo on sour dough. It's huge! Comes wrapped in two separate halves. Got the jalapeño spread on it as well-so good.", "author": "Laura R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Love this place. The vibe is great, the choices are beyond expansive, and the sandwiches always bring it home.", "author": "Brittany A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "I basically come to Freddie's every week since I work just down the street. I come here because the sandwhiches are excellent, the service is fast, and the prices are resonable. Customers can order easily in person, via telephone, or online (yelp or eat24). \n\nSome Advice:\n\nEither call in or order online because there is always a long line out the door. Try to come not during the lunch hour because this is when they are at their absolute busiest. Also, their Chicken Salad is super fresh!", "author": "Jeannel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "I was so glad to find this place! It is exactly what I wanted on a day of sight seeing and doing touristy things because it was a little hole in the wall place away from all the tourism- there were just a few other people there besides us. \nI got the Italian combo on the crusty sourdough. It was delicious, however next time I will get the soft sourdough because the crunchy one was so hard to bite and when I would bite down all the meat squished out the back. Something I found to work was keeping it wrapped up in the paper and eating it like a burrito. That kept it a little more together. Other than that- very delicious! Oh and the small is very filling!", "author": "Emma M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "I loved the sandwiches at this place. It's a small little shop but the size does nothing to stand for how yummy the sandwiches were. It was easy to find and walk to on our way back from The Alcatraz cruises pier. The wait was not too long for our sandwiches and they even have a little bit of seating outside if you want to eat your sandwiches right there!!", "author": "Desere S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-18", "description": "A day in the City with Tram N brought us here for Lunch. The place is pretty small and had Tram not done her research about this place I wouldn't have known they sold Sandwiches as it's a small convenience store with the counter at the back.\n\nI ordered a Turkey on Wheat (http://www.yelp.com/biz_photos/freddies-sandwiches-san-francisco?select=CaEt7bYei_oQk8XxaTwXiA#C3mRH2HipjqmBpH8ampadQ) for $6.45 which was ready fairly quickly. Although because of the ordering system some other woman took my Sandwich (booo!) They don't take names, instead just call out the order so the lady grabbed mine despite ordering after me and having a completely different style bread. It took about 5 minutes and me questioning what was going on for the guy serving to figure it out.\n\nThat aside the Sandwich was pretty good. Everything was fresh, they put in a lot of Turkey and the bread nice and soft. It was also cut in half and wrapped separately which I really liked as I often only eat half and save the rest for later so it made things a little easier for me. The only disappointment was that I asked for it to be toasted and it wasn't.\n\nThe Sandwiches are in varying sizes from 6 inch all the way to 25 inches which are a very reasonable $24 and they also have a few baked goods (Muffins, Cookies and Baklava). They don't have tables to eat your food at but they do have a few plastic chairs stacked outside that you can sit at if you mind eating off of your lap.\n\n*NOTE* Had I got my Sandwich toasted like I asked and an apology for giving my order to someone else this would have been closer to a 4 star review.", "author": "Emmalouise B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Great sandwiches, reasonable prices. Some of the best sandwiches in the city! Very low-key atmosphere, not a lot of seating, but plenty of great scenic places nearby to sit and eat your lunch.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "This place is definitely a hidden Gem for the North Beach neighborhood.\nI've been coming here since my middle school days (back in 2003). What I can tell you is hands down, the best sandwiches in SF Bay Area! Their sandwiches are huge, even half of one will get you full. They sell in half sizes or large aka whole sandwich. Ingredients are always fresh and they have wide selections of bread, meat, and cheese. Salami on Soft (Soft sourdough roll) or Dutch crunch is my favorite. They also sell snacks, drinks, muffins, macaroni salads, and more! Accepts credit card and street parking is super easy. I believe they still offer student discount for the Francisco students. The owner has is super nice & friendly. You can tell they put in thought when making your sandwich. Not rushed or sloppy. Also they toast your bread for free and offer free spreads which is great!", "author": "Diana T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "This place is absolutely AMAZING!! Workers are so nice and food comes very quick. Never had a BLT as amazing as this one. I could eat here everyday 10/10", "author": "Jourdan F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Great Sandwich! It was huge and tasty. They took a bit long to make it however it was a weekday during lunchtime. I highly recommend it when visiting SF.", "author": "Maria I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Great deli sandwiches. Super friendly service. Easy bike parking. Enjoy your lunch on the outdoor benches.", "author": "Vicki L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "I had my childhood here in the neighborhood.   While I was attending Francisco middle school I remember buying salami and cheese on french roll sandwich.   I remember Freddie and his wife at this shop.   They both were pretty old already, wonderful human being.   Their sandwich are much better now, but I miss Freddie and his wife making their sandwich for me.", "author": "Tony W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "Wow. Truly great sandwich shops are too few and far between and Freddie's is one of the greats! I'm so happy I found this place (sad that I found it on my last day in SF or all of my meals would have been here).  It's a hole in the wall place that I would not have found or even thought of trying had it not been for Yelp.\n\nThe large sandwiches are huge. Enough for two people or two meals. My husband got a Ham/ Roast Beef on Sourdough Soft. He was raving about it (and he is the pickiest guy around). I got the Italian Combo, on Dutch with jalapeño spread. Delicious!\n\nIt was a little over $20 for two large subs and two bags of chips. A steal for the size of these subs really.\n\nThis place is a must if you're in town near the Wharf!", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "This place is one of the better local sandwich shops in the area. Nice staff with a great selection of options to choose from.", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Awesome sandwiches, happy help.  People who know their sandwiching craft!  Perfectly off the tourist trap area of Fisherman's wharf and just a few blocks away.", "author": "B K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "We stopped here before taking the ferry to Angel Island. Vegetarian sandwich okay--cheese and avocado made it substantial. They also have falafel and egg salad, but besides this it's your typical sandwich place:  do you want meat or extra meat on that? Servings are enormous--one sandwich would have been enough for the two of us. Bread is amazing. I also get pretty happy when the soda selection is this good--old school brands like A&W Cream Soda, Squirt, Ginger Ale in both regular and diet. Overall, glad we stopped here--eating options out on the piers are not this good.", "author": "E. R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Authentic spectacular sandwich shop. Hole in the wall, serves locals, hard to find but worth the search.  Soft Sour dough bread was so good! vegetarian sandwich, egg salad sandwich and hot pastrami on sourdough was great.  Onion roll was so yummy also.", "author": "Pamela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "Love their crunchy sourdough and mortadella!! I've been coming here for over five years. Better than any food chain sandwhich store. \n\nChoose Freddie's!", "author": "Mona A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "Been coming here since I was 13. Still tastes great! Italian combo is my favorite. You can't go wrong with Dutch crunch bread. They offer free spreads as well. Be sure to ask! Sandwiches may be toasted with no extra charge. You just have to ask! Drop by for lunch if you're in the neighborhood!", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "my go-to neighborhood sandwich shop. great selection, fast service and the owner doesn't mind that i read most of the SF Chronicle without paying for it.", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Out of towner looking for lunch after Alcatraz.  Wandered up the waterfront looking for something before walking up to Coit tower, didn't see anything I wanted bad enough to fight that crowd so checked on Yelp and found Freddie's.\nGreat Sandwiches!  Between us we had an Italian Combo, Buffalo Chicken and Corned Beef, all on soft sourdough, all delicious. The owner was at the register, very nice, very personable.  A lot of local folks in and out while we were sitting at a table outside eating.\nBTW it's a lot easier to walk from the Fishermans Warf area up the streets to the Coit Tower past Freddie's than all those freaking stairs from the other direction.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "I brought the family here for lunch on a Saturday, based on strong Yelp reviews. We were not disappointed. That was the best sandwich I've had in years.\n\nThere was no line to order, but a good dozen people waiting for food. Next time, I'll phone my order in from the road. I don't know if that's possible, but I'll definitely try. \n\nI live an hour away, but am already planning a return visit. I am fondly imagining stopping here with future houseguests on our way north from SFO. Yes, it's that good!", "author": "sayo n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "So good! Got the Black Forest ham on soft sourdough. Everything was fresh and delicious on my sandwich. Must come!", "author": "Christy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Love this place, their sandwiches never fail to make my heart happy. The meat is perfect, and the bread is always fresh. Pastrami and roast beef are my two go to sandwiches.", "author": "Selina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Authentic old time deli with great sandwhiches.  The traditional old North Beach Sandwich to order is the ham, cheese and salami with mustard on the Weidermeyer roll.  That's the traditional Italian sandwhich from the thirties that they have been making here since the 1930's.  It may not be the most interesting sandwhich they have here but it is a piece of SF history.", "author": "Bill S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "I order on line every time, very quick about 10 minute wait , I walk from my work when I order and its ready by the time I get there, some seating out side. Employees dont look miserable, that always makes me return to a business.", "author": "Citlali M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "I have been a loyal customer of Freddie's since the mid 90's and I am proud to know that until this day, everything is running as it was back then. This establishment has been open for 89 years and counting... Eddie took over the place over 30 years ago and has been running the counter and taking orders since then. He always has a friendly demeanor and is a pleasure to speak with. \n\nThere are specials available to the kids attending Francisco Middle School across the street. When they hear the final bell releasing them from the grind of a hard day of school, (ahhh... the good ol' days without a bill in your name) they come running over and line up to get their after school fix.\n\nThere are over 25 different sandwich combos for you to choose from. Last count I think there are 9 different breads including and not limited to sour dough, wheat oat and soft rolls to the best sweet dutch crunch this side of the Mission as well as sliced breads as well. \n\nThere are plenty of cheese options available as well from cheddar to pepper-jack and don't forget the spreads! Garlic, Pepperoncini and the spreads of all spreads... The Jalapeno spread, it's a must have! Even if it's a light slathering... \n\nEddie also stocks egg, tuna and carrot and raisin salads pre packed and ready to go as well as plenty of drinks, chips and candy so this place is a true definition of a one stop shop. \n\n***Office catering or family outing tip***\n\nIf you are in a crunch for a quick place to feed an army.. Okay maybe a lunch meeting, order a whole loaf sandwich and have Eddie and the ladies cut it into triangles! You will be surprised how filling and what a value it is. \n\nSnag a loaf and hop on a boat to Alcatraz and have a picnic that is fit for a king. \n\nKeep up the great work gang! We truly appreciate you all and this jewel of a sandwich shop. See ya soon!", "author": "Josh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "Great sandwiches and good prices at an old school dive.", "author": "James A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "been going here for years, best affordable sandwiches i've ever had! do yourself a favor & try the \"student combo\"!", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "Wow! Such an amazing sandwich. Had their vegetarian on soft sourdough. Awesome bread and their \"small\" size is super filling!!", "author": "Abhinav G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "Best sandwhich shop in the city by far!\nI've been coming here since 89'\nFavorites are the Italian combo and hot pastrami on sour Soft roll awesomeness!", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "I got sandwiches here over the weekend and was delighted to know this place hasn't changed since I was a kid (my dad used to buy me sandwiches from here growing up). The Italian Combo with soft sourdough was the best! So soft! \n\nThe store is small and old-school, but they get the job done! Just wished it was in a more convenient location. Parking was easy to find.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "Decent sandwich for a fair price at a nice little Italian store. Can recommend the Italian Combo.", "author": "Niklas S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "When its good it's good. Sandwiches,burgers,pizza are American Staples. Yet the difference between types of sandwiches and the quality can be striking. And getting a good sandwich is as difficult to obtain. Freddie's get's it right. The bread,meat,condiments,seasonings combined to form the perfect sandwich. I have tried the Italian combo,then ordered my own combo of roast beef,ham,turkey,lettuce,tomato,swiss cheese,mayo,mustard,oil vinegar...a pure gastronomical delight.  Now Freddie's is a market,get your sandwich and leave,it is a small market,so you may have to wait. But the wait is well worth it.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "I've been here a handful of times in recent visits to SF.  I like it because its quite near the tourist-y areas of the Embarcadero but far enough away that its not inundated with a lot of people.  They have really good sandwiches - I've had a veggie sandwich and a BLT, on sourdough of course!  \n\nIt does get pretty hot inside but there's ample seating outside so go ahead and order up and have a seat at one of the sidewalk tables.  You might see me there!", "author": "William H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "Great neighborhood deli with great food!  Similar sandwiches a few blocks away for the tourists are three times more.   I'll be back", "author": "Peter D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "When we walked up at 11:45am to find utility workers and not one, but two different kind of cops cued up -- we felt pretty good.\n\nJust a classic hole-in-the-wall sammich joint. If you can eat more than a \"small\" you are probably a weight-lifter. \n\nDo take the time to study the menu before you order -- not quite \"no soup for you\" but close. Just roll everything on whatever you get -- roasted turkey and corned beef are nice -- and consider one of the spreads to really amp it up. Had the hot jalapeno spread slammed on corned beef -- money.\n\nBonus: Grab your sammiches here, walk two blocks to the piers for a waterfront picnic, thumb your nose at the crappy, touristy junk for sale there.", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "Nice, authentic sandwich shop. Quick friendly service. My bf got me hooked on the chicken salad on the soft sourdough bread. Good selection of drinks and chips to go with.", "author": "Carolyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "As good as it gets for classic Italian sandwiches. No hipster bullcrap. Good homemade sandwiches which will fill you up nicely. Decent prices. Cute benches outside to sit and enjoy those sammies.", "author": "Faizan J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-23", "description": "Two hairs in one tuna salad sandwich. Thanks! I would have recommended this place and I've been several times before, but that experience was completely unacceptable. Obviously very poor hygene standards. Not recommended.", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-08", "description": "Holy crap. Such great sandwiches. I got the Italian combo and the corned beef, both on soft sourdough.", "author": "Nathaniel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-03", "description": "On my bookmarks for over 2 years and I knew I bookmarked it for a reason.  The reason was that it's freakin' delicious, that's why.  After our little adventure at the Ferry Building, Emmalouise and I were ready for lunch.  Emmalouise isn't picky so she let me decide.  I then allowed Yelp to navigate us here...\n\nA small little sandwich joint about a 5 minute walk from Pier 39 that seems to be a convenience store as well.  No seating indoors but there are chairs outside so you can sit and use your lap as a table.  Unfortunately, I ate standing up because I was feeding the little one and I had to chase after him from time to time.  He's young and I can't imagine being in the stroller for hours so I let him be free during the duration of our meal.  \n\nThe guy at the counter isn't much of a customer service-y type of person and the wait for the sandwiches about 10 minutes (if toasted), more if there is a crowd however, if you want your sandwich cold then it'll be slightly shorter.  One thing I will note is that you should memorize what you order because they don't call your name when your sandwich is ready, they call out what you order.  Poor Emmalouise's sandwich got cold because some lady grabbed her sandwich even though the type of bread she ordered wasn't whole wheat... she held onto that thing for over 5 minutes.  The guy at the counter switched the sandwich after realizing the lady's dumb mistake but I did not hear him apologize to Emmalouise.\n\nI ordered the small (6\") corned beef, no tomatoes, no cheese on Dutch Crunch (can't have it any other way).  The bread was toasted just right w/ a slight crunch at first then deconstructed in my mouth awesomely.  The corned beef was sliced thinly and evenly but boy did they pile it up.  I loved it!  I'm a carnivore... the more meat, the better!  The lettuce was crisp and fresh and I love the mustard that eventually got into my hair.  What I love most was that the sandwich came out already cut and wrapped separately so for those trying to eat sensibly, this hella works!\n\n\nThe sandwich was great and I enjoyed our San Francisco trip together.  \n\nI was FULL afterwards even though I only had half of it.  It was because Emmalouise baked and gave me some of the brownies (triple chocolate, yo).  It was moist, chewy, chocolaty, and delicious.  I'm trying to talk her into having her own baking business and/or have a bake date.", "author": "Tram N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "Best Club sandwich I have had in my entire life. Service is great and so many options to order ahead. I'll be a regular here for sure!", "author": "Aiden T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "All we wanted after visiting Alcatraz were some inexpensive awesome sandwiches, to eat on a plastic table on the public sidewalk, good people watching, annoy the employees by walking through their small kitchen to use their bathroom, and quick service with a little attitude. Was that too much to ask for? Apparently not, because this place delivered! (They don't deliver by the way, just takeout)", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "One of the best sandwiches I have ever had.  Hot pastrami & turkey  on soft sour dough bread.  Wide had the ham on white w/ everything.  Not to bad either.  A must visit when in SF.", "author": "Duane S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "Great little sandwich place at a solid price.  Ordering through yelp is super easy and makes waiting in line completely unneccessary!", "author": "Mike D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "Still THE BESTSANDWICHES IN THE BAY.  The Italian Combo on Soft Sourdough can't be beat.  I always add peppercinis and jalepeno spread (theres other spreads/topping which are all free).  You may be tempted to go to Columbus St near by and try that famous Italian deli thats been on TV .. not as good!!!  Went there and was disapointed.  The \"small\" at Freddie's is big enough for even hearty eaters.  A large is enough to easily feed 2 people.  Phone in your order cus theirs usually a line.  They have chairs for outdoor seating which is nice.", "author": "Neil C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "I've gone here way too many times for lunch and I'm reasonably confident that will not stop.  Great food.  It's very busy at lunch time.  Sometimes the wait is almost unreasonable.", "author": "Pavan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Love the old school deli near my work. I had a turkey on sliced sourdough with cheese and avocado, kettle chips and a craft root beer was a sweet combo...my standard deli order. Go there while you can, these places are disapearing quickly!", "author": "Maureen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "Bomb diggity sandwiches for a nice day at the park. We always get the Italian combo. Highly recommend this spot!", "author": "Meg C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "I take the 30 or 8x to visit my old neighborhood sandwich shop.  It is a harrowing ride between Kearny and Chinatown.  \n\nSometimes, I would see my crabby, humpty-dumpty shaped property manager at Freddies's. \n\nMy personal fave is the focaccia roastbeef sandwich with jack cheese, onion, tomato, mayo.  \n\nI have never seen Freddie himself make a sandwich, however.", "author": "Miran C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "Love this place! Excellent sandwiches and the friendliest owner ever! Support your local sandwich shops like this one. Forget the chains - Subway, etc.", "author": "Laura R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Use to always come here during middle school to get their Freddie's special sandwich. Recently visited this place again and it's still satisfying.", "author": "Johnny N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "Great lunch spot with benches outside. Huge variety of sandwiches and even though this place is known for their meat, the veggie sandwiches are pretty bomb.", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Use to order bread for 10 cents, 5 cents meat, 5 cent cheese. Still one of the best since I first went 45 years ago!!!", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "Amazing little deli! Take note: it closes at 4pm and isn't open on Sundays. The soft sourdough bread is incredibly delicious and a big reason this place is popular. While there aren't any frills about the establishment, and not much standing room, my family and I make the trip into San Francisco just for Freddie's Sandwiches. The Italian combo sandwich is a winner. Great and patient service, fresh ingredients.", "author": "Hannah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "I came here last Saturday afternoon and found that Freddie's does, in fact, live up to its Yelp reviews.  The top of the Dutch crunch bread is not as crunchy as Ike's, but the rest of it is so soft and chewy!!!   It can be so difficult to find such fresh sandwich bread sometimes!  The corned beef is nice and fresh and overall my friend and I got two solid sandwiches.  Even better, we were able to use a 50% Scoutmob coupon which made it a fantastic 5-star deal!  For the original price though, 4 stars.  Here is an up-to-date menu: http://www.yelp.com/biz_photos/yGEc-cj9Quk5mUh7maoPXA?select=1zk4Pl1w5rColxa9ftXi1g\n\nOne thing to note though: on a warm day the store is really hot and stuffy because they don't even have a fan, but your sandwich will be well worth the wait and sweat. ;)", "author": "Beatrice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Absolutely perfect turkey sandwich prepared in no time at all! Highly recommend checking this awesome little place out! This was easily the highlight of my brief time in San Francisco. Great food and great prices.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Our office recently moved to Telegraph Hill and just last week I tried Freddie's Sandwiches for the first time. Second time today. They have a huge list of options and after trying the pastrami and swiss first and the roast beef and cheddar today I am hooked! The soft sourdough roll is the best, a mix of easy to bite bread with a burst of sour that SF is known for. I have only gotten the small which is plenty big for a full grown male like me but many other sizes are available. I also like the fact that it is locally owned and operated so go out and support your local amazing sandwich place!", "author": "John The Best M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Maybe the best sandwich I've ever had! We were in SF on vacation and needed to grab a quick bite on our way to an event. My husband found Freddie's on Yelp and I'm so glad he did! There wasn't anything fancy about the location or the sandwich, but the bread and meats were so fresh and good! I will make a point to visit Freddie's again the next time we're in SF!", "author": "Marc D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "Sweet dutch crunch, honey turkey, cranberry sauce!!!! I just can't get enough of Freddies, plus there's a student discount!", "author": "Tinai J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "Had the best sandwich ever at this long standing and established Italian shop. Owner is super friendly and prices are affordable. Blows Subway out of the water...", "author": "Cameron F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "Freddie and his family are nice and consistent with their service. Dutch crunch is my favorite bread to get but soft sourdough is a close second.\n\nThey individually wrap each half of the sandwich and always offer a bag and don't charge for it (at least not yet).\n\nLine can get pretty long around 12-12:30pm. Small sandwich will be enough for most and is under $6-7 usually. Large sandwich if you're hella hungry is around $8.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Truly one of the best sandwiches I've ever had! Unassuming shop with friendly and accommodating staff. Food is super fresh and made with care for sure! I had an egg salad sandwich on rye with all the fixins and would go back daily if I lived here!!", "author": "K O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "As a visitor staying in the tourist area of fisherman's wharf. You never expect to find a gem like this place.\n\nOur sandwiches were five star all the way. The service and cost was great.\n\n  DM", "author": "Dino M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "My friend and I stopped by after the Alcatraz tour. SO GOOD!!! I got the veggie sandwich and added honey roasted turkey on sweet Dutch bread. MUST TRY! The garlic spread was delicious. We wanted to eat there a second time before leaving the city but it was closed on Sunday. Talk about bummer!", "author": "Allyson P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "One of the best sandwiches in town. If you're in the area, don't forget to stop by Freddie's. Yum!", "author": "Jai M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "I can definitely see what the hype is about. Had a great sandwich and received great customer service. Highly recommend!!", "author": "Danielle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-22", "description": "Great sandwich shop in the North Beach area.  I ordered the Italian combo on the semi hard sourdough and my friend ordered the egg salad.   They have lunch meat and even mortadella which can be a difficult cold cut/ lunch meat to find.   Very affordable and huge portions. I ordered the small 6 inch sub and only ate half of my sandwich.  This place has only a couple spots outside to eat at a couple bistro tables.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "This has become a go-to for lazy weekend pick-up sandwiches. Great variety of deli meat options available, or go all-in YOLO style and get the Italian combo. Bread-wise, my favorite is the semi-hard sourdough. Just hard enough to keep the sandwich together, yet soft enough that you don't squeeze out all of the toppings with that first big bite.\n\nThis is also somewhat of a mini mart, so great selection of drinks+chips.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "The 5-star Yelp review of yesteryear (double-parked work trucks clogging up the street in front of a lunch place) tipped me off to this beautifully simple-- but far from run-of-the-mill-- Italian sandwich shop.  Thanks, fellas!\n\nWarning to pretentious food snobs:  the wonderfully drab interior of this sandwich shop will not translate well over Instagram and there is no Sonoma squab liver pate or tea leaves pooped out by monkeys on the menu.  \n\nHead's up to my veggie brethren: the vegetarian sandwich is deliciously fresh, with a touch of herbaceous crunch.  It goes far beyond some boring-ass deli sandwich, hold the meat.  There's also a falafel option.\n\nA tip for my girls who is always on diets:  the small (6\") sandwich is just the right size for keister control.\n\nTo the adventurous eater posse:  there's herbs in the mustard that add a delicious brightness to your sammy.  There's also a freshly-baked sweet onion roll bread option, and you can add jalapeño or mild pepper spreads, garlic spread or even cranberry sauce to any sandwich. And of course, there's a wide variety of Italian cured meats.\n\nWord up to children of the 70's and 80's:  they serve carrot and raisin salad.  No, I don't want to eat it!  But it's cool, right?\n\nFreddie's has been around since 1926.  1926, beeches!  That's a lot of cumulative construction crew cred. (And also pretty much guarantees that Joe DiMaggio enjoyed a sandwich here, too, btw.)  Tucked away in that mildly unfashionable North Beach-slash-Fisherman's Wharf zone, it has somehow quietly survived douchefication and hippies and earthquakes and the middle school kids across the street, so you and I and every dude in a hard hat within two miles can enjoy a tasty sangwich.", "author": "Rosie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "Great sandwiches from a friendly, family-run store opposite a middle school. Can't believe this is just a couple of blocks away from all the tourist traps at Fisherman's Wharf. For anyone staying nearby who needs a snack, it's definitely worth venturing off the beaten track to find this place.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "One of the best sandwich spots in the city. Consistent and great service/quality for your buck! Make sure to add that jalapeño spread for an extra kick! #Yum", "author": "Ian K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "Damn fine sandwiches! So glad to have this deli nearby for lunch at work. Small takeout place. There is usually always a line and can get crowded inside. They do take call in orders, so I'll be doing that next time as our wait was about 15 minutes for our sandwiches. \n\nClub sammie on dutch crunch with everything. This was THEE softest dutch crunch that I've ever had. SOOOO good! \n\nBig selection of drinks and chips to choose from.", "author": "Christine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "Great neighborhood sandwich shop. Ingredients are fresh, shop keepers are nice, and you get a nice fat sandwich for under $7 bucks.", "author": "Didi R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "Stumbled upon this place on our way to the pier. Nice option to grab a couple sandwiches and some drinks and take it to the pier to eat on the water. Small subs are huge. Very good!", "author": "Mario M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "I've been going to Freddies off and on for over 40 years.   I love that it's still a genuine neighborhood place to get a real italian combo sandwich.   No Jive....just great sandwiches and great service and great memories.    Thank You Freddies.\nMy fave is the italian combo with pepperoncini on hard sour roll.....\nUsed to get similar at the old  Portofino Cafe and the  Bohemian Cigar Store from Mario but Freddies is the original.   A real genuine slice of San Francisco.", "author": "Hollis K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "This place was quick and easy enough to order but don't be intimidated by all the choices. I didn't get my small hot Italian combo with the spread but next time I will remember to add that! More space or seating would be nice but you can always walk to the wharf and sit on the benches there.", "author": "Nancy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "FREDDIES is a San Francisco institution.  Have been going here - for probably 20 years or more.\nThe office loves the whole loaf combo with extra turkey.  The special bake sourdough bread is delicious - and Freddie's is the only place you can get it.\nGreat for an office lunch, to take to the ball park - or last minute party at the house.\nLove this place!", "author": "Jeanne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-10", "description": "This place is great. I got a regular turkey sandwich with the dutch crunch bread. The meat was great, but I wasn't a fan of the bread.. I think I'll have to try to softer rolls. I ordered online and was able to pick up in less than 10 min.", "author": "Alison R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Another great sandwich shop we went to in SF. It's been open since 1926 and the staff was friendly, service was good, and the sandwiches were tasty.", "author": "Art T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "After working around the corner from Freddie's for about 1.5 years, I realized a few things. \n\n1. I took this excellent sandwich place for granted. \n2. I no longer have an excellent sandwich place to take for granted. Sad sandwich feelings ensue. \n\nI work too far away to enjoy the many shiny reasons to frequent Freddie's' fine fare, but if you find yourself within reach, make your stomach available for an appointment.\n\nThis is a friendly local establishment that has been in business for many years, and you can really see why. The sandwich options are endless, full of fresh, tasty ingredients that make your sammy attain those important sammy standards. The prices make so much sense that you'll feel great leaving (much earned) tips. The staff and the owner cannot get any more friendly or else you'll be in danger of barfing rainbows. The ordering process makes me smile: either show up or call ahead and describe your ideal sandwich, and it shall be done. \n\nOther bells and whistles:\n- They take debit cards but they also have an ATM onsite. \n- They have a fridges packed with every specialty beverage imaginable that even the whiniest lunch beverage connoisseur would twitch with indecision. \n- They have massive collection of various kinds of chips to add crunch to your lunch.\n- Screw the sandwiches you want candy, cookies, and/or baklava? Your sweet tooth can come here too. You can also find potato salad and falafel here as well if you come here and for some reason are in a sandwich-shunning mood. \n\nIf you're still in an advice taking mood and have a penchant for veggie sandwiches, their veggie sandwich is magically delicious. I always got the small veggie, toasted wheat roll, with pepper jack cheese, and the combination unlocked unprecedented lunch serotonin. Their tuna salad is also extremely tasty business. \n\nTake your sandwich away to Washington Square Park and have a ridiculously lovely picnic, or sit outside on one of their plastic chairs and you are sam-tastically set for success.", "author": "Chelsea B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "Italian Combo on Dutch Crunch with extra spicy spread.  A bottle of sparking water and a bag of baked lays.  That, my friends, is the cure for the common hangover.\n\nAlso tasty, hot copa and deli turkey on a soft onion roll. \n\nYou have to make the trek up the hill to Molinari if you want to find a better sandwich in the neighborhood.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "Italian combo on sweet dutch with the pepper spread:) So. Good. \n\nEverything tastes fresh and although the prices seem a little steep, the sandwiches are huge and can last for two meals. \n\nThe only thing I've tried from here that I haven't been too crazy about is the falafels on pita bread.", "author": "Fiana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-06", "description": "Pretty good sandwich, but the wait was way too long to make it worth it. Placed an order online through yelp24 with an estimate of 10-35min til pickup. I showed up at the 15min mark, hoping it would be ready sooner rather than later- I ended up waiting about 45min for it to be ready. Just wish they could've given me a better estimate. Wasted most of my lunch break waiting. And there's no organization to the line to order/ area to wait.", "author": "Minna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "Oi, we ordered two club sangers (that's Australian for sandwiches) using Yelp online order and pickup. The service time, value and taste were all tops. I recommend it, yummo.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "The highlight of my workday!  I yearn to come here every day M-F. Always fresh brewad delivered every morning, great customer service and prices to boot. \n\nMUST HAVE the soft sourdough roll with either the Italian Special, Salami, or Turkey combo. No sando in city compares. \n\nThe garlic sauce is a nice extra, but all the sandwiches already come packed with flavor so you don't absolutely need it.", "author": "Gabriel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "My review is for yesterday way back in years.  I used to come here after school at Galileo. In those days, there were no lettuce or others, we just had the plain deli meat with the french bread. It was super cheap..I still craved those sandwiches made back then.  Bread super soft, lots of meat, 30 or 50 cents worth of deli meat onto the sandwich.  I really need to go by there now, and try their sandwiches, made in today's style.", "author": "M. Ann W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-23", "description": "I live across the street from this place, so convenience is definitely a plus, but despite that Freddie's is a great neighborhood sandwich store! \n\nA good bang for your buck. If their sandwich doesn't fill you up, I don't know what will. \n\nThe things about their sandwiches that I like a lot is that they're clean and easy to eat (Keep in mind, their hard sourdough is REALLY hard, if you're not a fan of hard crusted breads, then go with the semi-hard or even the soft). And by clean I mean you won't have that sandwich-tomato-mayo-mustard-meat-juice dripping all over the place like many other large sandwiches do. \n\nI recommend the Smoked Turkey on Semi-Hard Sourdough with everything and Garlic Spread (I omit mayo since I'm not a fan).\n\nAaaand if you like getting a light buzz with your sandwich, they also sell canned/bottled beers.\n\nCheers.", "author": "Vencenza S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-12", "description": "I literally live next door to this gem, but this is the first time I've had their sandwiches. These are old-school, no frills sandwiches which are just plain awesome. This is a small grocery-style store with lots of other randoms for sale (gum, snacks, drinks.) The service is friendly and is the definition of \"mom and pop.\"\n\nThe menu is a bit confusing- there are so many items and it's unclear what you're supposed to be picking. But once I navigated through the complex menu, it was well worth it when I got my sandwich tidily wrapped up in halves. \n\nI ended up getting the small Italian combo on whole wheat roll. The wheat roll was soft, light, and had just the right consistency- not too hard but not stale either. The Italian combo is filled with a generous amount of yummy Italian deli meats, lettuce, great mustard, pickles, onions, and a slice of cheese. WOW. Everything was simple but executed perfectly. I want to come here all the time!!", "author": "Cathy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "After our tour to Alcatraz we were looking for a quick bite to eat within walking distance from pier 33. Thanks to the Yelp reviews we decided to try this little hole in the wall sandwich shop. So glad we did. It was delicious!  My husband and I both got the italian sub. I had it on a crunch roll and he had oatmeal wheat. Both were fantastic. If you are looking for a delicious deli sandwich- make the trip to Freddies", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-18", "description": "I don't really like sandwiches, actually I avoid them if at all possible, but I have come here at least once a week to get lunch for work for the past 3 months. \n\nMy friend always orders the salami sandwich on soft bread, but I really like their tuna sandwich. It's hard to find a good tuna sandwich because preferences among people vary so much, but I regularly order this at Freddie's and I am a fan. There's really not very much crunchy celery (which I don't like) and they add cheese. Of course, they will make it any way you like it, but I LOVE tuna sandwiches with cheese. \n\nThey are friendly, personal, and will remember you. They have chips, drinks, and sides available as well. I always get aloe juice here. yuMMm.", "author": "Andy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "Yum! Beat the tourist traps and come here for lunch! The spicy falafel was delicious!", "author": "K S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "Best crafted sandwich in San Francisco.  \n\nAlways order on their soft sourdough.  Tasty bread which I can't find anywhere else.  Bread makes the sandwich.  Bring your appetite.  Big sandwiches.", "author": "John K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "Best sandwich place I have ever had. I love Freddie's and have been going here for years. Make sure to come early or wait in line.", "author": "Aleks M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-25", "description": "Great sandwiches! It's all about their bread. I always get the sweet Dutch rolls...delicious!", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-27", "description": "Good sandwiches. Reasonable prices. Prompt, courteous service. \n\nChef recommends!", "author": "West R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "Holy crap was this place amazing. You could tell just by the line out the door. I eat a lot in one sitting but take my advice and get the small. My GF and I were feeling ambitious and both ordered larges. Let's just say we had plenty of leftovers for an afternoon snack.", "author": "Charles H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "mom and pop deli with great made to order sandwiches. decently priced for the area. \n\nthat said... unless you get a large sandwich. I would ask them NOT to cut your sandwich. Today, I ordered a small (~6\") sandwich on dutch crunch  sandwich and the lady that made it cut it TWICE. WTF. so my small sandwich is in three pieces and do you know how hard it is to keep a sandwich together when it's big? THINK about it when each piece is about 1.5 -2\" wide. I may as well have eaten this as bread salad. maybe she spaced out and thought she should fix it so all the pieces would be even but you know what lady? EFF YOU!", "author": "sasa w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "These are the best sandwiches ever!!! We got a club, Italian and a veggie!!! They were packed with meat/veggies and the bread is delicious.... Next time we are in town we will definitely go back....", "author": "Kim M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-30", "description": "I just had a spectacular sandwich today at Freddie's.  I got the honey roasted turkey breast with avocado, tomato, and lettuce on a soft sourdough roll.  Amazing!  Next time I want to try the Italian.  \n\nService was great, quality was awesome, and prices were very reasonable.", "author": "Mara M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-28", "description": "Was driving around looking for something to eat and found this place. Didn't see all the positive reviews so I tried it with an open mind. First off, this is the kind of place I love to go to - local store, chill and friendly vibe, people seemed friendly and nice.\n\nGot the club on onion bread for me and a turkey on wheat roll for my wife. Both sandwiches were huge, stuffed to the gills with meat. The meat seemed fresh and the bread seemed pretty good; but both didn't wow me like it has others. There wasn't any special sauce or anything out of the ordinary; they didn't have any special meat from a hidden source or flown in from out of town anywhere; nor did the bread tasted like it was from a special bakery somewhere. It was two decent sandwiches made to fill you up. \n\nLater on I noticed they do have other types of spreads (garlic/jalapeno, etc) and many seemed to recommend the italian combo. I'll definitely try it next time. That reminds me, for someone who was going for the first time, the menu seemed a bit large and intimidating. And I even looked at the menu for a long time. \n\nWill try again when I'm in the area, hopefully I'll pick something better that might wow me.", "author": "Dom L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "This place is right down the street from where I live, and I'm so happy I live where I do, partly because of Freddie's.  They consistently provide amazing sandwiches for good prices and without the frills.  It feels like a true Italian Deli inside, and I am always so happy when I eat my sandwich!  Love this place!", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-20", "description": "This our favorite sandwich shop. It's had several owners over the years; however, the concept is the same. You order off the sandwich board; sandwich is made; your order is called; then you pay. \n\nMy favorite bread is the soft sourdough. It's one of their original offerings. Sandwiches come in various lengths starting with the 6\" up to an entire loaf. \n\nI always order the roast beef on a soft sourdough with jalapeno pepper spread. \n\nMy husband raved about his hot pastrami and cheese toasted on a hard sourdough. He said it was the best ever. It took 15 minutes prep time, but he said it was worth the wait. \n\nFreddie also takes phone orders and fax orders. There's always a line of students and office workers, but it's one of the best sandwich places in the City. I like it much better than Ike's which I think is overrated and over hyped. \n\nOnce in a blue moon we'll order an entire loaf. They'll cut the loaf into party bite size pieces. Great for a picnic.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "One of top 5 sandwiches lifetime. Italian combo with provolone, oil and vinegar, and jalapeño spread on soft sourdough. Wow!", "author": "rick r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-07", "description": "Nice service and fair price, but honestly I've had sandwiches that were way better.\n\nI was lucky and beat the lunchtime rush by a few minutes to order a sandwich. When I walked in, there were only two other people in there. A few minutes later, after I ordered, I turned around and a line had formed going out the door and starting to turn the corner of the block. I guess a lot of people really like this place.\n\nI ordered hot pastrami on soft sourdough. I liked the bread, but out of the rest of the sandwich I could only taste the mustard. I don't mind mustard that much, just not when it overpowers the taste of the rest of the ingredients. Also, the sandwich was pretty drippy, and it didn't help that I was eating it in my car and I didn't have any napkins.\n\nMaybe I'll have better luck next time if I decide to try this place again.", "author": "Allen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-22", "description": "Great sandwiches. I especially like anything on their \"Soft Sourdough\" bread. It's all about the bread!\n\nFew issues keep it out of 5-star territory:\n\nFirst, seating. Benches and plastic chairs outside. Small plastic \"coffee tables\" too, but no proper tables, and nowhere to sit inside. In that regard, I prefer Subway or Togo's.\n\nSecond, Menu. It's too complicated. Ask for a turkey sandwich, and he'll ask \"which kind?\". Look, I'm a simple guy. How about the TURKEY kind of turkey sandwich? (note to the uninitiated: the \"Deli Turkey\" is the cheapest).\n\nThird, when he asks \"Any cheese?\", it feels like an upsell, which I don't like. First time, I heard it as \"And the cheese?\"--as if the sandwich comes with cheese; the only decision being the kind I'd prefer (again, this is how Subway and Togo's work). But no, he's saying \"any cheese?\", which really means: \"That sandwich doesn't come with cheese (although some of our other sandwiches do); would you like to pay extra to get some?\". Some might see this as kind guidance to build the perfect sandwich; I see it as a way to get another 43 cents out of me. Look, you're the sandwich maker here, not me. If you think cheese is good on that sandwich, how about including it in the sandwich and adjusting the price accordingly? Can I please just get a yummy sandwich without doing a cost-benefit analysis? Thanks.", "author": "No C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-17", "description": "Very good!! They use a lot of meat and the bread was fresh. Very filling! I wish I had one in Chicago!", "author": "Brandi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-25", "description": "First time I saw this place, I dismissed it as a typical corner store deli shop. Thankfully, due to my girlfriends past experience with Freddie's Sandwiches, I gave it a shot.\n\nThey did not let me down.\n\nThe minute you walk in, you see a great selection if sandwiches to order from. The notion of it being just any old deli was dismissed. It was a LEGIT deli store committed to it's Sandwiches. \n\nYou have the option of a small, medium, large sandwich or even a monster sized length. The small size itself is quite large despite it's \"small\" label.\n\n Various options of bread are available from my favorite Dutch crunch, to sourdough, French, soft sourdough, etc. You can choose from one of several meats and have the sandwich engineered to your own likings. \n\nFreddie's is a fantastic spot and reasonably priced. The only downside is there is no real dedicated eating area with only a bench out in front or setting up your own table from provided chairs and table. This is the only reason I couldn't rank it a 5 star spot. Maybe in the near future it'll be possible to install some sort of eating area or tables around the deli, but since it's North Beach it wouldn't hurt to walk to a nice area to eat.\n\nOverall, great taste, good prices, wide selection and located in s nice, chill area. Freddie's is the place to go if your in the area and mood for a sandwich.", "author": "Jesus A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "Large sandwiches old school deli style. If you are hungry get the large, but the small is plenty to suffice. The beverage options are plentiful and the candy selection is a nice touch.  Great friendly service!", "author": "Rob M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-30", "description": "I should be ashamed of myself. I've lived around the corner from this place for almost three years and I just made my way there this week. If there is one thing about NY it's heroes, hoagies, grinders, subs...you get the idea. So when I finally made it in this place I was very excited to see what the results would be.\n\nFreddie's did not disappoint. I love heroes and they came through for me. There are only a couple of sandwich spots in SF that I would recommend and go back to and this would be one of them. One make-or-break factor is the amount of meats, cheeses, etc. This thing was piled high with meat and other ingredients and that makes me happy. How lame is it when you hear all over town about some amazing sandwich just to get one there and see two or three pieces of whatever? I hate that and will never order another one - ever!\n\nNot a fancy place (and a deli/sandwich shop doesn't have to be), good heroes, nice staff, and a decent price. I'm now a fan of Freddie's!", "author": "Gabriel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Wow my family and I spent a day in SF. Well it came to that we were getting hungry. Well we wanted something authentic good and full filling. Well this sandwich shop had what I was looking for a little Shop in a hole, the sandwiches we got were Italian combo and hot pastrami and turkey with pesto. Man the Best sandwiches we all have had. FULL FILLING & DELICIOUS!", "author": "E C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "This is one of those Italian delis that I'd probably never have tried without the rave reviews from Yelpers since it's way out in North Beach on a quiet side street away from all the action.\n\nBut find it I did and I went straight for the italian combo on sweet dutch bread.  I didn't get a chance to eat it for about an hour afterwards but even then it tasted really good.  The spiciness from the generous heaps of salami, cotto and other Italian meats balance nicely with the sweet roll, although I still prefer the dutch crunch version which they don't have.   \n\nNice deli option if you're ever in that part of town.", "author": "F. P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-22", "description": "Pretty good sandwiches and very filling. Don't let the 6' size fool u. It's stacked with meat and I couldn't even finish it. I had the Italian combo. Really good. Also roast beef was good. And the freshly sliced meats made all the difference with the selections of bread made these sandwiches worth coming back for. Prices decent for the size of sandwiches. I don't think anyone should really order anything larger than 8\" as it would be too much food for one person. \nThere are no tables to eat here bu they do supply chairs to eat outside if you wanted to eat which we did right away.", "author": "Mrs H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-12", "description": "My family has been going there for over 30 years and it is my favorite deli to visit! The Italian combo is traditionally what my family orders.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-31", "description": "Italian combo on soft sourdough, the most awesome sandwich in the world for around $6 bucks! Not to mention Freddie's carry other great bread varieties such as dutch crunch, wheat, etc. \n\nI can probably eat this everyday if this place wasn't so far away! And if you take the sandwich to go, you can easily walk towards pier 39 for a better view and a relaxing lunch break.", "author": "Ming S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "This place is a local favorite that has been around since the twenties.  \n\nYou can choose from over twenty five different sandwiches.  I have never tried a sandwich here that wasn't outstanding.  \n\nMy go to favorite is pastrami, cheddar, everything, jalopenos, heavy mayonnaise, served hot on dutch crunch!\n\nYou owe it to yourself to get your butt down to Freddie's for one of his famous creations.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "I have lived in the neighbored for 7 years and I have never heard of Freddie's. After I found a deal on scout mob I figured that Freddie's had to be a new place. Nope I was so wrong it has been in NB for over 85 years.\n\nVery small establishment but the sandwiches are very big. I ordered the smoked turkey it was perfect. I could only eat half it was so big. I am a very picky eater and they made the sandwich the way I wanted it with out a fuss like some places do.\n\nThey have a small beer selection so it is great to grab a sandwich, beer and a cookie and sit outside and enjoy.\n\nI am a fan for sure and now that I no it is so close to home I am sure you will be seeing a lot more of me.", "author": "Christian A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-27", "description": "This is a small convenience store/deli and it definitely does not disappoint.\n\nI love a good Italian hoagie over here on the east coast and the Italian combo at Freddie's can hold it's own.  The bread is soft and delicious.  All the meats and cheeses were fresh and tasty.  And they are HUGE.  Only go into the large if you are really bringing a big appetite.\n\nThere are only a few seats outside, but with a short walk you can be at the water and enjoy a great sandwich with a great view.", "author": "Mark H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-04", "description": "I came to Freddie's because a friend told me how good it was years ago when she went back in middle school. I was not disappointed, in fact, in all honesty it has to be one of the best ,if not the best sandwich spot in  San Francisco with great prices. The salami is perfect because it has some of the natural oil and it compliments the mayo. The mustard was standard. A nice touch was the way the lettuce was shredded because it wasn't messy. The sweet dutch that they use is truly one of a kind.\n\nThe sweet dutch has a sweet after taste that gives their sandwiches a unique touch. The bread isn't chewy either, or rough like other sandwich places. It has an old feel to it by the way the interior looks. It just one of those spots you have to try. They close at four so you better hurry, I promise it's worth it!", "author": "Pansy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "This is my favorite sandwich shop in the entire city. I live in north beach and it's always my go to place. I love everything about it, thinking about this  place just makes me happy :) my only complaint is that I wish it was open later so I could go more often! I guess it just makes my Saturday's that much better!", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-26", "description": "Came here many a weekend when i lived in North Beach. A little tucked away, which is nice that all the tourists dont know about it. The employees work very hard to craft a well-made sub sandwich made to order. I always got the turkey, so cannot speak to the quality of the italian meats.\n\nThe sandwiches are reasonably priced, so look to spend about $10-$12 on a sandwich and drink. Closed on sundays.", "author": "Jeremy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "I got the Italian combo on sweet Dutch with hot pepper spread. It was fantastic. The meat was piled high and the pepper spread was the perfect lunch heat, not too much to make you want to relax your tongue after each bite.  My wife got the sweet turkey with everything and said the pickles and onion were perfectly distributed making each bite excellent. Would love to come back if we come back to the bay area.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Best place ever!! Came to Frisco on a vacation and decided to try out this place and it was extremely good! The sandwich that was probably the best I've had here is the turkey pastrami on whole wheat bread and I got it hot! Talk about flavor this sandwich had it all!! Delicious!!", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "My only regret is not ordering a small size of the Italian Combo. Great food, greater portion sizes. Plus it got that old school cool. No regrets.", "author": "Brendan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "I come here about once a week for the Italian combo (- onion + pepperoncini) and this gigantic sandwich never disappoints. The sourdough bread is delicious, and a small is plenty big for my equally enormous appetite.", "author": "Bryan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-18", "description": "Simple, generous portion and delicious - that's Freddie's.  The sandwich is made the way I remember from my school days and it's just as good today as it was years ago.\n\nFreddie's is definitely a favorite to the kids from Francisco but it's also a local favorite, as well as tourists.\n\nA large Italian combo is only $7.75, they half and wrap it up separately for you without asking.  You can enjoy your sandwich right outside at one of the two benches or help yourself with the stackable chairs and tables.  Just be sure to clean up after yourself - garbage and recycle cans available at your convenience.\n\nGreat selection of soft drinks and chips including Dirty and Kettle.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "Clean little sandwich shop, nice variety,  hefty sandwiches,  jalapeño paste on whatever sandwich is a must try.", "author": "Ron P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-11", "description": "I order from this place through Gopago. Freddie's is fast and tasty. I love the Italian roll with sourdough. It's fresher than Subway and a lot tastier. Everytime I'm there the staff is very friendly and accomodating.\n\nThere's barely any parking nearby because it's residential mostly. I park on Bay St. and walk up a block to pick my sandwich up.", "author": "Johnny D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "My new go-to for a sandwich fix. I order from them using OrderAhead and it's always ready to go when I arrive. I recommend for take-out only. I subtract a star because it's a bit pricey (yay SF), ambiance is nil, and their non-sandwich options don't look very appetizing. Regardless I definitely recommend Freddie's!", "author": "Emmy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-17", "description": "Everyone had written great reviews about the Italian combo and I'm a sucker for that at any sandwich place so of course I had to get it.  It was packed with a lot of meat and the bread was really good too which made a good meal.  I still think there are other places in the city that have better Italian combos like Molinari's but I'll still take it.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-12", "description": "Italian Combo Sammie rocks!\n\nPiled high with meaty goodness on fresh sourdough.  Friendly service and fast if you show up around 3:30 on a Saturday afternoon.  Even easy to park.  \n\nNot hard to understand why this gem of an Italian Deli has lasted 86 years.\n\nWishing them (& me) 86 more!", "author": "Lxs S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "I ordered a large(8in) Italian Combo with garlic spread, and pepper jack cheese with Sweet Dutch bread and a 1/2 pint of potato salad with a friend. We splited the sandwich and the potato salad. Both of our stomaches and tastebuds were satisfied.\n\nPros:\n- sandwich doesn't get as messy as any other sandwiches.\n- gives lots of meat\n- really tasty\n- friendly cashier that remembers who ordered what\n\nCons:\n- long line ( even on a regular Monday afternoon )\n- the only place you can sit and eat are the 3 benches provided outside. There are also some green plastic chairs stacked at the corner of the street.\n- they don't have a toaster so they use the microwave\n\nI will be coming back for another sandwich, but I'd recommend to come here only if you're going to just order and go. The wait might be around 15mins depending on how long the line is.", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-02", "description": "Freddie's puts BK'S \"Have It Your Way\" and Subway's \"Eat Fresh\" motto shame! \n\nThey say police officers always know where good eats are and it's true. I always see local PD waiting to get their sandwiches here and for good reason; this shop has much history and the sandwiches are legit. \n\nAll it takes become a successful sandwich shop is good bread, fresh ingredients, piles of meat, and make it fresh to order -- all of which Freddie's delivers.\n\nMy favorite is the hot pastrami on dutch with the works and don't forget the jalapeno spread for a spicy kick!", "author": "Albert L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "One of my favorite old school San Francisco sandwich shops. I like the Italian combo. Bs da bing ba da boom", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "I love Freddies- a Northbeach institution that is delicious. Great food and great atmosphere. Make sure to call ahead if it is the lunchtime hour to avoid the wait!", "author": "Peter F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-22", "description": "Ahhh....this place takes me back to my grade school days.  Use to leave my house early just to go pick up a sandwich here before our school field trip.  This place you use to be able to order your sandwich by the ingredients.  My sandwich order would be typically:\n\n25 cent salami\n10 cent cheese\n15 cent bread \n\nThen they would slice the meat, slice the cheese and the bread and hand it to you on the butcher paper and you would take it over to the table and build your sandwich.  Bread....with a spread of mustard and the Salami.  Wrap it up and bag it and take it to school!!  This was the place to get a sandwich back in the days.\n\nToday, sandwiches are made to your order.  They have fresh bread to chose from, various meats and cheese....of course the lettuce and tomatoes and pickles.  Large selection of drinks and it is only $5.00 and up for a sandwich.  The best part of the sandwich is that the bread comes in daily so it's nice and fresh.  \n\nI had the French Roll Salami Sandwich yesterday.  Fresh French Roll, nice and crunchy on the outside, nice and soft on the inside.  Lots of Salami with a touch of mustard and to top it off with a couple of slices of Pepper Jack Cheese.\n\nStill taste good as back in the days!!  Of course it's a little more than 50 cents.\n\nIf your visiting Pier 39 or in the area....you might want to drop by this place for a sandwich.", "author": "Alan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "If you are looking for a quick bite to eat, this is the place to go! The sandwiches are made fresh to go and every bite is enjoyable.", "author": "Whet Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "Super fresh ingredients! Great, always friendly service.  They can get busy so order ahead.", "author": "Renee E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-10", "description": "Cool things that are in their 80s: My grandparents. Freddie's.\n\nThe former would probably love the latter. An awesome selection of meats (honey roasted turkey!), breads (wheat rolls!), veggies (something about shredded lettuce works so well on sandwiches) and extras (cranberry sauce is a reasonable extra $0.35 and you get a lot of it).\n\nAll expertly and quickly put together and served with a confident \"we've been doing this since 1926\" smile. The sandwich was a strong four stars, history earns them the full five.\n\nWishing both my grandparents and Freddie's good health and good sandwiches for years to come.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-10", "description": "I wish Freddy's was all around the city, they are the best!\nAnd the different sandwich are so different that you will find yours.\nItalian combo on onion bread that's mine!", "author": "Antoine P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-31", "description": "Was in the area and stopped by for one of their sandwiches, which run around $6.20 on up.\nI had the smoked turkey with everything.  Love the shredded lettuce, but not enough pickels and I need to remember to ask for more mustard.  It was salty but good on the sourdough.\nTried a bite of hubby's pastrami - too salty for me.\nJr. Yelper 1 had the smoked chicken and said it was OK.\nThey have a large fridge with lots of beverages and individual sized as well as large bags of chips on display.  \nThe man who takes your orders isn't very friendly.  He's like a sandwich Czar while the 3 ladies next to him are busy making the sandwiches.  I guess they taste good enough that regulars keep coming back. He greets them with a tone that tells you he knows them but unlike other small businesses, most of the regulars usually hang around and chat.  He doesn't have customers who do that.  He's almost on the grumpy side.\n\nThe sandwiches are reasonably priced, definitely cheaper than what you'd get at Ike's but the staff at Ike's are friendlier and their sandwiches are double the price.\nA lot of the regulars call ahead for their sandwiches, or order by phone ahead.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-09", "description": "The hot coppa on a soft roll is so good. Get the spicy spread and tell them to pile the coppa high! San Francisco is a tough sandwich competition. Spots like Ike's take all the glory (and rightly so) but Freddie's deserves its day. Love this place and try to stop by whenever I'm in north beach mid day.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-23", "description": "I have to say this sandwich was pretty underwhelming.  I got a turkey and ham with provolone, all the vegetables and garlic sauce.  It really lacked flavor all around, I'm not sure what they use for their garlic sauce but they should consider some scapes instead of parsley.  Dutch crunch bread was too chewy.  Most likely won't be coming back.", "author": "Naps V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-10", "description": "Freddie's has consistently been the best sandwich shop in North Beach for many years. I am not a vegetarian but their vegetarian sandwich with avocado, provolone, lettuce, tomato, garlic spread and pepper spread is simply divine. Try it on a toasted Dutch Crunch roll. I used to work 3 blocks away and got lunch at Freddie's 2x a week.\nThe owner is a generous and warmhearted soul.", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "Loved this place. Italian Combo on Wheat Oat and a Ham & Turkey on Soft Sourdough, both really delicious, stand out bread and mustard just made it. Friendly people and a nice quiet bench outside to eat, only a couple blocks easy walk from Pier 39 and so worth it!", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-23", "description": "Have you heard the phrase, \"I'm so hungry, I can eat a horse\" ? \n\n(More like, Matt can eat a pair of horses or relialistically, two super burritoes). \n\nIndeed I'm capable of doing the impossible, but my empty stomach and fatigue body couldn't survive the drive to the Mission District for a burrito. So I settled to this North Beach Deli to fill up my empty tank, which is also close to my crib. \n\nThis deli is located right across the street from a middle school, but fortunately, the deli is off-limits for the youngsters during midday. The menu selection is pretty selective and standard like most delis. I was so hungry that I bought \"three\" sandwiches; all for me. Selfish, am I?\n\nMy first sandwich is a tuna salad on a wheat bread. My second was a Vegetarian with a Provolone cheese on a Dutch Crunch (Just the usual fillings with sprouts, cucumbers, avocado and cheese without the meat). And my final one is a Falafel sandwich (bunch of falafels halves with a scoop of Tahini and Tiboulli). My three sandwiches including a bottle of Lemonade Snapple totalled to $22.00. Cash is all they accept, but there is an ATM Machine inside with a fee charged. \n\nThe friendly lady that prepared my sandwiches saying that, \"you must have some hungry people?\"\n\nI replied, \"Yeah, me!\" \n\n(She looked at me shockingly)\n\nShe asked, \"Are you going to eat \"all three\" sandwiches?\"\n\nI replied hurriedly, \"You bet I am!\"\n\nI drove home quickly, locked the doors and ate and enjoyed all three sandwiches in one-hour. \n\n(You can tell I was extremely hungry).", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-03", "description": "This place been making sandwiches for years. Very large selections of meat and bread. Recommend you order a large sandwich that way you can eat half and save the other half for later.", "author": "LL Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-12", "description": "Freddie's sandwich shop has been making delicious sandwiches in San Francisco since 1926. The primary location of this little neighborhood gem is Francisco and Stockton in North Beach. It's an institution for people who grew up in the neighborhood and went to Francisco Middle School. It's quite entertaining and timeless to see the kids line up for sodas, sandwiches and candy. The second location just opened up on Pine and Polk in the Polk Gultch neighborhood and I couldn't be happier. Our closest sandwich shop was Whole Foods which is barely passable compared to Freddie's. \n\nBest things about Freddie's are the super nice people who work there. It clearly is a family joint and it shows. Service with a smile but that warm grandparent type smile. My favorite sandwich is the chicken salad with the pepercini spread. Yum! The dutch crunch is amazing and the drink selection endless. I love this place.", "author": "Alice S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "I have been coming here for almost 10 years and each time is as good as the previous. I always get the small chicken salad  sandwich with everything on hard sourdough, so I can't give any advice on anything else! It is the best chicken salad ever. I have seen the italian combo and that looks good. It is a whole lot of meat, so be hungry. Over the weekend I went and we were just enjoying our sandwiches on the bench and multiple people stopped to chat and reminisce about when a freddie's sandwich used to cost you 9 cents, it was great. Best sandwich in s.f.!!", "author": "ashley m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "Freddie's is awesome. Great sandwiches with a huge variety of breads, meats, and cheeses. Fresh ingredients and quality service. They always get it right at Freddie's!", "author": "Paul H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "All I can say is that it's a good thing that Freddie doesn't deliver otherwise I'd be eating his sandwiches for every meal.\n\nThey are generous with fillings and large enough for two meals.  How they stay in business with their reasonable prices is beyond me but I'm darn glad they are.  Reasonable I mean.\n\nIn a neighborhood of sandwiches that have been over done this is the best!", "author": "Stitch H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-28", "description": "A+ ! \n\nI recently moved to sf and found an apt in north beach. I was wandering around my neighborhood hungry the day after I moved in and saw this sandwich shop. I picked the first item on the menu, italian combo on onion bread and took it home to each. BOY WAS I SATISFIED! for about 6 bucks you can get a delicious sandwich that will leave you looking forward to the next time you can come by again! \n\nThis place caters to the businesses around the area so they are only open til about 4pm.", "author": "omid a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-27", "description": "Hidden gem few blocks up from my new workplace. 6 inch, hot pastrami, sweet dutch crunch, with everything on it, minus cheese, add jalapeno spread and garlic spread. You've got yourself a monster of a sandwich, without the monstrous sizes of Little Lucca or Ike's. Btw this is the only place that I've ever been to that has a \"sweet\" dutch crunch, pretty darn good.\n\n Food coma, you shall not pass!", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-03", "description": "I remember back in my middle school days at Francisco, Every time when, I hear the school bell ring for lunch. I would run out from my classroom and into Freddie's just to have their famous sandwiches. It all depends on how fast you can get there. There were some other students that were faster than me and sometimes the lines can get really crowded with alot of students. But that did not matter to me after when, I had gradulated from Francisco Middle School. I did come back again to buy their sandwiches once again and this time without those students who once had beat me to the line just to buy a sandwich from Freddie's.", "author": "William B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-23", "description": "I'm not quite sure what all the raves are about. A fine sandwich place, but again, nothing (yet) beats Marina Subs.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-21", "description": "I'm visiting from Austin, Texas and my BnB is nearby. I got a sandwich from Freddie's and wandered down to the Pier for people watching and it was great. The service was friendly and FAST! I'll probably visit again before I leave town.", "author": "Cecily J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-28", "description": "My family has been coming here since they were students at Francisco across the street.. So I grew up since Birth on this place!!! The OG Italian Combo on soft roll is the BEST!!! Can't go wrong! Love it here!", "author": "Ray L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-16", "description": "Freddie's is my favorite neighborhood sandwich shop. They make the best Italian Combo in North Beach, their meats are just a bit tastier and fresher than everyone else's, and it's simply heavenly on a soft sourdough roll.\n\nI have a really big appetite, but a small is good enough for me. When I'm working from home, my favorite lunch is to grab an Italian Combo and a Ginger Beer from Freddy's, then head over a couple blocks to Washington Square to finish it off. \n\nFreddie also makes pretty good hot toasted sandwiches as well. I highly recommend getting a toasted corned beef with swiss. Yum!\n\nBecause Freddie's kicks ass, there can be a long wait during the noon lunchtime rush. The trick is to phone your order in 10 minutes before you pick it up.", "author": "Allen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-12", "description": "Decent sandwich shop in an area that seems to just lack places to get lunch in general.  Legitimately tasty italian meats, bread was ok, and I would say to definitely add the pepper spread.\n\nWill definitely go back and try other stuff but I ordered a small Italian Combo on soft sourdough with the works and pepper spread, which was plenty of food and only half the price of some of the other sandwich shops in the area.", "author": "Erin Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "Freddie's sandwiches - hate to give away neighborhood secrets but they have old-style deli sandwiches at a very reasonable price.", "author": "Serena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "If it wasn't for my middle school, I would have never discovered this place!  Freddie's sandwiches is a hidden gem.  I went to Francisco Middle school ('98-'01 )which was across the street from this sandwich shop.  I used to come here in the morning with my middle school friends to purchase a student sandwich for $2.50 - $3.00.  Isn't that a steal for young kids?  I think it was the salami or the italian combo that I used to order but it was really delicious!  The student discount were only for students who were enrolled at the school at the time.  \n\nWhat brought me to write this review was the sandwich I had earlier at Sourdough in San Jose.  The sandwich at Sourdough was amazing and instantly rang a bell in my head to remind me how much I miss Freddie's sandwiches.   Oh man, if only they had more amazing sandwich shops like Freddie's where I live now.  (I guess I have to discover them now!!) Till this day, I still go to Freddie's when I am home in SF.  Even my little sisters come here for their sandwiches, weekday or Saturday, didn't matter - that's how good the sandwiches are here! Prices here are fair and the sandwiches beat the price to it.", "author": "Lily M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-10", "description": "Good little sandwich shop in North Beach. I had a small turkey sandwich & a side of potato salad. The portions are generous, so I saved half the sandwich and potato salad for dinner. Two meal servings for less than $10? Score! The bread was super soft & delicious. I think I may try a hot sandwich next time. Also, very speedy & friendly service.", "author": "Kristen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-10", "description": "This place is awesome!!!! Best sandwich I had in my life. At first we actually wanted to leave after seeing this place because of the  first impression we had entering. We would have never gotten a sandwich here if it wasn't for the good reviews. Try the pastrami & turkey sandwich! OMG!!!", "author": "Meike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-05", "description": "I used to go to the original location 2-3 times a week when I worked near Pier 39.  I was ecstatic to lean that Freddie's now has a SECOND LOCATION at Pine & Polk.\n\nI'm normally not much of a sandwich person, but there is something about Freddie's that is so addicting.  Their soft sourdough is my bread of choice.  They also have really great spreads.  \n\nDo yourself a favor and GO TO FREDDIE'S!", "author": "S. Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-23", "description": "I grew up eating Freddie's sandwiches. I went to Francisco Middle school which was right next to Freddie's and i use to live near there. My friends and I would always. Honestly, in all my life no other sandwiches can taste as good as theirs. MUST TRY the Italian Combo with dutch bread. I always get that sandwich. I have tried their tuna. Thats good too.", "author": "Judy U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "My husband and I have lived in the neighborhood for more than 2 years .  We've walked by this place many times but never stopped in until today. 2 years of lost opportunities!  Our sandwiches were terrific.  My husband had the veggie on sourdough and I had a Black Forest ham/Swiss on wheat. The bread is really fresh.  We also included the hot and mild pepper spreads which were awesome.  We will be returning on a regular basis.", "author": "Grace K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-04", "description": "Soggy meat. Stale bread. Current owner has let things sliiiiide.", "author": "Brandon R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-17", "description": "Bomb sandwiches.  They are a pretty good size, I eat a lot and will be full off of a small sandwich.  They carry my favorite, peppered turkey.  Also, if you are into spicy stuff, get their jalapeno spread.  It's pretty much jalapenos diced and then spread on the bread.  Bread suggestions: onion bread which is extremeley soft and tasty and the dutch crunch which has the perfect amount of sweetness.  The place carries a bunch of other items for the school across the street: candy, chips, sodas, etc all of which are over priced but thats what you get for convience.   \n\nFor those of you who are familiar with Molinari's and Ikes, supposedly the best sandwich shops, this place doesnt have the same quality of meat as Molinaris and definitely not the flair of Ikes.  But it gets the job done, and done right.  If you are near Freddies I suggest stopping in instead of making the trek to either of the other places.  As I live a block away, it's an easy decision for me.\n\nOne complaint is I wish they were open on Sundays.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-21", "description": "Maybe closer to a 3.5, but I'm still giving it a 3 star for now.\n\nI work basically in the middle of tourist headquarters (right across from Alcatraz) and have a hard time finding decently priced to-go food. Freddie's is just a couple blocks away (though uphill :/) which makes it easy for me to try again.\n\nThe prices are in the $8-10 range which might sound pricey, but the sandwiches are HUGE. I'm secretly a fat kid and finished mine, but I definitely struggled towards the end.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "Italian combo on soft sourdough is amazing, especially because it is only about 6 bucks. The ladies there are really nice and friendly too. Tiny deli so don't plan on going there for the ambiance.", "author": "Akhil C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "Somewhat surprising to this former New Yorker, but a good deli is extremely hard to find in SF.  Maybe it's just the general lack of real delis that has me feeling this way, but I'm always happy to find a good spot for a sub, grinder, hoagie, or sammy (whatever your geographic persuasion might be).\n\nTO that end, Freddie's Sandwiches does NOT dissapoint!  They have a great selection of breads and rolls, and a team of ladies who put together giant sandwiches made to order.  The regular sandwich is enough for me (and I like to eat), but I usually go for the large so I can save half and eat it later.\n\nThe meats are good, the veggies are good, the cheeses are good, and most importantly, the breads are super fresh! Just make sure to get there early lest they run out of that incredible Dutch Crunch!\n\nIf you like it spicy, make sure to ask for jalapeño spread.  It is the BOMB!\n\nThe only thing I dislike about this place is that it's closed on Sundays... Seriously Freddy, consider a partner or some part-time staff to open up on Sundays, I work all week whch leaves me only Saturdays to enjoy some of the best subs in SF!", "author": "Rafael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-02", "description": "We live really close to this place and I am in LOVE with it. If you like tuna salad, get the ALBACORE tuna salad on sourdough with mustard and cheddar. SO GOOD! They don't put a ton of mayo in the tuna salad which is how I like it. The other sandwiches there are also really good, nothing fancy.", "author": "Claire b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-30", "description": "Strange.  I don't get it.  These reviews rave about the sandwiches here.  Finally got around to trying them for lunch today and it was thoroughly unremarkable.  It was not that it was unpalatable; but simply uninteresting, bland.  Really basic and blah.  We tried the turkey and the Italian combo.  Not so much bothered by the bland lunch as much as confused over the ratings.  Yelp usually is not off so drastically en masse, so I can't explain it.  But my lunch partner was equally unimpressed so it wasn't merely me.  Weird.", "author": "Liz K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-17", "description": "Ordered: Roasted Turkey on honey oat roll Swiss cheese no mayo no onions. \n\nI thought the sandwich was okay. Nothing special but decent. The roasted turkey was really thinly sliced and piled high which is a definite plus in my eyes. I thought the sandwich was a little dry. I know I don't do mayo but there should be an alternative to the nasty creamy white substance. The service was great. They were nice and quick even at the lunch time rush. I would go back again because I work near fisherman's wharf and hate hate hate Pier 39 but I wouldn't drive across town for one.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-11", "description": "I live in the neighborhood, and have been stopping by regularly for a sandwich for about two years. \n\nFirst up, I have no idea what's going on with the setup here - everytime I go in, it's the dude in charge and a harem of women who are apparently required to be silent, because they don't utter a word while they put together the sandwiches.\n\nIt seems like a weird Sandwich Palace, where the guy runs it like the Sultan of Sandwich Spread and forces his slavegirls to put together tuna salad after ham-n-cheese after veggie sandwich. But, you can't argue with quality. While nothing is a mindblowing sandwich experience, they are solid, totally reliable sammies that I would be happy to eat in any lunch situation. \n\nDecent prices, the service is fast and they have a great selection of beverages and chips on-hand to accompany your sandwich. I end up going with the soft sourdough almost every time, but the Dutch is also solid. \n\nIt probably would have garnered four stars, but it does get a lot of tweeny traffic from across the street, which of course Freddie's has nothing to do with or has any control over, but I am a vindictive a-hole who wields my Yelp stars like a careful ninja.", "author": "Drew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-07", "description": "Freddy's BLT is AMAZING!!! Such a cool old school deli that's been around since 1926 (give or take, don't really remember) but this place is so damn good I totally recommend it. Grab a sandwich and walk up Francisco st to a beautiful view of the city.  This place is very 'San francisco'", "author": "Michael A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-10", "description": "I eat here at least once a week; I've been here as much as 5 days in a row.\n\nYour standard sandwich shop. Consistent. Sandwiches are solid across the board, no specialty sandwiches, so everything comes with the meat and your basic sandwich ingredients. Haven't really found anything I don't like, although the falafel needs a little work (bland).\n\nMy only real dislike is Freddie lets the kids from the school across the street cut to the front of the line. I guess it's so he can get them in and out of there as fast as possible, but if you're waiting in line during the busy lunch hour it could be a bit irritating.\n\nIt's my favorite sandwich shop in the AREA, so I wouldn't say to some out-of-towners, \"You've GOT to try this sandwich shop over by the wharf, it's to die for.\" Not gonna happen.", "author": "Harold C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "I've lived in the North Beach all of my life and Freddie's has been the sandwich institution. \n\nI usually go for the Salami and Ham, which is a great choice. But I also recently tried the Club Sandwich and it is single-handedly the best Club a sandwich I've ever had. \n\nFreddie's has some of the best Dutch crunch that and everyone knows it's the bread that makes the sandwich.\n\nThe people who work there are really nice and if you continue to show your face they remember you, which makes the experience a whole lot better!", "author": "Mario M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "Some of the best things in life are simple and very inexpensive.  This place is old school awesome.  Grab the Italian combo and head down to the water or up to Jack Early Park (since they don't have seating) and enjoy the simple pleasure of a Freddie's Sandwich.  The place runs limited hours so don't head over too late in the day!", "author": "Jim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-11", "description": "Dear Freddie:\nI was thinking about you the other day and I realized how much I miss you.  My office moved to SoMa and my lunch options have not been the same.  I loved how I could order a 6\" from you and be full for 2 meals for under $7. ( I know that I have a healthy appetite since every time I would go here I would always see construction workers order the same amount.  Let's face it those guys know a good sandwich when they eat one!)\n\nFreddie is also one of the nicest guys ever.  I love the neighborhood feel and he always remembers me.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-01", "description": "I tried the corn beef on dutch crunch here and I thought it was pretty good. The sandwiche didn't come anywhere near the taste of Ike's or Little Lucca's, but it is still very good.\n\nThey also have a good amount of drinks, candy, chips, etc here. Nice spot if you don't want to go into a liquor store to get this stuff. \n\nI noticed when walking in there for the first time, the man at the counter just gave off this Soup Nazi vibe. He seems like a nice guy, but he was pretty much all business when I was there. \n\nStop by if you're in the area, but I don't feel like you need to go out of your way to come here.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-05", "description": "there are 2 things a deli must have for me to give them my business: dutch crunch and shredded lettuce. freddies offers both and much, much more. it also happens to be 1.5 blocks from my house. lucky girl! honestly, their dutch is the BEST! super crunchy. i always call my (regular) order in and when i show up it's ready to go. i also appreciate that they cut and wrap halves individually in case you want to save some for later. they have everything figured out. a vast array of drink + chip selection and they take cards! salami+cheddar+revive vitamin water for $8 is my saturday hangover (or not) go to. the only thing that bums me out is that they're closed on sundays but hey, everything good deserves a day off.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-29", "description": "I went to Freddie's for the first time today and I agree with most of the yelpers - 3.5 stars.\n\n The sandwiches here are pretty solid. This place is not as crazy as Ike's or Little Lucas with the house-made garlic sauce, nor does it try to be. Freddie's still has a wide selection of fresh bread, including my favorite - Dutch Crunch, and the normal deli choices. The sandwich is huge; they don't skim out on the ingredients. I got a small albacore tuna sandwich (6\") with avocado for $7.70 today and I was full eating just half of it, granted I'm a girl who doesn't eat THAT much. But still, it's still a pretty big sandwich.\n\nCoworker got the club (ham, turkey, and bacon with avocado) toasted. She didn't like it as much as I did. They toasted the sandwich without her asking which she didn't mind. But it was a little too toasted which made the bread dry and the ham made it a bit too salty for her.\n\nIf you work near the Wharf and given the incredible lunch selection we have here, I'm pretty sure I'll come back here again.", "author": "Winnie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "This eatery should be designated as a SF landmark.  It's been here since 1926 and been changed hands a few times.  The current proprietor has been here for more than a decade.  Its main clientele is the school across the street.  I hear that people who grew up in the neihgorhood and moved away still come back for their fixes.  I was curious enough and made the trek to this little corner store.  There's nothing fancy about this North Beach establishment and it does show its age.  I didn't seek out the traditional turkey or roast beef sandwich.  I went for the large Italian Combo ($8.50).  Although its a little pricer than Subway, but its a hundred times better.  Pound for pound, I think the amount of meat in it actually makes it a bargain and tastier than the $5 Subway.  I usually don't (or can't) consume a large sandwich at one sitting.  On this occasion, when I started, I couldn't stop and broke my own record.  This is not the best sandwich in the Bay Area, but its on my short list.", "author": "Jean T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-12", "description": "Have been going here for 45 years. We make special trips out of our way to get sandwiches. These are the best sandwiches anywhere!!!!!", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-04", "description": "Been coming here for a long time and i mean like for over 20 years. Place hasnt changed. Love the variety and the prices. Keep up the good work and im sorry bout that time when my son knocked over the bag of chips lol", "author": "Tareau B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-30", "description": "good memories coming here for lunch when i worked in the area.\n\nsoaking up the sun on the bench outside, sandwich in hand, watching the kids play at recess at the school across the street, the very italian locals walking by.\n\nthe sandwiches are big and filling. definitely get the spicy sauce.\n\ncan get pretty busy at lunch time but the guy at the counter (freddie?) always remembers who ordered what.\n\nsimple, no fuss, no stress, easy, tasty sandwich shop.", "author": "Shawn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-11", "description": "This review stack is already filled with intimate details about how amazing the sandwiches are. So how about some random points...\n\n- When me and my wife wanted to move, \"Not being able to walk to Freddie's\" was 3rd on our CON list.\n\n- I think my friends visit me just so they can get Freddie's, and eat it outside on my porch.\n\n- Craving something to put you in a food comma on Sunday? Want to taste something crafted by an immortal sandwich smith? Prepare for tears my friends. Freddie's is closed.\n\n- I was in San Jose, starving and hungover.  I didn't eat till the afternoon before. Instead of grabbing something to eat down there. I drove all the way home, and walked from my car, straight into Freddie's.", "author": "Tom G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-08", "description": "I'm pretty much just going to add to the rest of the amazing reviews about Freddie's.  I definitely love to read about those who use to come here during their middle school days at Francisco. My favorite memories and stories however, are those of my parents who both attended Francisco back in the 60s. And while they didn't know each other back in middle school, they both agree on this one simple fact: lunch at Freddies.  I'm glad to hear it has pretty much stayed the same over the years.  \n\nI love their Italian Combo, on both Dutch Crunch and Soft Sourdough.  I always get the whole loaf to share and it's great that you can chose from a variety of different breads instead of getting the same one just because you ordered a whole loaf.  For the best deal, get a whole loaf and mix up the breads.  \n\nSandwiches are huge and Freddies is very generous with their meats, and sides like shredded lettuce, tomatoes, cheese, etc.  I love adding jalapenos to my sandwiches for that extra zing.  I also have this little weird quick about my sandwiches from Freddies...buying a bag of chips and putting them inside my sandwich. The crunch is a great addition to the sandwich in my weird opinion. Give it a try next time =D  \n\nSimply said, Freddie's is one of the best local deli's in S.F. And for my family, it definitely goes 2 generations back;  Not quite that long, but I hope to have this local gem to be in business into the near future.", "author": "Cass J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "My boyfriend, his bestie and I came here to meet up with my bestie for lunch and spend the whole day to hang out in the Bay. After looking for a good lunch place, I came across lots of positive reviews from this place and figured, \"Hey why not?\" So we had lunch here outside the shop on some chairs. We all loved our sandwiches. It was yummy in our tummies! I got a roasted chicken breast with veggies, avocado, provolone cheese and whole wheat. Big portion, but satisfying and healthy at the same time. Made with fresh ingredients. Subway got nothin' on this place! Next tim I wanna try the vegetarian sandwich with hummus. Yum! I love the location too. How it is walking distance from Pier 39 and the surrounding cafes and restaurants. This area would make for some great photo taking (since I am an aspiring photographer/graphic designer and get lots of inspiration from SF)", "author": "Hannah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "i am currently in the midst of a serious, potentially fatal food coma.  experts are hopeful at my recovery, but not making any assertions just yet.  \n\nthe cause of this food coma was a SMALL sandwich from freddie's.  it was also vegetarian, so this isn't even meat induced.  instead i'm a victim of wolfing down a delicious soft sourdough sandwich, piled high with tomato, lettuce, cheese, pickles, cucumber, avocado, and myriad spreads of deliciousness. \n\ni've started to wiggle my toes and blink my eyes, so it looks like i'm going to pull through.  but now i know not to tempt fate like that again.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-02", "description": "Hands down one of the best sandwich spots in the city cant beat a full loaf Italian combo on their hard roll.", "author": "RYAN Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-24", "description": "Did I have lunch in the same place as the rest of you? \n\nMy bf and I had been meaning to stop in here for a while and finally did for lunch today. The portion size was good, as we were able to share a large. The sandwich was fine, but certainly nothing to get excited about...\n\nI'm able to identify low-quality meats when I see them (thanks to a past job...)  and I saw them at this place. And the bread was dry.I can get that from my local corner store. Oh, wait. My corner store has better quality meat than Freddie's.\n\nThe place is clean and well-kept, so I'd eat a Freddie's sandwich again if it were presented to me,  but I won't be back.", "author": "Sonj F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-20", "description": "Freddies is awesome! The italian combo on sourdough soft is where its at! Not only is the sandwich one of the best in sf, but the price is amazing. Only around 5 bucks, where else can you get that?", "author": "Marshall B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "Great sandwiches with quality ingredients. While they do take credit and debit cards, bring cash to expedite your order since it can get pretty busy around lunch time.", "author": "Will K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-13", "description": "Friends of mine were at Freddie's and helped me pick up a sandwich from there. I never tried it before but it was delicious!! The bread was perfect and they piled my italian combo to the max! \n\nWill definitely be back!", "author": "M W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-22", "description": "Great sandwiches!  Freddy's has become a Saturday ritual for me.  \n\nBeing this far north in North Beach (practically fisherman's wharf) leaves me aching for quality food.  Freddy's fills the gap!\n\nA desperate wish of mine is that they catered more to vegetarians with some kind of veggie lunch meat even if it was something easy like Yves.  I also wish they had vegan mayo but hey, I can't get everything I want.  I also wish I could get my Freddy's on in the evening and on Sundays.  Either way, they still get 5 stars.", "author": "Jeff G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "Great sandwich shop for a quick lunch! Very old school, but super friendly staff and great bread selections.", "author": "Holly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-23", "description": "I came here during my obligatory tourist hours during family visits. They wanted to see North Beach and I picked this place to grab some lunch given its high praise here on Yelp.\n\nMy mother-in-law, who turns her nose up at \"store bought food\" praised this food. Praised it, like an evangelical praises the LAWD! I actually had some of hers to see if it was laced with drugs. Turns out it was laced with Scrumptious.\n\nMy BLT was great, although the bacon was not as crispy as I like it. That's a pretty small whine compared to the good parts. Service was great, the ingredients were fresh and delicious, bread was wonderful. Quaint little spot, even had a couple of chairs outside to sit and eat your sandwich on a nice day.\n\nIt does not beat Roxie, in my opinion, but it's up there.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-16", "description": "Solid sandwich and the cure to my champagne hangover.\nCrusty sourdough roll, herb/garlic spread, shredded lettuce and meat = the best thing ever on Saturday morning.", "author": "Kathleen E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-07", "description": "Ah, there's nothing like grabbing a veggie sandwich between 12:30 - 1:30pm and watching the little middle school children play during their lunch break across the street...\n\n They're delicious and affordable (The sandwiches, that is...)", "author": "Scott G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-05", "description": "ugh\ni said no onions dude. no onions. they are my arch enemy!!!! \ndon't fill my sandwich with onions. so pumped to try this place since it has such great reviews. threw it in the garbage right when i got home.\ndetails are important.", "author": "Tiger Lily .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-14", "description": "So last week i was in the neighborhood and had no clue what to eat.  I searched yelp like i always do on my android phone and phone this sandwich shop with 4 1/2 stars.  I was starving and decided to give it a try.  Got lost a couple times cuz my Navi steered me wrong but finally found the place.  Its a small deli and i ordered the italian on soft sourdough cuz it had great reviews.  Waited to 5 mins and was ready to chomp away.  First impression was sandwich looked like any other ive had before.  Took a couple bites and thought it was alright.  Then", "author": "Hugh L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-09", "description": "I'm on a sandwich kick.  After experiencing Ike's Place yesterday there is little that can satisfy me at this point in time outside of a damn good sandwich.\n\nFreddie's is levels better than RJ's (in the same area) and about two to three dollars cheaper, too.  Definitely worth the small trek up those random ass steps from Embarcadero.  \n\nMinus stars though because the \"soft\" sourdough tore up the roof of my mouth.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "This place is always busy and you'll know why when you eat one of their sandwiches. Huge ! Unless you are a total pig, be sure to only order the\nsmall size. I am falafel lover and often opt for their tasty version - available in spicy or regular. Only open for lunch during weekdays. Definitely a take out spot - only a few seats available outside.", "author": "Kathleen D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-01", "description": "ok I admit that I am I guess a fan of this place due to nostalgia . when I was in 7th grade I use to come here and get ham and chesse on a sour roll and still do even though the chesse is not quite the same and the ham is not the same. got some gristle in the ham the last time humm....but I guess I would still come here. oh you can order extra meat and chesse it just cost you more like $25 for 2 large sandwiches.", "author": "Nellie J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-25", "description": "Dear Freddie:\n\nYou can totally suck me. Print this out and put it in the window with your other reviews, please. I am your neighbor and a loyal sandwich buyer of 3+ years. You still don't recognize me. You still treat me like tourist trash. You still serve people that arrive 10 minutes after me first. You even let your (OUR) mailman give me the 'tude. I have been nothing but a supportive, friendly patron to you. \n\nI have a newsflash for you, Fred - your sandwiches are good, but they aren't good enough for you to treat people the way you have treated me for the past 3 years. We're through. Over. Done. Finito. I don't want your dutch crunch any more, pal. \n\nI can get my salami elsewhere.\n\nLovelessly,\nKatelin\n\nP.S. You knew it was coming, didn't you?", "author": "Katelin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "Fresh baked bread, friendly service, hellofa sandwi.\n\n I say that the sandwich is delicious and many concur. Come check it out. One of my favorite spots to get a sando in the city, and i have been to many", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-13", "description": "I live a block away from here and I really do love this place.  I do have to disclose that this place have been here ever since I've lived here, so I am bias.   \n\nThe previous owner knew that I use to live around the neighborhood and would always give me a couple of slices of salami while I waited for my sandwich.  I was probably 7 back then and he would always look after me.  After making my sandwich and me paying of course........he would watch me while I walked back home.  I can see the sandwich store from where I live, so it was very comforting to turn around and see him waving at me.  This neighborhood use to be a little tough back then..........so you can probably guess how long ago this was.\n\nMoments like this makes me remember how the little things in life are so important.  Anyway.........the business was then sold to one of  the workers( I love these types of stories).  The worker then took over this business and made it to what it is today.......  A great deli in the North Beach district that still keeps the integrity and culture of Freddie's sandwiches.  This sandwich is not toasted nor does it have any fancy dressing on it.  I order my sandwich freddies way. It's a soft sour, mayo, mustard, your choice of meat and that's it.  This is as simple and as good as it gets.\n\nI use to go here for lunch when I went to middle school across the street.  They have a huge array of candies back then.  This use to be a place where you bought now and later, jolly ranchers, lemon heads, Alexander the grape..........all of those old school candies.  I just love how they preserve the interior of the shop and still looks and feels clean.  \n\nIt really is great to see a business in this neighborhood do well.", "author": "jason g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-30", "description": "Great sandwiches.  Good selection of fillings.  Good service.\n\nI live less than a block from here.  It sometimes takes them a while to make your sandwich so I recommend calling it in.\n\nEnjoy.", "author": "Theron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-12", "description": "Whenever I walk by Freddie's, it's always surrounded by people who work and live in the neighborhood:  a local cop or two, the trash collector, North Beach residents, school kids from across the street, and people working in the offices nearby.  There's a reason why they keep coming back.  The menu variety, quality of meats and breads, customer service, and prices are top-notch.\n\nPersonally, I first came in for the sandwiches, but now I come back for the jalapeno spread (this stuff is delicious).", "author": "Andrea U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-04", "description": "The reason this gets 4 stars is mostly because there is absolutely nothing else in the area that's even half-decent. A bad area to work, for sure.\n\nThe  dutch crunch rolls are great, the garlic spread is super-yummy and they have a good selection of both meats and gourmet potato chips. Other than that, it's a sandwich shop but in this area that's sadly enough.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-19", "description": "Solid sandwiches, especially for the North Beach area.\n\nCafe Capiriccio is very very good, but if you want a deli sandwich, you have to go to a deli-sandwich place-- this would be the place to go.  \n\nI wasn't in the meat mood, so I was between the vegetarian (cheese, avocado, garlic spread, and the regular works) and the falafel vegetarian. I was in the \"regular\" sandwich mood, so I went with the vegetarian. Nice blend of flavors-- the oil and vinegar, crisp lettuce, garlic spread, and the very very good dutch crunch. \n\nI would've liked more avocado. It seemed to be just a small layer within the thick sandwich, but avocado in a vegetarian sandwich is usually what I consider to be the main ingredient. Good size for a dutch crunch though. (Small was $5.95) I've been to too many places where the dutch crunch is a small roll and you feel cheated.\n\nMy boyfriend had their honey turkey and was jealous that this deli is close to my work, not his :)\n\nWill be coming back sometime in the future and trying their Mediterranean vegetarian sandwich. :)\n\n2 benches and a few chairs are outside of this store. The store has a very small, local feel. The owners (i think) were very friendly and conversing with the regulars. Good collection of Kettle chips (though they were out of the Spicy Thai flavor!!! my fav!)", "author": "Saori E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-07", "description": "When you order your sandwich at Freddie's, you get your choice of meat, bread, and condiments, and it's all put together by a fast and friendly staff.  These are sandwiches for people who like sandwiches.  These are not finger sandwiches for wine and cheese soirees.  You get something tasty and substantial.\n\nFreddie's can sometimes get quite crowded at peak lunch hours, so if you don't want to wait in line, go early or wait until the lunch rush is over.\n\nThere's one small bench outside of Freddie's, but there's always places in the neighborhood to enjoy your sandwich, like Jack Early Park (really just a staircase with a small platform up top and a great view), and a bunch of green space down the stairs towards the flat part of Francisco.\n\nA couple times I stopped back to check on the neighborhood for a bit of dot-com nostalgia.\n\nThat expensive office building on Francisco that I used to work in has been unoccupied since October  2001, but that's not important to me.\n\nThe important thing is that Freddie's Sandwiches is still there.  Cheers to that! :)", "author": "Justin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-19", "description": "Are you kidding me about this friggin place? I mean to say that Freddy's has the best sandwiches in North Beach if not North America would be a disservice, because I literally have dreams about swimming in a country pond of their chicken salad with only pepperocinis covering my dijon-smeared loins.\nI cry out at night for dutch crunch, and hot coppa.  Stare out the window at work for hours enraptured with the thought of curling myself about a large toasted Italian combo with everything, yes give me everything, with jalepeno spread, so that i may relive that first time I made gastronomical love my first Freddy's sub....oh Lord. give me Freddy's or give me death.", "author": "zach o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-18", "description": "THE BEST SANDWICHES IN SAN FRANCISCO!\n\nno lie, I would recommend this deli to anyone; including you, you and YOU! I've been a loyal customer for 10 years, not kidding! It doesn't matter what sandwich you order, it'll just be super tasty, and super filling. The prices are fair and there are sooo many selections to choose from.\n\nAlways fresh and always good! I SWEAR BY THIS SANDWICH JOINT!", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-28", "description": "Ok, this place is right around the corner from where I work and everyone raves about it, so I thought it was time to give it a whirl.\n\nFreddie's offers many different sandwiches, breads, hot, toasty, sizes, you name it, it's an option.  A small sandwich is $5.75, not too bad for a decent lunch.  I didn't have to wait very long, which is a plus.  It certainly tasted awesome.  After half of my sandwich I was full as well, a small is certainly filling.  This is a cash only place.  There is an ATM inside, but I hear it charges you a $3 fee.  You've been warned.\n\nI have to knock off a star  though for who I assume is \"Freddie\".  I was half expecting him to say \"NO SANDWICH FOR YOU!\"  Dude is the sandwich nazi, I swear.  I mean really, would it kill you to be cordial?  People are flocking to you and throwing you their money.  Surely that has to make you somewhat happy!\n\nI'm sure I'll go back since it's so close, but really, buck up tiger.  Too many bad attitude experiences will make even me run away, and I can tolerate it all.", "author": "Jen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-03", "description": "I had the vegetarian sandwich on sour sourdough roll which came with: tomatoes, shredded lettuce, cucumbers, tomatoe, cheese, mushed avocado, oil and vinegar, pickles, pesto spread, mustard and mayonnaise.   \n\nIts $5 for a (large) small.  $6.50 for a (huge) large.  This is how much a sandwich should cost. \n\nAnd, they had every flavor (big and small sizes) of Kettle Chips and all flavors of Vitamin Water.\n\nIts by the Francisco middle school.  That should help you find it easily.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-26", "description": "Eddy is awesome...never makes me feel bad about my occasionally complex order. Plus, the green onion bread? Holy cow...best thing EVER! It made me soo happy.", "author": "Leslie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-18", "description": "As far as traditional West Coast style \"in and out\" deli's go, this place takes the cake. The quality of ingredients, the meat they use, the special spreads, multiple breads, its a no brainer. I am currently sitting next to a gorgeous large hot corned beef on hard sour roll with pepper and garlic spread, tomatoes, onions, pepper jack cheese, and love that only a latin mother could add (and yes this is a primarily latin run restaurant). They do hot and cold, ciabata bread, falafels, and yes they have beer and a host of other drinks.\n\nIf you are a sandwich connoisseur go get your favorite combo here and prepare to have your mouth made sweet love to, and your flavor buds stimulated intensely.", "author": "Zack D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-27", "description": "My friend - self proclaimed yelp master - took us here when we were up here for beer fest. Tired, starving & hung over we trekked over from the Sheraton anticipating yummy deli sandwiches. Fifteen minutes and several steep hills later, we were greeted by a giant closed sign.\n\nYup - they're closed on Sundays. thanks jonathong =P", "author": "Flora V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-10", "description": "I decided to check out Freddie's based on the strength and number of its Yelp reviews, but I was sorely disappointed. My first test for any sandwich shop is my favorite sandwich: roast beef and provolone on sourdough with everything except onions. Service was quick and friendly, most of the people there for lunch seemed to be regulars and familiar with the staff, prices were good and there's a good selection of chips and drinks. \n\nHowever, I really didn't like my sandwich. The lettuce was shredded too finely so its texture was more like that of sprouts, it and the tomato were very watery, making the mayo, mustard and my bread watery, and generally washing out the flavor that should have been there. The saddest thing was the state of the roast beef, which seemed more like something you'd buy processed and pre-packaged than fresh from a deli. It didn't have good flavor and the color didn't seem like a medium rare roast beef, but some kind of unnaturally uniform fake coloring.\n\nPerhaps I should go back and try one of the sandwiches some of the other reviewers recommend, but my first experience failed to inspire my confidence. I'll keep you posted.", "author": "Kristina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-30", "description": "Anyone on the search for a solid sandwich on fresh, fresh bread - you have found it.\r\n\r\nCouple of things to know - the line at lunch gets long (they are fast but they are also very popular) and you can fax in your order ahead of time, saving yourself the previously mentioned line.  My office often gets these huge \"Freddie's Runs\" going where we fax in a numbered list.  I think we've had one sandwich mix up the entire time.\r\n\r\nAlso, for the Freddie's virgins - if the bread you order is one of the rolls or the dutch crunch bread it leads to BIG sandwiches.  Share with a friend.", "author": "Suzanne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-22", "description": "A tasty little sandwich shop, located off Powell and Francisco. Typically priced sandwiches, but tasty and you're guaranteed to have leftovers for later. \n\nDuring the weekdays, this place can be packed with students, as right across the street from the sandwich shop is a local middle school. Their selection of breads are awesome: I love their Dutch bread! Crunchy! Their french bread rolls are pretty good, too. I think my favorite was the Italian combo, which came with Italian sausage and other meats. \n\nThe prices aren't that bad. You typically will walk out spending about $5-$7. If you're lucky, that price will include a bottled beverage. \n\nIf you're in the area, try out Freddie's. Good sandwich yum!", "author": "Melinda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-08", "description": "I've grown up eating to-go sandwiches from Freddie's as my parents started coming here when they were young.  It's a neighborhood sandwich landmark.  My usual order: Small/ Large Italian combo w/ mayo & mustard on the soft sourdough roll.  Parking can be tough, but you may luck out and snag a spot in their green zone.", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-26", "description": "I don't remember the sandwiches being this bad.  I've been coming here since I was a kid and I realize that the ownership has passed through at least two owners.\n\nThere used to be limited choices; italian combo on soft sourdough.  I haven't had anything off of the new menu, but the attempt at the old italian combo misses its mark; the soft sourdough seemed like they forgot to bake the bread and the deli meat was tasteless.\n\nI guess you should go, if you don't have any prior experience with this as a North Beach institution.", "author": "Collin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-02", "description": "Good sandwiches at a decent price - with a very good selection of candies, chips and beverages.\n\nCold cuts really aren't my thing, so I probably rank sandwich shops lower than say, Joey Tribiani.\n\nI really like how they use a jalapeño spread - gives me a consistent flavor throughout.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-09", "description": "I agree with most of what has been said about Freddie's below.\nThey are fast, the portions are big, the price is good. But this is San Francisco, not Topeka. We expect more from our sandwiches than speed and portion size.\nThe ingredient quality is pretty average. Plain processed cheeses, very simple meats, boring bread-- by no means anything special. \nSo if I were in the neighborhood and I was starving, it's totally passable, but certainly nothing to go out of the way for.", "author": "Eli A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-14", "description": "It's just so damn good.  And they do it over and again every single day.\n\nThe Italian combo on soft sourdough with garlic spread.  Wash it down with a little vitamin water.  How on earth would anyone pay through the teeth at the nearby Safeway deli for a rotten sandwich when Freddie's is so close and so good!\n\nIt is the favored lunch place for my coworkers.  We usually call our orders in and come in to pick up.  It saves having to wait in line during rush.  They would get five stars but one of the chicks behind the counter had an issue with my weight one day.  Welcome to San Francisco where a good deal of the population understand more than one language, biatch!\n\nBesides, it is your sandwiches that made me fat.  All your fault, I should get a discount.", "author": "Cheezy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-15", "description": "Over the past two years, I have tried valiantly to like this place.  It is literally right around the corner from where I live, and it seems like it could be such a charming neighborhood sandwich shop. \n\nDisappointment.  The sandwiches are not terrible--think Safeway deli quality.  However, Freddie's consistently sour and unfriendly demeanor (aside from a select few who are evidently in his good graces) killed what little desire I still had to pay $8 for a mediocre deli sandwich. \n\nSo much for the convenient location.  I'd much rather wander up the hill to Palermo, Giordano Brothers or Petite Deli for exceptional sandwiches (at reasonable prices) and warm, friendly service.", "author": "Katy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-18", "description": "Thank goodness for Yelp! Every time my boyfriend and I would go to the city for lunch, he would mention this particular sandwich shop he and is friend Ryan had run into once years ago. He mentioned how good it was and how they have various spreads. The only problem was that since it was years ago, he could not remember the name or the area that the sandwich shop was in. Lucky for him, I Yelp more than he does and was determined to find the place he kept raving about. I love me a good sandwich! I typed in \"sandwich with spreads\" and WALA, showed him a pic to see if it was the place he talked about and we went for lunch yesterday. :)\n\nLemme tell ya, this place was absolutely AMAZING. The sandwiches here are definitely out of this world! I got a small peppered turkey on sourdough sliced, no mayo, everything else on it, pepper jack cheese and jalapeño spread. SO DELICIOUS...I savored every bite and didn't leave a single crumb! \n\nYou can't eat inside, but no biggie. There are benches outside and chairs w/some small tables. I went around 1pm yesterday and this place was still poppin'. The staff here are friendly too. Even though this place gets busy, they don't take long to make a sandwich. They also have a good selection of drinks and chips. I will definitely be coming here to get my sandwich fix when I'm in the city!", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-21", "description": "If I am ever to move away from San Francisco, Freddie's is hands down the one thing I will miss most.\n\nThank goodness I only live 2 blocks away and go there every Saturday.\n\nIf you don't get the (hard) sourdough roll you don't know what you're missing!  I give people the glare (yes that was me) when they order sliced wheat or something... blech!  as if!\n\nI love you more than life itself Freddies!!!", "author": "Derek B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-30", "description": "After twenty minutes inside, my boy and I sat on a bench outside and ate some of the most delicious sandwiches.  He even compared it to his beloved Marina Submarine--a major compliment, coming from him.\n\nI love the soft sourdough.  Yum!\n\nI work on Francisco Street now, so this could get dangerous!", "author": "Melissa Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-08", "description": "I had almost forgotten about this spot.  I used to come for these great sandwiches here about a year ago but it wasn't until a recent work visit to the area brought me back to these fantastic subs. I can't tell you how good these are...\n\nTips?\n\nWhatever you do... get it grilled... or pressed... or whatever they do to make it all hot and delicious.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-09", "description": "Hands down one of the best Sandwich places in the city! Fresh ingredients and their soft sourdough works well with almost any sandwich. The italian combo packed with meaty goodness topped with jalapeno  sauce is one of my fav's, along with a hot roast beef sandwich with swiss cheese, pasto-mayo are delicious! \nToo bad they stopped selling", "author": "Ruth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-19", "description": "I don't know what I love more:\nThe fact that I only have to take my fat ass up one block to get there OR\nThe fact that they make such awesome fresh sandwiches,,,,\nok, ok, its the great sandwiches. I am obsessed with their dutch crunch...so yummy. The best part about this place is you can call ahead and cut all the dumb asses who didn't know any better...okay so I'm a mean person, and I like to be served first- sue me! ANyway, the one draw back- be prepared to pay a little more for your sandwich...I'm only mildly exaggerating when I say its like $9 for a sandwich and a drink. WORTH EVERY PENNY I SAY!!\n\nPS They lost a point because EVERY time I go there they mess up my boyfriends sandwich...I guess they just don't luv him as much as they luv me...", "author": "Jess W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "FYI...I am eating an Italian combo from Freddie's as I am writing this review, so this review could sway with each bite. We moved to North Beach 6 months ago and have always walked past this little corner spot on our afternoon walks. Today we took the plunge and got the Italian combo on a sweet dutch roll. The small was 5.95 and it is enough to feed me and my girlfriend. The sweet dutch bread is... well, sweet and has a nice texture to it. They are extremely generous with their meat, and I will surely take a nap after eating just half of the sandwich. The guy that took our order was very friendly, and looks like he could be the head of an \"Italian Family\", if you know what I mean. Yep, my Italian stereotyping will probably get me shot one of these days, but if I do go I wouldn't mind making Freddie's Italian combo sandwich my last meal.", "author": "Incognito S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-07", "description": "I went to Freddie's Sandwiches due to reading their Yelp page. It seemed that they were destined to be a great place but unfortunately, i may have had my hopes too high. I ordered the club, and the bread wasn't fresh and was really tough to eat. I'm sure that when their bread is fresh they are a great place, but in doesn't compare anywhere near California Sourdough in the South Bay. That place remains my spot for a go-to sandwich in the bay.", "author": "Carlos G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "This is a pretty nice sandwich shop. It is right next to my current school (please don't stalk me) and all the kids go here right after school and before. The guy gives all students a discount for 3 dollars a sandwich, which is a very good deal. They have a huge drink selection that doesn't seem to overpriced. The sandwiches do have pretty good quality, but remember to get like a bag of chips or something along with the sandwich because sometimes it takes up to 15 minutes just to get the order done.", "author": "Jeffy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-19", "description": "I dream about this place. Seriously.  The hard sourdough rolls?  Yeah, they are full of noble glory.  The fresh turkey or salame?  Are you kidding?  Pure golden tastiness.  I can't even finish this review because I have to go run up the Francisco Street stairs and grab a friggin' sandwich already.  I don't run up stairs, unless there is a Freddie's sandwich at the top of them.\n\nP.S.  Scroll down to Zach O.'s review.  Trust this guy, he's the biggest sandwich enthusiast you will ever meet.  Seriously, he writes blog posts about them.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-11", "description": "Price gouging at the corner of Stockton and Francisco.\n\nFor anyone with money to waste, I highly recommend you order a large BLT on sliced sourdough. For the paltry sum of $8, you too can proudly own a sandwich that you can read a newspaper through.\n\nI kid you not folks, this sandwich was, in the aggregate, no larger in length, width or height than your standard PB&J and had MAYBE 3 pieces of bacon on it... for $8 #%@ing dollars. There is absolutely nothing special about this sandwich shop. Do yourself a favor and take the short walk to Palermo's or Giordano Brothers.\n\nWhat a joke.", "author": "Colin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-23", "description": "I enjoyed my Italian Combo.  The large was $6 out the door and really big.  Probably a small is big enough for most.  Nice help and good selections of meats.  Sourdough roll was very good, but a little hard.  Probably would go soft roll next time.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-20", "description": "As far as sandwiches go, I must say it's not even worth trying.  Come on, pile on the meat instead of piling on the tomatoes & lettuce which made my sandwich super soggy!  I drove clear across town for this sandwich & was totally disappointed.  I will not be back!!!", "author": "G W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "The worst thing about freddie's is it is closed the sundays. It always seems like I am driving by and hungry when it is closed. Yeah, so the customer service isn't the best, but the quality sub makes up for it. The are the best when toasted...also w/ oil & vinegar, pepperoncinis and garlic spread.", "author": "pablo e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-05", "description": "If only they were also open on Sunday! Best sandwiches I've found around the Bay/Stockton streets of North Beach.", "author": "Colin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-26", "description": "Saturday is my favorite day of the week because, among other reasons, I get to go to Freddie's.  I should take off a star because they are closed on Sundays, but who cares this little shop is so bomb it has become my favorite sandwich place in the city.  \n\nThe soft roll is superb, the dutch crunch is delicious, and the hard sourdough makes a damn tasty lunch.   I have had cold sandwiches, hot sandwiches, big ones, and small ones, they all fail to disappoint.  Currently though, I cannot get enough of the combo, on the soft roll.  I don't even need to get a large because the small size is the perfect meal.\n\nOh, and to the reviewer below....Eddie (the current owner of the store)  doesn't like everybody.  You have to grow on him, kinda like the Soup Nazi, but that is what makes this place so unique.  A true Mom and Pop joint where the quality of the sandwiches comes first.", "author": "Korey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-23", "description": "Cheap and delicious.  This place is a North Beach institution.\n\nMy favorite - italian combo on dutch crunch with jalapeno spread (hold the mayo).  The small size is about $6 and feeds me for 2 meals.", "author": "Alyssa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-27", "description": "Order the Italian on toasted soft sour dough. Great portions and good  people.Many types of bread to choose from. Everything is pretty basic. They don't heat up sandwiches and the salads are decent. But they know how to do what they do. They make a great sandwich for about 8 bucks. Nice job Freddies!", "author": "Edward N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-30", "description": "This place is the bomb for a reasonably priced sandwich.\nWhatever you get, get it on Dutch Crunch, delish!", "author": "Shawn P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-21", "description": "Fcuk balls! I lived in this neighborhood for a decent amount of my life and I just found out about this place. I have been seriously missing out. Apparently they have been there for decades and have perfected their craft in sandwich making.", "author": "Jerry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-11", "description": "I had a day trip up to SF for work and made a bee-line for Freddies for lunch...  Best sandwiches when I lived in SF and I must say they did not disappoint when I had the priviledge to go yesterday. \n\n Sandwiches were just as I remembered...\n\nWhy is it that you can not get hard sourdough rolls at ANY sandwich shop in LA???  I just don't get it.\n\nVeggie sandwich is the best - WITH jalapenos...yum...", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-11", "description": "YUM\n\nAnyone who is from the east coast or is an east coaster at heart will love these sandwiches. I have no way to describe why they are so good or why they seem so east coast to me, but they just are. Something about the way they perfectly layer ingredients maybe? Either way, this is a damn good sandwich.\n\nA little hard to get to for a person with no car - this definitely is not on my way to anything either. Going to have to make special trips for this one.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-24", "description": "Great neighborhood sandwich spot.  I'm addicted to their Italian combo on an onion roll.  They've got a huge selection of different breads, ranging from soft and chewy to break your teeth hard (I guess some people are into that).  I rock the softer breads as I hate when I get a hard roll and take one bite only to have all of the filling slide out of the sanwich.  Do you know what I'm talking about, or am I the only weirdo that this happens to?  Anybody?  Bueller?\n\nAnyway, great sandwiches for a reasonable price.  I don't know what the people bitching about $8 sandwiches are ordering.  My order usually is around $5.  Granted, I get the small, but that's plenty to fill me up.....and I've got a pretty good size appetite.  Next time you're in the 'hood and looking for a good sandwich, look no further than Freddie's.", "author": "Norm U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-02", "description": "I like Freddie's sandwiches the way Freddy intended:\n\ndeli meat, provolone, mayo, mustard on a soft roll. period. \n\nOld San Franciscans eat it this way, and I don't see how decades of eating it this way could be anything but perfect.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-25", "description": "Never really had anything but the Italian Sub. and I have to say, after having that, no other place compares. Best sandwich I've had and when I'm in the city I almost go here and get one. Good portions, pretty pricey sometimes but they give you what you're paying for. People are nice when I go in. Only thing that sucks is if you don't have someone to go run in for you, parking can be problematic.", "author": "Michael Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-01", "description": "Let's see... a sandwich is a sandwich... unless of course it's a Freddie's sandwich.\n\nThis place is sooo good. I always have the same order: small italian combo on sweet dutch bread with jalapeo spread. Its worth every penny of the 5 bucks I pay . \n\nThe drink options are impressive as well. They sell all types of sodas, juices, milk, beer etc. \n\nThey have some lawn furniture outside for your convenience.", "author": "Lucy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-17", "description": "Hmmmm... closed on Sundays..... So yeah I get it, you want to have a day each weekend to close up your business to relax, but for the love of god, WHY can't you just move your weekend to Monday and Tuesday (and take two days off?) instead of trying to be like everyone else and having a weekend on Saturday and Sunday?  Some of us have a real job Freddie and can't make it to the corner of Francisco and Stockton during the week for lunch, so you only give me one day, ONE DAY, to have your sandwiches each week.  This means I have to plan my ENTIRE Saturday around you... well at least the part where I wake up, call in my order, walk a block and a half to pick it up, and come back home and eat it....  and I don't appreciate that.\n\nWhat I DO appreciate though is your Club sandwich on soft sourdough (get the bread toasted people) with your deeeeeeeeeeeelicious garlic spread.  And you gotta love the bo-de-ga type setup in there with possibly San Francisco's largest selection of chips and drinks per sq. ft...  \n\n(fyi, don't get a large, it's freaking LARGE, stick with the small and you'll be full for a few hours.)", "author": "Niall H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-12", "description": "Another good hit on the saturday sandwich hunt. Great for italian meats and a really substantial sandwich. Not only did I save half my sandwich for later, but so did my extra large never quite full dining companion. \n\nI had a simple salami sandwich.  It was quite tasty. I had a few bites of an italian combo. I'd go back. I'll write more when I do.", "author": "Margie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-11", "description": "Ever since I moved to the neighborhood, I try to make it to Freddie's every Saturday. That's the only day I'm around when they're open. But it's worth it devote my Saturday lunch to this place. The prices are decent. My favorite so far is the italian. The meats and veggies are cut on site, and apparently the tuna and chicken salads are homemade and good. But this isn't what makes the sandwich. It's the bread. And anything on the dutch crunch is perfect. \n\nHow famous is this place around where I live? I was walking back with a sandwich in the ubiquitious brown paper bag. I stopped at a light and a guy and a dog walked up to corner. The dog starts sniffing at the bag. The guy says sorry and pulls the dog back a little. I tell him it's ok, the dog just wants some of my sandwich. The guy looks at the bag and says, \"Is that a Freddie's sandwich?\" I tell him it is. He tells me he's been thinking about getting one all day and how he was just on his way home to drop off the dog and then run over to Freddie's.", "author": "The Sock S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-10", "description": "The highlights: decent sandwiches and the wait time isn't atrocious.\n\nThe cons: I don't find the owner, or the man behind the counter, very friendly. He's gone so far as to nearly \"throw\" money at me. I've gone back many times as this place is close to my place of employment but his attitude has not improved at all. I even regret tipping *every* time I go. I don't think I'll go back...\n\nI give the sandwich a 3/5 and the attitude 1/5.", "author": "DeLune Avec DeBussy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-19", "description": "I was first turned onto Freddies when I worked over the stairs on Telegraph Hill. It was here that I learned of the 'dutch crunch' roll, and the first thing I had them make me was a variation on a sandwich I used to get at the Hello Deli in NY: roast beef, jack cheese, cole slaw, brown mustard. \n\nWhile it wasn't the same as Rupert's, it was still the best sandwich in the area and it has me going back!", "author": "Joe R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-12", "description": "The guy at the counter had a little attitude problem. But whateves. I didn't like the sandwich- I got the italian combo. I think it's just not the copocolla from City Subs in Brooklyn (see my reviews) that I love so much. My mom said it was the best sandwich she had ever had and finished off my half. She was in a food induced coma/high and had some trouble biking down from Coit tower where we ate it. If you want a cold sandwich this is probably a good spot.", "author": "Lindsey J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-28", "description": "Great sandwiches.  Take-out only place.  Not sure why the sandwiches are so good, must be the hard roll bread cuz it's just cold meat and yellow mustard.  Always a treat to get a sandwich here.", "author": "Larry G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-20", "description": "I love Freddie's!! I have been going here ever since I learned how to walk!  Well, you get the picture.  Italian combo on hard sourdough -- it never gets old. I used to get the soft sourdough when I was a kid, but then ever since I tried the hard sourdough, the sandwich took on a whole new yum factor.  It tasted like a completely different sandwich, meaning just more addicting!  Never went back to the soft.  Martinelli's apple juice is also good for washing down the saltiness of the meat (you got your sweet and salty), but don't get me wrong, salty is what makes the sandwich so good!", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-22", "description": "Yelp.  My buddy.  This is my neighborhood sandwich joint.  I feel like you are now infringing on my space.  Step off.\n\nFreddie's already can take a while.  But it is worth it.  That said, Freddies deserves the love it gets.  Damn good sandwiches, cheap.  The Italian Combo is amazing.  I love the hard roll, but it is hard and can tear up your mouth a bit (kinda like the second bowl of Capt'n Crunch), so if you aren't ready for that, get the soft sourdough roll.  Anyway, the egg salad and turkey are great too.  Meanwhile, the small is big enough for any person.  The large (6 bucks) is big enough for most couples to split.  \n\nThe one complaint and the only reason I am going to bump it down to 4 stars...it is not open on Sundays.  Since I work downtown, that means I only get my Freddie's fix on Saturdays...very sad.", "author": "Zac A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-24", "description": "Absolutely delicious Italian sandwiches...I crave these at least once a week. Get the Dutch crunch bread, which has a thin layer of sweet crispiness at the top, and the jalapeno spread, which has a tangy, spicy kick, and your sandwich will be anything but ordinary.\n\nI ate half of my sandwich the day we got them, and saved the other half for the plane ride home (refrigerated, of course). It was just as delicious -- if not better -- the next day.", "author": "Eeeeestar T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-30", "description": "Small hot pastrami on soft sourdough with all the fixins - add provolone and pepperoncini spread. That's a little slice of heaven. I'm fully bummed that I just quit my job near Freddie's cause it's not likely that I'll end up back in this area for awhile. \nDude - how are people rating this lower than 4 stars. Based on personality of the dude behind the counter?? Try talking to the dude. He likes you and I'm sorry that you're so sensitive.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-09", "description": "OK, i have been here 5 times in the last 4 months and have always been very please with their great sandwiches. The bread is from Boudins of San Francisco just like the old Parisian Sourdoughs!! The large size is big enough to split with someone else, on second though, save it for later as you will eat it anyway!! I have the salami with american cheese (my all time favorite) with all the trimmings. I thinks this place been here for ever, as my oldest brother came here in the early 1960's after school across the street!! For the same sandwich in the 1960's , it cost a mere 25 cents, bag of of Granny Goose BBQ chips 15 cent.", "author": "Wolfy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "I've loved these sandwiches for decades,\nFor the value, freshness, bread.\nExpect no frills", "author": "delbert t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-10", "description": "I often wonder what good tastes like? Is it sweet, salty, uplifting, or fresh? Would a doctor or a priest know the difference if given the opportunity to define? \nI then have a Freddie's Sandwich and realize that it was stupid wander into such abstract corrals. Really good tastes like a loaded gun that has been fired at you. You just sit back and enjoy the caloric wanderlust blast into your stomach.\nFor your first time at this place, I recommend the pastrami, fully loaded, and on a very empty stomach. This sandwich alone will give keep you full for hours. If you decide to go large and eat it all in one serving, be warned! You will need to have a Siesta for ages.\n\nIt will be worth it.", "author": "Mario G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-03", "description": "Alright ...are you tiered of all those other sandwich shops,,,,,, Well have i got a place for you to try it's called FREDDIE'S and it in lower north beach , my family has been going there since 1926 and i still go there once a week . The place looks like it did back in the twenty's and the sandwiches haven't changed since i was a kid if you want a bomb ass sandwich my to favorite are the Italian combo on soft sourdough and the chicken salad on soft sourdough , no matter what you order its gonna be good. So the next time your in the mood for the best sandwich you have ever had just think Freddie's......................you wont be disappointed i promise. if you need to no were there at just Google them..........", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-21", "description": "How convenient, for sandwiches. \n\nLike anything custom made, the only complaint you can make, is why you didn't order more. You asked for it, and you got it. \n\nThis place gets busy as hell, and you come here JUST for the sandwiches. Fast paced, and a great Family run business. \n\nDon't expect anywhere to eat inside. It's mostly a buy & run kind of place. You can always take the bench outside though. That was my usual spot after class, at the Academy. Which is conveniently located, right down the street. Parking here is good too, if you get here early enough, or when faculty leave the school. \n\nEven on google Street view, you can see some guy, with a sandwich in his hand, and you KNOW it's from Freddie's!!!", "author": "Charles K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-05", "description": "I really don't go to Freddie's enough, considering I work nearby and the food options in this area is so limited.  I am not even a sandwich fan, but with Freddie's, I would always find myself craving it right around lunch time.  It's amazing how good a sandwich can get considering I can easily get the same ingredients from a super market.\n\nI usually get either Veggie on wheat with jalepeno spread or Chicken Salad on soft dough with pepper jack.  Both are fresh, clean, with a nice spicy kick.  Perfect for a nice sunny day, absolutely love it!  \n\nTheir sandwiches are HUGE, I usually get a small, and it would still give me 2 meals.  The lines can get long around lunchtime, but they take phone orders.  They also have an assortment of drinks and chips including vitamin water and Miss Vickie's.", "author": "Christina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-27", "description": "Great prices for the large portions, delicious, freshly made and the jalapeno spread is amazing!  Plus it's close to my work when there's not much else to choose from.  The wait is generally pretty long during the normal lunch hours, but well worth it. There's a large selection of drinks ranging from Red bull SHOTS to snapples, to cokes, and Kettle Chips, plus lots of candy choices. MmM chocolate. \n\nthe shop is tiny, with little seating outdoors, so you may want to take your lunch elsewhere to enjoy.", "author": "Lulu C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-06", "description": "I haven't had Freddie's Sandwiches in more than 13 years since I went to Francisco Middle School. My friend just told me about your second location it's just 3 blocks away I'm hoping to past by when I have time and have my favorite Turkey Sandwich on Dutch Crunch.. Talking about it makes me flashback from back in the days.", "author": "RICHARD W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "time to get down and dirty about this sandwich shop and big thank you to my 14 yrs old niece to suggest these yummies en route to her school (best time to come 7:45am NO LINE-UP, baby!!!). I will explain why they received a 4 star instead of 5 star, so hold your panties :P\n\nIf STUDENTS - 6\" (cut in half) is only $3 with limited selection. \n\nItalian combo (student) $3 served on a \"toasted SOFT sourdough\" (picture a huge long ass Artisan FRENCH BREAD then cut into pieces) - you get 1 layer (4 slices) of Salami and 4 layers of Ham with lettuce, tomato, Cheddar & JALAPENO spread.....YUM even though I'm not a huge fan of PLAIN ham :) Can't complain when is only $3 -  TWO 3\" WARM bundles of joy on the palm of your hands waiting to ingest :)\n\nHam & Turkey again $3 - same type of bread as the above with mustard, mayo, lettuce, tomatoes, pickles & onions.  Didn't care for it as much since the first bite there was a HUGE turkey gamy smell. Tip: reheat in the toaster oven and the smell of the turkey will dissipate to make it more edible :)\n\nNow here's my regular ADULT price sandwich $6.95 - Mortadella & Hot Coppa served on the same bread as above - 4 layers of Mortadella, 4 layers of Hot Coppa (they FORGOT to remove the NON-EDIBLE CASING on every slice, so how can you possibly expect me to give them 5 stars!!!) lettuce, tomatoes, pickles, onions, jalapeno spread with MOZZARELLA Cheese (highly recommend) - MY CREATION was YUM YUM YUM YUM YUM after removing all the casing myself; definitely taste the hot spice from the Coppa & Jalapeno spread (not suitable for kids / peeps that cannot handle their spice :P) heheeeee....just sayin'", "author": "Katy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-27", "description": "Another lunchtime standard for me, as I work just a few blocks away. \n\nA co-worker kept coming back from lunch every day with these amazing, huge, fragrant sandwiches, and we kept trying to pry out of him just where it was he was going every day. \n\nFinally we figured out his secret:  Freddie's.\n\nThis is real old-school neighborhood deli, where the meat and cheese are laid on thick and half a sandwich is a full meal -- very unlike the big-chain sandwich shops, where you get two or three paper-thin slices of meat and an inch-thick wad of lettuce.\n\nOh, and time your arrival carefully.  There's often a line out the door by 12:30 -- but I understand it's possible to phone ahead.", "author": "star s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-08", "description": "When i hear Freddie's sandwiches, i can't help but just smile.\nI've only had the italian combo - and that alone keeps me coming back.  Not to mention the friendly service and consistency.  \nand at $5 for a small which is considered a large in most sandwich places - DEAL!!!  \n\nTHANK YOU FREDDIE'S!!!!", "author": "M E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-03", "description": "A damn good sandwich. Know what you want before you step up though. The dude at the register comes across as a sandwich nazi. I forgot about Dutch crunch bread...why don't they have that in LA anywhere?", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "HUGE hearty sandwiches that are to die for. I'm a sandwich fiend and they really don't get much better than this.  I'm a sucker for a good pastrami sandwich and they knock it out of the park here so to be honest I haven't even tried anything else.  I love the hard sourdough and wide variety of chips and sodas he sells out of his little tienda... BBQ Pop Chips, an RC Cola and a Pastrami Sandwich add up to amazingness.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-03", "description": "Really miss this sandwich shop. I was lucky enough to work by it for 4 years. Reasonably priced, tasty place. The small sized sandwiches were filing. I liked the Italina combo and the chicken salad. Dutch crunch and soft sour were good as were all the breads.\n\nI would make a special trip to go here for lunch - Mama's girl for breakfast and then Freddie's for lunch.", "author": "joe m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-16", "description": "The sandwiches are a carlorific mouthful of love that keeps people like Jenny Craig in business.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-08", "description": "So good!  A large was enough for lunch and dinner!  Had the Italian Combo on Dutch Crunch.  Great drink selection, too!", "author": "Sheri W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-15", "description": "Always a great Northbeach visit after a BLT from Freddies!", "author": "Gordon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "Over the course of a 10 week internship, I think my partner (creative, not life) and I went to Freddie's close to 30 times. Is it really really good? No. But compared to its surroundings, it's incredible. Think I tried mostly everything without a problem, though the falafel's a bit underwhelming. It tends to get a bit crowded around lunch, but \"Freddy\" keeps his harem of workers running pretty smoothly. I'd go back if I was unfortunate enough to be in the area.", "author": "Aaron Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "A good, solid, no-silliness sandwich and a beverage joint. The folks behind the counter are a smart blend of friendly, brusque, and patient. \nThey let me hem and haw and ask questions, they smiled when I settled on an order at long last, they worked fast, and all was tasty. They have meaty and veggie options, including a darn noshable falafel.\n\nThey do have some deli salad stuff, but I was all about my nicely cut & wrapped sammie (sarnie for the Brits) and dry ginger ale.\n\nThanks, Freddie's! You do honorable work.", "author": "triple b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-08", "description": "I suppose this is an alright place if you just want a nothing special deli sandwich. I ordered a vegetarian on Dutch crunch. The sandwich was HUGE (I couldn't even eat half of it) and very reasonably priced. The bread was a little stale and the veggies were run of the mill (lettuce, tomato, onion, avocado, cheese, and pickles). I had to throw out the potato salad after one bite due to too much mayonnaise (which I despise, but I was so hungry when I put my order in, so I decided to gamble). \n\nThis place isn't for me, but I can understand why my office mates are drawn to it, considering the limited selection of lunch places in the neighborhood.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-31", "description": "What can I say about Freddies? Best sandwiches hands down! .... Been coming here since I used to go to middle school right across the street! I still drive here just to reminisce about the old days. I love all their sandwiches and the people there are super nice and friendly. Great drinks selection, great fresh cuts of all kinds of meat. I will be coming to Freddies forever.", "author": "Frankie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-13", "description": "My coworker dragged me around for almost 20 minutes to find this place. When we finally found out, I thought to myself what's so big about this place? While waiting my friend pointed out on the glass wall all the Yelps and awards this place received only to be disappointed in this place! I ordered a basic Club sandwich with avocado and I was totally ignored on my order. After 6 other customers received their orders the lady (possible owner) said it would be a few more minutes..hell I gave her 20 min and still nothing...to say the least I asked for a refund and while getting it the cashier than stated, \"They're making your sandwich now.\" I said No thank and not my problem... oh well ....", "author": "Marco R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-17", "description": "This place is ok...but seriously???4 1/2 stars?  Y'all are trippin'  I have worked in this neighborhood for a few years and got many a sandwich here...don't get me wrong, they are totally editable....but for real.  Walk a few more blocks to cafe Capriccio - that is a freaking sandwich!  Only a few blocks and knocks the socks of Freddies - or go over to the park and get a sandwich at La Spiaggia - pay the extra 1-2 dollars and have a real culinary delight...Freddies is passable - but why bother when you can have near sandwich perfection at these other places?", "author": "Laurel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "Loved it. Great Turkey sandwich on ciabatta roll.", "author": "chico t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-20", "description": "AWESOME!!!!!!!!!!!!!!!\nSandwiches taste soo good.\n*Honey Roasted Turkey on soft sourdough\n*Hot Pastrami on Rye\n*Chicken Salad on Dutch\n*Tuna salad is BOMB:)\n\nThey have an enormous variety of drinks, like lots and lots!  even beer!\nPrices are very reasonable, great little gem in the heart of North Beach\nIf you dont eat here...you havent lived", "author": "littleone J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-13", "description": "Freddie's Sandwiches' are fantastic. The small is enough for one person and you can split large two ways.  I recommend  Italian combo, oh yeah, and stay away from those individually wrapped cookies on the counter.... totally not worth the calories.  They can get packed at lunch time, so plan ahead.", "author": "dan d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "There's an apparent reason this joint is always packed to the brim; where during lunch hours, you can see lines exceeding the front entrance, sometimes rounding the corner! Granted, the wait can be a pain the ass sometimes, but it's definitely worth it for a sandwich from Freddie's. Simply put, this deli is, by far, the best sandwich shop in the the city (this coming from a guy who absolutely loves his sammies and has been to most, if not all, of the delis spread throughout San Francisco). My usual order, as I'm sure is the case for most frequenters, is the Italian Combo; their signature sammie. They're incredibly generous with the meat cuts, and the breads used are very fresh and extremely flavorful. The jalapeño spread, in my humble opinion, is a must; adding that extra little dimension of flavor which causes an orgasmic explosion of taste within your mouth as you bite into it; fucking mind-blowing. Freddie's sandwiches make life seem absolutely trouble-free during those fifteen heavenly minutes in which you and your sandwich get completely lost in your own little euphoric world.", "author": "Bryan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-12", "description": "I just had THE best sandwhich ever. My friend brought me out here today from the FiDi and I was pleasantly surprised. The bread was really fresh as was everything else. As we were sitting on the bench right outside, I couldn't stop gushing about how good my sandwich was! I love how it still has the old school charm. I thought the people working there were great too. I will definitely be back.", "author": "Deana D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-14", "description": "This is my pick for the north beach.  My dad grew up in this neighborhood and would always take me here when I was a kid and they have been producing great sandwiches forever.  My dad remembers ordering his sandwich at the counter and only having to pay 15 cents for his sandwich.   Unfortunately the prices are not the same as thirty years ago but the sandwiches are still great.   \n\nI usually order the italian combo on a soft roll.   this is a perfect sandwich to bring to a Giants day game.  The only issue is parking, but they do have a 15 minute parking spot in the front that you might get lucky with.   Or you can also easily call in your order and just run in and get your sandwich.", "author": "Bryan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-03", "description": "Freddie's Deli is a sandwich I cross the city for.  Solid proportion of meat to toppings to bread.  Plenty of choices for size, bread, meat, toppings and special spreads.  Try the turkey with both the garlic and jalapeno spread.  I've been bringing that sandwich to Giants games for years and loving it.  Just remember to hold the tomatoes if you won't be eating it right away.  Nothing earth shattering, but if you are looking for one heck of a solid sandwich to fit your appetite (large or small), Freddie's is tough to beat.", "author": "Kalen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-30", "description": "This is the place to go to grab a huge, tasty, and reasonably priced sandwich. I get the Italian? I think it's that. I get it with only the deli meats, no lettuce, tomato, pickles and with the mayo spread on the cheese side. Personal preference but it taste better that way. You could get a large one and share it with someone. It'll be enough, trust me.  It can get extremely crowded, especially during lunch hours but they try their best to get you in out and happy with your sammy.", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-21", "description": "Solid Sando and good place.  Really enjoy their dutch crunch bread.  I will be back to Freddies.", "author": "Harry E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-20", "description": "Based on the glowing Yelp recommendations, I've been meaning to stop by and try out Freddie's for a long time. Finally, this morning I found myself in the neighborhood and it was almost lunch (err sandwich time). As you'd imagine, there was a long line around lunch time for this popular place. I had  a ham and salame sandwich on hard sourdough roll (gotta try the soft roll next time). The sandwich was expertly made -- its easily the best in this part of town (North Beach/Warf area).", "author": "Neil K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-25", "description": "We were hungry after our Alcratraz tour so I used the yelp app on my iphone, and up pops Freddie's.  We headed over and had some great sandwiches (yummy egg salad!).  There's a huge selection of drinks and chips too.  What pushed this place over to a 5 star experience was the steady stream of kids from the neighborhood coming in to buy snacks after school.  And when one little kid was a little short, the friendly guy behind the counter (Freddie?) let her get her snack anyway.  Reminds me of the old soda fountain I used to go to as a kid.  Minus the soda fountain, of course.", "author": "kate m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-20", "description": "ahhh... Freddie's sandwiches brings me back to the good old middle school days. I remember we had student discounts because Francisco middle school was just right across from this tiny sandwich shop so I believe any half sandwich we got only cost us $2.50. If you ever want to try this place I would highly recommend turkey on dutch bread. Omg so good! But go before noon because they run out of dutch bread really quick. They close at 4pm so grab yours while you can!", "author": "Tracy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-15", "description": "Definitely not the greatest sandwich in the city. I probably wouldn't even go there if I was on that side of the city because I'd end up going to an Italian deli.  But if you are in the area a lot, head to this place. It gets crowded. The garlic spread was a bit much, but maybe that's your thing. Get a large and save a half.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-18", "description": "We recently bought a condo across the street from Freddie's, and I'd be lying if I said the fact that it was across the street from Freddie's was not a factor in our decision.  Freddie's has great sandwiches and great service.  The Italian combo on a soft roll is deelish.  But get there early, the soft rolls always tend to sell out!", "author": "Erica G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-31", "description": "this place has more of a nostalgic value to me, aside from having tasty tasty sandwiches! my dad used to take me there when i was a young lad. we'd get a few sandwiches and then we'd go to his softball game. i'd sit there and watch him play, with my coke and delicious freddie's sandwich in hand. \n\nmmm... i love sandwiches. especially, salami sandwiches. freddie's also makes their own special soft rolls. my dad loves the macaroni salad there. \n\ni think on a saturday afternoon, we can spend about $50 on sandwiches alone. did i say how much i love sandwiches? the poorboy there are pretty spiffy as well.\n\nit's like a family tradition that my father has passed on to me. he's been going there since he was a kid, then took me there when i was young, so i guess it's only right that i take my son there someday to enjoy what i would define as a little slice of heaven... freddie's sandwiches.\n\nnow there is only one thing left, to find a wife.", "author": "Nathan J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-04", "description": "I've been going to Freddie's since I was in my mother's womb.  My Mom grew up in North Beach and she started going there when it was Ralph's in the 1930s.  Over the years we have loved the sandwiches and my nieces and nephews also grew up on these sandwiches.   We're old school & stick to the Italian Combo on the original bread", "author": "P S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-12", "description": "my *first* time at freddy's. and it was good. i liked that i was able to see what it looked like and the menu before i stepped in. some of the pressure was off during a rush lunch hour. line to the left- ordering, line to the right- waiting. step up, order. italian. small. dutch. everything on it. done. easy, the ladies behind the line, they were kicking butt. awesome job. probably 15 minutes for my sandwich, an overly large amount of candy and chips to choose from. i did wish he had a basket of fruit, but the sandwich was satisfying.  *cash only*", "author": "Abigail W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-06", "description": "Been going here since I was a 6th grader at Francisco! I use to stuff my fat ass throught he hole in the fence on Francisco... get my Italian combo and soda.. then stuff my fat ass back through to get back in. Oh the good times. The bread is fresh and the meat is great! Love this place. It might be time to take an afternoon break  and get to my fav lunch spot. Yummers", "author": "Bobby T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "Ordered their Club with provolone and Jalapeno spread on Dutch Crunch!  My stomach is smiling with enjoyment right now.  The service is friendly and you can get your sandwich in a decent amount of time depending on the line.  If there are five people ahead of you, expect a twenty minute wait.  If you're doing some mild liquor store shopping, you can also find what you need here.  There are a few tables outside, but not a lot of choices to sit if you decide to \"dine-in.\"  Parking can be tough to come by.  Overall, great sandwich, I will definitely come back here again.", "author": "R B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-17", "description": "so another intern story.. i'm such an idiot.  my mentor told me that this sandwich place was great and told me it was just one block down from our office.  i couldn't for the life of me find it.. maybe i was distracted by the middle schoolers at recess near by. anywho, i headed to the bk lounge..\n\nso i asked him the following day where it was and he was in an uproar! \"it's right there, you can't miss it!!!\"  (prolly thinking, 'what a useless intern!')  i quickly hid my tail between my legs and hightailed it outta there.. haha..\n\nanywho, i did find it across the street from the middle school. DUH.  the place had no seating except for this quaint little bench overlooking the little kiddies.. GOSH im starting to sound like a pedophile!  i'm not.. i'm just a 21-year old girl reminscing the fun times with my 8th grade homegirls. sigh..\n\ni got a small hot pastrami on sweet dutch for $5.50 and a small 1/2 pint of potato salad for $2.20.  Oh and I grabbed an Orangina for $1.75.  Oran-gy-na rhymes with ja-nigh-na (my nameizzle)! \n\nthe sandwich was very very good.  i got super excited because i thought they put alfalfa sprouts in my sandwich (i recently discovered it's Yum in sandwiches) but sadly it was just shredded iceberg lettuce.  the heated meat portions were just right and the bread was toasted to perfection!  the sandwich was not small at all!  i think its a mind-trick tho.  they slice in it half and wrap it individually to make it look bigger!\n\nI couldn't care much about the potato salad.  it was too mustardy and didn't have the right zing to it.  prolly from a mix or something.  why didn't i just grab the kettle chips? WHY!?!?\n\nSince its near the proximity of my internship, i will perhaps come here one last time.  unless of course i get tossed on my ass at my work, kicked to the curb.. maybe i'm just self-deprecating right now.. you think?", "author": "Janina U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-22", "description": "Great old-school sandwich joint. One of the better lunch options in the godforsaken area near where I work. I really liked the onion bread the one time I ordered it, and Freddie's offers lots of bread types in general. Props for offering real, fresh, non-preserved meat (although you can get that, too). And for taking orders over the phone for pickup. I may have to schlep here from blocks away, but at least I don't have to wait too long once I've arrived.", "author": "Tara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-14", "description": "Freddie's is fantastic. They have delicious breads, especially the soft sourdough, meat, especially the black forest ham, and fixins. The jalapeno spread is great on a tuna sandwich. The \"small\" sandwich is 6'' and loaded. It's the best deal in the neighborhood and tourist-free. They are fast, helpful and you can call in your order ahead of time.", "author": "Jessi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-03", "description": "The turkey melts in your mouth...just like mm's. Very good sandwich shop. You know it's a go when the sign outside says it's been in business since the 1920s", "author": "Sammy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-21", "description": "One of my fav spots for a sando... not easy to find a good deli in SF.\nThis place is awesome. Gets a bit busy during lunch hour but if you call it in you can bypass the line...", "author": "Doug A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-05", "description": "Very good, and reasonably priced.  (Whereas the prices at my corner market keep creeping up every year, Freddie's seems like it remains constant.)  I used to go here at least 3 times a week when I worked in the 55 Francisco bldg (across from Houston's.)  Now I make the trek across town quarterly.  At first I thought it was because it was a decent sandwich that fit with my low-paid, non-dot com PR salary.  Then I realised it's because it's a damn fine sandwich.  And they have this pepperoncini spread (just minced peppers)... so you get some in every bite.  The Italian combo is great as is the chicken salad.  Huge selection of drinks and chips, too.", "author": "darla s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-13", "description": "I remember I was in 4th grade eating outside on the bench during lunchtime when I looked at the kid sitting next to me opening up the white parchment paper i was so familiar with and unwrapped his sandwich. To my surprise and excitement I said, \"Hey! That's a Freddie's sandwich! How do you know about that place?\" I was kinda bummed that he knew about our secret sandwich spot that my dad used to take my brother and i to all the time which would be a special treat since it wasn't close to home. My dad grew up eating from this place too and still loves it. i haven't been back as often as I'd like, but the sandwiches are still the same as they were 15 years ago...even 30 years ago (so i've heard. i'm not old enough to confirm that one!). Love the bread, love the meat, love Freddy's.", "author": "Jen Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-12", "description": "is this the fourth owner...i am not sure...i knew the one owner before this guy when the prices were right and a sandwich meant just fresh bread and sliced meats.\nnow an ok sandwich shop if you are in the neighborhood and needing a sandwich with chips and a snapple.", "author": "Cee G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "I've grown up with this place in my heart and it will remain there forever. The Italian combo sandwich is the only way to go and make sure you get it on dutch crunch bread. The meats, cheese, and condiments meld together perfectly into the quintessential deli prize. I am sad to report that I'm not in San Francisco more often to enjoy what Freddie's has to offer!", "author": "Christina N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-05", "description": "Freddie's was a Friday tradition at the old office location.  Although I have tried most of the sandwiches on the board, far and away my favorite is the chicken salad, everything, on dutch crunch, no cheese.  Simply amazing.  I think the way the owner is makes it unique.  Far better then the angry, yelling RJ's lady over by Levi's plaza.  The chips and sodas are over priced as should be expected, but the sandwich prices are reasonable.  You will get full off of the smalls, and getting a large will yield leftovers.  I am thinking about making the trek out there soon just because it has earned a place in my heart.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-21", "description": "Not a bad sandwich, but, bad attitude. Owner, try to smile. Try to cheer up. I'm not picking your pocket, I'm spending my hard-earned cash in your place. I might have actually considered going back and trying another small sandwich for $5.75, because the Italian Combo I ate wasn't too bad, except for the fact that Palermos isn't too far away and has better sandwiches ......  and attitude.", "author": "Rich M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-05", "description": "Finally went to Freddie's after working in the area for 4 months and hearing my co-workers rave about it.  I am a HUGE sandwich fan (if I could eat sandwiches for every meal, believe me, I would) so I was excited to try the place out.  I got the Italian combo on Dutch Crunch bread and unfortunately the bread was a little dry but the insides made it sooo worth it!\n\nGreat prices and friendly, fast service.", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-01", "description": "Congrats, Katelin H.   I'm on Yelp right now because Eddy *did* print out your review and put it in the window with the others.  That took courage, and confidence in his product.   \n\nAnd he can afford to be confident too!  The sandwiches here are delicious and  *large,* enough for two lunches, making them frugal, especially for North Beach/the Marina.   Service is quick given the fact that at lunch they seem to serve about a million people.   I can get in and get out and eat before my half hour lunch hour is spent.\n\nAnd guess what? Eddy always recognizes me and remembers my order, even though I only drop in once a week at most.  Maybe it has something to do with the fact that  I tip every time I come in and kinda stand out from the crowd a bit for that reason.  I'm also polite and respectful, like I am whenever I have to deal with folks in the restaurant industry, it's a tough job!   Finally, I make a point to come in just prior to the lunch rush, so I'm not demanding attention or special treatment when the place is jumpin, and that probably makes me stand out too.\n\nBut even if it weren't so, the sandwiches they provide are top caliber, and that's what I go for.  Consistently good sandwiches at a reasonable price, in a neighborhood that's tough to find good food on a working Joe's salary.  If I wanted someone to pretend to be my pal, I'd go to a bar.", "author": "steffan z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-25", "description": "Solid sandwich and a fair price.  No parking and nowhere to sit - so grab and go.  Coit Tower is not too far if you want to take in some bay views while enjoying lunch.", "author": "Moe J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-03", "description": "I love getting their mortadella sandwiches. Reminds me of being back in Italy. Just an FYI - call ahead otherwise the line goes out the door during lunch!!!", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-14", "description": "Wow! My new Friday lunch spot. Thanks Yelpers. The Italian Combo on soft sourdough is kickin! Good service and decent prices. Can't wait to try all their other sandwiches.", "author": "Leroid D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-12", "description": "Awesome sandwiches!  Closes early though so not much of a dinner option.  Come early or on weekends.", "author": "Rob K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-27", "description": "Filling sandwiches and good prices. Love their salami and like their Italian sandwiches. Make sure to ask for a spread too.", "author": "Lester L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-06", "description": "An outstanding sandwich shop for the past 25+ years I've been a customer.  I think it should almost be an institution in San Francisco, it's so good.  The freshness and simplicity of the sandwich are the key factors.   The soft sourdough bread hasn't been replicated elsewhere to my knowledge.  The perfectly cut meats are delectable.  The minimal construction of bread, mustard/mayo and meat lets one enjoy every facet of the sandwich.  The uncomplicated meal also lends itself well to saving as leftovers or re-heating.   What more can one ask for in a family-run eatery?", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-09", "description": "To save 20 minutes during the lunch hour, call in ahead and order your sandwich to pick up.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-30", "description": "Molinari's who? Seriously, $5 for a small sandwich (which is actually not small at all) is easily the best lunch deal in the area. The sweet dutch roll is perfect and doesn't cut the roof of you mouth like virtually every piece of stale bread at Molinari's. Sure they have good meat, but they need to walk over to Freddie's to see what a real sandwich is...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-17", "description": "I live around the corner from Freddie's and decided to try it today. The sandwiches are delicious and reasonably priced. I had the Prosciutto sandwich with everything on it. I rarely do that (put everything on it), but I had to see how good their sandwiches were. They are fast, friendly and I will be going there anytime I want a great sandwich!", "author": "K. F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-28", "description": "Great little sandwich place right in my old hood.  Everything here is very fresh.  My son loves their chicken salad sandwich.  I'm a ham sandwich kinda girl.  You can't go wrong here.", "author": "Stella C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-25", "description": "Freddie's is still a great place for sandwiches but it is not the GREAT place it was back in the 60's when the sandwiches were really enormous with meat pile so high that it was almost impossible to eat! Boy, do I ever miss those days...\n\nSandwiches are now about half as large and not quite as tasty as in those days but still very good. I don't frequent as often as I used to because it's gotten pricier than I like for what I get.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-06", "description": "Yes, five stars. I come here twice a week for lunch. Excellent fare, great service, ATM, salt and vinegar chips, Gatorade or Snapple or vitamin water, fresh deli cuts and cheese on an onion roll, and a nice view of the water as you walk down one block and come within earshot of the loudest sea-lions on pier 39. I love San Francisco.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-09", "description": "Ok, their sandwiches are pretty damn good.  I really can't say it's the best I've had because I usually like my sandwiches toasty and hot.  This place brings back memories.  Growing up in North Beach, I went to Francisco Middle School, which is literally right next to this place.  I remember coming here for a sandwich when we werent' suppose to leave campus, but I couldn't resist getting one of their sandwiches for lunch!\n\nAnd of course while I was preggers, I craved for a good sandwich and I actually walked (more like waddled) all the way there from fidi to get one.  After many years, their sandwiches are still very good.", "author": "Katniss B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-23", "description": "they have a really good variety. plenty of spreads to choose from. fresh bread. friendly service, i have nothing bad to say! ill be back!", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-25", "description": "My favorite sandwich shop in the city - I get one every weekend.  Their sandwiches are great on the soft sourdough toasted, and the owners are  very friendly :)", "author": "Dave C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-18", "description": "For the past 8 years, I've been eating crap sandwiches from the Safeway deli, meanwhile just a block from my house, hidden on a corner you'd never stumble across, lies Freddies sandwiches.  \nWHAT!?!?? are you kidding me? i've been eating processed, half-assed Safeway sammies while this semi-angry Sammy dude has been kicking out stellar, fresh sammies just 45 seconds from my front door?  huh?  Well, after 8 years of those crummy sammies, today I did find Freddies, and I'll never eat another janky Safeway sammie again.  \nThe bread selection is fresh and good.  The meats and cheese, also high-quality and fresh tasting.  They have a great selection of drinks as Kettle chips..not to mention a delicious italian cole slaw that could stand alone as a high end salad!   \nWhat else could I ask for except to rewind 8 years of my life, and do it all over again.. with my Freddies.", "author": "G. H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-24", "description": "this is my favorite sandwich store because they are fast, their sandwiches are tasty, and they give you big portions. Oh yeah, the prices are very good for the amount they give you.", "author": "Q W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-10", "description": "Freddie's is a good sandwich place if you are looking for a reasonable-priced sandwich on decent bread and like pesto. My biggest complaint about the place is the wait. Last time I went in, I had to wait 20 minutes for my sandwich, and another customer who came in 15 minutes after me got her sandwich before me. I use to frequent it more but 20 minutes is often 15 minutes too long....", "author": "Hoppie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-24", "description": "Absolutely four stars - When I'm away from SF it's Freddie's that I daydream about. (Yes I'm a Francisco Jr High alum - 1972 to 1974 - so there's about five hundred sandwiches right there. And they are just as good today.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-02", "description": "Waking up last thng I usually want to do is cook and the first thing I usually want to do is eat. So on the days that I feel like eating it's great to know that Freddies is a short 3 blocks away. I usually go for the large Italian Combo on Rye with no mayo, avacado, toasted and with provolone. I generally save the second half for later. My advice is to call in before you leave because it usually takes about ten minutes. I believe they toast the bread on a panini press. Eat the first half on bench outside with a beer and save the second half for later.", "author": "Steve Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-09", "description": "Hands down one of the best sandwich shops in all of SF. I got the vegetarian with the oil and vinegar but next time I'm going to go for one of the monstrous mortadella ... either way, don't forget to ask for the jalapeno or garlic spread.\nI don't get the nits about it being a deli w/o tables to eat in ... why the hell would you want to eat-in? Just take it down to the water and enjoy your damn lunch!\nAnd what's this about the owner not being friendly? Eddie (owner of Freddie's) is as nice a guy as you can meet. Besides, he's too damn busy serving up sandwiches otherwise you'll knock him for being too slow. If you want the warm fuzzies, go call your mother!", "author": "Hopping J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-31", "description": "By far the best subs in the Fisherman's Wharf/North Beach area.  I live down the street and eat here for lunch whenever I have a chance.  Only negative I have (and this does not reduce my rating) is that he isn't open on Sundays.  Freddie's - hire extra staff to run the place on Sunday so I can satisfy my craving!", "author": "Tony C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-29", "description": "argh, this is a 3.5 star review. i'm really torn. give me a few more weeks eating lunch in this part of town and i'll probably bump it up.\n\nthis is nominally an italian deli, although there's also corned beef and falafel. bread selection is outstanding. portions are ginormous for the prices. quality of meats and ingredients is just okay. \n\nthis is a fast, professional, deli. no surprises. pretty awesome drink selection too.\n\nlast time i was in, someone ordered an egg-salad sandwich with bacon. what a fantastic concept. now i need to go back tomorrow and get an egg-salad sandwich with bacon. amazing. the more you know.", "author": "Wangston P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-29", "description": "Freddie's is a San Francisco landmark, providing excellent service and quality sandwiches. I find this little corner deli the perfect place to pick up a great sandwich during my lunch break or to pick up a quick repas to take to an outing. I especially love being able to place my order beforehand over the phone and having it ready within five minutes.", "author": "Guillaume J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-26", "description": "I love this place. Totally not pretentious. Just a good, old fashioned neighborhood sandwich shop and it doesn't pretend to be anything else but that. No skimping on the meats and a nice selection of breads.  The Italian combo is the best deal and one small will feed two easily. At first I was a little wary about ordering the garlic spread, but then I found out it was mixed with parsley which helps to counteract the \"garlic breath\". It adds that little special something, that other sandwich places would probably charge $2 for. The jalapeño spread is good, too, when you're in that spicy mood. It is sometimes a bit of a wait, but the trick is to just call your order in. Enjoy.", "author": "Lucie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-28", "description": "Huge sandwhiches at good prices.  I god a 6 inch sandwhich that I couldn't finish in one sitting (and I'm usually still hungry after eating footlongs at subway).", "author": "Brian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-10", "description": "FABULOUS sandwich shop tucked away behind all the pomp and tourism that is Fisherman's Wharf... they've got great vegetarian sandwiches and amazing meat-y options that will make you remember why you liked bread so much in the first place... Don't go in the 3-4 hour though because the place fills up with junior high kids looking for a sugar fix (unless of course you like that sort of thing :)", "author": "Anjali K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-09", "description": "One of the BEST Sandwich shops in SF!! We love Ed (the owner) and the ladies behind the counter. They always make the most delicious sandwiches. Our favs are the Tuna, Italian Combo and just a simple cheese sandwich TOASTED!!! They have the best chip selection as well. I have been going to Freddie's for years now! I just wish it were open on Sunday...sigh...", "author": "CC C."}
