{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "I knew the house was under construction, and that the neighbors were upset and left rude signs all over the front of the barricade fence- but I didn't care. That was not going to stop me from passing by and getting a look at the house for myself, i mean, I watched full house every day growing up and I watch the re-runs if and when I am lucky enough to catch them on TV. I don't see what the problem is as long as you are respectful of the neighbor's homes- we all come to see this one house, so let us.\n\nThe day I stopped by, they happened to be working on the house so all the windows and the front door were open. Lots of hammering and drilling but it was worth going by and seeing it in person. Lovely homes in the neighborhood.", "author": "Stephanie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-10", "description": "The name of this listing says it all.  It's the house from the opening credits of full house.  It's a nice house, but there are many just like it in the area.  It was under construction when I went so it wasn't as nice looking as it could've been.  It's just a residential street with people looking at the house, so there's literally nothing more to do (unless you count seeing a drugged guy puke his guts up at 11am a few blocks over).\n\nGood thing to check the box on if you were a fan of the show.  Did it, done it, don't need to do it again.  Walk to the Painted Ladies nearby for nicer houses.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "It was about a 30 minute walk for me from the Painted Ladies at Alamo Square. I enjoyed the other Victorian homes along the way. It is a typical home on a residential street. Picture tourist spot. \n\nEverywhere you look...\" You can't help but hear the theme song in your head as you stand in front of this nostalgic TV show home. I was captivated by the memories of the show on my first visit two years ago when the home was eggplant purple. I went home and watched episodes to see the shots of the house. The season one opening has an aerial view of the street. The season 4 beginning ( and perhaps all the seasons after) has this house but it looks wider. The original home is narrow in real life. It looks like a set was built of the front of the home. Season 8 Episode 1 , was filmed on location in SF with the cast at iconic spots such as Pier 39, Lombard Street, and backdrops of the Golden Gate Bridge. Comet of course on a cable car ride. \n\nI really should have come here when the cast mentioned they would be in SF. I was a bit bummed to just miss the remade outside of the home used in Fuller House pics. The red door has been replaced with the previous light green door. The home is currently under construction. I will have to return to get better pics in the future.", "author": "Julie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "I seldom play the part of a tourist because I am usually the one showing friends and relatives the must do's and see.  And so with regards to my recent trip to the bay area, i really wanted to bookmark tourist bound destinations for once just so I can play tourist. And I did.  So I said to myself, what is more exciting than viewing this iconic house where the Tanners' lived? Right?  I was indeed a true fan of the show growing up and I still remember most of the episodes when I'd watch reruns.  \n\nI love how it brings back nice memories of my childhood especially in relating to certain episodes of the show with my personal life such as dealing with life's everyday issues- raising children, dealing with death, being a single parent, having your family as your rock, etc.  \n\nOh what an awesome feeling it was standing there and just reminiscing on sweet ole memories.  Soak up the view, the nostalgia, the memories of Full House!  Enjoy!\n\nThank you.", "author": "Chel R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-22", "description": "I can't tell you how excited I was to see THE Full House House! However, it's slightly underwhelming as you're greeted with some passive aggressive signs from those who are currently residing in the house (refer to my photo). I'm sure they have dealt with a ton of inconsiderate tourists, so be respectful and mindful when you are there.\n\nIs this worth going out of the way for? Honestly not really. If you do, it would just be for a quick snap. Luckily, there was only a couple in front of us when we arrived so the wait wasn't so long. No standing on their stairs, a huge bummer but I get it since it's private property. \n\n***TIP: If you're standing right in front of the house, have your photographer kneel down in order to get the whole house in your photo (watch out for double chins haha!). It also is easier to get the whole house from across the street, but you'll probably have to deal with potential tourists in your photo. Pros and cons for each!\n\nPARKING: Street parking is available only as it's in a neighborhood. We got lucky and found a spot about 1-2 blocks away in front of a tiny mini park (although it was more like a grassy area with benches haha). We did see people illegally park in neighbors' driveways, but that's pretty inconsiderate (and probably why they have signs in the first place. \n***NOTE: There was a police man/parking enforcement officer patrolling right in front of the house. It's not worth it to park illegally!!***", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "Growing up watching this iconic television show and then seeing this house in person seriously made my day! Now, there's not much to do when you get here but take a photo and soak up all the nostalgia, but it was totally worth it. \n\nI walked over after stopping by Alamo Square and enjoying the beautiful scene and the Painted Ladies (also seen in the opening credits of the show). They are pretty close to one another so it made for a lovely morning scroll through central SF. \n\nPro tip - Families live in the homes surrounding the house so please be mindful during your visit.", "author": "Jayme H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Must see tourist destination in SF. Currently under construction so your not going to bother somebody living there. Just don't scream for Uncle Jesse or DJ at midnight - people are sleeping nearby.\n\nThe very end of the opening credits of the original Full House feature the Six Painted ladies in the background. The family has a picnic there in Alamo Park with the city skyline off in the distance. That scene isn't this house at 1709 Broderick. \n\nBetween Bush and Pine central and convenient to most of the city as its centered in the 7x7. There are 4 identical houses but your going to want to look for the one with the brick steps. Usually there was a gate at the bottom of the stairs but not at the moment.\n\nThis house is where the family in the TV series lives - the set where it is filmed is a bit different again as the floor plan and staircase of the set is different than what you find at this house.\n\nSince your in the neighborhood check out b patisserie - the stuff there is to die for - and you might as well check out the Six Painted Ladies too - its not far away.", "author": "Stefan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "If you really want a picture in front of the house used for the show, it's pretty central in the city!:)\nI walked there so I had no car issues.\nAlso, I was the only one there. It was funny to then observe when others arrived trying to figure out which house it was. Luckily other tourists showed up so I ended up my picture taken in front of it too :)", "author": "Apple S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "Home used for opening door scene in Full House.\nThe house the Tanner family goes into at the end of their picnic is north of Geary Blvd on the west side of town in the area called Lower Pacific Heights. Its address isn't 1882 Gerard, either. It's 1709 Broderick.", "author": "Gerald H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Streets pretty busy so make sure when you come here don't block the streets! \nThe neighbors get so annoyed and mean\nAnd cars will honk like crazy\nSo be respectful when coming to see this awesome land mark' \nGrowing up\nI loved this show so having a chance to come see the house it was filed in was a little exciting. \nIt's a beautiful home and well kept.", "author": "Koi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "My kids loved it... it's the outside of a house used in a popular sitcom that has captured the next generation with its comeback remake Fuller House. So how can you not give it 5 stars? If you were expecting something more than the outside of a house, shame on you. When we visited all visitors were being quiet and respectful since this is an actual neighborhood. Apparently that's not always the case as signs were posting asking for just that.", "author": "Nancy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-24", "description": "Nothing great about this spot. Love the show hands down!! \n\nBut nothing great to stop here for a photo. \nVery limited parking and lots of people stop here jumps of out their cars and take a quick pic.\n\nI'm not sure what I was expecting really lol I could have stopped at any other house and take a photo by the stairs.", "author": "Shana Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Brings back memories! Went early in the morning and there was no one else there. Just be mindful of the neighbors with your noise.", "author": "Tashawa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "How on Earth can anyone not have sentiment towards the TV show series, Full House?\n\nYes, I can admit my corny cravings for this after school special where I used to rush home and plop myself on the couch, JUST to watch the semi-climatic dramas of DJ Tanner and the wholesome warm and fuzzy lessons learned by Uncle Joey. \n\nThis was my life every afternoon on ABC. So in short, this became my home. \n\nVisiting this house, it brought back so many iconic phrases and gestures. \n\nHave mercy! How rude! Or, you got it duuuude!\n\nCheesiness at its finest. \n\nLovingly located in San Francisco, now that I finally live here, I can't help but pay tribute to one of the most iconic SF sitcoms ever played. \n\nThis house was only filmed in opening credits, but it highlights everything we know and remember as Full House. \n\nGreat place to visit if you're a fan of the show!", "author": "Ann S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Driving by the Full House House is what a reasonable person would expect it to be- fun for a minute for me (an 80's kid) and my kids (Fuller House generation). At first you're like - is this it? And then you realize it doesn't have the original red door. And you give kudos to the current owners bc hell, who wants a bunch of Gen Xers on their stoop pretending to be DJ Tanner every damn day. If you're an out of towner it's a fun drive by moment. Otherwise, the Painted Ladies are where it's at. \n\nIf you want to be a cool mom, use this pic to show your kids you were there- and then go enjoy some Chinese food or spend an extra hour in Napa. You're welcome.", "author": "Hilary L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-19", "description": "This was really disappointing. I grew up on Full House and my daughter loves Fuller House. In the show, in the opening credits it shows the row of houses across the street from a park. \n\nTrying to find parking was a huge battle. We parked about a half mile away. Then there was a huge line of people to take pictures in front of the house. The colors of the house are different and don't even look like in the show. Also, there was not a park anywhere near this house/area like the show. When we first drove into San Fran we saw a park with a bunch of colorful houses that looked very similar thinking that maybe those houses were it. But this house is about 30-45 minutes from that end from all the lights and traffic.\n\nNothing about the house was similar. Even the porch was very small on this house. But in the show the porch is shorter/closer to the ground and much more space. I am curious where they actually film the show. I tried looking it up but couldn't find it.", "author": "Terri M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "Fun times!! Everyone loved being here and taking pictures.  Cute neighborhood too!! Close to a park", "author": "Erin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-26", "description": "1709 Broderick Street\n\n... but, but, but all this time I thought the Full House house was one of the Painted Ladies houses on Steiner Street since in the beginning of the show, during the playing of the theme song, we see the Tanner Family with Joey, Uncle Jesse & Becky running around and ended with the family picnicking at the Alamo Square Park. I guess only true FH fans would know the real house used and I wasn't following the show religiously... just Uncle Jesse (because he started in General Hospital as Blackie in the early 80's). \n\nThe actual home used on the show is actually located in the Lower Pacific Heights on 1709 Broderick Street, about a mile walk from Alamo Square. There's not much to do here but still a cool place to visit. The house is currently unoccupied and now painted tan in color. Threw me off because the Full House has gone through many paint jobs and the original house color of sea green has been replaced and the door is no longer red. Previous owners must've been really tired of the tourists stopping by taking pics of the house each day. We did stop by for photo ops and ascended the red brick steps. \n\nThere is a sign in front of the house that read as follows:\n\nTo the fans of Full House/Fuller House:\n\nWe love you! But please respect our nice neighbors and our quiet street.\n- No double-parking\n- No loitering\n- No loud talking \n- No littering\n- No blocking driveways\n\nBe quick and courteous - don't make anyone say \"how rude!\"\n\nFull House was a popular sitcom show in the 1990's where the fictional Tanner family lived in the city of San Francisco.\n\nReview #0754", "author": "May A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "What's funny is I was there and in front of the wrong house \nI think\nNow I'm confused\nI think I took a photo with the house next door. \nI think I might be slightly drunk this afternoon\n\nI think I'm a house over.\n\nWhat the hell is wrong with me \nEither way \nQuiet street \nNo one bothered me because apparently I was at the wrong house acting like a moron outside.\nBut whatever \n\nLol", "author": "Marissa Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "Not much to do but it's awesome when you grew up watching full house as a child and then see the house in person.", "author": "Candace S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Good times and nice pics! Looks like the producer is Full House actually bought this for filming.", "author": "Daisy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-06", "description": "I guess if you're a huge fan of full house then stopping by this landmark would be fun, but I couldn't get into it. First of all, they did not film the show here. It's the house that's in the opening credits. \n\nWhether you decide to go or not, there will be people there so finding parking can be a hassle and you may have to walk. People do live around the area; so most of the parking spaces are for the residents.\n\nMy sister really wanted to take a picture; so I was dragged along. Not exactly a place to spend a long time, but a quick snap is fine.", "author": "Anh L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "\"What ever happend to predictability?\nThe milk man, the paper boy, evening T.V\nYou miss your old familar friends, but\nwaiting just around the bend.\n\nEverywhere you look (everywhere)\nThere's a heart (there's a heart)\nA hand to hold on to.\nEverywhere you look (everywhere)\nThere's a face of somebody who needs you.\"\n\nOk, I just having too much fun singing this well known TV series classic theme song a lot cause this actual \"Full House\" House has it all!\n\nLocated at Broderick Street just 25 minutes walk from the Painted Ladies, this house serves the visitors and residents around the world to explore the exterior side of the \"Full House\" House every day and night.\n\nThere's nothing much about this house although it's quite a popularity here by taking pictures at the front of the house every time. Of course, I'm quite happy that this house has finally repainted from dark green color to normal, causal tan color as of 4/29/2017. I wish this house could turn into a museum in the future cause if they do, I could check it out again someday after the production of \"Fuller House\" concludes! Hope my dreams could be true!\n\nParking at \"Full House\" House can be quite challenging to park. You can park at the nearby surface street parking if it's available. You can also ride a bike, walk, drive by or public transportation easier without the hassles and gimmicks.\n\nAll in all, the \"Full House\" House is a fine, interesting attraction spot that I fully discovered it right here in San Francisco. A well visit indeed! My rating: 4 solid stars.", "author": "William L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "I never knew there was a yelp page for the home on Broderick St! Yes I'm talking about the full house, house. I happened to be parked in front of the home today, as I pulled over to take a call while I was driving. It was cool seeing all of the tourists taking pictures.\n\nI guess like anyone who lives near a famous landmark,  I never really paid attention to the house. I drive by it pretty much daily and never think much about it. Today was different. Seeing the joy on the visitors faces from seeing the home was awesome.\n\nI decided to look more into the home and found a yelp page for the home! That's pretty cool.\n\nThe only thing I would recommend to any visitors is to be cool and respectful to the neighbors near by.\n\nJust a heads up but the show wasn't actually filmed in the house. The interior shots were all filmed in a film studio in Los Angeles. Some days the garage of the home is open and I'll see people trying to get a peak inside from the sidewalk. Uncle Joey's room unfortunately wasn't shot in the garage!\n\nAlamo Square is a short 5-10 minute drive away, so for all of you fans out there, be sure to go by and see Alamo Square and the painted ladies. Alamo Square is the park where the Tanners are having a picnic in the shows opening credits. The park is on Steiner St.\n\nAlso, while you're on Steiner St., turn around and take Steiner St north bound and you'll find yourself at the Mrs. Doubtfire house, which is also located on Steiner St.\n\nEnjoy folks and I hope you enjoy your visit to San Francisco. There's a lot of cool things to see and do and many good places to eat at while you're in town!", "author": "Philip O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "Uhhh! Let me say that I've only seen a few episodes of full house so in no way am I a full house fanatic. \n\nThe Full House House was honestly JUST a quick drop in drop out photo opp! There was even a sign pretty much stating take your picture, don't be rude, don't bother the neighbors, & move on lol. I'm sure for those fans out there this may have been a special moment for you. I apologize if this message gets you down. Us non full housers just don't understand. \n\nI did however enjoy the walk from the painted ladies over to the house. Such a cool, beautiful, lively neighborhood. Ran across a farmers market & few cool building artworks on a Sunday afternoon. \n\nOverall, it's just a nice 5 minute photo opp", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "Reviewer # 143... If you can remember way back when pagers existed, 143 stood for I love you... Awe! \n\nAnyhow-- why don't you come with me down memory lane. Bada bop bow bow, it's the Full House House! I was a young kid into a teen and watched this show religiously. I was such a huge fan and I always wanted to to the house and visit San Francisco. Now, S.F. is one of my favorite cities and I took pics on the stairs of the house. The house is empty and visited by lots of people. I parked in front of one of the neighbors house and he said it's fine. He said that his house is the opposite of the Full House-- it's the empty house as it's just he and his wife... I thought it was both cute and sad at the same time. \nAt least he didn't give me grief, because I would have had to say, \"how rude...\". I kinda wanted too anyway, but didn't.\nThe house looked bigger, cleaner, and more spacious on television. I almost remember there being a park across the street, but it's been ages and I must have been wrong because there is no park. It's on a small residential neighborhood. \n\nNext stop on memory lane... Mrs. Doubtfire house-- won't you come along? I've liked having you with me :)~", "author": "Greg D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-18", "description": "I was really looking forward to taking a picture in front of the house because I was a huge full house fan but the house was under construction when I drove by.", "author": "Mary T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-05", "description": "\"Whatever happened to predictablity? The milkman, the paperboy, evening tv...\"\nApparently someone with more money than sense purchased this house only to paint it a hideous dark color to discourage visitors and photos, as if they somehow didn't know about it's fame before making the $4M purchase!\n\n\"...You miss your own familiar friends, waiting just around the bend...\"\nLuckily, a kind-hearted soul (or the reformed owners?) repainted it back to the lighter shades we remember, for much more accurate photo ops! Instead of solid white with a cheery red door, it's actually a soft grey with white trim and a maroon door. It looks good!\n\n\"Everywhere you look, everywhere you go, there's a heart, a hand to hold onto...\"\nThere's bound to be someone in the vicinity when you visit who will likely snap your photo for you if you ask nicely. No less than four couples walked up to do so when I was there on a random Tuesday afternoon at 3PM! \n\n\"Everywhere you look, everywhere you go, there's a face of somebody who needs you...\"\nPay it forward and take someone's photo for them or let them snag your parking spot so they can enjoy a moment with their memories of this house, too. Other visitors need you to park, hop out, get your photo, and go- this is a quick stop not an actual attraction.  Don't try to trespass for a selfie, the building was only used for exterior shots and people actually live here!\n\n\"When you're lost out there and you're all alone, a light is waiting to carry you home!\"\nSpeaking of getting lost, use your GPS because the house isn't tucked in with the other Painted Ladies across from Alamo Square Park as it was depicted in the opening credits. If you're in that area, it's a few streets away on a regular residential block. \n\nNOTE: If you want to do a tour of famous houses in SF, the Grateful Dead House is under 2 miles away. Others in town include the houses from That's So Raven and Mrs. Doubtfire, as well as the Charles Manson house. You're welcome.", "author": "Stefany V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-04", "description": "We got a little lost finding this place... Goodluck!! My sister and I were so excited to stop by here and take pictures since we grew up watching Full House, but it wasn't anything too extravagant. If you are short on time skip!!", "author": "Lizzy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "Not much going on here except the red door and house. It's on Broderick street in SF. Not much parking but you can quickly illegally park in front of other people's garages across the street. Take a quick picture and be on your way. There is no free grassy park as seen in the Full House intro though. Don't go here thinking there is a park to picnic at. Again, it's just the house and door. Still, it's a quick scratch off your list in SF.", "author": "John Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-01", "description": "This is the actual Full House House located at 1709 Broderick.  It is located in a nice quiet neighborhood. There is 2 hour free street parking all around. You really don't need to spend more than 5-10 minutes here looking and taking pictures. \n\nThere is a huge white sign in front of the home in case you have trouble finding the home.", "author": "Sam N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Such a fun quick thing to do in San Fran! We took a few photos on the steps, and since it's currently unoccupied we even made a cute video. I heard the producer of Full House recently acquired the property and can't wait to see what he does with it.", "author": "Greta W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-05", "description": "Very disappointed that the house looks nothing like the show. We drove past it a few times because I had the original house stuck in my memory.. \n\nIt was nice to say we were there but not worth visiting if you're spare on time...", "author": "Melonie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "Growing up and being obsessed with Full House (Olsen twins), I couldn't miss out on taking a pic here. I was disappointed that the house wasn't white with a red door, but it was still cool. Also, there wasn't a spot to park, so I had to hurry and take a pic. Pros: less than 15 min. away from Painted Ladies/Alamo Square and Mrs.Doubtfire House.", "author": "Nikki N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-16", "description": "Totally cool to see, but remember to be respectful of whoever owns the house today, because it definitely is NOT the Tanner family!\n\nI've lived near San Francisco my whole life and have never ventured to find this fun little novelty until very recently.  It was definitely an interesting find; however, it isn't SUPER special.  After all, it's just a random house in Pac Heights.  \n\nNevertheless it was fun to drive by, especially since I was with some friends who were visiting from out of town.  \n\nJust remember not to climb all over the house please!  It's somebody's property, but definitely fun to take pictures from a bit afar.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-26", "description": "I'm a fan of full house and to be honest seeing this was just alright.  Luckily we were in the neighborhood but its just a house just like all the others around it.\nMy advice is if you are a fan and you are within a few blocks then check it out. Otherwise skip it, serious its not that special.\n\nTIP: parking is really really tough.   We found a spot after 10 mins of searching down the street.  Another car was double parked by ours for only 10 mins and got a ticket.  Don't double park, SF meter maids are ruthless!", "author": "Dj S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "Second trip to San Fran and I finally found the Full House House! Talk about a blast from the past. Only disappointing thing was the door wasn't red anymore. After researching a little on the internet, I found that the most recent article states the producer (?) of Full House bought the home. Upon visiting the property I saw it has been empty and nothing has been done to renovate it yet that I could see. I'm sure the residents on this street aren't too excited about the constant steady flow of excited Full House fans stopping for a quick pic. But of course we did. And that will be the only time not to disturb everyone. Well, maybe one more time if the door is painted red like old times. This was definitely a better picture to get than the Fresh Prince house. 90's kid at heart!", "author": "Pam M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-30", "description": "I was doing some spring cleaning and came across a bunch of items from my trip to San Fran last year and said to my bestie, \"Wouldn't it be funny if there was a page on yelp to review this.\" Of course there's a section to review it and why not. I will be honest in saying that the reason why we came here was 'cause it was on the way to an eatery that we actually wanted to go to and so that we could have a photo for fun to tease our friends back home since there is a lot of inside jokes that we share about Full House. Yes we are of that generation that saw the show. This is the exterior house shot. I will be honest in saying that it wasn't worth it for us to make a special trip out for the travel but it was on the way to something and a small detour for us. There is actually plenty of other things to do in San Fran that if you do miss this your trip isn't any less \"full\"filled (yes I snuck it in there). If anyone makes fun of you for seeing this house you can say....how rude! I will warn you that there was a lot of people in front of the house, therefore, you will never get a clear shot. We tried and it just looks like a bunch of people in front of a crowded house. Secondly when we went there the house was newly painted, therefore, it doesn't actually look like the iconic house in the opening credits. In fact there are other houses on the block that look much closer to the actual house used than the house itself and less crowded as they were built by the same builder. You can take a pic of yourself in front of that house and tell all your friends it's the Full House House. Trust me it's the exact same house and less of a pain in the ass dealing with other tourists. Secondly if you're taking the pic from across the street that are many cars that will get in your shot all circling for traffic. We were smart and took transit. Also someone lives in that house so when they peaked at the window I felt really bad that they have to deal with the crowds.", "author": "Shila B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "I'm an 80's baby, 90's kid and loved watching the show. Now that my kids watched Fuller House, it was a must to visit the home. Parking is difficult as it is a residential neighborhood but if you go during the day when folks are out, it's easier. But please, don't be rude! and double park. It's not fair to the residents driving through. \n\nIt's a great quick stop if you are in the area, totally worth the photo op!", "author": "C L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "Writing a Yelp review about someone's private residence...I guess that there's a first time for everything!\n\n____________\n\n+ Our visit to the Full House House was a breeze. A visit here would make for a nice detour for those who have access to a vehicle. Plus, it's quite convenient to have Union Square located about 12-15 minutes away! \n\n+ There were only two other pairs of tourists visiting for a photo-op on the day of our visit. We came by in the middle of the day on a Sunday, and were pleasantly surprised by the overall lack of activity. \n\n+ Honestly, I wouldn't even sweat looking for a parking space when visiting the FHH. The street is relatively wide by SF standards, and you can double-park the car for a few minutes or so, take photos with all possible combinations of people in your group, and be off on your merry way in 5 minutes at most.", "author": "Mark V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "Craig Y. gets credit for telling me about this Landmark!  \nI wouldn't have come here if he didn't mention it!\n\nI guess I'm not a TV person - I don't think I ever watched this television show!  Haha!  \nHowever, Yuri and I were playing tourist in San Francisco, so we found this landmark and took pictures of this house.  There was a gate in the front, so we couldn't get too close.  Craig asked if there was a park across from the house - \"no\", there are just more houses similar to this one across the street.  Sorry!\n\nIt was just fun to be on vacation and hit a somewhat famous place!  Bookmark completed!", "author": "Nadine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "blah blah dont buy a famous house if youre mad that people are gonna wanna see...a famous house creepy passive aggressive tenants remind me of scary ppl!!!! the house itself is beautiful and i am visit a lot when i see san fransisco", "author": "Rari Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "90s geek here! Seeing this house made my tummy flutter with excitement. The only downside was the unruly lady on the other side of the street screaming at people. I gathered that she's a resident of the street; and was visibly upset by all the commotion going on. Trust me I get it, but lady, you sign up for that when you move in! No need to give yourself a heart attack at a young age. I'm saying a little prayer for her.\n\nOtherwise, super fun to see this location!!", "author": "Lindsey D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "I went there at night and felt really creepy knowing that someone currently lives there. I was there for probably 30 seconds, there's not really much to see. I wouldn't suggest going unless you really really really really like Full House", "author": "Logan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "This is a fun little stop.  We lumped it in with the Mrs. Doubtfire house and the painted ladies.  It was a great walk and nice to see.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-21", "description": "The house has been painted but it is the house from the show Full House. Parking can be tricky but worth a stop if your in town. Really your just looking at the outside of a house. Still check it.\n\nNote: Leave the owner alone!", "author": "Seth K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "Love the shows Full House and Fuller House .. so naturally, when I found out we could actually see the house, I had to go! Trip from Sac on a Saturday with Frisco's horrendous traffic resulted in 2.5 hour drive. Luckily was able to find parking on street block and a half away. House had a fence up in front of it so we couldnt even sit on the stairs for a pic. Also, the door wasnt the red color its supposed to be .. those 2 things took away from it. Well .. we went, we saw .. and thats about it. Cool experience .. but not doing that again unless they make the house the way it is on the show and allow tours of the interior!", "author": "S L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "Note this house is NOT by the famous hill, it's down a few miles on a street with a horrible view.\n\nLoved being able to live out a bucket list item by seeing this spot.  Take a bunch of selfies. It's sure to get more busy with the Netflix show coming out soon. There is not a lot of spots thing walking distance I recall. But yeah if you were a huge childhood fan like me you have to stop.", "author": "Kim M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-07", "description": "If your a fan of the 90's tv show then a stop at 1709 Broderick Street is a must. This is the house used as the Tanner residence, it has been painted a different color and the tree in the front yard is a lot larger. \nThere is street parking, but I had someone wait in the car take a few pictures and jumped back in. You only need a few minutes to check this out.\n\nCool tip you are only 1 mile walk from Alamo Square (the painted ladies) also used in the opening scenes in full house.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-08", "description": "If you're a huge fan you'll love this. But at the end of the day it's just a house with a bunch of tourists in front of it. The whole time we were there I just felt bad for the neighbors lol there was constant traffic and people all crowded around the house. It's cool but if you don't don't have time or aren't in the area you won't be missing much.", "author": "Alyssa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "I don't remember the house looking like this. Doors were not painted red. Anyhow- We took a quick photo on the steps.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-01", "description": "Having lived here for over a year, I thought it fitting to be a tourist and stop by the painted ladies and then, of course, the Full House house.\n\nI watched Full House as a kid but was t super obsessed with it; however, I can't help but love the opening to the show with San Fran, the painted ladies, and the house.\n\nI was expecting a White House when I approached the street, but was a little shocked.\nThe house is a darker color and is mostly covered by a massive tree to the left of the stairwell.  It is definitely the same house but the change of color takes away from the familiarity. \n\nIt felt good to see the house, though. It's a shame that the color is completely different...takes away from the reference to the show. Perhaps that is what the current owners want?", "author": "Monica J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-13", "description": "My husband dropped my kids and I off and circled around the neighborhood while we took pictures. There were others around to take photos for us. (Two other smalgroups). You wouldn't notice the \"full house\" house if you didn't know the address. If the door was still red, I would have given 5 stars. Nonetheless, my girls and I were super excited to sit on the steps of one of our favorite homes! I'm glad we did it. The kids loved it. We spent about 5 minutes there and that was enough.", "author": "FourBest G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-03", "description": "Full House house. \n\nSo for people who don't know what's happening on Broderick, the people just randomly stopping and parking on the sidewalk, then you don't know! It's the Full House house, which is from ze Full House show back in the 90s :)\n\nColorwise, it doesn't look familiar, but you look at the details and you can tell that it is indeed from the opening shot :) The people who live here now must hate the fact that everyone is stopping by their house :'(\n\nYou can go off to the Painted Ladies as well after when you're done here for the 2nd shot from F.H.'s intro", "author": "Raymond L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "Getting here was a journey in itself.  I got the wrong address at first :(   I finally got here thanks to yelp! \n\nI parked on a side street and walked over.  There was no one else taking pictures when I first got here.  The owner arrived while I was standing staring at his house.  Awkward.  I took a couple of selfies and checked this out of my bucket list.  I was disappointed the house was painted.   When I walked away I felt my life was a bit more complete.", "author": "Iris A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "Great to finally see in person, brings out childhood memories. However, nothing special. A sign outside that states to keep the noise levels low and respect the neighbors. Very hard to find parking, but that's SF for you. There are so many people visiting that it's hard to take a photo without anyone else in the shot or interrupting you. Other than that, puts a smile on your face knowing you've seen it.", "author": "Aureen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-26", "description": "Whatever happened to predictability? The milkman, the paperboy, the evening tv...\n\nIf you are a Full House fan, you MUST check out the Full House house that appears in the opening credits of the show while you are in SF. It is in a quiet area, and not too many people visit - which makes for amazing pictures! I was able to find parking just half a block away! Be respectful of the house and gate, as a family does live here. However, it is a must see!!", "author": "Sanaz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "What a great experienced this was! I grew up watching full house and I never imagined that I would see this house ever! Though i wish it was in its original state they had already repainted the house. I also thought that the house would be alot closer to the Alamo square park but it was not. I wish I could went inside! I was just there in October and the house next door is for sale if anyone is interested! lol", "author": "Chau Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Highlight of my trip to SF for sure; not because the house itself is at all grand but, because it triggered a million beautiful childhood memories   whatever happened to predictability...", "author": "Raika M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-29", "description": "Kind of cool to see, but it is very out of the way for an on foot traveler. It's a super cute house and I would totally live there! All the people standing out front kind of ruin it, but I guess it is a touristy spot.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "As a lover of full house when I was a kid, it's great and also kinda hilarious to visit. When I went for the first time only 1 other group was there but this time, there was a ton of groups! People are really coming out for this house. The neighbors must hate it... lol.", "author": "Katlyn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Seen the full house tday in san fransico pretty neat to see but parking can be tricky .Lots of  traffic and congestion in the area but cool to see ive been a fan of it since i was a kid so a must see in san fransico ca.", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "Everywhere you look, everywhere you go.. \n\nA nice hidden gem in SF if you're a fan of Full House growing up.  A must go if you're a tourist!", "author": "Danny L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-11", "description": "Cool seeing it I guess, just expect more. Almost couldn't tell the difference from the other houses around it.", "author": "Devin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "Didn't see Joey or the twins as it was late night. House was dark but looks a bit different as the paint has changed.  Good luck finding any parking so have a passenger hanging out the window to take a pic.", "author": "Paul F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "I'm a dork and had to stop here. It was exciting for a child of the 90's who watched Full House religiously. If I'm being totally honest- I still record and watch it. Haha. I miss the iconic red door, but it was still fun to see.", "author": "Cori K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-23", "description": "I mean, what is there to say? The house has been completely redecorated and doesn't look anything like it did on the show. It was pretty cool to stop and see it, but nothing to really get excited over.", "author": "Joelle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-12", "description": "Having watched Full House growing up as a kid, it was nice seeing the house in person. Quite expectedly it doesn't look anything like it did in the show. \n\nIf it's on your way and has some sentimental value, sure, stop by and have a look. Other than that it just looks like any other house in SF.", "author": "Zoher Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "My daughters are in to full house, they enjoyed it and took pictures on the steps. They took a bunch of pictures. There wasn't too many people there which made it nice. Of course parking is always difficult and to be expected in San Francisco.", "author": "David C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-08", "description": "I love everything about it, only downside was this rude crazy lady across the street yelling curse words at all the tourist .. like ummmmm I'm sure she knew she was signing up to live across the famous full house house l", "author": "Marlene H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "My inner kid was so excited to see the Full House house! Even though it was only the front used in the opening credits I loved it! Little disappointed that the door was green vs. red. I do recommend going to see the pink ladies and the park across the street that is also from the opening credits.", "author": "Ruth H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-27", "description": "Slightly disappointing. Not sure what I expected but it did not meet it. Cool\nHouse though.", "author": "James O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-03", "description": "Um ok....did it and now what, not going to lie I did watch the show when younger and throughly enjoyed it but if not for my family asking for a drive by/pictures would have passed. If your in the hood or a fan of show then sure check it out", "author": "N And N K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-29", "description": "1. What is the point? This is just a house facade used for the credits. The show was not filmed here. Nothing to see move along.\n2. So now fools go taking photos in front of it like it is the fb-selfie-spot-of-the century.\nDOUBLE PARKED\nBLOCKING DRIVEWAYS\nCROWDED\nThe only thing coming here does is disturb the neighbors.\nIf you want something real, go on a studio tour where they actually do film shows", "author": "J B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "Life long dream fufilled! Finally got to see the Full House house in person! Its on a nice little street with the \"painted ladies\".  It was quite easy for us to pull over and park so I could take a picture.", "author": "Kimberly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "Great stop...why not do it if you're in the area. If you're thinking it would be a waste of time...cut..it..out...lol", "author": "Chekaya G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "This was a fun experience to go and see..... but you may be a little disappointed. The front door is painted green, not red!! The house is also on a street that is different from the show. But overall, it's definitely something fun to go see and take pictures on the step. \n\nBut as you pull up or walk to the house.... you must play the theme song nice and loud on your phone or in your car. That's what my family and I did and it was hilarious!!", "author": "Alex A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "I watched Full House as a child and it was a big part of TGIF on Friday nights. This place is free to visit and I was able to live out a childhood memory!\n\nI wish the house was still painted as it was when Full House was filmed, since then it has been repainted to a dark gray. It's the owner's choice, but it just didn't give me the full effect of childhood nostalgia that I was looking for!", "author": "Stacy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "It is such a flashback to my childhood. Although it is a quick experience and you only snap a few pics then take off, it was def worth the visit.", "author": "Katherine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-13", "description": "I visited the Full House house in May 2012\n\nIt was not painted purple at the time! I'm kind of sad that it's painted now. =[ I know there have been many renovations since the show has been aired, but painting it purple totally changes everything! I guess that's what the owners of the house wanted, sadly.  \n\nIf you still wanna see the Full House house despite the new look; \n\n-I stayed at a hotel a little over a mile away and walked which is probably the best way to get here! \n\n-This is an ACTUAL house and people live here! You cannot go inside. By reading other reviews, if you're UNlucky, someone will come out (or already be out) and tell you to go away. It's in an actual normal neighborhood with no special signs or parking lot.\n\n-When I knew we were on THE street (Broderick), it was soooooo much fun trying to find it without using a map! The yellow tape blocking the stairs was a dead giveaway. Lucky for me, nobody was in sight and I was able to take tons of pictures in front of the house with my doggies! =] It was on a weekend morning, so maybe they were still sleeping?! \n\n-Walk here or park farther away if you can. I'm sure the owner and neighbors get extremely annoyed by people constantly coming by.. but I wouldn't move in or next to a famous house. Just saying! Walking or parking far away allows you to avoid the possibility of traffic surrounding the house. \n\n-For those who don't know.. the show was NOT taped inside the house. Also, the picnic at the park scene during the opening credits is not in front of the house. That is called \"Painted Ladies\" which is also in San Francisco!", "author": "Erika R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-13", "description": "Firstly, we went to the wrong house earlier because we thought the Alamo Square scene was where the actual house was. The real Full House house is actually a mile away from the park, off of Broderick street. We drove here to find that the house is repainted and is not as cool as expected. I did check Zillow to see what the market value for this place is and it seems that it was purchased a few years ago for $1.8 million and is currently well over $3 million. I am guessing this price hike has something to do with recent Netflix remake of the popular show. It was still fun to stop by and see the Tanner house on my trip to SF, but I wish that the current owner had maintained the house as it is seen in the TV show. I don't blame him/her for wanting to make the place their own though...", "author": "Vats A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "Be very careful with stopping to take a picture, even if you're still in the car! The SF parking meter people will literally chase your car down to write you a ticket... no stopping whatsoever! Our Uber got written up just for dropping us off near the house. Cars that were slowing down to take a picture outside their window were written up.Your best bet is to be dropped off the next street over to avoid any violations!", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-17", "description": "I can't say that I was impressed.  The house has been repainted to a navy blue and it looks just like any other house in San Francisco.  Not a must do!", "author": "Monica G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "There it was - pretty cool.  I don't know how you review some random house, but heck everyone else did, so I will too.  It was kind of disappointing - neither of the Olsen twins were there in their strung out glory.  Life goes on.\n\nOverall, a 4 - I am not going to lie, the fact that Candace Cameron married someone else is really holding the house back from getting a \"5\"", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "I grew up watching Full House so visiting the Full House House during my visit to San Francisco was an absolute MUST! I stopped to take some pictures clearly I wasn't the only Full House fan, as cars and tourists lined the street. It's nice to see that a show so old still has such a strong following. \n\nIt was a little disappointing that the owners have painted the house and let a tree grow in front. However, take a look at the pictures. Notice the detail. This is, in fact, the real Full House House! Like I said, I grew up watching the show and was elated to see this house in real life. It was a nice throwback to my childhood 15-20 years ago.", "author": "Justin V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "It was nice to actually see the \"full house\" house since I grew up watching that show. Once I was there my friends and I were neutral about being there. We took some pictures and tried to analyze how the inside of the house looked, and how it fit the scenery to the show.... It was ok to see it in person well the outside of the house. \n\nThe house is painted a different color it is no longer white, and also the owners were rude! We were outside taking picture along with another group of people when the owners arrive in full speed and honking! Almost ran over the people there! \n\nI guess they haven't got use to live in a house that is so popular.... Lol!\n\nMemorial Day weekend 2015", "author": "Fabby C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-29", "description": "If only I visited the house before they painted it a bluish purple. Sigh....\n\nThere's a huge tree covering the garage and the lower half.", "author": "Stan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "It's really cool and surreal to see houses that you see on tv. I feel bad for the current owners because of the heavy traffic toward the house. The house was recently painted purple and has a tree covering the front a bit. \n\nThere's little parking around the area (nothing different from anything else in sf) so some people stop randomly on that road to take pics. There's traffic as a result.", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "I sometimes get male boners when I think about Jesse Katsopolis, and the opportunity to visit his old house was too good to pass up.\n\nAs many others have noted (and the pictures show), this house no longer looks like what you see when they run the Full House intros. However, the experience at the house is exactly what you would expect when visiting a home from a fictional television show: you feel like a creepy stalker outside of a random stranger's house.\n\nSo long as you are okay with being a weirdo taking pictures of a house where the Tanners did not actually live, then this is a 5 star experience! And judging by my 5 star rating, well... you can probably guess what kind of a guy I am.", "author": "Jason A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-01", "description": "For some reason I thought the Full House house was the houses in the Alamo Square. Nope. It's just a standard house in the middle of an average neighborhood. \n\nI grew up watching Full House, so I wanted to see it, and honestly it really wasn't a big deal. We drove around trying to get here and it's just a house. Yes, I've already said that twice, but was expecting Bob Sagat to pop around the corner and give me a high five. \n\nSeriously though, it's nothing special and the only reason you would want to come here is for nostalgic reasons. Otherwise, there are plenty of better places to visit in SF.", "author": "Benny H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-14", "description": "Pretty much a let down. Cute for a quick photo if you're just passing by. But not a lot of context. It's just a house in a neighborhood.", "author": "Annamarie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "FAR FROM the PAINTED LADIES! FYI.\nMy fellow Yelpers got it right when it came to that.\nAttempting to walk from the Painted Ladies to this house will cause weight loss, I swear. lol. \n\nBut on a more seriously note, the color has changed. To a dark color & the tree in the front blocks most of the front of the house. We wouldn't have known it was the house if it weren't for the number.\n\nWhen we got there, people were already taking pics in front of it.\n\nFinding parking wasn't bad, we're just pretty lucky when it comes to parking. But it is a neighborhood with street parking, so unless you get lucky, you will most likely parallel park. Just sayin'\n\nAll in all, I can say I have seen it once & I don't have to come back :)", "author": "Camille C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-18", "description": "While I agree with this being listed under \"Landmarks and Historical Buildings\" this is definitely NOT and should not be considered a tourist destination. Someone actually lives here and I wouldn't be too fond of random strangers stopping by my front door taking pictures. As the address is well known I wonder how much mail they get that's addressed to the Tanners.\n\nTo add insult to injury (most likely to make it less obvious that it's the Full House house) the house isn't even the same color as in the show. They also added a tree in the front window to make it less photogenic. I guess it hasn't stopped people. And considering how tiny SF real estate is and how big the Tanner house is depicted in the show, a certain suspension of disbelief is required.\n\nIf I were to look for authentic and photogenic Victorian/Edwardian houses Google \"Painted Ladies\". It's somewhere in Alamo Square.\n\nThe only good thing to come out of this visit was that it was located far away enough to get a decent workout after eating brunch at Nopa, which unlike this house is a reason enough to go to the Western Addition/North of Panhandle area.", "author": "Isabella B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "Another great tourist attraction while in the San Francisco area. The house is no longer the same color as it was during the show, but it was still a cool thing to see since I grew up watching Full House when I was a child. Even more  so since they are thinking about a revival show. \n\nIt was just the front of the house used in the show to depict a style of the house for the area in which the family lived, and the rest was on a sound stage, it was pretty cool to see, maybe just a once in a lifetime visit for me though.", "author": "Tina S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-05", "description": "At this dubious attraction, we see hundreds and into the thousands of visitors daily who double park blocking traffic, pull into and block driveways. play the theme song at volume, J walk across this often busy street and stand in the street to take pictures putting their own and their children's lives at risk,  They annoy the neighbors with loud talking, car door slamming and littering.  These behaviors continue into the night and even into very early morning hours most likely after the bars close.  This is a residential street, not the Warner Bros. back lot where a full scale reproduction of the facade of this house exists.  At the WB, fans can walk around the back lot oblivious to traffic as there is none.  Here fans can get hit by cars and trucks.  At the WB fans can be loud and obnoxious.  Here it is not appreciated.", "author": "D N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "Beautiful house that looks like it's occupied. I had no idea that the Full House was located in the middle of a residential street that can easily be missed. I think this landmark is unique and special due it's major role in The original TV series, Full House. I think if there's free time in anyone's visit to SF, this landmark should just be crossed off the tourist list for the hell of it!", "author": "Allister D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-15", "description": "It's a little far away from the Alamo Square so lesson learned was to just simply drive to the house instead of walking from Alamon Square. It would have only better had John Stamos was posing in front of the house with me! hahaha. I would have easily recognized a familiar face. They repainted the house to purple which is different from the original Full House \"house\". Just took a quick shot and left. If you have other things better to do because clearly I was running out of ideas then this could be skipped.", "author": "TianChee S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "FULL HOUSE\nMy girlfriend and I planned our trip and this was one of the main priorities. On a winter break week day, we were curious of what to expect. Would there be a long crowd? Will we miss the house? Is the address provided online even right? After arriving, further research, and validation from other visitors. We were at the right place.\n\nParking\nSince it is in an actual neighborhood, it is pretty busy. Parking around the area is usually 2 hours, honestly you'll need 2 minutes tops...maybe 10 if you get really curious and confused.\n\nFeels\nAs of 2015, the house has been repainted purple. To be honest, I was quite confused as I definitely envisioned a different setting and neighborhood. A part of me feels incomplete as I feel validation with a sign saying this is the place...however breaking it back to reality and trying to remain positive, I am fortunate that this house was a symbolic monument with the capability to teach millions of viewers valuable lessons while bringing a family together through this family show.\n\nOverall\n3.5 stars. I would recommend checking out the 4 ladies instead, I feel like that area was more memorable. Looking at this house helped me understood the difference between reality and theatrics. I am quite impressed that a 90s show continues to make an impact in many people's lives; when we passed by after lunch, the random crowd of visitors got bigger.", "author": "Leland S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-09", "description": "This isn't even close to the house I was expecting. I was bumping the theme song in my car on the ride up expecting the Tanners to be playing in the park that is so prominently displayed on the intro but it was a huge let down. Not only is the house not white, it's not even on the major hill that the show portrays. Lies upon lies. Being raised on Full House I had so many expectations. First I find out Michelle Tanner is really two people, then DJ Tanner takes diet pills, and now the bombshell that is the old Tanner household.", "author": "Khanh N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "It was a fun thing to go see, especially being a kid who grew up watching the show. There were a few people that came by to get pictures as well, but it definitely wasn't over crowded. \nSadly, it looks completely different from when it was on the show. But if you look at the details it's definitely the house.", "author": "Denae L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-30", "description": "Does anyone else find it weird that there's a Yelp page for a private residence?\n\nIf not, you'll be glad to hear that I'm deducting a star because it's painted gray rather than white like on Full House and deducting another star because I didn't see a single Tanner family member. Even Kimmy Gibbler would've been nice.", "author": "Meredith K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-29", "description": "OK so this is the house, well the front of the house. The door is black not red and there is a bigger tree infront of it. But you can tell it is it. Not really a lot more to say about it. \nSo for the people who think that they lived in the painted ladies not true, they drove to that park and had a picnic. If you watch the episodes you will see it and see that there are house across the street(Not the Alamo park).\nIf you were a full house fan it's kinda cool to see but that's about it.", "author": "Allison P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "I made my boyfriend walk about 10 miles all over SF just so I could take a thumbs up picture in front of this house. Worth it.", "author": "Angela S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "If you feel OK looking like a stalker and taking pictures in front of someones house then this is a perfect thing to knock off your SF list of things to do. Don't forget to hashtag #fullhouse . \n\nThe memories of all the famous catch phrases from that show pops back up in your head: \"have mercy!!\", \"you got it dude!\", \"cut-it-out\" makes you feel nostalgic. Parking is easy to find here, takes less than 5min to take everything in and take pictures, so don't let it go to waste. Make sure to take a deep breath and take all your childhood memories in.", "author": "Matt T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "I love the house but they need to fix the Road my husband and I were like didn't they have a house looking out to the GOLDEN GATE BRIDGE??? Then we laughed but all together it was an awesome awesome experience.", "author": "Beena S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-14", "description": "Honestly, do not waste your time. It is just a house and it is now unrecognizable from its TV days. You will drive far out of your way when you could have seen a real tourist attraction.\n\nThe Tanner family never lived here and the only thing filmed here was the shot of the house in the opening credits.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "I'm giving this experience 5/5 stars because this was an amazing experience. The house is remodeled (since the show was less than 29 yrs ago) & beautiful! It's in a quiet, residential neighborhood, so parking can be tough. Even if you walk & park, it's still nice to see the area.. Crazy to think this use to be filmed for the outside shots (mostly) & now has became an historic house! Enjoi the experience. Snap photos for memories & everywhere you look, there's somebody who needs you!", "author": "Joi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-15", "description": "If you are a child of the 90s like me, you know you absolutely HAVE to come here while visiting San Francisco.\n\nThe house is now painted a different color than it was on the show but it's still very much the Tanner family home. Until this visit I had no idea this house is NOT one of the painted ladies houses!! It's a little bit of a walk, but totally worth seeing.", "author": "Lexi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "Stopped by here because Full House was my favorite show, growing up. I was so overjoyed to see this house, as it holds a lot of sentimental value for me. So overjoyed that I also even tripped while going up the stairs! (Be careful y'all.) Only thing I dislike is that it's completely redecorated and looks nothing like the house used in the show.", "author": "Gurleen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "This house is all about nostalgia, if you're not a fan of the show, don't bother you will be disappointed. However if you're like me and want to relive a childhood with the Tanners by all means take that stroll  (mostly down hill) from the Painted ladies.", "author": "Crystal V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "It was a lot of fun seeing a house from one of my favorite childhood shows! It's been re-painted since then but still looks really cool!", "author": "Regina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Omg so cool omg OMG omg ... Jentry looks hot standing in front of the house.  This is a dream come true", "author": "Eric D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "Brings back memories of the Full House days ... I love that show.... I just wish the owners kept the old color of the house.", "author": "Andreli B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "This is the exterior of the \"Full House\" house. There is nothing to do there except for look and take pictures but for Full House and Fuller House fans, I recommend visiting here!!", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-31", "description": "I just wanted to check this off of my bucket list. The current residents or someone before them painted it and planted trees to cover up the look. :( \n\nWord of advice: If you are going to buy a famous house, be prepared to have gawkers and people driving by for pics. Dont poop on the party and ruin the look.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Super cool if you were a fan of the show! It sucks that color isn't the same and that the tree is blocking most of the side of the house but still pretty exciting. And if you watch re runs its be same tree from when the show was on the air!", "author": "Tania H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "Well, I am glad I am not the only one who thought to look up the Full House house while in San Francisco!  And once I found it thanks to the address listed here, I was relieved to know I wasn't the only one there as there were several other tourists outside the house taking pictures. I was disappointed that there wasn't a big park in front of the house like the show leads you to believe, and I found it funny how small the house actually is in comparison to the layout in the show, I mean there is no way uncle Jessie and aunt Becky could fit their loft in the attic with the twins in this house!  I am glad I took the 5 mins to stop by and reminisce on one of my favorite TGIF shows.", "author": "Charmie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-22", "description": "My little girl had this place on her bucket list glad I was able to bring her. The house is just as shown in the series.  We still watch the reruns", "author": "Lucy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-28", "description": "What ever happened to predictibility? \nThe milkman, the paperboy, evening TV. \n\nEverywhere you look , everywhere you go (there's a heart). \nThere's a heart \nA hand to hold onto. \n\nEverywhere you look , everywhere you go. \nThere's a face \nOf somebody who needs you. \n\nEveywhere you look, \nWhen you're lost out there and you're all alone, \nA light is waiting to carry you home, \nEverywhere you look. \nEverywhere you look.\n\n******************\n\nDidn't go in, but took photos around it. \nI mean... honestly, you just need to take a photo in front of it and done. If you're a kid of the 90s, you will enjoy this.\n\nAlso, take a photo in front of the many houses that were panned in the opener.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-04", "description": "What ever happened to predictibility? \nThe milkman, the paperboy, evening TV. \n\nEverywhere you look , everywhere you go (there's a heart). \nThere's a heart \nA hand to hold onto. \n\nEverywhere you look , everywhere you go. \nThere's a face \nOf somebody who needs you. \n\nEveywhere you look, \nWhen you're lost out there and you're all alone, \nA light is waiting to carry you home, \nEverywhere you look. \nEverywhere you look.\n\n\n\n*It's the house where the steps are guarded off with a Gate and it has a \"No trespassing sign\".. \n\nHAVE MERCY. YOU GOT IT DUDE. HOW RUDE. CUT IT OUT.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "Regardless of the new color it is still very much the Tanner family home. \n\nLocated right in San Francisco, this house is somewhat close to Japantown. Since it is a home, it's located in a residential area which is awesome because parking doesn't cost anything. \n\nWhile I am bummed that the house is no longer white, it isn't really my place to judge the owners on whatever color they decide to paint the house. After all, it is THEIR house. Just try to look pass the color of it and the new trees and gate and just enjoy the fact that this house was part of an iconic TV show. \n\nThe Tanner family might not be here to welcome you, but you'll always be able to take a picture right outside of the house and be able to say \"Yeah, I saw that in person. What up?\" Hehe.", "author": "Venus L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-08", "description": "It looks like the owner now is painting it back to its original colors? I'm unsure but that's definitely what I'm hoping for. When I went it was boarded up look like it was under construction and being painted. I will have to go back when it's done.", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Gran memorias. La casa me entanta. Por favor no abusen de la case. Peace out. Theres good restaurants around.", "author": "Armando C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-30", "description": "I hit this up on my walk to Golden Gate... it was really confusing to me since they painted it purple and didn't think i was at the right spot, but then i knew it was right when i saw the circus of cars parked outside the house stopping to take photos.  Mehh... it was an experience i guess.", "author": "Kevin P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-20", "description": "Definitely cool to check it off the list. But a total bummer that the current occupants painted the house to a polar opposite color of what it was on the show and there is an extremely tall tree in front of it.", "author": "Lani B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-28", "description": "Definitely a must see if you grew up watching Full House! But now that it's painted it looks so different! Kind of disappointing.  Maybe the current owners are trying to deter the tourists. We rode bikes to the street & then walked because it is VERY hilly- and they are steep hills to walk up. There were a few groups of people checking out the house but it wasn't too crazy. I would recommend driving or using Uber if you aren't looking for a workout!", "author": "Kimberly K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-06", "description": "You wouldn't know this was the Full House house if you were driving by, you have to drive slow and look for it. A big tree has grown infront of the house making it harder to see from the street.", "author": "Veronica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-26", "description": "My childhood dream, they did put a fence and painted the house which is sad but understandable but it was nice car to at least go see it and take a quick selfie but other than that you can't do nothing else", "author": "Johana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "Who's not a fan of Full House!? It was so cool to see the home in person as this was definitely one of my favorite childhood movies. I also heard it recently went up for sale!", "author": "Alison V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "If you grew up in the 90s and are visiting SF, this might be your while. However, it doesn't bare much resemblance to the iconic TV intro anymore. The paint is all different and the landscaping hides a lot of the view. Still, you can say you were there..", "author": "Jon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "My lady grew up watching Full House so this was on the list of attractions to see. It brought a huge smile to her face to see the home in person. It looks a lot better now than it did in the 80's. There were about 20 other people during her less than 5 minute selfie session. I dropped my lady off and looped around the block. The look on her face was priceless.", "author": "Matthew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "This is a fun little piece of San Francisco pop culture. GPSing the address definitely work but  you can also just follow the tourists. It's about a block away from the Painted Ladies and there is usually a crowd standing in front of it taking photos. This is a private house so you can't go inside, but it's kind of fun to walk by!", "author": "Kari G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-08", "description": "Unless you're a die hard fan of the show \"Full House\", this can be skipped.  Sure, it along with the other Victorian homes in the area are nice, but why waste so much time looking for this particular one.  You'll find it in the middle of Broderick St between Bush and Pine Streets.  Have fun if you must.", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-14", "description": "Don't bother going it doesn't look anything like the house you see on tv. They painted it blue so you barely even notice the house now.", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-09", "description": "Never watched an episode of Full House since it was before my time lol however hubby wanted to see the Full House house and I had thought that it was one of the Painted Ladies by Alamo Square however it was wasn't.\n\nWe walked over to the Full House House from Alamo Square which took us around 20 minutes by foot. Hubby advised that they had painted the house as it was originally white on the show? There's not much to see as it is just a house. We took so photos from across the street as this is someone's residence.\n\nI felt bad for people that are living there considering that there was a gate at the bottom of the steps - people were still opening the gate to take photos on the porch and by the door etc. Sure it's considered a \"tourist\" landmark in San Francisco - we as tourists still have to respectful and be mindful other people's residences/living space. There were also a lot of young kids running up and down the neighbour's porch...", "author": "Whitney B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "Found the house! This used to be my favorite show growing up and even though I watched so many re-runs I could re-watch them all again! So glad we were actually able to find the house and get a picture in front of it.", "author": "Diana W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "Havvvveeee Mercy!\n\nIf you grew up watching 'Full House' like most 90's kids, you can't miss a trip to the Full House house!  It's even on Google Maps.. hahaha!  My friend and I were thoroughly convinced that this house is one of the Painted Ladies, but alas... it is not. And if you are walking, like we did through San Francisco to find it, remember all those hills.  I wonder if the owners of this house get sick of all the people coming by and taking pictures of it. hahahah!  If I were them, I'd put up a cardboard cut out of Danny Tanner in the window!", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "I felt a little weird going to a house to take pictures where someone actually lives, but oh well. Its a super pretty house but looks nothing like it did on the tv show! Still recommend going to it for a few minutes to say you've been there. However, remember someone actually lives there so don't stay too long!!", "author": "Amanda N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-26", "description": "It was cool to see the house however it looks so different now with it being painted. I never realized how many people didn't know they didn't actually film inside the house. Worth the see.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-05", "description": "I rate this 3 stars because when I went, it was trouble finding because it was painted! if you want to see the house you expected, than I wouldn't bother driving to it. Other than that, it was pretty great experience. Beautiful house otherwise!", "author": "Lola A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-29", "description": "It was a dream come true to visit the Full House house with my husband, since we grew up watching Full House. The house is NOT part of The Painted Ladies, though many (including us) think or thought it is. The house is snuggled in between other houses and it has a tree blocking it, so you have to get up close to it.", "author": "Margaret P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "great to take pictures! It was really cool the see the Full House house. It was crowded at all. Make sure you are looking at the right house", "author": "Marina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-24", "description": "Definitely cool to see but totally not what I expected and underwhelming.  It's just a house, which someone clearly lives in and the area that it's in is not what I expected.  From the intro of the show, you picture the house along the bay... Which it's not.  Cool to see though.", "author": "Sapna D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "House is a different color and looks even more gorgeous! You really don't have to look very hard to find it, as there's always people taking photos in front of it :)", "author": "Abida S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Not the house in the beginning opening. But is the house they used for filming. Cool drive by. Navigation went crazy when trying to find this place, so we drove in circles before finding it.", "author": "Lin D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-01", "description": "The door is not red anymore, it is black.  Across the street is another row of homes, not the park seen in the \"Full House\" opening (that's Alamo Park, and you have to drive to get there from here).\n\nThis is worth seeing if you were a Full House fan, and if you're in the neighborhood.  We agreed that we'd stop by on our way back from Sonoma, after spending some time at the Golden Gate Bridge.  As a tourist, there didn't seem to be much for us to do in this neighborhood, and that's how we best fit it in.\n\nI wouldn't go out of my way to see this.  I wouldn't recommend it to a friend traveling to San Francisco, because there is so much more to see in the area.", "author": "Angela P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "The house is painted purple now. Still cool to see! We walked from the painted ladies to the house. Would not recommend the walk.. About a mile through not the greatest part of town. No need to spend more than 15 minutes here.", "author": "Audrey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-12", "description": "I've always loved Full House and visiting this house was definitely on my bucket list. I was glad to finally see it, despite the new paint job. The \"no trespassing\" sign is gone so it's less hostile lol. Their neighbor pulled up while I was taking a picture and they mentioned that the owners of the house switched doors with a neighbor, I guess in an attempt to confuse visitors. Regardless, the inner 90's kid in me definitely came out when I got there :)", "author": "Yasmin Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-08", "description": "Just keep the sight in your memory. Don't ruin it by going to visit the house. Super disappointing.", "author": "Adrian And Jacob V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-02", "description": "Took my friends that were visiting here.  Umm...so this is the house that the zoom into.  It is not the house at Title Sequence and Opening Credits.  There aren't any parking around if you plan on driving, just do a drive by picture.\n\nThese http://www.flickr.com/photos/vinu287/3129319863/  are located at Alamo Square.", "author": "Trynh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "Found out about where it was and had too go. Grew up watching this show and when coming here I knew I had to find this house. The color changed and isn't the same as how it was in the show but was worth going to be able to say that I've seen the house.", "author": "Alexa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-21", "description": "The best part of visiting the Full House House is the excitement leading up to it. We shared stories of our favorite episodes, my crush on John Stamos, and the devastation of The Horse Incident. \"Did you know Steve was Aladdin?\" \"Whaaaat?!\" and so on. But once you get to the house, everything changes ...\n\nI mean, y'all know what it is. It's a house. BUT IT'S SO MUCH MORE. Even though it has changed (I mean, whatever happened to predictability?), you still have to take a trip to see the house the Tanners built.\n\nI felt a little stalker-ish, because it's obviously lived-in and I guess the current residents don't appreciate the house's roots in 90s pop culture? It has been painted a much darker color, and if it wasn't for the NO TRESPASSING sign in front, I wouldn't have known we were in the right place.\n\nSomeone came out of the garage while we were there, and started sweeping the street debris while looking straight at us. It was kinda creepy, to be honest, and I got really uncomfortable to take my obligatory picture! Soooooo, we got in the car and circled the block for a drive-by. Now, I realize that I took myself out of a creepy situation to become even creepier, but I digress. Ah, the things you do to realize your childhood dreams ...", "author": "JoAnna D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-22", "description": "Saw it, don't need to see it again.  Not that I expected the house to completely blow my mind.  I definitely got to stand there looking at it remembering all the days that I would come home from school and watch the show.  Contrary to popular belief, this is NOT the house from the opening park scene.  Those are the painted ladies and the park is right across the street.  We went to the house first (Also, the house from Mrs. Doubtfire is very close to the Full House house), then immediately went to see the painted ladies.  Also contrary to the other reviews, parking was a piece of cake.  You can park a block or so away from each of these destinations and walk there easily.  Enjoy!", "author": "Brian H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-06", "description": "You can't see the house fully because there are several trees covering the house. Best way to get there is by walking. There's no parking.", "author": "Ethel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-25", "description": "I don't get it. There are bad reviews because it is \"just a house\". Of course it's just a house, what more did you expect?\n\nNot only is this the Full House house... It's also the street shown on countless movies to set the location in your mind of San Francisco. The entire street is a must see if you're in town.\n\nJust don't understand how people can be disappointing with coming here, in the end... yes it's just a house.. But what else more do you expect?", "author": "J F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-03", "description": "Well it's a house... thought there would be a park right in front of the house but apparently they filmed that part when the family was at a picnic. Underwhelming to say the truth, I feel bad for the people that live in that house and have to put up with people stop by every 10 minutes lol\n\nBTW: they painted the house purple in case you have a hard time figuring out which one it is", "author": "Clyde A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-11", "description": "To summarize all the reviews: This is the house from Full House. This is an actual house and people live in it. You may be disappointed that it is just a house, and you may be disappointed to discover there is now a tree outside the house. You may also be disappointed that it is not more conveniently located, especially if your girlfriend dragged you there.\n\nI was not disappointed; I wanted to walk by the house from Full House and this is indeed the Full House house. The picture I took of this house got over 30 likes on Facebook and Instagram, and that's at least ten more likes than my photos from Fisherman's Wharf. Plus, now I can say I've been to the Full House house, a fact that may come in handy in future conversations.", "author": "Dan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "Parking is difficult. Have to cross street to get pic of entire house. Go during the day. It's definitely the house!", "author": "K F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "Just a house. Looks different now. So lost it's appeal. Still cool to stop by and see.", "author": "Tes T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-04", "description": "It was the house from the show but it looks like they painted the door. Also the door was locked and i couldn't get in. We tried opening the windows and they were locked too. But it wasn't worth it since all the furniture and sets had been changed or replaced with new stuff. \n\nI'm not sure how they filmed the show in there because it didn't look as spacious as it did in the show (if you are the owner: it would be way easier to tell if the doors weren't locked). We went around back and the kitchen must have been totally redone. It looked NOTHING like it did on the show and this was really disappointing because that was my favorite place to enjoy the Tanners' lives. Really wish we could have made it inside but all the doors in the back were locked too. To be fair we showed up a little late and it was dark so maybe it was after they closed for the day but there were lights on inside!\n\nglad i went but i'm not sure i would go back on my next visit.", "author": "Dan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "Visited the Full House house because my boyfriend's friends from Canada wanted to see it...\n\nThey painted it.\n\ntherefore.. the Full House house isn't the same.", "author": "Monica H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-21", "description": "I was a little disappointed when we drove up because I was expecting to see the park in front and the house is now painted purple but my cousins from Seattle seemed to be excited by it.  ;) My 10 year old cousin is a big fan of Full House so it was a big deal for her to see it and take pictures in front of it.  There's nothing special, just a house so don't waste your time unless you're a huge fan of the show.", "author": "Isela E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-24", "description": "HOW RUDE...! We first visited The Painted Ladies. After a couple of minutes, we quickly realized that this was NOT where the Full House house was located. Ahhh!!! Thanks to Yelp, we located the actual address, called for a Lyft, and headed there excited to see the house we all grew up wishing we lived in. We were fortunate to arrive to a relatively quiet scene, with only a couple of other fans taking pictures. As we double and triple checked the address, we came to the heart breaking realization that although this was in fact the right house, it was the WRONG house - the exterior facade and colors have been changed so significantly that it is almost unrecognizable. Others began arriving at the scene and we all lamented the changes that have been made. Don't get me wrong. The house is or I should say would be beautiful if it were any other house. It's just not THE beautiful Tanner house we expected to see. Nonetheless, if you grew up watching and loving Full House, it is a must see in SF.", "author": "Tash L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-31", "description": "It's purple now :( A must see touristy spot in SF if you loved the show (which I definitely did growing up), but don't expect to see the same house shown in each episode. And beware cause there's a no trespassing sign hanging across the entrance.", "author": "Kim D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Me and a friend took our kids to see the full -house (House) last week it looks so different now then the tv show series. They have a gate that goes over the steps and the color of the house has changed.", "author": "Monique C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-03", "description": "We had to take a 45-minute detour through San Francisco just so my wife could see the Full House house. It was definitely the house from the show, but there's not really much more to say about it than that. At least it satisfied my wife's need for childhood nostalgia.", "author": "Jared K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-27", "description": "This was fun.  I mean your just checking out a house so it is really quick and then you can check out the painted ladies.", "author": "Brent S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-21", "description": "Nothing spectacular just someone's house now that def doesn't like trespassers!  Cute little street in SF!", "author": "Lyndsi W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-13", "description": "Yeah, that picture does it just about right! This is the house that's the facade from Full House. You'll be dreadfully confused if you think you're going to see the Painted Ladies, though to be fair, there are a lot of houses that are reminiscent of the Painted Ladies in the Pacific Heights neighborhood!\n\nFor the die-hard fans: a must do.\nFor the rest of us: interesting, but not worth going out of your way for.", "author": "Valerie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-06", "description": "(This review is for Alamo Square row houses- the opening shot of the show.) \n\nPretty underwhelming, especially since they a) have been painted and don't look the same as the show or the pictures of them on TV and b) they don't look nearly as good as the pictures and post cards you always see. There are too many interesting/beautiful/quirky things to see in San Francisco to waste your time on this forgettable site. If you DO have out of town huests who insist on going, couple it with a lunch somewhere in Hayes Valley or a trip to the food trucks a couple of blocks south.", "author": "Greg J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-22", "description": "Full House has been my favorite show since i was about 8 years old. i have seen every episode and know all the lines from every episode, i dominate anyone at full house trivia =) i came here on a whim. the house was recently painted, i guess there trying to discourage people from coming here, thats never going to happen, the show was too big and great, i went on a monday afternoon about noon and there were 5-10 people taking pictures and posing in front of the house. the door has not been red for some time. i hope they keep the reruns going for a long long time, i still watch this show daily and it never gets old.   jesse and the rippers forever!!!! have mercy!", "author": "Lee W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "It is what it is. Pretty easy to park. Pretty easy to find. Get your picture and respect its cultural significance. I give it a 4 because there isn't much to it.", "author": "Pete K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-06", "description": "Two stars because whoever owns it now decided it would be awesome to ruin history by painting the house blue. Thanks a lot inconsiderate jerks. I bet they'd paint the Golden Gate Bridge blue if they had a chance.", "author": "John S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-24", "description": "It looks like it's been repainted several times... to blend in more. If you're gonna buy the Full House house, you'd think you'd be loud and proud about it... maybe that's just me. It's a house, it's nice, that's all.", "author": "Mahsa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "I'm not sure when it was painted, but I just visited the house yesterday and it is a completely different color (blue to be exact). Just doesn't have the same \"Full House\" feel. \nOh well, it was still cool to see the house.", "author": "Josh D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-28", "description": "My friend and I were lucky enough to find parking right in front of the house because we went there really early around 7-8am. The dead tree in the front is covering the majority of the house :( I still enjoyed it because that was one of the main things I wanted to see in San Fran.", "author": "Jen J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-19", "description": "Was very touching to see the house, take some pic, i would be nice if we could go inside but there is actual ppl that live there now, thats the only reason i give it a 3 stars!", "author": "Ny N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "Being a huge fan of the show, I had to stop by on my most recent trip to San Fran! It doesn't look the same at all but it was still really cool to see. There's not a park across the street just FYI. It's more houses. But still glad I got to see the house!", "author": "Nikki D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "These other reviews are way off base and just flat out wrong! I had A BLAST and the house did not disappoint.\n\nThe Full House House was my main selling point when convincing the family that we should take a cross-country road-trip. I have a few skeptics in the family (Brandon) but even they agreed that it was worth the long hours in the car. Needless to say, I'm a HUGE House fan, and I've practically modeled my life after the Tanners.  \n\nSeeing the House IRL was unreal!  This was literally a dream come true.  I felt like I had walked right into the TV set! We spent the first day just taking photos with the House and sitting on the steps! Day two involved acting out some beloved scenes from the show in front of the house. I didn't want to go and I literally had to be dragged away from this beloved piece of american TV history!\n\nWe even got to cross the big red Full House bridge into  SF that is featured in shows intro! A perfect trip!\n\nHighly recommend if you can afford it. \n4 out of 5 stars!\n\n\"When you're lost out there and your all alone\nA light is waiting to carry you home\nEverywhere you look.\"\n\n**Note:\nThe House lost a star from my rating for two reasons. \nFirstly because someone decided it was a good idea to paint the iconic red door black... which is completely insane and a bummer for obvious reasons. Also the people living at the house were very unfriendly and rude. I mean if you are going to live in a famous house you should at least be a nice person. \nAnd my second reason was because this kind of a trip can be prohibitively expensive if you are coming from the East coast. Between gas prices and the time my Wife and I took off work, we ended up pretty deep in the hole. \nBut those are very minor complaints when were talking about something as awesome as seeing the Full House House in real life!", "author": "Alan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-04", "description": "Stupid don't go. We waited FOREVER for the family that lives there to come outside and they are not like the Full House family in ANY way nor are any of the neighbors recognizable. Some idiot painted the front door so it barely even looks like the 3 second clip from the opening of Full House. Wasn't even worth posting the pictures of the family to facebook, what a bust.", "author": "Ben O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "The Full House house is a landmark lol!  It is sad to see that the color has changed to purple, but it was still awesome to see it in person and reminisce about the good ol' Full House days.", "author": "Mindy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-25", "description": "A house is a house is a full house. What?\n\nI like looking at the pictures above and seeing the evolution of trespassing prevention enacted by the occupants. From no barricade to chain to fence with \"No Trespassing\" sign.", "author": "Greg W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "Checked this off my bucket list! I am a huge Full House fan, so this was definitely worth checking out. The only thing is it doesn't have the red door anymore and you can't sit on the steps. My friend and I took a few pictures and were on our way! Didn't see Kimmy Gibbler across the street though...", "author": "Jillian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-18", "description": "It's cool to see the actual house that was aired on \"full house\". Yes,  it has been painted and there is a tree in front.  However,  this house has people living in there. Can't complain, it is a must see at least once if you are around the area.", "author": "Ly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-04", "description": "really cool to see the house in person, my husband were in the city killing time before dinner and a show and we decided to drive by. It's fun to see this kind of stuff but totally not what we were thinking it would look like or where the location would be. We thought there would be a park close by like the show had. Not sure how they decided on the house but like i said it was neat to see! They for sure painted the home since.", "author": "Brittany E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "Feeling nostalgic, we not only visited Mrs Doubtfires home, but we finished our explorations to The Tanner home from Full House. The color of the house changed, but to have the memories of your childhood in front of your eyes, was priceless!", "author": "Charley B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-25", "description": "Going to San Francisco as a tourist and being able to see your childhood tv show in the famous house the \"Tanners\" lived in gets you excited; not the case once you arrive. Arrived at the so call famous house and the house in general isn't the problem the REAL PROBLEM, watch out for the blonde little mermaid Ursula's twin sister witch (drop the w and exchange it for a b please) tenant or whoever she is that lives there) I'm sorry but if your going to live in a famous property one should be proud of it. Not the case with the sac of old booted bones that came out and yelled at my family \"this is private property: OFF\" umm ok sorry \"no not sorry \"OFF\" yep not the type of image or sour taste in your mouth you want I didn't even want to take a picture anymore. Honestly if the owner or tenant reads this review word of advice \"YOU LIVE IN A PROPERTY THAT WILL ENCOUNTER TOURIST ALL THE TIME!!!\" Be humble and respectful when a tourist wants to take a quick picture as opposed to yelling like a dealing banshee into the night! We're not asking you to see the inside of your house nor are we asking for charity. It's called manners and unfortunately you have none.", "author": "Leslie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "the house is definatley worth seeing if you always watched the Full House show! it's so cute & it brings back memories from watching the show. although it's not the same color as it was, it's still something pretty neat to check out while your in San Francisco. don't leave without seeing it!!", "author": "Sarah H."}
